[{
    "name": "Δημήτριος  Πάντος",
    "romanize name": "Dimitrios  Pantos",
    "School-Department": "Electrical Engineering",
    "University": "State University of New York at Buffalo",
    "Rank": "Professor",
    "Apella_id": 4330,
    "Scholar name": "Dimitris A Pados",
    "Scholar id": "tczyXJUAAAAJ",
    "Affiliation": "Schmidt Chair Professor of ECE and CS; Director, Center for Connected Autonomy and AI; FAU",
    "Citedby": 4779,
    "Interests": [
        "Communications Theory and Systems",
        "Machine Learning and Artificial Intelligence"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=tczyXJUAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Scalable video transmission over wireless DS-CDMA channels using minimum TSC spreading codes",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1336838/",
            "Abstract": "In this letter, we report results on the relative performance of scalable video transmission via a single-rate or a multirate direct sequence code-division multiple-access channel using minimum total squared correlation spreading codes. Our findings demonstrate the superiority of the multirate system on a wide range of chip rates of practical interest.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and Experimental Evaluation of an Active Underwater Inflatable Co-prime Sonar Array (UICSA)",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8962866/",
            "Abstract": "We consider underwater target detection by using a novel active, self-contained and rapidly deployable underwater inflatable co-prime sonar array (UICSA). In particular, we measure the received signal strength (RSS) and angle-of-arrival (AoA) of acoustic signals reflected by an underwater target. Measurements from different positions of the transmitter with respect to the UICSA are organized in a three mode real-valued tensor. Then, the conformity of each entry with respect to all other data points in the tensor is calculated based on recursively refined calculations of L1-norm tensor subspaces. Conformity values are then used for the detection of an underwater target. We evaluate the data conformity of RSS and AoA recordings acquired from the testbed deployment of a seven-element UICSA prototype and three underwater acoustic transmitters at Florida Atlantic University. We show for the first time that conformity …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:6YFk0eKgftsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FFT calculation of the L1-norm principal component of a data matrix",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165168421003236",
            "Abstract": "This paper presents a fast approximate rank-1 L1-norm Principal Component Analysis (L1-PCA) estimator implemented in the Fourier domain. Specifically, we first rephrase the problem of rank-1 L1-PCA estimation as a cyclic shift parameter estimation and then we present an algorithm for estimating the first L1-norm Principal Component (L1-PC) in the Fourier domain, practically using FFT. The proposed method is shown to be asymptotically efficient and our numerical studies corroborate its performance merits.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:x7obfLuV8acC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Auxiliary-vector RADAR on MCARM data",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4487593/",
            "Abstract": "Derived from statistical conditional optimization criteria, the auxiliary-vector (AV) detection algorithm starts from the target vector and adding non-orthogonal auxiliary vector components generates an infinite sequence of tests that converges to the ideal matched filter (MF) processor for any positive definite input autocorrelation matrix. When the input autocorrelation matrix is replaced by a conventional sample-average estimate, the algorithm effectively generates a sequence of estimators of the ideal matched filter that offer exceptional bias/covariance balance for any given finite-size observation data record. In this work, the AV algorithm is evaluated on collected airborne phased-array radar data from the MCARM program and is seen to outperform in probability of detection (for any given false alarm rate) all known and tested adaptive detectors (for example AMF, generalized likelihood ratio test, the multistage Wiener …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust Spread-Spectrum Communications Over Non-Gaussian Channels. Adaptive Disturbance Suppression With Small Data Support",
            "Publication year": 2001,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA389200",
            "Abstract": "Based on the theory of locally optimum detection we identified a spread-spectrum receiver architecture that consists of an adaptive non-linear chip-level pre-processor followed by an adaptive linear filter post-processor. The non-linear front-end protects against impulsive, non-Gaussian disturbance. The adaptive linear filter post-processor suppresses unknown highly correlated spread-spectrum SS interference. To achieve adaptive, rapid, and effective SS interference suppression from a small number of input observations, we defined a new class of linear filters that we called Auxiliary-Vector AV filters. We view this development as a breakthrough in the field of adaptive signal processing theory. When the input autocorrelation matrix is unknown and estimated from a limited set of input data as in all real-life adaptive signal processing applications, Auxiliary-Vector filters are shown to outperform all other filter estimator means in the literature. We addressed successfully the critical problem of determining an automated, theoretically derived, rule for the selection of the best number of auxiliary vectors AVs for a given data record of input observations. We anticipate that this development will attract a great deal of interest in the Auxiliary-Vector filtering technique. Based on the principles of AV-filtering we proposed and analyzed theoretically structures that are self-synchronized in the sense that adaptive synchronization and demodulation are viewed and treated as an integrated receiver operation. As a major application, we addressed the problem of navigation data demodulation by an adaptive jam-resistant GPS receiver that utilizes a bank of linear-tap …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:SP6oXDckpogC",
            "Publisher": "STATE UNIV OF NEW YORK AT BUFFALO AMHERST"
        },
        {
            "Title": "L1-fusion: Robust linear-time image recovery from few severely corrupted copies",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7350995/",
            "Abstract": "We address the problem of recovering an unknown image of interest, when only few, severely corrupted copies are available. We employ, for the first time in the literature, corruption-resistant L 1 -Principal-Components (L 1 -PCs) of the image data-set at hand. Specifically, the calculated L 1 -PCs are used for reliability-based patch-by-patch fusion of the corrupted image copies into a single high-quality representation of the original image (L 1 -fusion). Our experimental studies illustrate that the proposed method offers remarkable recovery results for several common corruption types, even under high corruption rate, small number of copies, and varying corruption type among copies. An additional theoretical contribution of this work is that the L 1 -PC of a data matrix of non-negative entries (e.g., image data) is for the first time shown to be optimally calculable with complexity linear to the matrix dimensions - as of now …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:2u1QkWOsl3MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cognitive code-division channelization",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5699836/",
            "Abstract": "We consider the problem of simultaneous power and code-channel allocation for a secondary transmitter/receiver pair coexisting with a primary code-division multiple-access (CDMA) system. Our objective is to find the optimum transmitting power and code sequence of the secondary channel that maximize the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum SINR linear receiver, while at the same time the SINR of all primary channels at the output of their max-SINR receiver is maintained above a certain threshold. This is a non-convex NP-hard optimization problem. We propose a novel feasible suboptimum solution using semidefinite programming. Simulation studies illustrate the theoretical developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Outlier-resistant data processing with L1-norm principal component analysis",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-10-6704-4_6",
            "Abstract": "Principal Component Analysis (PCA) has been a cornerstone of data analysis for more than a century, with important applications across most fields of science and engineering. However, despite its many strengths, PCA is known to have a major drawback: it is very sensitive to the presence of outliers among the processed data. To counteract the impact of outliers in data analysis, researchers have been long working on robust modifications of PCA. One of the most successful (and promising) PCA alternatives is L1-PCA. L1-PCA relies on the L1-norm of the processed data and, thus, tames any outliers that may exist in the dataset. Experimental studies in various applications have shown that L1-PCA (i) attains similar performance to PCA when the processed data are outlier-free and (ii) maintains sturdy resistance against outliers when the processed data are corrupted. Thus, L1-PCA is expected to play a …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:lBZ7XAAYe3oC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "Code-search for optimal TSC binary sequences with low cross-correlation spectrum",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1290323/",
            "Abstract": "It has been shown that signature (multi) sets that meet Welch's lower bound on the total squared correlation (TSC), maximize the sum capacity of the synchronous code division multiple access (CDMA) channel with equal average input energy constraints. However, a signature set that is TSC-optimum (i.e. achieves the lower bound on TSC), doesn't necessarily have a low cross-correlation spectrum. Hence, for various system loads there may be users that experience high probability of error due to high cross-correlation of their assigned signature to others in the set. In this paper we present a search method to obtain new optimum TSC binary signature sets with low cross-correlation spectrum. We also show, based on our search method, that if we relax the TSC optimality constraint, codes with better cross-correlation spectrum may be found. In addition, a catastrophic binary code (i.e. a code having complementary …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:WTSGYGHz1bkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Waveform design for secure SISO transmissions and multicasting",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6584943/",
            "Abstract": "Wireless physical-layer security is an emerging field of research aiming at preventing eavesdropping in an open wireless medium. In this paper, we propose a novel waveform design approach to minimize the likelihood that a message transmitted between trusted single-antenna nodes is intercepted by an eavesdropper. In particular, with knowledge first of the eavesdropper's channel state information (CSI), we find the optimum waveform and transmit energy that minimize the signal-to-interference-plus-noise ratio (SINR) at the output of the eavesdropper's maximum-SINR linear filter, while at the same time provide the intended receiver with a required pre-specified SINR at the output of its own max-SINR filter. Next, if prior knowledge of the eavesdropper's CSI is unavailable, we design a waveform that maximizes the amount of energy available for generating disturbance to eavesdroppers, termed artificial noise (AN …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Insertion, Detection, and Extraction of Messages Hidden by Optimal Multi-Signature Spread Spectrum Means",
            "Publication year": 2015,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA621874",
            "Abstract": "We carry out optimized spread-spectrum data embedding in a given digital image or audio, or video sequence. First, the overall imagehost medium is pre-processed into transform-domain small blocks from which host vectors are obtained via zig-zag scanning vectorization. Multiuser data embedding is performed in the generated host vectors. Under this data embedding model, we calculate an orthogonal set of embedding spread-spectrum signatures that achieves maximum sum signal-to-interference-plus noise ratio sum-SINR at the output of the linear-filter receivers for any fixed embedding amplitude values. Then, for any given total embedding distortion constraint, we present the optimal multi-signature assignment and amplitude allocation that maximizes the sum capacity of the embedding procedure. The practical implication of the reported results is sum-SINR, sum-capacity optimal multiusermulti-signature spread-spectrum data embedding in the digital medium. Extensive experiments that we carried out demonstrate the effectiveness of the proposed methods. The problem of extracting blindly data embedded over a wide band in a spectrum transform domain of a digital medium is also considered.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:yeKNu01O_4gC",
            "Publisher": "STATE UNIV OF NEW YORK AT BUFFALO RESEARCH FOUNDATION"
        },
        {
            "Title": "Sparse waveform design for secure lpd/lpi underwater acoustic communications",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8604506/",
            "Abstract": "Harsh underwater acoustic (UW-A) channel conditions make reliable and secure underwater communications difficult to achieve. It is desirable to improve the physical layer security of the underwater acoustic channel by imparting the eavesdropper's interception efforts in the first place. In this work, we propose to design LPD/LPI waveforms that minimize the likelihood that a confidential message, transmitted between a pair of trusted underwater nodes, is intercepted by an eavesdropper. In particular, if the location of the eavesdropper is known or can be projected and prior knowledge of the channel channel state information (CSI) is available, we optimize the transmit energy and alphabet of all-spectrum sparse-binary waveforms to minimize the signal-to-interference-plus-noise ratio (SINR) at the output of the eavesdropper's maximum-SINR filter. In more practical applications, where the eavesdropper's CSI is not …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:rwEhk56xNqMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Outlier processing via L1-principal subspaces",
            "Publication year": 2017,
            "Publication url": "https://www.aaai.org/ocs/index.php/FLAIRS/FLAIRS17/paper/viewPaper/15536",
            "Abstract": "With the advent of big data, there is a growing demand for smart algorithms that can extract relevant information from high-dimensional large data sets, potentially corrupted by faulty measurements (outliers). In this context, we present a novel line of research that utilizes the robust nature of L1-norm subspaces for data dimensionality reduction and outlier processing. Specifically,(i) we use the euclidean-distance between original and L1-norm-subspace projected samples as a metric to assign weight to each sample point,(ii) perform (K= 2)-means clustering over the one-dimensional weights discarding samples corresponding to the outlier cluster, and (iii) compute the robust L1-norm principal subspaces over the reduced “clean” data set for further applications. Numerical studies included in this paper from the fields of (i) data dimesnionality reduction,(ii) direction-of-arrival estimation,(iii) image fusion, and (iv) video foreground extarction demonstrate the efficacy of the proposed outlier processing algorithm in designing robust low-dimensional subspaces from faulty high-dimensional data.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:C-SEpTPhZ1wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The maximum squared correlation, sum capacity, and total asymptotic efficiency of minimum total-squared-correlation binary signature sets",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1377515/",
            "Abstract": "The total squared correlation (TSC), maximum squared correlation (MSC), sum capacity (C/sub sum/), and total asymptotic efficiency (TAE) of underloaded signature sets, as well as the TSC and C/sub sum/ of overloaded signature sets are metrics that are optimized simultaneously over the real/complex field. In this present work, closed-form expressions are derived for the MSC, C/sub sum/, and TAE of minimum-TSC binary signature sets. The expressions disprove the general equivalence of these performance metrics over the binary field and establish conditions on the number of signatures and signature length under which simultaneous optimization can or cannot be possible. The sum-capacity loss of the recently designed minimum-TSC binary sets is found to be rather negligible in comparison with minimum-TSC real/complex-valued (Welch-bound-equality) sets.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Minimum-distortion data embedding in video streams",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6884045/",
            "Abstract": "We investigate the problem of embedding data in raw video sequences with minimum video mean-square distortion for any required data recovery error rate. In particular, for any given video frame sequence and any (block) transform domain of interest, we find the optimal carrier and scalar parametrized linear operator on the video data that maximize the output signal-to-interference-plus-noise ratio (SINR) of the maximum-SINR data receiver filter or, equivalently, minimize the average embedding distortion for any target message extraction error rate. The procedure is extended from single-carrier to multi-carrier (multiple messages) embedding. As a practical consideration, a sub-optimal computationally efficient embedding algorithm is also proposed. Extensive experimental results demonstrate that sub-optimal embedding as described has video distortion versus data extraction error rate performance comparable …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:uGrg30pLAbkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Topological and MAI constraints on the performance of wireless CDMA sensor networks",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1354499/",
            "Abstract": "In this paper, we characterize analytically the multiaccess interference (MAI) in wireless CDMA sensor networks with uniformly random distributed nodes and study the tradeoff between interference and connectivity. To provide a guideline for improving system behavior, three competitive deterministic topologies are evaluated along with the random topology in terms of link-level and network-level (routing) performance. The impact of the signature code length and the receiver design on network performance for different topologies is also studied.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Minimum total-squared-correlation quaternary signature sets: new bounds and optimal designs",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5351662/",
            "Abstract": "We derive new bounds on the total squared correlation (TSC) of quaternary (quadriphase) signature/sequence sets for all lengths L and set sizes K. Then, for all K, L, we design minimum-TSC optimal sets that meet the new bounds with equality. Direct numerical comparison with the TSC value of the recently obtained optimal binary sets shows under what K, L realizations gains are materialized by moving from the binary to the quaternary code-division multiplexing alphabet. On the other hand, comparison with the Welch TSC value for real/complex-field sets shows that, arguably, not much is to be gained by raising the alphabet size above four for any K,L. The sum-capacity (as well as the maximum squared correlation and total asymptotic efficiency) of minimum TSC quaternary sets is also evaluated in closed-form and contrasted against the sum capacity of minimum-TSC optimal binary and real/complex sets.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive Digital Signature Design and Short-Data-Record Adaptive Filtering",
            "Publication year": 2008,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA481473",
            "Abstract": "This report covers the research performed to create and develop a digital signature design analysis and development methodology that will support robust multi-user communications in rapidly changing environments. Short-data-record adaptive filtering analysis and development was also performed to support the multi-user signature design algorithms in terms of its performance in and application to multiple-input-multiple-output MIMO systems.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:SdhP9T11ey4C",
            "Publisher": "NEW YORK STATE UNIV RESEARCH FOUNDATION AMHERST NY"
        },
        {
            "Title": "Multiuser transmit beamforming under total transmit power constraint",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1605715/",
            "Abstract": "We consider a wireless downlink multiuser multiple-input single-output (MISO) system and we investigate the problem of jointly optimal beamforming and power allocation. In particular, under a total transmit power budget constraint and either exact or second-order statistics knowledge of the channel of all users we find the optimum set of beam vectors and associated power values such that the sum-rate between the base station and the end users is maximized. Then, we formulate and solve two variations of the above optimization problem as a low and high signal-to-interference-plus-noise ratio (SINR) approximation, respectively. To solve all optimization problems, we invoke the theory of uplink-downlink duality and derive computationally simple, coupled iterative procedures with guaranteed convergence",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On linear block codes and deterministic compressive sampling",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8365/836506/On-linear-block-codes-and-deterministic-compressive-sampling/10.1117/12.920180.short",
            "Abstract": "We suggest and explore a parallelism between linear block code parity check matrices and binary zero/one measurement matrices for compressed sensing. The resulting family of deterministic compressive samplers renders itself to the development of eective and ecient recovery algorithms for sparse signals that are not ℓ1-based. Experimental results that we include herein demonstrate the utility of the presented developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:EUQCXRtRnyEC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Adaptive Multiuser MCDM for Underwater Acoustic Communications",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2003.01988",
            "Abstract": "Chirp signals have been exploited extensively in radar and underwater acoustic (UW-A) communication systems for their robustness to multipath and superior correlation properties. We present a multiuser multicarrier chirp-division multiplexing (MU-MCDM) system which orthogonal chirp spread spectrum are utilized in frequency subcarriers for multiuser applications. Furthermore, orthogonal chirp transform (OCT) and discrete orthogonal chirp transform (DOCT) are developed for continuous and discrete implementations of MCDM systems. In addition, we design a maximum likelihood (ML) receiver capable of synchronization, channel estimation, and symbol detection. MU-MCDM systems consider factors, including preamble length, number of subcarriers, portion of pilots, guard period, and multiuser access scenarios to adapt time-variant UW-A channels. The bit-error-rate (BER) performance and adaptive transmission are evaluated in simulation studies. Therefore, we have demonstrated MCDM modulation systems in simulations that they improve performance of UW-A communications adaptively and support multiple users. Moreover, MCDM architectures can be applied in higher order modulations for providing higher transmission rates in UW-A channels.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:IX653JsL2_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cooperative Transmissions over Code Division Multiplexing Channels",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4454961/",
            "Abstract": "We consider the problem of signature waveform design for code division multiplexing in wireless collaborative relay networks. In contract to conventional randomly chosen orthogonal codes, we develop an adaptive signature design strategy under the maximum predetection signal-to-interference-plus-noise-ratio (SINR) criterion. We evaluate numerically and by simulations the bit error rate (BER) and outage probability of cooperative wireless transmissions over code division multiplexing channels. Two basic decode-and-forward relay network architectures are considered and state-of-the-art performance is demonstrated.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Video background tracking and foreground extraction via L1-subspace updates",
            "Publication year": 2016,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9857/1/Video-background-tracking-and-foreground-extraction-via-L1-subspace-updates/10.1117/12.2224956.short",
            "Abstract": "We consider the problem of online foreground extraction from compressed-sensed (CS) surveillance videos. A technically novel approach is suggested and developed by which the background scene is captured by an L1- norm subspace sequence directly in the CS domain. In contrast to conventional L2-norm subspaces, L1-norm subspaces are seen to offer significant robustness to outliers, disturbances, and rank selection. Subtraction of the L1-subspace tracked background leads then to effective foreground/moving objects extraction. Experimental studies included in this paper illustrate and support the theoretical developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:rAN7mHg6NlYC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Motion-aware decoding of compressed-sensed video",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6232453/",
            "Abstract": "Compressed sensing is the theory and practice of sub-Nyquist sampling of sparse signals of interest. Perfect reconstruction may then be possible with much fewer than the Nyquist required number of data. In this paper, in particular, we consider a video system where acquisition is carried out in the form of direct compressive sampling (CS) with no other form of sophisticated encoding. Therefore, the burden of quality video sequence reconstruction falls solely on the receiver side. We show that effective implicit motion estimation and decoding can be carried out at the receiver or decoder side via sparsity-aware recovery. The receiver performs sliding-window interframe decoding that adaptively estimates Karhunen-Loève bases from adjacent previously reconstructed frames to enhance the sparse representation of each video frame block, such that the overall reconstruction quality is improved at any given fixed CS …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal Algorithms for -subspace Signal Processing",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6851920/",
            "Abstract": "We describe ways to define and calculate L 1 -norm signal subspaces that are less sensitive to outlying data than L 2 -calculated subspaces. We start with the computation of the L 1  maximum-projection principal component of a data matrix containing N signal samples of dimension D. We show that while the general problem is formally NP-hard in asymptotically large N, D, the case of engineering interest of fixed dimension D and asymptotically large sample size N is not. In particular, for the case where the sample size is less than the fixed dimension , we present in explicit form an optimal algorithm of computational cost 2 N . For the case N ≥ D, we present an optimal algorithm of complexity O(N D ). We generalize to multiple L 1 -max-projection components and present an explicit optimal L 1  subspace calculation algorithm of complexity O(N DK-K+1 ) where K is the desired number of L 1  principal components …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:KPAPMsW7zc0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Direction finding by complex L1-principal-component analysis",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7227083/",
            "Abstract": "In the light of recent developments in optimal real L 1 -norm principal-component analysis (PCA), we provide the first algorithm in the literature to carry out L 1 -PCA of complex-valued data. Then, we use this algorithm to develop a novel subspace-based direction-of-arrival (DoA) estimation method that is resistant to faulty measurements or jamming. As demonstrated by numerical experiments, the proposed algorithm is as effective as state-of-the-art L 2 -norm methods in clean-data environments and significantly superior when operating on corrupted data.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:peNFRSk4lDYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind modulation detection via staged GLRT",
            "Publication year": 2018,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10646/106461R/Blind-modulation-detection-via-staged-GLRT/10.1117/12.2311929.short",
            "Abstract": "We present a two-stage generalized-likelihood-ratio test (GLRT) based procedure for the classification of modulation schemes with unknown signal parameters, such as frequency, amplitude, phase and symbol sequence. Extensive simulation studies presented in this paper demonstrate the efficacy of the developed scheme under limited observation for various PSK and FSK signals, including those with nested symbol constellations.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:ddB7do2jUx8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Meeting the Welch and Karystinos-Pados bounds on DS-CDMA binary signature sets",
            "Publication year": 2002,
            "Publication url": "https://repository.ust.hk/ir/Record/1783.1-698",
            "Abstract": "The Welch lower bound on the total-squared-correlation (TSC) of binary signature sets is loose for binary signature sets whose length L is not a multiple of 4. Recently Karystinos and Pados developed new bounds that are better than the Welch bound in those cases, and showed how to achieve the bounds with modified. Hadamard matrices except in a couple of cases. In this paper, we study the open cases.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:Mojj43d5GZwC",
            "Publisher": "HKUST Theoretical Computer Science Center Research Report; HKUST-TCSC-2002-03"
        },
        {
            "Title": "Conformity evaluation of data samples by L1-norm principal-component analysis",
            "Publication year": 2018,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10658/1065809/Conformity-evaluation-of-data-samples-by-iL-isub1-sub-norm/10.1117/12.2311893.short",
            "Abstract": "We describe an iterative procedure for soft characterization of outlier data in any given data set. In each iteration, data compliance to nominal data behavior is measured according to current L1-norm principal-component subspace representations of the data set. Successively refined L1-norm subspace data set representations lead to successively refined outlier data characterization. The effectiveness of the proposed theoretical scheme is experimentally studied and the results show significantly improved performance compared to L2-PCA schemes, standard L1-PCA, and state-of-the-art robust PCA methods.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:TuM7UPshZo8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "LDPC codes from generalized polygons",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1522647/",
            "Abstract": "We use the theory of finite classical generalized polygons to derive and study low-density parity-check (LDPC) codes. The Tanner graph of a generalized polygon LDPC code is highly symmetric, inherits the diameter size of the parent generalized polygon, and has minimum (one half) diameter-to-girth ratio. We show formally that when the diameter is four or six or eight, all codewords have even Hamming weight. When the generalized polygon has in addition an equal number of points and lines, we see that the nonregular polygon based code construction has minimum distance that is higher at least by two in comparison with the dual regular polygon code of the same rate and length. A new minimum-distance bound is presented for codes from nonregular polygons of even diameter and equal number of points and lines. Finally, we prove that all codes derived from finite classical generalized quadrangles are quasi …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Code division multiplexing properties of the odd-length minimum-TSC binary signature sets",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4068050/",
            "Abstract": "Binary signature sets that exhibit minimum total-squared-correlation (TSC) were recently designed. In this article, we focus on such sets with signatures of odd length and we derive closed-form expressions for the signature cross-correlation matrix, its eigenvalues, and its inverse. Then, we derive analytic expressions for (i) the bit-error-rate (BER) upon decorrelating processing, (ii) the maximum achievable signal-to-interference-plus-noise (SINR) ratio upon minimum-mean-square-error (MMSE) filtering, and (iii) the total asymptotic efficiency of the system. We find that minimum-TSC binary sets with signature length of the form 4m+1, m=1,2,..., are in all respects superior to minimum-TSC binary sets with signature length of the form 4m-1 (the latter class includes the familiar Gold sets as a small proper subset). \"4m+1\" sets perform practically at the single-user-bound (SUB) after decorrelating or MMSE processing (not …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Filter estimation for multiuser detection with side user information",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1495161/",
            "Abstract": "We consider the minimum-mean-square-error (MMSE) filter estimation in a multiuser communication environment with side user information (knowledge of the signature waveforms of a group of users). Unlike the approach adopted by the past research work known as \"group-blind\" linear multiuser detection, in this paper we attack directly the problem of estimating the input data covariance matrix with side user information under small sample support, and build an MMSE filter estimate using the improved covariance matrix estimate. For known Gaussian channel noise variance and signal waveforms of a group of users, we derive a closed form filter estimate, obtain its asymptotic covariance matrix, and demonstrate numerically that it coincides with the Cramer-Rao bound. When they are unknown, a recursive optimization procedure with guaranteed convergence is also developed. Simulation studies in the context of …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Code division controlled-MAC in wireless sensor network by adaptive binary signature design",
            "Publication year": 2007,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6577/657704/Code-division-controlled-MAC-in-wireless-sensor-network-by-adaptive/10.1117/12.719345.short",
            "Abstract": "We consider the problem of signature waveform design for code division medium-access-control (MAC) of wireless sensor networks (WSN). In contract to conventional randomly chosen orthogonal codes, an adaptive signature design strategy is developed under the maximum pre-detection SINR (signal to interference plus noise ratio) criterion. The proposed algorithm utilizes slowest descent cords of the optimization surface to move toward the optimum solution and exhibits, upon eigenvector decomposition, linear computational complexity with respect to signature length. Numerical and simulation studies demonstrate the performance of the proposed method and offer comparisons with conventional signature code sets.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:K3LRdlH-MEoC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "The optimal power assignment for cooperative hybrid-ARQ relaying protocol",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6133849/",
            "Abstract": "In this work, we consider the problem of assigning optimal transmission power sequence for cooperative hybrid automatic-repeat-request (H-ARQ) relaying protocol over quasi-static Rayleigh fading channels. We try to determine the optimal power sequence by minimizing the average total transmission power that we analyzed in our previous work. However, the closed-form expression of the average total power consumption of the cooperative H-ARQ relaying protocol is complicated in general, so we develop first in this work a simple approximation of the average total transmission power that is tight at high SNR. Then, based on the asymptotically tight approximation, we are able to identify the sequence of power values that minimizes the average total power consumption of the cooperative H-ARQ relaying protocol for any given targeted outage probability. In particular, we derive a set of equations that describe the …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Beacon-assisted Underwater Localization by L1-norm Space-Time Tensor Subspaces",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8962691/",
            "Abstract": "We consider the problem of robust self-localization of underwater robots with no GPS assistance and no availability of global clock synchronization. In particular, we consider self-localization of autonomous underwater vehicles that are equipped with a triangular hydrophone acoustic array and leverage time-domain coded beacons from two single-hydrophone acoustic nodes that are placed at known locations. Collected data snapshots over time at the hydrophone array are organized in a tensor data structure. Highly robust iteratively refined L 1 -norm space-time tensor subspaces that are calculated at the underwater acoustic array receiver allow accurate estimation of the azimuth and elevation angles-of-arrival and codes of the two beacons. The relative position of the vehicle with respect to the two beacons can then be estimated via triangulation. Simulation studies over statistically modeled underwater acoustic …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:rKYHOwt5kWwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementation of a distributed joint routing and dynamic spectrum allocation algorithm on USRP2 radios",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5508221/",
            "Abstract": "A cognitive radio network with decentralized control (i.e., a cognitive ad hoc network) is considered in this demonstration. The demo implements a decentralized and localized algorithm for through put maximization through joint routing and interference-avoiding waveform selection. The algorithm adapts to time-varying traffic demands, interference profile, and network topology to locally maximize the achievable data rate while avoiding harmful interference to co-located primary or secondary users. The prototype is based on a cross-layer protocol stack implemented in Python, which leverages GNU Radio for adaptive signal generation on a USRP2 software-defined-radio platform.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-spectrum cognitive networking through joint distributed channelization and routing",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6644234/",
            "Abstract": "We consider a secondary multi-hop cognitive radio network with decentralized control that operates cognitively to coexist with primary users. We propose a new spread-spectrum management paradigm, in which, unlike mainstream dynamic spectrum access research, digital waveforms are designed to occupy the entire available spectrum, and to adaptively track the interference profile at the receiver to maximize the link capacity while avoiding interference to primary users. In this context, we study the problem of maximizing the network throughput of a multi-hop network through joint routing and spread-spectrum channelization. We first propose a centralized formulation of the network control problem. We then propose an algorithm that can be seen as a distributed localized approximation of the throughput-maximizing policy. We refer to the proposed jointly-designed routing and code-division channelization …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:z_wVstp3MssC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An adaptive two-stage algorithm for ML and sub-ML decoding of binary linear block codes",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1159778/",
            "Abstract": "Two distinct codeword-searching procedures based on iterative bounded-distance decoding (BDD) are combined to form an adaptive two-stage maximum-likelihood (ML) decoder for binary linear block codes. During the first stage of the algorithm, a tight upper bound on an error likelihood metric (\"discrepancy\") is established iteratively for the ML codeword. First-stage processing requires sorting and storage. Adaptive switching to the second stage removes the sorting and storage requirements and allows to rule out redundant BDDs efficiently. Second-stage processing accounts for all codewords with discrepancy lower bound below the upper bound of the ML codeword and guarantees ML performance. In addition, the proposed two-stage algorithm is inherently tunable for controlled suboptimum operation. Under sub-ML operation, the overall scheme can be interpreted as a generalization of the Chase (1972 …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On overfitting, generalization, and randomly expanded training sets",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/870038/",
            "Abstract": "An algorithmic procedure is developed for the random expansion of a given training set to combat overfitting and improve the generalization ability of backpropagation trained multilayer perceptrons (MLPs). The training set is K-means clustered and locally most entropic colored Gaussian joint input-output probability density function estimates are formed per cluster. The number of clusters is chosen such that the resulting overall colored Gaussian mixture exhibits minimum differential entropy upon global cross-validated shaping. Numerical studies on real data and synthetic data examples drawn from the literature illustrate and support these theoretical developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Spread Spectrum Approach to Next Generation Intrusion Detection",
            "Publication year": 2005,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA436185",
            "Abstract": "The report describes a theoretical treatment of the tradeoffs among carrying capacity, distortion, and error recovery for spread spectrum solutions to message embedding approaches. For any given host image and block transform domain of interest signature vectors are derived that when used for spread-spectrum SS message embedding maximize the signal-to-interference-plus-noise ratio SINR at the output of the corresponding maximum SINR linear filter receiver. Under a colored Gaussian assumption on the transform domain host data, it is shown that these same signatures over minimum probability of error message recovery at any fixed host distortion level or-conversely-minimize the host distortion for any probability of error target level and maximize the Shannon capacity of the covert link. These results are further generalized to cover SS embedding in linearly processed transform domain host data with resulting orders of magnitude of demonstrated improvement over state of the practice SS steganographic practices. Optimized multi-signaturemulti-message embedding in the same host data is addressed as well.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "STATE UNIV OF NEW YORK COLL OF TECHNOLOGY UTICA"
        },
        {
            "Title": "The TeraNova platform: An integrated testbed for ultra-broadband wireless communications at true Terahertz frequencies",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128620304473",
            "Abstract": "Terahertz (THz)-band (0.1 THz to 10 THz) communication is envisioned as a key technology to meet the demand for faster, more ubiquitous wireless communication networks. For many years, the lack of compact, fast and efficient ways to generate, modulate, detect and demodulate THz-band signals has limited the feasibility of such communication systems. Recently, major progress within different device technologies is finally closing the so-called THz gap. For the time being, communication testbeds have been developed at sub-THz frequencies, i.e., at or near the boundary with millimeter-wave communication systems. Nonetheless, higher carrier frequencies and their associated bandwidth are needed to meet the demand for much higher data rates. In this paper, the TeraNova platform, i.e., the first integrated testbed for ultra-broadband wireless communications at true THz-band frequencies, is presented. The …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:cAWJABFkdiUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fastest-known near-ML decoding of golden codes",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6941455/",
            "Abstract": "We present a reliability-based near-maximum-likelihood (near-ML) decoder of Golden code with significantly reduced average decoding complexity over the current state of the art We first pre-process the received signal via zero-forcing (ZF) filtering and compute symbol reliabilities at the filter output Reliable symbols are directly decoded and removed from the received signal. The remaining symbols are decoded by reduced-dimension ML or near-ML decoding. Computational studies included herein reveal extensive complexity savings when compared with state-of-the art ML and near-ML decoders for the Golden code. For instance, for the 16-QAM signal constellation at pre-detection signal-to-noise ratio of 28dB that corresponds to bit-error-rate of about 10 -4 , the presented algorithm achieves more than 96.6% average-complexity savings, while maintaining indistinguishable to ML performance.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:wE8AsS3ykUMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal signature design for spread-spectrum steganography",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4060938/",
            "Abstract": "For any given host image or group of host images and any (block) transform domain of interest, we find the signature vector that when used for spread-spectrum (SS) message embedding maximizes the signal-to-interference-plus-noise ratio (SINR) at the output of the corresponding maximum-SINR linear filter. We establish that, under a (colored) Gaussian assumption on the transform domain host data, the same derived signature minimizes host distortion for any target message recovery error rate and maximizes the Shannon capacity of the covert steganographic link. Then, we derive jointly optimal signature and linear processor designs for SS embedding in linearly modified transform domain host data and demonstrate orders of magnitude improvement over current SS steganographic practices. Optimized multisignature/multimessage embedding in the same host data is studied as well",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind iterative recovery of spread-spectrum steganographic messages",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1530251/",
            "Abstract": "We propose an iterative generalized least squares procedure to recover unknown messages hidden in image hosts via spread-spectrum embedding. Neither the original host nor the embedding signature is assumed available. We demonstrate that for hidden messages of sufficient length (data sample support), recovery can be achieved with probability of error close to what may be attained with known embedding signature and known original host autocorrelation matrix. For small hidden messages, the signature estimate calculated by the iterative generalized least squares procedure can be fed as initial value to a (computationally costly) expectation-maximization signature identification scheme that we derive. Message recovery can again be carried out successfully by means of a linear sample-matrix-inversion minimum-mean-square-error receiver.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sparse waveform design for all-spectrum channelization",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7952860/",
            "Abstract": "We introduce maximum-SINR sparse-binary waveforms that modulate data information symbols from any finite alphabet and span the whole continuum of the available/device-accessible spectrum. We offer an optimal algorithm that designs the proposed waveforms by maximizing the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum-SINR linear receiver. In addition, we offer a suboptimal algorithm for the same problem with significantly reduced computational complexity. The post-filtering SINR improvements attained by the proposed waveforms in a single-input single-output (SISO) communication system with colored interference are presented analytically. Simulation studies compare the proposed waveforms with their conventional non-sparse counterparts and demonstrate their superior SINR performance.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:x8G803Bi31IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Face recognition with L1-norm subspaces",
            "Publication year": 2016,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9857/98570L/Face-recognition-with-L1-norm-subspaces/10.1117/12.2224953.short",
            "Abstract": "We consider the problem of representing individual faces by maximum L1-norm projection subspaces calculated from available face-image ensembles. In contrast to conventional L2-norm subspaces, L1-norm subspaces are seen to offer significant robustness to image variations, disturbances, and rank selection. Face recognition becomes then the problem of associating a new unknown face image to the “closest,” in some sense, L1 subspace in the database. In this work, we also introduce the concept of adaptively allocating the available number of principal components to different face image classes, subject to a given total number/budget of principal components. Experimental studies included in this paper illustrate and support the theoretical developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:uQdrZ3qaPmcC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "X60: A programmable testbed for wideband 60 ghz wlans with phased arrays",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366417312896",
            "Abstract": "This paper introduces X60, the first SDR-based testbed for 60 GHz WLANs, featuring fully programmable MAC/PHY/Network layers, multi-Gbps rates, and a user-configurable 12-element phased antenna array. Combined these features provide an unprecedented opportunity to re-examine the most important aspects of signal propagation and performance expected from practical 60 GHz systems. Leveraging the testbed’s capabilities, we conduct an extensive measurement study, looking at different aspects of indoor 60 GHz links. We find that the presence of reflective surfaces and imperfect beams generated by practical phased arrays together can result in multiple NLoS paths supporting Gbps rates. Additionally, our comparison of different beam adaptation strategies reveals how beam steering even at one end of the link can often be sufficient to restore link quality. Finally, contrary to a common assumption in …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:Q17yWvk9gpwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fast computation of the L1-principal component of real-valued data",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6855164/",
            "Abstract": "Recently, Markopoulos et al. [1], [2] presented an optimal algorithm that computes the L 1  maximum-projection principal component of any set of N real-valued data vectors of dimension D with complexity polynomial in N, O(N D ). Still, moderate to high values of the data dimension D and/or data record size N may render the optimal algorithm unsuitable for practical implementation due to its exponential in D complexity. In this paper, we present for the first time in the literature a fast greedy single-bit-flipping conditionally optimal iterative algorithm for the computation of the L 1  principal component with complexity O(N 3 ). Detailed numerical studies are carried out demonstrating the effectiveness of the developed algorithm with applications to the general field of data dimensionality reduction and direction-of-arrival estimation.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:qOpkhvVCMvUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The outage probability and optimum power assignment for differential amplify-and-forward relaying",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5502432/",
            "Abstract": "Differential Amplify-and-Forward (DAF) relaying can be viewed as an attractive cooperative communication strategy for wireless networks where channel estimation is not feasible or it is rather avoided. A new exact outage probability expression is presented herein for DAF relaying that involves only a single integral. Then, an asymptotically tight closed-form approximation is obtained which enables power allocation optimization for the outage behavior of DAF relaying. Numerical and simulation studies validate the theoretical analysis.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Makings of the 4× 4 space-time block code of choice",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6214443/",
            "Abstract": "We present a new 4×4 Hadamard-precoded Quasi-Orthogonal Space-Time Block Code (QO-STBC) that enables reliability-based prioritized symbol detection using linear filters. Approximate block-error-rate analysis is carried out and used to optimize the code rotation angles. For benchmarking purposes, the maximum-likelihood (ML) code detector is also derived with complexity of the order of joint two-real-symbol decoding. Numerical and simulation studies compare linear filter decoding against ML decoding.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards experimental evaluation of software-defined underwater networked systems",
            "Publication year": 2012,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.718.8375&rep=rep1&type=pdf",
            "Abstract": "In this paper, we present our ongoing work on developing a reconfigurable underwater networking testbed based on the Teledyne Benthos Telesonar SM-75 modem. The testbed is designed with the objective of allowing researchers and developers to advance research activities in the field of underwater networking and communications through a flexible testbed platform. We will first discuss the testbed architecture, with a particular emphasis on architectural considerations, software-hardware separation, and general capabilities. We will then present work in progress on enabling support for IPv6, custom-designed medium access control, and ad hoc routing protocols. Finally, we will discuss integration of the testbed with a channel emulator that allows performing laboratory controlled experiments where the user is able to configure transmission distance, channel effects, and underwater communication parameters. Emulation results for several different scenarios as well as actual experimental results for transmission of custom defined acoustic waveform will be demonstrated at the end. This platform therefore allows playing, processing, and recording custom-defined acoustic waveforms to support reconfigurable physical layer experimentation with arbitrary transmission schemes.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient L1-norm principal-component analysis via bit flipping",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7934025/",
            "Abstract": "It was shown recently that the K L1-norm principal components (L1-PCs) of a real-valued data matrix X ∈ R  D×N  (N data samples of D dimensions) can be exactly calculated with cost O(2 NK ) or, when advantageous, O(N dK - K + 1 ) where d=rank (X), K<;d. In applications where X is large (e.g., “big” data of large N and/or “heavy” data of large d), these costs are prohibitive. In this paper, we present a novel suboptimal algorithm for the calculation of the K <; d L1-PCs of X of cost O (ND min {N, D} + N 2 K 2 (K 2  + d)), which is comparable to that of standard L2-norm PC analysis. Our theoretical and experimental studies show that the proposed algorithm calculates the exact optimal L1-PCs with high frequency and achieves higher value in the L1-PC optimization metric than any known alternative algorithm of comparable computational cost. The superiority of the calculated L1-PCs over standard L2-PCs (singular …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:5N-NJrZHaHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Binary CDMA signature sets with concurrently minimum total-squared-correlation and maximum-squared-correlation",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1204397/",
            "Abstract": "We derive lower bounds on the maximum-squared-correlation (MSC) of binary antipodal signature sets for any number of signatures K and any signature length L with K /spl les/ L (underloaded systems). We establish the tightness of the bounds for all cases except K = L /spl equiv/ 1 (mod 4) and we prove that the minimum total-squared-correlation (TSC) binary antipodal signature sets that were recently designed are, in fact doubly optimal for underloaded systems: both their TSC and MSC are minimum.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "L1-subspace tracking for streaming data",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003132031930295X",
            "Abstract": "High-dimensional data usually exhibit intrinsic low-rank structures. With tremendous amount of streaming data generated by ubiquitous sensors in the world of Internet-of-Things, fast detection of such low-rank pattern is of utmost importance to a wide range of applications. In this work, we present an L1-subspace tracking method to capture the low-rank structure of streaming data. The method is based on the L1-norm principal-component analysis (L1-PCA) theory that offers outlier resistance in subspace calculation. The proposed method updates the L1-subspace as new data are acquired by sensors. In each time slot, the conformity of each datum is measured by the L1-subspace calculated in the previous time slot and used to weigh the datum. Iterative weighted L1-PCA is then executed through a refining function. The superiority of the proposed L1-subspace tracking method compared to existing approaches is …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:f-E_jMG6T4AC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The maximum squared correlation, total asymptotic efficiency, and sum capacity of minimum-TSC quaternary signature sets",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=8554741091003822849&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust Adaptive Spread-Spectrum Receivers: SMART Antenna/Space Timer Interference Mitigation Techniques",
            "Publication year": 2004,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA427319",
            "Abstract": "This work focuses on the problem of adaptive receiver design for direct sequence spread-spectrum wireless communications systems with limited data support dictated by the rapidly changing characteristics of the wireless channel. Both linear and non-linear neutral network receiver structures are considered, usually equipped with an antenna array space-time processing.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:D03iK_w7-QYC",
            "Publisher": "STATE UNIV OF NEW YORK AT BUFFALO DEPT OF ELECTRICAL ENGINEERING"
        },
        {
            "Title": "Distributed resource management for cognitive ad hoc networks with cooperative relays",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7128414/",
            "Abstract": "It is well known that the data transport capacity of a wireless network can be increased by leveraging the spatial and frequency diversity of the wireless transmission medium. This has motivated the recent surge of research in cooperative and dynamic-spectrum-access (which we also refer to as cognitive spectrum access) networks. Still, as of today, a key open research challenge is to design distributed control strategies to dynamically jointly assign: 1) portions of the spectrum and 2) cooperative relays to different traffic sessions to maximize the resulting network-wide data rate. In this paper, we make a significant contribution in this direction. First, we mathematically formulate the problem of joint spectrum management and relay selection for a set of sessions concurrently utilizing an interference-limited infrastructure-less wireless network. We then study distributed solutions to this (nonlinear and nonconvex) problem …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:KYgttONoxcsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CORRESPONDENCE-The Maximum Squared Correlation, Sum Capacity, and Total Asymptotic Efficiency of Minimum Total-Squared-Correlation Binary Signature Sets",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=5547990301066642749&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:Z7R3Ocg27JUC",
            "Publisher": "[New York: Institute of Electrical and Electronics Engineers, c1963-"
        },
        {
            "Title": "Semi-blind signal recovery in impulsive noise with L1-norm PCA",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8645515/",
            "Abstract": "The time-varying nature of the underwater acoustic channel typically requires the use of frequent channel re-training and tracking at the receiver, which increases communication over-head due to pilot signaling and reduces overall system spectral efficiency. At the same time, underwater acoustic communication links are subject to both man-made and natural noise sources that may exhibit impulsive characteristics. We investigate the performance of blind signal recovery based on L2-norm principal-component analysis (PCA) and propose a new receiver design based on L1-norm PCA. We evaluate the performance of both blind and pilot-based signal recovery mechanisms in terms of bit-error rate (BER) under simulated underwater acoustic channels and impulsive noise conditions due to snapping shrimp.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:8_tS2Vw13FcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rank-2-optimal binary spreading codes",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4068049/",
            "Abstract": "Over the real/complex field, the spreading code that maximizes the output signal-to-interference-plus-noise ratio (SINR) of the linear maximum-SINR receiver is the minimum-eigenvalue eigenvector of the interference autocovariance matrix. In the context of binary spreading codes, the maximization problem is NP-hard with complexity exponential in the code length. A new method for the optimization of binary spreading codes under a rank-2 approximation of the inverse interference autocovariance matrix is presented where the rank-2-optimal binary code is obtained in lower than quadratic complexity. Significant SINR performance improvement is demonstrated over the common binary hard-limited eigenvector design which is seen to be equivalent to the rank-1-optimal solution.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deep Ll-PCA of Time-Variant Data with Application to Brain Connectivity Measurements",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8903169/",
            "Abstract": "Ll-Principal Component Analysis (LI-PCA) is a powerful computational tool to identify relevant components in data affected by noise, outliers, partial disruption and so on. Relevant efforts have been made to adapt its powerful summarization capacity to time variant data, e.g. in tracking the evolution of LI-PCA components. Here, we analyze a layered version of LI-PCA, to which we refer to as Deep LI-PCA. Deep LI-PCA is obtained by recursive application of two stages: estimation of LI-PCA basis and extraction of the first rank projector. The Deep LI-PCA is applied to repeated EEG connectivity measures and it proves relevant for identifying outliers, changes, and stable components. Moreover, at each layer, an in-depth analysis of the mean square error between the data applied at the input layer and the output projector is provided. The Deep LI-PCA allows to cope with outliers of different temporal extent as well as to …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:6gSKFiM3XosC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PEP-bound rotation angle optimization of 8-transmit-antenna quasi-orthogonal space-time block codes",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4217714/",
            "Abstract": "We derive a new expression for the rotation angles that maximize the diversity (eigenvalue) product of the 8×8 two-symbol decodable quasi-orthogonal space-time block code (QO-STBC). We show that the previously proposed sum-eigenvalue maximization criterion for the design of rotation angles is not relevant/applicable to the 8-transmit-antenna QO-STBCs and we suggest, instead, minimum eigenvalue maximization. Finally, working directly with the pairwise-error-probability (PEP) upper bound expression, we obtain new true PEP-upper-bound optimal rotation angles. Simulation studies demonstrate and compare the error rate of the three design criteria (diversity product, minimum eigenvalue, PEP upper bound).",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Demonstration of all-spectrum cognitive channelization on GNU Radio and USRPN-210",
            "Publication year": 2014,
            "Publication url": "https://www.sto.nato.int/publications/STO%20Meeting%20Proceedings/STO-MP-IST-123/MP-IST-123-P3.pdf",
            "Abstract": "We create new software signal processing blocks and provide transmitter and receiver designs in GNU Radio and MATLAB to experimentally demonstrate the theoretical concepts of all-spectrum cognitive channelization in a software-definedradio (SDR)-based testbed. Three low-cost, SDR nodes (USRPN-210) are deployed in an indoor, multipath-fading, lab environment connected via Gigabit Ethernet (GigE) to three host-PCs for carrying out real-time signal processing.I. EXPERIMENTAL TESTBED SETUP We focus on the software design, implementation in software-defined radio (SDR), and final deployment of a lowcost indoor testbed for evaluating the concepts of cognitive channelization [1]. For this reason three commercial SDR transceivers (Fig. 1) named Universal Software Radio Peripheral (USRPN-210)[2] are used to provide a setup of a secondary link operating in the presence of primary user’s interference.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:qwOXE0mbtu4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A feedforward bidirectional as2 sociative memory",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/857767/",
            "Abstract": "In contrast to conventional feedback bidirectional associative memory (BAM) network models, a feedforward BAM network is developed based on a one-shot design algorithm of O(p/sup 2/(n+m)) computational complexity, where p is the number of prototype pairs and n, m are the dimensions of the input/output bipolar vectors. The feedforward BAM is an n-p-m three-layer network of McCulloch-Pitts neurons with storage capacity 2/sup min{m,n}/ and guaranteed perfect bidirectional recall. The overall network design procedure is fully scalable in the sense that any number p/spl les/2/sup min{m,n}/ of bidirectional associations can be implemented. The prototype patterns may be arbitrarily correlated. With respect to inference performance, it is shown that the Hamming attractive radius of each prototype reaches the maximum possible value. Simulation studies and comparisons illustrate and support these theoretical …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An iterative algorithm for the computation of the MVDR filter",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/902111/",
            "Abstract": "Statistical conditional optimization criteria lead to the development of an iterative algorithm that starts from the matched filter (or constraint vector) and generates a sequence of filters that converges to the minimum-variance-distortionless-response (MVDR) solution for any positive definite input autocorrelation matrix. Computationally, the algorithm is a simple, noninvasive, recursive procedure that avoids any form of explicit autocorrelation matrix inversion, decomposition, or diagonalization. Theoretical analysis reveals basic properties of the algorithm and establishes formal convergence. When the input autocorrelation matrix is replaced by a conventional sample-average (positive definite) estimate, the algorithm effectively generates a sequence of MVDR filter estimators; the bias converges rapidly to zero and the covariance trace rises slowly and asymptotically to the covariance trace of the familiar sample-matrix …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Differential amplify-and-forward cooperative relaying in a software-defined radio testbed with an aerial relay node",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8170822/",
            "Abstract": "In this work, we implement and demonstrate differential amplify-and-forward (DAF) cooperative relaying as a novel diversity technique to combat bit errors and outages common in airborne environments. By using differential modulation and demodulation, we reduce the system complexity by avoiding channel estimation which is often unreliable or computationally costly in dynamic environments with mobile nodes. We further simplify the requirements of the relay node by employing amplify-and-forward relaying where the relay amplifies the incoming signal and retransmits at a different frequency assignment. We implemented DAF relaying using the GNU Radio software platform and Universal Software Radio Peripherals (USRPs). We designed a pilot sequence specifically for differential modulation and implemented frame level synchronization which can combine frames properly at the destination node for joint …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:PD-wXv1Sh1EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Passive spread-spectrum steganalysis",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6115856/",
            "Abstract": "We consider the problem of passive spread-spectrum steganalysis where the objective is to decide the presence or absence of spread-spectrum hidden data in a given image (a binary hypothesis testing problem). Unlike conventional feature-based approaches, we describe an unsupervised (blind) low-complexity approach based on generalized least-squares principles that may enable rapid high-volume image processing. Extensive experiments on image sets and comparisons with existing steganalysis techniques demonstrate most satisfactory classification performance measured in probability of correct detection versus induced false alarm rate.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Subspace direction finding with an auxiliary-vector basis",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4063549/",
            "Abstract": "We develop a new subspace direction-of-arrival (DOA) estimation procedure that utilizes a noneigenvector basis. Computation of the basis is carried out by a modified version of the orthogonal auxiliary-vector (AV) filtering algorithm. The procedure starts with the linear transformation of the array response scanning vector by the input autocorrelation matrix. Then, successive orthogonal maximum cross-correlation auxiliary vectors are calculated to form a basis for the scanner-extended signal subspace. As a performance evaluation example, our studies for uncorrelated sources demonstrate a gain in the order of 15 dB over MUSIC, 7 dB over ESPRIT, and 3 dB over the grid-search maximum likelihood DOA estimator at probability of resolution 0.9 with a ten-element array and reasonably small observation data records. Results for correlated sources are reported as well",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Layered video transmission over wireless multirate DS-CDMA links",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1546009/",
            "Abstract": "In this paper, we consider the transmission of video over wireless direct-sequence code-division multiple access (DS-CDMA) channels. A layered (scalable) video source codec is used. The layers may be time-multiplexed and transmitted over a single CDMA channel or each layer can be transmitted over a different CDMA channel. For the latter case, spreading codes of different lengths are allowed for each CDMA channel (multirate CDMA). Thus, a different number of chips per bit can be used for the transmission of each scalable layer. For a given fixed energy value per chip and chip rate, the selection of a spreading code length affects the transmitted energy per bit and bit rate for each scalable layer. An MPEG-4 source encoder is used to provide a two-layer signal-to-noise-ratio scalable bit stream. Each of the two layers is channel-coded using rate-compatible punctured convolutional codes. Then, the data are …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Software-defined joint routing and waveform selection for cognitive ad hoc networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5680156/",
            "Abstract": "The problem of throughput maximization in a cognitive radio network with decentralized control (i.e., a cognitive radio ad hoc network) is considered in this paper. First, decentralized and localized algorithms for throughput maximization through joint cognitive routing and interference-avoiding waveform selection are proposed, based on a nonlinear optimization framework. The proposed algorithms adapt to time-varying traffic demands, interference profile, and network topology to locally maximize the achievable data rate while avoiding harmful interference to co-located primary or secondary users. Second, a prototype implementation of the proposed decentralized control algorithms is presented. The prototype is based on a software-defined-radio USRP2 platform that distributively senses and adapts its transmission based on results from real-time nonlinear optimization. Experiments on the software-defined-radio …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Decoding of framewise compressed-sensed video via interframe total variation minimization",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/journals/journal-of-electronic-imaging/volume-22/issue-2/021012/Decoding-of-framewise-compressed-sensed-video-via-interframe-total-variation/10.1117/1.JEI.22.2.021012.short",
            "Abstract": "Compressed sensing is the theory and practice of sub-Nyquist sampling of sparse signals of interest. Perfect reconstruction may then be possible with significantly fewer than the Nyquist required number of data. In this work, we consider a video system where acquisition is performed via framewise pure compressed sensing. The burden of quality video sequence reconstruction falls, then, solely on the decoder side. We show that effective decoding can be carried out at the receiver/decoder side in the form of interframe total variation minimization. Experimental results demonstrate these developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:kzcrU_BdoSEC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Comprehending the IoT cyber threat landscape: A data dimensionality reduction technique to infer and characterize Internet-scale IoT probing campaigns",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1742287619300246",
            "Abstract": "The resource-constrained and heterogeneous nature of Internet-of-Things (IoT) devices coupled with the placement of such devices in publicly accessible venues complicate efforts to secure these devices and the networks they are connected to. The Internet-wide deployment of IoT devices also makes it challenging to operate security solutions at strategic locations within the network or to identify orchestrated activities from seemingly independent malicious events from such devices. Therefore, in this paper, we initially seek to determine the magnitude of IoT exploitations by examining more than 1 TB of passive measurement data collected from a/8 network telescope and by correlating it with 400 GB of information from the Shodan service. In the second phase of the study, we conduct in-depth discussions with Internet Service Providers (ISPs) and backbone network operators, as well as leverage geolocation …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:Agc8PWtS8JkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Uniquely decodable code-division via augmented Sylvester-Hadamard matrices",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6214390/",
            "Abstract": "We consider the problem of designing binary antipodal uniquely decodable (errorless) code sets for overloaded code-division multiplexing applications where the number of signals K is larger than the code length L. Our proposed errorless code set design aims at identifying the maximum number of columns that can be potentially appended to a Sylvester-Hadamard matrix of order L, while maintaining the errorless code property. In particular, we derive formally the maximum number of columns that may be appended to the Sylvester-Hadamard matrix of order L = 8 and use this result as a seed to produce an infinite sequence of designs in increasing L. In the noiseless transmission case, a simple algorithm is developed to uniquely decode all signals. In additive white Gaussian noise (AWGN), a slab-sphere decoding scheme can be utilized for efficient and effective decoding.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "L1-norm principal-component analysis via bit flipping",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7838164/",
            "Abstract": "The K L1-norm Principal Components (L1-PCs) of a data matrix X ∈ ℝ D × N  can be found optimally with cost O(2 NK ), in the general case, and O(N rank(X)K - K + 1 ), when rankX is a constant with respect to N [1],[2]. Certainly, in real-world applications where N is large, even the latter polynomial cost is prohibitive. In this work, we present L1-BF: a novel, near-optimal algorithm that calculates the K L1-PCs of X with cost O (NDmin{N, D} + N 2 (K 4  + DK 2 ) + DNK 3 ), comparable to that of standard (L2-norm) Principal-Component Analysis. Our numerical studies illustrate that the proposed algorithm attains optimality with very high frequency while, at the same time, it outperforms on the L1-PCA metric any counterpart of comparable computational cost. The outlier-resistance of the L1-PCs calculated by L1-BF is documented with experiments on dimensionality reduction and genomic data classification for disease …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:fixghrsIJ_wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Uniquely decodable code-division and low-complexity receivers for advanced signal design, multiplexing, and multiple-access communications",
            "Publication year": 2012,
            "Publication url": "https://search.proquest.com/openview/55ad61112cc3f83a1b778237948cec27/1?pq-origsite=gscholar&cbl=18750",
            "Abstract": "In the last decade, wireless communication service has experienced explosive growth while communication technologies have progressed generation by generation. Code-division multiplexing (CDM) or code-division multiple-access (CDMA) is seen as a promising basic technology for 3G/4G cellular communications networks. In such rapidly growing communication systems in which higher number of users share the same channel becomes very challenging problem since it introduces multiple-access interference (MAI).",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:0qX8s2k1IRwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and performance analysis of ultra-massive multi-carrier multiple input multiple output communications in the terahertz band",
            "Publication year": 2017,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10209/102090A/Design-and-performance-analysis-of-ultra-massive-multi-carrier-multiple/10.1117/12.2264424.short",
            "Abstract": "Terahertz (THz)-band communication is envisioned as a key wireless technology to satisfy the need for much higher wireless data rates. To date, major progress in electronic, photonic and plasmonic technologies is finally closing the so-called THz gap. However, the exceedingly large available bandwidth at THz frequencies comes at the cost of a very high propagation loss. Combined with the power limitations of THz transceivers, this results in very short communication distances. Moreover, the absorption by water vapor molecules further splits the THz band in multiple transmission windows, which shrink as the transmission distance increases. To overcome these limitations, the concept of Ultra-Massive Multi-Carrier Multiple Input Multiple Output (UMMC MIMO) communication, which relies on the use of ultra-dense frequency-tunable plasmonic nano-antenna arrays, has been recently proposed. In this paper, the …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:0klj8wIChNAC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Receiver configuration and testbed development for underwater cognitive channelization",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7094734/",
            "Abstract": "We propose a receiver configuration and we develop a software-defined-radio testbed for real-time cognitive underwater multiple-access communications. The proposed receiver is fully reconfigurable and executes (i) all-spectrum cognitive channelization and (ii) combined synchronization, channel estimation, and demodulation. Online (real-time) experimental field studies using in-house built modems demonstrate our theoretical developments and show that cognitive channelization is a powerful proposition for underwater communications that leads to significant improvement of spectrum utilization. Even in the absence of interference, due to the noise characteristics of the acoustic channel, cognitive channelization offers significant performance improvements in terms of receiver pre-detection signal-to-interference-plus-noise-ratio and bit-error-rate.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:wTekDMGr9GkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fundamental code division multiplexing properties of minimum total-squared-correlation binary signature sets",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=13964348202047581990&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New bounds on the total-squared-correlation of quaternary signature sets and optimal designs",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5426263/",
            "Abstract": "We derive new bounds on the total squared correlation (TSC) of quaternary (quadriphase) signature/sequence sets for all lengths L and set sizes K. Then, for all K, L, we design minimum-TSC optimal sets that meet the new bounds with equality. Direct numerical comparison with the TSC value of the recently obtained optimal binary sets shows under what K, L realizations gains are materialized by moving from the binary to the quaternary code-division multiplexing alphabet. On the other hand, comparison with the Welch TSC value for real/complexfield sets shows that, arguably, not much is to be gained by raising the alphabet size above four for any K, L.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An alternative signature design using l1 principal components for spread-spectrum steganography",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9053484/",
            "Abstract": "As methods for detecting hidden data evolve, there exits an ever increasing need to develop new steganographic solutions. This paper introduces novel spread spectrum (SS) and improved spread spectrum (ISS) multimedia data embedding techniques using L 1  principal component signatures. The design presented performs well in terms of bit error rate and the structural similarity index metric.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:jODAHDUrbwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New bounds on the total squared correlation and optimum design of DS-CDMA binary signature sets",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1181545/",
            "Abstract": "The Welch lower bound (see Welch, R.L., IEEE Trans. Inform. Theory, vol.IT-20, p.397-9, 1974) on the total squared correlation (TSC) of signature sets is known to be tight for real-valued signatures and loose for binary signatures whose number is not a multiple of four. We derive new bounds on the TSC of binary signature sets for any number of signatures K and any signature length L. Then, for almost all K, L in {1,2,...,256}, we design optimum binary signature sets that achieve the new bounds. The design procedure is based on simple transformations of Hadamard matrices.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-spectrum cognitive channelization around narrowband and wideband primary stations",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7417278/",
            "Abstract": "In this paper we design, implement, and experimentally evaluate a wireless software-defined radio platform for cognitive channelization in the presence of narrowband or wideband primary stations. Cognitive channelization is achieved by jointly optimizing the transmission power and the waveform channel of the secondary users. The process of joint resource allocation requires no a-priori knowledge of the transmission characteristics of the primary user and maximizes the signal-to- interference-plus-noise ratio (SINR) at the output of the secondary receiver. This is achieved by designing waveforms that span the whole continuum of available/device-accessible spectrum, while satisfying a peak power constraint for the secondary users and an interference temperature (IT) constraint for the primary users. We build a four-node software-defined radio testbed and experimentally demonstrate in an indoor laboratory …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:OkrdTXRNpVkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust direction finding in the fluctuating oceans by complex L1-norm principal-component analysis",
            "Publication year": 2019,
            "Publication url": "https://par.nsf.gov/servlets/purl/10169181",
            "Abstract": "We consider the problem of robust direction-of-arrival (DoA) estimation in dynamic ocean environments. Robust direction finding of underwater acoustic signals transmitted from known locations may enable accurate localization of a receiver node underwater, as well as enhance link communication rate by instructing the receiver to listen for transmissions from a specific direction. We propose to estimate the DoA of underwater acoustic signals via subspace methods, executed at a receiver array, that involve performing what is known as principal-component analysis (PCA) for finding the L2-norm principal vector subspace of the recorded signal snapshots. However, in practice coherence loss, which typically arises from dynamic wavefront fluctuations due to internal waves, scattering from the sea surface and/or bottom and other unknown environmental parameters, may result in recorded signal snapshots that may be corrupted by faulty measurements, leading to an inaccurate estimation of the DoA and source position. We propose to model the loss of coherence as multiplicative random noise applied to the measured acoustic signal. In such cases, L2-norm PCA methods suffer from significant performance degradation. Motivated by the resistance of novel L1-norm-derived subspaces against the impact of irregular, highly deviating points in reduceddimensionality data approximations, we propose to employ L1-norm (absolute error) maximumprojection PCA of the antenna array measurements and evaluate the performance of a novel, outlierresistant DoA estimation algorithm. Experimental assessment of the proposed DoA algorithm is conducted …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:E10ZYwHxBI8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Short data record filtering for adaptive underwater acoustic communications",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8448597/",
            "Abstract": "Spread-spectrum signaling offers robust communication over the multipath underwater acoustic channel, while at the same time allows multiple users to simultaneously occupy the entire continuum of the device-accessible bandwidth. However, limitations in temporal and spatial coherence of the underwater acoustic channel affect the maximum spreading code length and therefore the effective link data rate. In this work, we propose adaptive code length optimization toward high-rate spread-spectrum underwater acoustic communications. We first evaluate the bit error rate (BER) performance of the estimated minimum variance distortionless response (MVDR) and auxiliary-vector (AV) linear filter receivers. We observe that the AV-filter based receiver significantly outperforms the estimated MVDR solution under limited data-record availability. We then investigate data rate trade-offs for optimized code lengths under …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:ocbgtyEEUOwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable TSC-Optimal Overloading of Binary Signature Sets.",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/49087479/Scalable_TSC-Optimal_Overloading_of_Bina20160924-26378-15izox4.pdf",
            "Abstract": "Recent advances in the area of binary sequences for code-division multiplexing provide us with minimum total-squared-correlation (TSC) optimal signature sets for (almost) all signature lengths L and set sizes K. The sets are scalable as long as K≤ L (underloaded systems) and nonscalable-in general require signature re-design/re-assignment as users enter or exit-when K> L (overloaded systems). In this paper, we derive new lower bounds on the conditional TSC of overloaded binary signature sets built on fixed fullload TSC-optimal sets. Overloading is allowed to be as high as 100%. Scalable designs that achieve the new bounds are then developed. To evaluate the performance of the proposed designs, we compare the TSC of our constructions to the unconditionally minimum achievable TSC values.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Low-complexity near-maximum-likelihood multiuser detection and LDPC channel coding",
            "Publication year": 2005,
            "Publication url": "https://search.proquest.com/openview/229f9f90da7cac248f4432aaab873c37/1?pq-origsite=gscholar&cbl=18750&diss=y",
            "Abstract": "In digital communication systems, maximum likelihood (ML) multiuser detection and decoding of linear block codes translate to similar basic combinatorial optimization problems with complexity exponential in the number of users or code size, respectively. Development of low-complexity high-performance sub-optimum solutions is of great practical interest.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:eq2jaN3J8jMC",
            "Publisher": "State University of New York at Buffalo"
        },
        {
            "Title": "New bounds on the aperiodic total squared correlation of binary signature sets and optimal designs",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4288826/",
            "Abstract": "We derive new bounds on the aperiodic total squared correlation (ATSC) of binary antipodal signature sets for any number of signatures K and any signature length L. We then present optimal designs that achieve the new bounds for several (K, L) cases. As an example, it is seen that the familiar Gold and (small or large) Kasami designs are not ATSC-optimal in general. The optimal signature set designs provided herein are in this sense better suited for asynchronous and/or multipath code-division multiplexing applications.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust adaptive recovery of spread-spectrum signals with short data records",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/871397/",
            "Abstract": "The problem under consideration is the adaptive reception of a multipath direct-sequence spread-spectrum (SS) signal in the presence of unknown correlated SS interference and additive impulsive noise. An SS receiver structure is proposed that consists of a vector of adaptive chip-based Hampel nonlinearities followed by an adaptive auxiliary-vector linear tap-weight filter. The nonlinear receiver front end adapts itself to the unknown prevailing noise environment providing robust performance over a wide range of underlying noise distributions. The adaptive auxiliary-vector linear tap-weight filter allows rapid SS interference suppression with a limited data record. Numerical and simulation studies under finite-data-record system adaptation show significant improvement in bit-error-rate performance over the conventional linear minimum variance-distortionless-response (MVDR) SS receiver or conventional MVDR …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computational advances in sparse l1-norm principal-component analysis of multi-dimensional data",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8313159/",
            "Abstract": "We consider the problem of extracting a sparse Li-norm principal component from a data matrix X ϵ R D×N  of N observation vectors of dimension D. Recently, an optimal algorithm was presented in the literature for the computation of sparse L 1 -norm principal components with complexity O(N S ) where S is the desired sparsity. In this paper, we present an efficient suboptimal algorithm of complexity O(N 2 (N + D)). Extensive numerical studies demonstrate the near-optimal performance of the proposed algorithm and its strong resistance to faulty measurements/outliers in the data matrix.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:oYVvnHz_XzQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal multiuser spread-spectrum data embedding in video streams",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7036900/",
            "Abstract": "In this paper, we intend to hide multiuser data in a given host video stream with imperceptible spread-spectrum embedding. First, host video frames are picked in the original given video stream according to a frame selection pattern. We partition each host video frame into many small blocks. Based on a two-dimensional transformation of each small block and zigzag scanning, we construct the host video vectors. The embedded message for each user will be spread out with a signature and added to the host vectors. We present the orthonormal signature set of embedding carriers that achieves maximum sum signal-to-interference-plus-noise ratio (sum-SINR) at the linear filter output for any fixed embedding amplitudes. Then, for any given total embedding distortion constraint, we give the optimal multi-signature assignment and amplitude allocation pair that maximizes the sum capacity of the concealment procedure …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:tBp-nognM3UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint source-channel coding for scalable video over DS-CDMA multipath fading channels",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/959215/",
            "Abstract": "We extend our previous work on joint source-channel coding to scalable video transmission over wireless direct-sequence code-division-multiple-access (DS-CDMA) multipath fading channels. A SNR scalable video coder is used and unequal error protection (UEP) is allowed for each scalable layer. At the receiver-end an adaptive antenna array auxiliary-vector (AV) filter is utilized that provides space-time RAKE-type processing and multiple-access interference suppression. The choice of the AV receiver is dictated by realistic channel fading rates that limit the data record available for receiver adaptation and redesign. Our problem is to allocate the available bit rate of the user of interest between source and channel coding and across scalable layers, while minimizing the end-to-end distortion of the received video sequence. The optimization algorithm that we propose utilizes universal rate-distortion characteristic …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Motion compensation as sparsity-aware decoding in compressive video streaming",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6005006/",
            "Abstract": "We consider a video transmission system where the transmitter performs merely direct compressive sensing with no other forms of encoding/processing and the burden of quality video sequence reconstruction falls solely on the receiver side. We show that effective implicit motion compensation can be carried out at the receiver/decoder via iterative sparsity-aware recovery on adaptively forward-backward estimated Karhunen-Loève bases. Experiments illustrate these developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Conformity evaluation and L1-norm principal-component analysis of tensor data",
            "Publication year": 2019,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10989/109890P/Conformity-evaluation-and-L1-norm-principal-component-analysis-of-tensor/10.1117/12.2520538.short",
            "Abstract": "Multi-modal tensor data sets arise with increasing frequency in modern day scientific and engineering applications, for example in biomedical sciences and autonomous engineered systems. Over the past twenty years, tensor-domain data analysis has been attempted primarily in the context of standard (L2-norm) eigenvector decompositions across tensor domains. The algorithms are not joint-tensor-domain optimal and exhibit the familiar sensitivity to faulty/corrupted/missing measurements that characterizes all L2-norm principal-component analysis methods. In this work, we present a robustified method to evaluate the conformity of tensor data entries with respect to the whole accessible data set. Conformity evaluation is based on a continuously refined sequence of calculated L1- norm tensor subspaces. The theoretical developments are illustrated in the context of a multisensor localization application that …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:hXZnTIgIr50C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Rank--Optimal Adaptive Design of Binary Spreading Codes",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4294159/",
            "Abstract": "Over the real/complex field, the spreading code that maximizes the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum-SINR linear filter is the minimum-eigenvalue eigenvector of the interference autocovariance matrix. In the context of binary spreading codes, the maximization problem is NP-hard with complexity exponential in the code length. A new method for the optimization of binary spreading codes under a rank-2 approximation of the inverse interference autocovariance matrix is presented where the rank-2-optimal binary code is obtained in lower than quadratic complexity. Significant SINR performance improvement is demonstrated over the common binary hard-limited eigenvector design which is shown to be equivalent to the rank-1-optimal solution.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Toward a preferred 4 x 4 space-time block code: A performance-versus-complexity sweet spot with linear-filter decoding",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6468994/",
            "Abstract": "We develop a new 4 × 4 Hadamard-precoded quasi-orthogonal space-time block code (QO-STBC) that enables highly effective near-maximum-likelihood (near-ML) reliability-based prioritized symbol detection using linear filters. Approximate block-error-rate minimization is being used to optimize the code rotation angle. Detailed computational complexity evaluation of the decoder in terms of real multiplications and additions shows significant complexity reduction for symbol alphabet sizes of interest. Numerical and simulation studies demonstrate negligible bit-error-rate degradation compared to the state-of-the-art in bit-error-rate by ML decoded 4 × 4 codewords.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:UHK10RUVsp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity, throughput, and delay of slotted Aloha DS-CDMA links with adaptive space-time auxiliary-vector receivers",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1381427/",
            "Abstract": "We investigate the user capacity, throughput, and delay characteristics of a mobile slotted ALOHA direct-sequence code-division-multiple-access (DS-CDMA) link with dedicated signatures under multipath fading and packet-rate adaptive antenna array signal reception. For a given system transmission bit rate, the packet size is designed to be sufficiently small to conform with the coherence time of the channel. Then, on an individual packet-by-packet basis, a phase-ambiguous spatial-temporal channel estimate is produced by a blind (unsupervised) eigensubspace procedure. The space-time channel estimate is phase corrected via a few pilot packet mid-amble bits and used for joint spatial-temporal multiple-access-interference suppression according to the principles of auxiliary-vector filtering. Subsequently, packet success probabilities are derived in the presence or absence of forward error correction and are …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the L1-norm approximation of a matrix by another of lower rank",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7838241/",
            "Abstract": "In the past decade, there has been a growing documented effort to approximate a matrix by another of lower rank minimizing the L 1 -norm of the residual matrix. In this paper, we first show that the problem is NP-hard. Then, we introduce a theorem on the sparsity of the residual matrix. The theorem sets the foundation for a novel algorithm that outperforms all existing counterparts in the L 1 -norm error minimization metric and exhibits high outlier resistance in comparison to usual L 2 -norm error minimization in machine learning applications.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:pcWPcJyQGiUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "JOURNAL ARTICLE (Post Print)",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Direction finding with L1-norm subspaces",
            "Publication year": 2014,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9109/91090J/Direction-finding-with-L1-norm-subspaces/10.1117/12.2053049.short",
            "Abstract": "Conventional subspace-based signal direction-of-arrival estimation methods rely on the familiar L2-norm-derived principal components (singular vectors) of the observed sensor-array data matrix. In this paper, for the first time in the literature, we find the L1-norm maximum projection components of the observed data and search in their subspace for signal presence. We demonstrate that L1-subspace direction-of-arrival estimation exhibits (i) similar performance to L2 (usual singular-value/eigen-vector decomposition) direction-of-arrival estimation under normal nominal-data system operation and (ii) significant resistance to sporadic/occasional directional jamming and/or faulty measurements.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:0kLwNjf3oFwC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Code division multiplexing performance of minimum total-squared-correlation binary signature sets",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1258561/",
            "Abstract": "The total-squared-correlation (TSC), maximum squared correlation (MSC), total asymptotic efficiency (TAE), and sum capacity (C/sub sum/) of underloaded signature sets as well as the TSC and C/sub sum/ of overloaded signature sets are metrics that are optimized simultaneously over the real/complex field. We derive closed-form expressions for the MSC, TAE, and C/sub sum/ of minimum-TSC binary signature sets. Our expressions disprove the general equivalence of these performance metrics over the binary field and establish conditions on the number of signatures and signature length under which simultaneous optimization can or cannot be possible. We comment that the sum capacity loss of the recently designed minimum-TSC binary sets is found to be rather negligible in comparison with minimum-TSC real/complex-valued (Welch-bound-equality) sets.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal sparse L1-norm principal-component analysis",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7952644/",
            "Abstract": "We present an algorithm that computes exactly (optimally) the S-sparse (1≤S<;D) maximum-L 1 -norm-projection principal component of a real-valued data matrix X ∈ ℝ D×N  that contains N samples of dimension D. For fixed sample support N, the optimal L 1 -sparse algorithm has linear complexity in data dimension, O(D). For fixed dimension D (thus, fixed sparsity S), the optimal L 1 -sparse algorithm has polynomial complexity in sample support, O(N S ). Numerical studies included in this paper illustrate the theoretical developments and demonstrate the remarkable robustness to faulty data/measurements of the calculated sparse-L 1  principal components.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:S_Qw7xXuMuIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic Joint PHY-MAC Waveform Design for IoT Connectivity",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8683748/",
            "Abstract": "We envision dense network deployments of Internet-of-Things (IoT) connected devices that report data to a common base station (BS). The devices utilize repeats of a basic shaping pulse occupying the entire continuum of the device-accessible spectrum. We propose an optimal algorithm to adaptively design sparse waveforms with well-placed energy that maximize the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum-SINR linear filter at the BS. Additionally, we propose a computationally efficient suboptimal waveform design algorithm for the same problem. Simulation studies show that the proposed waveform designs attain superior pre-detection SINR performance than conventional binary, quaternary, and sparse-binary/quaternary waveform designs, thus offering a promising PHY-MAC approach to maintain wireless connectivity in overloaded network setups.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:kcGNQN_anIUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effects of medium heterogeneities on direction of arrival estimation",
            "Publication year": 2020,
            "Publication url": "https://asa.scitation.org/doi/pdf/10.1121/1.5147421",
            "Abstract": "A scaled experiment in a water tank was conducted to study effects of medium heterogeneities on underwater acoustic propagation while controlling the so-called fluctuations. An ultrasonic wave is transmitted (a pulse train at center frequency f = 2.25 MHz) throughout an acoustic lens presenting a plane input face and a randomly rough output face inducing spatial fluctuations of the sound pressure field. The roughness statistics are tuned so that the fluctuating pressure field presents features comparable to what can be observed in the case of acoustic waves propagating through a fluctuating ocean. Generally speaking, disturbances can include path propagation delays, multipath dependent Doppler spreading, scattering from the sea surface or bottom, and coherence loss over the array aperture arising from dynamic wave-front fluctuations due to internal waves. This last topic is the main focus of our study. Signal …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:eG7oJ4UONFcC",
            "Publisher": "Acoustical Society of America"
        },
        {
            "Title": "The optimal transmission power per round for hybrid-ARQ Rayleigh fading links",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5502465/",
            "Abstract": "We address the fundamental problem of identifying the optimal power allocation sequence for hybrid automatic-repeat-request (H-ARQ) communications over quasistatic Rayleigh fading channels. For any targeted H-ARQ link outage probability, we find the sequence of power values that minimizes the average total expended transmission power. The newly founded power allocation solution reveals that conventional equal-power H-ARQ assignment is far from optimal. For example, for targeted outage probability of 10 -3  with a maximum of two transmissions, the average total transmission power with optimal assignment is 9dB lower than the equal-power protocol. The difference in average total power cost grows further when the number of allowable retransmissions increases (for example, lldB gain with a cap of 5 transmissions) or the targeted outage probability decreases (27dB gain with outage probability 10 -5 …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ROCH: Software-defined radio toolbox for experimental evaluation of all-spectrum cognitive networking",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801676.2801686",
            "Abstract": "We present the first complete software-based framework for real-time experimental evaluation of secondary multi-hop cognitive underlay networks with decentralized control. We build a -node software-defined radio testbed and implement a distributed algorithm that maximizes the secondary network throughput, while at the same time avoids interference to primary users through joint Routing and cOde-waveform CHannelization (ROCH). ROCH is implemented using GNU Radio and Universal Software Radio Peripherals (). The implementation of ROCH is facilitated by the architectural abstractions of a novel radio framework, referred to as RcUBe, that provides reconfigurability at the PHY, MAC, and network layers of the protocol stack.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:PcT55Ow6fAIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IEEE Executive Staff",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1510704/",
            "Abstract": "IEEE Transactions on Neural Networks publication information Page 1 IEEE \nTRANSACTIONS ON NEURAL NETWORKS IEEE TRANSACTIONS ON NEURAL \nNETWORKS is published by the IEEE Computational Intelligence Society. Members may \nsubscribe to this TRANSACTIONS for $10.00 per year. IEEE student members may \nsubscribe for $5.00 per year. Nonmembers may subscribe for $895.00. For additional \nsubscription information visit http://www.ieee.org/nns/pubs. For information on receiving this \nTRANSACTIONS, write to the IEEE Service Center at the address below. Member copies of \nTransactions/Journals are for personal use only. For more information about this \nTRANSACTIONS see http://www.ieee-cis/org/pubs/tnn Editor-in-Chief MARIOS M. \nPOLYCARPOU Dept. Elect. Comput. Eng. Univ. of Cyprus CY-1678 Nicosia, Cyprus Tel. +357 \n22892274 Fax: +357 22892260 ieeetnn@ucy.ac.cy Book and Lab -…",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Analytical Framework for the Optimal Design and Detection of Covert Channel Communications",
            "Publication year": 2006,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA451407",
            "Abstract": "We propose an iterative generalized least squares procedure to recover unknown messages hidden in image hosts via spread-spectrum embedding. Neither the original host nor the embedding signature is assumed available. We demonstrate that for hidden messages of sufficient length data sample support, recovery can be achieved with probability of error close to what may be attained with known embedding signature and known original host autocorrelation matrix. For small hidden messages, the signature estimate calculated by the iterative generalized least squares procedure can be fed as initial value to a computationally costly expectation-maximization signature identification scheme that we derive. Message recovery can again be carried out successfully by means of a linear sample-matrix-inversion minimum-mean-square-error receiver.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:Tiz5es2fbqcC",
            "Publisher": "STATE UNIV OF NEW YORK AT ALBANY"
        },
        {
            "Title": "Small-sample-support channel estimation for massive MIMO systems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8461599/",
            "Abstract": "We consider the problem of blind channel estimation with minimal pilot signaling in multi-cell multi-user MIMO systems with very large antenna arrays at the base station. We develop a least-squares (LS)-type algorithm that iteratively extracts channel and data estimates in short-data record multicell massive MIMO environments with no prior channel state information. The proposed algorithm utilizes a novel initialization step that is based on auxiliary-vector (AV) subspace decomposition. Simulation studies show that for pilot signaling of about 4%, information data extraction can be achieved with lower probability of error than eigendecomposition-based initialization techniques, while for observation records of sufficient length it nearly attains the error rate performance achieved with complete knowledge of the channels.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:v7LLNfYe7h0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Minimum total-squared-correlation design of DS-CDMA binary signature sets",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/965529/",
            "Abstract": "The Welch lower bound (see Welch, L.R., IEEE Trans. Inform. Theory, vol.20, p.397-9, 1974; Massey, J. L. and Mittelholzer, T., \"Sequences II, Methods in Communication, Security, and Computer Sciences\", p.63-78, Springer-Verlag, New York, 1993) on the total-squared-correlation (TSC) of signature sets is known to be tight for real-valued signatures and loose for binary signatures whose number is not a multiple of 4. We derive new bounds on the TSC of binary signature sets for any number of signatures K and any signature length L. For almost all K, L in {1, 2, ..., 200}, we develop simple algorithms for the design of optimum binary signature sets that achieve the new bound.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "that all a (i) are inside fa: ka 0 a0k2 g.",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=2660897331597185192&hl=en&oi=scholarr",
            "Abstract": "We develop a new subspace direction-of-arrival (DOA) esti-mation procedure that utilizes a noneigenvector basis. Computation of the basis is carried out by a modified version of the orthogonal auxiliary-vector (AV) filtering algorithm. The procedure starts with the linear transformation of the array response scanning vector by the input autocorrelation matrix. Then, successive orthogonal maximum cross-correlation auxiliary vectors are calculated to form a basis for the scanner-extended signal subspace. As a performance evaluation example, our studies for uncorrelated sources demonstrate a gain in the order of 15 dB over MUSIC, 7 dB over ESPRIT, and 3 dB over the grid-search maximum likelihood DOA estimator at probability of resolution 0.9 with a ten-element array and reasonably small observation data records. Results for correlated sources are reported as well.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:dHRcJqc9SEQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Meeting the Welch and Karystinos-Pados bounds on DS-CDMA binary signature sets",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1024759310058",
            "Abstract": "The Welch lower bound on the total-squared-correlation (TSC) of binary signature sets is loose for binary signature sets whose length L is not a multiple of 4. Recently Karystinos and Pados [6,7] developed new bounds that are better than the Welch bound in those cases, and showed how to achieve the bounds with modified Hadamard matrices except in a couple of cases. In this paper, we study the open cases.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Circuitry and method for demodulating code division multiple access (CDMA) signals",
            "Publication year": 2000,
            "Publication url": "https://patents.google.com/patent/US6078573A/en",
            "Abstract": "A method and apparatus is provided for demodulating direct sequence, spread spectrum CDMA signals in the presence of unknown spread-spectrum multiuser interference and additive white Gaussian noise, using only the available received signal and the predetermined, pre-stored spreading code assigned to user of interest. The method includes the steps of sampling the incoming channel signal at the chip rate to produce an incoming sampled signal, supplying the incoming sampled signal to filter having tap coefficients corresponding to an auxiliary vector, the filter having an output representing an estimate of the transmitted symbol, providing the output to a sign determining components and determining the sign of the output to thereby generate the detected symbol.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:bFuYayV9R1gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An All-GNU Radio Software-defined Radio Transceiver for All-Spectrum Cognitive Channelization",
            "Publication year": 2014,
            "Publication url": "https://ece.northeastern.edu/wineslab/papers/GrCon14.pdf",
            "Abstract": "An All-GNU Radio Software-defined Radio Transceiver for All-Spectrum Cognitive \nChannelization Page 1 An All-GNU Radio Software-defined Radio Transceiver for All-Spectrum \nCognitive Channelization George Sklivanitis,† Emrecan Demirors,‡, Adam Gannon,† Dimitris A. \nPados,† Stella N. Batalama,‡ Tommaso Melodia,† and John D. Matyjas⋆ †SUNY at Buffalo, \nDepartment of Electrical Engineering ‡Northeastern University, Department of Electrical and \nComputer Engineering *Air Force Research Laboratory/RGIF, Rome, NY September 17, 2014 \nState University of New York at Buffalo 1 / 26 Page 2 Outline Motivation Basic Idea Testbed \nArchitecture & Design Experimental Results Conclusions State University of New York at Buffalo \n2 / 26 Page 3 Motivation Highly occupied spectrum bands + Exponential growth in traffic. \nUnderutilization of the device’s available/accessible bandwidth. Practical co-existence of and …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:ohFW0PAxsewC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spread-spectrum cognitive networking: Distributed channelization and routing",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6127472/",
            "Abstract": "We study a framework that captures the interdependencies between spreading channelization and routing for a secondary multi-hop cognitive radio network that operates cognitively to coexist with primary users. We consider interactions between dynamic routing and code-division channelization functionalities for cognitive radio networks. With this respect, we study the effect of joint routing, spreading code and power allocation on the network throughput. A solution for joint routing and spread-spectrum channelization is proposed as a localized approximation of the throughput-maximizing problem. Specifically, power and spreading code are allocated to guarantee the quality of service of the on-going primary and secondary transmissions, while the routing algorithm dynamically selects relays based on the network traffic dynamics and on the achievable data rates on different secondary links.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Narrowband interference avoidance in OFDM-based UWB communication systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4303363/",
            "Abstract": "In this letter we present a new method for mitigating narrowband interference in orthogonal frequency-division multiplexing-based ultra-wideband communication systems. The proposed narrowband interference avoidance (NBIA) method performs spectral shaping of the transmitted signal using binary signature sequences with minimum total squared correlation (TSC) to avoid the narrowband interfering signal. We illustrate the proposed method with plots that show the spectrum of the transmitted signal with and without NBIA, and also present numerical results obtained from simulations showing improvement in the bit error rate (BER) performance of the system when NBIA is employed.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:Cy13deThEpcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive sparse-binary waveform design for all-spectrum channelization",
            "Publication year": 2017,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10211/102110B/Adaptive-sparse-binary-waveform-design-for-all-spectrum-channelization/10.1117/12.2262311.short",
            "Abstract": "We introduce maximum-SINR, sparse-binary waveforms that modulate data information symbols over the entire continuum of the available/device-accessible spectrum. We present an optimal algorithm that designs the proposed waveforms by maximizing the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum- SINR linear filter at the receiver. In addition, we propose a suboptimal, computationally-efficient algorithm. Simulation studies compare the proposed sparse-binary waveforms with their conventional non-sparse binary counterparts and demonstrate their superior SINR performance. The post-filtering SINR and bit-error rate (BER) improvements attained by the proposed waveforms are also experimentally verified in a software-defined radio testbed operating in multipath laboratory environment, in the presence of colored interference.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:9w9GTvUEN2YC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Data conformity evaluation: a novel approach for IoT security",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8767175/",
            "Abstract": "We consider the problem of attack detection for IoT networks based only on passively collected network parameters. For the first time in the literature, we develop a blind attack detection method based on data conformity evaluation. Network parameters collected passively, are converted to their conformity values through iterative projections on refined L 1 -norm tensor subspaces. We demonstrate our algorithmic development in a case study for a simulated star topology network. Type of attack, affected devices, as well as, attack time frame can be easily identified.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:EmjvLWWcsQIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rate-adaptive compressive video acquisition with sliding-window total-variation-minimization reconstruction",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8717/871703/Rate-adaptive-compressive-video-acquisition-with-sliding-window-total-variation/10.1117/12.2017751.short",
            "Abstract": "We consider a compressive video acquisition system where frame blocks are sensed independently. Varying block sparsity is exploited in the form of individual per-block open-loop sampling rate allocation with minimal system overhead. At the decoder, video frames are reconstructed via sliding-window inter-frame total variation minimization. Experimental results demonstrate that such rate-adaptive compressive video acquisition improves noticeably the rate-distortion performance of the video stream over fixed-rate acquisition approaches.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "The maximum squared correlation, total asymptotic efficiency, and sum capacity of minimum total-squared-correlation quaternary signature sets",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7077675/",
            "Abstract": "In this paper, we derive closed-form expressions for the maximum squared correlation (MSC), total asymptotic efficiency (TAE), and sum capacity (C sum ) of minimum total squared correlation (TSC) quaternary signature sets. While TSC, MSC, TAE, and C sum  are equivalent optimization metrics over the real/complex field, our developments show that such equivalence does not hold, in general, over the quaternary field. We establish conditions on the number of signatures and signature length under which simultaneous optimization can or cannot be possible.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal binary signature sets under cyclic shifts",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1605793/",
            "Abstract": "We derive new bounds on the periodic (cyclic) total squared correlation (PTSC) of binary antipodal signature sets for any number of signatures K and any signature length L. Optimal designs that achieve the new bounds are then developed for several (K, L) cases. As an interesting side result, binary periodic complementary sequence (PCS) sets are seen to be PTSC optimal. Furthermore, as an example that arguably may be against common expectation, it is seen that neither the Gold nor the Kasami sets are PTSC optimal; the optimal sets provided herein are in this sense better suited for asynchronous and/or multipath code-division multiplexing applications",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cloud-assisted individual L1-PCA face recognition using wavelet-domain compressed images",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7764600/",
            "Abstract": "Face recognition has been an active research field for a long time, and recently new challenges have arisen in designing cloud-assisted face recognition algorithms. In a cloud assisted face recognition system, mobile devices acquire the data images; then, in order to unbind the cloud face recognition algorithm from the particular features extracted at the mobile device, the images are encoded and uploladed into the cloud. In this framework, it is important to understand and control the effect of the image compression stage performed at the mobile device on the performances of the face recognition algorithms realized within the cloud. Here, we analyze the impact of wavelet domain image compression on the Individual Adaptive (IA) L 1 -PCA subspace computation and assess the performance of a classifier operating on data characterized by increasing compactness and accordingly decreasing accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:lL5f5cZgq8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal orthogonal carriers and sum-SINR/sum-capacity of the multiple-access vector channel",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6164083/",
            "Abstract": "For the general correlated multiple-access vector channel, we derive algebraically the sum-SINR (signal-to-interference-plus-noise ratio) optimal orthonormal set of carriers for any given set of carrier amplitudes. If, in addition, the correlated multiple-access channel is assumed Gaussian, the sum-capacity optimal orthonormal carrier set design and the jointly sum-capacity optimal orthonormal carrier and power assignment, for a given power budget, follow readily.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hybrid-ARQ as a communications security measure",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6854691/",
            "Abstract": "We consider arbitrary Hybrid-Automatic-Repeat-Request (H-ARQ) wireless links over quasi-static Rayleigh fading channels. In this paper, we translate the repeat-request advantage of the intended receiver over potential eavesdroppers to link security. In particular, with statistical-only knowledge of the channel and noise, we find for the first time in the literature the optimal power allocation sequence over the H-ARQ rounds that maximizes the outage probability of eavesdroppers for any given target outage probability of the trusted receiver. Simulation studies demonstrate orders of magnitude difference in outage probability between eavesdroppers and intended receiver.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:_u2aKJ9e-CoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reduced-Rank L1-Norm Principal-Component Analysis With Performance Guarantees",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9266768/",
            "Abstract": "Standard Principal-Component Analysis (PCA) is known to be sensitive to outliers among the processed data. On the other hand, L1-norm-based PCA (L1-PCA) exhibits sturdy resistance against outliers, while it performs similar to standard PCA when applied to nominal or smoothly corrupted data   . Exact calculation of the    L1-norm Principal Components (L1-PCs) of a rank-   data matrix    costs      ,   . In this work, we present reduced-rank L1-PCA (RR L1-PCA): a hybrid approach that approximates the    L1-PCs of    by the L1-PCs of its L2-norm-based rank-   approximation (  ), calculable exactly with reduced complexity   . The proposed method combines the denoising capabilities and low computation cost of standard PCA with the outlier-resistance of L1-PCA. RR L1-PCA is accompanied by formal performance guarantees as well as thorough numerical studies that …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:s_OEDnM-dbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Underwater acoustic communications using quasi-orthogonal chirps",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8335661/",
            "Abstract": "We propose a quasi-orthogonal chirp waveform design technique for underwater acoustic communications and study the correlation performance of binary linear chirp waveforms under different bandwidth and time constraints. Specifically, we consider binary information symbols that are carried over optimized binary linear chirp waveforms and transmitted over an underwater acoustic multipath channel. We present receiver design considerations and derive a closed-form expression for the cross-correlation coefficient of binary linear chirp waveforms. The bit-error-rate (BER) performance of the proposed quasi-orthogonal chirp waveforms is evaluated through both simulations and experiments with in-house built software-defined underwater acoustic modems.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:vefPE_iVbj4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Short-Data-Record Adaptive Receivers for Rapidly Changing Communications Environments",
            "Publication year": 2003,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA417694",
            "Abstract": "We defined and pursued a novel line of research that lies in a multidisciplinary intersection of Estimation Theory, Communications Theory, and Mean-Square optimum linear filtering. Consider an arbitrary input signal vector space and a given information bearing signal vector to be protected or recovered in the presence of multiuser or other forms of heavy interference. Based strictly on statistical conditional optimization principles, we developed an iterative algorithm that starts from the conventional matched-filter correlator and generates a sequence of linear filters auxiliary-vecto filters that converges to the exact MS-optimum solution. At each iteration step, the filter is given as a direct function of the input autocorrelation matrix, the signal vector waveform to be protected, and the filter at the previous iteration. When the autocorrelation matrix is sample-average estimated from a short data record, this procedure offers the means for effective control over the filter estimator bias versus co-variance trade-off. For a fixed data record size the filter estimators in this sequence have rapidly decreasing bias and gracefully increasing variance. They outperform other known estimators such as Sample-Matrix-lnversion SMI, Diagonal-Loading DL SMI, RLS, LMS, reduced-rank eigenvector decomposition, and multistage nested Wiener filter. While all of the above estimators converge to the optimum MMSEMVDR solution for infinitely long data records, for any given finite data set there is at least one AV filter estimator in the sequence that outperforms all SMI, DL-SMI, RLS, LMS, reduced-rank eigenvector and multistage nested Wiener filter estimators. The theoretical …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:tOudhMTPpwUC",
            "Publisher": "STATE UNIV OF NEW YORK AT BUFFALO AMHERST"
        },
        {
            "Title": "The average total power consumption of cooperative hybrid-ARQ on quasi-static Rayleigh fading links",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5685233/",
            "Abstract": "In this paper, the average total power consumption per information packet is investigated for a cooperative hybrid automatic-repeat-request (H-ARQ) protocol in a quasistatic Rayleigh fading environment. Specifically, a closed-form expression of the average total transmission power is obtained for the cooperative H-ARQ relay protocol, in which the source may use different transmission power level in different (re-)transmission rounds. The closed-form expression is valid for any maximum number of (re-)transmission rounds L allowed by the protocol and may play a key role thereafter in optimizing power allocation. Since the closed-form expression is complicated for large L, an approximation of the average total transmission power is developed which is asymptotically tight at high SNR. Extensive simulation and numerical results are also provided herein to illustrate and validate the theoretical results.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed spectrum management and relay selection in interference-limited cooperative wireless networks",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2030613.2030639",
            "Abstract": "It is well known that the data transport capacity of a wireless network can be increased by leveraging the spatial and frequency diversity of the wireless transmission medium. This has motivated the recent surge of research in cooperative and dynamic-spectrum-access networks. Still, as of today, a key open research challenge is to design distributed control strategies to dynamically jointly assign (i) portions of the spectrum and (ii) cooperative relays to different traffic sessions to maximize the resulting network-wide data rate.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal multiuser spread‐spectrum data hiding in digital images",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.1001",
            "Abstract": "In this work, we intend to carry out optimized spread‐spectrum concealment of multiuser data under a given digital image. First, the overall image is pre‐processed into transform‐domain small blocks from which host vectors are obtained via zig‐zag scanning vectorization. Multiuser data hiding is performed in the generated host vectors. Under this data hiding system model, we give an orthogonal set of embedding spread‐spectrum signatures that achieves maximum sum signal‐to‐interference‐plus‐noise ratio at the output of the linear‐filter receivers for any fixed embedding amplitude values. Then, for any given total embedding distortion constraint, we present the optimal multi‐signature assignment and amplitude allocation that maximizes the sum capacity of the concealment procedure. The practical implication of the results is sum signal‐to‐interference‐plus‐noise ratio, sum‐capacity optimal multiuser/multi …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:0iM-huCvmk0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital Recording System Identification Based on Blind Deconvolution",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8715546/",
            "Abstract": "In this work, we develop a theoretical framework for reliable digital recording system identification from digital audio files alone, for forensic purposes. A digital recording system consists of a microphone and a digital sound processing card. We view the cascade as a system of unknown transfer function. We expect the same manufacturer and model microphone-sound card combinations to have very similar/near identical transfer functions, bar any unique manufacturing defect. Input voice (or other) signals are modeled as non-stationary processes. The technical problem under consideration becomes blind deconvolution with non-stationary inputs, as it manifests itself in the specific application of digital audio recording equipment classification. Experimental results demonstrate over 99.2% accuracy in identification of the recording devices.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:vrnMIr82eJkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low complexity decoding of finite geometry LDPC codes",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1204470/",
            "Abstract": "We develop a new low complexity algorithm for decoding low-density parity-check (LDPC) codes. The developments are oriented specifically toward the low cost-yet effective-decoding of (high rate) finite geometry LDPC codes. The decoding procedure updates the hard-decision received vector iteratively in search of a valid codeword in the vector space. Only one bit is changed in each iteration and the bit selection criterion combines the number of failed checks and the reliability of the received bits. Prior knowledge of the signal amplitude and noise power is not required. An optimal mechanism to avoid infinite loops in the search is also proposed. Our studies show that the algorithm achieves an appealing performance versus complexity trade-off for finite geometry LDPC codes.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bit-error-rate and Maximum-SINR Performance of the Odd-length Minimum-TSC Binary Signature Sets",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=11646382698887108037&hl=en&oi=scholarr",
            "Abstract": "Binary signature sets that exhibit minimum total-squared-correlation (TSC) were recently designed in [1]-[3]. In this article, we focus on such sets with signatures of odd length and we derive closed-form expressions for the signature cross-correlation matrix and its inverse. Then, we derive analytic expressions for (i) the bit-error-rate (BER) upon decorrelating processing and (ii) the maximum achievable signalto-interference-plus-noise (SINR) ratio upon minimum-meansquare-error (MMSE) filtering. We find that minimum-TSC binary sets with signature length of the form 4m+ 1, m=1, 2,..., perform practically at the single-user-bound (SUB) after decorrelating or MMSE processing (not true for “4m− 1” sets) and are in all respects superior to minimum-TSC binary sets with signature length of the form 4m− 1 (the latter class includes the familiar Gold sets as a small proper subset).",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:2TuIPqOg0e0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "M-ary orthogonal chirp modulation for coherent and non-coherent underwater acoustic communications",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1803.02950",
            "Abstract": "We propose an orthogonal chirp waveform design for underwater acoustic (UW-A) communications and analyze the cross-correlation characteristics of orthogonal chirp waveforms in coherent and non-coherent detections. We consider information symbols are carried over proposed M-ary orthogonal chirp waveforms for UW-A transmissions. Moreover, we develop a coherent and an optimal non-coherent receivers based on proposed chirp waveforms. Explicit derivations include closed-form expressions for cross-correlation coefficients, and theoretical bit-error-rate (BER) of coherent and non-coherent receivers. Performance of M-ary orthogonal chirp waveforms is evaluated in water tank experiments. Therefore, we have demonstrated the effectiveness of proposed M-ary orthogonal chirp modulation in UW-A multipath fading channel.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:e-nnqdki048C",
            "Publisher": "Unknown"
        },
        {
            "Title": "DOWNLINK MULTIUSER TRANSMIT BEAMFORMING UNDER TOTAL TRANSMIT POWER CONSTRAINT",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Pados/publication/4229054_Multiuser_transmit_beamforming_under_total_transmit_power_constraint/links/0046351ad016fcfa60000000/Multiuser-transmit-beamforming-under-total-transmit-power-constraint.pdf",
            "Abstract": "We consider a wireless downlink multiuser multipleinput single-output (MISO) system and we investigate the problem of jointly optimal beamforming and power allocation. In particular, under a total transmit powerbudget constraint and either exact or second-order statistics knowledge of the channel of all users we find the optimum set of beam vectors and associated power values such that the sum-rate between the base station and the end users is maximized. Then, we formulate and solve two variations of the above optimization problem as a low and high signal-to-interference-plus-noise ratio (SINR) approximation, respectively. To solve all optimization problems, we invoke the theory of uplink-downlink duality and derive computationally simple, coupled iterative procedures with guaranteed convergence.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive assignment of binary user spreading codes in DS-CDMA systems",
            "Publication year": 2001,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4395/0000/Adaptive-assignment-of-binary-user-spreading-codes-in-DS-CDMA/10.1117/12.438280.short",
            "Abstract": "In direct-sequence code-division-multiple-access (DS-CDMA) systems, the pre-detection signal-to-interference-plus-noise ratio (SINR) at the output of the single-user minimum-mean-square-error (MMSE) filter is a function of the specific user spreading code (signature). In this paper, we consider the adaptive optimization of the user signature assignment such that the output SINR of the MMSE filter is maximized under a transmitter power constraint. In the context of binary signatures, the complexity of the signature optimization procedure is exponential in the processing gain. A low-cost suboptimum adaptive binary signature assignment algorithm is derived based on conditional optimization principles. We use this algorithm to design an efficient system-wide multiuser adaptive signature set assignment scheme. The performance of the proposed scheme is evaluated under asynchronous multipath fading DS-CDMA …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:M3ejUd6NZC8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "On orthogonal space-time block codes and transceiver signal linearization",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1584398/",
            "Abstract": "We present a necessary and sufficient condition for any orthogonal space-time block code (STBC) to allow transceiver signal linearization (as in the well-known case of the Alamouti scheme). Then, we show that all square orthogonal STBC's that satisfy the condition have rate that goes to zero linearly with the number of transmit antennas. Hence, multiple-antenna systems with orthogonal STBC's and satisfactory rate are possible only If we abandon the linearization property or utilize non-square codes (except for the 2 times 2 Alamouti code)",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Active spread-spectrum steganalysis for hidden data extraction",
            "Publication year": 2011,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA549997",
            "Abstract": "This paper considers the problem of blind active spreadspectrum SS steganalysis defined as the extraction of hidden data with no prior information. We first develop a multisignature iterative generalized least-squares M-IGLS core procedure to seek unknown messages hidden in image hosts via multi-signature direct-sequence spread-spectrum embedding. Neither the original host nor the embedding signatures are assumed available. Then, cross-correlation enhanced MIGLS CC-M-IGLS, a procedure described herein in detail that is based on statistical analysis of repeated independent M-IGSL processing of the host, is seen to offer most effective hidden message recovery. In fact, experimental studies show that the proposed CC-M-IGLS active SS steganalysis algorithm can achieve probability of error close to what may be attained with known embedding signatures and host autocorrelation matrix.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:dshw04ExmUIC",
            "Publisher": "STATE UNIV OF NEW YORK AT BUFFALO DEPT OF ELECTRICAL ENGINEERING"
        },
        {
            "Title": "Securewaveforms for SISO channels",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6638554/",
            "Abstract": "We develop a novel waveform design approach to minimize the likelihood that a message transmitted wirelessly between trusted single-antenna nodes is intercepted by an eavesdropper. In particular, first, with knowledge of the eavesdropper's channel state information (CSI) we find the optimal waveform and transmit energy that minimize the signal-to-interference-plus-noise ratio (SINR) at the output of the eavesdropper's maximum-SINR linear filter, while at the same time provide the intended receiver with a required pre-specified SINR at the output of its own max-SINR filter. Next, if prior knowledge of the eavesdropper's CSI is unavailable, we design a waveform that maximizes the amount of energy available for generating disturbance to eavesdroppers, termed artificial noise (AN), while the SINR of the intended receiver is maintained at the pre-specified level. Simulation studies demonstrate our analytical …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:7T2F9Uy0os0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Realified l1-PCA for direction-of-arrival estimation: theory and algorithms",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1186/s13634-019-0625-5",
            "Abstract": "Subspace-based direction-of-arrival (DoA) estimation commonly relies on the Principal-Component Analysis (PCA) of the sensor-array recorded snapshots. Therefore, it naturally inherits the sensitivity of PCA against outliers that may exist among the collected snapshots (e.g., due to unexpected directional jamming). In this work, we present DoA-estimation based on outlier-resistant L1-norm principal component analysis (L1-PCA) of the realified snapshots and a complete algorithmic/theoretical framework for L1-PCA of complex data through realification. Our numerical studies illustrate that the proposed DoA estimation method exhibits (i) similar performance to the conventional L2-PCA-based method, when the processed snapshots are nominal/clean, and (ii) significantly superior performance when the snapshots are faulty/corrupted.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:uQyLbZAWguAC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "ITR: Development of a Novel Short-Data-Record Adaptive Filtering Framework for Rapidly Changing Communications Environments",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=655328929446954402&hl=en&oi=scholarr",
            "Abstract": "PIs: SN Batalama and DA Pados PROJECT ABSTRACT The effectiveness of a receiver designed for a rapidly changing multiple access communications environment depends on the following design attributes:(i) low computational complexity,(ii) multiple-access-interference resistance, and (iii) system adaptivity with superior performance under limited (short) data support. Adaptive short-data-record designs appear as the natural next step for a matured discipline that has extensively addressed the first two,(i) and (ii), design objectives in ideal setups (perfectly known or asymptotically estimated statistical properties). System adaptivity based on short data records is necessary for the development of practical adaptive receivers that exhibit superior signal-to-interference-plus-noise ratio (SINR) or bit-error-rate (BER) performance when they operate in rapidly changing communications environments that limit …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:4WewbtJKmRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Short-data-record adaptive detection",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4250336/",
            "Abstract": "The classical problem of detecting a complex signal of unknown amplitude in colored Gaussian noise is revisited in the context of adaptive detection with limited training data via the auxiliary-vector (AV) filter estimation algorithm. Based on statistical conditional optimization criteria, the iterative AV algorithm starts from the target vector and adding non-orthogonal auxiliary vector components generates an infinite sequence of tests that converges to the ideal matched filter (MF) processor for any positive definite input autocorrelation matrix. Computationally, the algorithm is a simple recursive procedure that avoids explicit matrix inversion, decomposition, or diagonalization operations. When the input autocorrelation matrix is replaced by a conventional sample-average estimate, the algorithm effectively generates a sequence of MF estimators; their bias converges rapidly to zero and the covariance trace rises slowly and …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive binary signature design for code-division multiplexing",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4570246/",
            "Abstract": "When data symbols modulate a signature waveform to move across a channel in the presence of disturbance, the signature that maximizes the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum-SINR filter is the smallest-eigenvalue eigenvector of the disturbance autocovariance matrix. In digital communication systems the signature alphabet is finite and digital signature optimization is NP-hard. In this paper, we present a formal search procedure of cost, upon eigenvector decomposition, log-linear in the signature code length that returns the maximum-SINR binary signature vector near arcs of least SINR decrease from the real maximum SINR solution in the Euclidean vector space. The quality of the proposed adaptive binary designs is measured against the theoretical upper bound of the complex/real eigenvector maximizer.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Short-data-record estimators of the MVDR/NMSE filter",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/861984/",
            "Abstract": "We show that statistical conditional optimization criteria lead to the development of a simple iterative algorithm that starts from the matched filter (or constraint vector of interest) and generates a sequence of filters that converges to the minimum-variance-distortionless-response (MVDR) solution for any positive definite input autocorrelation matrix. When the input autocorrelation matrix is replaced by a conventional sample-average (positive definite) estimate, the algorithm effectively generates a sequence of MVDR filter estimators; the bias converges rapidly to zero and the covariance trace raises slowly and asymptotically to the covariance trace of the familiar sample-matrix-inversion (SMI) estimator. For short-data-records, the early elements of the generated sequence of estimators offer favorable bias/covariance balance and are seen to outperform in mean-square estimation error (constrained-)LMS, RLS-type, and …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "4, Materials, Devices, Systems, and Applications Том. 10209. Image Sensing Technologies: Materials, Devices, Systems, and Applications IV.-Сер. Image Sensing Technologies: Materials, Devices, Systems, and Applications IV",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=1180519294805185748&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:SFU-2amZ4xQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wireless Communications",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4712687/",
            "Abstract": "WIRELESS COMMUNICATIONS Page 1 IEEE TRANSACTIONS ON WIRELESS \nCOMMUNICATIONS A PUBLICATION OF THE IEEE COMMUNICATIONS SOCIETY AND THE \nSIGNAL PROCESSING SOCIETY DECEMBER 2008 VOLUME 7 NUMBER 12 ITWCAX (ISSN \n1536-1276) TRANSACTIONS LETTERS Cooperative Spectrum Sensing with Transmit and \nRelay Diversity in Cognitive Radio Networks . . . . . . . . . . . . . . . . . . . . . 4761 Wei Zhang and \nKhaled Ben Letaief Robust Scheduling in Spatial Reuse TDMA Wireless Networks . . . . . . . . . . . . \n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 4767 K. Papadaki and V. Friderikos Reliability and \nRoute Diversity in Wireless Networks. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \n. . . . . 4772 Amir E. Khandani, Jinane Abounadi, Eytan Modiano, and Lizhong Zheng An 8 x 8 \nQuasi-Orthogonal STBC Form for Transmissions over Eight or Four Antennas . . . . . . . . . . . . . . . . . …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fastest-known maximum-likelihood decoding of quasi-orthogonal STBCs with QAM signals",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6335394/",
            "Abstract": "We present a maximum-likelihood (ML) decoder with the lowest computational complexity known to-date for full-diversity, arbitrary size Quasi-Orthogonal Space-Time Block Codes (QO-STBCs) with symbols from square or rectangular quadrature amplitude modulation (QAM) constellations. We start with the formulation of an explicit joint two-complex-symbol decoder for general QO-STBCs with arbitrary complex symbols and then derive the proposed ML decoder for QO-STBCs with QAM symbols. The complexity savings are made possible by a simplified quadratic ML decoding statistic that utilizes algebraically the structure of the signal points of the QAM constellation. Comparative computational complexity analysis with existing ML implementations and simulation studies are included herein for illustration and validation purposes.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Direction-of-arrival estimation by L1-norm principal components",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7832585/",
            "Abstract": "Traditional subspace-based methods for direction-of-arrival (DoA) estimation rely on the L2-norm principal components (L2-PCs) of the sensor-array data. In view of the well-documented sensitivity of L2-PCs against outliers among the processed data (occurring in this case, e.g., due to intermittent directional jamming), we propose instead DoA estimation using outlier-resistant L1-norm principal components (L1-PCs) of the recorded snapshots. Our simulation studies illustrate that the proposed method exhibits (i) similar performance to conventional L2-PC-based DoA estimation, when the snapshot-data are nominal/clean, and (ii) significantly superior performance when part of the snapshots are corrupted.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:gYnLYBw1zZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Autonomous Plankton Classification from Reconstructed Holographic Imagery by L1-PCA-assisted Convolutional Neural Networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9389240/",
            "Abstract": "Studying and monitoring plankton distribution is vital for global climate and environment protection as they are the most elementary part of oceanic eco-systems. However, the conventional methods and techniques used for understanding the planktons are slow and lacks precision and therefore, in modern day scientific and engineering implementations, Convolutional Neural Networks is extensively used in deep learning and machine learning applications as it outperforms traditional manual approach. Dynamic nature of oceans make it very challenging to monitor these microscopic organisms. Our approach here is to generate a powerful automated plankton recognition system to autonomously identify them and improve the D-CNN for classification of the Plankton holographic imagery curated with the method of Data Conformity Evaluation. The performance of D-CNN classifier is improved by various hyper-parameter …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:6xXPb0EiZccC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network throughput improvement in cognitive networks by joint optimization of spectrum allocation and cross-layer routing",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Emrecan-Demirors/publication/264233856_Network_Throughput_Improvement_in_Cognitive_Networks_by_Joint_Optimization_of_Spectrum_Allocation_and_Cross-layer_Routing/links/53d3305c0cf220632f3cc997/Network-Throughput-Improvement-in-Cognitive-Networks-by-Joint-Optimization-of-Spectrum-Allocation-and-Cross-layer-Routing.pdf",
            "Abstract": "This paper introduces innovative technology development that will improve performance of next-generation cognitive wireless networking among space, air, and ground assets. The paper describes methods to develop a system where cognitive users transmit wideband spread-spectrum signals that are designed to adaptively avoid the interference dynamics of the available spectrum at the receiver. These technological advances can achieve improvement in network throughput, delay, and reliability. Theoretical performance expectations are given. The theoretical approach is translated to the construction of specific software techniques and their implementation within the cross-layer wireless communications architecture. The hardware/software testbed that simulates a dynamic Ad Hoc Software Defined Radio (SDR) network is described, and a series of tests to measure the value of the optimization techniques is given. Preliminary test results and the total expected performance improvements are shown.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:2mikiJ1VBVsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fast Maximum-Likelihood Decoding of 4X4 Full-Diversity Quasi-Orthogonal STBCs with QAM Signals",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5684116/",
            "Abstract": "In this paper, we present the lowest-computational-complexity maximum-likelihood (ML) decoder known to-date for 4×4 full-diversity Quasi-Orthogonal Space-Time Block Codes (QO-STBC) with symbols from square or rectangular quadrature amplitude modulation (QAM) constellations. The complexity savings come from a simplified quadratic ML decoding statistic that is being presented and the utilization of the signal points of the QAM constellation. Comparative computational complexity analysis is carried out and a simulation study demonstrates the theoretical equivalence of the proposed and original ML implementation.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Layered Video Transmission over Multirate DS-CDMA Яireless Systems",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5022/0000/Layered-video-transmission-over-multirate-DS-CDMA-wireless-systems/10.1117/12.476609.short",
            "Abstract": "n this paper, we consider the transmission of video over wireless direct-sequence code-division multiple access (DS-CDMA) channels. A layered (scalable) video source codec is used and each layer is transmitted over a different CDMA channel. Spreading codes with different lengths are allowed for each CDMA channel (multirate CDMA). Thus, a different number of chips per bit can be used for the transmission of each scalable layer. For a given fixed energy value per chip and chip rate, the selection of a spreading code length affects the transmitted energy per bit and bit rate for each scalable layer. An MPEG-4 source encoder is used to provide a two-layer SNR scalable bitstream. Each of the two layers is channel-coded using Rate-Compatible Punctured Convolutional (RCPC) codes. Then, the data are interleaved, spread, carrier-modulated and transmitted over the wireless channel. A multipath Rayleigh fading …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive code-division links with blind primary-system identification",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6030123/",
            "Abstract": "We consider the problem of cognitive code-division channelization (simultaneous power and code-channel allocation) for secondary transmission links co-existing with an unknown primary code-division multiple-access (CDMA) system. We first develop a blind primary-user identification scheme to detect the binary code sequences (signatures) utilized by primary users. To create a secondary link we propose two alternative procedures -one of moderate and one of low computational complexity- that optimize the secondary transmitting power and binary code-channel assignment in accordance with the detected primary code channels to avoid \"harmful\" interference. At the same time, the optimization procedures guarantee that the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum SINR linear secondary receiver is no less than a certain threshold to meet secondary transmission quality of …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Iterative re-weighted L1-norm principal-component analysis",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8335373/",
            "Abstract": "We consider the problem of principal-component analysis of a given set of data samples. When the data set contains faulty measurements/outliers, the performance of classic L 2  principal-component analysis (L 2 -PCA) deteriorates drastically. Instead, L 1  principal-component analysis (L 1 -PCA) offers outlier resistance due to the L 1 -norm maximization criterion it adopts to compute the principal subspace. In this work, we present an iterative re-weighted L 1 -PCA method (IRW L 1 -PCA) that generates a sequence of Li-norm subspaces. In each iteration, the data set comformity of each sample is measured by the L 1  subspace calculated in the previous iteration and used to weigh the data sample before the L 1  subspace update. The approach automatically suppresses outliers in each iteration resulting in increasingly accurate subspace calculation. We provide convergence analysis and compare the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:b8m_4JuPjscC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Directional Space-Time Waveform Design for Interference-Avoiding MIMO Configurations",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8730599/",
            "Abstract": "We consider the problem of directional space-time waveform design for proactive interference avoidance in multiple-input multiple-output (MIMO) link configurations. We propose to instruct the transmitter to communicate with the intended receiver at a given code sequence and angle-of-arrival that are jointly optimized to maximize the maximum attainable pre-detection signal-to-interference-plus-noise ratio (SINR). More specifically, directional transmissions to the intended receiver are achieved by designing space-time waveforms that maximize SINR at the output of the max-SINR receiver filter. Simulation of the proposed adaptive interference-avoiding space-time waveform designs in MIMO link configurations show superior performance in terms of post-filtering SINR and bit-error-rate (BER) when compared to interference-suppressive non-adaptive receiver designs. Joint optimization of the code sequence and …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:X1xEhyGaivYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multicarrier chirp-division multiplexing for wireless communications",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1812.09592",
            "Abstract": "We propose a multicarrier chirp-division multiplexing (MCDM) system in which orthogonal chirp waveforms are utilized as frequency subcarriers. Orthogonal characteristics of chirp subcarriers are analyzed in respect to cross-correlation coefficients among subcarriers. Moreover, orthogonal chirp transform (OCT) is developed to implement MCDM systems. In addition, we design a low complexity receiver, including packet synchronization, carrier frequency offset compensation, channel estimation, and symbol detection. Proposed MCDM systems have both advantages of chirp waveforms and multicarrier architectures. Computational complexity of our proposed detector is discussed in detail. The bit-error-rate (BER) performance of the MCDM system is evaluated in simulations and indoor radio frequency (RF) experiments. We have demonstrated effectiveness of MCDM systems both in simulation and experimental results, comparing to orthogonal frequency division multiplexing (OFDM) systems. Moreover, MCDM can be further applied to higher order modulations for enabling higher data rates for RF wireless communications.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:kxd3qP2_5uAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance analysis of doubly optimal CDMA spreading codes with odd length",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5100/0000/Performance-analysis-of-doubly-optimal-CDMA-spreading-codes-with-odd/10.1117/12.487748.short",
            "Abstract": "A doubly optimal binary signature set is a set of binary spreading sequences that can be used for code division multiplexing purposes and exhibits minimum total-squared-correlation (TSC)and minimum maximum-squared-correlation (MSC) at the same time. In this article, we focus on such sets with signatures of odd length and we derive closed-form expressions for the signature cross-correlation matrix, its eigenvalues, and its inverse. Then, we derive analytic  expressions for (i) the bit-error-rate (BER) upon decorrelating processing,(ii) the maximum achievable signal-to-interference-plus-noise (SINR) ratio upon minimum-mean-square-error (MMSE) filtering, and (iii) the total asymptotic efficiency of the system. We find that doubly optimal sets with signature length of the form 4m+1, m=1, 2,..., are in all respects superior to doubly optimal sets with signature length of the form 4m-1 (the latter class includes the familiar …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Relay location optimization for differential amplify-and-forward cooperative relaying",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7417445/",
            "Abstract": "Differential amplify-and-forward (DAF) cooperative relaying appears to be an attractive strategy for wireless networks where channel estimation is not feasible or it is rather avoided. In this work, we intend to determine the optimum relay location in order to minimize the outage probability of the DAF cooperative relaying in case that the system is allowed to deploy the relay. We consider two scenarios. First, we optimize the relay location for the DAF cooperative relaying with any given power assignment at the source and the relay. Second, we further consider relay location optimization with optimum power assignment in which the performance of the DAF relaying is further enhanced with the price of higher complexity. In order to obtain the optimum relay location, we develop a recursive algorithm based on the fix-point theorem and show that the relay location has a unique optimum solution which can be determined …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:PPrs6GlykQcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "More∨",
            "Publication year": 2001,
            "Publication url": "https://spie.org/SI22/conferencedetails/big-data-learning-analytics-and-applications",
            "Abstract": "With the information deluge resulting from ubiquitous communication, imaging, and surveillance devices, medical and e-commerce platforms, and social networking sites, big data analytics and learning are becoming increasingly important. The objective of this conference is to provide a consolidated forum to explore and promote advances in big data from learning, analytics, and application perspectives. Furthermore, it seeks to foster cross-fertilization of ideas across the various application areas of big data.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:y7JhAc_VBLgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An integrated cross-layer study of wireless CDMA sensor networks",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1327649/",
            "Abstract": "In this paper, we characterize analytically the multiaccess interference in wireless code-division multiple-access sensor networks with uniformly random distributed nodes and study the tradeoff between interference and connectivity. To provide a guideline for improving system behavior, three competitive deterministic topologies are evaluated along with the random topology in terms of link-level and network-level (routing) performance. The impact of signature code length and receiver design on the network performance for different topologies is also studied.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiuser CDMA signal extraction",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4086551/",
            "Abstract": "We consider the problem of extraction on wireless direct-sequence code-division multiple-access (DS-CDMA) systems. We develop an iterative least-squares-type algorithm that extracts the information symbols of the multiple concurrent DS-CDMA users and assumes no knowledge of either the signature waveforms or the channel state. The proposed scheme utilizes a novel initialization step that is based on auxiliary-vector (AV) subspace decomposition. Simulation studies evaluate the performance of the proposed extraction procedure in realistic data limited environments and show that, for observation records of sufficient length, information data extraction can be achieved with probability of error rather close to what may be attained with known signatures and channel state. *Corresponding author.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Design of Maximum-SINR Binary Spreading Codes",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=10298676130516054127&hl=en&oi=scholarr",
            "Abstract": "Over the real/complex field, the spreading code that maximizes the output signal-to-interference-plus-noise ratio (SINR) of the linear maximum-SINR receiver is the minimumeigenvalue eigenvector of the interference autocovariance matrix. In the context of binary spreading codes, the maximization problem is NP-hard with complexity exponential in the code length. A new method for the optimization of binary spreading codes under a rank-2 approximation of the inverse interference autocovariance matrix is presented where the rank-2-optimal binary code is obtained in lower than quadratic complexity. Significant SINR performance improvement is demonstrated over the common binary hard-limited eigenvector design which is seen to be equivalent to the rank-1-optimal solution.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:nnITTVbzT6kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Small-sample-support suppression of interference to PN-masked data",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6514980/",
            "Abstract": "In the context of secure wireless communications, pseudo-noise (PN) masking of transferred data has proven to be an effective technique against eavesdropping (notable examples are military-grade communication and global-positioning systems). At the same time, PN-masked transmissions are thought to be vulnerable to interference/jamming due to lack of a minimum-mean-square-error (MMSE) disturbance suppressing solution. In this paper, for the first time we establish the MMSE operation for masked data in the form of a time (mask) varying linear filter, suggest an implementation that avoids repeated input autocorrelation matrix inversion, and develop an auxiliary-vector (AV) MMSE filter estimator with state-of-the-art short-data-record estimation performance. Simulation examples included herein illustrate the theoretical developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:JQOojiI6XY0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Iteratively re-weighted L1-PCA of tensor data",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9048775/",
            "Abstract": "Modern big and multi-modal datasets often contain corrupted entries or outliers. Standard methods for multi-way/tensor data analysis, relying on L2-norm formulations, are often very sensitive to such dataset corruptions. A new paradigm in data analysis suggests the use of robust L1-norm formulations instead. In this work, we present a novel method for iterative tensor L1-PCA with data re-weighting. The proposed method (i) returns significantly robust tensor bases and (ii) is capable to identify outlying, non-conforming entries of the data tensor. The presented algorithmic developments are validated with numerical studies on real-world data.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:TEVcCiyi8yIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An 8× 8 quasi-orthogonal STBC form for transmissions over eight or four antennas",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4712691/",
            "Abstract": "An 8times8 two-symbol decodable quasi-orthogonal space-time block code (QO-STBC) is presented which can be transmitted across either 8 or 4 antennas with full rate and the same full diversity order. For the 8-transmit-antenna system, a new expression is developed to identify rotation angles that maximize the diversity (eigenvalue) product. In addition, it is shown that the previously proposed sum-eigenvalue maximization criterion for the design of rotation angles is not relevant/applicable and an alternative minimum eigenvalue maximization criterion is suggested. Finally, new optimal rotation angles are obtained by working directly with a pairwise-error-probability (PEP) upperbound expression. For 4-transmit-antenna systems and correlated channel fading conditions, the PEP-upper-bound is modified accordingly to take into account the channel correlation. Using the new PEP-upper-bound we obtain rotation …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Increasing indoor spectrum sharing capacity using smart reflect-array",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7510962/",
            "Abstract": "The radio frequency (RF) spectrum becomes overly crowded in some indoor environments due to the high density of users and bandwidth demands. To accommodate the tremendous wireless data demands, efficient spectrum-sharing approaches are highly desired. To this end, this paper introduces a new spectrum sharing solution for indoor environments based on the usage of a reconfigurable reflect-array in the middle of the wireless channel. By optimally controlling the phase shift of each element on the reflect-array, the useful signals for each transmission pair can be enhanced while the interferences can be canceled. As a result, multiple wireless users in the same room can access the same spectrum band at the same time without interfering each other. Hence, the network capacity can be dramatically increased. To prove the feasibility of the proposed solution, an experimental testbed is first developed and …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:CB6W3GmKGOEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bounds on the Maximum SINR of Binary and Quaternary Code Division",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6042888/",
            "Abstract": "In code-division multiplexing, the real/complex-valued sequence (signature) that maximizes the pre-detection signal-to-interference-plus-noise ratio (SINR) at the output of the maximum-SINR filter is simply the minimum-eigenvalue eigenvector of the disturbance autocorrelation matrix. SINR sequence optimization over a finite alphabet, however, is NP-hard in the sequence length. In this paper, we derive new easy to calculate upper and lower bounds on the SINR of the optimal binary and quaternary sequences that can serve as benchmarking tools for any suggested suboptimal designs.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Supervised Phase Correction of Blind Space–Time DS-CDMA Channel Estimates",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4132998/",
            "Abstract": "Blind channel-estimation algorithms return phase-ambiguous estimates. From a receiver design point of view, the phase-ambiguity problem can be by-passed by differential modulation and detection at the expense of a well-known performance loss, in comparison with direct modulation and coherent detection schemes. An alternative approach is followed in this paper. A theoretical minimum mean-square error phase-estimation criterion leads to a supervised phase-recovery procedure that directly corrects the phase of arbitrary linear filter receivers through a simple closed-form projection operation. Conveniently, any known blind channel-estimation algorithm can be used to provide the initial phase-ambiguous estimate. The presentation is given in the context of adaptive space-time receiver designs for binary phase-shift keying direct-sequence code-division-multiple-access antenna array systems. Numerical and …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MRI: Development of a Shared Underwater Acoustic MIMO Networking Testbed",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=9891586558350086076&hl=en&oi=scholarr",
            "Abstract": "Proposal#: 11-26357 PI (s): Melodia, Tommaso; Atkinson, Joseph F; Batalama, Stella; Pados, Dimitris A; Su, Weifeng Institution: SUNY-Buffalo Title: MRI/Dev.: Shared Underwater Acoustic MIMO Networking Testbed Project Proposed: This project proposes a novel instrument and testbed environment based on a MIMO (Multiple-Input Multiple-Output) networking testbed for underwater deployment. The proposed instrument is based on a commercial system, ie, Teledyne Bethos Telesonar modem, which would be extended for reconfigurability and rapid deployment, and thus adopted for wider usage. The basic extension of the existing commercial modem is the addition of an external controller hosting an open-source software communication suite. This software suite would provide the functionalities for reconfiguration of various networking functions for underwater deployment. The proposed instrument is expected to …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:k6nH7jlkaTkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A sequence of MVDR filter estimators",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Pados/publication/236134829_A_Sequence_of_MVDR_Filter_Estimators/links/0046351645a9fc4125000000/A-Sequence-of-MVDR-Filter-Estimators.pdf",
            "Abstract": "e show that statistical conditional opt imization criteria lead to the development of an ite rative algorithm that starts from the matched filt er (or constraint vector) and generates a sequence o f filters that converges to the minimum-variancedi stortionless-response (MVDR) solution for any posi tive definite input autocorrelation matrix. When the input autocorrelation matrix is replaced by a conventi onal sample-average (positive definite) estimate, the a lgorithm effectively generates a sequence of MVDR filter estimators; the bias converges rapidly to zero and th e covariance trace rises slowly and asymptotically to the covariance trace of the familiar sample-matrixi nversion (SMI) estimator. For short data records, the e arly elements of the generated sequence of estimator s offer favorable bias/covariance balance and are s een to outperform in mean-square estimation error c onstraint-LMS, RLS-type, orthogonal multistage dec omposition, as well as plain and diagonally loaded S MI estimates.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:NJ774b8OgUMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Joint admission control and resource allocation in cognitive code-division networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6292876/",
            "Abstract": "We consider the problem of joint admission control and resource allocation in a secondary code-division network coexisting with a narrow-band primary system. Our objective is to find the maximum number of admitted secondary links and then find the optimal transmitting powers and code sequences of those secondary links such that the total energy consumption of the secondary network is minimized subject to the conditions that primary interference temperature constraints, secondary Signal-to-Interference-plus-Noise Ratio (SINR) constraints and secondary peak power constraints are all satisfied. This is an NP-hard optimization problem which motivates the development of efficient suboptimal algorithms. We propose a novel iterative algorithm to solve this problem in a computationally efficient manner. Numerical results demonstrate that the proposed algorithm provides excellent solutions that result in large …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive optimization of binary/quaternary CDMA signatures in multipath fading environments",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1605799/",
            "Abstract": "We develop a new algorithm to optimize adaptively binary and quaternary signatures for code-division multiple-access (CDMA) communications over multipath channels and/or asynchronous channel access. Using the observed signal autocorrelation matrix, the algorithm attempts to maximize over the binary or quaternary antipodal sequence field the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum SINR linear filter. While this maximization problem is NP-hard, the algorithm is seen to produce in short polynomial time highly desirable solutions that approach in performance the theory-only complex/real-field optimal signature vectors. Signature adaptation may be carried out in either a single or a multi-user mode. Simulation studies included herein offer direct performance comparisons with other known binary signature set designs and the theoretical complex/real-valued optimal vectors",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint channel estimation and data detection on commercially available underwater acoustic modems",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6964325/",
            "Abstract": "In this paper, we describe and demonstrate for the first time in the literature a light-weight joint underwater acoustic channel estimation and data detection (JOCEDD) procedure. The procedure generates iteratively channel estimates and data decisions with guaranteed convergence. No pilot signaling is required (blind/unsupervised scheme), except for one-shot overall data frame sign/phase ambiguity resolution. The effectiveness of the proposed algorithm is demonstrated by field tests with SM-975 Teledyne-Benthos SMART modems. Experimental results show that the proposed JOCEDD procedure can efficiently recover transmitted data and significantly enhance reliability of underwater acoustic communications.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:pZ2CosqRuhkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Two-stage tensor locality-preserving projection face recognition",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7545024/",
            "Abstract": "Locality-preserving projection (LPP) is an efficient dimensionality reduction approach that preserves local relationships within data sets and uncovers essential manifold structures. In this paper, we develop a two-stage tensor locality-preserving projection for face recognition, in which first-stage tensor LPP is performed in the original tensor space of face images and second stage tensor LPP is performed in the reduced-dimension tensor subspace of the first-stage projection. For classification, we seek a non-negative sparse representation in the final low-dimensional tensor subspace and determine the class of an unknown face image by minimum sparse representation error. Experimental studies demonstrate that our proposed two-stage tensor LPP scheme along with the non-negative sparse representation classifier effectively exploits the locality structure of face images and outperforms existing state-of-the-art face …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:fc7zyzPI2QAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Detection of change by L1-norm principal-component analysis",
            "Publication year": 2020,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11395/113950D/Detection-of-change-by-L1-norm-principal-component-analysis/10.1117/12.2559976.short",
            "Abstract": "We consider the problem of detecting a change in an arbitrary vector process by examining the evolution of calculated data subspaces. In our developments, both the data subspaces and the change identification criterion are novel and founded in the theory of L1-norm principal-component analysis (PCA). The outcome is highly accurate, rapid detection of change in streaming data that vastly outperforms conventional eigenvector subspace methods (L2-norm PCA). In this paper, illustrations are offered in the context of artificial data and real electroencephalography (EEG) and electromyography (EMG) data sequences.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:8cBNEdFwSQkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Reconstruction of compressed-sensed multiview video with disparity-and motion-compensated total variation minimization",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7829383/",
            "Abstract": "Compressed sensing (CS) is the theory and practice of sub-Nyquist sampling of sparse signals of interest. Exact reconstruction may then be possible with much fewer than the Nyquist-required number of data. In this paper, we consider a multiview video system in which multiple cameras at different locations perform independent CS to simultaneously capture different views of a scene. At the decoder, we propose a disparity- and motion-compensated total variation minimization algorithm to jointly reconstruct the multiview video sequence. The experimental results show that the proposed joint reconstruction algorithm successfully exploits simultaneously intra-frame, inter-frame, and inter-view sparsity and significantly outperforms existing independent-view reconstruction, residue-view reconstruction, and motion-adaptive reconstruction algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:m44aUaJR3ikC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance Analysis of Doubly Optimal CDMA Spreading",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=1805271894204971544&hl=en&oi=scholarr",
            "Abstract": "A doubly optimal binary signature set is a set of binary spreading sequences that can be used for code division multiplexing purposes and exhibits minimum total-squared-correlation (TSC) and minimum maximum-squaredcorrelation (MSC) at the same time. In this article, we focus on such sets with signatures of odd length and we derive closed-form expressions for the signature cross-correlation matrix, its eigenvalues, and its inverse. Then, we derive analytic expressions for (i) the bit-error-rate (BER) upon decorrelating processing,(ii) the maximum achievable signal-to-interference-plus-noise (SINR) ratio upon minimum-mean-square-error (MMSE) filtering, and (iii) the total asymptotic efficiency of the system. We find that doubly optimal sets with signature length of the form 4m+ 1, m= 1, 2,..., are in all respects superior to doubly optimal sets with signature length of the form 4m-1 (the latter class includes the familiar Gold sets as a small proper subset).“4m+ 1” sets perform practically at the single-user-bound (SUB) after decorrelating or MMSE processing (not true for\" 4m-1\" sets). The total asymptotic efficiency of “4m+ l” sets is lower bounded by for any system user load. The corresponding lower bound for “4m-1” sets is zero.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:Vxkav03X4woC",
            "Publisher": "SPIE"
        },
        {
            "Title": "Compressed-sensed-domain L1-PCA video surveillance",
            "Publication year": 2015,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9484/94840B/Compressed-sensed-domain-L1-PCA-video-surveillance/10.1117/12.2179722.short",
            "Abstract": "We consider the problem of foreground and background extraction from compressed-sensed (CS) surveillance video. We propose, for the first time in the literature, a principal component analysis (PCA) approach that computes the low-rank subspace of the background scene directly in the CS domain. Rather than computing the conventional L2-norm-based principal components, which are simply the dominant left singular vectors of the CS measurement matrix, we compute the principal components under an L1-norm maximization criterion. The background scene is then obtained by projecting the CS measurement vector onto the L1 principal components followed by total-variation (TV) minimization image recovery. The proposed L1-norm procedure directly carries out low-rank background representation without reconstructing the video sequence and, at the same time, exhibits significant robustness against …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:z3pV1qEBaUAC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Short-data-record filtering of PN-masked data",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6638523/",
            "Abstract": "Pseudo-noise (PN) masking is regarded as an effective means to combat data eavesdropping (for example in military-grade communications or positioning systems). At the same time, PN-masked data transmissions are considered vulnerable to interference/jamming due to lack of practical interference suppression solutions. In this work, (i) we derive an efficient minimum-mean-square-error (MMSE) optimal linear receiver of PN-masked data and (ii) develop an auxiliary-vector (AV) MMSE adaptive filter estimator with state-of-the-art small-sample-support estimation performance. Simulation studies included in this paper illustrate the effectiveness of the theoretical developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:35r97b3x0nAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sum-SINR/sum-capacity optimal multisignature spread-spectrum steganography",
            "Publication year": 2008,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6982/69820D/Sum-SINRsum-capacity-optimal-multisignature-spread-spectrum-steganography/10.1117/12.784711.short",
            "Abstract": "For any given digital host image or audio file (or group of hosts) and any (block) transform domain of interest, we find an orthogonal set of signatures that achieves maximum sum-signal-to-interference-plus-noise ratio (sum- SINR) spread-spectrum message embedding for any fixed embedding amplitude values. We also find the sumcapacity optimal amplitude allocation scheme for any given total distortion budget under the assumption of (colored) Gaussian transform-domain host data. The practical implication of the results is sum-SINR, sumcapacity optimal multiuser/multisignature spread-spectrum data hiding in the same medium. Theoretically, the findings establish optimality of the recently presented Gkizeli-Pados-Medley multisignature eigen-design algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:j3f4tGmQtD8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "All-spectrum digital waveform design via bit flipping",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8647511/",
            "Abstract": "We consider the problem of interference avoidance via all-spectrum digital waveform design in wireless communication links that operate in multipath fading environments. Specifically, we select a square-root raised cosine pulse-shaping signal that occupies all-hardware accessible frequency bandwidth. We propose an algorithm that optimizes a sequence of L sign/phase-shifted repeats of the basic shaping pulse to form the all-spectrum digital waveform that will carry our information symbols. The sequence can take values from either binary or quaternary alphabets. We propose to optimize the specific values of the sign/phase shift sequence via bit flipping such that the signal-to-interference-plus-noise ratio (SINR) at the output of the max-SINR linear receiver is maximized at any given time. The complexity of the proposed algorithm is O( L 3 ) and is independent of the alphabet size. Simulation studies demonstrate …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:djcsc3XHdKAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EAGER: Networking on Underwater Acoustic MIMO Links",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=13127038904224771814&hl=en&oi=scholarr",
            "Abstract": "The highly-exposed live feed of the oil spill from underwater cameras in the Gulf of Mexico is one of many examples showcasing the importance of multimedia underwater sensor networks in fields such as underwater surveillance, undersea exploration, video-assisted navigation, and environmental monitoring. Multimedia networking, however, requires (i) much higher data rates than what has been available in the past with acoustic technology and (ii) flexible protocol design. Multiple-input-multiple-output (MIMO) is a transmission technique that may increase data rates or reduce link errors by leveraging the spatial diversity offered by the rich scattering structure of underwater acoustic propagation. To-date, little experimental data is available to the research community to assess the potential of MIMO gains in real underwater acoustic links.     This project is an early-stage research effort to collect data and …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Karystinos-Pados bounds and optimal binary DS-CDMA signature ensembles",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1267992/",
            "Abstract": "Tightness of the Karystinos-Pados bounds was originally proved with four exceptions. In this letter, we modify the algorithm of constructing signatures removing three of these exceptions. For the fourth one the tighter bounds are derived.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:q3oQSFYPqjQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CTH06-5: Scalable TSC-Optimal Overloading of Binary Signature Sets",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4150698/",
            "Abstract": "Recent advances in the area of binary sequences for code-division multiplexing provide us with minimum total-squared-correlation (TSC) optimal signature sets for (almost) all signature lengths L and set sizes K. The sets are scalable as long as K les L (underloaded systems) and non- scalable -in general require signature re-design/re-assignment as users enter or exit- when K > L (overloaded systems). In this paper, we derive new lower bounds on the conditional TSC of overloaded binary signature sets built on fixed full- load TSC-optimal sets. Overloading is allowed to be as high as 100%. Scalable designs that achieve the new bounds are then developed. To evaluate the performance of the proposed designs, we compare the TSC of our constructions to the unconditionally minimum achievable TSC values.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On dempster-shafer and bayesian detectors",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1678043/",
            "Abstract": "In this correspondence, we examine the relationship between Dempster-Shafer (DS) decision making systems and conventional Bayesian (centralized or distributed) detectors. We establish theoretically that under certain intuitively pleasing DS probability mass assignments the two systems become equivalent. A few numerical studies illustrate the theoretical developments",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive antenna array receivers for spread-spectrum signals in non-Gaussian noise",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1051200401903926",
            "Abstract": "Pados, D. A., Medley, M. J., and Batalama, S. N., Adaptive Antenna Array Receivers for Spread-Spectrum Signals in Non-Gaussian Noise, Digital Signal Processing11 (2001) 144–158We consider the problem of recovering a spread-spectrum (SS) signal in the presence of unknown highly correlated spread-spectrum interference and impulsive noise. In terms of basic system and signal model considerations, we assume availability of a narrowband adaptive antenna array that experiences additive white Gaussian noise in time and across elements, as well as impulsive disturbance with direction-of-arrival (DOA) that changes at the chip rate. The space–time receiver design developed in this work is characterized by the following attributes: (i) Adaptive interference suppression is pursued in the joint space–time domain. (ii) An adaptive parametric nonlinear front end offers effective suppression of impulsive …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Cognitive Jointly Optimal Code-Division Channelization and Routing Over Cooperative Links",
            "Publication year": 2014,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA602903",
            "Abstract": "We developed a new spread-spectrum management paradigm in which, unlike mainstream dynamic spectrum access research, digital waveforms are i designed to occupy the entire available spectrum and ii adaptively track the interference profile at the receiver to maximize link capacity while avoiding interference to existing users. In this context, we studied the problem of maximizing the network throughput of a multi-hop network through joint routing and spread-spectrum channelization. We first presented a centralized formulation of the network control problem. We then developed an algorithm that can be seen as a distributed localized approximation of the throughput-maximizing policy. We refer to the proposed jointly-designed routing and code-division channelization algorithm as ROCH Routing and cOde-division CHannelization.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:Np1obAXpBq8C",
            "Publisher": "STATE UNIV OF NEW YORK AT BUFFALO AMHERST"
        },
        {
            "Title": "Tensor data conformity evaluation for interference-resistant localization",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9048697/",
            "Abstract": "We consider the problem of robust, interference-resistant localization in GPS-denied environments. Each asset to be self-localized is equipped with an antenna array and leverages time-domain coded beacon signals from anchor nodes that are placed at known locations. Collected data snapshots over time at the antenna array are organized in a tensor data structure. The conformity of the received tensor data is evaluated through iterative projections on robust, high-confidence data feature characterizations that are returned by L1-norm tensor subspaces. Non-conforming tensor slabs are more likely to be contaminated by irregular, highly deviating measurements due to interference, thus they are removed from the received dataset. Subsequently, we estimate the direction-of-arrival of the beacon signals by using L2-norm and L1-norm tensor decomposition techniques on the conformity-adjusted dataset. Finally, the …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:wZJMF1LD7PcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compressed-Sensed-Domain L1-PCA Video Surveillance",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7372472/",
            "Abstract": "We consider the problem of foreground and background extraction from compressed-sensed (CS) surveillance videos that are captured by a static CS camera. We propose, for the first time in the literature, a principal component analysis (PCA) approach that computes directly in the CS domain the low-rank subspace of the background scene. Rather than computing the conventional L 2 -norm-based principal components, which are simply the dominant left singular vectors of the CS-domain data matrix, we compute the principal components under an L 1 -norm maximization criterion. The background scene is then obtained by projecting the CS measurement vector onto the L 1  principal components followed by total-variation (TV) minimization image recovery. The proposed L 1 -norm procedure directly carries out low-rank background representation without reconstructing the video sequence and, at the same time …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:Gs1AF5H0x94C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Population size identification for CDMA eavesdropping",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4454983/",
            "Abstract": "In this paper we develop a novel iterative-least-squares-type method that identifies the population size of direct-sequence CDMA signal mixtures without any knowledge about the signatures of the active spread-spectrum signals in the system or the channel state and in the absence of pilot signaling (training sequence). Simulation studies demonstrate the performance of the proposed method and offer favorable comparisons with corresponding schemes based on the conventional Akaike information criterion, the minimum description length criterion, as well as their more recent modified versions.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Near-ML multiuser detection with linear filters and reliability-based processing",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1231641/",
            "Abstract": "The prohibitive - exponential in the number of users - computational complexity of the maximum-likelihood multiuser detector for direct-sequence code-division multiple-access communications has fueled an extensive research effort for the development of low-complexity multiuser detection alternatives. We show that we can efficiently and effectively approach the error rate performance of the optimum multiuser detector as follows. We utilize a multiuser zero-forcing or minimum mean-square error (MMSE) linear filter as a preprocessor and we establish that the output magnitudes, when properly scaled, provide a reliability measure for each user bit decision. Then, we prepare an ordered, reliability-based error search sequence of length linear in the number of users; it returns the most likely user bit vector among all visited options. Numerical and simulation studies for moderately loaded systems that permit exact …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compressive sampling with generalized polygons",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5934614/",
            "Abstract": "We consider the problem of compressed sensing and propose new deterministic low-storage constructions of compressive sampling matrices based on classical finite-geometry generalized polygons. For the noiseless measurements case, we develop a novel exact-recovery algorithm for strictly sparse signals that utilizes the geometry properties of generalized polygons and exhibits complexity that depends on the sparsity value only. In the presence of measurement noise, recovery of the generalized-polygon sampled signals can be carried out effectively using a belief propagation algorithm. Experimental studies included in this paper illustrate our theoretical developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cognitive code-division channelization with blind primary-system identification",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5680153/",
            "Abstract": "We consider the problem of cognitive code-division channelization (simultaneous power and code-channel allocation) for secondary transmission links co-existing with an unknown primary code-division multiple-access (CDMA) system. We first develop a blind primary-user identification scheme to detect the binary code sequences (signatures) utilized by primary users. To create a secondary link we propose two alternative procedures -one of moderate and one of low computational complexity- that optimize the secondary transmitting power and binary codechannel assignment in accordance with the detected primary code channels to avoid “harmful” interference. At the same time, the optimization procedures guarantee that the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum SINR linear secondary receiver is no less than a certain threshold to meet secondary transmission quality of …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Decoding of purely compressed-sensed video",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8365/83650L/Decoding-of-purely-compressed-sensed-video/10.1117/12.920320.short",
            "Abstract": "We consider a video acquisition system where motion imagery is captured only by direct compressive sampling (CS) without any other form of intelligent encoding/processing. In this context, the burden of quality video sequence reconstruction falls solely on the decoder/player side. We describe a video CS decoding method that implicitly incorporates motion estimation via sliding-window sparsity-aware recovery from locally estimated Karhunen-Loeve bases. Experiments presented herein illustrate and support these developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:pyW8ca7W8N0C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "L1-norm principal-component analysis of complex data",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8328897/",
            "Abstract": "L1-norm Principal-Component Analysis (L1-PCA) of real-valued data has attracted significant research interest over the past decade. L1-PCA of complex-valued data remains to date unexplored despite the many possible applications (in communication systems, for example). In this paper, we establish theoretical and algorithmic foundations of L1-PCA of complex-valued data matrices. Specifically, we first show that, in contrast to the real-valued case for which an optimal polynomial-cost algorithm was recently reported by Markopoulos, Karystinos, and Pados, complex L1-PCA is formally NP-hard. Then, casting complex L1-PCA as a unimodular optimization problem, we present the first two suboptimal algorithms in the literature for its solution. Extensive experimental studies included in this paper illustrate the sturdy resistance of complex L1-PCA against faulty measurements/outliers in the processed data.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:dBzKUGQurMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Super-resolution direction finding with an auxiliary-vector basis",
            "Publication year": 2005,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5819/0000/Super-resolution-direction-finding-with-an-auxiliary-vector-basis/10.1117/12.606402.short",
            "Abstract": "We develop a new direction-of-arrival (DOA) estimation procedure that utilizes a modified version of the orthogonal auxiliary-vector (AV) filtering algorithm. The procedure starts with the linear transformation of the array response scanning vector by the input autocorrelation matrix. Then, successive orthogonal maximum cross-correlation auxiliary vectors are calculated to form a basis of the scanner-extended signal subspace. As a performance evaluation example, our studies for uncorrelated sources demonstrate a gain in the order of 15dB over MUSIC, 7dB over ESPRIT, and 3dB over the grid-search maximum likelihood DOA estimator at probability of resolution 0.9 with a ten-element array and reasonably small observation data records. A reduced complexity version of the proposed DOA estimation algorithm is also suggested. Results for correlated sources are reported as well.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:bEWYMUwI8FkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Multiuser differential-PSK demodulators for DS/CDMA signals",
            "Publication year": 2000,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4045/0000/Multiuser-differential-PSK-demodulators-for-DSCDMA-signals/10.1117/12.394090.short",
            "Abstract": "Second-order multipath channel estimation procedures for direct-sequence code-division-multiple-access communications induce phase ambiguity that necessitates differential phase- shift-keying (DPSK) modulation and detection. The maximum likelihood (ML) single-symbol multiuser DPSK/CDMA detector is derived with direct generalization to multiple-symbol (block) multiuser DPSK/CDMA detection. Exponential complexity requirements limit the use of the ML rule to theoretical lower-bound bit-error-rate benchmarking. Linear filter DPSK demodulators are viewed as a practical alternative. Phase-ambiguous RAKE filtering followed by RAKE-output differential detection is considered. The familiar minimum-variance-distortionless-response (MVDR) PSK/CDMA filter (designed for minimum filter output energy under the constraint of distortionless response in a given RAKE vector direction) adds the valuable feature …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Joint-view Kalman-filter recovery of compressed-sensed multiview videos",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7471971/",
            "Abstract": "We develop a novel joint-view Kalman filter for causal reconstruction of compressed-sensed multiview videos. Compressed-sensed multiview video frames are initially reconstructed individually via ℓ 1 -norm minimization. Then, a joint-view state transition model is established for each pair of neighboring views using motion or motion-disparity field estimates. Experimental results demonstrate significantly improved reconstruction quality compared to conventional CS reconstruction and independent-view (single-view) motion-compensated Kalman filtering.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:ve7iT2ZEuL4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advances in multiuser data embedding in digital media: Orthogonal sum-SINR-optimal carriers",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6883444/",
            "Abstract": "We consider the problem of embedding multiuser data in digital media (such as images, video sequences, audio) with minimum perceived distortion. In this direction, we find the orthonormal set of embedding carriers that achieves maximum sum signal-to-interference-plus-noise ratio (sum-SINR) at the output of the receiver linear filters for any fixed embedding amplitude values. Then, for any given total embedding distortion constraint, we calculate the optimal multicarrier assignment and embedding amplitude values that maximize the sum capacity of the embedding process. Experimental results presented herein for multiuser data embedding in images demonstrate the effectiveness of the proposed methods.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:n8FNryW2AHIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "L1-norm principal-component analysis in L2-norm-reduced-rank data subspaces",
            "Publication year": 2017,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10211/1/L1-norm-principal-component-analysis-in-L2-norm-reduced-rank/10.1117/12.2263733.short",
            "Abstract": "Standard Principal-Component Analysis (PCA) is known to be very sensitive to outliers among the processed data.1 On the other hand, it has been recently shown that L1-norm-based PCA (L1-PCA) exhibits sturdy resistance against outliers, while it performs similar to standard PCA when applied to nominal or smoothly corrupted data.2, 3 Exact calculation of the K L1-norm Principal Components (L1-PCs) of a rank-r data matrix X∈ RD×N costs O(2NK), in the general case, and O(N(r-1)K+1) when r is fixed with respect to N.2, 3 In this work, we examine approximating the K L1-PCs of X by the K L1-PCs of its L2-norm-based rank-d approximation (K≤d≤r), calculable exactly with reduced complexity O(N(d-1)K+1). Reduced-rank L1-PCA aims at leveraging both the low computational cost of standard PCA and the outlier-resistance of L1-PCA. Our novel approximation guarantees and experiments on dimensionality …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:eJjLl3UG7CkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Auxiliary-vector detection on measured radar data",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4720920/",
            "Abstract": "Derived from statistical conditional optimization criteria, the auxiliary-vector (AV) detection algorithm starts from the target vector and adding non-orthogonal auxiliary vector components generates an infinite sequence of tests that converges to the ideal matched filter (MF) processor for any positive definite input autocorrelation matrix. When the input autocorrelation matrix is replaced by a conventional sample-average estimate, the algorithm effectively generates a sequence of estimators of the ideal matched filter that offer exceptional bias/covariance balance for any given finite-size observation data record. In this work, the AV algorithm is evaluated on collected airborne phased-array radar data from the MCARM program and is seen to outperform in probability of detection (for any given false alarm rate) all known and tested adaptive detectors (for example AMF, generalized likelihood ratio test, the multistage Wiener …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Poster: Realizing All-spectrum Cognitive Networking on a Software-defined Radio Testbed",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801694.2802148",
            "Abstract": "We implement and real-time demonstrate for the first time ROCH; a distributed cognitive algorithm that maximizes secondary network throughput, while at the same time avoids interference to primary users through joint Routing and cOde-waveform CHannelization. ROCH performance is evaluated on a -node software-defined radio testbed using the open-source radio framework, GNU Radio, and Universal Software Radio Peripherals (USRP-N  s). The implementation of ROCH is facilitated by the architectural abstractions of the RcUBe radio framework, that provides real-time reconfigurability at the PHY, MAC, and network layers of the protocol stack.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:FKYJxdYMdFIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SINR, bit error rate, and Shannon capacity optimized spread-spectrum steganography",
            "Publication year": 2004,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal Joint Channel Estimation and Data Detection by L1-norm PCA for Streetscape IoT",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9054507/",
            "Abstract": "We prove, for the first time in the literature of communication theory and machine learning, the equivalence of joint maximum-likelihood (ML) optimal channel estimation and data detection (JOCEDD) to the problem of finding the L 1 -norm principal components of a real-valued data matrix. Optimal algorithms for L 1 -norm principal component analysis (PCA) are therefore direct solvers to the problem of interest, thus the proposed JOCEDD approach requires a polynomial number of operations. To avoid high computational costs incurred by the exact calculation of optimal L 1  principal components, we implement an efficient bit flipping-based algorithm for L 1 -norm PCA in a software-defined radio. In particular, we carry out experiments with two radios that operate at Wi-Fi frequencies in a multipath indoor radio environment and have no direct line-of-sight. We apply L 1 -norm PCA for JOCEDD over short frames that …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:C6rTQemI8T8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast decoder for overloaded uniquely decodable synchronous CDMA",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1806.03958",
            "Abstract": "We consider the problem of designing a fast decoder for antipodal uniquely decodable (errorless) code sets for overloaded synchronous code-division multiple access (CDMA) systems where the number of signals K_{max}^a is the largest known for the given code length L. The proposed decoder is designed in a such a way that the users can uniquely recover the information bits with a very simple decoder, which uses only a few comparisons. Compared to maximum-likelihood (ML) decoder, which has a high computational complexity for even moderate code length, the proposed decoder has a much lower computational complexity. Simulation results in terms of bit error rate (BER) demonstrate that the performance of the proposed decoder only has a 1-2 dB degradation at BER of 10^{-3} when compared to ML.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:EcS_2O1c4Q0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive Airborne Networking: Self-Aware Communications via Sensing, Adaptation, and Cross-Layer Optimization",
            "Publication year": 2011,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA541940",
            "Abstract": "We cover five general areas in this report 1 design and optimize cooperative automatic-repeat-request ARQ relaying protocol for airborne networks 2 optimize power assignment for hybrid ARQ protocols in airborne networks 3 design and optimize differential cooperative relaying protocols for airborne networks 4 design and optimize multi-source multi destination relaying schemes for airborne networks and 5 design and optimize cognitive code-division channelization for airborne networks.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:xtRiw3GOFMkC",
            "Publisher": "STATE UNIV OF NEW YORK COLL AT BUFFALO"
        },
        {
            "Title": "SINR-optimized Binary Signatures by Linear Search.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=12648196911969144324&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special section guest editorial: compressive sensing for imaging",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/journals/journal-of-electronic-imaging/volume-22/issue-2/020901/Special-Section-Guest-Editorial-Compressive-Sensing-for-Imaging/10.1117/1.JEI.22.2.020901.short",
            "Abstract": "Compressive sensing (CS) is an emerging field of research with far-reaching impact on a variety of applications. For signals admitting sparse representations, CS permits collection of a significantly reduced number of measurements than required by the Shannon-Nyquist sampling theorem and provides efficient superresolution signal reconstruction. In essence, CS provides means for reducing data volume and efficient sensor deployment without a degradation in system performance. Such capabilities are highly desirable for a range of civil and military applications.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:tKAzc9rXhukC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Reliability-based near maximum-likelihood multiuser detection",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/985861/",
            "Abstract": "The prohibitive-exponential in the number of users-computational complexity of the maximum likelihood (ML) multiuser detector for direct-sequence code-division-multiple-access (DS/CDMA) communications has fueled an extensive research effort for the development of low complexity multiuser detection alternatives. Notable examples are the zero-forcing (\"decorrelating\") and minimum-mean-square-error (MMSE) linear filter receivers. We show that we can efficiently and. effectively approach the error rate performance of the ML optimum multiuser detector as follows. We utilize a multiuser zero-forcing or MMSE filter as a pre-processor and we establish that the output magnitudes, when properly scaled, provide a reliability measure for each user bit decision. An ordered reliability-based error search sequence of length linear in the number of users returns the most likely user bit vector among all visited options …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Upward scaling of minimum-TSC binary signature sets",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4381378/",
            "Abstract": "We develop a binary signature design procedure to scale upwards overloaded minimum total-squared-correlation (TSC) binary signature sets. The quality of the design is measured against the recently published binary TSC bounds.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Extracting spread-spectrum hidden data from digital media",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6517928/",
            "Abstract": "We consider the problem of extracting blindly data embedded over a wide band in a spectrum (transform) domain of a digital medium (image, audio, video). We develop a novel multicarrier/signature iterative generalized least-squares (M-IGLS) core procedure to seek unknown data hidden in hosts via multicarrier spread-spectrum embedding. Neither the original host nor the embedding carriers are assumed available. Experimental studies on images show that the developed algorithm can achieve recovery probability of error close to what may be attained with known embedding carriers and host autocorrelation matrix.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "L1-Subspace Tracking for Streaming Data",
            "Publication year": 2019,
            "Publication url": "https://www.cse.scu.edu/~yliu1/papers/J6.pdf",
            "Abstract": "Accepted 31 July 2019 Available online 5 August 2019",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:dyiPZ63SVtYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Addressing next-generation wireless challenges with commercial software-defined radio platforms",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7378427/",
            "Abstract": "We review commercially available software- defined radio platforms and classify them with respect to their ability to enable rapid prototyping of next-generation wireless systems. In particular, we first discuss the research challenges imposed by the latest software-defined radio enabling technologies including both analog and digital processing hardware. Then we present the state-of-the-art commercial software-defined radio platforms, describe their software and hardware capabilities, and classify them based on their ability to enable rapid prototyping and advance experimental research in wireless networking. Finally, we present three experimental testbed scenarios (wireless terrestrial, aerial, and underwater) and argue that the development of a system design abstraction could significantly improve the efficiency of the prototyping and testbed implementation process.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:qt-6tCTBDsQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compressed sensing using generalized polygon samplers",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5757535/",
            "Abstract": "We propose new deterministic low-storage constructions of compressive sampling matrices based on classical finite-geometry generalized polygons. For the noiseless measurements case, we develop a novel exact-recovery algorithm for strictly sparse signals that utilizes the geometry properties of generalized polygons and exhibits complexity linear in the sparsity value. In the presence of measurement noise, recovery of the generalized-polygon sampled signals can be carried out effectively using a belief propagation algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CT01. 2 Generalized Quad, Hex, and Octagon LDPC Codes",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=8179146129734289830&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:vRqMK49ujn8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "New bounds and optimal binary signature sets-Part II: Aperiodic total squared correlation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5719283/",
            "Abstract": "We derive new bounds on the aperiodic total squared correlation (ATSC) of binary antipodal signature sets for any number of signatures K and any signature length L. We then present optimal designs that achieve the new bounds for several (K,L) cases. As interesting -arguably- side results, we show that individual maximal merit factor sequences (for example Barker sequences) are single-user ATSC-optimal, while neither the familiar Gold nor the Kasami set designs are ATSC-optimal in general. The ATSC-optimal signature set designs provided in this work are in this sense better suited for asynchronous and/or multipath code-division multiplexing applications.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cognitive code-division channelization with admission control",
            "Publication year": 2012,
            "Publication url": "https://www.hindawi.com/journals/jcnc/2012/510942/",
            "Abstract": "We consider the problem of joint resource allocation and admission control in a secondary code-division network coexisting with a narrowband primary system. Our objective is to find the maximum number of admitted secondary links and then find the optimal transmitting powers and code sequences of those secondary links such that the total energy consumption of the secondary network is minimized subject to the conditions that primary interference temperature constraints, secondary signal-to-interference-plus-noise ratio (SINR) constraints and secondary peak power constraints are all satisfied. This is an NP-hard optimization problem which motivates the development of suboptimal algorithms. We propose a novel iterative algorithm to solve this problem in a computationally efficient manner. Numerical results demonstrate that the proposed algorithm provides excellent solutions that result in high energy efficiency and large admitted percentage of secondary links.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:eflP2zaiRacC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Airborne cognitive networking: Design, development, and deployment",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8416696/",
            "Abstract": "We design, develop, and experimentally validate a complete integrated software/hardware platform for airborne cognitive networking in both indoor and outdoor environments. We first present the concept of all-spectrum cognitive networking and describe a distributed algorithm for maximizing network spectral efficiency by jointly optimizing channel access code-waveforms and routes in a multi-hop network. We then discuss system design parameters and implementation details for setting up a software-defined radio (SDR) testbed that enables reconfigurability at the physical (PHY), medium-access control (MAC), and network (NET) layers of the network protocol stack, either by a user or by means of autonomous decisions. Our algorithmic developments toward spectrally-efficient cognitive networking are software optimized on heterogeneous multi-core general-purpose processor-based SDR architectures by …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:WsFh9Szeq2wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiuser Differential-PSK Demodulators for DS/CDMA",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=3871423071294418272&hl=en&oi=scholarr",
            "Abstract": "Second-order multipath channel estimation procedures for direct-sequence code-division-multiple-access (DS/CDMA) communications induce phase ambiguity that necessitates differential phase-shift-keying (DPSK) modulation and detection. The maximum likelihood (ML) single-symbol multiuser DPSK/CDMA detector is derived with direct generalization to multiple-symbol (block) multiuser DPSK/CDMA detection. Exponential complexity requirements limit the use of the ML rule to theoretical lower-bound bit-error-rate benchmarking. Linear filter DPSK demodula-tors are viewed as a practical alternative. Phase-ambiguous RAKE filtering followed by RAKE-output differential detection is considered. The familiar minimum-variance-distortionless-response (MVDR) PSK/CDMA filter (de-signed for minimum filter output energy under the constraint of distortionless response in a given RAKE vector direction) adds the valuable feature of active interference suppression; however, minimum disturbance variance at the differential logic output can be claimed formally only in the absence of multipath (no inter-symbol-interference). Short-data-record adaptive alternatives to costly and slow adaptive MVDR implementations are sought in the context of auxiliary-vector (AV) filtering. Numerical and simulation studies illustrate the developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:edV_OwlUe4UC",
            "Publisher": "SPIE"
        },
        {
            "Title": "Generalized quad, hex, and octagon LDPC codes",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1577831/",
            "Abstract": "We use the theory of finite classical generalized polygons to derive and study low-density parity-check (LDPC) codes. The Tanner graph of a generalized polygon LDPC code is highly symmetric, inherits the diameter size of the parent generalized polygon, and has minimum (one half) diameter-to-girth ratio. We show formally that when the diameter is four or six or eight all codewords have even Hamming weight. When the generalized polygon has in addition equal number of points and lines, we see that the non-regular polygon based code construction has minimum distance that is higher at least by two in comparison with the dual regular polygon code of the same rate and length. A new minimum distance bound is presented for codes from non-regular polygons of even diameter and equal number of points and lines. Finally, we prove that all codes derived from finite classical generalized quadrangles are quasi …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cognitive code-division multiplexing and cooperative networking",
            "Publication year": 2008,
            "Publication url": "https://search.proquest.com/openview/6f7c98079d3bd57d1eaa35ac9c2fcf98/1?pq-origsite=gscholar&cbl=18750",
            "Abstract": "The objective of this work is to investigate the problem of cognitive/adaptive code-division multiplexing and cooperative networking. Along this line, our work can be divided into the following subjects:(i) We developed a novel Binary Signature Design Algorithm which returns the binary signature vector, that maximizes the signal-to-interference-plus-noise ratio (SINR) at the output of the maximum-SINR filter, near arcs of least SINR decrease from the real maximum SINR solution in the Euclidean vector space, in the presence of disturbance and multipath fading channels. The quality of the proposed adaptive binary designs was measured against theoretical upper bound of the complex/real eigenvector maximizer and some existing signature assignment schemes.(ii) We studied the performance of our Binary Signature Design Algorithm when applied to collaborative relay networks. We evaluated numerically and by …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software-defined underwater acoustic networks: toward a high-rate real-time reconfigurable modem",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7321973/",
            "Abstract": "We review and discuss the challenges of adopting software-defined radio principles in underwater acoustic networks, and propose a software-defined acoustic modem prototype based on commercial off-the-shelf components. We first review current SDR-based architectures for underwater acoustic communications. Then we describe the architecture of a new software-defined acoustic modem prototype, and provide performance evaluation results in both indoor (water tank) and outdoor (lake) environments. We present three experimental testbed scenarios that demonstrate the real-time reconfigurable capabilities of the proposed prototype and show that it exhibits favorable characteristics toward spectrally efficient cognitive underwater networks, and high data rate underwater acoustic links. Finally, we discuss open research challenges for the implementation of next-generation software-defined underwater acoustic …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:S0RksyIsHSIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Poster: X60: A programmable testbed for wideband 60 GHz WLANs with phased arrays",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3117811.3131251",
            "Abstract": "We introduce X60, the first SDR-based testbed for 60 GHz WLANs, featuring fully programmable MAC/PHY/Network layers, multi-Gbps rates, and a user-configurable 12-element phased antenna array. These features provide us with an unprecedented opportunity to revisit the most important aspects of 60 GHz signal propagation and obtain new insights on performance expected from practical 60 GHz systems. X60's unique capabilities make it an ideal platform for experimentation and prototyping across layers.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:TiLqlu47W2oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Near-ML multiuser detection",
            "Publication year": 2001,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4395/0000/Near-ML-multiuser-detection/10.1117/12.438296.short",
            "Abstract": "The prohibitive -exponential in the number of users- computational complexity of the maximum likelihood (ML) multiuser detector for direct-sequence code-division-multiple-access (DS/CDMA) communications has fueled an extensive research effort for the development of low complexity multiuser detection alternatives. Notable examples are the zero-forcing (``decorrelating'') and minimum-mean-square-error (MMSE) linear filter receivers. In this paper, we show that we can efficiently and effectively approach the error rate performance of the optimum multiuser detector as follows. We utilize a multiuser zero-forcing or MMSE filter as a pre-processor whose output magnitude provides a reliability measure for each user bit decision. An ordered reliability-based error search sequence of length linear to the number of users returns the most likely user bit vector among all visited options. Numerical and simulation studies for …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:NhqRSupF_l8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Some options for L1-subspace signal processing",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6629811/",
            "Abstract": "We describe ways to define and calculate L1-norm signal subspaces which are less sensitive to outlying data than L2-calculated subspaces. We focus on the computation of the L1 maximum-projection principal component of a data matrix containing N signal samples of dimension D and conclude that the general problem is formally NP-hard in asymptotically large N, D. We prove, however, that the case of engineering interest of fixed dimension D and asymptotically large sample support N is not and we present an optimal algorithm of complexity O(N(exp D)). We generalize to multiple L1-max-projection components and present an explicit optimal L1 subspace calculation algorithm in the form of matrix nuclear-norm evaluations. We conclude with illustrations of L1-subspace signal processing in the fields of data dimensionality reduction and direction-of-arrival estimation.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:VLnqNzywnoUC",
            "Publisher": "VDE"
        },
        {
            "Title": "A decoding algorithm for finite-geometry LDPC codes",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1413585/",
            "Abstract": "In this paper, we develop a new low-complexity algorithm to decode low-density parity-check (LDPC) codes. The developments are oriented specifically toward low-cost, yet effective, decoding of (high-rate) finite-geometry (FG) LDPC codes. The decoding procedure updates iteratively the hard-decision received vector in search of a valid codeword in the vector space. Only one bit is changed in each iteration, and the bit-selection criterion combines the number of failed checks and the reliability of the received bits. Prior knowledge of the signal amplitude and noise power is not required. An optional mechanism to avoid infinite loops in the search is also proposed. Our studies show that the algorithm achieves an appealing tradeoff between performance and complexity for FG-LDPC codes.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal power assignment to minimize the average delay in hybrid-ARQ protocols",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6364486/",
            "Abstract": "In this paper, the optimal power assignment strategy is determined for hybrid automatic-repeat-request (H-ARQ) protocols such that the average delay of the protocol is minimized for any given total transmission power budget and any targeted outage probability. A set of equations is derived that describe the optimal transmission power sequence and its optimality is shown based on the Karush-Kuhn-Tucker (KKT) Theorem. The set of equations enables an exact recursive calculation of the optimal transmission power per round, and the calculation complexity is fixed regardless of the maximum number of (re)transmission rounds allowed in the H-ARQ protocol. Compared to the conventional equal power assignment strategy, the optimal power assignment scheme achieves the same average delay with much less total transmission power. More importantly, for certain power budget levels, the optimal power assignment …",
            "Abstract entirety": 0,
            "Author pub id": "tczyXJUAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind Spread-Spectrum Steganalysis via Iterative Techniques",
            "Publication year": 2010,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA523365",
            "Abstract": "We developed theory and methods for optimal digital data hiding in arbitrary transform domains of digital hosts images, video, audio. Our optimality criteria are Host distortion, recovery error rate, and the Shannon capacity of the covert channel. Additionally, we introduced for the first time the concept of multiusermulti-signature steganography. Then, we developed counter-measures to optimal multiuser steganography in the form of active message extraction and passive stegonon-stego decision steganalysis. We concluded that optimal data hiding, as described in the report, offers vast improvement in recovery error rateShannon capacity versus medium distortion and enables highly effective multi-signature embedding different-potentially-hidden messages for different POCs along the chain of command etc.. In the context of active steganalysis, the developed M-IGLS hidden message extraction algorithm can destroy conventional SS steganography. However, our own optimal SS embedding is resistant to M-IGLS steganalysis attacks, especially for small hidden messages. Our new passive binary hypothesis testing steganalysis procedure offers close to 95 identification success rate at about 1 false alarm rate when used on hosts with conventionally embedded messages.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "STATE UNIV OF NEW YORK AT BUFFALO DEPT OF ELECTRICAL ENGINEERING"
        },
        {
            "Title": "New bounds and optimal binary signature sets—Part I: Periodic total squared correlation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5715836/",
            "Abstract": "We derive new bounds on the periodic (cyclic) total squared correlation (PTSC) of binary antipodal signature sets for any number of signatures K and any signature length L. Optimal designs that achieve the new bounds are then developed for several (K,L) cases. As an example, it is seen that complete (K = L + 2) Gold sets are PTSC optimal, but not, necessarily, Gold subsets of K <; L + 2 signatures. In contrast, arguably against common expectation, the widely used Kasami sets are not PTSC optimal in general. The optimal sets provided herein are in this sense better suited for asynchronous and/or multipath code-division multiplexing applications.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recovering the Phase of Blind Space-Time DS/CDMA Channel Estimates",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=3992619240483050476&hl=en&oi=scholarr",
            "Abstract": "A theoretical minimum-mean-squareerror phase estimation criterion leads to a supervised phase recovery procedure that directly corrects the phase of arbitrary linear filter receivers through a simple closed-form projection operation. Conveniently, any known blind channel estimation algorithm can be used to provide the initial phase ambiguous estimate. The presentation is given in the context of adaptive space-time receiver designs for binary phase-shiftkeying direct-sequence code-division-multiple-access antenna array systems. Numerical and simulation studies support the theoretical developments and show that effective phase correction and multiple-accessinterference suppression can be achieved with about 2% pilot signaling.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:1pC5hbHeJ6IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive CDMA channelization",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5469930/",
            "Abstract": "We consider the problem of simultaneous power and code-channel allocation for a secondary transmitter/receiver pair coexisting with a primary code-division multiple-access (CDMA) system. We develop a novel computationally feasible solution using semidefinite programming. Simulation studies illustrate the theoretical developments.",
            "Abstract entirety": 1,
            "Author pub id": "tczyXJUAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        }
    ]
}]