[{
    "name": "Δημητριος  Βέργαδος",
    "romanize name": "Dimitrios  Vergados",
    "School-Department": "Πληροφορικής ",
    "University": "unipi",
    "Rank": " Καθηγητής",
    "Apella_id": 4514,
    "Scholar name": "Dimitrios D. Vergados",
    "Scholar id": "bP0fRIEAAAAJ",
    "Affiliation": "University of Piraeus",
    "Citedby": 5336,
    "Scholar url": "https://scholar.google.com/citations?user=bP0fRIEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A novel power-efficient middleware scheme for sensor grid applications",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-10625-5_30",
            "Abstract": "Sensor grid deployments integrate wireless sensor networks (WSNs) and Grid Computing (GC) into a merged platform. A middleware architecture is a prerequisite for sensor grids in order to bridge the two heterogeneous technologies and efficiently support aggregated grid services available to a large number of grid users. On the other hand, the energy conservation of the participating sensor nodes is an essential factor for QoS provisioning, thereby extending WSNs survivability and providing diversity to potential grid services. For the best of our knowledge, power awareness for middleware architectures for sensor grids has never been studied in the literature so far. The rationale of our work employs a scheduler which provides QoS to the grid users from an energy awareness perspective by interacting with an appropriate resource manager. Our simulations show the effectiveness of the proposed scheme …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Attack-Tree Based Risk Assessment on Cloud-Oriented Wireless Body Area Network",
            "Publication year": 2019,
            "Publication url": "https://www.igi-global.com/article/attack-tree-based-risk-assessment-on-cloud-oriented-wireless-body-area-network/235470",
            "Abstract": "Machine-to-machine (M2M) communication is an emerging technology with unrivaled benefits in the fields of e Health and m-Health. The wireless body area networks (WBANs) consist of a major subdomain of M2M communications. The WBANs coupled with the Cloud Computing (CC) paradigm introduce a supreme infrastructure in terms of performance and Quality of Services (QoS) for the development of eHealth applications. In this article, a risk assessment aiming to disclose potential threats and highlight exploitation of health care services, is introduced. The proposed assessment is based upon the implementation of a series of steps. Initially, the health care WBAN-CC infrastructure is scrutinized; then, its threats' taxonomy is identified. Then, a risk assessment is carried out based on an attack-tree consisting of the most hazardous threats against Personally Identifiable Information (PII) disclosure. Thus, the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:IUKN3-7HHlwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Code reservation schemes at the forward link in WCDMA",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366404000556",
            "Abstract": "We examine resource reservation schemes for the management of orthogonal variable spreading factor (OVSF) codes at the forward link of 3G mobile communications systems employing WCDMA. Like in every multi-service network, calls with different rate requirements will perceive very dissimilar system performance at the forward link in 3G systems if no measures are taken and the channelization code tree is treated as a common pool of resources. Assuming that the traffic level for each class is known in advance, we introduce complete sharing (CS), complete partitioning (CP) and hybrid partitioning (HP) policies to manage the code tree. At the resource reservation level, we develop an efficient method to partition the available codes based on the offered traffic load of each class of calls and the size of the tree. The resulting partition is optimal in the sense that the maximum blocking probability of the different rate …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Automatic Web site classification in a large repository under information filtering and retrieval techniques",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1014574/",
            "Abstract": "Nowadays, there is a huge volume of information on the Web, which is disseminated to the users in a chaotic way. In order to be easily accessed, the information must be clustered and classified in appropriate knowledge areas. Thus, many heavily visited sites or portals try to unify the access to multiple information sources, providing by this way classification of information. This paper proposes a system, aiming to classify e-commerce sites according their Web-content. This system can be implemented for automatic knowledge segmentation in a portal or in a search engine repository. The system performance reached 96% in the first test sets, after the learning phase. However, the performance significantly increases (up to 98%) as the number of the test sets increases.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Complexity analysis of a hybrid threshold-based ZF-MMSE equalizer for sic-based MIMO-OFDM receivers",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6733054/",
            "Abstract": "In this paper, we propose a new reception scheme for MIMO-OFDM systems, which can switch between two different equalization methodologies, accordingly, on a subcarrier basis. In fact, the proposed receiver is based on the ordered successive interference cancellation (SIC) technique and uses jointly zero forcing SIC (ZF-SIC) and minimum mean squared error SIC (MMSE-SIC) according to a defined threshold value. The modulation scheme considered in this study is QPSK. Our main objective, here, is the provision of the computational complexity efficiency. Hence, a complexity analysis is provided and upper and lower complexity bounds for the proposed scheme are also derived.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Vertical Handover management scheme for VANET Cloud Computing systems",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8024558/",
            "Abstract": "Vehicular Cloud Computing (VCC) systems use heterogeneous network access technologies in order to fulfill the requirements of modern services. Therefore, the need for efficient Vertical Handover (VHO) management schemes must be addressed. In this paper a VHO management scheme for VCC systems is described. The proposed method takes into account the vehicles velocity as well as its current connection type and applies a two step VHO algorithm to reduce operations' costs and optimize mobility management. Accordingly, as a first step a VHO initiation process evaluates the necessity to perform handover and subsequently a network selection process selects the appropriate network alternative considering both vehicular service requirements and operators' policies. The proposed scheme is applied to a VCC system which includes Long Term Evolution (LTE) Macrocells and Femtocells as well as 802 …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:ruyezt5ZtCIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "BRWM: A relevance feedback mechanism for web page clustering",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_6",
            "Abstract": "This paper describes an information system, which classifies web pages in specific categories according to a proposed relevance feedback mechanism. The proposed relevance feedback mechanism is called Balanced Relevance Weighting Mechanism — BRWM and uses the proportion of the already relevant categorized information amount for feature classification. Experimental measurements over an e-commerce framework, which describes the fundamental phases of web commercial transactions verified the robustness of using the mechanism on real data. Except from revealing the accomplished sequences in a web commerce transaction, the system can be used as an assistant and consultation tool for classification purposes. In addition, BRWM was compared with a similar relevance feedback mechanism from the literature over the established corpus of Reuters-21578 text categorization test …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Spectrum allocation in cognitive radio networks using chaotic biogeography-based optimisation",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/iel7/6072580/8444517/08444565.pdf",
            "Abstract": "Cognitive radio networks are a promising technology for the improvement of the spectrum utilisation. The basic idea is to maximise the utilisation of the available spectrum by dynamically assigning available channels to secondary users. This problem known as the spectrum allocation problem is non-deterministic polynomial-time hard (NP-hard). Chaotic biogeography-based optimisation (CBBO) is a recently proposed evolutionary algorithm that can be applied to the above-mentioned problem. The authors compare CBBO with other popular algorithms in different spectrum allocation problem cases. The results show that CBBO performs in general better or similar to the other algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:0izLItjtcgwC",
            "Publisher": "IET"
        },
        {
            "Title": "Energy efficient routing in wireless sensor networks through balanced clustering",
            "Publication year": 2013,
            "Publication url": "https://www.mdpi.com/45882",
            "Abstract": "The wide utilization of Wireless Sensor Networks (WSNs) is obstructed by the severely limited energy constraints of the individual sensor nodes. This is the reason why a large part of the research in WSNs focuses on the development of energy efficient routing protocols. In this paper, a new protocol called Equalized Cluster Head Election Routing Protocol (ECHERP), which pursues energy conservation through balanced clustering, is proposed. ECHERP models the network as a linear system and, using the Gaussian elimination algorithm, calculates the combinations of nodes that can be chosen as cluster heads in order to extend the network lifetime. The performance evaluation of ECHERP is carried out through simulation tests, which evince the effectiveness of this protocol in terms of network energy efficiency when compared against other well-known protocols. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Congestion avoidance in wireless sensor networks: a survey",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6377397/",
            "Abstract": "Congestion can degrade the performance of a Wireless Sensor Network (WSN) since it causes energy waste, throughput reduction and increased information loss. To prevent this situation several congestion avoidance mechanisms and schemes may be applied. The aim of this paper is to survey existing congestion avoidance mechanisms to classify them and to discuss their advantages and drawbacks.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:N5tVd3kTz84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "High performance computing application for the textile quality control",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=17174531718166253791&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wireless local area networking: QoS provisioning and resource management",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1470676/",
            "Abstract": "QoS introduces new pricing issues in WLANs. The traditional approach for charging based on connection time is obviously not suitable for QoS-capable applications. Accounting and billing policies should charge the various traffic classes according to the network resources used. Also, unified QoS billing is necessary to allow various network operators that use different network technologies to cooperate so that wireless users can seamlessly roam in the network. Security is also a very important issue in WLANs. Complicated authentication, authorization, and accounting techniques often introduce unacceptable delays. Security, however, is essential in QoS WLANs for allowing integrity and confidentiality. Further research is needed in this area to identify and propose light techniques that provide robust secure networks without adversely affecting the performance of existing protocols. Several classes of security may …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance analysis of successive decoding based on shadowing side information under non-identical composite fading/shadowing channels",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7097089/",
            "Abstract": "The performance of a distributed multiple input- multiple output (MIMO) system with m single-antenna transmitters and a receiver with n ≥ m antennas is analytically investigated. Particularly, the transmitters simultaneously send their information streams to the receiver, operating under the spatial multiplexing regime. To this end, the receiver utilizes the zero forcing detection followed by the ordered successive interference cancellation technique. Composite fading/shadowed channels between receiver and transmitters are assumed, which are modeled as non-identical K faded channels (i.e., Rayleigh multipath fading and Gamma distributed shadowing). The receiver sequentially detects and decodes the streams, starting from the strongest to the weakest, whereas symbol ordering is implemented with regards to shadowing side information without taking into account the fast varying multipath fading fluctuations. New …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:vbGhcppDl1QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic Site Classification in a Large Reciprocity under Information Filtering and Retrieval Techniques",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=9868162834630888290&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Health Monitoring of People with Diabetes using IoT and 5G Wireless Network Infrastructures",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9284388/",
            "Abstract": "During the last years, Internet of Things (IoT) is evolving rapidly, providing a vast range of equipment that fits in all aspects of modern life. Indicatively, wearable devices can be used for monitoring people’s health, since several people need continuous medical supervision due to health problems they face. Meanwhile the continuous monitoring of their health status with traditional ways, such as with daily visits at hospitals, brings several limitations to their daily lives while at the same time it does not provide supervision on a 24-hour basis. This paper proposes a model to monitor the health of people with diabetes melitus, a disease with high incident rates mainly at the elderly but also in younger people. Specifically, a study about the existing medically approved technologies for continuous measurement of diabetes is described. Subsequently, the model for monitoring patient’s blood glucose levels is descibed …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:HeT0ZceujKMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Energy Efficiency Scheme for Wireless Sensor Networks",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/57636320/4_20ID_200304.pdf",
            "Abstract": "Wireless Sensor Networks (WSNs) facilitate, monitoring and controlling of physical environments from remote locations with better accuracy. Sensor networks are dense wireless networks consisting of groups of small, inexpensive nodes, which collect and disseminate critical data. Thus, sensor nodes have various energy and computational constraints, because of their inexpensive nature and ad hoc method of deployment. Considerable research has been focused at overcoming these deficiencies through low-energy consumption schemes. In this paper, we propose a Scheduling Scheme for Energy Efficiency in Wireless Sensor Networks. The basic concept of this scheme is to try to maximize the time each sensor node remains in SLEEP mode, and to minimize the time spent in IDLE mode, taking into account not only the consumed power, but also the end-to-end transmission delay.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access network selection in a heterogeneous environment using the AHP and fuzzy TOPSIS methods",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16644-0_9",
            "Abstract": "The problem of network selection across heterogeneous wireless networks has recently received much attention because of a drive for converged communication systems. However, since the selection of an access network depends on several parameters with different relative importance, such as the network and the application characteristics, the user preferences, the service cost, etc, it is a difficult task to be achieved. In this paper an effective access network selection algorithm for heterogeneous wireless networks is proposed that combines two Multi Attribute Decision Making (MADM) methods, the Analytic Hierarchy Process (AHP) method and the fuzzy Total Order Preference by Similarity to the Ideal Solution (TOPSIS) method. More specifically, the AHP method is used to determine weights of the criteria, and the fuzzy TOPSIS method is used to obtain the final access network ranking.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Knowledge-based Service Creation and Execution Framework for Adapting Composite Wireless IP Services",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=10066549910020524019&hl=en&oi=scholarr",
            "Abstract": "Wireless services infrastructures beyond 3G are evolving into highly complex and heterogeneous network environments embracing",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy Optimization in Massive MIMO UAV-Aided MEC-Enabled Vehicular Networks",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9519704/",
            "Abstract": "This paper presents a novel unmanned aerial vehicle (UAV)-aided mobile edge computing (MEC) architecture for vehicular networks. It is considered that the vehicles should complete latency-critical computation-intensive tasks either locally with on-board computation units or by offloading part of their tasks to road side units (RSUs) with collocated MEC servers. In this direction, a hovering UAV can serve as an aerial RSU (ARSU) for task processing or act as an aerial relay and further offload the computation tasks to a ground RSU (GRSU). To significantly reduce the delay during data offloading and downloading, this architecture relies on the benefits of line-of-sight (LoS) massive multiple-input–multiple-output (MIMO). Therefore, it is considered that the vehicles, the ARSU, and the GRSU employ large-scale antennas. A three-dimensional (3-D) geometrical representation of the MEC-enabled network is introduced …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:LhH-TYMQEocC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing fairness in wireless multi-hop networks",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Anagnostopoulos-4/publication/221223399_Enhancing_Fairness_in_Wireless_Multi-Hop_Networks/links/02bfe50dda478bfa37000000/Enhancing-Fairness-in-Wireless-Multi-Hop-Networks.pdf",
            "Abstract": "Wireless multi-hop networks have recently been conceived as a networking paradigm. However, their deployment has been limited, mainly due to the fact that they lack fairness. In this research effort, we briefly review the state of art in fairness mechanisms in multi-hop networks and we propose an algorithm that tries to differentiate the traffic among the connections in a wireless multi-hop ad-hoc sensor network, so that the fairness is enhanced. This is achieved by an adaptive scheme, which tries to assign a higher priority to the traffic connections that experience delay greatly larger than the average, so that their delay is reduced, and the fairness of the system is improved.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cooperative spectrum sharing MIMO systems with successive decoding",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1874490716000033",
            "Abstract": "A spectrum sharing system with primary and secondary nodes, each equipped with an arbitrary number of antennas, is investigated. Particularly, the outage performance of an underlay cognitive system is analytically studied, in the case when the end-to-end (e 2 e) communication is established via an intermediate relay node. To better enhance the e 2 e communication, successive interference cancellation (SIC) is adopted, which compensates for both the transmission power constraint and the presence of interference from primary nodes. Both the relay and secondary receiver perform unordered SIC to successively decode the multiple streams, whereas the decode-and-forward relaying protocol is used for the e 2 e communication. New closed-form expressions for the e 2 e outage performance of each transmitted stream are derived in terms of finite sum series of the Tricomi confluent hypergeometric function. In …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:gsN89kCJA0AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Wireless Mesh Routing Protocols For Health Communication Systems",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/34202515/A_261-270_Sgora.pdf",
            "Abstract": "Wireless Mesh Networks (WMNs) consist of mesh routers and mesh clients. Mesh routers have minimal mobility and form the backbone of WMNs, while mesh clients can be either stationary or mobile, and can form a client mesh network among themselves and with mesh routers. WMNs are characterized by dynamic self-organization, self-configuration and selfhealing to enable flexible integration, quick deployment, easy maintenance, low cost, high scalability and reliable services. WMNs may be also used to improve the performance of multi-hop ad-hoc networks, Wireless local area networks (WLANs) and Wireless Metropolitan Area Networks (WMANs). One of the factors that influence the performance of WMNs is the routing protocol that is used. Many routing protocols for WMNs can be found in the literature. However, not all these protocols are suitable for health communication systems. In this paper, based on the operational requirements of the health applications, we classify several routing protocols for wireless mesh networks and highlight their advantages and performance issues when they are used in healthcare.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Group registration with distributed databases for location tracking in 3G wireless networks",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128608000200",
            "Abstract": "The increase of subscribers in wireless networks has led to the need for efficient location tracking strategies. Location tracking is used to keep track of a Mobile Terminal (MT). The network retains the Registration Area (RA), where the MT last updated its location, so when an incoming call arrives for the MT, the network with the help of a location tracking strategy can find the area where the MT resides and then deliver the call. In this paper, we introduce a 2-level distributed database architecture combined with the Group Registration (GR) location tracking strategy to be used in 3G wireless networks. The GR strategy reduces the location management total cost, by updating the location of MTs in an RA with a single route response message to the HSS (Home Subscriber Server). More specifically, the IDs of the MTs newly moving into an RA are buffered and sent to the HSS for location updating in the route response …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Hierarchical energy efficient routing in wireless sensor networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4602221/",
            "Abstract": "The domain of wireless sensor networks (WSNs) is one of the most rapidly growing scientific fields. This is because not only the technological advances have enabled the development of advanced sensor nodes with extremely low cost but the potential applications of such structures are ever growing too. WSNs differ from traditional wireless communication networks in several of their characteristics. One of them is power awareness, due to the fact that the batteries of sensor nodes have a restricted lifetime and are difficult to be replaced. Therefore, all protocols must be designed in such a way as to minimize energy consumption and preserve the longevity of the network. That is why, routing protocols in WSNs aim mainly to accomplish power conservation while in traditional networks they focus primarily on the quality of service (QoS). Recent advances in WSNs have led to many new protocols specifically designed …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying mobile IP over wireless ATM communication networks",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957214/",
            "Abstract": "Advances in mobile devices' and networks' technology have set a challenging pace for all new proposals in the rapidly growing domain of mobile communications. The decade of the 90's brought a revolution in mobile computing. The explosion in sales of laptop PCs as well as personal digital assistants and cellular phones has marked the beginning of a new era in the users'/consumers' needs and demands from the network providers. Users of today opt not only for voice and multimedia applications but also for mobility. It is evident that high-speed wireless networks like WATM together with the use of IP are becoming more than an in vitro area of research.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of broadcast scheduling algorithms for ad-hoc TDMA networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5172480/",
            "Abstract": "Ad-hoc networks rely on multihop transmission among the nodes on the same channel. Possible simultaneous transmissions may cause collisions, whenever transmitting nodes have a common destination node in their interference range. To avoid these collisions while minimizing the frame length, the NP-complete Broadcast Scheduling Problem (BSP) should be approximated. This is usually done by interpreting the BSP into a corresponding graph coloring problem. This paper proposes an algorithm that tries to approximate the BSP, using an interference vector. Additionally, the node ordering policies used for scheduling are evaluated in terms of frame length and execution time. Simulation results show that the proposed algorithm has smaller execution time than the ones using graph coloring, and decreasing degree ordering results to the best frame length.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The 3G wireless technology in tactical communication networks",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1405024/",
            "Abstract": "Third generation mobile systems are seen as the technology to bring new broadband services to the mobile user. This paper discusses UMTS/GPRS technologies applying to tactical communication networks. A detailed description of the 3G technologies is provided, and their application in military environments is studied in depth. The paper discusses the introduction of new services into military networks, which improves tactical effectiveness, while also dealing with major improvements in spectrum efficiency, capability and functionality compared with today's non-voice mobile services. The schemes and mechanisms for controlling the traffic in order to achieve the per-hop behavior is still an open problem in the military wireless environment. GPRS and UMTS can provide military with access to many different demanding tactical services. Nevertheless, in order to preserve the unique characteristics of military systems …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient detection-switching based on successive interference cancellation for multiple-input multiple-output orthogonal frequency division multiplexing systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/document/6547276/",
            "Abstract": "The authors propose a new reception scheme based on the successive interference cancellation (SIC) approach by jointly performing zero forcing (ZF) and minimum mean squared error (MMSE) according to a defined threshold. A complexity analysis is provided although upper and lower complexity bounds are also derived. A detailed performance evaluation is presented, which explicitly indicates the usefulness of the proposed switching method across the conventional ZF-SIC and MMSE-SIC in terms of computational savings and/or error resilience. An alternative switching threshold which is based on the ergodic capacity is also presented, in case of capacity-driven applications.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:uLbwQdceFCQC",
            "Publisher": "IET"
        },
        {
            "Title": "A Network Selection Algorithm for supporting Drone Services in 5G Network Architectures",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8715536/",
            "Abstract": "Flying Ad-hoc Networks (FANETs) use 5G network access technologies to fulfill the requirements of their services. In this environment, Drone to Infrastructure (D2I) communication is supported, while each drone could use both Disaster Management (DM) and non-Disaster Management (nDM) services. Efficient network selection algorithms are required to satisfy the constraints of the used services, since the presence of DM services affects the importance of nDM services in situations where a natural disaster occurs. This paper proposes a network selection algorithm which is called Dynamic Trapezoidal Fuzzy Topsis with Adaptive Criteria Weights (DTFT-ACW). DTFT-ACW accomplishes the ranking of the candidate networks considering the importance of each service, as well as the weights of the corresponding selection criteria, as they are obtained with respect to the severity level of a natural disaster occurred …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:HIFyuExEbWQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A network selection scheme with adaptive criteria weights for 5g vehicular systems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8633595/",
            "Abstract": "Fifth Generation Vehicular Cloud Computing (5G-VCC) systems use heterogeneous network access technologies to fulfill the requirements of modern vehicular services. Efficient network selection algorithms are required to satisfy the constraints of Driver Assistance (DA) services, Passengers Entertainment and Information (PEnI) services and Medical (MED) services that provided to vehicular users. The presence of MED services affects the importance of other services in situations where patients with immediate health status exist within the vehicle. This paper proposes a network selection scheme which considers the patient health status to adapt the importance of each service. The scheme consists of two Fuzzy Multi Attribute Decision Making (FMADM) algorithms: the Trapezoidal Fuzzy Adaptive Analytic Network Process (TF -AANP) to calculate the relative importance of each vehicular service and the selection …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:DUooU5lO8OsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint per-flow scheduling and routing in wireless multihop networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983842/",
            "Abstract": "Multihop networks are used in a variety of ways, that include ad-hoc networks, wireless sensor networks, and mesh networks. These networks consist of nodes that connect over a wireless channel, and communicate over multiple links by forwarding each other's messages. The throughput is determined by the contention among the nodes for the wireless resources. Thus routing algorithms, influence the level of contention at each location of the network, and play an important role in the network throughput. Additionally, the sequence of transmission opportunities of each node, which is determined by the scheduling algorithm, should also be carefully designed, since it affects the available resources of each node. In this paper we study the effect of routing and scheduling algorithms on the throughput of multihop networks. We propose a per-flow joint routing/scheduling algorithm that has the property of routing the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "a GIS-based methodology for designing wireless links",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.444.9041&rep=rep1&type=pdf",
            "Abstract": "Wireless technology is frequently used in military networks for establishing communication in areas characterized by non-uniform terrain morphology (ie, mountains, islands, etc.) where mobile military units have to be moved and for creating also a security back-up network easily to be used for emergency situations (ie, an enemy’s sabotage). Towards the exploitation of the wireless technology, the paper presents a methodology for specifying the wireless links, which constitute the backbone of a wireless military network. Although the presented methodology concerns the design of a military-purposed wireless network, it can be easily generalized in order to be applied in other types of wireless networks (eg commercial, corporative, pilot networks, etc.). An application of the proposed methodology is also discussed in the paper.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A routing scheme for congestion avoidance in wireless sensor networks",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/67281891/A_Routing_Scheme_for_Congestion_Avoidanc20210510-4067-efb0b7.pdf",
            "Abstract": "Congestion has an utterly detrimental influence in the performance of Wireless Sensor Networks (WSNs). Many of the causes of congestion in WSNs are different than the causes of congestion in wired networks. Hence, new research has to be developed for the avoidance and control of congestion in WSNs. This article proposes a scheme which aims to both forecast imminent congestion and prevent its further diffusion in WSNs. The prediction of forthcoming congestion is based on the computation of a suitably built cost function, which considers a set of metrics related with the popularity of the alternate nodes and routing paths. The prevention of congestion diffusion is carried out through multi hop/path routing, by utilizing nodes and routes which are less probable to be congested. Simulation tests performed evaluate the efficacy of the proposed scheme.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:URolC5Kub84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "NA Pantazis, I. Anagnostopoulos, DJ Vergados and V. Loumos,“Decision Support Algorithms and Optimization Techniques for Personal Homecare Environment,”",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new approach for TDMA scheduling in ad-hoc networks",
            "Publication year": 2005,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9781860947315_0012",
            "Abstract": "Medium Access Control (MAC) for Ad-hoc networks has been a major concern of both academia and industry for many years. Even though the dominant MAC for ad-hoc networks is CSMA/CA, it leads to a number of disadvantages like high overhead, increased access delay, high jitter and limited QoS capabilities. TDMA appears as a promising solution for overcoming these issues, but the application of TDMA in ad-hoc networks leads to the known NP complete Broadcast Scheduling Problem (BSP). This paper presents a new polynomial algorithm that can provide a suboptimal solution the BSP. The efficiency of the new algorithm is evaluated in terms of complexity, delay, throughput and fairness, and is compared with other solutions",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security protocols in wireless tactical sensor networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1605883/",
            "Abstract": "Advances in technology led to the development of sensor networks at low cost. Sensor networks can he used in several application areas including military, health, home, environmental and space exploration. Sensor nodes have several constraints, like limited computational and energy resources that pose design issues to researchers. In tactical sensor networks security plays an important role, since these networks are deployed in hostile environments and run safety-critical applications. This paper presents security protocols used in wireless networks and considers how well these algorithms can he applied to wireless tactical sensor networks",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dual-hop communication over a satellite relay and shadowed Rician channels",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6918460/",
            "Abstract": "A dual-hop amplify-and-forward (AF) relaying scheme over shadowed Rician fading channels is investigated. Specifically, the source and destination nodes are equipped with N and M antennas, respectively, whereas the relay is equipped with a single antenna. Communication via satellite relaying represents a direct application of the considered infrastructure. To this end, we study the scenario when the source and the destination are terrestrial nodes, whereas the end-to-end communication is established through an intermediate AF relay node, which is a satellite. To fully exploit the spatial diversity provided by multiple antennas, maximum ratio transmission and maximum ratio combining are implemented at the source and the destination, respectively. First, a new closed-form expression for the probability density function (pdf) of the sum of independent and identically distributed (i.i.d.) squared shadowed Rician …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:EYYDruWGBe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "New generation features for tactical wireless communication networks",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/887074/",
            "Abstract": "Mobility of forces, increased range between formations and advances in data processing technologies call for new technical solutions for tactical communication networks. Access to fast, secure and reliable communications is more than ever before the key to success. Different services and different applications should be supported. This paper outlines developments in data transport capabilities, functionality and performance of tactical wireless communication networks and discusses the depiction of these developments in evolving standardized protocols and interfaces. Important issues such as line of sight transmission, network management, encryption, switching, survivability, modularity, interoperability and performance of the new tactical communication systems are discussed in detail. Increased focus is attributed to new ECCM methods, as electronic warfare becomes more and more sophisticated.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Stefanos A. Nikolidakis and Dimitrios D. Vergados,“",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network Slicing on 5G Vehicular Cloud Computing Systems",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1155818",
            "Abstract": "Fifth generation Vehicular Cloud Computing (5G-VCC) systems support various services with strict Quality of Service (QoS) constraints. Network access technologies such as Long-Term Evolution Advanced Pro with Full Dimensional Multiple-Input Multiple-Output (LTE-A Pro FD-MIMO) and LTE Vehicle to Everything (LTE-V2X) undertake the service of an increasing number of vehicular users, since each vehicle could serve multiple passenger with multiple services. Therefore, the design of efficient resource allocation schemes for 5G-VCC infrastructures is needed. This paper describes a network slicing scheme for 5G-VCC systems that aims to improve the performance of modern vehicular services. The QoS that each user perceives for his services as well as the energy consumption that each access network causes to user equipment are considered. Subsequently, the satisfactory grade of the user services is estimated by taking into consideration both the perceived QoS and the energy consumption. If the estimated satisfactory grade is above a predefined service threshold, then the necessary Resource Blocks (RBs) from the current Point of Access (PoA) are allocated to support the user’s services. On the contrary, if the estimated satisfactory grade is lower than the aforementioned threshold, additional RBs from a Virtual Resource Pool (VRP) located at the Software Defined Network (SDN) controller are committed by the PoA in order to satisfy the required services. The proposed scheme uses a Management and Orchestration (MANO) entity implemented by a SDN controller, orchestrating the entire procedure avoiding situations of interference …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:F9fV5C73w3QC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Call admission control and QOS in wireless ATM networks",
            "Publication year": 2002,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16580760",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D04 Telecommunications and information theory/001D04B Telecommunications/001D04B02 Systems, networks and services of telecommunications/001D04B02G Transmission and modulation (techniques and equipments)",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An adaptive video transmission algorithm to improve quality of experience over lte access networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6377398/",
            "Abstract": "The LTE standard is a promising solution to wireless connectivity. It promises high data rates at a low cost. At the same time, video traffic has so far outpaced other traffic types in growth, making it now the dominant traffic type in wireless networks. In this paper we study the concept of Quality of Experience for video traffic in LTE systems, Since video users are more annoyed by unpredictable packet loss, rather than reduced video fidelity, we developed an adaptive video coding scheme that aims to improve QoE in LTE networks, by continuously adapting the video fidelity, in order to keep the packet loss at acceptable levels.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Load Balancing Algorithm for 5G Vehicular Cloud Computing Systems",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3437120.3437316",
            "Abstract": "5G Vehicular Cloud Computing (5G-VCC) infrastructures are evolving rapidly. In a 5G-VCC system, Cloud resources should be efficiently distributed to provide satisfactory Quality of Service (QoS) for modern services with increased requirements. Furthermore, the workload should be fairly distributed to the available Virtual Machines (VMs). This paper proposes an algorithm for performing load balancing in Cloud infrastructures that exist in 5G-VCC systems. The algorithm is called Modified Ant Colony Optimization (MACO), as its functionality is influenced by the natural behaviour of ants. Specifically, the MACO algorithm assigns a pheromone (weight) value to each VM. Subsequently, for each service request the VM with the highest pheromone is selected in a way similar to the one that ants apply to select optimal routes. The selection of each VM results in the decrement its pheromone value, considering the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:a3BOlSfXSfwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Joint routing and per-flow fairness in wireless multihop networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4556301/",
            "Abstract": "In wireless multihop networks communication between two end-nodes is carried out by hopping over multiple short wireless links. Traditional CSMA/CA based media access control does not work satisfactory in a multihop scenario, since an intended target of a communication may be subject to mutual interference imposed by concurrent transmissions from nodes which cannot directly sense each other, causing unfair throughput allocation. Although TDMA seems to be a more promising solution, careful transmission scheduling is needed in order to achieve error-free communication and fairness. In our previous work, a TDMA scheduling algorithm has been proposed that schedules the transmissions in a fair manner and takes into account the communication requirements of the active flows of the network. In this paper, in order to further improve this scheme, we combine the TDMA scheduling algorithm with two …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multilayer key establishment for large-scale sensor networks",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSN.2008.016197",
            "Abstract": "Research on key establishment for Distributed Sensor Networks (DSNs) focuses on lightweight protocols that are feasible for the sensor nodes, which by default have restricted capabilities. Although the most efficient protocols for key establishment are based on symmetric key encryption, these protocols are unable to provide adequate security against attacks, such as node impersonation and fake generation attacks. For this reason, several hybrid key establishment protocols have been developed, making limited use of public key cryptography and more particularly of Elliptic Curve Cryptography. However, although these protocols seem to be efficient for sensor nodes, they reduce performance, especially in large-scale networks. In this paper, we propose a multilayer key establishment protocol for DSNs, which combines hybrid and symmetric key establishment techniques. The performance analysis shows a …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Enhanced route selection for energy efficiency in wireless sensor networks",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1385289.1385365",
            "Abstract": "Wireless Sensor Networks (WSNs) facilitate monitoring and controlling of physical environments from remote locations with the best possible accuracy. Sensor networks are dense wireless networks consisting of groups of small, inexpensive nodes, which collect and disseminate critical data. Thus, sensor nodes have various energy and computational constraints, due to their inexpensive nature and ad hoc method of deployment. Considerable research has been focused at overcoming these deficiencies through low-energy consumption schemes. Among, other factors, the route selection strategy may have an impact on the network lifetime. In this paper, we present a lifetime prolonging route selection strategy for wireless sensor networks, namely Low Cost Min-Max Energy Routing (LCMMER). The proposed algorithm tries to avoid the least-energy nodes, while at the same time to maintain low energy consumption …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A network selection scheme for healthcare vehicular cloud computing systems",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8316378/",
            "Abstract": "Healthcare Vehicular Cloud Computing (VCC) systems use heterogeneous network access technologies to fulfill the requirements of medical services and enhance the health monitoring and care of vehicular users. In such a system, efficient network selection algorithms are required to satisfy the constraints of critical medical services such as health monitoring using sensors, live streaming of medical video and clinical data transmission. Therefore, in this paper a network selection scheme for supporting medical services in VCC systems is proposed. It consists of two Multi Attribute Decision Making (MADM) algorithms: the Trapezoidal Fuzzy Analytic Network Process (TF-ANP) to calculate the relative importance of the selection criteria and the Trapezoidal Fuzzy Topsis (TFT) to accomplish the ranking of the candidate networks. Both algorithms use Interval-Valued Trapezoidal Fuzzy Numbers (IVTFN). Performance …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:0N-VGjzr574C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile IP: A Challenge in the Mobile World",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=18221601156691712910&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling Browsing Behavior and Sampling Web Evolution Features through XML Instances.",
            "Publication year": 2007,
            "Publication url": "https://www.scitepress.org/Papers/2007/12795/12795.pdf",
            "Abstract": "Nowadays, many web services have the essential role of accessing and processing the disseminated information on the web, while in parallel, distribute and exchange metadata among them in order to deliver relevant information to the end user. However, their competence is hindered, due to the vast amount of information added, the poor organization, as well as the lack of effective crawling techniques that fail to follow the exponential growth of the web. In this paper we propose an algorithm, which uses five third party web search services and it is capable of self-adapting over the incessant changes that occur on the indexed web. The algorithm works in conjunction with a user browsing behavior model that monitors and records the users’ interactions with the third-party services, using XML search session instances. From the assessment made, it was concluded that the proposed algorithm not only adapts to the users’ web search profiles but also adapts to the evolutionary nature of the web.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:bKqednn6t2AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DPS: An architecture for VBR scheduling in IEEE 802.11 e HCCA networks with multiple access points",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-008-0126-5",
            "Abstract": "Recent advances in 802.11 Wireless Local Area Networks (WLANs) have been focused on introducing Quality of Service (QoS) in their performance through the adoption of 802.11e. The Hybrid Controlled Channel Access (HCCA) has been proposed as the mechanism to provide the means for guaranteed QoS in networks controlled by a single Access Point (AP). Moreover, scheduling algorithms have been developed allowing efficient scheduling of Variable Bit Rate (VBR) traffic flows. However, little research may be found regarding the problem of applying HCCA on networks with multiple APs. In this paper, various VBR scheduling mechanisms and methods for multi—AP HCCA are presented and evaluated. In addition, this paper introduces the Dynamic Parallel Scheduler (DPS), a novel HCCA scheduling algorithm for VBR traffic among multiple APs that takes advantage of the rate variability and spatial …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Towards mobile cloud security performance: A cross-border approach",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7500392/",
            "Abstract": "The concept of security performance emerges as the core attribute when cloud-based systems need to process data flows through different countries. To effectively address the cloud security issues through a territorial perspective, it is crucial to focus on the initial objectives of the Terms of Service as issued by the cloud service operator or provider. In this paper, a cloud-based service scenario where sensitive data are transferred and managed in a cross-border manner is assessed. The threats definition process considers the adoption of mobile devices. The paper focuses on the security assessment process and on information reconnaissance which in turn leads to the cloud defence boundary's exploitation. Also, the issue of how the service level objectives (SLOs) may affect security and privacy issues in a cloud-based environment is addressed.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-Optical FSO Relaying Under Mixture-Gamma Fading Channels and Pointing Errors",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-018-6050-5.pdf",
            "Abstract": "The performance of all-optical dual-hop relayed free-space optical communication systems is analytically studied and evaluated. We consider the case when the total received signal undergoes turbulence-induced channel fading, modeled by the versatile mixture-Gamma distribution. Also, the misalignment-induced fading due to the presence of pointing errors is jointly considered in the enclosed analysis. The performance of both amplify-and-forward and decode-and-forward relaying transmission is studied, when heterodyne detection is applied. New closed-form expressions are derived regarding some key performance metrics of the considered system; namely, the system outage probability and average bit-error rate.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Harmonized mobility management in IMS networks based on the SSON concept",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6108336/",
            "Abstract": "As IP communications become abundant in the mobile world, the beyond 3G network concept tends to find anchorage in IMS technology. IMS shows potential for supporting rich-content applications and mixed user communication scenarios over mobile, wireless, and fixed access interfaces. IMS important advancement is the capacity for \"liberalized\" communications, where service provisioning is decoupled from the network infrastructure, thus making possible deployment across multi-operator networks. This article introduces such a federation mechanism for harmonized user mobility management, based on the Single Sign ON (SSON) concept of network registration. We demonstrate how the SSON functionality can be incorporated in the IMS architecture and exploited in achieving seamless user handover/ roaming and service continuity across multi-operator mixed-technology networks.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A QoE-driven adaptation scheme for video content delivery in LTE networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6629845/",
            "Abstract": "The Long-Term Evolution (LTE) standard is a promising solution to mobile connectivity. It provides high data rates at a relatively low cost. At the same time, video traffic has so far outpaced other traffic types in growth, making it the dominant traffic type in current wireless networks. In this paper we study the concept of Quality of Experience (QoE) for video traffic in LTE systems. Since video users are more annoyed by unpredictable disruptions than overall reduced video fidelity, we developed an adaptive video coding scheme that aims to improve QoE in LTE networks. In the proposed model users of the same quality class are classified into a number of service levels providing different QoE satisfaction thresholds to their members. The QoE driven adaptation scheme adapts the rate of the transmitted video, so that the QoE experienced by the users remains in satisfactory levels. Two different policies for transmission …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:W5xh706n7nkC",
            "Publisher": "VDE"
        },
        {
            "Title": "Wireless sensor and actor☆ We refer to entities that can act on the network as actors They are sometimes referred to as actuators in related literature.☆ networks: research challenges",
            "Publication year": 2004,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-48e8858f-d054-3719-b01b-c05fd8ae273e",
            "Abstract": "Wireless sensor and actor networks (WSANs) refer to a group of sensors and actors linked by wireless medium to perform distributed sensing and acting tasks. The realization of wireless sensor and actor networks (WSANs) needs to satisfy the requirements introduced by the coexistence of sensors and actors. In WSANs, sensors gather information about the physical world, while actors take decisions and then perform appropriate actions upon the environment, which allows a user to effectively sense and act from a distance. In order to provide effective sensing and acting, coordination mechanisms are required among sensors and actors. Moreover, to perform right and timely actions, sensor data must be valid at the time of acting. This paper explores sensor-actor and actor-actor coordination and describes research challenges for coordination and communication problems.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:hCrLmN-GePgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "nal Manuscripts Due: rblication of Special Issue: uest Editors",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301008/",
            "Abstract": "Prospective authors are requested to submit new, unpublished manuscripts for inclusion in the upcoming event described in this call for papers.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "All cognitive MIMO: New multiuser detection approach with different priorities",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8368094/",
            "Abstract": "A new detection scheme for multiuser multiple-input multiple-output (MIMO) systems is analytically presented. In particular, the transmitting users are being categorized in two distinct priority service groups, while they communicate directly with a multi-antenna receiver. The linear zero-forcing scheme is applied in two consecutive detection stages upon the signal reception. In the first stage, the signals of one service group are detected, followed by the second stage, including the corresponding detection of the remaining signals. An appropriate switching scheme based on specific transmission quality requirements is utilized prior to the detection so as to allocate the signals of a given service group to the suitable detection stage. The objective is the provision of the reception quality for both service groups. The proposed approach can be implemented directly in cognitive radio communication assigning the secondary …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:PoWvk5oyLR8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Decision support algorithms and optimization techniques for personal homecare environment",
            "Publication year": 2006,
            "Publication url": "http://medlab.cc.uoi.gr/itab2006/proceedings/eHealth/162.pdf",
            "Abstract": "In this paper, various decision support schemes are proposed evaluating the selection of different network infrastructures in terms of routing optimization and signal strength selection. Limited computational and radio communication capabilities require collaborative algorithms with energy-aware communication. Power saving makes it possible to guarantee basic levels of system performance, such as connectivity, throughput and delay, in the presence of both mobility-immobility and a large number of sensor nodes. A variety of approaches for intelligent energy-efficient schemes have been simulated over different performance metrics.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Network Slicing Framework for UAV-Aided Vehicular Networks",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1210844",
            "Abstract": "In a fifth generation (5G) vehicular network architecture, several point of access (PoA) types, including both road side units (RSUs) and aerial relay nodes (ARNs), can be leveraged to undertake the service of an increasing number of vehicular users. In such an architecture, the application of efficient resource allocation schemes is indispensable. In this direction, this paper describes a network slicing scheme for 5G vehicular networks that aims to optimize the performance of modern network services. The proposed architecture consists of ground RSUs and unmanned aerial vehicles (UAVs) acting as ARNs enabling the communication between ground vehicular nodes and providing additional communication resources. Both RSUs and ARNs implement the LTE vehicle-to-everything (LTE-V2X) technology, while the position of each ARN is optimized by applying a fuzzy multi-attribute decision-making (fuzzy MADM) technique. With regard to the proposed network architecture, each RSU maintains a local virtual resource pool (LVRP) which contains local RBs (LRBs) and shared RBs (SRBs), while an SDN controller maintains a virtual resource pool (VRP), where the SRBs of the RSUs are stored. In addition, each ARN maintains its own resource blocks (RBs). For users connected to the RSUs, if the remaining RBs of the current RSU can satisfy the predefined threshold value, the LRBs of the RSU are allocated to user services. On the contrary, if the remaining RBs of the current RSU cannot satisfy the threshold, extra RBs from the VRP are allocated to user services. Similarly, for users connected to ARNs, the satisfaction grade of each user service is …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:P7Ujq4OLJYoC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Energy efficiency in wireless sensor networks using sleep mode TDMA scheduling",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870508000462",
            "Abstract": "Power saving is a very critical issue in energy-constrained wireless sensor networks. Many schemes can be found in the literature, which have significant contributions in energy conservation. However, these schemes do not concentrate on reducing the end-to-end packet delay while at the same time retaining the energy-saving capability. Since a long delay can be harmful for either large or small wireless sensor networks, this paper proposes a TDMA-based scheduling scheme that balances energy-saving and end-to-end delay. This balance is achieved by an appropriate scheduling of the wakeup intervals, to allow data packets to be delayed by only one sleep interval for the end-to-end transmission from the sensors to the gateway. The proposed scheme achieves the reduction of the end-to-end delay caused by the sleep mode operation while at the same time it maximizes the energy savings.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A receiver-centric OFCDM approach with subcarrier grouping",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6177191/",
            "Abstract": "In this letter, following a cross-layer design concept, we propose a novel subcarrier grouping technique for Orthogonal Frequency and Code Division Multiplexing (OFCDM) multiuser systems. We adopt a two dimensional (2D) spreading, so as to achieve both frequency- and time-domain channel gain. Furthermore, we enable a receiver-centric approach, where the receiver rather than a potential sender controls the admission decision of the communication establishment. We study the robustness of the proposed scheme in terms of the Bit-Error-Rate (BER) and the outage probability. The derived results indicate that the proposed scheme outperforms the classical OFCDM approach.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Technologies Supporting Programmability of Future Military Networks: A Review and a Critical View",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=4126264831991364804&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IMS mobility management in integrated WiMAX-3G architectures",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600444/",
            "Abstract": "The IP Multimedia System (IMS) is a promising solution for converging new technologies with existing networks. The interworking environment and service flexibility that IMS offers to the currently deployed wireless broadband technologies, makes it appealing to users, service developers and network operators. In our previous work a heterogeneous network model based on IMS that integrates the Worldwide Interoperability for Microwave Access (WiMAX), Universal Mobile Telecommunications System (UMTS) and Wireless Local Area Network (WLAN) technologies and provides guaranteed QoS was proposed. In this paper an analytical model is derived in order to evaluate the signalling cost of mobility management during a vertical handoff.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Assessing handoff control impact on QoS in wireless ATM networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1002109/",
            "Abstract": "Several factors tend to favor the use of ATM cell transport for personal communication networks (PCN). Delivering hard QoS guarantees in the wireless domain is rather difficult since assumptions made in providing QoS guarantees in wired ATM networks do not always hold in their wireless extension due to large-scale mobility requirements, limited radio channel resources and fluctuating network conditions. Renegotiation of resources allocated to the connection is often needed. At the same time, multimedia flow should be transported and presented seamlessly to the destination device with a smooth change of perceptual quality. These conditions impact our ability to deliver hard QoS guarantees in wireless ATM networks. A model for CAC and handoff control is proposed for mobility support and the provisioning of guaranteed QoS in a WATM network. The proposed architecture has very good performance and …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WPAN's Technologies for Pervasive e-Health Applications–State of the Art and Future Trends",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=5196749414587535631&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An assisted-living home architecture with integrated healthcare services for elderly people",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=jL9-Ij6zkMIC&oi=fnd&pg=PA93&dq=info:rIvLpJK-p5MJ:scholar.google.com&ots=NXGgD7ajDq&sig=2fieKRFStoKvvj8Z7YqnZH-Ih70",
            "Abstract": "Since the population of elderly people grows absolutely and in relation to the overall population in the world, the improvement of the quality of life of elderly people at home is of a great importance. This can be achieved through the development of generic technologies for managing their domestic ambient environment consisting of medical sensors, entertainment equipment, home automation systems and white goods, increasing their autonomy and safety. In this context, the provision intelligent interactive healthcare services will improve their daily life and allowing at the same time the continuous monitoring of their health and their effective treatment. This work is supported by the INHOME Project EU IST-045061-STP, http://www. ist-inhome. eu.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IOS Press; 1999"
        },
        {
            "Title": "Nikolaos Pantazis, and Dimitrios D",
            "Publication year": 2008,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A control-based algorithm for rate adaption in MPEG-DASH",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6878834/",
            "Abstract": "Although MPEG-Dynamic Adaptation Streaming over HTTP (MPEG-DASH) eliminates data packet loss, based on the rate adaptation strategy adopted by the user and the network conditions, still playback interruptions may not be avoided. In this paper an algorithm for rate adaption in MPEG-DASH is proposed that employs fuzzy logic to estimate the resolution of the next video segment that each client should obtain from the server. In this way, the buffering time at each client is kept above a target buffering time and thus buffer overflows and unnecessary bit rate fluctuations are avoided. Simulation results showed that the proposed rate adaptation strategy has a beneficial effect on the quality each user perceives.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:nrtMV_XWKgEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multifold node authentication in mobile ad hoc networks",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.882",
            "Abstract": "An ad hoc network is a collection of nodes that do not need to rely on a predefined infrastructure to keep the network connected. Nodes communicate amongst each other using wireless radios and operate by following a peer‐to‐peer network model. In this article, we propose a multifold node authentication approach for protecting mobile ad hoc networks. The security requirements for protecting data link and network layers are identified and the design criteria for creating secure ad hoc networks using multiple authentication protocols are analysed. Such protocols, which are based on zero‐knowledge and challenge‐response techniques, are presented through proofs and simulation results. Copyright © 2007 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:bEWYMUwI8FkC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Deployment of high service grade DECT micro/pico cell clusters within GSM cellular systems",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/903944/",
            "Abstract": "During the last few years, the mobile wireless industry has been spending considerable effort to enhance the technical characteristics of existing second generation systems in the goal of upgrading their service provision capabilities and of promoting effective integration with data transport networks (the GSM GPRS is an obvious paradigm). This line of action can be anticipated as a first step in the migration path towards 3G systems and has been adopted for two basic reasons: the first is that market demand for wireless data services is currently a small portion of the overall wireless service demand and the second is that the deployment of new technologies in large scale requires gross economical investments. This paper proposes a protocol architecture, a physical configuration and a set of functions for DECT cell clusters that provide access to ISDN transport networks. It also proposes a scheme for the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance of maximum‐ratio combining‐enabled heterodyne detection for free‐space optical systems under mixture‐Gamma fading channels and pointing errors",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/pdf/10.1049/el.2017.1006",
            "Abstract": "The performance of maximum‐ratio combining for free‐space optical systems using heterodyne detection is analytically studied. The analysis includes the joint effect of turbulence‐ and misalignment‐induced channel fading. Particularly, novel closed‐form expressions regarding the scintillation index, outage probability and average bit‐error rate are derived. Based on these results, some useful outcomes are manifested, such as the system diversity order, the crucial role of diversity branches, and the impact of composite channel fading onto the system performance.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:q3CdL3IzO_QC",
            "Publisher": "The Institution of Engineering and Technology"
        },
        {
            "Title": "Trust management framework for intelligent agent negotiations in ubiquitous computing environments",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-009-9155-z",
            "Abstract": "In dynamic ubiquitous computing environments, system entities may be classified into two main categories that are, in principle, in conflict. These are the Service Resource Requestors (SRRs) wishing to use services and/or exploit resources offered by the other system entities and the Service Resource Providers (SRPs) that offer the services/resources requested. Seeking for the maximisation of their welfare, while achieving their own goals and aims, entities may misbehave (intentionally or unintentionally), thus, leading to a significant deterioration of system’s performance. In this study, a reputation mechanism is proposed which helps estimating SRPs trustworthiness and predicting their future behaviour, taking into account their past performance in consistently satisfying SRRs’ expectations. Thereafter, under the assumption that a number of SRPs may handle the SRRs requests, the SRRs may decide on …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A computer vision approach for textile quality control",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/vis.245",
            "Abstract": "Textile manufacturers have to monitor the quality of their products in order to maintain the high‐quality standards established for the clothing industry. Thus, textile quality control is a key factor for the increase of competitiveness of their companies. Textile faults have traditionally been detected by human visual inspection. However, human inspection is time consuming and does not achieve a high level of accuracy. Therefore, industrial vision units are of strategic interest for the textile industry as they could form the basis of a system achieving a high degree of accuracy on textile inspection. This work describes the software core of a system designed for fabric inspection on the basis of simple image‐processing operations as well as its efficiency on detection of usual textile defects. The prerequisites of the overall system are then discussed analytically, as well as the limitations and the restrictions imposed due to the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Analysis and Design of Services in Building Units in the context of a Smart City",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9284377/",
            "Abstract": "The economic development planning and implementation of the modern societies shall be carried out simultaneously by both environmental protection and a natural resources exploitation in a sustainable way. Building units could achieve these goals directly through an energy design and their corresponding energy efficiency. Initially, a building is being simulated through a computational model, based on parameters of the methodology established by the Energy Efficiency Regulation of Buildings (E.E.R.B.). Afterwards, the results are being thoroughly checked and evaluated in the frame of its energy efficiency, as well as its financial data. The conclusions can be deduced through the exploitation of Internet of Things - IoT technology by evolving the building and thus, expanding the city into a smart city.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:r_AWSJRzSzQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Knowledge-based Service Creation and Execution Framework for Adapting Composite Wireless IP Services",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-74161-1_29",
            "Abstract": "Wireless services infrastructures beyond 3G are evolving into highly complex and heterogeneous network environments embracing a multitude of different wireless internet access technologies, terminal types and capabilities, different bearer services, core/access network configurations, along with a wide range of application-related functions. Further to this reality, service operators are confronted with increasingly demanding users, becoming more and more aware of their needs. Thus, the main objective of this research work is to pave the way to novel service creation and execution systems beyond 3G, allowing the mobile user to build her/his own highly personalised composite wireless services.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Energy efficient automated control of irrigation in agriculture by using wireless sensor networks",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168169915000460",
            "Abstract": "Many agricultural activities can be highly enhanced by using digital technologies. One of these activities is the regulation of the quantity of water in cultivated fields, a process which is directly interwoven with the sustainability and the productivity of crops, since insufficient or excessive irrigation may not only be obstructive, but also destructive. This paper proposes a scheme based on the collaboration of an integrated system for automated irrigation management with an advanced novel routing protocol for Wireless Sensor Networks (WSNs), named ECHERP (Equalized Cluster Head Election Routing Protocol). At its core, the proposed system aims at efficiently managing water supply in cultivated fields in an automated way. The system takes into consideration the historical data and the change on the climate values to calculate the quantity of water that is needed for irrigation. In case that the change on the collected …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Towards Utilizing Tcpcrypt in Mobile Healthcare Applications",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29734-2_51",
            "Abstract": "The evolution and growth of networks has made the personal data of the users available to many applications. In this direction, one of the main concerns is to protect the sensitive personal information, while at the same time avoid delays in the provision of services like healthcare to the general public. An extension of TCP, the Tcpcrypt, is a promising technology that can be used on this field. Tcpcrypt is designed to provide end-to-end encryption in the transport layer with low overhead, rendering it a very promising solution in order to protect medical data that are often handled by devices with limited resources. In this paper Tcpcrypt performance is evaluated against TCP, in terms of additional overhead incurred in the total size of the transmitted data and the total number of CPU instructions that are executed. Moreover, a solution for reducing overhead through fine-grained packet handling is proposed.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Image registration of follow-up examinations in digital dermoscopy",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701627/",
            "Abstract": "Automated assessment tools for dermoscopy images play an important assistive role mainly due to inter- and intra-observer variations in human interpretation. Prior to classification, a robust registration module is necessary. In this paper we propose a fully automatic method for successful registration (matching) of melanocytic nevi images acquired from digital dermoscope to ensure reliable quantitative comparison of the image later. A modified SIFT algorithm (called ROI-SIFT), followed by RANSAC to identify outliers, is used to localize and match correspondence interest points, that will be used to compute affine transformations for the registration of a dermatological image with the respective follow-up examination image. Experimental evaluations of the registration method are reported for image pairs acquired during follow-up examinations. Finally, a short discussion of scheduled future work is proposed.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:Fu2w8maKXqMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Digitization of the Tangible Cultural Heritage and the Related Policy Framework",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-12957-6_17",
            "Abstract": "Nowadays, the digital revolution has changed the conventional way of acquiring images and reproduction of the existing or the imaginary world, leading to new forms and dimensions of the “reality”. The perception of the user is expanded through 360° technology, Augmented Reality (AR), Mixed Reality (MR), Virtual Reality (VR) platforms that originally sprang through the gaming industry and have influenced, among other things, the field of culture, both in terms of its production and its management and enhancement. Our research work aims to present the issues of the related policy framework that arise from the use of the new digital technologies which in our days drastically change the way of management of the Greek tangible cultural heritage. The paper will concentrate at the interaction between archaeological law, copyright law and the use of digital media of creation, promotion and diffusion of tangible …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:IRz6iEL74y4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Performance of Uplink NOMA with User Mobility Under Short Packet Transmission",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-021-08992-1",
            "Abstract": "The scenario of an uplink two-user non-orthogonal multiple access (NOMA) communication system is analytically studied when it operates in the short packet transmission regime. The considered users support mobility and each is equipped with a single antenna, while they directly communicate with a multi-antenna base station. Power-domain NOMA is adopted for the signal transmission as well as the successive interference cancellation approach is performed at the receiver for decoding. The packet error rate (PER) is obtained in simple closed formulae under independent Rayleigh faded channels and for arbitrary user mobility profiles. The practical time variation and correlation of the channels is also considered. Moreover, useful engineering insights are manifested in short transmission time intervals, which define a suitable setup for the forthcoming ultra-reliable and low latency communication systems. Finally …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:nZcligLrVowC",
            "Publisher": "Springer US"
        },
        {
            "Title": "An integrated platform for providing ship management, tourist information and booking services",
            "Publication year": 2004,
            "Publication url": "http://195.130.87.21:8080/dspace/handle/123456789/609",
            "Abstract": "The growth of e-commerce brings to foreground innovative e-based services, which heavily affect the behaviour of sea travellers. The interested parties of the maritime market (ie, shipping companies, travel agencies, port authorities, etc.) have to take account of the new scheme and take appropriate actions in order to strengthen their presence in e market. In this context, the paper discusses an integrated telecommunication platform for providing ship management, tourist information and booking services for sea travellers. The presented platform has been developed in the framework of the EU funded project TELESHIPPING and validated during actual pilot tests.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:WqliGbK-hY8C",
            "Publisher": "ENTER 2004: 11th International Conference on Information Technology in Travel & Tourism"
        },
        {
            "Title": "Vehicular Communications",
            "Publication year": 2019,
            "Publication url": "https://www.researchgate.net/profile/Emmanouil-Skondras/publication/330764261_Mobility_Management_on_5G_Vehicular_Cloud_Computing_Systems/links/5e2e81e9a6fdccf38377c25e/Mobility-Management-on-5G-Vehicular-Cloud-Computing-Systems.pdf",
            "Abstract": "Accepted 13 January 2019 Available online xxxx",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:mNrWkgRL2YcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Handoff prioritization and decision schemes in wireless cellular networks: a survey",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5343063/",
            "Abstract": "Handoff is a key element in wireless cellular networks in order to provide quality of service (QoS) to the users and to support users' mobility. Handoff failure will result in the forced termination of an ongoing call. From the user's point of view, the service of a handoff request is more important, as the forced termination of an ongoing call is more annoying than the blocking of new calls. Therefore, in order to support QoS to the users and to provide ubiquitous coverage, the handoff procedure ought to be further investigated. This paper provides a comprehensive survey of the basic elements, the different types and phases of the handoff procedure. Moreover, particular interest has been given in the horizontal handoff execution phase by discussing and classifying the most recent handoff prioritization schemes into categories based on the concepts that these schemes adopt, e.g. channel reservation, handoff queueing …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An asymmetric key establishment protocol for multiphase self-organized sensor networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5758224/",
            "Abstract": "We propose an asymmetric key establishment protocol for decentralized sensor networks (DSN's). The protocol supports multiphase deployment i.e., the sensor nodes are deployed in the network in multiple groups, known as \"generations\". After their deployment, the nodes of the first generation are engaged in a key establishment protocol, in order to establish secure communication channels with their neighbors. Then, each forthcoming generation initializes a new key establishment phase, which allows the new nodes to communicate with other nodes of their own generation as well as with the older nodes of the network. The protocol extends the hybrid scheme of Kotzanikolaou et al. By making the scheme of \"P. Kotzanikolaou et al, Hybrid key establishment for multiphase self-organized sensor networks\" fully asymmetric, the proposed protocol corrects a security weakness found in \"P. Kotzanikolaou et al, Hybrid …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:eflP2zaiRacC",
            "Publisher": "VDE"
        },
        {
            "Title": "Enhanced End-to-End TDMA for wireless ad-hoc networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4381649/",
            "Abstract": "TDMA has increasingly been used as the MAC layer for ad-hoc networks. However, the use of TDMA in multi-hop networks leads to the problem of distributing the available slots among the wireless nodes in an effective manner. The exact way the slots are distributed among the transmitting nodes has an impact on various performance parameters of the network, such as the end-to-end delay and the capacity. In general, an increase of the end-to-end delay may lead to an increased network capacity. In this paper, we study two new end-to-end TDMA scheduling algorithms, and compare them in terms of end-to-end delay and network capacity.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile IP in wireless ATM networks",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/932054/",
            "Abstract": "Wireless communications have undergone a tremendous growth in recent years. With systems for mobile analog and digital cellular telephony, radio paging, and microwave/satellite broadcasting becoming widespread, next generation wireless communications systems such as wireless ATM (WATM) will be required to support the seamless delivery of voice, video and data with high quality. In this context, applying mobile IP in wireless ATM networks is intended to be a direct extension of the existing fixed/wireline broadband networks with uniform end-to-end QoS guarantees.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A secure ubiquitous healthcare system based on IMS and the HL7 standards",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1839294.1839345",
            "Abstract": "Body sensors are small devices close or attached to the human body that gather information regarding vital signs (eg body temperature, blood pressure, heartbeat rate etc.) or other physiological data. The Health Level Seven (HL7) has published the Clinical Document Architecture (CDA) which is a document markup standard that specifies the structure and semantics of a clinical document. CDA documents are encoded in Extensible Markup Language (XML) and are used for exchanging documents in heterogeneous environments. In this paper we are introducing an architecture to enable the collection of medical data in real time from body sensors, with the use of a hand held device (eg PDA) and their secure transmition to a central party, essentially a hospital, from where medical personnel will be able to access it, and assess the patients health status. When it comes to exchanging critical medical information the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wireless Local Area Networking: QoS Provision and Resource Management Call for Papers",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1304250/",
            "Abstract": "Prospective authors are requested to submit new, unpublished manuscripts for inclusion in the upcoming event described in this call for papers.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An intelligent interactive healthcare services environment for assisted living at home",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5446172/",
            "Abstract": "Since the population of elderly people grows absolutely and in relation to the overall population in the world, the improvement of the quality of life of elderly people at home is of a great importance. This can be achieved through the development of generic technologies for managing their domestic ambient environment consisting of white goods, entertainment equipment and home automation systems in order to increase their autonomy and safety. In this context, the provision intelligent interactive healthcare services will improve their daily life and allowing at the same time the continuous monitoring of their health and their effective treatment.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Building Robust Military Networks Using Advanced Software Tools",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/George-Kormentzas/publication/229039659_Building_Robust_Military_Networks_Using_Advanced_Software_Tools/links/0c9605173d8d5e3f2f000000/Building-Robust-Military-Networks-Using-Advanced-Software-Tools.pdf",
            "Abstract": "The paper discusses a design framework for building robust military networks. The proposed framework includes advanced software tools and methods for defining optimal alternative routing paths, for examining network’s viability in cases of crisis and for performing network simulation. The application of the presented framework towards the design of a military network for the purposes of a national project concludes the paper.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A fuzzy controller for rate adaptation in MPEG-DASH clients",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7136501/",
            "Abstract": "The MPEG-Dynamic Adaptation Streaming over HTTP (MPEG-DASH) tries to improve the quality perceived by the user by allowing the user's centric access to different resolutions of the video content via the Hypertext Transfer Protocol (HTTP). However, although it eliminates data packet loss, depending on the rate adaptation strategy adopted by the user, as well as, the network conditions, there may be playback interruptions. In this paper a novel MPEG-DASH adaptation scheme, the FDASH, is proposed, which, by employing fuzzy logic to control the buffering time and the resolution achieves the following: a) distributes the best possible resolution of video segments, b) delivers undisrupted video playback as a result of buffer underflows at the client, c) avoids unnecessary changes of video resolution owing to frequent fluctuations of the available connection throughput. Simulation results showed that the FDASH in …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:ILKRHgRFtOwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity optimization in TDMA ad-hoc networks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-010-0089-2",
            "Abstract": "Many scheduling techniques have been developed to solve the problem of sharing the common channel to multiple stations. TDMA has been increasingly used as a scheduling technique in ad-hoc networks. The current trend for QoS capable applications led to the deployment of numerous routing schemes that use TDMA. These schemes try to solve the problem of distributing the available slots among the wireless nodes and at the same time, to find paths within the network that fulfill some QoS related limitations, such as end-to-end delay. The exact way the slots are distributed among the transmitting nodes has an impact on the end-to-end delay and other performance parameters of the network, such as capacity. Therefore, the efficiency of the scheduling algorithms is closely related to the network topologies. In this paper, we propose two new end-to-end TDMA scheduling algorithms that try to enhance …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:_xSYboBqXhAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A modelling and simulation framework for compound medical applications in regional healthcare networks",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJEH.2005.006689",
            "Abstract": "Regional healthcare information networks have already started to grow across Europe, in order to cover local healthcare provision needs, especially in isolated regions, where there is often no availability of central general hospitals. The paper discusses a modelling and simulation framework for the design of regional healthcare information networks running compound medical and QoS–sensitive applications. The proposed framework decomposes the compound medical applications into combinations of elementary traffic profiles, assesses appropriate values to the traffic parameters of the assigned models and defines suitable simulation scenarios. The simulation results are analysed and finally lead to reliable bandwidth estimations of the links of the healthcare information network under design. The proposed framework has been thoroughly validated through its application for the design of a healthcare network …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Fraud threats disclosure through cloud information security framework",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8316457/",
            "Abstract": "The Cloud Computing (CC) paradigm introduces a highly efficient environment based on the aggregation of novel technologies. The cloud-based services are characterized by enhanced behavior and unique features due to the capabilities facilitated by the particularities of the CC environment such as the scalability. However, because of these particularities, new threats and vectors of attacks emerge. This surface of cloud attacks, is distributed and covered in nature, which can be utilized to stage fraudulent activities. The cyber-incidents that entail fraudulent activities lead to negative effects such as the nefarious usage of CC resources and the abuse of the cloud-based services. To this end, the information security challenges, which are associated to fraud, lead to restrictions and barriers concerning the operational as well as the financial activities performed by the Cloud Service Provider (CSP). To counterbalance …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:edDO8Oi4QzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy efficiency and power control",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=qOPk-NWkgiMC&oi=fnd&pg=PA307&dq=info:0RZzDvbYtysJ:scholar.google.com&ots=QbDsM6Eoja&sig=sphcuEA67msdEFbJnQ8Uyd691Zk",
            "Abstract": "Wireless sensor networks (WSNs) have received tremendous attention in recent years because of the development of sensor devices, as well as wireless communication technologies. WSNs make it easier to monitor and control physical environments from remote locations and present many significant advantages over wired sensor networks for a variety of civilian and military applications [1, 2]. A WSN is usually randomly deployed in inaccessible terrains, disaster areas, or polluted environments, where battery replacement or recharge is difficult or even impossible to be performed. For this reason, network lifetime is of crucial importance to a WSN. To prolong network lifetime, there is a need for efficient power control mechanisms to reduce power consumption in sensor nodes and energy--efficient techniques should be employed at all layers of the network [3–5], which should take into account the following unique characteristics and application requirements of WSNs [1]:",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:ldfaerwXgEUC",
            "Publisher": "Wiley"
        },
        {
            "Title": "Survey on power control issues in wireless sensor networks",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey of TDMA scheduling schemes in wireless multihop networks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2677955",
            "Abstract": "One of the major problems in wireless multihop networks is the scheduling of transmissions in a fair and efficient manner. Time Division Multiple Access (TDMA) seems to be one of the dominant solutions to achieve this goal since it is a simple scheme and can prolong the devices’ lifetime by allowing them to transmit only a portion of the time during conversation. For that reason, several TDMA scheduling algorithms may be found in the literature. The scope of this article is to classify the existing TDMA scheduling algorithms based on several factors, such as the entity that is scheduled, the network topology information that is needed to produce or maintain the schedule, and the entity or entities that perform the computation that produces and maintains the schedules, and to discuss the advantages and disadvantages of each category.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "ACM"
        },
        {
            "Title": "Detecting unauthorized and compromised nodes in mobile ad hoc networks",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870505001113",
            "Abstract": "Security of mobile ad hoc networks (MANET) has become a more sophisticated problem than security in other networks, due to the open nature and the lack of infrastructure of such networks. In this paper, the security challenges in intrusion detection and authentication are identified and the different types of attacks are discussed. We propose a two-phase detection procedure of nodes that are not authorized for specific services and nodes that have been compromised during their operation in MANET. The detection framework is enabled with the main operations of ad hoc networking, which are found at the link and network layers. The proposed framework is based on zero knowledge techniques, which are presented through proofs.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Management architecture in tactical communication networks",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/904921/",
            "Abstract": "The objective of this paper is not only to monitor, configure and control the immediate situation, but also to continually collect and assess information-so inter-and intra-service communications must be available throughout the chain of command. Vital decision-based on the current status and location of every available resource-must be centrally coordinated. Military communications should be quickly reconfigured with optimum survivability potential regardless of the particular configuration. Not only the initial speed of response, but also the rate at which fresh intelligence reports can be assimilated is crucial. To apply this intelligence in the most effective manner requires a unique mix of communications technology, systems integration and software know-how. Without fail-safe communications, today's command and control centers would be unable to monitor operations, assess developments, allocate resources …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectrum Allocation in Next Generation Radio Networks using Emerging Nature-inspired Algorithms",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8471797/",
            "Abstract": "The key task of a cognitive radio network (CRN) is the effective allocation of spectrum resources according to user needs and requirements. In order to maximize the utilization of the available spectrum, a dynamic allocation of available channels to secondary users is needed. This problem is known as the spectrum allocation problem and it is a combinatorial optimization problem. A possible optimization algorithm that can be applied is chaotic biogeography-based optimization (CBBO). In this paper, a thorough assessment of CBBO is performed in the sense of comparing CBBO with other popular algorithms. According to the simulation results, the CBBO algorithm outperforms competing algorithms in terms of average convergence rate and accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:OcBU2YAGkTUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Training a learning vector quantization network for biomedical classification",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/938761/",
            "Abstract": "A competitive learning vector quantization (LVQ) neural net (ANN) was trained to identify third stage parasitic strongyle larvae from domestic animals on the basis of quantitative data obtained from processed digital images of larvae. Various novel quantitative features obtained from processed digital images of larvae were tested whether they are variant or invariant to the shape taken by the motile larvae during image recording. A total of 255 images of 57 larvae of 5 genera were recorded. 16 novel features were measured of which 7 were selected as invariant to larva shape. By trial and error two of those features, area and perimeter, along with the quantitative features used in conventional identification, overall body length, width, and tail of sheath, were used as an effective training data set for the ANN. This ANN coupled with an image analysis facility and a knowledge relational database became the basis for …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobility management on 5g vehicular cloud computing systems",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2214209618302110",
            "Abstract": "Fifth generation (5G) Vehicular Cloud Computing (VCC) systems use heterogeneous network access technologies to fulfill the requirements of modern services. Multiple services with different Quality of Service (QoS) constraints could be available in each vehicle, while at the same time, user requirements and provider policies must be addressed. Therefore, the design of efficient Vertical Handover (VHO) management schemes for 5G-VCC infrastructures is needed. In this paper, a novel VHO management scheme for 5G-VCC systems is proposed. Whenever the user satisfaction grade becomes less than a predefined threshold, VHO is initiated and network selection is performed, considering the velocity of the vehicle, network characteristic criteria such as throughput, delay, jitter and packet loss, as well as provider policy criteria such as service reliability, security and price. The proposed scheme uses linguistic …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Power conservation through energy efficient routing in wireless sensor networks",
            "Publication year": 2009,
            "Publication url": "https://www.mdpi.com/1424-8220/9/9/7320",
            "Abstract": "The power awareness issue is the primary concern within the domain of Wireless Sensor Networks (WSNs). Most power dissipation ocurrs during communication, thus routing protocols in WSNs mainly aim at power conservation. Moreover, a routing protocol should be scalable, so that its effectiveness does not degrade as the network size increases. In response to these issues, this work describes the development of an efficient routing protocol, named SHPER (Scaling Hierarchical Power Efficient Routing). View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Molecular Diversity Preservation International"
        },
        {
            "Title": "Successive Interference Cancellation for Multi-user MIMO-OFDM Ad-Hoc Networks: A Performance-Complexity Tradeoff",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35755-8_37",
            "Abstract": "In this paper, we consider a multi-user ad-hoc framework which is established on a Multiple Input-Multiple Output Orthogonal Frequency Division Multiplexing (MIMO-OFDM) infrastructure. The reception is accomplished by utilizing the Successive Interference Cancellation (SIC) approach. Particularly, we emphasize on the performance-complexity tradeoff of SIC by implementing two well-known equalizers, namely Zero-Forcing (ZF) and Minimum Mean Squared Error (MMSE). Our main objective is the provision of the system robustness in terms of the error resilience and the computational complexity efficiency. Thereby, a novel hybrid-SIC is proposed, which jointly performs either ZF-SIC or MMSE-SIC according to the instantaneous channel statistics, on an OFDM subcarrier basis. Furthermore, a complexity analysis is provided whereas upper and lower complexity bounds for the proposed scheme are also …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Classification of Medical Big-Data collected using IoT Devices",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9555504/",
            "Abstract": "Modern medical systems manipulate a large number of clinical data collected using Internet of Things (IoT) devices. In this environment 5G network architectures provide low latency communication in order to support the strict constraints of real time medical services. Furthermore, the collected data need to be classified so their retrieval and manipulation to be immediate. This paper focuses on collecting big data from three types of sensors, namely body sensors, indoor and outdoor sensors. The collected data are stored in a Cloud infrastructure. A classification algorithm is proposed. For each type of sensor the algorithm classifies the received data into classes, to efficiently organize them into cluster of Virtual Machines (VMs). Specifically, taking into consideration the alternative solutions available in the literature, the proposed algorithm manipulates heterogeneous, large quantities of data and stores them in the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:8xutWZnSdmoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power control schemes in tactical wireless sensor networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5758220/",
            "Abstract": "In today's environment, the military network is the backbone of the operation. Recent advances in sensor fabrication technology, lowpower digital and analogue electronics, and lowpower wireless communication systems have made it possible to develop low-cost, robust and survivable tactical wireless sensor networks. A military sensor network is the link that connects mobile tactical nodes to a large amount of critical information located in the Tactical Operation Center or the Sensor Management Co-Ordination Center (SMCOC), every day, anytime. In today's sophisticated and competitive military wireless environment, the control of the energy consumption in a tactical wireless sensor network is very crucial for connectivity, QoS and survivability of tactical communication. In this paper we study the power control mechanisms in wireless ad-hoc sensor networks, the factors that influence the power control algorithm's …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:hC7cP41nSMkC",
            "Publisher": "VDE"
        },
        {
            "Title": "A delivery model for cultural heritage services in smart cities environments",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-01765-1_31",
            "Abstract": "The cultural heritage of a city, both tangible and intangible, constitutes a resource of inestimable value that in the uprising digital era needs as well sustainable use and management. The transformation of heritage sites and cultural intangible fields into Smart Cultural Heritage environments implies to the development of Smart Cities. This paper introduces a new delivery model for providing cloud based cultural services to users, through advanced network infrastructures in Smart Cities environments. The proposed model is called Smart Cultural Heritage as a Service (SCHaaS) and aims to promote and preserve the cultural heritage through smart applications and participatory processes. This model also aims to be customized according the special cultural characteristics of a city and the needs of its citizens.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A two‐step authentication framework for mobile ad hoc networks",
            "Publication year": 2007,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/2512/",
            "Abstract": "The lack of fixed infrastructure in ad hoc networks causes nodes to rely more heavily on peer nodes for communication. Nevertheless, establishing trust in such a distributed environment is very difficult, since it is not straightforward for a node to determine if its peer nodes can be trusted. An additional concern in such an environment is with whether a peer node is merely relaying a message or if it is the originator of the message. In this paper, we propose an authentication approach for protecting nodes in mobile ad hoc networks. The security requirements for protecting data link and network layers are identified and the design criteria for creating secure ad hoc networks using several authentication protocols are analyzed. Protocols based on zero knowledge and challenge response techniques are presented and their performance is evaluated through analysis and simulation.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Low-energy consumption schemes in wireless sensor networks",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/45224099/Low-energy_consumption_schemes_in_wirele20160430-23099-1dzu1vy.pdf",
            "Abstract": "Sensor networks are dense wireless networks consisting of a large number of small-sized, low-cost sensor nodes that are densely deployed either inside the phenomenon or very close to it. Sensor nodes’ function is to collect, process, and disseminate critical data while their position need not be engineered or predetermined. This means that sensor network protocols and algorithms must possess self-organizing capabilities. Wireless sensor networks are employed in a vast variety of fields–environment, health, home, civil, military. Sensor nodes have various energy and computational constraints because of their inexpensive nature and ad hoc method of deployment. Considerable research has been focused at overcoming these deficiencies through more low-energy consumption schemes. Three basic schemes have been chosen to be studied in this paper. The motivation of the first scheme is twofold, limiting multi-user interference to increase single-hop throughput and reducing power consumption to prolong battery life. The second scheme focuses on energy-aware routing. The third scheme contributes to dynamically increase the lifetime of the sensor network. The survey attempts to provide an overview of these issues as well as the solutions proposed in recent literature.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy aware routing in IEEE 802.11 s wireless mesh networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7222913/",
            "Abstract": "Wireless Mesh Networking is a continuous growing technology that can be used used for several application scenarios, such as military tactical operations, etc. in next generation wireless networks. The IEEE 802.11s Standard defines the procedures that wireless nodes follow in order to interconnect and create a Wireless Local Area Network (WLAN) mesh network. It, also, defines the routing protocol and the metric that are used by a IEEE 802.11s mesh network to route data. However, although the energy consumption of mesh nodes is a crucial parameter for the network's lifetime in specific purpose operations (e.g. military and health) the default metric proposed by the standard doesn't take into account the energy of the nodes. In this paper, a new energy - aware routing metric for the IEEE 802.11s mesh networks has been implemented. Simulation results showed that the proposed metric prolongs the lifetime of a …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:g3aElNc5_aQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A probabilistic neural network for human face identification based on fuzzy logic chromatic rules",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=5996138227009617437&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Neural Network System for Defect Detection in Fabric Surface",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=12374936787227243068&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:pyW8ca7W8N0C",
            "Publisher": "UNKNOWN"
        },
        {
            "Title": "Jitter analysis of the IEEE 802.11 DCF access mode",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1543527/",
            "Abstract": "Quality of service in WLANs has been a major concern of both academia and industry for many years. A number of methods have been published regarding delay analysis of 802.11 networks, but little research has been carried out for the jitter analysis, even though jitter can be more important than delay for real time applications, like voice over IP, multimedia streaming, etc. In this paper we introduce a new analytical method for estimating the jitter caused by the distributed coordination function of the 802.11 MAC protocol. This model is also evaluated by a series of simulations.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Provision of Unified IN Functionality in the Context of IMS",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-008-9107-z",
            "Abstract": "The IP Multimedia Subsystem (IMS) represents an attempt for networks convergence, allowing users of rich-content applications to communicate through any access network type. In the near future, IMS is expected to give operators and content providers the flexibility to exploit a multitude of new communication applications in a harmonized communication environment of heterogeneous IP networks. However, despite its merits, the standardization process of IMS networks is lagging behind, leaving harmonization issues of services provisioning, open. In this effort, main hindering factor is the existence of similar implementations customized per network technology. Particularly in what concerns the Intelligent Network (IN) services, these are provided in mobile networks by CAMEL (Customised Applications for Mobile networks Enhanced Logic) and in fixed networks by INAP (IN Application Part). With regard to …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Structure diversity as supplementary survivability method in sonet",
            "Publication year": 2002,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16580685",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D04 Telecommunications and information theory/001D04B Telecommunications/001D04B02 Systems, networks and services of telecommunications/001D04B02G Transmission and modulation (techniques and equipments)",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhanced fast handovers for PMIPv6 in vehicular environments",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6878826/",
            "Abstract": "In modern wireless networking technologies, the need to support the nodes mobility is growing rapidly. This need is even greater in vehicular environments, in which the nodes are characterized by high mobility. In this paper, we study the basic protocols for mobility support in vehicular environments, such as Fast Handovers for Proxy Mobile IPv6 (PMIPv6) and Transient Binding for PMIPv6, and analyze the handover delay and their performance. Moreover, we present vehicular environment scenarios in which the current protocols fail to provide seamless handovers for the mobile nodes, due to long delays and large percentages of packet loss. Additionally, we propose an enhanced handover scheme for Vehicular Ad Hoc Networks (VANETs), in which data follow the optimal path to the destination and is characterized by a smooth transition of the mobile node to the target access network. Finally, by evaluating the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:9Nmd_mFXekcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimating evolution of freshness in Internet cache directories under the capture–recapture methodology",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128609002977",
            "Abstract": "In this paper, we describe a new web sampling scheme for measuring the evolution of freshness in search engines. The methodology used is the capture–recapture, which is mainly applied for estimating evolution rates in wildlife biological studies. After modifications and amendments, necessary for web paradigm application, we conducted three capture–recapture experiments of different duration over the caches of Google and MSN. In parallel, we used a typical sampling scheme, similar to many other web sampling approaches used in the literature, to evaluate the robustness of our proposal. The paper provides the implementation details of a web-based capture–recapture model along with its assessment. The results show that through the capture–recapture methodology we are able not only to measure the freshness of the tested search services but also to monitor its evolution over time, with a substantially …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "QoS-aware TDMA for end-to-end traffic scheduling in ad hoc networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4015712/",
            "Abstract": "The proliferation of low-cost broadband air interfaces has paved the way to the introduction of high-definition multimedia services in mobile and wireless networks. The cost for network resources utilization, when provisioning such services, will play a prominent role in their commercial success, since the more spare resources that can be used, the more cheaply the services can be delivered to the end users. In the context of promoting the role of ad hoc networks as service platforms for high quality multimedia applications, this article first discusses and classifies a set of issues involved in quality of service (QoS) provisioning in ad hoc networks and then presents a congestion-free TDMA algorithm for end-to-end network resources assignment via an optimized mechanism that relies on capacity requests and grants. The article also illustrates a method for invoking this algorithm to achieve efficient end-to-end QoS …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Classification of typology of byzantine churches through pattern recognition",
            "Publication year": 2017,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:4hFrxpcac9AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "NGN networks: A new enabling technology or just a network integration solution?",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.4108/ICST.MOBIMEDIA2009.7625",
            "Abstract": "The Next Generation Networks (NGN) technology has been launched by the International Telecommunication Union (ITU) and the European Telecommunications Standards Institute (ETSI) as a method for establishing convergence of IP communications. This paper analyses the dynamics of Next Generation Networks (NGN) technology in implementing network convergence. The focus is given on the IP Multimedia Sub-system (IMS), the first NGN implementation. Description pivots around analysis of IMS internals, aiming at providing evidence that IMS is not just an integration solution but has potential to play the role of an overlay network architecture for future applications, as enabling technology.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simulation and modeling bandwidth control in wireless healthcare information systems",
            "Publication year": 2007,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0037549707083114",
            "Abstract": "Next generation wireless networks have been designed to provide support for                 multimedia services, with different traffic characteristics and different Quality of                 Service (QoS) guarantees. Medical broadband applications have attracted increased                 attention in recent years and furthermore, the tremendous growth of wireless                 technologies has introduced the potential of continuous healthcare monitoring for                 mobile patients. The bandwidth requirements and the emergency nature of medical                 applications introduce the need for QoS provisioning in wireless broadband medical                 networks. Wireless networks may support a number of e-health applications with                 different traffic requirements and characteristics, providing at the same time QoS                 guarantees. Resource allocation in e-health application is inherently different in                 many aspects …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:Zph67rFs4hoC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "FDASH: A fuzzy-based MPEG/DASH adaptation algorithm",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7368091/",
            "Abstract": "The evolution of broadband connection technologies, along with the explosive growth of mobile handheld devices, has made video content one of the major Internet traffic types. HTTP adaptive streaming (HAS) is one factor assisting the growing popularity of Internet video. One of its standards, the MPEG dynamic adaptive streaming over HTTP (DASH), allows users to access video streams of multiple resolutions available at a central repository. Various adaptation algorithms using the MPEG DASH protocol have been proposed, aiming to adapt the media bit rate delivered at the client to the current network conditions. In this paper, we present the FDASH rate adaptation scheme that employs fuzzy logic to control the buffering time and the video resolution delivered to the client in order to distribute video segments of the best quality, deliver undisrupted video playback, and avoid frequent changes of video resolution …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A New Two-Stage Multiuser MIMO Detection Approach with Different Priorities",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8403516/",
            "Abstract": "A new detection scheme for multiuser multiple-input multiple-output (MIMO) systems is analytically presented. In particular, the transmitting users are being categorized in two distinct priority service groups, while they communicate directly with a multi-antenna receiver. The linear zero-forcing scheme is applied in two consecutive detection stages upon the signal reception. In the first stage, the signals of one service group are detected, followed by the second stage including the corresponding detection of the remaining signals. An appropriate switching scheme based on specific transmission quality requirements is utilized prior to the detection so as to allocate the signals of a given service group to the suitable detection stage. The objective is the enhancement of the reception quality for both service groups. The proposed approach can be implemented directly in cognitive radio communication assigning the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:anf4URPfarAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "QoE-Based Scheduling in WiMAX Networks.",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/Papers/2012/41621/41621.pdf",
            "Abstract": "Worldwide Interoperability for Microwave Access (WiMAX) networks provide wireless broadband internet access, interoperability, while decrease the entrance barrier in mobile communications sector, and offer services comparable to those of the emerging 4G technology. Τhe standard 802.16, upon which WiMAX networks are based, has not designated any particular scheduling algorithm, allowing each provider to develop its own. However, existing scheduling algorithms take into account the Quality of Service (QoS), fairness and other parameters, but do not provide Quality of Experience (QoE). For this reason, in this paper two different approaches are proposed in order to provide QoE, especially for the rtPS WiMAX service. Simulation results show that by applying different policies the QoE provided to the WiMAX users is improved.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:dBIO0h50nwkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IEEE 802.11 s wireless mesh networks: Challenges and Perspectives",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03819-8_25",
            "Abstract": "A promising solution for wireless environments is the wireless mesh technology that envisages supplementing wired infrastructure with a wireless backbone for providing Internet connectivity to mobile nodes (MNs) or users in residential areas and offices. The IEEE 802.11 TGs has started to work in developing a mesh standard for local area wireless networks. Although a lot of progress has been made and a few new drafts have been released recently, there exist many issues that demand enhanced or even new solutions to 802.11s mesh networking. This paper aims to overview the latest version of the IEEE 802.11s protocol (Draft 2.02), especially the MAC and routing layers, and to point out the challenges that these networks have to overcome in these layers.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multiobjective Optimization Algorithms for Wireless Sensor Networks",
            "Publication year": 2020,
            "Publication url": "https://www.hindawi.com/journals/wcmc/2020/4652801/",
            "Abstract": "A Wireless Sensor Network (WSN), distributed within an area of interest, is a network that contains many wirelessly interconnected devices, with sensing, communication, and processing abilities called sensor nodes. A WSN also comprises of at least one sink node, called base station, which has enhanced energy, computational, and communication resources [1]. Based on the combined use of its constituting elements, a WSN is capable of monitoring the conditions existing at extensive regions of interest [2, 3]. For this reason, the domain of WSNs is considered the basis for Internet of Things (IoT) and Internet of Everything (IoE) and supports a continuously growing range of human activities [4–11]. On the other hand, the development of WSNs is obstructed due to both the restricted resources of sensor nodes in energy supply, memory and processing, and the inherent limitations of wireless communications, in terms of power, speed, and capacity of communication channels as well as resistance to interferences and intrusion detection and prevention to preserve data security. Particularly, the most important weakness of WSNs is the extremely restricted energy sufficiency of sensor nodes that reduces their operational time and thus shortens the overall network lifetime [12]. Consequently, the achievement of energy conservation is vital for WSNs to remain operational. This is why all possible causes of energy waste in sensor nodes must be eliminated. Given that, the procedure of wireless communication is by far the most energy consuming task of a sensor node, and numerous research works have been proposed in order to accomplish power …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:yMeIxYmEMEAC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Optimizing end-to-end TDMA scheduling in ad-hoc networks on random topologies",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.115.7219&rep=rep1&type=pdf",
            "Abstract": "Despite its dominance as a MAC layer for ad-hoc communications, the CSMA/CA algorithm produces several deficiencies, like complex QoS capabilities, increased overhead, and the exposed terminal problem. The TDMA MAC layer, that mostly overcomes these issues, needs efficient scheduling in order to be employed in ad-hoc networks. At the same time, the current trend for QoS capable applications led to the development of numerous QoS routing schemes, that try to find paths within the network, that fulfill some QoS related limitations. TDMA scheduling schemes can be combined with QoS routing strategies for enhancing performance. However, the efficiency of the scheduling algorithms is closely related to the network topologies. In this paper, we study the problem of routing aware TDMA scheduling for ad-hoc networks, and the effect of the network topologies on it.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey of pricing schemes in wireless networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5522469/",
            "Abstract": "The expansion of new technologies is expected to offer economic growth in the wired and wireless technological networking environment, while at the same time, it will offer a wide variety of services and give the possibility for utilizing technologies for the benefit of many subscribers. The Pricing Schemes are designed to offer profitable business to the Wireless Service Providers (WSPs), as well as, to create favorable services for the mobile subscribers and eventually to get charged according to their services usage. In this paper, the Pricing Schemes are classified, based on their ability to adapt to the needs of the WSPs and their subscribers during the entire service period, into Static-based Pricing and Dynamic-based Pricing Schemes. The Pricing Schemes are also analyzed in detail and are further classified according to the factors involved in the price calculation of a service, i.e. the Service Level Agreement (SLA …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "IP-based Convergence of Fixed and Cellular Networks and Services in the Light of Liberalization",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-40019-2_5",
            "Abstract": "The evolution of an “ open” communications universe is now expanding to deliver new communications services,characterised by advanced and ubiquitous,multimedia capabilities.The move by telecommunication companies’corporate customers into the IP world and the need for interoperability between private and public networks will drive service providers and telecom operators to adopt IP in their core networks as a means of unifying traffic types.The particular case addressed in this paper considers a complex yet realistic scenario:the convergence of Fixed/Mobile Communications Provider and Internet Service Provider through the transition to IP technology.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Smart cultural heritage in digital cities",
            "Publication year": 2019,
            "Publication url": "https://www.academia.edu/download/60489478/25-3220190904-62132-1uhuqs0.pdf",
            "Abstract": "The expansion of Information and Communication Technologies (ICT) has been proved to transform urban life, enabling people to improve their quality of life within the city environment. As a direct result of the digital revolution, current urban plans are transforming the vision of sustainable cities, which must meet not only economic and environmental indicators’ requirements, but also make current technological developments easy to use and accessible to their residents. At the same time, while technology continues to change city infrastructure, without considering in some cases the cultural characteristics of different sites and communities; however cultural heritage, both tangible and intangible, remains crucial to the shaping of future societies. This paper examines how Smart Cities will benefit by the introduction of\" smart cultural heritage\", in order to support various cultural services and to promote and preserve the cultural heritage, through smart applications and participatory processes.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:QYdC8u9Cj1oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A neural network and fuzzy logic system for face detection on RGB images",
            "Publication year": 2001,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/34240",
            "Abstract": "A neural network and fuzzy logic system for face detection on RGB images Αρχική Σελίδα → \nΚεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε συνέδρια → \nΕμφάνιση Τεκμηρίου HEAL DSpace A neural network and fuzzy logic system for face detection \non RGB images Αποθετήριο DSpace/Manakin A neural network and fuzzy logic system for face \ndetection on RGB images Anagnostopoulos, C; Anagnostopoulos, I; Vergados, D; Kayafas, E; \nLoumos, V; Stassinopoulos, G URI: http://hdl.handle.net/123456789/34240 Ημερομηνία: 2001 \nΕμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο \nΠροβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο \nεμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε συνέδρια Περιήγηση Σε \nόλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα η /…",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy-efficient routing protocols in wireless sensor networks: A survey",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6248647/",
            "Abstract": "The distributed nature and dynamic topology of Wireless Sensor Networks (WSNs) introduces very special requirements in routing protocols that should be met. The most important feature of a routing protocol, in order to be efficient for WSNs, is the energy consumption and the extension of the network's lifetime. During the recent years, many energy efficient routing protocols have been proposed for WSNs. In this paper, energy efficient routing protocols are classified into four main schemes: Network Structure, Communication Model, Topology Based and Reliable Routing. The routing protocols belonging to the first category can be further classified as flat or hierarchical. The routing protocols belonging to the second category can be further classified as Query-based or Coherent and non-coherent-based or Negotiation-based. The routing protocols belonging to the third category can be further classified as Location …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:tkaPQYYpVKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Call admission control with adaptive allocation of resources in wireless ATM networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1014569/",
            "Abstract": "Wireless ATM is an emerging network technology that combines the capabilities of ATM with user mobility and undeterred access. Therefore, call admission control is a crucial function in mobile networks. It assists users to move and communicate freely beyond the limits of a specific wireless area, without losing their established connection and at the same time it decides whether an incoming call should-be admitted to network service. Different CAC schemes are proposed and serving users are classified into three categories according to their priority scheme. Our main scope is to design an efficient admission control providing users with the desired QoS. For that reason, a hybrid scheme between the handoff and new calls and the service priorities is proposed.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimating the evolution of categorized web page populations",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1149993.1150008",
            "Abstract": "This paper proposes a statistical approach for estimating the evolution of categorized web pages. The proposal is based on the capture-recapture method used in wildlife biological studies and it is modified according to the necessary assumptions and amendments for applying the experiments on the web, where web pages are considered as animals and the specific types of e-commerce pages as particular species of animals whose abundance, birth and survival rates is estimated. An artificial classifier capable of categorizing web pages, plays the role of the biologist who recognizes the species under study. Finally, a virtual experiment in the e-commerce field was simulated and the derived results were quite promising especially as far as the estimations of the survival probability values are concerned.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EDCA mechanism and mobility support evaluation in IEEE 802.11 s WMNs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7002103/",
            "Abstract": "IEEE 802.11s Wireless Mesh Networks (WMNs) constitute a cost-effective solution for broadband ubiquitous Internet access. The IEEE 802.11s standard employs the Enhanced Distributed Channel Access (EDCA) as the Medium Access Control (MAC) mechanism in order to provide differentiated channel access and Quality of Service (QoS) guarantees for multimedia flows. Under EDCA, traffic is distinguished into four Access Categories (ACs) that have different priority levels, corresponding to Voice, Video, Best Effort and Background, respectively. In this paper, we evaluate the performance of the EDCA in IEEE 802.11s WMNs by simulating pedestrian users moving at low speed for a variety of demanding multimedia applications, such as Real-Time Gaming, video, Voice over IP (VoIP), as well as, web browsing. It should be noted that we have applied IEEE 802.11n as the underlying PHY Layer of the considered …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:epqYDVWIO7EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey on security and privacy issues in wireless mesh networks",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.846",
            "Abstract": "Wireless Mesh Networks are considered as a promising solution for offering low‐cost access to broadband services. However, one of the main challenges in the design of these networks is their vulnerability to security attacks. In this paper, we analyze the fundamental security challenges and constraints of these networks, classify several possible attacks, and survey several intrusion prevention, detection, and response mechanisms found in the literature. Copyright © 2013 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:hkOj_22Ku90C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A VHO scheme for supporting healthcare services in 5G vehicular cloud computing systems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8363956/",
            "Abstract": "Fifth Generation Vehicular Cloud Computing (5G-VCC) systems use heterogeneous network access technologies in order to fulfill the requirements of modern services, including medical services with strict constraints. Therefore, the need for efficient Vertical Handover (VHO) management schemes must be addressed. In this paper, a VHO management scheme for supporting medical services in 5G-VCC systems, is described. It consists of the VHO initiation and the network selection processes, while at the same time, the vehicle's velocity, its current connection type, as well as the status of the onboard patient's health, are considered. Specifically, during the VHO initiation process the necessity to perform handover is evaluated. Subsequently, the network selection process selects the appropriate network alternative considering both medical service requirements and patients' health status. The proposed scheme is …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:Ri6SYOTghG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Evaluation of Texture Segmentation Techniques for Real-Time Computer Vision Applications",
            "Publication year": 2001,
            "Publication url": "http://www.wseas.us/e-library/conferences/skiathos2001/papers/130.pdf",
            "Abstract": "The emergence of new technologies, digital cameras, communications devices, cost effective processors, new control and computer vision systems provide new opportunities to substantially improve efficiency in various computer vision applications (CVAs). An important aspect of such application is the software module, which should be based on a robust texture segmentation technique. A lot of texture segmentation techniques are present in the literature. The content of this paper constitutes a detailed description of the state of the art techniques for texture segmentation as well as an evaluation of experimental research and results on the basis of selected algorithms suitable for real-time applications.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security for ad hoc networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04117-4_22",
            "Abstract": "Ad hoc networks are created dynamically and maintained by individual nodes comprising the network. They do not require a preexisting architecture for communication purposes and they do not rely on any type of wired infrastructure; in an ad hoc network, all communication occurs through a wireless medium. With current technology and the increasing popularity of notebook computers, interest in ad hoc networks has peaked. Future advances in technology will allow us to form small ad hoc networks on campuses, during conferences, and even in our own home environment. Further, the need for easily portable ad hoc networks in rescue missions and in situations in rough terrain are becoming extremely common.In this chapter we investigate the principal security issues for protecting ad hoc networks at the data link and network layers. The security requirements for these two layers are identified and …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Flexible Gateway Architecture Enabling Scalable Realization of UMTS Networks",
            "Publication year": 2005,
            "Publication url": "https://jit.ndhu.edu.tw/article/view/272",
            "Abstract": "Telecom operators' proliferation, caused by the liberation in the provision of communication services in the European domain, has led in the emergence of demand for small, cost effective core network elements capable of performing both access communication, as well as, traffic routing towards various technology backbones. Bulky equipment is no longer attracting operators' interest, for a number of reasons, summarized in downsize ability (monolithic support of millions of users on a single box is not the case anymore for start up operators), scalability and flexibility to seamlessly integrate advanced services. Especially in the case of UMTS, IP communications are realized over a mixture of heterogeneous transportation technologies often resulting to replication of redundant functions, which limits network performance, complicates its maintenance, reduces scalability and increases operational costs. This paper …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On per-flow fairness and scheduling in wireless multihop networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4531894/",
            "Abstract": "In wireless multihop networks communication between two-end nodes is carried out by hopping over multiple short wireless links. Traditional CSMA/CA based media access control does not work well in a multihop scenario, since transmitters are often out of reach of other users' sensing range. Therefore TDMA seems to be a more promising solution. Several algorithms may be found in the literature for scheduling TDMA transmissions for these networks. These algorithms try to determine the optimal scheduling, in order to increase the capacity and reduce the delay for a given network topology. In our previous work, a TDMA scheduling algorithm has been proposed that schedules the transmissions in a fair manner and takes into account the communication requirements of the active flows of the network. In this research effort, we compare the performance of the proposed algorithm with several TDMA scheduling …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Authentication in a layered security approach for mobile ad hoc networks",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404807000041",
            "Abstract": "An ad hoc network is a collection of nodes that do not need to rely on a predefined infrastructure to keep the network connected. Nodes communicate amongst each other using wireless radios and operate by following a peer-to-peer network model. In this article we investigate authentication in a layered approach, which results to multiple lines of defense for mobile ad hoc networks. The layered security approach is described and design criteria for creating secure ad hoc network using multiple authentication protocols are analyzed. The performance of several such known protocols, which are based on challenge–response techniques, is presented through simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Layered security design for mobile ad hoc networks",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404805001562",
            "Abstract": "When security of a given network architecture is not properly designed from the beginning, it is difficult to preserve confidentiality, authenticity, integrity and non-repudiation in practical networks. Unlike traditional mobile wireless networks, ad hoc networks rely on individual nodes to keep all the necessary interconnections alive. In this article we investigate the principal security issues for protecting mobile ad hoc networks at the data link and network layers. The security requirements for these two layers are identified and the design criteria for creating secure ad hoc networks using multiple lines of defence against malicious attacks are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Monitoring and classification of data on the evolution of byzantine churches",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network selection in a WiMAX–WiFi environment",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1574119210001124",
            "Abstract": "The tremendous growth of wireless technologies has introduced the potential of continuous service adaptation to the users’ needs by giving them the ability to be able to select and access the proper network based on different criteria. Moreover, next generation wireless networks have been designed to provide support for multimedia services, with different traffic characteristics and different Quality of Service (QoS) guarantees. However, the expansion of Wireless Local Area Networks (WLANs) and Worldwide Interoperability for Microwave Access (WiMAX) networks poses new research era in the decision of the access network selection. In this paper, the existing access network selection schemes are classified into three categories: the network-centric, the user-centric and the collaborative schemes, and are analyzed respectively. Moreover, we propose a multicriteria access network selection algorithm applied in a …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A downlink scheduler supporting real time services in LTE cellular networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388047/",
            "Abstract": "The wide spread of real-time services in wireless networks demands scheduling mechanisms supporting strict Quality of Service (QoS) requirements. Nevertheless, the specifications of the LTE standard for mobile connectivity defined by the 3rd Generation Partnership Project (3GPP) does not impose any specific scheduler for the proper allocation of resources to services. Therefore, several LTE schedulers have been proposed in the literature meeting the QoS requirements of modern services. In this paper a QoS aware scheduler for the LTE downlink is proposed namely the FLS-Advanced (FLSA) aiming at prioritizing real-time traffic. The proposed scheduler has been built on three distinct levels assigning the available radio resources to services according to their requirements. Based on simulation results, the FLSA outperforms in terms of packet loss ratio, attainable throughput and fairness the performance of …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:MLfJN-KU85MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure and practical key establishment for distributed sensor networks",
            "Publication year": 2009,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.102",
            "Abstract": "Key establishment in sensor networks is a challenging task, due to the physical constraints of sensor devices and their exposure to several threats. Existing protocols based on symmetric cryptography are very efficient but they are weak against several node impersonation and insider attacks. On the other hand, asymmetric protocols are resilient to such attacks but unfortunately, they are not feasible for sensor networks, even in their most efficient versions (e.g. the elliptic curve (EC) Diffie‐Hellman family of key agreement protocols). In this paper, we present two pairwise key establishment protocols for sensor nodes in unattended distributed sensor networks (DSNs). The first protocol is hybrid and it combines asymmetric (elliptic curve (EC)) cryptography with symmetric key techniques. The second protocol is fully asymmetric. Furthermore, through simulations, we measure the efficiency of the proposed protocols in …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:_kc_bZDykSQC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Developing Smart Buildings Using Blockchain, Internet of Things, and Building Information Modeling",
            "Publication year": 2020,
            "Publication url": "https://www.igi-global.com/article/developing-smart-buildings-using-blockchain-internet-of-things-and-building-information-modeling/256184",
            "Abstract": "Building information modeling (BIM) is a revolutionary technology that provides all the necessary mechanisms to achieve end-to-end communication, data exchange and information sharing between project actors, leading to smarter outcomes for communities and more efficient projects for AEC service providers. 3D models generated in the context of engaging in the BIM process and as-delivered physical assets through building management systems (BMS) adopt Internet of Things (IoT) architectures and services. However, the orchestration of IoT devices in a highly modular environment with many moving parts and inter-dependencies between the stakeholders of this environment, lead to many security issues. This article focuses on applying novel technologies in the construction industry, such as BIM, IoT, and Blockchain, but also on examining their interconnection and interoperability on a proposed system …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:ODE9OILHJdcC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Towards a Smart Museum using ΒΙΜ, IοT, Blockchain and Advanced Digital Technologies",
            "Publication year": 2019,
            "Publication url": "https://www.researchgate.net/profile/Emmanouil-Skondras/publication/341645677_Towards_a_Smart_Museum_using_BIM_IoT_Blockchain_and_Advanced_Digital_Technologies/links/5f9bbadda6fdccfd7b8a7b20/Towards-a-Smart-Museum-using-BIM-IoT-Blockchain-and-Advanced-Digital-Technologies.pdf",
            "Abstract": "Nowadays, the Architecture, Engineering and Construction (AEC) industry moves to the digital era, improving the collaboration among its partners using Information and Communications Technologies (ICT) tools. In this context, Building Information Modeling (BIM) provides to smart buildings novel mechanisms to embed Internet of Things (IoT) architectures, as well as to perform end-to-end communication, data exchange and information sharing between project actors. However, this openness and high decentralization of BIM and IoT services of smart buildings leads to several security issues that the use of Blockchain has been proved to provide an effective layer of data protection. This paper examines the interconnection and interoperability of BIM, IoT, Blockchain and advanced digital technologies in the demanding environment of a museum, where efficient and secure monitoring and management are critical factors that should be satisfied. It focuses on the application of the aforementioned technologies in the context of a building that has to deal with multiple administrative requirements, the management and protection of the exhibition areas and the objects exposed in them, the security and the convenience of the visitors, the financial management of the tickets and the profits from museum shops, the workshops, the laboratories and the storage areas, which usually contain numerous invaluable artifacts.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:cWzG1nlazyYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New generation features for GSM systems: an overview of DECT technology in 3G mobile communication systems",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/905925/",
            "Abstract": "This paper presents an extensive overview of the anticipated role of DECT technology in 3G systems. DECT (digital enhanced cordless telecommunications) is a flexible digital radio access standard for cordless communications in residential, corporate and public environments. DECT caters for voice and data traffic, and contains many forward-looking technical features that allow DECT-based cordless systems to play a central role in important new communications developments such as multimedia access, and interworking with other fixed and wireless services such as ISDN and GSM. This overview is based on most recent standardization work in ETSI and other institutions.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An access network selection algorithm for heterogeneous wireless environments",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5546556/",
            "Abstract": "Ubiquitous service delivery requires the selection of the optimal access network in a heterogeneous wireless environment. However, since the selection of an access network in such an environment depends on several parameters with different relative importance (such as the network and the application characteristics, the user preferences, the service cost), it is a difficult task to be achieved. In this paper, an effective access network selection algorithm for heterogeneous wireless networks is proposed that combines two Multi Attribute Decision Making (MADM) methods, the Analytic Hierarchy Process (AHP) method and the Total Order Preference by Similarity to the Ideal Solution (TOPSIS) method. More specifically, the AHP method is used to determine weights of the criteria and the TOPSIS method is used to obtain the final access network ranking.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Simulation, Modeling and Analysis of Path Rerouting Algorithms for Handoff Control in Wireless ATM Networks",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=18226074496216530822&hl=en&oi=scholarr",
            "Abstract": "Wireless ATM will become the main component of the Broadband Wireless Network infrastructure. The important feature of ATM is the support for different traffic characteristics and QOS requirements. This paper presents the architecture of a Wireless ATM, simulating and evaluating three different handoff control schemes and presents the status of a prototype implementation. It also describes the overall architecture of the simulator, illustrates the innovative features and elaborates on the potential benefits identifying possible advantages against other candidate handoff algorithms solutions. The simulation implementation of the handoff scenarios provides a scheme allowing the assessment, testing and comparative evaluation of path rerouting algorithms and caters for smooth incorporation of other essential parts of the architecture, except handoff, such as components for advanced Resource Management and …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:p2g8aNsByqUC",
            "Publisher": "Society for Computer Simulation International; 1998"
        },
        {
            "Title": "SLA factors of interconnecting wireless networks QoS, cost estimation point of view-the IC-DBMS approach",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.582.3569&rep=rep1&type=pdf",
            "Abstract": "Service Level Agreement between Interconnecting Wireless Service Providers and charging should be in collaboration with the resource allocation and QoS together with the usage of an interconnection protocol and a database to store the Users’ Parameters information needed for the charging/pricing as well as the authentication and the authorization of the end user. Cost Estimation depends on two major factors: The resources availability and the technology factors. This paper discusses SLA factors that should be defined in order to take advantage of the interconnection of the wireless networks in a cost effective way from the telecom provider’s part as well as the mobile user part. In addition reviews various pricing and charging methods that are used these days by several Wireless Service Providers.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A review of call Admission Control schemes in Wireless ATM Networks",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-47728-4_45",
            "Abstract": "The next generation personal communication networks are expected to support multimedia services and a general solution for this is viewed through wireless ATM. The requirements to provide real time multimedia traffic along with voice and data of varying priorities increase the need for QoS mechanisms in wATM. The problem of Admission Control is one of the most important issues in a Wireless ATM environment. This paper reviews significant strategies, as new algorithmic schemes for Call Admission Control (CAC) in Wireless ATM Networks and evaluates their results.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Synchronization of multiple access points in the IEEE 802.11 point coordination function",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1400186/",
            "Abstract": "Guaranteed QoS in WLAN can enable the support of new and demanding services. The IEEE 802.11 WLAN is the dominant solution for local area wireless networking, as it can provide low cost and easy to deploy high performance wireless connectivity. IEEE has defined two access methods for the 802.11 WLAN: DCF and PCF. Even though the DCF access mode can provide high throughput and low delay for a limited number of users, only the PCF access mode can deliver guaranteed quality of service when the number of users increases. The PCF access mode, as defined by IEEE, cannot operate efficiently when a number of access points with overlapping coverage areas communicate over the same channel. In this paper a new intra access point synchronization scheme is introduced, for allowing multiple access points to cooperate, providing guaranteed quality of service under the PCF operation.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Location management in 3G networks using a 2-level distributed database architecture",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394117/",
            "Abstract": "In this paper, we introduce a 2-level distributed database architecture combined with the Group Registration (GR) location tracking strategy to be used in 3G wireless networks. With this strategy, the total location management cost is reduced by updating the location of MTs (Mobile Terminals) in an RA with a single route response message to the HSS (Home Subscriber Server). The Location Registration and Call Delivery procedures are presented in detail. The extensive analysis of the numerical results shows that the GR strategy integrated with a 2-level distributed databases architecture in 3G networks can achieve a significant reduction of the total cost per call arrival, as well as, a reduction of the call delivery latency, compared to the corresponding costs of the distributed databases without the GR strategy and the GR strategy without distributed databases.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Total dermoscopy score calculation using quantitative measurements in digital dermoscopy",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6945176/",
            "Abstract": "The main contributions of this paper are an automated approach for applying the ABCDE rules in a digital dermoscopy platform with fixed settings and a new registration method specially designed for aligning and comparing follow-up digital dermoscopy images in order to evaluate the evolution over time parameter E. Experimental evaluations of the registration method are reported for image pairs acquired during follow-up examinations.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:EkHepimYqZsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An analytic network process and trapezoidal interval‐valued fuzzy technique for order preference by similarity to ideal solution network access selection method",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.2833",
            "Abstract": "Next generation wireless networks consist of many heterogeneous access technologies that should support various service types with different quality of service (QoS) constraints, as well as user, requirements and provider policies. Therefore, the need for network selection mechanisms that consider multiple factors must be addressed. In this paper, a network selection method is proposed by applying the analytic network process to estimate the weights of the selection criteria, as well as a fuzzy version of technique for order preference by similarity to ideal solution to perform the ranking of network alternatives. The method is applied to a heterogeneous network environment providing different QoS classes and policy characteristics. Each user applies the method to select the most appropriate network, which satisfies his or her requirements in respect of his or her service‐level agreement (SLA). Performance …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Service personalisation for assisted living of elderly people at home",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4724862/",
            "Abstract": "Worldwide, the population of elderly people grows absolutely and in relation to the overall population. This means that more and more consumers will be over 60 years of age in the near future. Independent living is probably something most people have taken for granted during most of their life. As people become older though, independent living can present more of a challenge. Thus, the provision of in-home services will assist aged people in carrying out their daily tasks. In this paper, the personalized framework of the INHOME project is presented, which aims to provide the means for improving the quality of life of elderly people at home, by developing generic technologies for managing their domestic ambient environment.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey on the successive interference cancellation performance for single-antenna and multiple-antenna OFDM systems",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6182560/",
            "Abstract": "Interference plays a crucial role for performance degradation in communication networks nowadays. An appealing approach to interference avoidance is the Interference Cancellation (IC) methodology. Particularly, the Successive IC (SIC) method represents the most effective IC-based reception technique in terms of Bit-Error-Rate (BER) performance and, thus, yielding to the overall system robustness. Moreover, SIC in conjunction with Orthogonal Frequency Division Multiplexing (OFDM), in the context of SIC-OFDM, is shown to approach the Shannon capacity when single-antenna infrastructures are applied while this capacity limit can be further extended with the aid of multiple antennas. Recently, SIC-based reception has studied for Orthogonal Frequency and Code Division Multiplexing or (spread-OFDM systems), namely OFCDM. Such systems provide extremely high error resilience and robustness, especially …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:HE397vMXCloC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey on medium access control schemes for 5g vehicular cloud computing systems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8635661/",
            "Abstract": "Fifth generation (5G) vehicular systems support multiple services with strict Quality of Service (QoS) constraints. To fulfill the increased communication needs, 5G Vehicular Cloud Computing (5G-VCC) architectures with dense deployments of the access network infrastructures have been proposed. In such systems, the network resources manipulation is a critical task that could be addressed by the Medium Access Control (MAC) layer. MAC schemes that have been proposed for vehicular networks, can be applied to 5G-VCC systems in order optimal manipulation of communication resources to be accomplished. This paper makes an overview of available MAC schemes, while a comprehensive discussion about their implementation in 5GVCC systems is performed leading to useful conclusions.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:_5tno0g5mFcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Health Care Web Information Systems and Personalized Services for Assisting Living of Elderly People at Nursing Homes",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11684-1_9",
            "Abstract": "Nursing homes, where home adaptations - environmental improvements and assistive technology (AT) are provided, represent an increasingly attractive means of helping senior citizens maintain their independence and enhance the quality of their life. Doctors and specialists are also involved in order to provide elderly people with personalized health care services, in this way improving their treatment and life conditions. The main difference that nursing homes have compared to a typical health home is that the former use new technologies and applications in order to collect data from the elderly and create an electronic file for each individual. The basic idea of this paper is to use a web application along with tablet PCs or PDAs in order to collect the personal information and the clinical characteristics of the patient. Moreover, this application helps doctors manage the nursing home and have a better view of …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:maZDTaKrznsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An authentication scheme for ad-hoc networks using threshold secret sharing",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-007-9345-5",
            "Abstract": "Ad-hoc networks are peer-to-peer self- organized networks that make possible the communication between nodes located in areas, where communication infrastructure is absent or difficult to implement. For such networks, security is a crucial issue, since the wireless medium is vulnerable to various attacks. A centralized solution can be easily compromised, leaving the nodes exposed to threats originating from malicious users. In this paper, a security design for Ad-hoc networks is proposed and studied, providing authentication to the nodes that follow the principles of threshold secret sharing.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "An effective spectrum handoff scheme for cognitive radio ad hoc networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7943552/",
            "Abstract": "Cognitive Radio Networks (CRNs) is the key technology to overcome the disadvantages of static spectrum allocation and enhance spectrum utilization through Dynamic Spectrum Access (DSA) techniques. One important topic of the development of CRNs is spectrum handoff, which ensures the uninterrupted communication of Secondary Users (SUs). Two types of spectrum handoff approaches exist, namely the proactive and the reactive spectrum handoff. When the Primary User (PU) traffic is high the proactive spectrum handoff approach is more suitable whereas the reactive handoff on light PU traffic achieves better performance. In this paper we evaluate the use of proactive and reactive spectrum handoff policies in CRNs. Simulations are conducted using NS-3 simulator. To the extent of our knowledge, an extensive CRN simulation regarding spectrum handoff on NS-3 simulator has not been carried out …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:xtoqd-5pKcoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a Smart Museum using BIM, IoT, Blockchain and Advanced Digital Technologies",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3387168.3387196",
            "Abstract": "Nowadays, the Architecture, Engineering and Construction (AEC) industry moves to the digital era, improving the collaboration among its partners using Information and Communications Technologies (ICT) tools. In this context, Building Information Modeling (BIM) provides to smart buildings novel mechanisms to embed Internet of Things (IoT) architectures, as well as to perform end-to-end communication, data exchange and information sharing between project actors. However, this openness and high decentralization of BIM and IoT services of smart buildings leads to several security issues that the use of Blockchain has been proved to provide an effective layer of data protection. This paper examines the interconnection and interoperability of BIM, IoT, Blockchain and advanced digital technologies in the demanding environment of a museum, where efficient and secure monitoring and management are critical …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:yFnVuubrUp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy-efficient routing protocols in wireless sensor networks for health communication systems",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1579114.1579148",
            "Abstract": "Wireless Sensor Networks (WSNs) have their own unique nature of distributed resources and dynamic topology. This introduces very special requirements that should be met by the proposed routing protocols for the WSNs. A Wireless Sensor Network routing protocol is a standard which controls the number of nodes that come to an agreement about the way to route packets between all the computing devices in mobile wireless networks. Today, wireless networks are becoming popular and many routing protocols have been proposed in the literature. Considering these protocols we made a survey on the WSNs energy-efficient routing techniques which are used for Health Care Communication Systems concerning especially the Flat Networks Protocols that have been developed in recent years. Then, as related work, we discuss each of the routing protocols belonging to this category and conclude with a …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High performance computing standards for quality control in the Textile industry",
            "Publication year": 2002,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16580680",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Service personalization for assistive living in a mobile ambient healthcare-networked environment",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00779-009-0278-8.pdf",
            "Abstract": "For more than a decade, it has been observed that due to the continuously increasing elderly population, medical expenditures for home health-care have rapidly increased every year. Health-care organizations are being encouraged to find more efficient methods of providing high-quality care with cost savings. Elderly people who live alone may fear being unable to obtain help if they are injured or ill. For many families, the fear of such an event can dominate decisions about living arrangements. During the last decades, this fear has generated an industry, marketing house automations, alarm-and-notification systems as well as assistive technologies and interventions that aim at easier and more efficient control of their living environment, as well as the provision of specialized home-care services. In this study, the most important aspects of the INHOME platform architecture, the home-care services provided …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Interconnection between mobile providers and the SLA-pricing policies",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1543713/",
            "Abstract": "The need of disposal of new services from telecom providers to their customers and the exploitation of existing but also continuously presented new technologies bring in the limelight the need of covering economically these services. This concern is not only focused how the interconnection between the various technologies will be achieved, but also how these demanding services will be offered in the consuming public. Charging should be in collaboration with the resource allocation and QoS together with the usage of an interconnection protocol and a database to store the information needed for the charging/pricing as well as the authentication and the authorization of the end user. Pricing/charging depends on two major factors: the resources availability and the technology and economy factors. This paper discusses the pricing policies that should be defined and the SLAs applied in order to take advantage of …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The IP revolution and potential gains for ISP/mobile/fixed telephony operators in the liberalization of telecommunications",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/880744/",
            "Abstract": "The evolution of a new, \"open\" communications environment is now coming together harmoniously to deliver new communications services, characterised by mobility and advanced multimedia capabilities. The particular case addressed in this paper involves in a complex yet realistic scenario, telecom operators of fixed network, mobile telecommunications operator and Internet service providers (ISP). As a strategic movement towards IP technology both for access and backbone networks, this paper proposes an interworking scenario scheme between the ISP IP network and the mobile network. Finally, the main problems and issues are also identified and analyzed, originating from the planned network scenario.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A mobile healthcare system using IMS and the HL7 framework",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1882486.1882535",
            "Abstract": "The advent of Wireless Body-Area Sensor Networks (WBASNs) technologies enables the autonomic and remote collection of realtime physiological data related to the health status of patients with chronic diseases. At the same time the advances in wireless communication systems make possible the\" anywhere, anytime\" delivery of such data to medical staff and caregivers in order to allow them to easily monitor and quickly respond in emergencies. In this paper, we propose a system architecture that utilizes the IMS (IP Multimedia Subsystem) and the HL7 (Health Level Seven) technologies to implement a mobile and interoperable healthcare system to support WBASNs in a healthcare environment.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Efficient Mobility Management Scheme for 5G Network Architectures",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9221842/",
            "Abstract": "Fifth generation (5G) networks use heterogeneous network access technologies to support Mobile Nodes (MNs) with multiple services with different Quality of Service (QoS) constraints. In a 5G architecture, an MN can use Massive Multiple Input Multipole Output (MMIMO) antennas to obtain access to increased telecommunication resources. In these environments the need to support service continuity of MNs is a key issue. Therefore, the design of efficient mobility management schemes for 5G infrastructures is needed. In this paper, a novel mobility management scheme for 5G systems is proposed. Whenever the perceived Quality of Service (QoS) becomes less than a predefined threshold, Vertical Handover (VHO) is initiated. Subsequently, network selection is performed, considering the energy level of the MN. Finally, a MIH-enhanced FPMIPv6 handover approach is performed to achieve service continuity of the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:fFSKOagxvKUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Artificial Neural Network Approach for Classifying E-Commerce Web Pages.",
            "Publication year": 2003,
            "Publication url": "https://www.actapress.com/Abstract.aspx?paperId=14115",
            "Abstract": "AN ARTIFICIAL NEURAL NETWORK APPROACH FOR CLASSIFYING E- COMMERCE WEB \nPAGES Anagnostopoulos I., Kouzas G., Anagnostopoulos C., Psoroulas I., Vergados D., Loumos \nV. and Kayafas E. National Technical University of Athens, Division of Computer Science, \nDepartment of Electrical and Computer Engineering, GR-15773, Athens, Greece \njanag@telecom.ece.ntua.gr ABSTRACT In this paper, an information system capable of identifying \nand categorizing e-commerce web pages is proposed, on the basis of information filtering \ncombined with a Artificial Neural Network (ANN). It includes term transformation techniques \nalong with pattern recognition methods for content identification. The information representation \ntechniques are based on a multi-dimensional descriptor vector with 432 word stems collected \neither manually or in an automatic way. This vector is called e-Commerce Descriptor Vector (-…",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Location Management in Wireless Networks: Issues and Technologies",
            "Publication year": 2006,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420013610-19/location-management-wireless-networks-issues-technologies-christos-douligeris-dimitrios-vergados-zuji-mao",
            "Abstract": "With the increasing demands for new data services, wireless networks should support calls with different traffic characteristics and different Quality-of-Service (QoS) guarantees. For cellular networks to be able to efficiently cope with mobile user requirements, new mechanisms are needed, mechanisms that will help the network know the location of every mobile user it serves, and thus, properly track the user. Knowing where the user resides, the cellular network will be capable of creating suitable connections (creation of a suitable path) between two users and deliver the call efficiently. Moreover, the cellular network should guarantee low call delivery latency and all time connectivity, especially when a user moves from one cell to another, providing at the same time the appropriate amount of bandwidth and avoiding call termination. The mechanism responsible for carrying out the above procedures is generically …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Auerbach Publications"
        },
        {
            "Title": "Fair TDMA scheduling in wireless multihop networks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-010-9397-9",
            "Abstract": "In wireless multihop networks, communication between two end-nodes is carried out by hopping over multiple wireless links. However, the fact that each node has to transmit not only its own traffic, but also traffic on behalf of other nodes, leads to unfairness among the communication rates of the nodes. Traditional Carrier Sense Multiple Access/Collision Avoidance (CSMA/CA) based media access control does not work satisfactory in a multihop scenario, since an intended target of a communication may be subject to mutual interference imposed by concurrent transmissions from nodes, which cannot directly sense each other, thus causing unfair throughput allocation. Although Time Division Multiple Access (TDMA) seems to be a more promising solution, careful transmission scheduling is needed in order to achieve error-free communication and fairness. Several algorithms may be found in the literature for …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Network management approaches in 3G tactical wireless communication networks",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/985972/",
            "Abstract": "Considering that management constitutes one of the most important pieces of the overall military puzzle, this paper discusses various management approaches applied in tactical military networks. Specifically, the paper refers to 3G wireless military management systems, presenting management/control operations, tasks and schemes that can guarantee battlefield supremacy. Also, the paper discusses several issues concerning the migration of current tactical management systems to open, flexible and modular systems, which cover current needs and can be readily adaptable to tomorrow's changing requirements.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Health care information systems and personalized services for assisting living of elderly people at nursing home",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4724860/",
            "Abstract": "The nursing homes, where home adaptations (environmental improvements) and assistive technology (AT) are provided, represent an increasingly attractive mean of helping elderly people to maintain their independence and enhancing their quality of life. Doctors and specialists are involved in order to provide personalized health care services to elderly people so as to have a better life and treatment. The main difference from a typical health home is that nursing homes are using new technologies and applications in order to collect data from elderly people and create an electronic file for each elderly people. The basic idea of this paper is to use a web application and tablet PC or PDA in order to collect people¿s both personal information and clinical characteristics. Moreover, this application helps doctors to manage the nursing home and have a better view of the health status of each patient, getting in parallel a …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy and throughput efficiency in wireless multihop networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5700143/",
            "Abstract": "In wireless multihop networks, route selection plays an important role in network performance in terms of throughput capacity, as well as, energy efficiency. In general, the route selection strategy should distribute the traffic throughout the network, in order to avoid congestion. This strategy also has the side-effect of distributing the energy consumption among all nodes, so that the energy starvation of highly used nodes is avoided. However, the optimal route selection strategy is not always the same with respect to throughput and energy efficiency. In this paper we evaluate several route selection strategies in terms of average message transmission durations and network connectivity lifetime. The simulation results show which strategy is more beneficial for each objective, and how a combination of strategies may lead to balanced results.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security architecture based on defense in depth for Cloud Computing environment",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7562097/",
            "Abstract": "Cloud Computing constitutes an emerging computing paradigm consisting of elements of grid computing, utility computing and software-defined networks. The aggregation of these technologies offers a new environment for the deployment of services. Cloud computing environment provides capabilities which are unique covering the existing and future needs of organizations and companies. Moreover, this environment supports big data applications usually forming the core elements of research projects. Therefore cloud computing technology and big data are linked to each other. However, the capabilities of cloud computing environment create challenges concerning the security of data applications and its systems. In this respect, security issues are present on big data applications. By adopting the cloud computing environment, the provider has to incorporate security systems and policies in its infrastructure in …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:M7yex6snE4oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generalized diversity reception in the presence of multiple distinct interferers: An Outage performance analysis",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6775040/",
            "Abstract": "The analytical performance evaluation of various coherent diversity combining reception techniques in the presence of multiuser interference is presented into this paper. Particularly, the outage probability of the generalized selection combining (GSC) and its two extreme cases, namely the maximum ratio combining (MRC) and the selection combining (SC), are evaluated. The multiple interferers undergo independent and non-identically distributed Nakagami-m fading channels, with distinct average received powers and arbitrary fading scales. New analytical outage expressions are presented including several channel fading conditions regarding the desired user's signal. Although the proposed approach is formed as an infinite series representation, it includes only simple elementary and Gamma functions, while it delivers a rapidly converging formula achieving a sufficiently high precision level. Moreover, the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:L7CI7m0gUJcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of HTTP/DASH adaptation algorithms on vehicular networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8635721/",
            "Abstract": "Video streaming currently accounts for the majority of Internet traffic. One factor that enables video streaming is HTTP Adaptive Streaming (HAS), that allows the users to stream video using a bit rate that closely matches the available band-width from the server to the client. MPEG Dynamic Adaptive Streaming over HTTP (DASH) is a widely used standard, that allows the clients to select the resolution to download based on their own estimations. The algorithm for determining the next segment in a DASH stream is not part of the standard, but it is an important factor in the resulting playback quality. Nowadays vehicles are increasingly equipped with mobile communication devices, and in-vehicle multimedia entertainment systems. In this paper, we evaluate the performance of various DASH adaptation algorithms over a vehicular network. We present detailed simulation results highlighting the advantages and …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:umqufdRvDiIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integrated MIH-FPMIPv6 mobility management approach for evolved-packet system architectures",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804517300644",
            "Abstract": "Following the Always Best Connection (ABC) principle of the 4th generation wireless networks users of mobile services would be provided with connectivity to the best access technology all the time. In such a context, mobile devices are equipped with multiple radio interfaces allowing connectivity to the most suitable network environment based on users’ requirements and operators' policies. Seamless vertical handover plays the key role for mobility across various access networks offering service continuity to users. The Evolved Packet core (EPC) network architecture of the 3GPP (Third Generation Partnership Project) provides optimized mechanisms to achieve Vertical Handover (VHO) using the Fast Proxy Mobile IPv6 (FPMIPv6) mobility management standard. However the EPC solution fails to provide seamless handover for real time applications due to lack of information when the source and the target …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A Generalised Regression algorithm for web page categorisation",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-004-0409-0",
            "Abstract": "This paper proposes an information system that classifies Web pages according a taxonomy, which is mainly used from seven search engines/directories. The proposed classifier is a four-layer generalised regression neural network (GRNN) that aims to perform the information segmentation according to information filtering techniques using content descriptor vectors. Eight categories of Web pages were used in order to evaluate the robustness of the method, while no restrictions were imposed except for the language of the content, which is English. The system can be used as an assistant and consultative tool for classification purposes as well as for estimating the population of Web pages at any given point in time.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "MPEG-21 digital items to support integration of heterogeneous multimedia content",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366405004639",
            "Abstract": "The MELISA system is a distributed platform for multi-platform sports content broadcasting, providing end users with a wide range of real-time interactive services during the sport event, such as statistics, visual aids or enhancements, betting, and user- and context-specific advertisements. In this paper, we present the revamped design of the complete system and the implementation of a middleware entity utilizing concepts present in the emerging MPEG-21 framework. More specifically, all multimedia content is packaged in a self-contained “digital item”, containing both the binary information (video, graphics, etc.) required for the playback, as well as structured representations of the different entities that can handle this item and the actions they can perform on it. This module essentially stands between the different components of the integrated content preparation system, thereby not disrupting their original …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:Se3iqnhoufwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A strategy for harmonised QoS manipulation in heterogeneous IMS networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-008-9566-2.pdf",
            "Abstract": "Heterogeneous networks are collections of communication platforms utilising different protocols. Heterogeneity was born by the need of operators to offer within short time many different services on the market. As a result, nowadays users communicate through collections of networks utilising different protocols, rendering service mapping from one network to another a complex issue. With the emergence of IMS and the introduction of IP and SIP protocols as a means for achieving network homogeneity, service interoperability has become even more important. With regard to this problem, the paper proposes a method for homogenising IMS networks with regard to the utilised QoS settings and charging policy. The paper explains how the method can be applied on real IMS networks for the preservation of QoS and charging records across the whole communication path and carries out a comparative analysis …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Department of Electrical Engineering & Computer Science",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=4891032052189014575&hl=en&oi=scholarr",
            "Abstract": "The objective of this paper is not only to monitor, configure and control the immediate situation, but also to continually collect and assess information-so inter-and intra-service communications must be available throughout the chain of command. Vital decisions based on the current status and location of every available resource must be centrally coordinated. Military Communications should be quickly reconfigured, with optimum survivability potential regardless of the particular configuration. Not only the initial speed of response, but also the rate at which fresh intelligence reports can be assimilated is crucial. To apply this intelligence in the most effective manner requires a unique mix of communications technology, systems integration and software know-how.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:OP4eGU-M3BUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cooperative relaying in underlay cognitive systems with hardware impairments",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1434841115002514",
            "Abstract": "The performance of an underlay cognitive (secondary) dual-hop relaying system with multiple antennas and hardware impairments at each transceiver is investigated. In particular, the outage probability of the end-to-end (e2e) communication is derived in closed-form, when either transmit antenna selection with maximum ratio combining (TAS/MRC), or TAS with selection combining (TAS/SC) is established in each hop. Simplified asymptotic outage expressions are also obtained, which manifest the diversity and array order of the system, the effectiveness of the balance on the number of transmit/receive antennas, and the impact of hardware impairments to the e2e communication.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:tYavs44e6CUC",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "Modeling and efficient handling of handoffs for multi service wireless networks",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=14489237252110163331&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An analysis of bluetooth, zigbee and bluetooth low energy and their use in wbans",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20865-2_22",
            "Abstract": "A rapid development of services and technologies in the field of health care has been witnessed in the last few years. In this paper we present an analysis and an extensive comparison of radio communication technologies, namely Zigbee, Bluetooth and Bluetooth Low Energy, that have been proposed as likely candidates to provide wireless connectivity between body sensors and the health care system and consequently to lead the development and extended deployment of Wireless Body Area Networks. After the description of their characteristics, we concentrate on the security that these technologies offer since security is extremely important for the sensitive health care clinical information communicated and the protection of patients’ clinical information privacy.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A probabilistic neural network for human face identification based on fuzzy logic chromatic rules. MED’03—The 11th Mediterranean Conference on Control and Automation",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fault tolerant supercomputing: a software approach",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.120.9705&rep=rep1&type=pdf",
            "Abstract": "Adding fault tolerance to embedded supercomputing applications is becoming an issue of great significance, especially as these applications support critical parts of our everyday life in the modern “Information Society”. To this end, a software middleware framework is presented that features a collection of flexible and reusable fault tolerance modules acting at different levels and coping with common fault tolerance requirements. The burden of ad hoc fault tolerance programming is removed from the application developer, while at the same time average fault tolerance support taken at operating system level is avoided. A high-level description helps the developer specify the fault tolerance strategies of the application as a sort of second application layer; this separates functional from fault tolerance aspects of an application, shortening the development cycle and improving maintainability. Integration of this functionality in real embedded applications validates this approach.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ngl03-6: Applying wireless diffserv for qos provisioning in mobile emergency telemedicine",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4150890/",
            "Abstract": "Medical broadband applications have attracted increased attention in the recent years. Also, the tremendous growth of wireless technologies has introduced the potential of continuous healthcare monitoring for mobile patients. The bandwidth requirements and the real-time nature of medical applications introduce the need for quality of service (QoS) provisioning in wireless broadband medical networks. Therefore, the use of Differentiated Services in Telemedicine forms a grand challenge. DiffServ may support a number of e-health applications with different traffic requirements, providing at the same time QoS guarantees. Resource Allocation in DiffServ for e-health application is inherently different in many aspects including the offered services, traffic requirements, propagation's characteristics and network structure. This paper presents a novel DiffServ architecture for QoS provisioning in emergency Telemedicine.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "THE ENHANCEMENT OF UNDERWATER CULTURAL HERITAGE ASSETS USING AUGMENTED REALITY (AR).",
            "Publication year": 2019,
            "Publication url": "https://pdfs.semanticscholar.org/a156/a5a53e58ea5b33b66d530dedb5c63e43eef0.pdf",
            "Abstract": "Τhe development in the fields of Underwater Cultural Heritage (UCH) management and Maritime Archaeology, yields an interdisciplinary and creative academic framework, such as the Information and Communication Technologies (ICT) sector that has been proved to build intelligent systems and applications. However, the ways to fully make use of these technologies are still being explored, as their potential have not been exploited yet. Underwater archaeological sites, semi (/or fully) submerged settlements, ancient ports and shipwrecks, unlike land sites, are not accessible to public due to their special (sub) marine environment and depth. In this paper, an innovative research idea of using Augmented Reality (AR) for maintaining the memory and the information of underwater archaeological sites, is presented. Although the “artificial” visual documentation cannot replace the authentic values of the underwater tangible heritage, the AR technology can contribute to the protection of the intangible properties and the conquered knowledge of the past of a place. This research work will focus, among other case studies, on the (semi) submerged fortifications and their contiguous contents of the acropolis of Halai in east Lokris, Greece. Hence, along with the climate change that may lead more antiquities covered by water during the following years, the advances in the communication field and the up-coming 5G and cloud technologies will make the idea fully applicable, contributing to the enhancement of the coastal and the underwater archaeological remains.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:mlAyqtXpCwEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Programming military networks: A review of alternative technologies",
            "Publication year": 2002,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16580697",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D04 Telecommunications and information theory/001D04B Telecommunications/001D04B02 Systems, networks and services of telecommunications/001D04B02G Transmission and modulation (techniques and equipments)",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Storage as a Service scheme for supporting Medical Services on 5G Vehicular Networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9284339/",
            "Abstract": "Vehicular networks have emerged in recent years offering novel medical services to vehicular users. In-vehicle equipment such as On-Board Units (OBUs), Internet of Things (IoT) devices and sensors are used to supervise the health of on-board users and create an increasing amount of medical information. This information should be processed and then transmitted to medical units (e.g. hospitals) with the lowest possible processing and communication delays. Furthermore, it should be organized considering well-defined standards, in order to be easily reusable from third-party medical systems. Thus, the medical staff will be able to remotely provide immediate medical support to vehicular patients. In this paper, an interoperable Storage as a Service (STaaS) scheme which delivers medical data through a 5G wireless network architecture is described. The Health Level 7 (HL7) standard is applied for the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:yqoGN6RLRZoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power control schemes in wireless sensor networks for homecare e-health applications",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1389586.1389683",
            "Abstract": "Power control is an important research topic for ad-hoc Wireless Sensor Networks (WSNs). In today's sophisticated and competitive wireless environment, the control of the energy consumption in a WSN for homecare e-health makes it possible to guarantee basic levels of system performance, such as connectivity, throughput, delay, QoS and survivability in the presence of both mobility-immobility and a large number of sensor nodes. Recent advances in sensor fabrication technology, low-power digital and analogue electronics, and low-power wireless communication systems have made it possible to develop low-cost, robust and survivable WSNs to support activities such as assisted living and ambient intelligence (Aml). A large variety of approaches for intelligent energy-efficient schemes have been simulated over different performance metrics. In this paper, various decision support schemes are proposed …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Two‐Step Authentication in Mobile Ad Hoc Networks",
            "Publication year": 2006,
            "Publication url": "https://openaccess.city.ac.uk/15300/1/Two-Step%20Authentication%20-%20China%20Communication%20Journal.pdf",
            "Abstract": "The lack of fixed infrastructure in ad hoc networks causes nodes to rely more heavily on peer nodes for communication. Nevertheless, establishing trust in such a distributed environment is very difficult, since it is not straightforward for a node to determine if its peer nodes can be trusted. An additional concern in such an environment is with whether a peer node is merely relaying a message or if it is the originator of the message. In this paper, we propose an authentication approach for protecting nodes in mobile ad hoc networks. The security requirements for protecting data link and network layers are identified and the design criteria for creating secure ad hoc networks using several authentication protocols are analyzed. Protocols based on zero knowledge and challenge response techniques are presented and their performance is evaluated through analysis and simulation.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:-FonjvnnhkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An IMS-based network architecture for WiMAX-UMTS and WiMAX-WLAN interworking",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366410000927",
            "Abstract": "The IP Multimedia Subsystem (IMS) seems to be the technology that will prevail in Next Generation Networks (NGNs), since the interworking environment and the service flexibility that this technology offers to the currently deployed wireless broadband technologies makes it appealing to users, service developers and network operators. In this paper we propose a heterogeneous network model based on the IMS that integrates the Worldwide Interoperability for Microwave Access (WiMAX), Universal Mobile Telecommunications System (UMTS) and Wireless Local Area Network (WLAN) technologies and provides guaranteed QoS. We present the complete signalling flow concerning the authorization, registration, session set up and vertical handoff processes, as well as, an analytic model for cost analysis of the proposed architecture.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Topological Dependence and Fault Tolerance in TDMA Based Power Conservation for WSNs.",
            "Publication year": 2008,
            "Publication url": "https://www.scitepress.org/Papers/2008/20276/20276.pdf",
            "Abstract": "Energy conservation is a very critical issue in energy-constrained wireless sensor networks that introduces sleep-mode related delay. Since a long time delay can be harmful for either large or small wireless sensor networks, a TDMA-based scheduling scheme has been proposed, that achieves the reduction of the end-toend delay caused by the sleep mode operation while at the same time it maximizes the energy savings. However, the performance of this system has not been studied with respect to the topology of the network, and taking into consideration node failures. In this paper, we evaluate the TDMA-based energy conservation scheme, and compare it to the S-MAC and the adaptive listening schemes, on various random topologies. In addition, we examine the performance when node failures occur, and introduce a schedule update criterion.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applying UMTS and GPRS technology in existing military communication networks: a case study",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/985872/",
            "Abstract": "The future of military wireless networks is changing dramatically along with the commercial wireless communication systems. During the last few years, the mobile wireless industry is spending considerable effort to enhance the technical characteristics of existing second generation systems in the goal of upgrading their service provision capabilities and of promoting effective integration with data transport networks (such as GPRS and UMTS). After giving an overview of GPRS and UMTS technologies, the paper proceed to present a set of generic GPRS and UMTS-based architectures, which can be used as migration steps toward third-generation tactical military networks.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient Fair TDMA Scheduling In Wireless Multi-Hop Networks",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=10865389199215908374&hl=en&oi=scholarr",
            "Abstract": "Wireless multihop networks have recently been conceived as a networking paradigm. Several algorithms may be found in the literature",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "LTE-A interworking for seamless service provisioning",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917750/",
            "Abstract": "Following the Always Best Connection (ABC) principle of the 4th generation wireless networks users of mobile services would be provided with connectivity to the best access technology all the time. In such a context mobile devices are equipped with multiple radio interfaces allowing connectivity to the most suitable network environment based on users requirements and operators policies. Seamless vertical handover plays the key role for mobility across various access networks offering service continuity to users. In this paper seamless handover solutions are presented between 3GPP (Third Generation Partnership Project) and non-3GPP wireless access technologies utilizing functionalities of the Evolved Packet Core (EPC) network of the LTE-A, as well as, of the IEEE 802.21 standard. The schemes presented provide low latencies while supporting services QoS constraints, as well as, user requirements and …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:uc_IGeMz5qoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A P2P technology middleware architecture enabling user-centric services deployment on low-cost embedded networked devices",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366405004585",
            "Abstract": "This paper presents a middleware architecture based on peer-to-peer (P2P) technology components, allowing seamless integration of service functions over wireless interfaces and terminals, with a view to enable realisation of intelligent control applications for the home.Up-to-date this applications area is characterised by limited growth, as most of research effort is put on the development of user-to-user communication services, where the market potential is more evident. However, elaboration of mobile services, emerging obvious usability even by inexperienced users in the daily life, could offer the “killer application” potential for the data path of the mobile communications technology.In the sequel, the advantages of this architecture, summarised in optimised performance and thin structure suitable to be hosted on reduced functionality, low-cost embedded systems, are illustrated in the deployment of control …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Requirements and Speciﬁcation for High Speed Computing unit for ﬂaw detection in fabrics",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=2481518676463735659&hl=en&oi=scholarr",
            "Abstract": "Industrial High Speed units (or High Performance Computing—HPC) are of strategic interest for the textile industry as they could form the basis of a system achieving a high degree of accuracy on textile inspection. Due to the speciﬁc nature of textile, the defects encountered within textile production must be detected and corrected at early stages of the production process. Thus, the visual defect detection is of utmost importance for the product's overall quality and cost. This paper presents the requirements of the textile companies, in regards to the quality control process by assessing the feasibility of using a HPC based machine vision to substitute human Operators.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance analysis of the ordered V-BLAST approach over Nakagami-m fading channels",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6320548/",
            "Abstract": "The performance of the V-BLAST approach, which utilizes successive interference cancellation (SIC) with optimal ordering, over independent Nakagami-m fading channels is studied. Systems with two transmit and n receive antennas are employed whereas the potential erroneous decision of SIC is also considered. In particular, tight closed-form bound expressions are derived in terms of the average symbol error rate (ASER) and the outage probability, in case of binary and rectangular \\mathcal{M}-ary constellation alphabets. The mathematical analysis is accompanied with selected performance evaluation and numerical results, which demonstrate the usefulness of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High performance computing algorithms for textile quality control",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378475402000319",
            "Abstract": "At the present time, industries like textile are in constant need of modernisation. Thus, their presence in the high technology area of high performance computing (HPC) based inspection is of strategic interest. Textile manufacturers have to monitor the quality of their products in order to maintain the high quality standards established for the textile industry. The scope of this paper is to present a HPC architecture which can be implemented at each step of the quality control process in fabrics. The prerequisites or the overall system are then discussed analytically, as well as the limitations and the restrictions imposed due to the nature of the problem. The software algorithm and the evaluation of the first results are also presented in detail.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:qjMakFHDy7sC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A route selection scheme for supporting virtual tours in sites with cultural interest using drones",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8633594/",
            "Abstract": "Virtual tourism is a novel trend that enhances the experience the users perceive from touristic places, such as archaeological sites. Drones are equipped with 360° video cameras and used for video capturing of the heritage sites. The video material is streamed to the users in real time, enriched with additional 3D, Augmented Reality (AR) or Mixed Reality (MR) material. Furthermore, the selection of the appropriate flying route for each drone should be performed, in order to provide a satisfactory tour experience to the user, considering his preferences about specific monuments. To address this issue, this paper describes a heritage route selection scheme for supporting real-time virtual tours in sites with cultural interest using drones. The proposed scheme applies a Fuzzy Multiple Attribute Decision Making (FMADM) algorithm, the Trapezoidal Fuzzy Topsis for Heritage Route Selection (TFT-HRS), to accomplish the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "QoS-aware scheduling in LTE-A networks with SDN control",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7785367/",
            "Abstract": "The 3GPP Long Term Evolution Advanced (LTE-A) standard specifies a set of pioneer features such as relay nodes and carrier aggregation. At the same time, the Software Defined Networks (SDN) have become an emerging technology which provides centralized control and programmability to modern networks. In the current communication environment, cloud computing could combine the advantages of both technologies in order to create a novel cloud assisted Software Defined LTE-A architecture with relay nodes. Moreover, due to the increased requirements of modern services, the optimal resource allocation is a necessity. In such a context, this paper describes a QoS aware cross carrier scheduler for downlink flows, aiming at the optimization of system resources allocation. The proposed scheduler is evaluated against the PF, MLWDF, EXP/PF, EXP RULE, LOG RULE, FLS and FLSA schedulers in a cloud …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:e_rmSamDkqQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sliding windows: A software method suitable for real-time inspection of textile surfaces",
            "Publication year": 2004,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/004051750407400716",
            "Abstract": "There is a strong interest in expert systems to assist in complex defect identification procedures. To increase accuracy, attempts are made to enhance traditional human inspection by automated visual systems, which employ cameras and image processing routines. It is important that the software core of such a system is based on a robust, fast texture segmentation technique. Many texture segmentation techniques have been pre sented in the literature. Unfortunately, despite the fact that they achieve good results, they are computationally complex and therefore not suitable for real-time applications, since as the complexity of an algorithm grows, it becomes more and more difficult to execute the image examination in real time. This paper presents a detailed description of a fast algorithm for defect detection in textile surfaces and an evaluation of the experimental results for 137 digitized images of representative …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:5nxA0vEk-isC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "PERFORMANCE ANALYSIS OF A PREEMPTIVE HANDOFF SCHEME FOR MULTI TRAFFIC WIRELESS MOBILE NETWORKS",
            "Publication year": 2005,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9781860947315_0032",
            "Abstract": "The next generation wireless and mobile networks need to support a wide range of multimedia applications, such as voice, data, image and video. The crucial issue is to provide QoS guarantees for arriving multiclass traffic. Thus, the need for efficient and bandwidth reservation scheme is compulsory. In this paper, we propose a preemptive priority reservation handoff scheme that categorizes the service calls into four categories according to the QoS guarantees. The system is modelled using a multidimensional Markov chain and a numerical analysis is presented to estimate several performance measurements, in terms of blocking probability of ongoing calls, forced termination probability, and average transmission delay. The simulation confirms the correctness of the analytic model and the good performance of the proposed scheme.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cooperative relaying in underlay cognitive systems with TAS/MRC, spatial correlation and hardware impairments",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7390879/",
            "Abstract": "The performance of an underlay cognitive (secondary) dual-hop relaying system with multiple antennas and hardware impairments at each transceiver is investigated. In particular, the outage probability of the end-to-end (e2e) communication is derived in closed-form, when transmit antenna selection with maximum ratio combining (TAS/MRC) is established in each hop. The practical scenario of spatial correlation among the antennas at the received signal is also considered. Simplified asymptotic outage expressions reveal some new useful engineering insights; namely the diversity and array order of the system, the balance on the number of transmit/receive antennas, and the impact of hardware impairments to the e2e communication.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:tuHXwOkdijsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient Fair TDMA Scheduling In Wireless Multi-Hop Networks",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-74161-1_30",
            "Abstract": "Wireless multihop networks have recently been conceived as a networking paradigm. Several algorithms may be found in the literature for scheduling TDMA transmissions for these networks. These algorithms try to determine the optimal scheduling, in order to increase the capacity and reduce the delay for a given network topology. However, to our best knowledge, no TDMA scheduling algorithms have been developed, that take into consideration the traffic requirements of the active flows of the multihop network. At the same time, the fairness of a network is closely related to the scheduling scheme. In this research effort, we propose an intelligent algorithm that can schedule the transmissions in a fair manner, taking into account the communication requirements of the active flows of the network.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:738O_yMBCRsC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Personalized real-time virtual tours in places with cultural interest",
            "Publication year": 2019,
            "Publication url": "https://www.igi-global.com/article/personalized-real-time-virtual-tours-in-places-with-cultural-interest/222816",
            "Abstract": "Virtual tours using drones enhance the experience the users perceive from a place with cultural interest. Drones equipped with 360o cameras perform real-time video streaming of the cultural sites. The user preferences about each monument type should be considered in order to decide the appropriate flying route for the drone. This article describes a scheme for supporting personalized real-time virtual tours at sites with cultural interest using drones. The user preferences are modeled using the MPEG-21 and the MPEG-7 standards, while Web Ontology Language (OWL) ontologies are used for metadata structure and semantics. The Metadata-Aware Analytic Network Process (MANP) algorithm is proposed in order to weigh the user preferences for each monument type. Subsequently, the Trapezoidal Fuzzy Topsis for Heritage Route Selection (TFT-HRS) algorithm ranks the candidate heritage routes. Finally, after …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:sNmaIFBj_lkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "The Wisconsin breast cancer problem: Diagnosis and TTR/DFS time prognosis using probabilistic and generalised regression information classifiers",
            "Publication year": 2006,
            "Publication url": "https://www.spandidos-publications.com/10.3892/or.15.4.975",
            "Abstract": "This study addresses the breast cancer diagnosis and prognosis problem by employing two neural network architectures with the Wisconsin diagnostic and prognostic breast cancer (WDBC/WPBC) datasets. A probabilistic approach is dedicated to solve the diagnosis problem, detecting malignancy among cases (instances) as derived from fine needle aspirate (FNA) tests, while the second architecture estimates the time interval that possibly contains the right endpoint of disease-free survival (DFS) of the patient. The accuracy of the neural classifiers reaches nearly 98% for the diagnosis and 93% for the prognosis problem, while the prognostic recurrence predictions were evaluated using survival analysis through the Kaplan-Meier approximation method. Both architectures were compared with other similar approaches. The robustness and real-time response of the proposed classifiers were further tested over the …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Spandidos Publications"
        },
        {
            "Title": "Spatio temporal emergency role based access control (STEM-RBAC): A time and location aware role based access control model with a break the glass mechanism",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983932/",
            "Abstract": "The ever-increasing use of information systems and networks in every aspect of our lives has made possible the transfer of data to a wide range of different users and applications. In recent years, several architectures and models have been proposed in order to limit access to resources and ensure that data are available only to authorized users, programs or processes. These models in most cases are not dynamic and the permissions assigned to users are granted based on a static policy. A mechanism that will allow exception access to data, for example to medical information, in case of an emergency is needed. In current systems, emergency access techniques are not well defined and are used in an ad hoc manner on top of the access control mechanisms implemented without using parameters such as time, location or hierarchy of the actors involved in the system. In this paper, we present a model that …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An open signaling protocol for wireless host mobility",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45481-0_12",
            "Abstract": "The paper presents a distributed multi-agent system designed to give flexible, scaleable, robust and efficient connection management of WATM networks. The presented system includes distributed software entities (i.e., agents) that provide a virtual environment for deploying management and control operations, and generic interfaces between agents complying with the programmable network interfaces specified in the emerging P1520 reference model. Given that conventional ATM signaling protocols can not support the functionality offered by the discussed system, the paper proposes and describes an open signaling protocol for efficiently and effectively supporting host mobility in a WATM network.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Route Optimization & Handoff Control in Wireless ATM Networks",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.455.4892&rep=rep1&type=pdf",
            "Abstract": "A worldwide increasing demand for wireless communication services signals a new era for networks and their germane protocols. Wireless ATM is designed to provide high speed isochroous and asynchronous communications for users who may demand high-speed data communications along with audio and video conferencing capabilities is proposed as a solution for the provision of these services. This paper focuses on the evaluation of the impact of handoff and route optimization of such diverse traffic classes on network load, thus affecting performance and QoS. A simulation scheme of a WATM network is proposed, which in the implementation phase different handoff scenarios will be carried out and the results obtained will be reviewed to draw general conclusions.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:YFjsv_pBGBYC",
            "Publisher": "WSES Press"
        },
        {
            "Title": "Energy-efficient route selection strategies for wireless sensor networks",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-008-0098-5",
            "Abstract": "Wireless Sensor Networks (WSNs) facilitate monitoring and controlling of physical environments from remote locations with the best possible accuracy. Sensor networks are wireless networks consisting of groups of small, inexpensive nodes, which collect and disseminate critical data. Also, sensor nodes have various energy and computational constraints due to their inexpensive nature and ad hoc method of deployment. Considerable research has been focused on overcoming these deficiencies through low-energy consumption schemes. Among other factors, the route selection strategy may have an impact on the sensors lifetime, and following on the network lifetime. In this paper, we study various route selection strategies that aim at prolonging the lifetime of WSNs. Also, a new route selection scheme is proposed, that increases further the network lifetime. The performance of these schemes is analyzed …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Building a Network Simulator Using Distributed Object Technology",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=10975987183789675631&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:a0OBvERweLwC",
            "Publisher": "Society for Computer Simulation International; 1998"
        },
        {
            "Title": "Centralized management of medical big data in intensive care unit: a security analysis",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7870557/",
            "Abstract": "The digital evolution of computing environments has affected the collection and management of medical data. Since there is a constantly growing number of remote sensors and medical systems, which augment the volume of medical data, a new challenge about the management of these big data is created. As the legacy systems in effect do not have the ability to manage this rate of data efficiently, it is of great importance to address this challenge following a different approach. In this particular unit of hospitals, ICU, the usage of complex medical systems in order to provide adequate quality of healthcare services and the velocity of the decision making process, which is performed by intensivists, are critical. To this end, an approach to this problem constitutes the Centralized Management (CM) of medical data in Intensive Care Unit's(ICU) environment. The autoscalling computing environment, which will be …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:SpbeaW3--B0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proceedings of the 19th Panhellenic Conference on Informatics, PCI 2015, Athens, Greece, October 1-3, 2015",
            "Publication year": 2015,
            "Publication url": "https://pure.unic.ac.cy/en/publications/proceedings-of-the-19th-panhellenic-conference-on-informatics-pci",
            "Abstract": "Proceedings of the 19th Panhellenic Conference on Informatics, PCI 2015, Athens, Greece, \nOctober 1-3, 2015 — UNIC | Research Portal Skip to main navigation Skip to search Skip to \nmain content UNIC | Research Portal Logo Home Profiles Research Units Research output \nProjects Search by expertise, name or affiliation Proceedings of the 19th Panhellenic \nConference on Informatics, PCI 2015, Athens, Greece, October 1-3, 2015 Nikitas N. Karanikolas, \nDemosthenes Akoumianakis, Mara Nikolaidou, Dimitrios D. Vergados (Editor), Michalis Xenos, \nGeorge M. Giaglis (Editor), Stefanos Gritzalis, Lazaros F. Merakos (Editor), Panagiotis Tsanakas, \nCleo Sgouropoulou (Editor) Department of Management and MIS Research output: Book/Report \n› Anthology › peer-review Overview Original language Undefined Publisher ACM ISBN \n(Print) 978-1-4503-3551-5 Publication status Published - 2015 Access to Document http://dl…",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:OTTXONDVkokC",
            "Publisher": "ACM"
        },
        {
            "Title": "A performance evaluation of S-MAC protocol in combination with energy efficient protocols for Wireless Sensor Networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5898915/",
            "Abstract": "This paper provides a performance evaluation of the existing S-MAC protocol in combination with energy efficient protocols that are used in Wireless Sensor Networks. The whole work is mainly concentrated on the study, analysis and performance evaluation of the existing S-MAC protocol. We have concentrated on improving the power consumption of the S-MAC protocol, by using the OLSR routing protocol. The improvement of the S-MAC protocol can increase sensor nodes' lifetime and thus, network connectivity and survivability. The evaluation and test results show that the combination of S-MAC protocol with OLSR consumes less power compared to the rest of the schemes using the routing protocols AODV, DSR and DSDV.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A probabilistic neural network for face detection on segmented skin areas based on fuzzy rules",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1014642/",
            "Abstract": "In this paper, the problem of face detection in color images is addressed. Unlike in face recognition, where the classes to be discriminated are different faces, in face detection, the two classes to be discriminated are \"face area\" and \"non-face area\". A novel approach to face detection is presented, which is based on a probabilistic neural network (PNN) specially trained for the identification of faces from skin areas within the image plane, which were previously located using fuzzy logic rules. The performance of the whole system was tested using 137 color image scenes with various illumination conditions containing human faces. The images were taken with a common digital camera, at a resolution of 1280/spl times/960 pixels. The PNN coupled with the fuzzy logic rules become the basis for developing a computer-based face detection system, whose overall identification performance was 85.2%. One limitation of …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance analysis of a hybrid key establishment protocol for wireless sensor networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1565907/",
            "Abstract": "Distributed sensor networks are becoming increasingly popular, as they can be used in a variety of applications. However, limitations arising from the sensor nodes structure, such as limitations in energy, memory and computing power require new networking techniques to be introduced. DSNs are in general more vulnerable to security threats than other wired or wireless networks. Several key establishment schemes for multiphase deployment have been presented, however such schemes are unable to provide adequate security against attacks, such as fake generation attacks. In this paper, the performance analysis of the hybrid key establishment protocol proposed by Kotzanikolaou et al. (2005) for wireless sensor networks is analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Portrait identification in digitized paintings on the basis of a face detection system",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vLiTXDHr_sYC&oi=fnd&pg=PA351&dq=info:7GCWeyTk9nIJ:scholar.google.com&ots=CZnytt1Ikj&sig=x0UaGwXT3kAWMoek6zYZ6lZ_r0c",
            "Abstract": "In this paper, the problem of automatic identification of portraits in paintings collections is addressed. A face detection approach in digital images is now implemented n digitized paintings, which is based on fuzzy logic rules especially set for detecting possible skin areas in color images. The candidate regions are then forwarded in a Probabilistic Neural Network (PNN), which is properly trained for face identification. The test sample for assessing the proposed method consists of 200 digitized paintings downloaded from the website of the State Hermitage Museum. The overall performance of the system reached 88.8%.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:1qzjygNMrQYC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Resource, mobility, and security management in wireless networks and mobile communications",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=HmnLBQAAQBAJ&oi=fnd&pg=PP1&dq=info:ymJOi_l4KrcJ:scholar.google.com&ots=KoXtkY_iaR&sig=e2ZzNmpOxZOf8MORu9hO44pN4Wk",
            "Abstract": "Organized into three parts, Resource, Mobility, and Security Management in Wireless Networks and Mobile Communications examines the inherent constraint of limited bandwidth and unreliable time-varying physical link in the wireless system, discusses the demand to realize the service continuity in the single-hop or multi-hop wireless networks, and ex",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:lmc2jWPfTJgC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Intelligent services for assisting independent living of elderly people at home",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1389586.1389677",
            "Abstract": "For more than a decade it has been observed that due to the continuously augmenting elderly population, medical expenditures for home health care were exponentially raising every year. Healthcare organizations worldwide are being encouraged to find more efficient methods of providing high-quality care with cost savings. Elderly people who live alone may fear of being unable to obtain help if they are injured or ill. For many families, the specter of such an event can dominate decisions about living arrangements. During the last decades, this fear has generated an industry marketing house automations, alarm-and-notification systems as well as assistive technologies and interventions aiming in the easier and more efficient control of the living environment as well as to the provision of specialized home-care services. In the current paper, the most important aspects of the INHOME project architecture for improving …",
            "Abstract entirety": 0,
            "Author pub id": "bP0fRIEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Challenge of Mobile IP in Wireless Networks",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=5699095936616336686&hl=en&oi=scholarr",
            "Abstract": "The dramatic improvement in size, weight, and sophistication of notebook computers; an increasing reliance on information available on computer networks, most notably the Internet; and the tremendous growth in the number of telecommuters and mobile workers, are driving the creation of standards for mobile computing and networking. Mobile IP is an Internet standards-track protocol that enhances the existing Internet Protocol (IP) to accommodate mobility. In this context, applying Mobile IP in wireless networks is intended to be a direct extension of the existing fixed/wireline networks with uniform end-toend QoS guarantees.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:_Ybze24A_UAC",
            "Publisher": "4th Wireless Personal Multimedia Communication (WPMC 2001) International Conference"
        },
        {
            "Title": "Neural networks for routing optimization in wideband networks",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=5358096065248105983&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An automated system for integrated service management in emergency situations",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065043/",
            "Abstract": "The integration of Wireless Communications and Computer Science can lead to the development of advanced systems and services. This paper presents the development of an automated management system for road traffic control in emergency situations. This system consists of a Wireless Sensor Network (WSN) and a centralized control system. The performance evaluation of the system is accomplished through various scenarios of use.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Increasing intelligent wireless sensor networks survivability by applying energy-efficient schemes",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_77",
            "Abstract": "Intelligent Energy efficiency is an important research topic for ad-hoc Wireless Sensor Networks (WSN). Power saving makes it possible to guarantee basic levels of system performance, such as connectivity, throughput and delay, in the presence of both mobility-immobility and a large number of sensor nodes. A large variety of approaches for intelligent energy-efficient schemes have been proposed in the literature focusing on different performance metrics. This article presents a comprehensive survey of recent energy-efficient schemes in ad-hoc wireless sensor networks, the application of which increases nodes’ lifetime and thus, network connectivity and survivability.",
            "Abstract entirety": 1,
            "Author pub id": "bP0fRIEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Boston, MA"
        }
    ]
}]