[{
    "name": "Δημήτριος Ιακωβίδης",
    "romanize name": "Dimitrios Iakovidis",
    "School-Department": "Πληροφορικής με Έμφαση στη Βιοϊατρική",
    "University": "uth",
    "Rank": " Καθηγητής",
    "Apella_id": 4686,
    "Scholar name": "Dimitris Iakovidis",
    "Scholar id": "Jg1ZJ1wAAAAJ",
    "Affiliation": "Professor of Signal Processing and Medical Decision Support Systems, University of Thessaly, Greece",
    "Citedby": 4421,
    "Interests": [
        "Signal/image processing",
        "pattern recognition and machine learning",
        "data mining",
        "software",
        "biomedical & other applications"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Jg1ZJ1wAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Computer-aided thyroid nodule detection in ultrasound images",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1467702/",
            "Abstract": "Nodular thyroid disease is a frequent occurrence in clinical practice and it is associated with increased risk of thyroid cancer and hyperfunction. In this paper we propose a novel method for computer-aided detection of thyroid nodules in ultrasound (US) images. The proposed method is based on a level-set image segmentation approach that takes into account the inhomogeneity of the US images. This novel method was experimentally evaluated using US images acquired from 35 patients. The results show that the proposed method achieves more accurate delineation of the thyroid nodules in the US images and faster convergence than other relevant methods.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cascading support vector machines system for gene expression data classification",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1344758/",
            "Abstract": "Microarray technology provides the ability of monitoring the gene expression levels of thousands of genes in parallel. Gene expression data classification applies for diseases' diagnosis or prediction. We propose an intelligent system for the classification of multiclass gene expression data. It is based on a cascading support vector machines (SVM) scheme and utilizes Welch's t-test for the detection of differentially expressed genes. The system was applied for the discrimination of normal and lung cancer subtypes' specimens. The overall accuracy achieved was 98.5%. The results show that the proposed system can be efficiently used for microarray data analysis.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ontology-based automatic image annotation exploiting generalized qualitative spatial semantics",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30448-4_38",
            "Abstract": "Ontologies provide a formal approach to knowledge representation suitable for digital content annotation. In the context of image annotation a variety of ontology-based tools has been proposed. Most of them enable manual annotation of the images with higher level concepts whereas many of them are capable of formally representing low-level features as well. However, they either consider specific, usually quantitative, representations of the low-level features, or spatial semantics limited to 2D/3D image spaces. In this paper we propose a novel ontology-based methodology for automatic image annotation that exploits generalized qualitative spatial relations between objects, given an image domain. To represent knowledge for the spatial arrangements, we have implemented an ontology that models spatial relations in multi-dimensional vector spaces. The application of the proposed methodology is …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On Predicting Bottlenecks in Wavefront Parallel Video Coding Using Deep Neural Networks",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20257-6_43",
            "Abstract": "Video coding incurs high computational complexity particularly at the encoder side. For this reason, parallelism is used at the various encoding steps. One of the popular coarse grained parallelization tools offered by many standards is wavefront parallelism. Under the scheme, each row of blocks is assigned to a separate thread for processing. A thread might commence encoding a particular block once certain precedence constraints are met, namely, it is required that the left block of the same row and the top and top-right block of the previous row have finished compression. Clearly, the imposed constraints result in processing delays. Therefore, in order to optimize performance, it is of paramount importance to properly identify potential bottlenecks before the compression of a frame starts, in order to alleviate them through better resource allocation. In this paper we present a simulation model that predicts …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:uQdrZ3qaPmcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Enhanced CNN-Based Gaze Estimation on Wireless Capsule Endoscopy Images",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9474669/",
            "Abstract": "Wireless capsule endoscopy (WCE) is a modality used for the non-invasive examination of the gastrointestinal (GI) tract. Physicians diagnose pathologies in images derived from Capsule Endoscopy (CE) using specific gaze patterns to observe pathologically related visual cues. Lately, deep learning has advanced in the domain of human eye-fixation estimation in natural images. However, the potentials of predicting the eye related patterns, such as eye fixations, in medical images has not been thoroughly investigated. In this work, we propose a CNN auto-encoder model, that is capable of predicting saliency maps estimating the gaze-patterns, in terms of eye-fixations, of physicians in CE images. The proposed model outperforms other approaches for visual saliency estimation based on physicians' eye fixation by providing an AUC-J of 0.726 among CE images depicting various pathological and normal cases.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:QZWLLlSfqgYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Weakly-supervised convolutional learning for detection of inflammatory gastrointestinal lesions",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7738279/",
            "Abstract": "Graphic image annotations provide the necessary ground truth information for supervised machine learning in image-based computer-aided medical diagnosis. Performing such annotations is usually a time-consuming and cost-inefficient process requiring knowledge from domain experts. To cope with this problem we propose a novel weakly-supervised learning method based on a Convolutional Neural Network (CNN) architecture. The advantage of the proposed method over conventional supervised approaches is that only image-level semantic annotations are used in the training process, instead of pixel-level graphic annotations. This can drastically reduce the required annotation effort. Its advantage over the few state-of-the-art weakly-supervised CNN architectures is its simplicity. The performance of the proposed method is evaluated in the context of computer-aided detection of inflammatory gastrointestinal …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:PuYkdpj8xa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Noise-robust statistical feature distributions for texture analysis",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080740/",
            "Abstract": "A novel image feature extraction methodology is proposed in this study. By incorporating fuzzy logic into the well-established Local Binary Pattern (LBP) approach we derive statistical feature distributions suitable for noise-robust texture representation. The proposed Fuzzy Local Binary Pattern (FLBP) approach is based on the assumption that a local image neighbourhood may be characterized by more than a single binary pattern. The effectiveness of the proposed methodology is demonstrated by classification experiments on noise degraded Brodatz textures. The classification performance obtained with the FLBP features was higher than the one obtained with the original LBP features for various noise levels.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special focus on optical measurement methods for health and related applications",
            "Publication year": 2020,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6501/aba37f/meta",
            "Abstract": "Optical measurements are performed using sensors that are sensitive to light of different wavelengths. They are becoming popular due to their advantages, which include contactless and, usually, cost-effective application. This special issue explores novel optical measurement methods and applications in health, healthcare, and other related domains. It identifies significant technology gaps, needs and challenges, and focuses on technologies of high socioeconomic impact. To address the challenge of early detection of malignant neoplasias, Braun et al [1] present a novel system for the optical measurement of changes in biochemical, physical-morphological and colorimetric values of tissues. These measurements can be used for the differentiation between healthy, marginal, and malignant tissues. The measurement methodology relies on the combination of several spectral methods, including ultraviolet/visible …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:4pF9x-cDGsoC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Artificial intelligence in small bowel capsule endoscopy‐current status, challenges and future promise",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/jgh.15341",
            "Abstract": "Neural network‐based solutions are under development to alleviate physicians from the tedious task of small‐bowel capsule endoscopy reviewing. Computer‐assisted detection is a critical step, aiming to reduce reading times while maintaining accuracy. Weakly supervised solutions have shown promising results; however, video‐level evaluations are scarce, and no prospective studies have been conducted yet. Automated characterization (in terms of diagnosis and pertinence) by supervised machine learning solutions is the next step. It relies on large, thoroughly labeled databases, for which preliminary “ground truth” definitions by experts are of tremendous importance. Other developments are under ways, to assist physicians in localizing anatomical landmarks and findings in the small bowel, in measuring lesions, and in rating bowel cleanliness. It is still questioned whether artificial intelligence will enter the …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:gYnLYBw1zZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Staircase detection using a lightweight look-behind fully convolutional neural network",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20257-6_45",
            "Abstract": " Staircase detection in natural images has several applications in the context of robotics and visually impaired navigation. Previous works are mainly based on handcrafted feature extraction and supervised learning using fully annotated images. In this work we address the problem of staircase detection in weakly labeled natural images, using a novel Fully Convolutional neural Network (FCN), named LB-FCN light. The proposed network is an enhanced version of our recent Look-Behind FCN (LB-FCN), suitable for deployment on mobile and embedded devices. Its architecture features multi-scale feature extraction, depthwise separable convolutions and residual learning. To evaluate its computational and classification performance, we have created a weakly-labeled benchmark dataset from publicly available images. The results from the experimental evaluation of LB-FCN light indicate its advantageous …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:nnITTVbzT6kC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "LBP-guided active contours",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016786550800072X",
            "Abstract": "This paper investigates novel LBP-guided active contour approaches to texture segmentation. The local binary pattern (LBP) operator is well suited for texture representation, combining efficiency and effectiveness for a variety of applications. In this light, two LBP-guided active contours have been formulated, namely the scalar-LBP active contour (s-LAC) and the vector-LBP active contour (v-LAC). These active contours combine the advantages of both the LBP texture representation and the vector-valued active contour without edges model, and result in high quality texture segmentation. s-LAC avoids the iterative calculation of active contour equation terms derived from textural feature vectors and enables efficient, high quality texture segmentation. v-LAC evolves utilizing regional information encoded by means of LBP feature vectors. It involves more complex computations than s-LAC but it can achieve higher …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:W7OEmFMy1HYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Fusion of multimodal temporal clinical data for the retrieval of similar patient cases",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6079049/",
            "Abstract": "The temporal evolution of the patient is a key factor in providing an effective healthcare. Moreover, comparing a patient case with other cases having a similar progress in time can prove valuable for medical decision making. However, the large amounts of complex temporal clinical data are not always considered by clinicians in the clinical information process. In this work, a computational framework is proposed for the comparison of multimodal temporal clinical data obtained from different patients. The purpose of the proposed framework is to use a patient's temporal evolution so as to retrieve the most similar profiles from large repositories which can be used to compare treatments, diagnosis, test results and other information. This is achieved by retrieving similar temporal patterns from the data by being based on a sequence similarity scheme. The similarity between the patient cases is assessed by a novel fusion …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "IntraClusTSP—An incremental intra-cluster refinement heuristic algorithm for symmetric travelling salesman problem",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/369548",
            "Abstract": "The Symmetric Traveling Salesman Problem (sTSP) is an intensively studied NP-hard problem. It has many important real-life applications such as logistics, planning, manufacturing of microchips and DNA sequencing. In this paper we propose a cluster level incremental tour construction method called Intra-cluster Refinement Heuristic (IntraClusTSP). The proposed method can be used both to extend the tour with a new node and to improve the existing tour. The refinement step generates a local optimal tour for a cluster of neighbouring nodes and this local optimal tour is then merged into the global optimal tour. Based on the performed evaluation tests the proposed IntraClusTSP method provides an efficient incremental tour generation and it can improve the tour efficiency for every tested state-of-the-art methods including the most efficient Chained Lin-Kernighan refinement algorithm. As an application example, we apply IntraClusTSP to automatically determine the optimal number of clusters in a cluster analysis problem. The standard methods like Silhouette index, Elbow method or Gap statistic method, to estimate the number of clusters support only partitional (single level) clustering, while in many application areas, the hierarchical (multi-level) clustering provides a better clustering model. Our proposed method can discover hierarchical clustering structure and provides an outstanding performance both in accuracy and execution time. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:qt-6tCTBDsQC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Automatic lesion detection in capsule endoscopy based on color saliency: closer to an essential adjunct for reviewing software",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0016510714018616",
            "Abstract": "The advent of wireless capsule endoscopy (WCE) has revolutionized the diagnostic approach to small-bowel disease. However, the task of reviewing WCE video sequences is laborious and time-consuming; software tools offering automated video analysis would enable a timelier and potentially a more accurate diagnosis.To assess the validity of innovative, automatic lesion-detection software in WCE.A color feature-based pattern recognition methodology was devised and applied to the aforementioned image group.This study was performed at the Royal Infirmary of Edinburgh, United Kingdom, and the Technological Educational Institute of Central Greece, Lamia, Greece.A total of 137 deidentified WCE single images, 77 showing pathology and 60 normal images.The proposed methodology, unlike state-of-the-art approaches, is capable of detecting …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:aVq8r21TQD4C",
            "Publisher": "Mosby"
        },
        {
            "Title": "A generalized architecture for efficient multi-segment logarithm approximation",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/48322029/A_generalized_architecture_for_efficient20160825-986-u18vdj.pdf",
            "Abstract": "This paper presents a novel hardware architecture for the approximation of the base-2 logarithm of integers at a high accuracy and with low resource requirements. The generalized piecewise linear approximation approach allows the utilization of a very large number of linear segments for the approximation of the logarithm function, whereas state of the art architectures are limited to a maximum of six segments. In the proposed implementation, up to 1024 linear segments are employed. The exploitation of the capabilities of modern FPGAs, such as large BlockRAMs and fast multipliers allow a high frequency potential combined with low resource requirements, resulting in a pipelined implementation that only requires up to 329 slices, one BlockRAM and one multiplier. The selected number of segments affects the approximation error, which is lower than the comparable architectures by up to five orders of magnitude. The properties of the proposed architecture render it suitable for use as a generic component in systems that require fast, accurate and resource-efficient logarithm calculation.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:hMod-77fHWUC",
            "Publisher": "Department of Informatics and Telecommunications, University of Athens. The 7th International Conference on Computing, Communications and Control Technologies (CCCT)"
        },
        {
            "Title": "Bimodal texture segmentation with the Lee-Seo model",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74260-9_22",
            "Abstract": "This paper presents a novel approach to bimodal texture segmentation. The proposed approach features a local binary pattern-based scheme to transform bimodal textures into bimodal gray-scale intensities, segmentable by the Lee-Seo active contour model. This process avoids the iterative calculation of active contour equation terms derived from textural feature vectors, thus reducing the associated computational overhead. The proposed approach is region-based and invariant to the initialization of the level-set function, as it converges to a stationary global minimum. It is experimentally validated on 18 composite texture images of the Brodatz album, obtaining high quality segmentation results, whereas the convergence times are up to an order of magnitude smaller than the ones reported for other active contour approaches for texture segmentation.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "User-centered system design for assisted navigation of visually impaired individuals in outdoor cultural environments",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10209-020-00764-1",
            "Abstract": "The marginalization of people with disabilities, such as visually impaired individuals (VIIs), has driven scientists to take advantage of the fast growth of smart technologies and develop smart assistive systems (SASs) to bring VIIs back to social life, education and even to culture. Our research focuses on developing a human–computer interactive system that will guide VIIs in outdoor cultural environments by offering universal access to cultural information, social networking and safe navigation among other services. The VI users interact with computer-based SAS to control the system during its operation, while having access to remote connection with non-VIIs for external guidance and company. The development of such a system needs a user-centered design (UCD) that incorporates the elicitation of the necessary requirements for a satisfying operation for the VI users. In this paper, we present a novel SAS …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:Ui_nyea79ooC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Towards the construction of intuitionistic fuzzy cognitive maps for medical decision making",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5394371/",
            "Abstract": "FCMs are appropriate to explicitly encode the knowledge and experience accumulated on the operation of a complex system. Once constructed for a particular domain, an FCM allows a qualitative simulation of the system. In this paper, we investigate a first approach to introduce intuitionistic fuzzy logic into the construction process of FCMs for improved medical decision making. The theory of intuitionistic fuzzy sets provides a sound mathematical model suitable for modeling the imprecision that is inherent in real world problems. It is employed to the step where the fuzzy if-then rules are used for the determination of cause-effect relationships assigning linguistic weights among the concepts. The novel intuitionistic FCM proposed in this paper are implemented by introducing a factor of hesitancy into the weights of a standard FCM. This factor provides an additional cue on the cause-effect relationships among concepts …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless endoscopy in 2020: Will it still be a capsule?",
            "Publication year": 2015,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc4419052/",
            "Abstract": "Currently, the major problem of all existing commercial capsule devices is the lack of control of movement. In the future, with an interface application, the clinician will be able to stop and direct the device into points of interest for detailed inspection/diagnosis, and therapy delivery. This editorial presents current commercially-available new designs, European projects and delivery capsule and gives an overview of the progress required and progress that will be achieved-according to the opinion of the authors-in the next 5 year leading to 2020.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:H-3wYkpcA84C",
            "Publisher": "Baishideng Publishing Group Inc"
        },
        {
            "Title": "Detecting and locating gastrointestinal anomalies using deep learning and iterative cluster unification",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8359121/",
            "Abstract": "This paper proposes a novel methodology for automatic detection and localization of gastrointestinal (GI) anomalies in endoscopic video frame sequences. Training is performed with weakly annotated images, using only image-level, semantic labels instead of detailed, and pixel-level annotations. This makes it a cost-effective approach for the analysis of large videoendoscopy repositories. Other advantages of the proposed methodology include its capability to suggest possible locations of GI anomalies within the video frames, and its generality, in the sense that abnormal frame detection is based on automatically derived image features. It is implemented in three phases: 1) it classifies the video frames into abnormal or normal using a weakly supervised convolutional neural network (WCNN) architecture; 2) detects salient points from deeper WCNN layers, using a deep saliency detection algorithm; and 3) localizes …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:2u1QkWOsl3MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MonoSOD: Monocular Salient Object Detection based on Predicted Depth",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9561211/",
            "Abstract": "Salient object detection (SOD) can directly improve the performance of tasks like obstacle detection, semantic segmentation and object recognition. Such tasks are important for robotic and other autonomous navigation systems. State-of-the-art SOD methodologies, provide improved performance by incorporating depth information, usually acquired using additional specialized sensors, e.g., RGB-D cameras. This introduces an overhead to the overall cost and flexibility of such systems. Nevertheless, the recent advances of machine learning, have provided models, capable of generating depth map approximations, given a single RGB image. In this work, we propose a novel monocular SOD (MonoSOD) methodology, based on a two-branch CNN autoencoder architecture capable of predicting depth maps and estimating saliency through a trainable refinement scheme. Its application on benchmark datasets, indicates …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:dBzKUGQurMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FPGA architecture for fast parallel computation of co-occurrence matrices",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014193310600038X",
            "Abstract": "This paper presents a novel architecture for fast parallel computation of co-occurrence matrices in high throughput image analysis applications for which time performance is critical. The architecture was implemented on a Xilinx Virtex-XCV2000E-6 FPGA using VHDL. The symmetry and sparseness of the co-occurrence matrices are exploited to achieve improved processing times, and smaller, flexible area utilization as compared with the state of the art. The performance of the proposed architecture is evaluated using input images of various dimensions, in comparison with an optimized software implementation running on a conventional general purpose processor. Simulations of the architecture on contemporary FPGA devices show that it can deliver a speedup of two orders of magnitude over software.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A laser-scanning endoscope based on polysilicon micromachined mirrors with enhanced attributes",
            "Publication year": 2003,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ecbo-2003-5143_145",
            "Abstract": "A miniaturized laser scanning endoscope is presented which makes use of three lasers to illuminate a sample with a red, a green and a blue wavelength simultaneously. Scattered light from the sample is descanned and chromatically separated into the three channels for detection and postprocessing to compose a color image. The scanning subsystem consists of two micro-electro-mechanical mirrors suitable for mass production. The endoscope head can be assembled fast and at low cost. A resolution of the order of 16 lines per mm is achieved for a working distance common in endoscopy. Considerations of the system design include the operation of the mico mirrors, the filtering of reflected light by using polarization effects and a strategy to cope with color metamery. An expert system based on a neural network was found able to analyze endoscopic images to identify suspicious lesions.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Intelligent Analysis of Genomic Measurements",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Stavros-Karkanis/publication/230689630_Intelligent_Analysis_of_Genomic_Measurements/links/09e4150cb75491b378000000/Intelligent-Analysis-of-Genomic-Measurements.pdf",
            "Abstract": "In this paper we propose a methodology for intelligent analysis of genomic measurements. It is based on a sequential scheme of Support Vector Machines and it can be used for class prediction of multiclass genomic samples. The proposed methodology was evaluated using two lung cancer datasets. The results are comparable and in many cases higher to the accuracy of relevant methodologies that have been proposed in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An active contour model guided by LBP distributions",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11864349_18",
            "Abstract": "The use of active contours for texture segmentation seems rather attractive in the recent research, indicating that such methodologies may provide more accurate results. In this paper, a novel model for texture segmentation is presented, combining advantages of the active contour approach with texture information acquired by the Local Binary Pattern (LBP) distribution. The proposed LBP scheme has been formulated in order to capture regional information extracted from distributions of LBP values, characterizing a neighborhood around each pixel, instead of using a single LBP value to characterize each pixel. The log-likelihood statistic is employed as a similarity measure between the LBP distributions, resulting to more detailed and accurate segmentation of texture images.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:mB3voiENLucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Intuitionistic fuzzy cognitive maps",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6275486/",
            "Abstract": "Uncertainty and imprecision characterize human cognitive and reasoning processes. Fuzzy cognitive maps (FCMs) are computationally simple yet effective structures to approximately model and simulate such processes. A limitation of current FCMs is that they are unable to model the hesitancy introduced into a complex system due to imperfect facts, missing information, and indecision. To cope with this issue, we propose a novel extension of the FCM model which is based on the theory of intuitionistic fuzzy sets. This intuitionistic FCM (iFCM) model, which is denoted as iFCM-II, inherently exploits the mathematical framework of intuitionistic fuzzy sets for the definition of the concepts constituting the cognitive map and their interrelations, as well as for reasoning. Furthermore, unlike the previous iFCM model, which is denoted as iFCM-I, it enables an intuitionistic estimation of hesitancy at the output concepts, thus …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unsupervised SVM-based gridding for DNA microarray images",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895611109001165",
            "Abstract": "This paper presents a novel method for unsupervised DNA microarray gridding based on support vector machines (SVMs). Each spot is a small region on the microarray surface where chains of known DNA sequences are attached. The goal of microarray gridding is the separation of the spots into distinct cells. The positions of the spots on a DNA microarray image are first detected using image analysis operations and then a set of soft-margin linear SVM classifiers is used to estimate the optimal layout of the grid lines in the image. Each grid line is the separating line produced by one of the SVM classifiers, which maximizes the margin between two consecutive rows or columns of spots. The classifiers are trained using the spot locations as training vectors. The proposed method was evaluated on reference microarray images containing more than two million spots in total. The results illustrate its robustness in the …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:_kc_bZDykSQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A comparative study of color-texture image features",
            "Publication year": 2005,
            "Publication url": "http://rtsimage.di.uoa.gr/pythagoras/publications/2600_CV_DIMOSIEYSEIS_SYNEDRIA_IWSSIP_2005.pdf",
            "Abstract": "In this work we compare two spatial and two wavelet-domain feature extraction methods that have been proposed in the recent literature for color-texture classification. The corresponding color-texture features, namely the Opponent-Color Local Binary Pattern distributions, the Chromaticity Moments, the Wavelet Correlation Signatures and the Color Wavelet Covariance features, are extracted in RGB, I1I2I3, HSV and CIE-Lab color spaces. The classification task is realized by Support Vector Machines. Experiments are performed on two standard datasets comprising of 54 and 68 textures from the Vistex and the Outex databases respectively. The results show that in most cases color enhances texture classification. Both spatial and wavelet features can lead to an accurate representation of color-textures. The appropriateness of a color-texture feature extraction method has to be determined by considering the trade-off between the accuracy and the feature space dimensionality needs, as these are imposed by a prospective application.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Open-Access Framework for Efficient Object-Oriented Development of Video Analysis Software",
            "Publication year": 2014,
            "Publication url": "https://www.scirp.org/html/12-9301921_48124.htm",
            "Abstract": "The increasing use of digital video everyday in a multitude of electronic devices, including mobile phones, tablets and laptops, poses the need for quick development of cross-platform video software. However current approaches to this direction usually require a long learning curve, and their development lacks standardization. This results in software components that are difficult to reuse, and hard to maintain or extend. In order to overcome such issues, we propose a novel object-oriented framework for efficient development of software systems for video analysis. It consists of a set of four abstract components, suitable for the implementation of independent plug-in modules for video acquisition, preprocessing, analysis and output handling. The extensibility of each module can be facilitated by sub-modules specifying additional functionalities. This architecture enables quick responses to changes and re-configurability; thus conforming to the requirements of agile software development practices. Considering the need for platform independency, the proposed Java Video Analysis (JVA) framework is implemented in Java. It is publicly available through the web as open-access software, supported by a growing collection of implemented modules. Its efficiency is empirically validated for the development of a representative video analysis system.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:rUnQDpM0TEQC",
            "Publisher": "Scientific Research Publishing"
        },
        {
            "Title": "Weakly-supervised lesion detection in video capsule endoscopy based on a bag-of-colour features model",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-54057-3_9",
            "Abstract": "Robotic video capsule endoscopy (VCE) is a rapidly evolving medical imaging technology enabling more thorough examination and treatment of the gastrointestinal tract than conventional endoscopy technologies. Despite of the technological advances in this field, the reviewing of the large VCE image sequences remains manual and challenges experts’ diagnostic capabilities. Video reviewing systems for automated lesion detection are still under investigation. Most of these systems are based on supervised machine learning algorithms, which require a training set of images, manually annotated by the experts to indicate which pixels correspond to lesions. In this paper, we investigate a weakly-supervised approach for lesion detection, which requires image-level instead of pixel-level annotations for training. Such an approach offers a considerable advantage with respect to the efficiency of the annotation …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:0qX8s2k1IRwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Automatic DNA microarray gridding based on Support Vector Machines",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4696795/",
            "Abstract": "This paper presents a novel method for DNA microarray gridding based on support vector machine (SVM) classifiers. It employs a set of soft-margin SVMs to estimate the lines of the DNA microarray grid by maximizing the margin between the lines and the spots. This process comprises an efficient and effective approach of separating the spots into distinct rows and columns. The classifiers are trained using the spot locations as training vectors. The results obtained from the application of the proposed method on reference microarray images illustrate its robustness in the presence of artifacts, noise and weakly expressed spots. The comparative evaluation presented reveals its advantageous performance over a state of the art gridding approach. The gridding quality achieved exceeds 95% in terms of the total number of perfectly gridded spots.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Imaging systems and techniques 2011",
            "Publication year": 2012,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/23/11/110101/meta",
            "Abstract": "This special feature on Imaging Systems and Techniques comprises 11 papers, covering essential facets in imaging systems and techniques both in theory and applications, from research groups in three different continents. It mainly contains peer-reviewed articles from the IEEE International Conference on Imaging Systems and Techniques (IST 2011), held in Batu Ferringi, Penang, Malaysia, as well a number of articles relevant to the scope of this issue.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Detection of lesions in endoscopic video using textural descriptors on wavelet domain supported by artificial neural network architectures",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958623/",
            "Abstract": "Video processing for classification applications in medical imaging is an area with great importance. In this paper a framework for classification of suspicious lesions using the video produced during an endoscopic session is presented. The proposed approach is based on a feature extraction scheme that uses second order statistical information of the wavelet transformation. These features are used as input to a multilayer feedforward neural network (MFNN) architecture, which has been trained using features of normal and tumor regions. The system uses a limited number of frames with a rather small population of training vectors. The classification results are promising, since the system has been proven to be capable to classify and locate regions, that correspond to lesions with a success of 94 up to 99%, in a sequence of the video-frames. The proposed methodology can be used as a valuable diagnostic tool that …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Obstacle detection based on generative adversarial networks and fuzzy sets for computer-assisted navigation",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20257-6_46",
            "Abstract": "Obstacle detection addresses the detection of an object, of any kind, that interferes with the canonical trajectory of a subject, such as a human or an autonomous robotic agent. Prompt obstacle detection can become critical for the safety of visually impaired individuals (VII). In this context, we propose a novel methodology for obstacle detection, which is based on a Generative Adversarial Network (GAN) model, trained with human eye fixations to predict saliency, and the depth information provided by an RGB-D sensor. A method based on fuzzy sets are used to translate the 3D spatial information into linguistic values easily comprehensible by VII. Fuzzy operators are applied to fuse the spatial information with the saliency information for the purpose of detecting and determining if an object may interfere with the safe navigation of the VII. For the evaluation of our method we captured outdoor video sequences …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:rAN7mHg6NlYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Measuring the relative extent of pulmonary infiltrates by hierarchical classification of patient-specific image features",
            "Publication year": 2011,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/22/11/114017/meta",
            "Abstract": "Pulmonary infiltrates are common radiological findings indicating the filling of airspaces with fluid, inflammatory exudates, or cells. They are most common in cases of pneumonia, acute respiratory syndrome, atelectasis, pulmonary oedema and haemorrhage, whereas their extent is usually correlated with the extent or the severity of the underlying disease. In this paper we propose a novel pattern recognition framework for the measurement of the extent of pulmonary infiltrates in routine chest radiographs. The proposed framework follows a hierarchical approach to the assessment of image content. It includes the following:(a) sampling of the lung fields;(b) extraction of patient-specific grey-level histogram signatures from each sample;(c) classification of the extracted signatures into classes representing normal lung parenchyma and pulmonary infiltrates;(d) the samples for which the probability of belonging to one of …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Optimizing lesion detection in small-bowel capsule endoscopy: from present problems to future solutions",
            "Publication year": 2015,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1586/17474124.2014.952281",
            "Abstract": "This review presents issues pertaining to lesion detection in small-bowel capsule endoscopy (SBCE). The use of prokinetics, chromoendoscopy, diagnostic yield indicators, localization issues and the use of 3D reconstruction are presented. The authors also review the current status (and future expectations) in automatic lesion detection software development. Automatic lesion detection and reporting, and development of an accurate lesion localization system are the main software challenges of our time. The ‘smart’, selective and judicious use (before as well as during SBCE) of prokinetics in combination with other modalities (such as real time and/or purge) improves the completion rate of SBCE. The tracking of the capsule within the body is important for the localization of abnormal findings and planning of further therapeutic interventions. Currently, localization is based on transit time. Recently proposed software …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:DTjSuSUbmXsC",
            "Publisher": "Informa Healthcare"
        },
        {
            "Title": "An intelligent system for automatic detection of gastrointestinal adenomas in video endoscopy",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010482505000983",
            "Abstract": "Today 95% of all gastrointestinal carcinomas are believed to arise from adenomas. The early detection of adenomas could prevent their evolution to cancer. A novel system for the support of the detection of adenomas in gastrointestinal video endoscopy is presented. Unlike other systems, it accepts standard low-resolution video input thus requiring less computational resources and facilitating both portability and the potential to be used in telemedicine applications. It combines intelligent processing techniques of SVMs and color–texture analysis methodologies into a sound pattern recognition framework. Concerning the system's accuracy this was measured using ROC analysis and found to exceed 94%.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Deep endoscopic visual measurements",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:FKYJxdYMdFIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computational characterization of thyroid tissue in the radon domain",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4262648/",
            "Abstract": "This paper investigates a novel computational approach to thyroid tissue characterization in ultrasound images. It is based on the hypothesis that tissues in thyroid ultrasound images may be differentiated by directionality patterns. These patterns may not be always distinguishable by the human eye because of the dominant image noise. The encoding of the directional patterns in the thyroid ultrasound images is realized by means of radon transform features. A representative set of ultrasound images, acquired from 66 patients was constructed to perform experiments that test the validity of the initial hypothesis. Supervised classification experiments showed that the proposed approach is capable of discriminating normal and nodular thyroid tissues, whereas nodular tissues can be further characterized as of high or low malignancy risk.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "MetaOn-Ontology driven metadata construction and management for intelligent search in text and image collections",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1698384/",
            "Abstract": "State of the art in multimedia technology focuses in managing data collected from various sources, including documents, images, video, and speech. Therefore the effective management, analysis and mining of such heterogeneous data require the combination of various techniques. In this paper, we present an overview of the funded MetaOn project. The core objective of MetaOn is to construct and integrate semantically rich metadata collections extracted from documents, images and linguistic resources, to facilitate intelligent search and analysis. The proposed MetaOn framework involves ontology-based information extraction and data mining, semi-automatic construction of domain specific ontologies, content-based image indexing and retrieval, and metadata management. The Hellenic history has been chosen as a challenging application case study",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy local binary patterns for ultrasound texture characterization",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-69812-8_74",
            "Abstract": "B-scan ultrasound provides a non-invasive low-cost imaging solution to primary care diagnostics. The inherent speckle noise in the images produced by this technique introduces uncertainty in the representation of their textural characteristics. To cope with the uncertainty, we propose a novel fuzzy feature extraction method to encode local texture. The proposed method extends the Local Binary Pattern (LBP) approach by incorporating fuzzy logic in the representation of local patterns of texture in ultrasound images. Fuzzification allows a Fuzzy Local Binary Pattern (FLBP) to contribute to more than a single bin in the distribution of the LBP values used as a feature vector. The proposed FLBP approach was experimentally evaluated for supervised classification of nodular and normal samples from thyroid ultrasound images. The results validate its effectiveness over LBP and other common feature extraction …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Versatile approximation of the lung field boundaries in chest radiographs in the presence of bacterial pulmonary infections",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4696844/",
            "Abstract": "The most common radiographic manifestation of bacterial pulmonary infections are foci of consolidation which are visible as bright shadows interfering with the interior lung intensity. In critically-ill patients this interference can be severe leading to vague or invisible lung field boundaries which are difficultly distinguished even by experienced physicians. This problem is amplified if the radiographs are of low quality as obtained with a portable x-ray device, routinely used in intensive care units. This paper proposes a pioneering methodology that copes with lung field detection in both stationary and portable chest radiographs by combining statistical grey-level intensity information and directional edge maps. The boundaries of the lung fields are approximated by consecutive intuitively manipulated parametric curves. Conventional and state of the art lung field detection approaches address only stationary radiography …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A swarm intelligence graph-based pathfinding algorithm (SIGPA) for multi-objective route planning",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0305054821001350",
            "Abstract": "Personalized tourist route planning (TRP) and navigation are online or real-time applications whose mathematical modeling leads to complex optimization problems. These problems are usually formulated with mathematical programming and can be described as NP hard problems. Moreover, the state-of-the-art (SOA) path search algorithms do not perform efficiently in solving multi-objective optimization (MO) problems making them inappropriate for real-time processing. To address the above limitations and the need for online processing, a swarm intelligence graph-based pathfinding algorithm (SIGPA) for MO route planning was developed. SIGPA generates a population whose individuals move in a greedy approach based on A∗ algorithm to search the solution space from different directions. It can be used to find an optimal path for every graph-based problem under various objectives. To test SIGPA, a generic …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:eJjLl3UG7CkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Ptu-016 wireless capsule endoscope localisation based on visual odometry",
            "Publication year": 2014,
            "Publication url": "https://gut.bmj.com/content/63/Suppl_1/A44.1.abstract",
            "Abstract": "The localisation of a wireless capsule endoscope (WCE) within the small-bowel is typically performed by wearable radiofrequency sensors triangulation. The accuracy of this approach is low.1 Only a few approaches have been proposed for WCE localisation based on visual features. These include methods addressing the estimation of the rotation angle of the capsule2,3 and temporal video segmentation methods.4 We present a WCE localisation method, based only on visual information extracted from conventional WCE recording.Automatic detection of points of interest (POI) in WCE video frames, matching of the detected POI between consecutive frames, and determination of actual correspondences between subsets of these POI based on the random sample consensus (RANSAC) algorithm was performed. Maximally stable extremal regions (MSER) algorithm, instead of the speeded up …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:3jqAvCjcdfEC",
            "Publisher": "BMJ Publishing Group"
        },
        {
            "Title": "Patient specific normalization of chest radiographs and hierarchical classification of bacterial infection patterns",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548501/",
            "Abstract": "The analysis of multiple chest radiographs is prone to errors mainly due to different acquisition settings used in clinical routine and due to patient specific characteristics affecting the distribution of the image intensities. The purpose of this paper is twofold: (a) it proposes a new image normalization technique based on samples extracted from the spinal cord/mediastinum region, in order to reduce the error due to the different settings and the patients' characteristics; (b) it proposes a supervised hierarchical classifier combination scheme fusing knowledge extracted from intensity histograms and Gabor textural features so as to cope with the detection of lung consolidations, and the assessment of their extent. The presence of such consolidations in a chest radiograph is usually an indication of a bacterial pulmonary infection. The experimentation results validate the advantage of the proposed normalization technique …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Active contours guided by echogenicity and texture for delineation of thyroid nodules in ultrasound images",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4663854/",
            "Abstract": "Thyroid nodules are solid or cystic lumps formed in the thyroid gland and may be caused by a variety of thyroid disorders. This paper presents a novel active contour model for precise delineation of thyroid nodules of various shapes according to their echogenicity and texture, as displayed in ultrasound (US) images. The proposed model, named joint echogenicity-texture (JET), is based on a modified Mumford-Shah functional that, in addition to regional image intensity, incorporates statistical texture information encoded by feature distributions. The distributions are aggregated within the functional through new log-likelihood goodness-of-fit terms. The JET model requires only a rough region of interest within the thyroid gland as input and automatically proceeds with precise delineation of the nodules, revealing their shape and size. The performance of the JET model was validated on a range of US images displaying …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ΤND: a thyroid nodule detection system for analysis of ultrasound images and videos",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s10916-010-9588-7",
            "Abstract": "In this paper, we present a computer-aided-diagnosis (CAD) system prototype, named TND (Thyroid Nodule Detector), for the detection of nodular tissue in ultrasound (US) thyroid images and videos acquired during thyroid US examinations. The proposed system incorporates an original methodology that involves a novel algorithm for automatic definition of the boundaries of the thyroid gland, and a novel approach for the extraction of noise resilient image features effectively representing the textural and the echogenic properties of the thyroid tissue. Through extensive experimental evaluation on real thyroid US data, its accuracy in thyroid nodule detection has been estimated to exceed 95%. These results attest to the feasibility of the clinical application of TND, for the provision of a second more objective opinion to the radiologists by exploiting image evidences.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Endoscopic single-image size measurements",
            "Publication year": 2020,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6501/ab803c/meta",
            "Abstract": "In the practice of clinical gastrointestinal endoscopy, precise estimation of the size of a lesion/finding, such as a polyp, is quintessential in diagnosis, eg risk estimation for malignancy. However, various studies confirmed that endoscopic assessment of lesion size has inherent limitations and significant measurement errors. Image-based methods proposed for in-vivo-size measurements, rely on reference objects such as the endoscopic biopsy forceps. The aforementioned problem becomes more challenging in the field of capsule endoscopy, as capsules lack navigation and/or biopsy capabilities. To cope with this problem, we propose a methodology that requires only an endoscopic image—without any need for a reference object—in order to estimate the size of an object of interest in it. The first step in this methodology requires the user to define a linear segment within the image. Then, it takes into consideration …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:9fRKRCJz75UC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A variable background active contour model for automatic detection of thyroid nodules in ultrasound images",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1529676/",
            "Abstract": "A novel active contour model named variable background active contour model is proposed and applied for the detection of thyroid nodules in ultrasound images. The new model offers edge independency, no need for smoothing, ability for topological changes and it is more accurate when compared to the active contour without edges model. Improved accuracy is achieved by introducing as background a limited image subset which appropriately changes shape to reduce the effects of background inhomogeneity. We validated the proposed model on ultrasound images acquired from 24 patients and the results demonstrate an improvement in accuracy when compared to the active contour without edges model.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "HV Shadow Detection Based on Electromagnetism-Like Optimization",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9287686/",
            "Abstract": "Shadow detection is useful in a variety of image analysis applications, as it can improve scene understanding. Most of the recent shadow detection approaches use near-infrared (NIR) cameras and deep learning to provide enhanced segmentation of the shadow areas in images. In this paper a novel shadow detection method is proposed, exploiting the perceptual color representation of the HSV color space and a physics-inspired optimization algorithm for image segmentation. The comparative advantage of this method over the state-of-the-art ones is that its performance is comparable without requiring any special equipment, such as NIR cameras, while it is simpler. Quantitative and qualitative experiments on publicly available datasets in comparison with three state-of-the-art methods, validate its effectiveness.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:x8G803Bi31IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robotic validation of visual odometry for wireless capsule endoscopy",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7738202/",
            "Abstract": "Wireless capsule endoscopy (WCE) is the prime diagnostic modality for the small-bowel. It consists in a swallowable color camera that enables the visual detection and assessment of abnormalities, without patient discomfort. The localization of the capsule is currently performed in the 3D abdominal space using radiofrequency (RF) triangulation. However, this approach does not provide sufficient information for the localization of the capsule, and therefore for the localization of the detected abnormalities, within the gastrointestinal (GI) lumen. To cope with this problem, we have recently proposed a method for visual tracking of the capsule endoscope (CE). It is based solely on visual features extracted from the captured images during the journey of the CE in the GI tract, enabling therefore visual odometry. Due to lack of ex-vivo or in-vivo ground truth data, the feasibility of that method was assessed using relative …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:DOLguN9Lh8sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Color textural features under varying illumination",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1421350/",
            "Abstract": "In this paper, we present a new feature extraction methodology for color texture recognition. It is based on the covariance of 2/sup nd/-order statistical features in the wavelet domain of the color channels of the images and it is named as color wavelet covariance (CWC). The experimentation showed that the CWC features could be used effectively for texture representation even when illumination varies. The use of the linear K-L (Karhunen-Loeve) transformation of the RGB color space for the extraction of the CWC features resulted in a performance that was comparable to the one achieved with more complex non-linear color transformations. The recognition accuracy tested with texture mosaics reached an average of 86%. Using images acquired under varying illumination the performance of the CWC features on the K-L space reached an average of 88%.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Active shape model aided by selective thresholding for lung field segmentation in chest radiographs",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5394326/",
            "Abstract": "Active shape models (ASMs) are statistical, deformable models, exhibiting a remarkable performance for the segmentation of the lung fields in plain chest radiographs. In this paper we propose a novel approach to improving the robustness of the original ASM against weak lung field boundaries, which can cause leaking of the shape's contour into the lung fields. The ASM is shielded against leaking by the prior application of a grey-level selective thresholding scheme that subtracts irrelevant anatomic structures from the radiograph. The proposed approach copes with affine lung field projections and features resistance to the presence of dense external objects used for patient's monitoring and support. Its advantageous performance is demonstrated on a challenging set of chest radiographs obtained from patients with bacterial pulmonary infections.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "UEG Week 2014-Abstract submission",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=17743879726287091305&hl=en&oi=scholarr",
            "Abstract": "AIMS & METHODS: Aim: to check the accuracy of visual odometry in WCE with ex-vivo data. Methods: Automatic detection of points of interest (POI) in WCE video frames, matching of the detected POI between consecutive frames, and determination of actual correspondences between subsets of these POI based on the random sample consensus (RANSAC) algorithm was performed. Instead of the speeded up feature extraction (SURF) algorithm, a maximally stable extremal regions (MSER) algorithm, was used. Based on the scaling & the rotation of the content of the consecutive WCE frames, it is possible to estimate the displacement & the rotation of the capsule within the GI tract. For the ex-vivo experiment; a standard simulated intestinal environment was created. Markers were sewn onto the luminal surface of porcine small-bowel through which a capsule endoscope (MiroCam®, IntroMedic Co Ltd, Seoul, Korea) was propelled. RESULTS: Comparative experiments using both SURF and MSER features, which indicated the superiority of the former over the latter, we conducted. We worked on a corpus of 1070 WCE frames (634 indicating forward motion, 436 indicating backward motion). The accuracy using SURF features was 81.5%(87.2% on forward motion, 73.2% on backward motion), while using MSER was 67.2%(79.8% on forward motion, and 48.9% backward motion). Noteworthy, the proposed algorithm often fails when using MSER (6.7% of frames while< 0.1% when using SURF) and a transform is not estimated due to the lack of adequate correspondences between POI.CONCLUSION: Visual odometry is a promising technique and …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:i6LplTXqhpIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ratsnake: a versatile image annotation tool with application to computer-aided diagnosis",
            "Publication year": 2014,
            "Publication url": "https://www.hindawi.com/journals/tswj/2014/286856/",
            "Abstract": "Image segmentation and annotation are key components of image-based medical computer-aided diagnosis (CAD) systems. In this paper we present Ratsnake, a publicly available generic image annotation tool providing annotation efficiency, semantic awareness, versatility, and extensibility, features that can be exploited to transform it into an effective CAD system. In order to demonstrate this unique capability, we present its novel application for the evaluation and quantification of salient objects and structures of interest in kidney biopsy images. Accurate annotation identifying and quantifying such structures in microscopy images can provide an estimation of pathogenesis in obstructive nephropathy, which is a rather common disease with severe implication in children and infants. However a tool for detecting and quantifying the disease is not yet available. A machine learning-based approach, which utilizes prior domain knowledge and textural image features, is considered for the generation of an image force field customizing the presented tool for automatic evaluation of kidney biopsy images. The experimental evaluation of the proposed application of Ratsnake demonstrates its efficiency and effectiveness and promises its wide applicability across a variety of medical imaging domains.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "KID Project: an internet-based digital video atlas of capsule endoscopy for research purposes",
            "Publication year": 2017,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0043-105488",
            "Abstract": " Background and aims Capsule endoscopy (CE) has revolutionized small-bowel (SB) investigation. Computational methods can enhance diagnostic yield (DY); however, incorporating machine learning algorithms (MLAs) into CE reading is difficult as large amounts of image annotations are required for training. Current databases lack graphic annotations of pathologies and cannot be used. A novel database, KID, aims to provide a reference for research and development of medical decision support systems (MDSS) for CE. Methods Open-source software was used for the KID database. Clinicians contribute anonymized, annotated CE images and videos. Graphic annotations are supported by an open-access annotation tool (Ratsnake). We detail an experiment based on the KID database, examining differences in SB lesion measurement between human readers and a MLA. The Jaccard Index (JI) was used …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:MvIMIWP2nqIC",
            "Publisher": "© Georg Thieme Verlag KG"
        },
        {
            "Title": "Image Segmentation based on Determinative Brain Storm optimization",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9248455/",
            "Abstract": "Brain Storm optimization (BSO) is a swarm-based, metaheuristic for global optimization, which has been inspired by the collective behavior of human beings. In this work, a novel BSO-based variant, Determinative BSO (DBSO), is proposed and applied for image segmentation. The proposed algorithm implements a cluster-merging strategy, inspired by the process of building a consensus among the members of a group with similar “ideas”. It aims to prevent premature convergence and“jumping out” of local optima, in an optimization context for the determination of multiple image thresholds. Experiments on standard benchmark images are presented, which demonstrate that the proposed DBSO-based multilevel thresholding method obtains segmentation results of comparable or higher quality, in less iterations, than the ones obtained by state-of-the-art optimization-based multilevel thresholding methods.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:fixghrsIJ_wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PTU-001 Chromoendoscopy for Angiectasias in Capsule Endoscopy; Blue or Just White?",
            "Publication year": 2016,
            "Publication url": "https://gut.bmj.com/content/65/Suppl_1/A52.abstract",
            "Abstract": "Blue mode (BM) is one of the features of proprietary software (RAPID®; Medtronic Ltd) for capsule endoscopy (CE) review. BM is a colour coefficient shift of light in the short wavelength range (490–430 nm) superimposed onto a white light (WL) image.1 Recently, studies have shown that BM improves visualisation of vascular and erythematous non-vascular CE lesions.1,2 We aimed to objectively evaluate the validity of BM in CE in assessing the surface annotations of angiectasias as compared to WL.A set of 100 anonymised images of angiectasias was used, with the lesions captured both in WL and BM in the same pose. The entire dataset is available in our online database, KID (http://is-innovation.eu/kid). Three reviewers (2 experts and one novice in CE review) graphically annotated the lesions using Ratsnake annotation tool (http://is-innovation.eu/ratsnake). The images were reviewed in …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:LzOrNEA7mwcC",
            "Publisher": "BMJ Publishing Group"
        },
        {
            "Title": "Mining patterns of lung infections in chest radiographs",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-0221-4_25",
            "Abstract": "Chest radiography is a reference standard and the initial diagnostic test performed in patients who present with signs and symptoms suggesting a pulmonary infection. The most common radiographic manifestation of bacterial pulmonary infections is foci of consolidation. These are visible as bright shadows interfering with the interior lung intensities. The discovery and the assessment of bacterial infections in chest radiographs is a challenging computational task. It has been limitedly addressed as it is subject to image quality variability, content diversity, and deformability of the depicted anatomic structures. In this paper, we propose a novel approach to the discovery of consolidation patterns in chest radiographs. The proposed approach is based on non-negative matrix factorization (NMF) of statistical intensity signatures characterizing the densities of the depicted anatomic structures. Its experimental …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Συλλογή και επεξεργασία πολυκαναλικών ιατρικών δεδομένων",
            "Publication year": 2004,
            "Publication url": "https://www.didaktorika.gr/eadd/handle/10442/19908",
            "Abstract": "Με τη συνεισφορά της παρούσας διατριβής, στα πλαίσια του ευρωπαϊκού ερευνητικού προγράμματος MEDEA (Micro-scanning Endoscope with Diagnostic and Enhanced resolution Attributes), σχεδιάστηκε και αναπτύχθηκε ένα πρωτότυπο λογισμικό σύστημα συλλογής κι επεξεργασίας δεδομένων για ένα επίσης πρωτότυπο ενδοσκοπικό σύστημα. Η λειτουργία του ενδοσκοπικού συστήματος βασίζεται στη χρήση μικροκατόπτρων για τη σάρωση του εξεταζομένου ιστού με δέσμη ακτινοβολίας λέιζερ τριών μηκών κύματος. Η συλλογή και ψηφιοποίηση του πολυκαναλικού σήματος που αντιστοιχεί στην οπισθοσκεδαζόμενη ακτινοβολία της δέσμης λέιζερ, υλοποιείται μέσω μιας κάρτας συλλογής δεδομένων υψήσυχνης δειγματοληψίας συνδεδεμένης σε πολυεπεξεργαστικό υπολογιστικό σύστημα. Μελετήθηκαν οι τεχνικές συλλογής δεδομένων που υποστηρίζονται από τη διαθέσιμη κάρτα, με στόχο τη χρήση του μέγιστου ρυθμού δειγματοληψίας. Σχεδιάστηκε και υλοποιήθηκε λογισμικό σύστημα συλλογής δεδομένων βασιζόμενο σε ασύγχρονη καθοδηγούμενη-από-συμβάντα (event-driven) DMA επικοινωνία με το πολυεπεξεργαστικό σύστημα, το οποίο υποστηρίχθηκε από τεχνικές πολυνηματισμού (multithreading). Το λογισμικό που αναπτύχθηκε προσφέρει τη δυνατότητα της προβολής, της επεξεργασίας και της αποθήκευσης των συλλεγόμενων έγχρωμων ενδοσκοπικών εικόνων υψηλής ευκρίνειας σε πραγματικό χρόνο μέσω ενός γραφικού περιβάλλοντος διεπαφής χρήστη. Με στόχο την ενίσχυση των δυνατοτήτων του ενδοσκοπικού συστήματος προς τον αυτόματο εντοπισμό μη φυσιολογικών περιοχών επί του εξεταζόμενου ιστού, μελετήθηκαν μέθοδοι επεξεργασίας και …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:OqYjx1B7R3oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Constructive Fuzzy Representation Model for Heart Data Classification",
            "Publication year": 2021,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/SHTI210111",
            "Abstract": "The early detection of Heart Disease (HD) and the prediction of Heart Failure (HF) via telemonitoring and can contribute to the reduction of patients’ mortality and morbidity as well as to the reduction of respective treatment costs. In this study we propose a novel classification model based on fuzzy logic applied in the context of HD detection and HF prediction. The proposed model considers that data can be represented by fuzzy phrases constructed from fuzzy words, which are fuzzy sets derived from data. Advantages of this approach include the robustness of data classification, as well as an intuitive way for feature selection. The accuracy of the proposed model is investigated on real home telemonitoring data and a publicly available dataset from UCI.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:9w9GTvUEN2YC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A Novel Deformable Model for Medical US Image Segmentation",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.180.4741&rep=rep1&type=pdf",
            "Abstract": "Medical ultrasound (US) images are characterized by inherent noise perturbations which introduce uncertainty in their interpretation even by experienced radiologists. In this paper we propose a novel deformable model for medical US image segmentation, which incorporates a combination of domain and boundary integrals for the alleviation of the noise effects. It can be applied as a diagnostic aid for the delineation of hypo-echoic regions, which in many cases are associated with pathological findings. The proposed model was experimentally evaluated using various types of medical US images. The results show that it leads to more accurate segmentation results whereas it converges faster than other relevant models.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MedGaze: Gaze Estimation on WCE Images Based on a CNN Autoencoder",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8941676/",
            "Abstract": "The interpretation of medical images depends on physicians' experience. Over time, physicians develop their ability to examine the images, and this is usually reflected on gaze patterns they follow to observe visual cues, which lead them to diagnostic decisions. In the context of gaze prediction, graph and machine learning methods have been proposed for the visual saliency estimation on generic images. In this work we preset a novel and robust gaze estimation methodology based on physicians' eye fixations, using convolutional neural networks combined with regularization methods, on medical images taken during Wireless Capsule Endoscopy (WCE). Furthermore, we present a novel dataset of physicians' eye fixation patterns which was used for the training of the neural network model. The model was able to achieve 68.5% Judd's Area Under the receiver operating Characteristic (AUC-J).",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:YanO1q2l3soC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cloud Video Guidance as “Deus ex Machina” for the Visually Impaired",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-16450-8_6",
            "Abstract": "Technological advances in Cloud computing and networking are offering unique opportunities for assisting everyday activities of visually impaired persons. Of particular interest is the capitalization of these technologies in the domain of aiding mobility and environment perception. In this chapter, we describe a generic system architecture design and discuss research and engineering issues toward developing a modular open Cloud platform that can be used in a customized way to match specific activities of visually impaired people. This platform facilitates remote content delivery to support system services, such as complex object/scene recognition and route planning, but also it enables the visually impaired users to connect with remotely located persons for assistance or social interaction. At the core of the proposed framework rests a sensor-based system that streams data, particularly video, for further …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:1pC5hbHeJ6IC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Microarray-MD: A system for exploratory analysis of microarray gene expression data",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169260706001490",
            "Abstract": "In this paper, we present Microarray Medical Data explorer (Microarray-MD), a novel software system that is able to assist in the exploratory analysis of gene expression microarray data. It implements a combination scheme of multiple Support Vector Machines, which integrates a variety of gene selection criteria and allows for the discrimination of multiple diseases or subtypes of a disease. The system can be trained and automatically tune its parameters with the provision of pathologically characterized gene expression data to its input. Given a set of new, uncharacterized, patient's data as input, it outputs a decision on the type or the subtype of a disease. A graphical user interface provides easy access to the system operations and direct adjustment of its parameters. It has been tested on various publicly available datasets. The overall accuracy it achieves was estimated to exceed 90%.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Comparative assessment of feature extraction methods for visual odometry in wireless capsule endoscopy",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010482515001808",
            "Abstract": "Wireless capsule endoscopy (WCE) enables the non-invasive examination of the gastrointestinal (GI) tract by a swallowable device equipped with a miniature camera. Accurate localization of the capsule in the GI tract enables accurate localization of abnormalities for medical interventions such as biopsy and polyp resection; therefore, the optimization of the localization outcome is important. Current approaches to endoscopic capsule localization are mainly based on external sensors and transit time estimations. Recently, we demonstrated the feasibility of capsule localization based—entirely—on visual features, without the use of external sensors. This technique relies on a motion estimation algorithm that enables measurements of the distance and the rotation of the capsule from the acquired video frames. Towards the determination of an optimal visual feature extraction technique for capsule motion estimation …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:v7SMsomtfXcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Evaluation of textural feature extraction schemes for neural network-based interpretation of regions in medical images",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/959008/",
            "Abstract": "A few approaches have been presented in the literature towards the discrimination of texture in medical images. Medical experts proposed that the more valuable information for discriminating among normal and suspicious cancer regions in endoscopic images is the texture of the examined tissue. Texture can be encoded by a number of mathematical descriptors. Three well-known textural descriptors, as well as a new wavelet-based one are used in this paper for an accurate study and evaluation of the methodologies encountered. Experiments conducted include tests with various images from the Brodatz album, as well as interpretation of tissue regions in endoscopic image. In all cases the recognition task is supported by multilayer perceptron type neural network architectures.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A pattern similarity scheme for medical image retrieval",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4487049/",
            "Abstract": "In this paper, we propose a novel scheme for efficient content-based medical image retrieval, formalized according to the PAtterns for Next generation DAtabase systems (PANDA) framework for pattern representation and management. The proposed scheme involves block-based low-level feature extraction from images followed by the clustering of the feature space to form higher-level, semantically meaningful patterns. The clustering of the feature space is realized by an expectation-maximization algorithm that uses an iterative approach to automatically determine the number of clusters. Then, the 2-component property of PANDA is exploited: the similarity between two clusters is estimated as a function of the similarity of both their structures and the measure components. Experiments were performed on a large set of reference radiographic images, using different kinds of features to encode the low-level image …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Novel experimental and software methods for image reconstruction and localization in capsule endoscopy",
            "Publication year": 2018,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0043-121882",
            "Abstract": " Background and study aims Capsule endoscopy (CE) is invaluable for minimally invasive endoscopy of the gastrointestinal tract; however, several technological limitations remain including lack of reliable lesion localization. We present an approach to 3D reconstruction and localization using visual information from 2D CE images. Patients and methods Colored thumbtacks were secured in rows to the internal wall of a LifeLike bowel model. A PillCam SB3 was calibrated and navigated linearly through the lumen by a high-precision robotic arm. The motion estimation algorithm used data (light falling on the object, fraction of reflected light and surface geometry) from 2D CE images in the video sequence to achieve 3D reconstruction of the bowel model at various frames. The ORB-SLAM technique was used for 3D reconstruction and CE localization within the reconstructed model. This algorithm compared pairs …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:0iM-huCvmk0C",
            "Publisher": "© Georg Thieme Verlag KG"
        },
        {
            "Title": "Fuzzy binary patterns for uncertainty-aware texture representation",
            "Publication year": 2011,
            "Publication url": "https://www.raco.cat/index.php/ELCVIA/article/view/308939",
            "Abstract": "The Local Binary Pattern (LBP) representation of textures has been proved useful for a wide range of pattern recognition applications, including texture segmentation, face detection, and biomedical image analysis. The interest of the research community in the LBP texture representation gave rise to plenty of LBP and other binary pattern (BP)-based variations. However, noise sensitivity is still a major concern to their applicability on the analysis of real world images. To cope with this problem we propose a generic, uncertainty-aware methodology for the derivation of Fuzzy BP (FBP) texture models. The proposed methodology assumes that a local neighbourhood can be partially characterized by more than one binary patterns due to noise-originated uncertainty in the pixel values. The texture discrimination capability of four representative FBP-based approaches has been evaluated on the basis of comprehensive classification experiments on three reference datasets of natural textures under various types and levels of additive noise. The results reveal that the FBP-based approaches lead to consistent improvement in texture classification as compared with the original BP-based approaches for various degrees of uncertainty. This improved performance is also validated by illustrative unsupervised segmentation experiments on natural scenes.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-negative matrix factorization for endoscopic video summarization",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_44",
            "Abstract": "Wireless Capsule Endoscopy (WCE) has been introduced as a non-invasive colour imaging technique for the inspection of the small intestin along with the rest of the gastrointestinal tract. Each WCE examination results in a 50,000-frames video that has to be visually inspected frame-by-frame by the doctor and this may be a highly time-consuming task even for the experienced gastroenterologist. In this paper we propose a novel approach that leads to a summarized version of the original video enabling significant reduction in the video assessment time without losing any critical information. It is based on symmetric non-negative matrix factorisation initialized by the fuzzy c-means algorithm and it is supported by non-negative Lagrangian relaxation to extract a subset of video frames containing the most representative scenes from an entire examination. The experimental evaluation of the proposed approach …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:GnPB-g6toBAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Intuitionistic fuzzy cognitive maps for medical decision making",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5640672/",
            "Abstract": "Medical decision making can be regarded as a process, combining both analytical cognition and intuition. It involves reasoning within complex causal models of multiple concepts, usually described by uncertain, imprecise, and/or incomplete information. Aiming to model medical decision making, we propose a novel approach based on cognitive maps and intuitionistic fuzzy logic. The new model, called intuitionistic fuzzy cognitive map (iFCM), extends the existing fuzzy cognitive map (FCM) by considering the expert's hesitancy in the determination of the causal relations between the concepts of a domain. Furthermore, a modification in the formulation of the new model makes it even less sensitive than the original model to missing input data. To validate its effectiveness, an iFCM with 34 concepts representing fuzzy, linguistically expressed patient-specific data, symptoms, and multimodal measurements was …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A genetic approach to spot detection in two-dimensional gel electrophoresis images",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/45629643/A_genetic_approach_to_spot_detection_in_20160514-6732-piock0.pdf",
            "Abstract": "Two-Dimensional Polyacrylamide Gel Electro-phoresis (2D PAGE) is a proteomic technique that allows the analysis of large collections and complex mixtures of proteins. The 2D-PAGE gel images depict protein signals as spots of various intensities and sizes. In this paper, we present a novel approach to unsupervised protein spot detection in 2D-PAGE images based on a genetic algorithm. This approach involves three main steps: a) wavelet-based noise reduction, b) segmentation of the input images into regions around the local maxima of the image intensities, c) detection and model-based quantification of the spots within each region using a genetic algorithm. This algorithm searches within a multidimensional parameter space to determine, in parallel, the parameters of multiple diffusion models that optimally fit the characteristics of possible spots. The detection and quantification of the spots is achieved by superposition of diffusion functions modeling adjacent spots. Experiments with 16-bit 2D-PAGE images show that the proposed method is effective and results in low spurious spot detection rate.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic lesion detection in wireless capsule endoscopy—a simple solution for a complex problem",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7025453/",
            "Abstract": "Wireless capsule endoscopy (WCE) is performed with a swallowable miniature optical endoscope which transmits color images wirelessly during its journey in the gastrointestinal tract. In this paper we present a computationally efficient and effective approach to cope with automatic detection of possible abnormalities in the WCE videos and consequently with the reduction of the time required for the WCE inspection. It involves automatic detection of salient points based on color information and supervised classification of simple color vectors extracted from the neighborhood of each point. The experiments performed aim to determine the optimal color space components for feature extraction, and identification of abnormalities. Main advantages of this approach are its computational efficiency, its sensitivity to detect small lesions, and its generality. The results obtained from experimentation with a dataset with various …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:1l3MdapXzAoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pattern-based retrieval of cultural heritage images",
            "Publication year": 2007,
            "Publication url": "http://isl.cs.unipi.gr/pubs/confs/PCI2007.pdf",
            "Abstract": "Conventional Content-Based Image Retrieval (CBIR) systems make use of similarity measures estimated directly from low-level image features, involving multidimensional and exhaustive, nearest neighbor searching. In this paper we present an image retrieval methodology suited for efficient search in cultural heritage images that utilizes similarity measures defined over higher-level patterns associated with clusters of low-level image features. The similarity between two patterns is estimated as a function of the similarity between both the structure and the measure components of the patterns. We evaluate our system using cultural heritage images derived from the repository of the Foundation of Hellenic World (FHW). For the experiments we use Local Binary Pattern (LBP) and contrast distributions as image features and the results show that the proposed pattern-based approach efficiently retrieves images compared to commonly employed methods.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PTU-018 Automatic Detection Of ‘suspicious’ Capsule Endoscopy Video Segments",
            "Publication year": 2014,
            "Publication url": "https://gut.bmj.com/content/63/suppl_1/a45.1.abstract",
            "Abstract": "Manual review and annotation of a capsule endoscopy (CE) video requires a considerable amount of reviewing time. The diagnostic accuracy of this process may decrease over time due to reviewer tiredness. Recent studies showed an average detection rate – for the clinically significant findings – as low as 40%.1 We present a generic computational framework for automatic detection of abnormalities in CE videos.A CE video (MiroCam®, InrtoMedic Co Ltd, Seoul, Korea), depicting inflammatory changes (aphthae, mucosal breaks, ulcers, erythema) was reviewed and manually annotated by experienced CE reviewer. A total of 1984 frames, containing any pathology, were thumbnailed. The proposed framework considers video frames as members of a vector space represented by their colour information. An unsupervised data reduction algorithm,2 which does not require any prior knowledge …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:ZYLUaBFA95QC",
            "Publisher": "BMJ Publishing Group"
        },
        {
            "Title": "Automatic frame reduction of wireless capsule endoscopy video",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4696805/",
            "Abstract": "Wireless Capsule Endoscopy (WCE) is a non-invasive colour imaging technique that has been introduced for the screening of the gastrointestinal tract and especially the small intestine. WCE is performed by a wireless swallowable endoscopic capsule that transmits more than 50,000 video frames per examination. The visual inspection of the resulting video is a highly time-consuming task even for the experienced gastroenterologist. In this paper we propose a novel WCE video summarization approach which is subsequently evaluated using real world patient data. The proposed approach aims to the reduction of the number of the video frames to be visually inspected so as to enable significant reduction in the video assessment time. It is based on clustering using symmetric non-negative matrix factorization initialized by the fuzzy c-means algorithm and supported by non-negative Lagrangian relaxation to extract a …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent visual localization of wireless capsule endoscopes enhanced by color information",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010482517302895",
            "Abstract": "Wireless capsule endoscopy (WCE) is performed with a miniature swallowable endoscope enabling the visualization of the whole gastrointestinal (GI) tract. One of the most challenging problems in WCE is the localization of the capsule endoscope (CE) within the GI lumen. Contemporary, radiation-free localization approaches are mainly based on the use of external sensors and transit time estimation techniques, with practically low localization accuracy. Latest advances for the solution of this problem include localization approaches based solely on visual information from the CE camera. In this paper we present a novel visual localization approach based on an intelligent, artificial neural network, architecture which implements a generic visual odometry (VO) framework capable of estimating the motion of the CE in physical units. Unlike the conventional, geometric, VO approaches, the proposed one is adaptive to …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:KPAPMsW7zc0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A route planning framework for smart wearable assistive navigation systems",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s42452-020-04038-6",
            "Abstract": "Route planning (RP) enables individuals to navigate in unfamiliar environments. Current RP methodologies generate routes that optimize criteria relevant to the traveling distance or time, whereas most of them do not consider personal preferences or needs. Also, most of the current smart wearable assistive navigation systems offer limited support to individuals with disabilities by providing obstacle avoidance instructions, but often neglecting their special requirements with respect to the route quality. Motivated by the mobility needs of such individuals, this study proposes a novel RP framework for assistive navigation that copes these open issues. The framework is based on a novel mixed 0–1 integer nonlinear programming model for solving the RP problem with constraints originating from the needs of individuals with disabilities; unlike previous models, it minimizes: (1) the collision risk with obstacles …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:z-B63o8J19IC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Dynamic time warping fusion for the retrieval of similar patient cases represented by multimodal time-series medical data",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5687649/",
            "Abstract": "Comparing a patient case with other cases having a similar progress in time can prove valuable for medical decision making. However, as the population under study increases, the complexity of such comparisons can exceed the capabilities of human medical experts, especially when multiple parameters are involved. In this paper we propose a novel computational approach to aid the comparison of multimodal medical data obtained from different time-series patient examinations. The similarity between the patient cases is assessed by a fusion scheme involving the estimation of multiple dynamic time warping distances between temporal sequences of observed medical parameter values. The results obtained from its application on a reference dataset of hepatic infections demonstrated high precision even for low recall rates. Thus, the effectiveness of the proposed approach which is generic renders it applicable …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A semantic model for multimodal data mining in healthcare information systems",
            "Publication year": 2012,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-61499-101-4-574",
            "Abstract": "Electronic health records (EHRs) are representative examples of multimodal/multisource data collections; including measurements, images and free texts. The diversity of such information sources and the increasing amounts of medical data produced by healthcare institutes annually, pose significant challenges in data mining. In this paper we present a novel semantic model that describes knowledge extracted from the lowest-level of a data mining process, where information is represented by multiple features ie measurements or numerical descriptors extracted from measurements, images, texts or other medical data, forming multidimensional feature spaces. Knowledge collected by manual annotation or extracted by unsupervised data mining from one or more feature spaces is modeled through generalized qualitative spatial semantics. This model enables a unified representation of knowledge across …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Announcing the 2019 Measurement Science and Technology Outstanding Paper Awards",
            "Publication year": 2020,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6501/ab7efb/meta",
            "Abstract": "Since 1991, Measurement Science and Technology (MST) has awarded Best Paper prizes. The Editorial Board of this journal believe that such prizes are an opportunity to thank authors for submitting their work, and serves as an integral part of the ongoing quality review of the journal. The current breadth of topical areas that are covered by MST has made it advisable to expand the recognition of excellent publications. Hence, since 2005 the Editorial Board have presented ‘Outstanding Paper Awards’. This year awards were given in the five areas of Measurement Science, Optical and Laser-based Techniques, Sensors and Sensing Systems, Precision Measurement, and Biological, Healthcare and Life Sciences. Although the categories broadly mirror subject sections in the journal, the Editorial Board consider articles from all categories during the selection process.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:MDQ-9Oe3GGUC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Computer-aided tumor detection in endoscopic video using color wavelet features",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1229852/",
            "Abstract": "We present an approach to the detection of tumors in colonoscopic video. It is based on a new color feature extraction scheme to represent the different regions in the frame sequence. This scheme is built on the wavelet decomposition. The features named as color wavelet covariance (CWC) are based on the covariances of second-order textural measures and an optimum subset of them is proposed after the application of a selection algorithm. The proposed approach is supported by a linear discriminant analysis (LDA) procedure for the characterization of the image regions along the video frames. The whole methodology has been applied on real data sets of color colonoscopic videos. The performance in the detection of abnormal colonic regions corresponding to adenomatous polyps has been estimated high, reaching 97% specificity and 90% sensitivity.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "PTH-006 Computer-Aided Lesion Measurement in Capsule Endoscopy Images",
            "Publication year": 2016,
            "Publication url": "https://gut.bmj.com/content/65/Suppl_1/A220.1.abstract",
            "Abstract": "A novel image segmentation algorithm is applied & assessed for lesion size measurements in capsule endoscopy (CE). It is based solely on colour features of CE lesions.The lesion images are available online from KID database (Dataset 1).1 Size reference standards were made by manual annotation. The proposed algorithm uses the CIE-Lab colour representation instead of the standard RGB used in CE.1 The components of this space represent lightness (L), the quantity of red (a > 0) or the quantity of green (-a >0), the quantity of yellow (b > 0) or the quantity of blue (-b >0) of a pixel. Initially, the user specifies a point on the lesion of interest (with a single click). Simple Linear Iterative Clustering (SLIC) is applied to group the pixels of similar colour into contiguous regions, called superpixels.2 Subsequently the superpixels are clustered using the k-means approach into three clusters using …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:n1qY4L4uFdgC",
            "Publisher": "BMJ Publishing Group"
        },
        {
            "Title": "Unsupervised mining of radiografic pulmonary infection patterns",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Iakovidis/publication/230689617_Unsupervised_mining_of_radiografic_pulmonary_infection_patterns/links/5401ac250cf2bba34c1afec8/Unsupervised-mining-of-radiografic-pulmonary-infection-patterns.pdf",
            "Abstract": "This paper presents a novel methodology for unsupervised mining of patterns of pulmonary infections from plain chest radiographs. The methodology is based on a hierarchical scheme of partitional clusterings fusing information represented by non-negative intensity and textural image features. Partitional clustering is realized by factorization of the feature matrices under non-negativity constraints. In order to enhance its clustering performance a dyadic cluster merging approach has been devised. The spatial distribution of the mined radiographic patterns comprises a cue for the assessment of the extent of an infection. The results of the comprehensive experimentation performed show that the proposed approach achieves an accuracy of 94.1%, outperforming both representative unsupervised and supervised mining approaches.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bone fracture identification in x-ray images using fuzzy wavelet features",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8941834/",
            "Abstract": "The fracture detection process is difficult and requires specialized knowledge of the anatomical structures of the area under consideration. X-ray imaging provides images of the body's internal structures. Despite the rapid developments of medical imaging by adding newer imaging techniques such as CT and MRI, the exam of choice to detect bone fractures faster and cheaper is x-ray imaging (radiography). The objective of this study is the automatic detection of fractures in bone x-ray images using an image classification method. The dataset that was used in this study consists of 300 x-ray bone images of upper and lower extremity. In this study, we propose a novel feature extraction and classification methodology for the detection of bone fractures, named Wavelet Fuzzy Phrases (WFP). WFP extracts textural information from different bands of the 2D Discrete Wavelet Transform (DWT) images, which is expressed by …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:6LV2YwJzdtgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sensors, Signal and Image Processing in Biomedicine and Assisted Living",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/1424-8220/20/18/5071/htm",
            "Abstract": "Sensor technologies are crucial in biomedicine, as the biomedical systems and devices used for screening and diagnosis rely on their efficiency and effectiveness. In this context digital signal and image processing methods play an important role in feature or quality enhancement, and compression of the acquired, transmitted, or received biomedical signals and images. Today, smart sensor systems, incorporating such methods, are entering our life through smartphones and other wearable devices to monitor our health status and help us maintain a healthy lifestyle. The impact of such technologies can be even more significant for the elderly, or for people with disabilities, such as the visually impaired. This special issue gathers a broad range of novel contributions on sensors, systems, and signal/image processing methods for biomedicine and assisted living. These include methods for heart, sleep and vital sign measurement [1–5]; human motion-related signal analysis in the context of rehabilitation and tremor assessment [6–8]; assistive systems for color deficient and visually challenged individuals, as well as for wheelchair control by people with motor disabilities [9–12]; and, image and video-based diagnostic systems [13–16].",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:w_ORaKkuc5QC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Enabling distributed summarization of wireless capsule endoscopy video",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548478/",
            "Abstract": "The introduction of distributed or parallel medical video processing is a constant growing need, because despite the large increase of modern workstations computational power, the amount of data in medical videos is growing rapidly increasing the computational needs for processing and mining. In this paper the distributed processing approach of a video summarization technique for endoscopy videos is presented. The paper discusses the implementation details and presents experimental results focusing on the produced speed-ups by the distributed processing model.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ASML: Algorithm-Agnostic Architecture for Scalable Machine Learning",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9389709/",
            "Abstract": "Machine Learning (ML) applications are growing in an unprecedented scale. The development of easy-to-use machine-learning application frameworks has enabled the development of advanced artificial intelligence (AI) applications with only a few lines of self-explanatory code. As a result, ML-based AI is becoming approachable by mainstream developers and small businesses. However, the deployment of ML algorithms for remote high throughput ML task execution, involving complex data-processing pipelines can still be challenging, especially with respect to production ML use cases. To cope with this issue, in this paper we propose a novel system architecture that enables Algorithm-agnostic, Scalable ML (ASML) task execution for high throughput applications. It aims to provide an answer to the research question of how to design and implement an abstraction framework, suitable for the deployment of end-to …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:0klj8wIChNAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cascading SVMS as a tool for medical diagnosis using multi-class gene expression data",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/s0218213006002709",
            "Abstract": "In this paper we propose a novel Support Vector Machines-based architecture for medical diagnosis using multi-class gene expression data. It consists of a pre-processing unit and N-1 sequentially ordered blocks capable of classifying N classes in a cascading manner. Each block embodies both a gene selection and a classification module. It offers the flexibility of constructing block-specific gene expression spaces and hypersurfaces for the discrimination of the different classes. The proposed architecture was applied for medical diagnostic tasks including prostate and lung cancer diagnosis. Its performance was evaluated by using a leave-one-out cross validation approach which avoids the bias introduced by the gene selection process. The results show that it provides high accuracy which in most cases exceeds the accuracy achieved by the popular one-vs-one and one-vs-all SVM combination schemes and …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:hFOr9nPyWt4C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Blood detection in wireless capsule endoscope images based on salient superpixels",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7318466/",
            "Abstract": "Wireless capsule endoscopy (WCE) enables screening of the gastrointestinal (GI) tract with a miniature, optical endoscope packed within a small swallowable capsule, wirelessly transmitting color images. In this paper we propose a novel method for automatic blood detection in contemporary WCE images. Blood is an alarming indication for the presence of pathologies requiring further treatment. The proposed method is based on a new definition of superpixel saliency. The saliency of superpixels is assessed upon their color, enabling the identification of image regions that are likely to contain blood. The blood patterns are recognized by their color features using a supervised learning machine. Experiments performed on a public dataset using automatically selected first-order statistical features from various color components indicate that the proposed method outperforms state-of-the-art methods.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:6ScxedgR18sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improved defect detection in manufacturing using novel multidimensional wavelet feature extraction involving vector quantization and PCA techniques",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Dimitrios-Karras-2/publication/2545865_Support_Vector_Machines_For_Improved_Defect_Detection_In_Manufacturing_Using_Novel_Multidimensional_Wavelet_Feature_Extraction_Involving_Vector_Quantization_and_PCA_Techniques/links/0fcfd505a1372e4be5000000/Support-Vector-Machines-For-Improved-Defect-Detection-In-Manufacturing-Using-Novel-Multidimensional-Wavelet-Feature-Extraction-Involving-Vector-Quantization-and-PCA-Techniques.pdf",
            "Abstract": "This paper aims at investigating a novel solution to the problem of defect detection from images, that can find applications in the design of robust quality control systems for the production of furniture, textile, integrated circuits, etc. The suggested solution focuses on detecting defects from their wavelet transformation and vector quantization related properties of the associated wavelet coefficients. More specifically, a novel methodology is investigated for discriminating defects by applying a supervised neural classification technique, employing a Multilayer Perceptron (MLP) trained with the conjugate gradients algorithm, to innovative multidimensional wavelet based feature vectors. These vectors are extracted from the K-Level 2-D DWT (Discrete Wavelet Transform) transformed original image using Vector Quantization techniques and a Principal Component Analysis (PCA) applied to these wavelet domain quantization vectors. The results of the proposed methodology are illustrated in defective textile images where the defective areas are recognized with higher accuracy than the one obtained by applying two rival feature extraction methodologies. The first one of them uses all the wavelet coefficients derived from the k-Level 2-D DWT, while the second one uses only image intensities characteristics. Both rival methods involve the same classification stage as the proposed feature extraction approach. The promising results herein obtained outline the importance of judicious selection and processing of 2-D DWT wavelet coefficients for industrial pattern recognition applications",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SalSum: Saliency-based Video Summarization using Generative Adversarial Networks",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2011.10432",
            "Abstract": "The huge amount of video data produced daily by camera-based systems, such as surveilance, medical and telecommunication systems, emerges the need for effective video summarization (VS) methods. These methods should be capable of creating an overview of the video content. In this paper, we propose a novel VS method based on a Generative Adversarial Network (GAN) model pre-trained with human eye fixations. The main contribution of the proposed method is that it can provide perceptually compatible video summaries by combining both perceived color and spatiotemporal visual attention cues in a unsupervised scheme. Several fusion approaches are considered for robustness under uncertainty, and personalization. The proposed method is evaluated in comparison to state-of-the-art VS approaches on the benchmark dataset VSUMM. The experimental results conclude that SalSum outperforms the state-of-the-art approaches by providing the highest f-measure score on the VSUMM benchmark.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:m44aUaJR3ikC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An FPGA-based architecture for real time image feature extraction",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1334338/",
            "Abstract": "We propose a novel FPGA-based architecture for the extraction of four texture features using gray level cooccurrence matrix (GLCM) analysis. These features are angular second moment, correlation, inverse difference moment, and entropy. The proposed architecture consists of a hardware and a software module. The hardware module is implemented on Xilinx Virtex-E V2000 FPGA using VHDL. It calculates many GLCMs and GLCM integer features in parallel. The software retrieves the feature vectors calculated in hardware, and performs complementary computations. The architecture was evaluated using standard grayscale images and video clips. The results show that it can be efficiently used in realtime pattern recognition applications.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reduction of capsule endoscopy reading times by unsupervised image mining",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895611109001372",
            "Abstract": "The screening of the small intestine has become painless and easy with wireless capsule endoscopy (WCE) that is a revolutionary, relatively non-invasive imaging technique performed by a wireless swallowable endoscopic capsule transmitting thousands of video frames per examination. The average time required for the visual inspection of a full 8-h WCE video ranges from 45 to 120 min, depending on the experience of the examiner. In this paper, we propose a novel approach to WCE reading time reduction by unsupervised mining of video frames. The proposed methodology is based on a data reduction algorithm which is applied according to a novel scheme for the extraction of representative video frames from a full length WCE video. It can be used either as a video summarization or as a video bookmarking tool, providing the comparative advantage of being general, unbounded by the finiteness of a training …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Computer-based nodule malignancy risk assessment in thyroid ultrasound images",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.2316/Journal.202.2011.1.202-2955",
            "Abstract": "This paper presents a computer-based approach for detection, delineation, and malignancy risk assessment of thyroid nodules in ultrasound (US) images. The proposed approach is automatic and integrates processes for: the thyroid gland boundaries detection, the detection of nodular lesions within the thyroid gland, the delineation of the detected nodules, and the classification of thyroid nodules according to malignancy risk. These processes embed textural and shape feature vectors derived from the US images, as well as stateof-the-art medical image analysis and pattern recognition tools. The obtained classification performance, which is associated with automatic malignancy risk assessment, was evaluated by means of the receiver operating characteristic (ROC), demonstrating an area under curve (AUC) equal to 0.93. The quantification of the results shows that the proposed approach: (1) contributes to the …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:TQgYirikUcIC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Investigating cross-dataset abnormality detection in endoscopy with a weakly-supervised multiscale convolutional neural network",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8451673/",
            "Abstract": "The detection of abnormalities in endoscopic video frames can contribute in the early and more accurate detection of pathologic conditions. In this paper we present a novel Convolutional Neural Network (CNN) architecture for automatic detection of abnormal images in endoscopic video sequences. It features multiscale representation of the endoscopic images in its structure, and peephole connections contributing in enhanced generalization with less computational requirements. An important aspect of the proposed architecture is that it enables weakly-supervised learning, using only semantically annotated images. A novel cross-dataset experimental study is performed to investigate its generalization performance on various publicly available datasets. The results validate that the proposed architecture outperforms recent approaches, with results reaching up to 90.66% in terms of the area under the receiver …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:OkrdTXRNpVkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An LBP-based active contour algorithm for unsupervised texture segmentation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1699201/",
            "Abstract": "This paper presents a novel algorithm for unsupervised texture segmentation. The proposed algorithm incorporates the local binary pattern operator under a segmentation framework based on the active contour without edges model. The experiments performed, show that it can be used for fast segmentation of two-textured images, outperforming recent texture segmentation algorithms, with a segmentation quality that reaches 99% on average",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Variable background active contour model for computer-aided delineation of nodules in thyroid ultrasound images",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4300840/",
            "Abstract": "This paper presents a computer-aided approach for nodule delineation in thyroid ultrasound (US) images. The developed algorithm is based on a novel active contour model, named variable background active contour (VBAC), and incorporates the advantages of the level set region-based active contour without edges (ACWE) model, offering noise robustness and the ability to delineate multiple nodules. Unlike the classic active contour models that are sensitive in the presence of intensity inhomogeneities, the proposed VBAC model considers information of variable background regions. VBAC has been evaluated on synthetic images, as well as on real thyroid US images. From the quantification of the results, two major impacts have been derived: 1) higher average accuracy in the delineation of hypoechoic thyroid nodules, which exceeds 91%; and 2) faster convergence when compared with the ACWE model.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards intelligent capsules for robust wireless endoscopic imaging of the gut",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/47127291/Towards_Intelligent_Capsules_for_Robust_20160709-16026-hefglh.pdf",
            "Abstract": "Wireless capsule endoscopy (WCE) enables screening of the gastrointestinal tract by a swallowable imaging system. However, contemporary WCE systems have several limitations, which often result in low diagnostic yield. This paper introduces the concept of a next generation WCE system with embedded intelligence aiming to effectively minimize diagnostic errors. The proposed system is based on a novel wirelesslypowered hardware-software architecture integrating reconfigurable components that are optimized in terms of areatime complexity and power consumption. It integrates multispectral and 3D vision modules, and embedded intelligence for video quality control, accurate localization of the capsule and automatic detection of a broad spectrum of abnormalities. The feasibility of the proposed WCE system is qualitatively assessed with respect to the results obtained, and novel research directions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:CmbFvBriOyMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Video-based measurements for wireless capsule endoscope tracking",
            "Publication year": 2013,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/25/1/015002/meta",
            "Abstract": "The wireless capsule endoscope is a swallowable medical device equipped with a miniature camera enabling the visual examination of the gastrointestinal (GI) tract. It wirelessly transmits thousands of images to an external video recording system, while its location and orientation are being tracked approximately by external sensor arrays. In this paper we investigate a video-based approach to tracking the capsule endoscope without requiring any external equipment. The proposed method involves extraction of speeded up robust features from video frames, registration of consecutive frames based on the random sample consensus algorithm, and estimation of the displacement and rotation of interest points within these frames. The results obtained by the application of this method on wireless capsule endoscopy videos indicate its effectiveness and improved performance over the state of the art. The findings of …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Digital enhancement of cultural experience and accessibility for the visually impaired",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-16450-8_10",
            "Abstract": "Visual impairment restricts everyday mobility and limits the accessibility of places, which for the non-visually impaired is taken for granted. A short walk to a close destination, such as a market or a school becomes an everyday challenge. In this chapter, we present a novel solution to this problem that can evolve into an everyday visual aid for people with limited sight or total blindness. The proposed solution is a digital system, wearable like smart-glasses, equipped with cameras. An intelligent system module, incorporating efficient deep learning and uncertainty-aware decision-making algorithms, interprets the video scenes, translates them into speech, and describes them to the user through audio. The user can almost naturally interact with the system via a speech-based user interface, which is also capable of understanding the user’s emotions. The capabilities of this system are investigated in the context …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:2TuIPqOg0e0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Automatic measurement of thyroid gland",
            "Publication year": 2007,
            "Publication url": "http://rtsimage.di.uoa.gr/publications/Automatic%20Measurement%20of%20Thyroid%20Gland.pdf",
            "Abstract": "This study presents a novel method for automatic measurement of the anteroposterior diameter of the thyroid gland, in ultrasound images. Anteroposterior diameter is widely considered a basic parameter for goiter assessment. Goiter refers to abnormal enlargement of the thyroid gland and it is associated with iodine deficiency and various pathologic conditions including Hashimoto’s thyroiditis, and growing nodules. The proposed method is based on processing local histogram information extracted from vertically sampled horizontal image stripes. The anteroposterior diameter can be derived by measuring the distance between the hyperechoic lines that bound the thyroid lobes as depicted in longitudinal ultrasound images. Extensive experiments were carried out on a set of B-mode thyroid ultrasound images, in order to evaluate the effectiveness of the proposed method. The results advocate to the feasibility of its use for objective measurement of the anteroposterior diameter of the thyroid gland.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Homography-based orientation estimation for capsule endoscope tracking",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6295583/",
            "Abstract": "Wireless capsule endoscopy (WCE) is a developing imaging technology for screening the gastrointestinal system. Tracking of the swallowable capsule endoscope within the human body is typically performed by external sensor arrays enabling approximate localization and detection of its orientation. In this paper we propose a method for capsule orientation estimation based only on image features, without the requirement of any external equipment. The proposed method involves two steps: a) salient point detection and extraction of image features from these points, and b) detection of feature correspondences between consecutive frames and homography estimation. The capsule orientation is estimated by decomposition of the homography matrix into rotation and translation components. The results obtained by the application of this method on WCE video frames indicate its effectiveness and improved …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An artificial neural network architecture for non-parametric visual odometry in wireless capsule endoscopy",
            "Publication year": 2017,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6501/aa7ebf/meta",
            "Abstract": "Wireless capsule endoscopy is a non-invasive screening procedure of the gastrointestinal (GI) tract performed with an ingestible capsule endoscope (CE) of the size of a large vitamin pill. Such endoscopes are equipped with a usually low-frame-rate color camera which enables the visualization of the GI lumen and the detection of pathologies. The localization of the commercially available CEs is performed in the 3D abdominal space using radio-frequency (RF) triangulation from external sensor arrays, in combination with transit time estimation. State-of-the-art approaches, such as magnetic localization, which have been experimentally proved more accurate than the RF approach, are still at an early stage. Recently, we have demonstrated that CE localization is feasible using solely visual cues and geometric models. However, such approaches depend on camera parameters, many of which are unknown. In this …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:uGrg30pLAbkC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Unsupervised summarisation of capsule endoscopy video",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4670414/",
            "Abstract": "Capsule endoscopy is a non-invasive imaging technique commonly used for screening of the entire small intestine. It is performed by a wireless swallowable endoscopic capsule capable of transmitting thousands of video frames per examination. The visual inspection of the vast amount of images acquired during such an examination is a subjective and highly time consuming task even for experienced gastroenterologists. In this paper we propose a novel approach to the reduction of the number of the video frames to be inspected so as to enable faster inspection of the endoscopic video. It is based on symmetric non-negative matrix factorisation initialised by the fuzzy c-means algorithm and it is supported by non-negative Lagrangian relaxation to extract a subset of video frames containing the most representative scenes from a whole endoscopic examination. The experimental evaluation of the proposed approach …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy clustering of intuitionistic fuzzy data",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJBIDM.2008.017975",
            "Abstract": "Challenged by real-world clustering problems this paper proposes a novel fuzzy clustering scheme of datasets produced in the context of intuitionistic fuzzy set theory. More specifically, we introduce a variant of the Fuzzy C-Means (FCM) clustering algorithm that copes with uncertainty and a similarity measure between intuitionistic fuzzy sets, which is appropriately integrated in the clustering algorithm. We describe an intuitionistic fuzzification of colour digital images upon which we applied the proposed scheme. The experimental evaluation of the proposed scheme shows that it can be more efficient and more effective than the well-established FCM algorithm, opening perspectives for various applications.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Visual localization of wireless capsule endoscopes aided by artificial neural networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8104289/",
            "Abstract": "Various modalities are used for the examination of the gastrointestinal (GI) tract. One such modality is Wireless Capsule Endoscopy (WCE), a noninvasive technique which consists of a swallowable color camera that enables the detection of GI pathology with only minimal patient discomfort. Currently, tracking of the capsule position is estimated in the 3D abdominal space, using radio-frequency (RF) triangulation. The RF triangulation technique, however, does not provide sufficient information about the location of the capsule along the GI lumen, and consequently, the localization of any possible abnormality. Recently, we proposed a geometric visual odometry (VO) method for the localization of the capsule in the GI lumen. In this paper, we extend this state-of-art method by exploiting an artificial neural network (ANN) to augment the geometric method and achieve higher localization accuracy. The results of this novel …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:DrOLxFoABAwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic segmentation of the lung fields in portable chest radiographs based on Bézier interpolation of salient control points",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4659946/",
            "Abstract": "Portable chest radiographs are performed on the most critically-ill patients, who need highly skilled patient care and the best diagnostic tools. However, such radiographs are usually of low quality, mainly due to misaligned body positioning during their acquisition, and subject to a higher misinterpretation rate than the ones obtained with a non-portable X-ray device. This paper presents a pioneering computational approach that copes with the segmentation of the lung fields in portable chest radiographs. The proposed methodology involves detection of salient points on the anatomic structures around the lung fields by subsequent application of simple intensity and edge feature extraction techniques. The salient points detected are interpolated using Bezier curves intuitively approximating the boundaries of the lung fields. Unlike current methodologies, the proposed one does not exclude the overlapping region of the …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Image analysis framework for infection monitoring",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6134637/",
            "Abstract": "We present a novel framework for automatic extraction of the progress of an infection from time-series medical images, with application to pneumonia monitoring. In each image of a series, the lungs, which are the body components of interest in our study, are detected and delineated by a modified active shape model-based algorithm that is constrained by binary approximation masks. This algorithm offers resistance in the presence of infection manifestations that may distort the typical appearance of the body components of interest. The relative extent of the infection manifestations is assessed by supervised classification of samples acquired from the respective image regions. The samples are represented by multiple dissimilarity features fused according to a novel entropy-based weighted voting scheme offering nonparametric operation and robustness to outliers. The output of the proposed framework is a time …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Roadmap on Signal Processing for Next Generation Measurement Systems",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2111.02493",
            "Abstract": "Signal processing is a fundamental component of almost any sensor-enabled system, with a wide range of applications across different scientific disciplines. Time series data, images, and video sequences comprise representative forms of signals that can be enhanced and analysed for information extraction and quantification. The recent advances in artificial intelligence and machine learning are shifting the research attention towards intelligent, data-driven, signal processing. This roadmap presents a critical overview of the state-of-the-art methods and applications aiming to highlight future challenges and research opportunities towards next generation measurement systems. It covers a broad spectrum of topics ranging from basic to industrial research, organized in concise thematic sections that reflect the trends and the impacts of current and future developments per research field. Furthermore, it offers guidance to researchers and funding agencies in identifying new prospects.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:Q17yWvk9gpwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Thyroid texture representation via noise resistant image features",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4562057/",
            "Abstract": "The robustness of textural features on speckle noise is of vital importance for ultrasound imaging. A set of novel fuzzy features for thyroid ultrasound texture representation, demonstrating noise-resistant properties, is presented, analyzed and evaluated in this study. The textural feature extraction scheme is based on the fuzzyfication of the local binary pattern approach. The proposed features are evaluated on an annotated dataset of B-mode thyroid ultrasound images acquired from 75 patients. The experimental results illustrate that these features provide accurate representation of the thyroid texture. They can be effectively utilized for thyroid nodule detection outperforming other thyroid texture representation approaches that have been recently proposed in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Uncertainty-aware visual perception system for outdoor navigation of the visually challenged",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/697654",
            "Abstract": "Every day, visually challenged people (VCP) face mobility restrictions and accessibility limitations. A short walk to a nearby destination, which for other individuals is taken for granted, becomes a challenge. To tackle this problem, we propose a novel visual perception system for outdoor navigation that can be evolved into an everyday visual aid for VCP. The proposed methodology is integrated in a wearable visual perception system (VPS). The proposed approach efficiently incorporates deep learning, object recognition models, along with an obstacle detection methodology based on human eye fixation prediction using Generative Adversarial Networks. An uncertainty-aware modeling of the obstacle risk assessment and spatial localization has been employed, following a fuzzy logic approach, for robust obstacle detection. The above combination can translate the position and the type of detected obstacles into descriptive linguistic expressions, allowing the users to easily understand their location in the environment and avoid them. The performance and capabilities of the proposed method are investigated in the context of safe navigation of VCP in outdoor environments of cultural interest through obstacle recognition and detection. Additionally, a comparison between the proposed system and relevant state-of-the-art systems for the safe navigation of VCP, focused on design and user-requirements satisfaction, is performed. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:KEtq3P1Vf8oC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Use of hyperspectral/multispectral imaging in gastroenterology. Shedding some–different–light into the dark",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/388678",
            "Abstract": "Hyperspectral/Multispectral imaging (HSI/MSI) technologies are able to sample from tens to hundreds of spectral channels within the electromagnetic spectrum, exceeding the capabilities of human vision. These spectral techniques are based on the principle that every material has a different response (reflection and absorption) to different wavelengths. Thereby, this technology facilitates the discrimination between different materials. HSI has demonstrated good discrimination capabilities for materials in fields, for instance, remote sensing, pollution monitoring, field surveillance, food quality, agriculture, astronomy, geological mapping, and currently, also in medicine. HSI technology allows tissue observation beyond the limitations of the human eye. Moreover, many researchers are using HSI as a new diagnosis tool to analyze optical properties of tissue. Recently, HSI has shown good performance in identifying human diseases in a non-invasive manner. In this paper, we show the potential use of these technologies in the medical domain, with emphasis in the current advances in gastroenterology. The main aim of this review is to provide an overview of contemporary concepts regarding HSI technology together with state-of-art systems and applications in gastroenterology. Finally, we discuss the current limitations and upcoming trends of HSI in gastroenterology. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:PPrs6GlykQcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Adaptable, fast, area-efficient architecture for logarithm approximation with arbitrary accuracy on FPGA",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11265-009-0370-3",
            "Abstract": "This paper presents ALA (Adaptable Logarithm Approximation), a novel hardware architecture for the approximation of the base-2 logarithm of integers at an arbitrary accuracy, suitable for fast and area-efficient FPGA implementation. It is based on a piecewise linear approximation methodology, implemented so that an arbitrary number of linear segments approximate the logarithm function. The achieved approximation accuracy depends on the number of segments used, which also affects the size of a ROM used for storing the parameters that control the computation. The implementation of the ROM using an FPGA BlockRAM allows the parameters to be updated without reconfiguration of the FPGA core. This provides the considerable advantage of data set adaptability to the proposed architecture over the other relevant architectures, as the parameters can be easily updated to minimize the approximation …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Wavelet-based signal analysis for heart failure hospitalization prediction.",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=wgy3DAAAQBAJ&oi=fnd&pg=PA21&dq=info:Ln07p_lxsxEJ:scholar.google.com&ots=LDdDd8_cDj&sig=lWL5cMfD6K-7Q7d3Ichp_UBMWiQ",
            "Abstract": "Heart failure (HF) is commonly a chronic condition associated with frequent hospital admissions. Early knowledge about a possible deterioration of this condition would enable early treatment for the prevention of adverse events and related hospital admissions. In this paper we present a computational method for predictive information extraction from daily physiological signals, which can be obtained by a telemonitoring system with wearable sensors. It is based on wavelet analysis of temporal signal patterns. Experiments with data from patients enrolled in a telemonitoring protocol show that the proposed method is capable of predicting HF hospitalization events one day before they happen, even in the case of low compliance to the protocol. These results indicate a promising perspective towards a monitoring system that would provide improved life quality for HF patients.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:f13iAvnbnnYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A gene expression analysis system for medical diagnosis",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_53",
            "Abstract": "In this paper we present a novel system that utilizes molecular-level information for medical diagnosis. It accepts high dimensional vectors of gene expressions, quantified by means of microarray image analysis, as input. The proposed system incorporates various data pre-processing methods, such as missing values estimation and data normalization. A novel approach to the classification of gene expression vectors in multiple classes that embodies vari-ous gene selection methods has been adopted for diagnostic purposes. The pro-posed system has been extensively tested on various, publicly available data-sets. We demonstrate its performance for prostate cancer diagnosis and corn-pare its performance with a well established multiclass classification scheme. The results show that the proposed system could be proved a valuable diagnostic aid in medicine.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Automatic evaluation of the progress of bacterial pulmonary infections in temporal radiographic image sequences",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5394376/",
            "Abstract": "Pulmonary radiographs are essential tools to the evaluation and diagnosis of suspected infections of the lower respiratory system. Interpretation of a radiograph in the clinical context is a valuable diagnostic adjunct to the selection and the management of a specific clinical protocol for therapy. The key element in the proper diagnosis of a bacterial pulmonary infection is the analysis of the radiographic data accumulated over time. A dynamic consultation system that captures the progress of a disease over time can prove a valuable means to patients' monitoring and follow-up. The aim of this work is to provide an initial framework which can be used to describe the progress of a bacterial pulmonary infection based on the spatial variation of its radiographic manifestation in temporal image sequences. This is realized by the unsupervised discrimination of inflammatory areas from normal lung parenchyma in chest …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust capsule endoscopy lesion quantification and localization systems",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.compbiomed.2015.04.003",
            "Abstract": "Robust capsule endoscopy lesion quantification and localization systems | Computers in \nBiology and Medicine ACM Digital Library home ACM home Google, Inc. (search) Advanced \nSearch Browse About Sign in Register Advanced Search Journals Magazines Proceedings \nBooks SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced \nSearch Computers in Biology and Medicine Periodical Home Latest Issue Archive Authors \nAffiliations Award Winners More HomeBrowse by TitlePeriodicalsComputers in Biology and \nMedicineVol. , No. CRobust capsule endoscopy lesion quantification and localization systems \nresearch-article Robust capsule endoscopy lesion quantification and localization systems \nShare on Authors: Anastasios Koulaouzidis Endoscopy Unit, The Royal Infirmary of Edinburgh, \nScotland, UK Endoscopy Unit, The Royal Infirmary of Edinburgh, Scotland, UK View Profile , K. , …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:UEFpDhwOD2kC",
            "Publisher": "Pergamon Press, Inc."
        },
        {
            "Title": "Fuzzy pooling",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9197689/",
            "Abstract": "Convolutional Neural Networks (CNNs) are artificial learning systems typically based on two operations: convolution, which implements feature extraction through filtering, and pooling, which implements dimensionality reduction. The impact of pooling in the classification performance of the CNNs has been highlighted in several previous works, and a variety of alternative pooling operators have been proposed. However, only a few of them tackle with the uncertainty that is naturally propagated from the input layer to the feature maps of the hidden layers through convolutions. In this paper we present a novel pooling operation based on fuzzy sets to cope with the local imprecision of the feature maps, and we investigate its performance in the context of image classification. Fuzzy pooling is performed by fuzzification, aggregation and defuzzification of feature map neighborhoods. It is used for the construction of a fuzzy …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:HevVnK7dagcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CoLD: a versatile detection system for colorectal lesions in endoscopy video-frames",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016926070200007X",
            "Abstract": "In this paper, we present CoLD (colorectal lesions detector) an innovative detection system to support colorectal cancer diagnosis and detection of pre-cancerous polyps, by processing endoscopy images or video frame sequences acquired during colonoscopy. It utilizes second-order statistical features that are calculated on the wavelet transformation of each image to discriminate amongst regions of normal or abnormal tissue. An artificial neural network performs the classification of the features. CoLD integrates the feature extraction and classification algorithms under a graphical user interface, which allows both novice and expert users to utilize effectively all system's functions. It has been developed in close cooperation with gastroenterology specialists and has been tested on various colonoscopy videos. The detection accuracy of the proposed system has been estimated to be more than 95%. As it has been …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Intuitionistic fuzzy clustering to information retrieval from cultural databases",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Iakovidis/publication/228649480_Intuitionistic_Fuzzy_Clustering_to_Information_Retrieval_from_Cultural_Databases/links/0912f5087902c16d0b000000/Intuitionistic-Fuzzy-Clustering-to-Information-Retrieval-from-Cultural-Databases.pdf",
            "Abstract": "Content-based information retrieval (IR) involves low-level feature extraction and utilize similarity search methods applied either in the feature space or in derived higher-level semantic spaces. These methods assume that similarity is measured by accounting only the degree in which two entities are related, ignoring the hesitancy introduced by the degree in which they are unrelated. Aiming at semantically relevant IR from cultural databases, this paper proposes a novel intuitionistic fuzzy clustering scheme based on intuitive features and a similarity defined over higher-level patterns.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "II-Learn—A Novel Metric for Measuring the Intelligence Increase and Evolution of Artificial Learning Systems",
            "Publication year": 2019,
            "Publication url": "https://www.atlantis-press.com/journals/ijcis/125921810/view",
            "Abstract": "A novel accurate and robust metric called II-Learn for measuring the increase of intelligence of a system after a learning process is proposed. We define evolving learning systems, as systems that are able to make at least one measurable evolutionary step by learning. To prove the effectiveness of the metric we performed a case study, using a learning system. The universality of II-Learn is based on the fact that it does not depend on the architecture of the studied system.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:fc7zyzPI2QAC",
            "Publisher": "Atlantis Press"
        },
        {
            "Title": "Dedicated hardware for real-time computation of second-order statistical features for high resolution images",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11864349_7",
            "Abstract": "We present a novel dedicated hardware system for the extraction of second-order statistical features from high-resolution images. The selected features are based on gray level co-occurrence matrix analysis and are angular second moment, correlation, inverse difference moment and entropy. The proposed system was evaluated using input images with resolutions that range from 512(512 to 2048(2048 pixels. Each image is divided into blocks of user-defined size and a feature vector is extracted for each block. The system is implemented on a Xilinx VirtexE-2000 FPGA and uses integer arithmetic, a sparse co-occurrence matrix representation and a fast logarithm approximation to improve efficiency. It allows the parallel calculation of sixteen co-occurrence matrices and four feature vectors on the same FPGA core. The experimental results illustrate the feasibility of real-time feature extraction for input images …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "DINOSARC: Color features based on selective aggregation of chromatic image components for wireless capsule endoscopy",
            "Publication year": 2018,
            "Publication url": "https://www.hindawi.com/journals/cmmm/2018/2026962/abs/",
            "Abstract": "Wireless Capsule Endoscopy (WCE) is a noninvasive diagnostic technique enabling the inspection of the whole gastrointestinal (GI) tract by capturing and wirelessly transmitting thousands of color images. Proprietary software “stitches” the images into videos for examination by accredited readers. However, the videos produced are of large length and consequently the reading task becomes harder and more prone to human errors. Automating the WCE reading process could contribute in both the reduction of the examination time and the improvement of its diagnostic accuracy. In this paper, we present a novel feature extraction methodology for automated WCE image analysis. It aims at discriminating various kinds of abnormalities from the normal contents of WCE images, in a machine learning-based classification framework. The extraction of the proposed features involves an unsupervised color-based saliency detection scheme which, unlike current approaches, combines both point and region-level saliency information and the estimation of local and global image color descriptors. The salient point detection process involves estimation of DIstaNces On Selective Aggregation of chRomatic image Components (DINOSARC). The descriptors are extracted from superpixels by coevaluating both point and region-level information. The main conclusions of the experiments performed on a publicly available dataset of WCE images are (a) the proposed salient point detection scheme results in significantly less and more relevant salient points; (b) the proposed descriptors are more discriminative than relevant state-of-the-art descriptors, promising a …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:PcT55Ow6fAIC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Support vector machines for improved defect detection in manufacturing using novel multidimensional wavelet feature extraction involving vector quantization and PCA techniques",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/53969173/2001_NIMIA_SC_SVM_for_Defect_Detection_Wavelets.pdf",
            "Abstract": "This paper aims at investigating a novel solution to the problem of defect detection from images using the Support Vector Machines (SVM) classification approach, that can find applications in the design of robust quality control systems for the production of furniture, textile, integrated circuits, etc. The suggested solution focuses on detecting defects for manufacturing applications from their wavelet transformation and vector quantization related properties of the associated wavelet coefficients. More specifically, a novel methodology is investigated for discriminating defects by applying a supervised neural classification technique, namely SVM, to innovative multidimensional wavelet based feature vectors. These vectors are extracted from the K-Level 2-D DWT (Discrete Wavelet Transform) transformed original image using Vector Quantization techniques and a Principal Component Analysis (PCA) applied to these wavelet domain quantization vectors. The results of the proposed methodology are illustrated in defective textile images where the defective areas are recognized with higher accuracy than the one obtained by applying two rival defect detection methodologies. The first one of them uses all the wavelet coefficients derived from the k-Level 2-D DWT and involves SVM again in the classification stage, while the second one uses again all the wavelet coefficients derived from the k-Level 2-D DWT but involves a Multilayer Perceptron (MLP) neural network in the classification stage. The promising results herein shown outline the importance of judicious selection and processing of 2-D DWT wavelet coefficients for industrial pattern recognition …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient semantically-aware annotation of images",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962190/",
            "Abstract": "The collection of knowledge about an imaging domain usually requires input from experts on that domain. In a two-dimensional image space this input can be provided through graphic annotation of image regions that represent objects of interest. This is a necessary process which is both time-consuming and cost inefficient, especially when sequences of images are involved. In this paper we present a novel software tool for efficient annotation of images and image sequences. This tool has a simple graphical user interface through which the average user can use alternatively two graphic annotation protocols and combine them with a versatile snake-based framework for semi-automatic image annotation to significant speedup the annotation process. Graphic annotations can be stored and retrieved directly from the web, whereas they can be associated with semantic identifiers available on any OWL ontology. The …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic multimedia analysis and processing",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=fujMAwAAQBAJ&oi=fnd&pg=PP1&dq=info:lcH0gvw4ZCwJ:scholar.google.com&ots=nJOBep32_F&sig=f-w2iGJQjSo1BfsaC-GEpdj_9AY",
            "Abstract": "Broad in scope, Semantic Multimedia Analysis and Processing provides a complete reference of techniques, algorithms, and solutions for the design and the implementation of contemporary multimedia systems. Offering a balanced, global look at the latest advances in semantic indexing, retrieval, analysis, and processing of multimedia, the book features the contributions of renowned researchers from around the world. Its contents are based on four fundamental thematic pillars: 1) information and content retrieval, 2) semantic knowledge exploitation paradigms, 3) multimedia personalization, and 4) human-computer affective multimedia interaction. Its 15 chapters cover key topics such as content creation, annotation and modeling for the semantic web, multimedia content understanding, and efficiency and scalability. Fostering a deeper understanding of a popular area of research, the text: Describes state-of-the-art schemes and applications Supplies authoritative guidance on research and deployment issues Presents novel methods and applications in an informative and reproducible way Contains numerous examples, illustrations, and tables summarizing results from quantitative studies Considers ongoing trends and designates future challenges and research perspectives Includes bibliographic links for further exploration Uses both SI and US units Ideal for engineers and scientists specializing in the design of multimedia systems, software applications, and image/video analysis and processing technologies, Semantic Multimedia Analysis and Processing aids researchers, practitioners, and developers in finding innovative solutions to existing …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:q7LczdTNAjsC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Fusion of fuzzy statistical distributions for classification of thyroid ultrasound patterns",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0933365710000369",
            "Abstract": "This paper proposes a novel approach for thyroid ultrasound pattern representation. Considering that texture and echogenicity are correlated with thyroid malignancy, the proposed approach encodes these sonographic features via a noise-resistant representation. This representation is suitable for the discrimination of nodules of high malignancy risk from normal thyroid parenchyma.The material used in this study includes a total of 250 thyroid ultrasound patterns obtained from 75 patients in Greece. The patterns are represented by fused vectors of fuzzy features. Ultrasound texture is represented by fuzzy local binary patterns, whereas echogenicity is represented by fuzzy intensity histograms. The encoded thyroid ultrasound patterns are discriminated by support vector classifiers.The proposed approach was comprehensively evaluated using receiver operating characteristics …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:hC7cP41nSMkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Texture multichannel measurements for cancer precursors’ identification using support vector machines",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0263224104000909",
            "Abstract": "Colorectal cancer is one of the leading types of cancer in the developed countries. Epidemiological studies have shown that the risk of developing colorectal cancer can be significantly reduced through early detection and removal of cancer precursor lesions. We propose a novel framework for the automated identification of colon cancer precursors based on the processing of color video frames acquired during endoscopy. The spectral information of the three color channels forming the endoscopic frames is used for the description of the colonic mucosa. The suitability of different color models for this application is investigated. The textural properties of the colonic mucosal surface are measured using second order statistical descriptors on the wavelet transform of the multichannel video signals. A new reduced set of measures based on the inter-channel covariance of the features has proven to provide high …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Efficient and effective ultrasound image analysis scheme for thyroid nodule detection",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74260-9_93",
            "Abstract": "Ultrasound imaging of thyroid gland provides the ability to acquire valuable information for medical diagnosis. This study presents a novel scheme for the analysis of longitudinal ultrasound images aiming at efficient and effective computer-aided detection of thyroid nodules. The proposed scheme involves two phases: a) application of a novel algorithm for the detection of the boundaries of the thyroid gland and b) detection of thyroid nodules via classification of Local Binary Pattern feature vectors extracted only from the area between the thyroid boundaries. Extensive experiments were performed on a set of B-mode thyroid ultrasound images. The results show that the proposed scheme is a faster and more accurate alternative for thyroid ultrasound image analysis than the conventional, exhaustive feature extraction and classification scheme.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Capsule endoscope localization based on visual features",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701570/",
            "Abstract": "Computational analysis of wireless capsule endoscopy (WCE) videos has already proved its potentials in the discovery or characterization of lesions and in the reduction of the time required by the endoscopists to perform the examination. An open problem that has only partially been addressed is the localization of the capsule endoscope in the gastrointestinal (GI) tract. Previous works have been based mainly on external, wearable, sensors. In this paper we propose a novel approach based solely on visual information extracted from WCE videos. This approach is based on a feature tracking method for visual odometry, which enables the estimation of both the rotation and the displacement of a capsule endoscope from reference anatomical landmarks. Its implementation is based on a novel, open access Java Video Analysis (JVA) framework, which enables quick and standardized development of intelligent video …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computer-aided malignancy risk assessment of nodules in thyroid US images utilizing boundary descriptors",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4621555/",
            "Abstract": "This paper investigates the diagnostic potential of boundary descriptors calculated on delineations of thyroid nodules in ultrasound images. The utilized set of boundary descriptors includes compactness, chain code histogram and fractal dimension. Experiments were conducted on thyroid US images, so as to evaluate the discriminating capability of each boundary descriptor for the classification of thyroid nodules in terms of their malignancy risk. The receiver operating characteristic (ROC) is used for the evaluation of the experimental results. It is derived that thyroid nodules can be classified according to their malignancy risk, by utilizing their compactness, fractal dimension and chain code histogram, obtaining an area under curve (AUC) which reaches 0.93.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An ontology of image representations for medical image mining",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5394373/",
            "Abstract": "Ontologies are an effective means to formally specify and constrain knowledge. They have proved their utility in various data mining applications, especially in annotating text to render it machine interpretable. More challenging research perspectives arise when ontologies are used to annotate images where the information is encoded in numeric pixel values rather than in natural language. Current approaches to bridge the gap between the pixel-based foundational representation and high level image semantics include the utilization of taxonomies describing 2D spatial relations between the depicted objects and hence linking image features with semantics. To this end we present a novel ontological approach that formalizes concepts and relations regarding image representations for medical image mining. It provides descriptors for pixels, image regions, image features, and clusters. It extends previous …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The future of capsule endoscopy in clinical practice: from diagnostic to therapeutic experimental prototype capsules",
            "Publication year": 2020,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7509905/",
            "Abstract": "Capsule endoscopy (CE) is indicated as a first-line clinical examination for the detection of small-bowel pathology, and there is an ever-growing drive for it to become a method for the screening of the entire gastrointestinal tract (GI). Although CE’s main function is diagnosis, the research for therapeutic capabilities has intensified to make therapeutic capsule endoscopy (TCE) a target within reach. This manuscript presents the research evolution of CE and TCE through the last 5 years and describes notable problems, as well as clinical and technological challenges to overcome. This review also reports the state-of-the-art of capsule devices with a focus on CE research prototypes promising an enhanced diagnostic yield (DY) and treatment. Lastly, this article provides an overview of the research progress made in software for enhancing DY by increasing the accuracy of abnormality detection and lesion localisation.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:gxb_f1p9zx4C",
            "Publisher": "Termedia Publishing"
        },
        {
            "Title": "Ubiquitous complex event processing in exocortex applications and mathematical approaches",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Andree-Ehresmann/publication/264851670_Ubiquitous_Complex_Event_Processing_in_Exocortex_Applications_and_Mathematical_Approaches/links/53f63ba90cf2fceacc70ec37/Ubiquitous-Complex-Event-Processing-in-Exocortex-Applications-and-Mathematical-Approaches.pdf",
            "Abstract": "The concept of an artificial cognitive system uCepCortex is discussed that integrates multiple sources of information, including from specialized sensors and software agents in the cloud, and acts as an exocortex for human users. It combines a high degree of autonomy with sophisticated human interface techniques to ensure that the human is kept in the loop and exercises control, while greatly extending his/her effective cognitive range by off-loading processes to the cognitive system. The uCepCortex approach utilizes the emerging disciplines of Ubiquitous Complex Event Processing and Event-Driven Process Management to implement a human-inspired cognitive model that complements human abilities and can detect, correlate, filter, enrich, process and learn from millions of events per second from arbitrary event types, and that implements flexible (re-) actions or processes in rapidly changing scenarios. Finally we propose a mathematical model for a neuro-bio-ICT system, as an application of the theory of Memory Evolutive Systems and its handling of uCepCortex applications.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Noise Reduction and Restoration-Dedicated Hardware for Real-Time Computation of Second-Order Statistical Features for High Resolution Images",
            "Publication year": 2006,
            "Publication url": "https://philpapers.org/rec/BATNRA",
            "Abstract": "Dimitris Batiamis, Dimitris K. Iakovidis & Dimitris Maroulis, Noise Reduction and Restoration-Dedicated \nHardware for Real-Time Computation of Second-Order Statistical Features for High Resolution \nImages - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents \nPhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax \nAdvanced Search Noise Reduction and Restoration-Dedicated Hardware for Real-Time \nComputation of Second-Order Statistical Features for High Resolution Images Dimitris \nBatiamis, Dimitris K. Iakovidis & Dimitris Maroulis In O. Stock & M. Schaerf (eds.), Lecture \nNotes in Computer Science. Springer Verlag. pp. 4179--67 (2006) Abstract This article has no \nassociated abstract. (fix it) Keywords No keywords specified (fix it) Categories Philosophy of \nPhysical Science, Misc in Philosophy of Physical Science (categorize this paper) Buy the book …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Look-behind fully convolutional neural network for computer-aided endoscopy",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1746809418303033",
            "Abstract": "In this paper, we propose a novel Fully Convolutional Neural Network (FCN) architecture aiming to aid the detection of abnormalities, such as polyps, ulcers and blood, in gastrointestinal (GI) endoscopy images. The proposed architecture, named Look-Behind FCN (LB-FCN), is capable of extracting multi-scale image features by using blocks of parallel convolutional layers with different filter sizes. These blocks are connected by Look-Behind (LB) connections, so that the features they produce are combined with features extracted from behind layers, thus preserving the respective information. Furthermore, it has a smaller number of free parameters than conventional Convolutional Neural Network (CNN) architectures, which makes it suitable for training with smaller datasets. This is particularly useful in medical image analysis, since data availability is usually limited due to ethicolegal constraints. The performance of …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:mu2_AnMl8iYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Adaptive vision system for segmentation of echographic medical images based on a modified mumford-shah functional",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74607-2_51",
            "Abstract": "This paper presents a novel adaptive vision system for accurate segmentation of tissue structures in echographic medical images. The proposed vision system incorporates a level-set deformable model based on a modified Mumford-Shah functional, which is estimated over sparse foreground and background regions in the image. This functional is designed so that it copes with the intensity inhomogeneity that characterizes echographic medical images. Moreover, a parameter tuning mechanism has been considered for the adaptation of the deformable model parameters. Experiments were conducted over a range of echographic images displaying abnormal structures of the breast and of the thyroid gland. The results show that the proposed adaptive vision system stands as an efficient, effective and nearly objective tool for segmentation of echographic images.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards the Substitution of Real with Artificially Generated Endoscopic Images for CNN Training",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8941751/",
            "Abstract": "The generalization performance in deep learning is linked to the size and the variations of the samples available during training. This is apparent in the domain of computer-aided gastrointestinal tract abnormality detection, where the lesions can vary a lot from each other and the number of available samples is limited, mainly due to personal data protection legislations. In this work we present a novel approach of tackling the problem of limited training data availability by making use of artificially generated images. More specifically we trained a Generative Adversarial Network (GAN) using Wireless Capsule Endoscopy (WCE) images to generate fake but realistic images from the small bowel. The generated images were then used to train a Convolutional Neural Network (CNN) to identify inflammatory conditions on real WCE images. To evaluate the performance of our approach, in our experiments we compare the …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:3wLP7v6BnpwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital image processing: clinical applications and challenges in cosmetics",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7449660/",
            "Abstract": "Digital image processing and analysis of medical images can effectively support medical diagnosis with valuable tools including automatic detection, recognition segmentation and measurement of visible entities of interest. This paper provides an overview of related clinical applications with focus on the analysis of skin disorders, extending to the limitedly explored field of cosmetics. Innovative applications and challenges are identified with respect to tissue quality and ageing measurement, as well as cosmetic recommendation systems. The impacts of research towards this direction could extend beyond the cosmetics industry.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:zaHkCSmj5XkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Explainable Classification of Weakly Annotated Wireless Capsule Endoscopy Images Based on a Fuzzy Bag-of-Colour Features Model and Brain Storm Optimization",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-87199-4_46",
            "Abstract": "Wireless capsule endoscopy (WCE) constitutes a medical imaging technology developed for the endoscopic exploration of the gastrointestinal (GI) tract, whereas it provides a more comfortable examination method, in comparison to the conventional endoscopy technologies. In this paper, we propose a novel Explainable Fuzzy Bag-of-Words (XFBoW) feature extraction model, for the classification of weakly annotated WCE images. A comparative advantage of the proposed model over state-of-the-art feature extractors is that it can provide an explainable classification outcome, even with conventional classification schemes, such as Support Vector Machines. The explanations that can be derived are based on the similarity of the image content with the content of the training images, used for the construction of the model. The feature extraction process relies on data clustering and fuzzy sets. Clustering is …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:NObE97JSLecC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Beyond lesion detection: towards semantic interpretation of endoscopy videos",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-65172-9_32",
            "Abstract": "Several computer-based medical systems have been proposed for automatic detection of abnormalities in a variety of medical imaging domains. The majority of these systems are based on binary supervised classification algorithms capable of discriminating abnormal from normal image patterns. However, this approach usually does not take into account that the normal content of images is diverse, including various kinds of tissues and artifacts. In the context of gastrointestinal video-endoscopy, which is addressed in this study, the semantics of the normal content include mucosal tissues, the hole of the lumen, bubbles, and debris. In this paper we investigate such a semantic interpretation of the endoscopy video content as an approach to improve lesion detection in a weakly supervised framework. This framework is based on a novel salient point detection algorithm, the bag-of-words image representation …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:0kLwNjf3oFwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Hierarchical discovery of patterns of infections in chest radiographs using non-negative matrix factorization",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5367749/",
            "Abstract": "Chest radiography is a screening tool for the detection and the primary assessment of abnormalities consistent with the infections of the lower respiratory tract. Most commonly, the radiographic manifestations of bacterial infection are areas of consolidation with a segmental or lobar distribution which appear as areas of increased pulmonary opacity. This paper addresses the problem of the discovery of consolidation patterns in chest radiographs, by a methodology for automatic segregation of lung consolidations from normal lung parenchyma. The proposed methodology is based on non-negative matrix factorization (NMF) of pulmonary radiographic patterns represented by intensity histograms and Gabor textural features. NMF is considered as a soft clustering algorithm which is iteratively applied according to an hierarchical cluster-merging scheme. This scheme reckons with the resulting NMF bases so as to …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intuitionistic fuzzy clustering with applications in computer vision",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-88458-3_69",
            "Abstract": "Intuitionistic fuzzy sets are generalized fuzzy sets whose elements are characterized by a membership, as well as a non-membership value. The membership value indicates the degree of belongingness, whereas the non-membership value indicates the degree of non-belongingness of an element to that set. The utility of intuitionistic fuzzy sets theory in computer vision is increasingly becoming apparent, especially as a means to coping with noise. In this paper, we investigate the issue of clustering intuitionistic fuzzy image representations. To achieve that we propose a clustering approach based on the fuzzy c-means algorithm utilizing a novel similarity metric defined over intuitionistic fuzzy sets. The performance of the proposed algorithm is evaluated for object clustering in the presence of noise and image segmentation. The results indicate that clustering intuitionistic fuzzy image representations can be …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Software for enhanced video capsule endoscopy: challenges for essential progress",
            "Publication year": 2015,
            "Publication url": "https://www.nature.com/articles/nrgastro.2015.13",
            "Abstract": "Video capsule endoscopy (VCE) has revolutionized the diagnostic work-up in the field of small bowel diseases. Furthermore, VCE has the potential to become the leading screening technique for the entire gastrointestinal tract. Computational methods that can be implemented in software can enhance the diagnostic yield of VCE both in terms of efficiency and diagnostic accuracy. Since the appearance of the first capsule endoscope in clinical practice in 2001, information technology (IT) research groups have proposed a variety of such methods, including algorithms for detecting haemorrhage and lesions, reducing the reviewing time, localizing the capsule or lesion, assessing intestinal motility, enhancing the video quality and managing the data. Even though research is prolific (as measured by publication activity), the progress made during the past 5 years can only be considered as marginal with respect to …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:dT4-KZ621vcC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Tumor recognition in endoscopic video images using artificial neural network architectures",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/874524/",
            "Abstract": "The paper focuses on a scheme for automated tumor recognition using images acquired during endoscopic sessions. The proposed recognition system is based on multilayer feed forward neural networks (MFNNs) and uses texture information encoded with corresponding statistical measures that are fed as input to the MFNN. Experiments were performed for recognition of different types of tumors in various images and also a number of sequentially acquired frames. The recognition of a polypoid tumor of the colon in the original image, which were used for training was very high. The trained network was also able to satisfactorily recognize the tumor in a sequence of video frames. The results of the proposed approach were very promising and it seems that it can be efficiently applied for tumor recognition.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Image retrieval using keywords: The machine learning perspective",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/37144172/TheodosiouTsapatsoulis.pdf",
            "Abstract": "Given the rapid growth of available digital images, image retrieval has attracted a lot of research interest the last decades. Image retrieval research efforts are falling into content-based and text-based methods. Content-based methods retrieve images by analyzing and comparing the content of a given image example as a starting point. Text-based methods are similar to document retrieval and retrieve images using keywords. The latter is the approach of preference both for ordinary users and search engine engineers. Besides the fact that the majority of users are familiar with text-based queries, content-",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:Gs1AF5H0x94C",
            "Publisher": "CRC Press/Taylor & Francis"
        },
        {
            "Title": "Determinative Brain Storm Optimization",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-53956-6_24",
            "Abstract": "Brain Storm Optimization (BSO) is a swarm intelligence optimization algorithm, based on the human brainstorming process. The ideas of a brainstorming process comprise the solutions of the algorithm, which iteratively applies solution grouping, generation and selection operators. Several modifications of BSO have been proposed to enhance its performance. In this paper, we propose a novel modification enabling faster convergence of BSO to optimal solutions, without requiring setting an upper bound of algorithm iterations. It considers a brainstorming scenario where participating groups with similar ideas recognize that their ideas are similar, and together, collaborate for the determination of a better solution. The proposed modification, called Determinative BSO (DBSO), implements this scenario by applying a cluster merging strategy for merging groups of similar solutions, while following elitist selection …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:lL5f5cZgq8MC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "M 3 G: Maximum Margin Microarray Gridding",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2105-11-49",
            "Abstract": "Complementary DNA (cDNA) microarrays are a well established technology for studying gene expression. A microarray image is obtained by laser scanning a hybridized cDNA microarray, which consists of thousands of spots representing chains of cDNA sequences, arranged in a two-dimensional array. The separation of the spots into distinct cells is widely known as microarray image gridding. In this paper we propose M3G, a novel method for automatic gridding of cDNA microarray images based on the maximization of the margin between the rows and the columns of the spots. Initially the microarray image rotation is estimated and then a pre-processing algorithm is applied for a rough spot detection. In order to diminish the effect of artefacts, only a subset of the detected spots is selected by matching the distribution of the spot sizes to the normal distribution. Then, a set of grid lines is placed on the image in order …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:3fE2CSJIrl8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Color texture recognition in video sequences using wavelet covariance features and support vector machines",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1231589/",
            "Abstract": "We pertain to the recognition of textural regions for color video analysis. The proposed scheme uses the covariance of 2/sup nd/-order statistics on the wavelet domain, between the different color channels of the video frames. These features, named as color wavelet covariance (CWC), are used as color textural descriptors. A support vector machine was chosen for the classification of the CWC feature vectors. Experiments were conducted using both animated Vistex texture mosaics and standard video clips. The estimated average accuracy ranged from 90% to 97%. The results show that the proposed methodology could efficiently be used in various multimedia applications as a complete supervised color texture recognition system.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Intuitionistic fuzzy reasoning with cognitive maps",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6007640/",
            "Abstract": "Fuzzy cognitive maps have proven an exceptional means to reasoning for decision support. In this paper we propose a novel approach to hesitancy-aware reasoning based on cognitive maps and intuitionistic fuzzy logic. Intuitionistic fuzzy sets are considered for the linguistic representation of both the concepts of a cognitive map and the relations defined between them. A comparative advantage of this approach over the state of the art is an intrinsic mechanism of modeling human hesitancy, as introduced in the construction of a cognitive model, and propagated through the reasoning process to a final decision. A numerical example demonstrates its effectiveness which can extend to a variety of real-world applications.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A genetically optimized level set approach to segmentation of thyroid ultrasound images",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s10489-007-0066-y",
            "Abstract": " This paper presents a novel framework for thyroid ultrasound image segmentation that aims to accurately delineate thyroid nodules. This framework, named GA-VBAC incorporates a level set approach named Variable Background Active Contour model (VBAC) that utilizes variable background regions, to reduce the effects of the intensity inhomogeneity in the thyroid ultrasound images. Moreover, a parameter tuning mechanism based on Genetic Algorithms (GA) has been considered to search for the optimal VBAC parameters automatically, without requiring technical skills. Experiments were conducted over a range of ultrasound images displaying thyroid nodules. The results show that the proposed GA-VBAC framework provides an efficient, effective and highly objective system for the delineation of thyroid nodules. ",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Efficient homography-based video visualization for wireless capsule endoscopy",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701598/",
            "Abstract": "Wireless capsule endoscopy (WCE) is performed by a swallowable pill capsule equipped with a camera wirelessly transmitting color video frames to an external receiver. The resulting video consists usually of several thousands of frames and its visual examination requires hours of endoscopists' undivided attention. In this paper we propose a novel visualization approach for WCE which enables faster examination of the endoscopic video, while providing a broader field of view. This is achieved by an algorithm that iteratively samples clusters of consecutive frames from the original video. The frames of each cluster are geometrically transformed, so as to generate a seamless collage subsequently projected into a new frame without any information loss. The new frames compose a new WCE video with a smaller number of frames. The video frame collage is based on homography matrix estimation from frame …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A high-performance imaging and control system for a micromirror-based laser-scanning endoscope device",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1703923/",
            "Abstract": "A novel reduced-size endoscope system based on a laser-scanning technology has been developed by the authors. This system employs specific silicon micromirrors and ensures a high-resolution color imaging with improved characteristics. A critical part of the device is its data-acquisition, control, and processing (DACP) system for real-time handling of the collected digital images. The supporting software is an event-driven application for the MS-Windows operating system that incorporates important features such as improved portability through the open PC architecture, cost effectiveness, high performance, and efficient scalability by using a symmetric multiprocessing desktop computer. In this paper, a presentation of the DACP system is performed with a focus in the software developed, which exploits the multithreading technology, resulting in a high-performance endoscope device",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Segmentation of medical images with regional inhomogeneities",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1699689/",
            "Abstract": "This paper presents a novel deformable model for accurate delineation of regions of interest in medical images that contain regional inhomogeneities. Such images are common in various medical imaging domains including endoscopy and radiology. The proposed model improves the active contour without edges (ACWE) model by excluding sparse regional inhomogeneities from both the foreground and the background of the images to be segmented. The proposed model is tolerant to noise and allows for the delineation of multiple objects. Experiments were performed on both endoscopic and ultrasonic images from different organs. The results show that the proposed model can be effectively utilized for the delineation of abnormal tissue findings, and in presence of regional inhomogeneities it can be more accurate compared with the ACWE model",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Importance of Feature Descriptors for the Characterisation of Texture",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/46058416/On_the_Importance_of_Feature_Descriptors20160529-20153-1kb1gmj.pdf",
            "Abstract": "In this contribution is investigated the use of textural descriptors as descriptors for primitive textural information in medical images. A few approaches have been presented in the literature to the direction of the discrimination of texture in medical images compared with similar approaches used for texture recognition. In this paper we try to prove that texture exists in medical images and can be encoded using the proposed statistical based descriptors. We have selected four different methods for the estimation of such descriptors. These have been tested in various texture images and in endoscopic medical images, attempting this way to create the texture models possibly exist in the images. The texture spaces described by the corresponding vectors of the features are used as input to different multilayer perceptron type neural networks for the characterization of images from their texture content. An in depth experimental study has been conducted comparing textural feature extraction techniques on various images along with a novel discrete wavelet transform based methodology.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fpga-based system for real-time video texture analysis",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11265-008-0246-y",
            "Abstract": "This paper describes a novel system for real-time video texture analysis. The system utilizes hardware to extract second-order statistical features from video frames. These features are based on the Gray Level Co-occurrence Matrix (GLCM) and describe the textural content of the video frames. They can be used in a variety of video analysis and pattern recognition applications, such as remote sensing, industrial and medical. The hardware is implemented on a Virtex-XCV2000E-6 FPGA programmed in VHDL. It is based on an architecture that exploits the symmetry and the sparseness of the GLCM and calculates the features using integer and fixed point arithmetic. Moreover, it integrates an efficient algorithm for fast and accurate logarithm approximation, required in feature calculations. The software handles the video frame transfers from/to the hardware and executes only complementary floating point …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Digital Enhancement of Cultural Experience and Accessibility",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=LxegDwAAQBAJ&oi=fnd&pg=PA237&dq=info:21Fbr7tE2yIJ:scholar.google.com&ots=p7jM_AC94M&sig=xXZNPa9e6-KHNh0qN9OyQ4ByMFE",
            "Abstract": "Today, approximately 16% of the world’s population lives with some form of visual impairment (WHO, 2018). Individuals with low or total absence of vision have to deal with various daily problems, struggling to fit in the modern way and rhythm of life. To address this important issue, researchers in the fields of medicine, smart electronics, computer science and engineering are joining their forces to develop assistive systems for the visually impaired individuals. To date, as a result of this effort, several designs and components of wearable camera-enabled systems for the visually impaired have been proposed.A survey of relevant systems proposed until 2008 has been presented in Zhang, Ong, and Nee (2008). It identifies three categories of navigation systems:(a) based on positioning systems, including Global Positioning System (GPS) for outdoor positioning, and pre-installed pilots and beacons emitting signals, eg, radiofrequency, infrared (IR), ultrasonic, etc., to determine the absolute position of the user in a local structured environment,(b) based on Radiofrequency Identification (RFID) tags with contextual information, such as surrounding landmarks, turning points; and vision-based systems exploiting the information acquired from digital cameras. In a more recent study performed in the beginning of 2017 (Elmannai",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:C-SEpTPhZ1wC",
            "Publisher": "Springer"
        },
        {
            "Title": "Telemonitoring predicts in advance heart failure admissions",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167527316308282",
            "Abstract": "Heart failure (HF) is increasingly common and characterised by frequent admissions to hospital. To reduce the risk of HF hospitalisation (HFH), approaches as telemonitoring (TM) have been introduced. This study aimed to develop an algorithm for detecting patients at high risk of HFH, using daily collected physiological data (blood pressure, heart rate, weight) by non-invasive TM.The analysis was based on home-TM data collected from a single centre as part of HF care. The prediction of HFH was considered as a signal processing and classification problem. Signal processing aimed to transform the signals to enhance the information relevant to HFH. We attempted to construct an algorithm that could identify such patterns and classify them as abnormal by assessing the predictive value of each of the monitored signals and their combinations using analysis of vectors (e.g. vectors of raw signal …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:S_fw-_riRmcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Panoramic visual summaries for efficient reading of capsule endoscopy videos",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6735565/",
            "Abstract": "Wireless capsule endoscopy (WCE) is a minimally invasive procedure enabling visual examination of the entire gastrointestinal tract. It is performed by a swallow able camera-equipped capsule wirelessly transmitting color video frames. Reading the resulting video is a challenging process for the endoscopists. It requires a considerable amount of time, usually hours of undivided attention and experience to detect and correctly interpret findings. In this paper we propose a novel method for automatic construction of panoramic visual summaries of WCE video frames enabling efficient reading of the video, while providing a broader field of view for the endoscopists. It involves extraction of visual features from each frame, and frame registration. Consecutive frames are geometrically transformed and stitched together to form new sequences of panoramic frames, each of which summarizes the information contained in …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:wH03y5nBhxsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust model-based detection of the lung field boundaries in portable chest radiographs supported by selective thresholding",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/20/10/104019/meta",
            "Abstract": "Portable chest radiography is a valuable tool for screening patients hospitalized in intensive care, providing visual cues for diagnosis and physiological measurements. However, its practicality comes at the cost of quality, which is mainly affected by misaligned body positioning, thus increasing x-ray misinterpretation rates. This paper presents a novel methodology for the detection of the lung field boundaries in portable chest radiographs of patients with bacterial pulmonary infections. Such infections are radiographically manifested as foci of consolidations which can lead to vague or invisible lung field boundaries, difficult to distinguish even by experienced physicians. Conventional and state-of-the-art approaches address mainly stationary radiographs, whereas only a few of them cope with pulmonary infections. The proposed methodology is based on an active shape model incorporating shape prior information …",
            "Abstract entirety": 0,
            "Author pub id": "Jg1ZJ1wAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IoP Publishing"
        },
        {
            "Title": "Software engineering applications in gastroenterology",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.429.225&rep=rep1&type=pdf",
            "Abstract": "Software engineering enables the construction of reliable services, which in the field of medicine can be regarded as crucial components of today’s clinical practice. This paper focuses on software engineering applications in the field of gastroenterology and presents the state of the art in this field as well as challenges for future research. It reviews a broad spectrum of applications with emphasis on endoscopic imaging. The advances in the latter are dominant, with hundreds of scientific contributions in the last quinquennium to be driven mainly by the technological revolution of wireless capsule endoscopy (WCE). However, there is still a long way for research before resolving the related open issues in practice.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:o0eFlWRwRSUC",
            "Publisher": "Synergy Publishers"
        },
        {
            "Title": "A comparative study of texture features for the discrimination of gastric polyps in endoscopic video",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1467755/",
            "Abstract": "In this paper, we extend the application of four texture feature extraction methods proposed for the detection of colorectal lesions, into the discrimination of gastric polyps in endoscopic video. Support Vector Machines have been utilized for the texture classification task. The polyp discrimination performance of the surveyed schemes is compared by means of Receiver Operating Characteristics (ROC). The results advocate the feasibility of a computer-based system for polyp detection in video gastroscopy that exploits the textural characteristics of the gastric mucosa in conjunction with its color appearance.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Shielding active shape models against weak lung field boundaries for segmentation of chest radiographs",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.657.1636&rep=rep1&type=pdf",
            "Abstract": "A novel active shape model (ASM) segmentation scheme is proposed, for the detection of the lung field boundaries in chest radiographs. The proposed scheme is robust in the presence of weak lung field boundaries, which are recognized as a common cause of missegmentation. This situation is prevalent in chest radiographs obtained from patients with abnormalities, such as lung consolidations, or even in normal chest radiographs of low quality. In order to shield the ASM against the presence of weak boundaries, the distance used in searching for the optimal displacements of the ASM landmarks is modified so that it incorporates both shape prior and patient-specific anatomical information. The segmentation performance of the proposed scheme is experimentally validated on a challenging set of chest radiographs obtained from patients with bacterial pulmonary infections. The results obtained indicate its advantage over the original ASM.",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Follow-up on: optimizing lesion detection in small bowel capsule endoscopy and beyond: from present problems to future solutions",
            "Publication year": 2019,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Jg1ZJ1wAAAAJ:S0RksyIsHSIC",
            "Publisher": "Taylor & Francis"
        }
    ]
}]