[{
    "name": "Δημήτριος Ιωαννίδης",
    "romanize name": "Dimitrios Ioannidis",
    "School-Department": "Οικονομικών Επιστημών",
    "University": "uom",
    "Rank": "Καθηγητής",
    "Apella_id": 19906,
    "Scholar name": "Dimitrios Ioannides",
    "Scholar id": "Brc7FTEAAAAJ",
    "Affiliation": "Department of Economics-University of Macedonia-GR",
    "Citedby": 549,
    "Interests": [
        "Ninpametric Estimation",
        "censored data",
        "dependent data"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Brc7FTEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Smooth confidence intervals for the survival function under random right censoring",
            "Publication year": 2012,
            "Publication url": "https://projecteuclid.org/journals/electronic-journal-of-statistics/volume-6/issue-none/Smooth-confidence-intervals-for-the-survival-function-under-random-right/10.1214/12-EJS697.short",
            "Abstract": "The present article presents a methodological advance which contributes to the area of nonparametric survival analysis under random right censoring. The central idea is to develop pointwise confidence intervals for the survival function by means of a central limit theorem for an, already existing in the literature, kernel smooth survival estimate. Numerical simulations reveal the progress in coverage accuracy offered by the suggested confidence intervals over the proposals already existing in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:ufrVoPGSRksC",
            "Publisher": "Institute of Mathematical Statistics and Bernoulli Society"
        },
        {
            "Title": "Regression quantiles with errors-in-variables",
            "Publication year": 2009,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10485250903019515",
            "Abstract": "In a lot of situations, variables are measured with errors. While this problem has been previously studied in the context of kernel regression, no work has been done in quantile regression. To estimate this function, we use deconvolution kernel estimators. We obtain asymptotic results (MSE and normality) for two estimators of conditional quantiles and analyse their finite sample performances via a large simulation study.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "FUNCTION AND ITS QUANTILES INVOLVING",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=Tg90DwAAQBAJ&oi=fnd&pg=PA211&dq=info:3ca_UfFiSfcJ:scholar.google.com&ots=Ruo2-Beaoz&sig=YJVyZkq5J8qEXqioEG4SxDirWvE",
            "Abstract": "In a lot of situations, variables are measured with errors. While this problem has been previously studied in the context of kernel regression, the results have been applied to the case where only the covariates are contaminated. This article addresses the problem where both (covariates and response variables) are contaminated. Since this problem can not be solved by estimating the mean regression function, we estimate the conditional cumulative distribution function and its quantiles functions. Following Roussas (1969a, b), we propose a class of nonparametric deconvoluting estimators for these functions. The asymptotic behavior of these estimators depends on the smoothness of the noise distribution. Uniform consistency is established for strongly mixing stochastic processes, when the error distribution is ordinary smooth. A numerical example is given to illustrate the paper.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:0EnyYjriUFMC",
            "Publisher": "Walter de Gruyter GmbH & Co KG"
        },
        {
            "Title": "Nonparametric regression with errors-in-all-variables",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10485250701763116",
            "Abstract": "In this paper, we estimate the nonparametric mean regression function when all the variables of the model are measured with errors. As an application, we discuss the general nonparametric approach for stochastic frontier models.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:Se3iqnhoufwC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Fixed design local polynomial smoothing and bandwidth selection for right censored data",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167947320301559",
            "Abstract": "The local polynomial smoothing of the Kaplan–Meier estimate for fixed designs is explored and analyzed. The first benefit, in comparison to classical convolution kernel smoothing, is the development of boundary aware estimates of the distribution function, its derivatives and integrated derivative products of any arbitrary order. The advancements proceed by developing asymptotic mean integrated square error optimal solve-the-equation plug-in bandwidth selectors for the estimates of the distribution function and its derivatives, and as a byproduct, a mean square error optimal bandwidth rule for integrated derivative products. The asymptotic properties of all methodological contributions are quantified analytically and discussed in detail. Three real data analyses illustrate the benefits of the proposed methodology in practice. Finally, numerical evidence is provided on the finite sample performance of the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "Brc7FTEAAAAJ:8k81kl-MbHgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Estimation of conditional distribution function and its quantiles involving measurement errors",
            "Publication year": 2018,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9783110942002-016/html",
            "Abstract": "In a lot of situations, variables are measured with errors. While this problem has been previously studied in the context of kernel regression, the results have been applied to the case where only the covariates are contaminated. This article addresses the problem where both (covariates and response variables) are contaminated. Since this problem can not be solved by estimating the mean regression function, we estimate the conditional cumulative distribution function and its quantiles functions. Following Roussas (1969a, b), we propose a class of nonparametric deconvoluting estimators for these functions. The asymptotic behavior of these estimators depends on the smoothness of the noise distribution. Uniform consistency is established for strongly mixing stochastic processes, when the error distribution is ordinary smooth. A numerical example is given to illustrate the paper.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:WF5omc3nYNoC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "A goodness of fit test for the survival function under random right censoring",
            "Publication year": 2013,
            "Publication url": "https://projecteuclid.org/journals/electronic-journal-of-statistics/volume-7/issue-none/A-goodness-of-fit-test-for-the-survival-function-under/10.1214/13-EJS853.short",
            "Abstract": "The present article contributes a goodness of fit test for the survival function under random right censoring. The test is based on a central limit theorem for the Integrated Square Error of an already existing in the literature kernel survival function estimate. Establishment of its asymptotic distribution yields the proposed test statistic for drawing decision on the null hypothesis of correctness of the assumed survival function. Numerical simulations quantify the empirical nominal level and power of the suggested test for various sample sizes and amounts of censoring and facilitate comparison with the power of the data driven Neyman goodness of fit test for censored samples.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:roLk4NBRz8UC",
            "Publisher": "Institute of Mathematical Statistics and Bernoulli Society"
        },
        {
            "Title": "Kernel based confidence intervals for survival function estimation",
            "Publication year": 2007,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812709691_0040",
            "Abstract": "Based on an existing kernel survival function estimate that admits censored data, we develop confidence intervals to help assess the validity of the estimate. Practical issues of estimation are discussed and then the developments are applied to a real data set. The results are analyzed and discussed further.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nonparametric estimation of the conditional mode with errors-in-variables: Strong consistency for mixing processes",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10485250212375",
            "Abstract": "Having two variables, an explanatory one ( X o ) and a response one ( Y o ), linked by the classical relation Y^{o} = g({\\bf X}^{o}) + \\varepsilon , we want to estimate the function g (.) without any parametric assumption. However, in a lot of situations, the variables are not measured directly but through their proxies {\\bf X} = {\\bf X}^{o} + \\bivarepsilon and Y = Y^{o} + \\eta where l and m are the measurements errors. We propose here a new method for estimating the function g (.) in such a context. Our estimator is based on deconvoluted kernels. Uniform convergence is established for strongly mixing stochastic processes. Some simulations show that our estimator is tractable and performs relatively well in practice.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "On the Estimation of a Distribution Function from Noisy Observations in Time Series",
            "Publication year": 2018,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9783110942002-017/html",
            "Abstract": "A nonparametric estimation of a distribution function is considered when observations contain measurement errors. A method is developed to establish asymptotic normality results for deconvoluting kernel-type estimator for «-mixing stochastic processes corrupted by some noise process. It is shown that the asymptotic distribution depends on the smoothness of the noise distributions, which are characterized as either ordinary smooth or super smooth. Also, the kind of dependence of the noise process is crucial to the form of the asymptotic variance.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "Estimating the distribution function of a stationary process involving measurement errors",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1017996326631",
            "Abstract": "A nonparametric estimation of a distribution function is considered when observations contain measurement errors. A method is developed to establish asymptotic normality results for a deconvoluting kernel-type estimator for ρ-mixing stochastic processes corrupted by some noise process. It is shown that the asymptotic distribution depends on the smoothness of the noise distributions, which are characterized as either ordinary smooth or super smooth. Also, the kind of dependence of the noise process is crucial to the form of the asymptotic variance.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Fixed design regression quantiles for time series",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167715203003882",
            "Abstract": "This paper studies nonparametric estimation of regression quantiles under the fixed design model. We suppose that the error random variables are coming from a strictly stationary stochastic process satisfying the strong mixing condition. The joint asymptotic normality for the estimators of several quantiles is given. The same property is established for the regression quantile estimator at different fixed design points.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Smooth Nonparametric Survival Analysis",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-57306-5_22",
            "Abstract": "This research proposes the local polynomial smoothing of the Kaplan–Meier estimate under the fixed design setting. This allows the development of estimates of the distribution function (equivalently the survival function) and its derivatives under the random right censoring model. The asymptotic properties of the estimate, including its asymptotic normality are all established herein.",
            "Abstract entirety": 1,
            "Author pub id": "Brc7FTEAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A machine learning approach using random forest and LASSO to predict wine quality",
            "Publication year": 2021,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSAMI.2021.118129",
            "Abstract": "Quality assessment is a key factor for the wine industry, where the aim is to meet consumers' needs/demands and promote sales. Quality assessment is usually performed by experts and it is a time-consuming and expensive process. This paper proposes an alternative assessment using machine learning methods, such as the least absolute shrinkage and selection operator (LASSO) and random forest to predict wine quality. Our data analysis is based on a real wine dataset provided by a well-known wine firm in Greece. For this purpose, we employ the LASSO method, which is particularly effective in selecting the best possible number of variables required. Additionally, the random forest method is used and its findings are contrasted to those derived by four different M.L. methods, namely, linear discriminant analysis (LDA), classification and regression trees (CART), k-nearest neighbours (kNN) and support vector …",
            "Abstract entirety": 0,
            "Author pub id": "Brc7FTEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Inderscience Publishers (IEL)"
        }
    ]
}]