[{
    "name": "Δημοσθενης Βουγιουκας ",
    "romanize name": "Dimosthenis Vougioukas ",
    "School-Department": "Μηχανικων  Πληροφοριακων Και Επικοινωνιακων Συστηματων",
    "University": "aegean",
    "Rank": "Καθηγητής",
    "Apella_id": 19519,
    "Scholar name": "Demosthenes Vouyioukas",
    "Scholar id": "iYvovHEAAAAJ",
    "Affiliation": "Professor, University of the Aegean",
    "Citedby": 1376,
    "Interests": [
        "Wireless and Satellite Communications",
        "Mobile Communications",
        "RF Communications"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=iYvovHEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Data Transfer Optimisation in DVB-RCS Satellite Networks",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile-to-mobile communications via stratospheric relays: Relay selection and performance analysis",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7248439/",
            "Abstract": "In this work, relay selection policies for a network where a terrestrial source communicates with a terrestrial destination through multiple relay nodes which reside in the stratosphere are presented. More specifically considering realistic three-dimensional (3-D) non-isotropic scattering channel modelling combined with opportunistic relay selection for various fading conditions. Moreover, the stratospheric nodes are battery-dependent and relay selection aims at power reduction. As Channel State Information (CSI) overhead is introduced by the selection process, proactive and reactive versions are presented based on instantaneous CSI knowledge. In this setting, the selection policies in terms of outage probability, throughput and power reduction are evaluated and comparisons with statistical channels and with a relaying scheme that does not perform power adaptation are provided.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Relays and Cooperative Techniques for 5G Systems",
            "Publication year": 2017,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781315155821-12/relays-cooperative-techniques-5g-systems-nikolaos-nomikos-demosthenes-vouyioukas",
            "Abstract": "The 5th-generation (5G) of wireless networks aims, among others, at achieving the goals that have been set by regulatory authorities regarding the seamless connectivity of all types of devices. In various studies it is stated that next-generation networks should allow smart objects ranging from sensors and actuators to user equipment (UE) and vehicles, to connect and communicate in the Internet of things (IoT). This chapter focuses on cooperative relaying (CR) with useful definitions of various relay strategies. It describes different interference cases as well as respective mitigation techniques. A detailed description of possible relay classes is provided for 5G wireless networks and the capability of each class to support a specific application. The chapter analyses the centralized and distributed network coordination, and examines the performance evaluation and comparisons between relay classes for each selection …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:abG-DnoFyZgC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Decision support algorithms and optimization techniques for personal homecare environment",
            "Publication year": 2006,
            "Publication url": "http://medlab.cc.uoi.gr/itab2006/proceedings/eHealth/162.pdf",
            "Abstract": "In this paper, various decision support schemes are proposed evaluating the selection of different network infrastructures in terms of routing optimization and signal strength selection. Limited computational and radio communication capabilities require collaborative algorithms with energy-aware communication. Power saving makes it possible to guarantee basic levels of system performance, such as connectivity, throughput and delay, in the presence of both mobility-immobility and a large number of sensor nodes. A variety of approaches for intelligent energy-efficient schemes have been simulated over different performance metrics.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "When buffer-aided relaying meets full duplex and NOMA",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9363027/",
            "Abstract": "Full duplex (FD) systems are able to transmit and receive signals over the same frequency band simultaneously with the potential of even doubling the spectral efficiency in comparison with traditional half duplex (HD) systems. When combined with relaying, FD systems are expected to dramatically increase the throughput of future wireless networks. However, the degrading effect of self-interference (SI) due to the simultaneous transmission and reception at the relay threatens their efficient rollout in real-world topologies. At the same time, non-orthogonal multiple access (NOMA) can further increase the spectral efficiency of the network. In this article, we present how buffering at the relays can be integrated with FD and NOMA in order to improve the performance of relay networks. More specifically, the key points for the successful integration of buffer-aided relays with spatial sharing paradigms are presented, and …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity Maximization through Energy-Aware Multi-Mode Relaying",
            "Publication year": 2012,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer"
        },
        {
            "Title": "Electronic Healthcare Services using the DVB-RCS Communication Technology",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "INEAG"
        },
        {
            "Title": "Discone Rectenna Implementation for Broadband RF Energy Harvesting",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8741639/",
            "Abstract": "In this study, a broadband RF energy harvester implementation is presented. The system uses a broadband discone antenna, which can operate efficiently in a broad frequency spectrum, including LTE, DCS 1800 and UMTS 2100 cellular frequency bands. The system is able to acquire energy from many electromagnetic field sources increasing the total amount of energy harvested, in order to charge a storage energy element efficiently in a short time. The prototype broadband RF energy harvester was tested on the laboratory and also in a typical urban environment.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:BrmTIyaxlBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cooperative mobile high-speed and personal area networks for the provision of pervasive e-health services",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962685/",
            "Abstract": "The present paper studies the performance of a high-speed third-generation (3.5G) networking technology (Enhanced Uplink), in collaboration with well known personal area networks (i.e. Zigbee and Bluetooth) and wireless local area network (WLAN) technology, for delivering pervasive healthcare applications. The association of personal and local area networks along with the 3.5G network is a critical factor for successful development of pervasive e-health services perceived by end-users. In this paper, we propose a methodology for performance assessment based on the joint uplink transmission of voice, real-time video and biomedical data, such us electrocardiogram, vital signals and heart sounds. Various scenarios were concerned for point of care applications in real-time and near-real-time modes and in random locations, where no other system but 3.5G is available. The accomplishment of quality of service …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enabling wireless prosuming in 5G networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917759/",
            "Abstract": "In this article, we present a novel architecture which enables wireless prosuming in the forthcoming fifth-generation (5G) networks. More specifically, we introduce the concept of wireless prosumers i.e. network elements which consume wireless resources while at the same time facilitate the network's resource management. In addition, we propose a prosumers-based network architecture which is divided into two subsystems. The first subsystem provides timely spectrum data gathering through prosumers and dedicated infrastructure. The second subsystem takes as input the output of the data gathering subsystem and triggers optimization decisions on spectral resources. As open-source modular cloud networking and computing characteristics are adopted for both subsystems, on one-hand, data processing and decision-making is performed in distributed cloud controllers and additionally, software-defined …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless longitudinal motion controller design for quadrotors",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9214005/",
            "Abstract": "In the present paper, the problem of remotely controlling a quadrotor in longitudinal motion and under atmospheric disturbances is studied. The disturbances are considered not to be measurable. The controller - communication system is enriched with a synchronization / signal reconstruction algorithm imposing constant delays. The design goal is to independently control the horizontal and vertical velocity of the quadrotor while simultaneously attenuating the influence of the disturbances to these two velocities. To this end, a linear dynamic time delay controller will be designed. The satisfactory performance of the proposed control scheme is illustrated through computational experiments for the case of a climbing manoeuvre.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Study simulation and measurement evaluation of spread spectrum overlay in analog broadcasting systems",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1040573/",
            "Abstract": "The investigation of a spectrum overlay of a direct sequence spread spectrum system on the existing narrowband FM and wideband TV broadcasting system is presented.. Results from subjective listening and viewing tests are presented in order to decide on the RF protection ratios for the FM and TV receivers in an overlay scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Face detection and recognition of natural human emotion using Markov random fields",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00779-007-0165-0.pdf",
            "Abstract": "This paper presents an integrated system for emotion detection. In this research effort, we have taken into account the fact that emotions are most widely represented with eye and mouth expressions. The proposed system uses color images and it is consisted of three modules. The first module implements skin detection, using Markov random fields models for image segmentation and skin detection. A set of several colored images with human faces have been considered as the training set. A second module is responsible for eye and mouth detection and extraction. The specific module uses the HLV color space of the specified eye and mouth region. The third module detects the emotions pictured in the eyes and mouth, using edge detection and measuring the gradient of eyes’ and mouth’s region figure. The paper provides results from the system application, along with proposals for further research.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A survey on beamforming techniques for wireless MIMO relay networks",
            "Publication year": 2013,
            "Publication url": "https://www.hindawi.com/journals/ijap/2013/745018/",
            "Abstract": "One of the major challenges the mobile broadband community faces is the exponential increase in mobile data traffic, even more so, for cell-edge users. Thus, in a multitier network, the demand for high-speed and interference-free transmission and reception is inevitable. Beamforming (BF) is an advanced technology that offers a significantly improved solution to reduce the interference levels and improve the system capacity. Accordingly, the establishment of relays in mobile data networks has emerged spectral efficiency enhancements and cell capacity gains from an overall system perspective. This paper provides a comprehensive survey focused on the performance of adopted beamforming technique on MIMO relay networks that is expected to overcome crucial obstacles in terms of capacity and interference. The main objective is to point out the state-of-the-art research activity on BF techniques in MIMO relay networks, under various network performance challenges. Thereby, it focuses on recently developed procedures for interference modeling and mitigation, BF channel modeling, channel estimation and feedback, complexity and power consumption, adaptive BF for multiuser relaying, degrees of freedom, diversity issues, and spectral efficiency, in cooperative and opportunistic systems. Different network topologies have been considered and categorized, pertaining the challenges of BF implementation in MIMO relay networks.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:BqipwSGYUEgC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "A load and channel aware dynamic point selection algorithm for LTE-A CoMP networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7551928/",
            "Abstract": "In this work, in order to exploit the benefits of the Coordinated MultiPoint Dynamic Point Selection technique (CoMP/DPS), we propose a LOad and CHannel aware (LOCH) DPS algorithm that avoids unnecessary Base Station (BS) switching and, therefore, it significantly reduces the ping-pong effect. The performance of the proposed scheme is evaluated via simulations and comparisons with another state-of-the-art DPS selection scheme, in terms of UE transitions between Transmission Points (TPs) and throughput. The results show that LOCH achieves significantly less transitions, while having the same or better throughput performance. Thus, the current work can be the base for other future works that will aim to the reduction of the CoMP signaling load, as well as to the reduction of the CoMP traffic load at the backhaul network.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High altitude platform's instability effect on co-channel interference levels when sharing the V band with terrestrial services",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1543812/",
            "Abstract": "In this paper the effect of high altitude platform's instability on co-channel interference levels when sharing the V band with terrestrial services is analyzed. Simulation results characterizing the statistical behaviour of interference variations due to platform's instability are presented.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A context-aware backhaul management solution for combined H2H and M2M traffic",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6705719/",
            "Abstract": "Future Internet is expected to sustain a huge number of devices, many orders of magnitude higher than state-of-the-art network architectures and handle larger and unconventional information flows. Machine Type communications (MTC) will play a critical role in this evolution and thus both architectural and algorithmic enhancements to existing converged mobile and fixed network infrastructures are needed. In this paper, we focus on resource management issues for combined Human-to-Human (H2H) and Machine-to-Machine (M2M) traffic. The proposed Context-Aware Backhaul Management (CABM) scheme is applicable for M2M gateways, which can provide the interconnection between cellular and capillary networks both via wired and wireless backhaul alternatives. CABM scheme adopts efficient QoS provisioning procedures, by taking into consideration the diverse QoS requirements of novel MTC services …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hybrid NOMA/OMA with buffer-aided relay selection in cooperative networks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8618435/",
            "Abstract": "Non-orthogonal multiple access (NOMA) aims to increase the spectral efficiency of fifth generation networks by relaxing the orthogonal use of radio-resources. In this paper, a network with multiple half-duplex buffer-aided (BA) relays is considered, where the source transmits with a fixed rate toward two users. The users might demand the same rate by the source (e.g., two cellular users requiring the same service), or they could have different rate requirements (e.g., a cellular user coexisting with an Internet of Things device). By deploying multiple BA relays, increased reliability and additional degrees of freedom are provided. Leveraging the spectral efficiency of NOMA and the increased diversity gain of BA relaying, two relay selection algorithms with broadcasting are proposed for power-domain NOMA and hybrid NOMA/OMA, namely BA-NOMA and BA-NOMA/OMA, respectively. BA-NOMA can improve the …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Outage probability of triple-hop mixed RF/FSO/RF stratospheric communication systems",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Nomikos/publication/323602718_Outage_Probability_of_Triple-Hop_Mixed_RFFSORF_Stratospheric_Communication_Systems/links/5ae01725458515c60f63d541/Outage-Probability-of-Triple-Hop-Mixed-RF-FSO-RF-Stratospheric-Communication-Systems.pdf",
            "Abstract": "Frequency/Free-Space-Optical/Radio-Frequency (RF/FSO/RF) communication system, which intends to support wireless longrange links between two terrestrial stations via two stratospheric relays. It is considered that these terrestrial stations communicate with the relays over RF links, whereas the relays communicate with each other over a FSO link. The RF channels experience Rician fading due to the Line-of-Sight (LoS) and Non-Line-of-Sight (NLoS) signal components. Besides, the optical channel is affected by atmospheric attenuation, atmospheric turbulence, and pointing errors. Mathematical expressions for the outage probability are derived, considering the beam wander effect. The results demonstrate the theoretical derivations.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A buffer-aided successive opportunistic relay selection scheme with power adaptation and inter-relay interference cancellation for cooperative diversity systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7067380/",
            "Abstract": "In this paper, we present a relay selection scheme which combines the spectral efficiency of successive opportunistic relaying with the robustness of single-link relay selection. More specifically, we propose a scheme that minimizes the total energy expenditure per time slot under an inter-relay interference cancellation scheme. The new relay selection policy is analyzed in terms of outage probability and diversity by modeling the evolution of relay buffers as a Markov Chain. We construct the state transition matrix of the Markov Chain and obtain its stationary distribution, which in turn, yields the outage probability. The proposed scheme outperforms relevant state-of-the-art relay selection schemes in terms of throughput, diversity, energy efficiency and average delay, as demonstrated via representative numerical examples.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Single-point model of MIMO-UWB indoor systems using time-reversal transmission",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7996470/",
            "Abstract": "Nowadays, various techniques and systems have been proposed for the implementation of wireless indoor localization systems. Recently, significant focus has been given to Multiple Input-Multiple Output (MIMO) implementations of Ultra-Wideband (UWB) systems, in order to enhance the localization precision while introducing high communication performance. The main disadvantages of such approaches are the high deployment cost and computational complexity, due to the increased data processing. These facts are compensated by adopting the Time Reversal (TR) transmission scheme, providing scaling capabilities and Spatial Focusing (SF) to the system, at the same time. In this paper, a 2 × 2 Multi-Antenna Time-Reversal Indoor Positioning (MATRIP) system model is proposed to track the mobile Blind Node (BN) in a harsh indoor environment, measuring its time-range from one fixed-position Anchor Node …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A delay optimal scheduling policy for real time services in WCDMA systems",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-010-0031-7.pdf",
            "Abstract": "Enhanced Uplink operation of WCDMA-UMTS systems utilizes fast Node B scheduling and a short Transmission Time Interval (TTI) of 2 ms. The scheduling decisions are based on Scheduling Information (SI) sent from each User Equipment (UE) to the Node B. The weakness of the existing scheduling framework is that the SI does not include information regarding the delay sensitivity of each traffic flow, as well as the actual delay that the buffered data have experienced, especially for real-time services. In this paper, we propose the inclusion of such information in SI by introducing modifications into the respective 3GPP specifications. Thus, we propose a Delay Aware Channel Prioritization (DACP) criterion optimized for real-time services. Furthermore, we propose a DACP-based packet Scheduler (DACP-S) which is able to dynamically manage the Enhanced Dedicated Channel’s (E-DCH) transmissions …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Performance evaluation of machine learning methods for path loss prediction in rural environment at 3.7 GHz",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-021-02682-3",
            "Abstract": "This paper presents and assesses various machine learning methods that aim at predicting path loss in rural environment. For this purpose, models such as artificial neural network (ANN), support vector regression (SVR), random forest (RF), and bagging with k-nearest neighbor (B-kNN) learners, are exploited and evaluated. They are trained and tested with path loss data collected from an extensive measurement campaign that have been carried out in diverse rural areas in Greece. The results demonstrate that all the proposed machine learning models outperform the empirical ones, exhibiting, in any case, root-mean-square-error (RMSE) values between 4.0 and 6.5 dB. The poorest prediction of the measured data is encountered for SVR with Polynomial kernel. Furthermore, B-kNN and RF algorithms preserve comparable path loss approximations with remarkably low RMSE on the order of 4.2–4.3 dB. The error …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Communication issues in pervasive healthcare systems and applications",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/communication-issues-pervasive-healthcare-systems/58827",
            "Abstract": "This book chapter provides a systematic analysis of the communication technologies used in healthcare and homecare, their applications and the utilization of the mobile technologies in the healthcare sector by using in addition case studies to highlight the successes and concerns of homecare projects. There are several software applications, appliances, and communication technologies emerging in the homecare arena, which can be combined in order to create a pervasive mobile health system. This study highlights the key areas of concern and describes various types of applications in terms of communications’ performance. A comprehensive overview of some of these homecare, healthcare applications and research are presented. The technologies regarding the provision of these systems are described and categorised in two main groups: synchronous and asynchronous communications’ systems and …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "LoLA4SOR: A low-latency algorithm for successive opportunistic relaying",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9093798/",
            "Abstract": "Buffer-aided (BA) relaying has been proposed as an efficient way to improve the diversity of multi-hop networks. Nonetheless, it results in increased end-to-end delay, as packets tend to reside in the relays' buffers for many time-slots. In order to enable the adoption of BA relays in delay-intolerant applications, the combination with successive relaying can increase the number of packets that are transmitted. In this work, hybrid relay selection algorithms are studied, where delay- and diversity aware (DDA) half-duplex algorithms are complemented with successive BA relaying. Moreover, a hybrid DDA algorithm is presented, namely LoLA4SOR that adapts to the transmit conditions, switching between half-duplex (HD) and successive relaying (SuR). The performance of LoLA4SOR is compared to several HD, successive and hybrid algorithms, in terms of outage probability, throughput and delay. The results indicate that …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless femto-relays: a new model for small cell deployments",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/article/wireless-femto-relays/125818",
            "Abstract": "The continuous increase in mobile data traffic creates the need for radical innovations in the mobile broadband system design. Heterogeneous networks (HetNets) deployment paradigm is an emerging research trend considered as the most significant aspect for meeting the mobile data challenge, mainly by proposing spectral efficiency enhancements and cell capacity gains from an overall system perspective. Two are the main challenges that dense small cell networks are facing: a) various types of interference mainly caused by unplanned deployments, and b) limited and Quality of Service (QoS)-unreliable wired backhaul links. In this paper, the authors propose a model where femtocells' and relays' complementary characteristics are effectively exploited into femto-relays. More specifically, the authors describe four main functionalities of this model: a) interference protection, b) two-fold backhaul alternatives (ie …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Outdoor capacity study utilizing multiple element antennas at the millimeter wave band",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4390796/",
            "Abstract": "This paper studies the capacity of an outdoor wireless system operating at the millimeter wave band using a physical channel model that incorporates antennas with multiple elements at both terminals. In our study we have utilized uniform linear arrays (ULAs) and uniform rectangular arrays (URAs) for comparison reasons. It was observed that in order to realize a major improvement in the data rates, an outdoor MIMO system, in an urban environment at 60 GHz, should operate at a distance up to 50-60 m with the view of maintaining low signal to noise ratios. It is found that in the 90% of the cases the average capacity remains above 2.1 b/s/Hz utilizing ULA antennas, and above 4.6 b/s/Hz in case of URA antenna configurations.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Switching Wireless Control for Longitudinal Quadrotor Maneuvers",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10846-021-01405-2",
            "Abstract": "To improve the maneuverability of remotely guided quadrotors in longitudinal motion, the design goal of independent control of the horizontal and the vertical velocity, is satisfied. For the sake of the communication delays, a synchronization/signal reconstruction algorithm, imposing constant delays, is applied and the design goal is satisfied by introducing a stepwise safe switching procedure for time delay dynamic controllers. The proposed controllers are designed to satisfy I/O decoupling, stability and atmospheric disturbance attenuation. The controllers are determined via a mixed analytic and metaheuristic design procedure. To increase the range of the external commands, the stepwise safe switching algorithm is based on the approximate minimization of a composite criterion including the infinity norm and the H 2 norm of the variations around trim points under hard constraints for the steady state performance …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Delay-and diversity-aware buffer-aided relay selection policies in cooperative networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7565048/",
            "Abstract": "In this paper, we propose novel relay selection policies that aim at reducing the average delay by incorporating the buffer size of the relay nodes into the relay selection process. More specifically, we propose two delay-aware protocols that are based on the max - link relay selection protocol. First, a delay-aware only approach while it reduces the delays considerably it starves the buffers and increases the outage probability of the system. Towards this end, we propose a delay- and diversity-aware buffer-aided relay selection policy that aims at reducing the average delay considerably and at the same time maintaining good diversity. The protocols are analyzed by means of Markov Chains and expressions for the outage, throughput and delay are derived. The performance and use of our proposed algorithms is demonstrated via extensive simulations and comparisons.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Theoretical Analysis of the Coexistence of Direct Sequence Spread Spectrum and Analog FM Systems",
            "Publication year": 2002,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:M3ejUd6NZC8C",
            "Publisher": "WSEAS"
        },
        {
            "Title": "Semi-automatic e-chartering through multi-agent systems and satellite IP networks",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJIPT.2009.028658",
            "Abstract": "This paper proposes a semi-automatic e-chartering in maritime markets though distributed multi-agent infrastructure over satellite IP networks. Using a distributed Multi-Agent system for Internet Virtual Chartering Markets (MAVCM) in each maritime port and the satellite information from participating vessels, we propose a mechanism for semi-automatic control and creation of e-chartering contracts services. The MAVCM system applies for business-to-business transactions in maritime markets, and provides mechanisms for Internet-based chartering informational and transactional services. The proposed system is based on Shipowners and shippers maritime contracts through the MAVCM infrastructure, services and satellite monitoring of the vessels.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:4DMP91E08xMC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Emergency m-health services through high-speed 3G systems: Simulation and performance evaluation",
            "Publication year": 2007,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0037549707083113",
            "Abstract": "The present paper studies the prospective and the performance of a forthcoming                 high-speed third-generation (3G) networking technology called High Speed Packet                 Access (HSPA) for delivering emergency m-health applications. The joint transmission                 of voice, real-time video, medical data such as electrocardiogram, vital signals,                 heart sound and file transfer is performed for both uplink and downlink. Various                 scenarios are involved in terms of emergency situations in random locations, where                 no other system but 3G is available. The accomplishment of quality of service (QoS)                 is explored through a step-by-step improvement of HSPA systems parameters,                 incorporating admission and congestion control elements and the use of                 prioritization for m-health services. HSPA managed to meet the requirements for                 emergency m-health …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:qjMakFHDy7sC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Feasibility study of a joint e-health mobile high-speed and wireless sensor system",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1389586.1389615",
            "Abstract": "The present paper studies the prospective and the performance of a forthcoming high-speed third-generation (3.5 G) networking technology, called Enhanced Uplink, in collaboration with the well known wireless sensor technology, for delivering electronic health (e-health) pervasive applications. The performance of the sensor network along with the 3.5 G network is a critical factor for successful development of e-health services perceived by end-users. In this paper, we propose a methodology for performance assessment based on the joint uplink transmission of voice, realtime video, biological data, such us electrocardiogram, vital signals and heart sounds. Various scenarios were concerned for homecare patient applications in terms of real-time and non-realtime in random locations, where no other system but 3.5 G is available. The accomplishment of quality of service (QoS) was explored through the delay and …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance analysis of a two-hop MIMO mobile-to-mobile via stratospheric-relay link employing hierarchical modulation",
            "Publication year": 2013,
            "Publication url": "https://www.hindawi.com/journals/ijap/2013/935609/",
            "Abstract": "Next generation wireless communication networks intend to take advantage of the integration of terrestrial and aerospace infrastructures. Besides, multiple-input multiple-output (MIMO) architecture is the key technology, which has brought the wireless gigabit vision closer to reality. In this direction, high-altitude platforms (HAPs) could act as relay stations in the stratosphere transferring information from an uplink to a downlink MIMO channel. This paper investigates the performance of a novel transmission scheme for the delivery of mobile-to-mobile (M-to-M) services via a stratospheric relay. It is assumed that the source, relay, and destination nodes are equipped with multiple antennas and that amplify-and-forward (AF) relaying is adopted. The performance is analyzed through rigorous simulations in terms of the bit-error rate (BER) by using a recently proposed 3D geometry-based reference model in spatially correlated flat-fading MIMO channels, employing a hierarchical broadcast technique and minimum mean square error (MMSE) receivers.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:blknAaTinKkC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "E-health performance assessment of an interactive satellite network infrastructure",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.701.7338&rep=rep1&type=pdf",
            "Abstract": "Objective: To develop and evaluate a low cost satellite system suitable for supporting homecare through teleconferencing and medical data acquisition.Setting: The system can be used in remote locations that lack a proper communications infrastructure.Design: Developmental study.Methods: The system is based on Digital Video Broadcasting with Return Channel via Satellite (DVB-RCS) technology, and utilises low cost satellite interactive terminals (SITs) to send and receive data. Remote sites are equipped with a special communication unit (videoconference unit or internet protocol phone) and may also incorporate a medical data acquisition unit. To evaluate our proposed model, experiments were performed using two SITs communicating through a DVB-RCS hub. Tests were performed using videoconference, voice communication (voice over internet protocol–VoIP) and simulated medical data. The medical data was transferred at a constant rate of 20 kbps whilst different fixed and dynamic rates were used for the videoconferencing and voice transmission.Results: The results showed that SIT transmission rates at 384 kbps (64 kbps guaranteed bandwidth) supports combined videoconference and medical data transfer with satisfactory video quality. Transmission rates at 128 kbps (48 kbps guaranteed bandwidth) are sufficient to support high-quality VoIP communication and medical data transmission together. Testing also demonstrated that medical data transfer was not seriously affected by voice or video transfer (approximately zero packet losses) and was almost constant during the majority of the tests.Conclusion: DVB-RCS can be …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Radio Resource Allocation Algorithms for Multi-Service OFDMA Networks: The Uniform Power Loading Scenario",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-013-9784-0",
            "Abstract": "Adaptive Radio Resource Allocation is essential for guaranteeing high bandwidth and power utilization as well as satisfying heterogeneous Quality-of-Service requests regarding next generation broadband multicarrier wireless access networks like LTE and Mobile WiMAX. A downlink OFDMA single-cell scenario is considered where heterogeneous Constant-Bit-Rate and Best-Effort QoS profiles coexist and the power is uniformly spread over the system bandwidth utilizing a Uniform Power Loading (UPL) scenario. We express this particular QoS provision scenario in mathematical terms, as a variation of the well-known generalized assignment problem answered in the combinatorial optimization field. Based on this concept, we propose two heuristic search algorithms for dynamically allocating subchannels to the competing QoS classes and users which are executed under polynomially-bounded cost. We …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer"
        },
        {
            "Title": "Propagation Study and Performance Evaluation of a Mobile WiMAX System at 3.5 GHz",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5963375/",
            "Abstract": "This paper is focused on a detailed coverage and performance analysis of wireless metropolitan area networks based on the IEEE 802.16 standard, which is the basis of WiMAX technology. A coverage study and performance evaluation of a mobile WiMAX system in an urban and suburban environment with the help of a software simulation tool is presented. All the required parameters are given to the program focusing only in suitable propagation models e.g. ITU-R 525/526, or COST231-HATA. The total coverage of the area was 67% from which 52% provides QAM modulation offering higher data rates to the users. Very promising results were also extracted, when utilizing multiple antennas. It is also found that in a 4 2 system the average received power at the limits of each cell is enhanced about 6.1 dB in comparison with the SISO case.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling buffer-aided relay selection in networks with direct transmission capability",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7039198/",
            "Abstract": "We consider a wireless relay network that consists of a source, half-duplex decode-and-forward buffer-aided relays and a destination. While the majority of previous works on relay selection assume no direct transmission between source and destination in such a setting, we lift this assumption and propose a link selection policy that exploits both the buffering ability and the opportunity for successful reception of a packet directly from the source. The proposed relay selection scheme incorporates the instantaneous strength of the wireless links and adapts the relay selection decision based on the strongest available link. The evolution of the network as a whole is modeled by means of a Markov chain and thus, the outage probability is associated with the steady state of the Markov chain. It is deduced that even if the link between the source and the destination is in principle a very unreliable link, it is always beneficial …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-complexity buffer-aided link selection with outdated CSI and feedback errors",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8328875/",
            "Abstract": "Buffer-aided relays can improve the diversity of multi-hop networks, however, they increase packet delays. Thus, various delay-aware protocols have been developed, but without considering the transmission diversity. Moreover, most works adopt ideal assumptions, such as symmetric links, perfect channel state information (CSI), and error-free feedback channels. So, we propose a low-complexity (LoCo) link selection algorithm, herein called LoCo-Link. The proposed algorithm may experience delays during CSI updates, and hence, by using outdated CSI its performance may deteriorate. To alleviate this issue, we next propose a distributed version of LoCo-Link (d-LoCo-Link) dealing with outdated CSI. In both algorithms, the source performs broadcasting toward multiple relays; when the packets are transmitted by a relay to the destination, they are discarded from all other relays. This coordination relies on …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integrated NAN architecture for smart energy grid",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8398753/",
            "Abstract": "The Legacy Energy Grid that has being serving the needs for electricity, nowadays is considered obsolete. Issues such as electric outages, its centralized architecture, the limited use of communications and computer systems cause the immediate need for upgrade. The advanced successor is the Smart Energy Grid which has as main characteristics a distributed architecture exploiting communication technologies, networking and computer infrastructure which are ubiquitous and bidirectional to provide robust coverage to power systems modules, thus achieving integration of energy and communication systems. Focusing on these issues, this paper proposes an architecture for Smart Grid Neighborhood Area Networks (SG NANs). The developed communication system is characterized by heterogeneity incorporating Ethernet bus network (IEEE 802.3) adopting Carrier Sense Multiple Access with Collision Avoidance …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Buffer-aided successive opportunistic relaying with inter-relay interference cancellation",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6666343/",
            "Abstract": "In this paper we consider a simple cooperative network consisting of a source, a destination and a cluster of decode-and-forward relays characterized by the half-duplex constraint. At each time-slot the source and (possibly) one of the relays transmit a packet to another relay and the destination, respectively. When the source and a relay transmit simultaneously, inter-relay interference is introduced at the receiving relay. In this work, with the aid of buffers at the relays, we mitigate the detrimental effect of inter-relay interference through either interference cancellation or mitigation. More specifically, we propose the min-power opportunistic relaying protocol that minimizes the total energy expenditure per time slot under an inter-relay interference cancellation scheme. The min-power relay-pair selection scheme, apart from minimizing the energy expenditure, also provides better throughput and lower outage probability …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comparison of point to point and MBSFN transmissions in next generation mobile networks",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2989250.2989273",
            "Abstract": "Multicast/Broadcast Multicast Service over Single Frequency Network (MBSFN) technology has introduced advanced broadcast capabilities to cellular systems. In Long Term Evolution Advanced (LTE-A) systems, MBSFN transmission accommodates multicast groups in search of the same data. In this paper we compare the traditional Point-to-Point (PTP) communication with the MBSFN services through simulation experiments for various femtocell distributions and network configurations. The comparison takes into account the average throughput, overhead cost, energy consumption and capacity gain, concluding that MBSFN through multicast transmission may guarantee performance improvement even for users in the cell boundaries.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Joint relay‐pair selection for buffer‐aided successive opportunistic relaying",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.2718",
            "Abstract": "In this work, we present a buffer‐aided successive opportunistic relaying scheme that aims at improving the average capacity of the network when inter‐relay interference arises between relays that are selected for simultaneous transmission and reception. We propose a relay selection policy that, by exploiting the benefits of buffering at the relays, decouples the receiving relay at the previous time slot to be the transmitting relay at the next slot. Furthermore, we impose an interference cancellation threshold allowing the relay that is selected for reception to decode and subtract the inter‐relay interference. The proposed relaying scheme selects the relaying pair that maximises the average capacity of the relay network. Its performance is evaluated through simulations and comparisons with other state‐of‐the‐art half‐duplex and full‐duplex relay selection schemes, in terms of outage probability, average capacity and …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A UAV-based moving 5G RAN for massive connectivity of mobile users and IoT devices",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2214209620300218",
            "Abstract": "Currently, the coexistence of multiple users and devices challenges the network's ability to reliably connect them. This article proposes a novel communication architecture that satisfies the requirements of fifth-generation (5G) mobile network applications. In particular, this architecture extends and combines ultra-dense networking (UDN), multi-access edge computing (MEC), and virtual infrastructure manager (VIM) concepts to provide a flexible network of moving radio access (RA) nodes, flying or moving to areas where users and devices struggle for connectivity and data rate. Furthermore, advances in radio communications and non-orthogonal multiple access (NOMA), virtualization technologies and energy-awareness mechanisms are integrated towards a mobile UDN that not only allows RA nodes to follow the user but also enables the virtualized network functions (VNFs) to adapt to user mobility by migrating …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:vRqMK49ujn8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Flex-NOMA: exploiting buffer-aided relay selection for massive connectivity in the 5G uplink",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8755299/",
            "Abstract": "The success of fifth generation (5G) mobile network and its long-term evolution (LTE) relies on enabling demanding services with massive connectivity requirements, including Internet of Things (IoT) nodes, mobile devices, or unmanned aerial vehicles (UAVs). Towards this end, non-orthogonal multiple access (NOMA) schemes allow multiple users and devices to communicate using the same temporal and spectral resources. In this context, buffer-aided (BA) relay selection can significantly enhance the quality and reliability of communication, through increased diversity. So, in this paper, we employ BA relay selection in the uplink of the NOMA networks where users and devices coexist and demand access to the wireless resources. The presented relay selection policy, namely flex - NOMA, facilitates simultaneous transmissions from multiple sources to multiple relays, exploiting channel state information at the …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Feasibility study for direct sequence spread spectrum and TV services overlay",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1543670/",
            "Abstract": "In this paper we examine the conditions under which direct sequence spread spectrum systems can share the same spectrum with television services. The maximum spread spectrum transmit power is first estimated and the correspondent protection rates for the TV services are derived, along with the relevant image degradation. For the proposed protection ratios the performance of the direct sequence spread spectrum system is examined in order to derive the relevant BER and maximum achievable data rates.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ANN prediction models for outdoor SIMO millimeter band system",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-74161-1_31",
            "Abstract": "This paper presents the prediction propagation paths of angle of arrivals (AoAs) of a Smart Antenna System in an outdoor environment utilizing Artificial Neural Networks (ANN). The proposed models consist of a Multilayer Perceptron and a Generalized Regression Neural Network trained with measurements of an antenna system consisted of a Single Input Single Output (SISO) system in the millimeter wave band. For comparison purposes the theoretical Gaussian scatter density model was investigated for the derivation of the power angle profile. The proposed models utilize the characteristics of the environment for prediction of the angle of arrivals of each one of the propagation paths and can be applicable for the derivation of SIMO (Single Input Single Output) parameters, such as system capacity. The results are presented towards the average error, standard deviation and mean square error compared …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "LoLa4SOR: Leveraging Successive Transmissions for Low-Latency Buffer-Aided Opportunistic Relay Networks",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9420712/",
            "Abstract": "Buffer-aided (BA) relaying improves the diversity of cooperative networks often at the cost of increasing end-to-end packet delays. This characteristic renders BA relaying unsuitable for delay-sensitive applications. However, the increased diversity makes BA relaying appealing for ultra-reliable communications. Towards enabling ultra-reliable low-latency communication (URLLC), we aim at enhancing BA relaying for supporting delay-sensitive applications. In this paper, reliable full-duplex (FD) network operation is targeted and for this purpose, hybrid relay selection algorithms are formulated, combining BA successive relaying (SuR) and delay- and diversity-aware (DDA) half-duplex (HD) algorithms. In this context, a hybrid FD DDA algorithm is presented, namely LoLa4SOR, switching between SuR and HD operation. Additionally, a low-complexity distributed version is given, namely d-LoLa4SOR, providing a trade-off among …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Beamforming techniques for wireless MIMO relay networks",
            "Publication year": 2014,
            "Publication url": "https://www.hindawi.com/journals/ijap/2014/354714/",
            "Abstract": "The continuous increase in mobile data traffic creates the need for radical innovations in the mobile broadband system design. The demand for high-speed and interference-free transmission and reception is inevitable and one sine qua non condition is the efficient spatial reuse. However, increasing traffic within a fixed limited bandwidth creates more interference in the system and degrades the signal quality. Multiple-input multiple-output (MIMO) techniques offer many benefits in practical wireless systems including capacity and spectral efficiency increment, fading mitigation, and improved resistance to interference. Beamforming is a multiantenna technique that significantly reduces interference and improves system capacity.An emerging research trend considers relays in terrestrial and satellite networks as the most promising proposal for achieving significant performance gains. Enhanced reliability and extended cell coverage are two of the advantages the relay networks offer. Relay networks encompass amplify-andforward (AF) and decode-and-forward (DF) protocols, fulland half-duplex operation, experience fading and interference, and incorporate power constraints. Although beamforming techniques at the source and/or the destination in a relay network have been examined, their use in MIMO relay networks has been recently proposed and is expected to overcome crucial obstacles in terms of capacity and interference. It is thus expected to contribute to the performance of the network, while combining various attributes of networks’ design parameters.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Machine learning-based methods for path loss prediction in urban environment for LTE networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9253369/",
            "Abstract": "This paper presents prediction path loss models in an urban environment for cellular networks with the help of machine learning methods. For this goal, Support Vector Regression (SVR), Random Forest (RF) and K-Nearest Neighbor (KNN) algorithms are exploited and assessed. The training and testing procedure is carried out with the help of a path loss dataset generated by simulated results considering a Long Term Evolution (LTE) network utilizing a digital terrain model. The simulation takes into account an urban environment for both line-of-sight (LOS) and non-LOS (NLOS) propagation condition. The results reveal that all the evaluated algorithms forecast path loss with a remarkable accuracy, providing root-mean-square errors on the order of 2. 1-2.2dB for LOS and 3. 4-4.1dB for NLOS locations, respectively. Among the examined algorithms, KNN shows the best performance, thus being an appealing option …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Localization error modeling of hybrid fingerprint-based techniques for indoor ultra-wideband systems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-015-0116-4",
            "Abstract": "Acquiring an accurate estimate of a device’s indoor position can lead to the development of various services, such as disaster recovery, content delivery and efficient point-to-point communications. To this end, different positioning techniques have been developed aiming to minimize the localization error. UWB signals are well-suited to communication and tracking systems, as they provide increased tolerance to localization errors due to the fine time resolution of the transmitted pulses and their large bandwidth. This work presents two indoor Ultra-Wideband (UWB) positioning schemes based on the hybrid combination of Fingerprinting with temporal or angular data. The proposed schemes are evaluated using five different propagation models and different numbers of Anchor Nodes (AN) that emit omnidirectional UWB signals. Then, measures are gathered for these parameters and results are presented in …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Enhanced dedicated channel scheduling optimization in WCDMA",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4623867/",
            "Abstract": "Enhanced Uplink operation of WCDMA-UMTS systems utilizes fast Node B scheduling and a short Transmission Time Interval (TTI) of 2ms. The scheduling decisions are based on scheduling information (SI) sent by each UE to the Node B. The main drawback of the current scheduling procedure is that the SI does not include any information regarding the delay sensitivity of each traffic flow, as well as the actual delay that the buffered data have experienced. In this paper, we propose the inclusion of such information in SI by introducing a modification of the respective 3GPP specifications. Furthermore, we propose a Dynamic Priority Scheduler (DPS), which can utilize this new information. The performance of the proposed scheme is evaluated by means of system level simulations.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental Approach of the Quality of Analog Receivers in an Overlay Spread Spectrum Scenario",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.12.1105&rep=rep1&type=pdf",
            "Abstract": "This paper presents results of a laboratory test held to examine the conditions under which analog PAL-G and analog FM signals can share spectrum with Spread Spectrum systems. RF protection ratios and SNR Degradation for both PAL-G television and FM radio systems are derived in the case of co-channel spread spectrum interference. Results for different Spread Spectrum RF bandwidths and carrier frequency offsets between the analogue and digital signals are also included in the experiments.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pervasive E-health services using the DVB-RCS communication technology",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s10916-007-9061-4",
            "Abstract": "Two-way satellite broadband communication technologies, such as the Digital Video Broadcasting with Return Channel via Satellite (DVB-RCS) technology, endeavour to offer attractive wide-area broadband connectivity for telemedicine applications, taking into consideration the available data rates, Quality of Service (QoS) provision, survivability, flexibility and operational costs, even in remote areas and isolated regions where the terrestrial technologies suffer. This paper describes a wide-area tele-medicine platform, specially suited for homecare services, based on the DVB-RCS and Wi-Fi communication technologies. The presented platform combines medical data acquisition and transfer, patient remote monitoring and teleconference services. Possible operational scenarios concerning this platform and experimental results regarding tele-monitoring, videoconference and medical data transfer are also …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Enhanced Integrated Satellite-Terrestrial NOMA with Cooperative Device-to-Device Communication",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/820028",
            "Abstract": "The currently deployed terrestrial wireless networks experience difficulties while coping with the massive connectivity demands of coexisting users and devices. The addition of satellite segments has been proposed as a viable way of providing improved coverage and capacity, leading to the formation of integrated satellite-terrestrial networks. In such topologies, non-orthogonal multiple access (NOMA) can further enhance the efficient use of wireless resources by simultaneously serving multiple users. In this paper, an integrated satellite-terrestrial NOMA network is studied where cooperation between ground users is allowed, following the device-to-device (D2D) paradigm. More specifically, the proposed satellite NOMA cooperative (SANOCO) D2D scheme optimally selects pairs of users, by considering the channel conditions of the satellite and the terrestrial D2D links. In SANOCO-D2D users are served through NOMA in the satellite link, and then, if the weak user fails to decode its signal, terrestrial D2D communication is activated to maintain the total sum rate of the system. Comparisons with conventional orthogonal multiple access (OMA) and an alternative NOMA optimal user pairing scheme show that significant sum rate and spectral efficiency gains can be harvested through SANOCO-D2D under varying channel conditions and terrestrial D2D bandwidth. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:sSrBHYA8nusC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A Successive Opportunistic Relaying Protocol with Inter-Relay Interference Mitigation",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6314208/",
            "Abstract": "In this work, we present a successive opportunistic relaying protocol with an inter-relay interference (IRI) mitigation scheme, in a quasi-static environment with Rayleigh fading. In order to recover the half duplex loss of the transmission, we adopt a successive relaying (SR) strategy, coupled with reactive relay selection considering the Signal to Noise Ratio (SNR) and the Signal to Interference plus Noise Ratio (SINR) of each hop, after every source transmission. The main degrading factor in this scheme is the IRI introduced by the best relay, which is selected to forward the previous frame, while the rest of the relays are receiving the current source frame. Trying to cancel the effect of IRI, we employ interference cancelation (IC) to subtract the interference signal depending on the capacity of the interference channel.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Relay selection for secure 5G green communications",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-014-9890-7",
            "Abstract": "In this article, we present relay selection policies in applications with secrecy requirements which are of interest in the fifth generation (5G) of wireless networks. More specifically, we provide a classification of relays based on their distinct communication attributes, such as processing, multiple antennas, storage, channel estimation, density and security level. In addition, we discuss the level of efficiency exhibited by each relay class, regarding their impact in delay-critical applications and green communications applications, while aiming at a specific security level at the physical layer. Then, relay selection policies are proposed taking into consideration the goals set by each application. Numerical evaluation of the proposed policies in terms of the average secrecy rate, average delay and power reduction show improved performance compared to other state-of-the-art solutions.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Efficient Spectrum Sharing in the Presence of Multiple Narrowband Interference",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1211.4445",
            "Abstract": "In this paper, we study the spectrum usage efficiency by applying wideband methods and systems to the existing analog systems and applications. The essential motivation of this work is to define the prospective coexistence between analog FM and digital Spread Spectrum systems in an efficient way sharing the same frequency band. The potential overlaid Spread Spectrum (SS) system can spectrally coincide within the existing narrowband Frequency Modulated (FM) broadcasting system upon several limitations, originating a key motivation for the use of the FM radio frequency band in many applications, encompassing wireless personal and sensors networks. The performance of the SS system due to the overlaying analog FM system, consisting of multiple narrowband FM stations, is investigated in order to derive the relevant bit error probability and maximum achievable data rates. The SS system uses direct sequence (DS) spreading, through maximal length pseudorandom sequences with long spreading codes. The SS signal is evaluated throughout theoretical and simulation-based performance analysis, for various types of spreading scenarios, for different carrier frequency offset ({\\Delta}f) and signal-to-interference ratios, in order to derive valuable results for future developing and planning of an overlay scenario.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MCS selection exploiting femtocell utilization in multicast transmissions",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.3585",
            "Abstract": "Multicast‐Broadcast over Single Frequency Network (MBSFN) technology, as introduced by the Long Term Evolution Advanced group, is expected to be part of the upcoming cellular systems offering resource efficiency to broadcast services. MBSFN transmission is suitable to serve multicast groups searching the same content. In addition, the fast emerging technology of femtocells networks and their hybrid nature can lead to efficient resource sharing between non‐subscribed users when located inside their coverage. The focus of this manuscript is 2‐fold; firstly, we have contacted simulation experiments to compare the MBSFN transmission with the traditional Point‐To‐Point transmission for various femtocell distributions and network topology changes; secondly, a novel multicast transmissions mechanism is proposed from non‐subscribed users who exploit femtocells resources for broadcast services, without …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilization of hybrid access femtocells during multicast transmissions in mobile networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7561030/",
            "Abstract": "Femtocells enhance indoor coverage of mobile services using the owner's broadband connection. They were initially designed to serve a number of subscribed User Equipments within their range. This design however, resulted in underutilization of the femtocells resources, and simultaneously in high interference levels for nearby non-subscribed users. Nowadays, femtocells can support multicast transmissions, while their hybrid operation allows non-subscribed users to use a portion of their resources. In this paper we propose a novel mechanism that is based on the selection of the appropriate Modulation and Coding Scheme. The mechanism allows non-subscribed users to utilize a portion of the femtocells' resources for multicast transmissions when located inside their coverage, without affecting the owners' satisfaction. The simulation results show that depending on the portion of the femtocells' resources …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrating broadcasting and NOMA in full-duplex buffer-aided opportunistic relay networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9107483/",
            "Abstract": "This paper proposes the integration of non-orthogonal multiple access (NOMA) and broadcasting with buffer-aided (BA) full-duplex (FD) relaying to improve the spectral efficiency of a single-source two-user network. Furthermore, opportunistic relay selection is employed, activating one or two FD relays to support the end-to-end communication. The network performance is improved through buffers, allowing to switch to half-duplex (HD) transmission/reception when FD operation is not feasible. A hybrid BA FD/HD NOMA relay selection algorithm is proposed, herein called   , orchestrating the three aforementioned techniques, towards a simple yet efficient and robust relay selection.    is evaluated in terms of outage probability, average sum-rate and average delay, and it is observed that the average sum-rate can be doubled, while maintaining low latency.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance degradation of analog FM system due to spread spectrum overlay",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1208426/",
            "Abstract": "The investigation of spectrum overlay of a spread spectrum system on the existing narrowband FM broadcasting system is presented. The overlaid spread spectrum (SS) system is assumed to utilize direct sequence (DS) spreading, using maximal length pseudorandom sequences. We studied the performance degradation of the analog FM system due to the interference produced by the SS signal, through laboratory subjective and objective measurements, for various types of spreading scenarios and for different carrier frequency differences (/spl Delta/f). The RF protection ratios for the FM receivers are derived, along with SINAD measurements. Finally, these experimental results have been compared with the theoretical study of the FM receiver's audio frequency SNR output due to SS interference.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Delay-and diversity-aware buffer-aided relay selection policies in cooperative networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8552352/",
            "Abstract": "Buffer-Aided (BA) relaying has shown tremendous performance improvements in terms of throughput and outage probability, although it has been criticized of suffering from long delays that are restrictive for applications, such as video streaming, Web browsing, and file sharing. In this paper, we propose novel relay selection policies aiming at reducing the average delay by incorporating the buffer size of the relays into the decision making of the relay selection process. More specifically, we first propose two new delay-aware policies. One is based on the hybrid relay selection algorithm, where the relay selection takes into account the queue sizes so that the delay is reduced and the diversity is maintained. The other approach is based on the max - link relay selection algorithm. For the max - link algorithm, a delay-aware only approach starves the buffers and increases the outage probability of the system. Thus, for …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measurements for 2.4 GHz spread spectrum system in modern office buildings",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/880432/",
            "Abstract": "The implementation of wireless communications inside office buildings requires the profound knowledge of signal penetration within buildings. This paper contributes to the modeling of propagation losses and measurement techniques in modern office buildings by presenting measurement results in 2.4 GHz range. The measurements were conducted within National Technical University premises in Athens, Greece. The purpose of the measurement campaign was to study the radiocoverage of the three-floor story building. The measurement procedure involved field measurements of a spread spectrum system. The measurement system and experimental procedures are described and analysis results are presented. Specifically, path loss is presented as a function of true and covered distance as well as comparative plots for the corridors and rooms of the three floors of the building. Path loss contour plots are also …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Prediction Models of an Indoor Smart Antenna System Using Artificial Neural Networks",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vLiTXDHr_sYC&oi=fnd&pg=PA320&dq=info:iO89sRGPDR4J:scholar.google.com&ots=CZnytt2Cok&sig=dfEAnENePFkqvPlDMgmoszy72Kk",
            "Abstract": "This study presents the prediction propagation paths of angle of arrivals (AoAs) of a Smart Antenna System in an indoor environment utilizing Artificial Neural Networks (ANN). The proposed models consist of a Multilayer Perceptron and a Generalized Regression Neural Network trained with measurements. For comparison purposes the theoretical Gaussian scatter density model was investigated for the derivation of the power angle profile. The antenna system consisted of a Single Input Multiple Output (SIMO) system with two or four antenna elements at the receiver site and the realized antenna configuration comprised of Uniform Linear Arrays (ULAs). The proposed models utilize the characteristics of the environment, the antenna elements and their spacing for prediction of the angle of arrivals of each one of the propagation paths. The results are presented towards the average error, standard deviation and mean square error compared with the measurements and they are capable for the derivation of accurate prediction models for the case of AoA in an indoor millimeter wave propagation environment.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid cooperation through full-duplex opportunistic relaying and max-link relay selection with transmit power adaptation",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6884231/",
            "Abstract": "In this work, we study a cooperative network with multiple full-duplex buffer-aided relays. A hybrid cooperative relaying policy is proposed that employs power adaptation and consists of two alternative schemes: (i) full-duplex transmission through the relay which requires the least total power expenditure and loop interference is mitigated through power adaptation; (ii) buffer-aided max - link selection with power adaptation, when full-duplexity is not feasible. Aiming to reduce the overhead of channel state information (CSI) acquisition and processing, we propose a suboptimal distributed method for relay selection, for which the network performance is not degraded significantly. We show that power adaptation offers reduced overhead of CSI acquisition. Numerical results and comparisons with other state-of-the-art relaying schemes are provided and performance evaluation in terms of throughput, power minimization …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Independent motion control of a tower crane through wireless sensor and actuator networks",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0019057815002876",
            "Abstract": "The problem of independent control of the performance variables of a tower crane through a wireless sensor and actuator network is investigated. The complete nonlinear mathematical model of the tower crane is developed. Based on appropriate data driven norms an accurate linear approximant of the system, including an upper bound of the communication delays, is derived. Using this linear approximant, a dynamic measurable output multi delay controller for independent control of the performance outputs of the system is proposed. The controller performs satisfactory despite the nonlinearities of the model and the communication delays of the wireless network.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Enabling the provision of secure web based m‐health services utilizing XML based security models",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.46",
            "Abstract": "It has been generally agreed that the security of electronic patient records and generally e‐health applications must meet or exceed the standard security that should be applied to paper medical records, yet the absence of clarity on the proper goals of protection has led to confusion. The primary purpose of this study was to investigate appropriate security mechanisms, which will help clinical professionals and patients discharge their ethical and legal responsibilities by selecting suitable systems and operating them safely and in short order. Thus, in this paper we propose a security model based on XML with the intention of developing a fast security policy mostly intended for mobile healthcare information systems. The proposed schema consists of a set of principles based on XML security models through the use of partial encryption, signature and integrity services and it was implemented by means of a web …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Capacity Evaluation of a Land Mobile Satellite System Utilizing Multiple Element Antennas.",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/53499967/Capacity_Evaluation_of_a_Land_Mobile_Sat20170614-23169-z3vskg.pdf",
            "Abstract": "Land Mobile Satellite (LMS) systems can exploit multiple-input-multiple-output (MIMO) techniques in order to achieve high transmission rates. This paper evaluates theoretically the capacity of single-input-multiple-output (SIMO) system utilizing uniform linear arrays at the receiver terminal for satellite applications. The theoretical study is performed at three different frequency bands. Sufficient capacities are achieved varying between 5 and 6.2 b/s/Hz at L and S bands being almost independent from the elevation angle. In Ku band the capacity is highly variable with the elevation angle, taking values between 2 and 5.9 b/s/Hz, whereas the maximum capacity values are observed in a blocked environment. At L and S bands the capacity is uncorrelated with distance for element spacing up to 1.5 cm and varies between 5.5 and 6 b/s/Hz. In Ku band the capacity is highly variable with the element spacing and maximizes for distances between 1 and 1.5 cm.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building entry loss and capacity evaluation of a UAV‐to‐indoor dual‐polarised MIMO channel",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/pdf/10.1049/iet-map.2019.0414",
            "Abstract": "This study presents building entry loss and capacity results obtained from an unmanned aerial vehicle (UAV)‐to‐indoor narrowband dual‐polarised multiple‐input–multiple‐output (MIMO) channel measurement campaign. Six different measurement scenarios were carried out with the transmitter (Tx) located on a low altitude platform (LAP) and the receiver (Rx) at various floors and distances from the external windows of a multi‐storey building. An analytic and simple procedure is proposed for the calculation of entry loss. The results reveal that there is a strong dependence on the propagation geometry and the orientation of the receiver with respect to the moving LAP transmitter. The processed data for both entry loss and capacity indicate a two‐state process that is closely related to the Tx–Rx relative azimuth and elevation angle. The average entry loss levels vary from 33 to 50 dB. The overall ergodic capacity …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:08ZZubdj9fEC",
            "Publisher": "The Institution of Engineering and Technology"
        },
        {
            "Title": "QOS study performance of an integrated satellite telemedicine platform",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394342/",
            "Abstract": "This paper describes a wide-area tele-medicine platform, specially suited for homecare services, based on the DVB-RCS and Wi-Fi communication technologies. Implementation of DVB-RCS, utilizing dynamic assignment techniques mandated in the DVB-RCS specification, has been specifically designed and tuned for multimedia and high-speed data transfer. The monitored patients can be practically anywhere, even in geographically dispersed and isolated areas, where normally there is no terrestrial communications infrastructure capable of supporting similar services. The presented platform combines medical data acquisition and transfer, patient remote monitoring and teleconference services. Possible operational scenarios simulated and results regarding available data rates, quality of service (QoS) provision, and prioritization of tele-monitoring, videoconference and medical data transfer are provided and …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal 3-D aerial relay placement for multi-user MIMO communications",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8657707/",
            "Abstract": "In this paper, an airborne multi-user (MU) multiple-input multiple-output (MIMO) communication system is investigated, consisting of multiple users sources, multiple users destinations, and an aerial platform acting as a decode-and-forward (DF) relay. In this context, a novel three-dimensional (3-D) geometry-based optimization method for the relay location is proposed and expressions for the outage probability are presented. The results highlight the impact of the relay position, power allocation, fading severity, and number of antennas on the system performance.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy consumption measurement and analysis in wireless sensor networks for biomedical applications",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2141622.2141661",
            "Abstract": "Energy Consumption in Wireless Sensor Networks is a fundamental issue in terms of functionality and network lifetime. Minimization of energy consumption by applying optimization techniques enables pervasive computing especially in the field of biomedical engineering. A framework for energy consumption measurement and analysis is proposed which combines a theoretical approach, a simulation procedure based on a widely used software simulator and the validation by means of a high sensitivity measurement setup. Application driven profiling of energy consumption at the node level is a useful tool for optimal function of energy consumable node components in order to improve total energy efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fair TDMA scheduling in wireless multihop networks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-010-9397-9",
            "Abstract": "In wireless multihop networks, communication between two end-nodes is carried out by hopping over multiple wireless links. However, the fact that each node has to transmit not only its own traffic, but also traffic on behalf of other nodes, leads to unfairness among the communication rates of the nodes. Traditional Carrier Sense Multiple Access/Collision Avoidance (CSMA/CA) based media access control does not work satisfactory in a multihop scenario, since an intended target of a communication may be subject to mutual interference imposed by concurrent transmissions from nodes, which cannot directly sense each other, thus causing unfair throughput allocation. Although Time Division Multiple Access (TDMA) seems to be a more promising solution, careful transmission scheduling is needed in order to achieve error-free communication and fairness. Several algorithms may be found in the literature for …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer US"
        },
        {
            "Title": "EPIKOUROS—Virtualized platforms using heterogeneous sensor services in cloud computing environment",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6934461/",
            "Abstract": "EPIKOUROS is an innovative project where methodologies and tools will be developed for designing, building and deploying Internet-of-Things applications on Virtual Environments. EPIKOUROS main goal is to design and develop a virtualized middleware platform that would allow easily creating and structuring environments. In turn, it would allow the collection, management and integration of information generated by multiple sensors and sensor-networks, as well as the management of business process procedures that are supported by the sensors' infrastructure. The project will use as proof-of-concept scenarios from independent living, intelligent/multimodal transport and building management.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Feasibility study of a hspa backhauling over satellite for crisis management",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5956478/",
            "Abstract": "The present paper studies the performance of a high-speed third- generation (3.5G) networking technology, HSPA (High Speed Packet Access), for delivering crisis management and emergency e-health applications under urgent situations via satellite backhauling. The performance of a joint network comprised by wireless sensors, the 3.5G and satellite networks is a critical factor for successful development of emergency services perceived by end-users during a disaster situation. In this paper, we propose an emergency system architecture for performance assessment based on the joint transmission of voice, real-time video, vital data and healthcare records file transfer between the disaster-site and the safe-site. Three scenarios were concerned in terms of real-time, non-real- time and emergency applications in random locations, where no other system but 3.5G is available in case of crisis or disaster. The …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity evaluation of a satellite-to-indoor narrowband dual polarized MIMO channel",
            "Publication year": 2018,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/cp.2018.0623",
            "Abstract": "This paper presents the measurement results of a satellite-to-indoor dual-polarized multiple-input-multiple-output (MIMO) channel. Six different measurement scenarios were carried out with the transmitter located on an airship and the receiver inside a building at different floors and distances from the external windows. The results reveal that when the receiver is next to the window the channel capacity increases with the floor level. On the other hand, it remains constant with the floor level when the receiver goes further inside the building. The satellite-to-indoor channel is more suitable for polarization multiplexing if the receiver is located at the upper floors of the building and close to a window. In any other case, diversity or beamforming would be preferable.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:KxtntwgDAa4C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "A Spectral Efficient Multi-Mode Relaying Technique",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6364835/",
            "Abstract": "Cooperative relaying with Distributed Space-Time Coding (DSTC) and cooperative Opportunistic Relaying (OR) are the two main relaying techniques that are typically employed in current wireless systems. However, OR is less complex and proven to be outage optimal compared to DSTC. Thus, in this paper we propose a Multi-Mode Relaying (MMR) technique that is based on OR and combined with the Successive Relaying (SR) technique in order to deal with the half-duplex constraint of the relay nodes. MMR, by employing Multi-Mode Decode-and-Forward (MMDF) relay nodes and incorporating two interference mitigation algorithms, not only combines the merits of OR and SR but also is able to alleviate the increased inter-relay interference caused by SR. The performance of MMR is evaluated through simulation and the results show that it is able to increase the average end-to-end capacity of the wireless path …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectral overlay of spread spectrum system on analog FM system",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/880041/",
            "Abstract": "The spectrum sharing capability of a spread spectrum system overlaid on an analog FM system is investigated. This overlay may cause two types of interference: (i) interference from the overlaid wideband SS system on the FM receivers; (ii) interference from the FM stations to the SS system. The comparison of the RF protection ratio of the FM receivers in case of several kinds of interference is presented through quite a lot of experiments. The derivation of the FM spectrum is also derived through laboratory measurements in a closed-form mathematical expression, in order to have a good approximation of the interference on the SS system.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hybrid lateration time-fingerprint position estimation technique for indoor UWB systems",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7033264/",
            "Abstract": "This paper presents a hybrid position estimation technique that is based on the integration of Fingerprinting (FP), Time-of-flight (ToF), and Trilateration approach. When empirical channel models are used with Ultra Wideband (UWB) systems, there are plenty of challenges that must be taken into consideration due to their dependence on frequency. Thus, when the position of a Blind Node (BLN) is estimated using the aforementioned techniques and the values deriving from these models, positioning error occurs. In order to minimize the positioning error, the proposed hybrid technique, called Lateration Time-FingerPrint (LTPF), is developed. The efficiency of the proposed positioning scheme is demonstrated through simulation results in terms of error probability and comparisons with other state-of-the-art positioning schemes.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for the estimation and validation of energy consumption in wireless sensor networks",
            "Publication year": 2015,
            "Publication url": "https://www.hindawi.com/journals/js/2015/124987/",
            "Abstract": "Body sensor networks and implantable and ingestible medical devices energy efficiency is a substantial key factor in network lifetime and functionality. This work confronts the nodes’ energy problem by establishing a unified energy consumption framework comprised of theoretical model, energy simulator model, and electronic metering modules that can be attached to the nodes. A theoretical analysis, a simulation procedure, and the design and development of three prototype electronic metering modules are presented in this paper. We discuss the accuracy of the proposed techniques, towards a unified framework for the a priori estimation of the energy consumption in commercial sensor nodes, taking into account the application functionality and the energy properties of the incorporated electronics. Moreover, body network nodes are considered for the application and the measurements of the proposed framework.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "A delay-aware hybrid relay selection policy",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7500374/",
            "Abstract": "In this paper, we propose a novel relay selection policy based on the Hybrid Relay Selection (HRS) relay selection protocol that takes into account the state of the buffers and aims at reducing the average packet delays in the network. The proposed protocol, called the Delay-Aware HRS (DA - HRS) protocol is analyzed by means of Markov Chains and expressions for the outage probability, throughput and delay are derived. The distributed implementation of the protocol is also discussed. The performance of our proposed protocol is demonstrated via extensive simulations and comparisons with the classical HRS.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "HST-NNC: A Novel Hybrid Satellite-Terrestrial Communication With NOMA and Network Coding Systems",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9399677/",
            "Abstract": "Hybrid satellite-terrestrial networks (HSTNs) are considered to be a promising solution in dealing with coverage and mobility challenges encountered in     generation (5G) networks that employ novel multiple access and connectivity schemes. In this respect, non-orthogonal multiple access (NOMA) as well as network coding (NC) schemes have attracted significant attention due to their performance gains which not only improve the quality of wireless transmission but also effectively exploit the available spectrum. In this paper, a combined NOMA-NC (NNC) scheme is presented and integrated into an HSTN consisting of a low earth orbit (LEO) satellite belonging to an LEO constellation, a terrestrial base station (BS), and multiple terrestrial mobile terminals (MTs). The proposed scheme, termed HST-NNC (Hybrid satellite terrestrial-NNC), allows pairs of users to be simultaneously served through NOMA via the …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectrum planning and performance evaluation between heterogeneous satellite networks",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377221707006807",
            "Abstract": "A new network has been recently proposed for the provision of fixed broadband services via high altitude platform stations (HAPS) in the 48/47 GHz band. One of the critical issues of this technology is spectrum sharing with the fixed satellite service. This paper examines the effect of Earth-to-stratosphere co-channel interference produced by ground stations of HAPS network to geostationary orbit (GEO) satellite receivers and proposes an interference-to-noise (I/N) calculation model for the evaluation of the current HAPS ground stations power characteristics set by ITU-R. Analytical and simulation results for archetypal systems in realistic scenarios indicate that efficient use of the spectrum shared between heterogeneous HAPS and Fixed Satellite Networks is feasible. Certain consideration is needed prior to the HAPS network development in suburban areas for latitudes from 55° to 65°, and in rural areas for latitudes …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:WF5omc3nYNoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Capacity Evaluation of a SIMO Satellite System at L, S and Ku Bands",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5073431/",
            "Abstract": "This paper evaluates theoretically the capacity of single-input-multiple-output (SIMO) system utilizing uniform linear arrays at the receiver terminal for satellite applications. The theoretical study is performed at three different frequency bands. Overall, very sufficient capacities are achieved, varying between 3 and 8 b/s/Hz. Higher capacity values are achieved for low and medium elevation angles. In the heavy shadowing scenario the capacity drops significantly comparable with the light shadowing case. It reduces, in average, 1.4-1.7 b/s/Hz. Finally, the channel capacity is uncorrelated with element separation after a specific value of lambda.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power adaptation in buffer-aided full-duplex relay networks with statistical CSI",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8360521/",
            "Abstract": "In networks with multiple wireless nodes and especially in fast changing environments, the continuous acquisition of channel state information (CSI) may become infeasible. In this correspondence paper, we study the relay selection problem for a cooperative network, where full-duplex relays are equipped with buffers and only statistical CSI is available at the transmitters (CSIT). For this setting,a novel relay selection algorithm is proposed, named HyQoS, relying only on statistical CSIT and performing power adaptation. HyQoS solvesan optimization problem for selecting the optimal set of relays. We consider two optimization approaches, first, minimization of the total power consumed in the network, and, second, maximization of the throughput per energy unit, while guaranteeing a specific quality of service, in terms of successful transmission probability. The power allocation problem is formulated as a nonlinear …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectral Efficient Opportunistic Relay Selection Policies for Next Generation Mobile Systems",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/chapter/spectral-efficient-opportunistic-relay-selection-policies-for-next-generation-mobile-systems/136555",
            "Abstract": "This book chapter presents various relay selection policies based on spectral efficient techniques for the next generation mobile systems. Successive opportunistic relaying (SOR) that leverages the half-duplex constraint of conventional relays through concurrent transmissions is described, while proposing techniques to reduce the effect of inter-relay interference (IRI). An extension of SOR is defined for the case of out-of-band relaying, when additional spectrum bands are available and in networks with buffer-aided relays. Moreover, the use of full-duplex (FD) relays is outlined, in view of the effect of loop-interference (LI) from the relay's output to its input and, also, the power reduction is presented. As networks with multiple relays suffer from increased coordination overhead, a reduced Channel State Information (CSI) policy is proposed. For every policy, performance evaluation is provided in terms of outage …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Spectrum Sharing between High Altitude Platform and Fixed Satellite Networks in the 50/40 GHz band",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.703.7923&rep=rep1&type=pdf",
            "Abstract": "Earth-to-stratosphere co-channel interference produced by high altitude platform stations (HAPS) to the fixed satellite receivers and proposes a methodology for the evaluation of the current high altitude platform ground stations (HAPGS) power characteristics set by ITU-R. Results of interference-to-noise ratio for various systems in realistic scenarios indicate that efficient use of the spectrum shared between HAPS and Fixed Satellite Networks is feasible, with a more careful consideration for specific latitudes.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed joint relay-pair selection for buffer-aided successive opportunistic relaying",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6708114/",
            "Abstract": "In this work, we propose a buffer-aided successive opportunistic relay scheme where each time a relay-pair is selected with the target of rate maximization. Due to overlapping transmissions by the source and the relay which transmits to the destination, inter-relay interference arises. The efficient mitigation of inter-relay interference either through cancellation or avoidance, requires increased channel state information. Thus, in order to reduce the implementation complexity induced by centralized selection, distributed switch-and-stay combining is combined with buffer-aided successive opportunistic relaying. In this way, by applying a rate threshold we can avoid increased relay-pair switching and channel state information acquisition. The efficiency of the proposed scheme is demonstrated through simulations and comparisons with other state-of-the-art relay selection policies.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measurements and path loss models for a TD-LTE network at 3.7 GHz in rural areas",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-019-02243-9",
            "Abstract": "This paper presents an extensive path loss measurement campaign carried out in rural areas at 3.7 GHz, including line-of-sight (LOS) and non-LOS conditions. For this purpose, a commercially established fixed wireless access (FWA) network is exploited, operating with time-division long term evolution configuration. Furthermore, various models are examined and validated regarding their ability to predict accurately the path loss. The results reveal that the standard propagation model (SPM) achieves the best performance, thus being an attractive option for planning rural FWA links. The WINNER II and 3GPP/ITU-R models exhibit very good performance, as well. From the statistical assessment, the shadow fading follows the Lognormal distribution with a standard between 4.6 and 5.4 dB. An almost excellent fit is obtained regardless of the diverse propagation conditions in the specific area. Finally, from the …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Performance Analysis of DS Spread Spectrum System in Multiple Narrowband Interference",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:mVmsd5A6BfQC",
            "Publisher": "WSEAS"
        },
        {
            "Title": "A new method for coronary stenosis detection based on capacitive sensors of a Wireless Sensor Network",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Building Penetration Measurements and Feasibility Study for Indoor Coverage of Ku-Band Satellite Signals",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394487/",
            "Abstract": "This paper describes a technique which can be used for wideband satellite signal power measurements. This method consists in measuring signal's power within its spectral mask for a certain period of time. A series of measurements has been carried out not only for evaluating the derived results of the proposed method, but also for the computation of building penetration loss for indoor satellite coverage. The results of this measurement campaign showed site and frequency dependence and they were evaluated by comparing results obtained using this method for signals of both vertical and horizontal polarization as well. Penetration loss for satellite signals can be modeled using regression models for both polarizations.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey on machine-learning techniques for UAV-based communications",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/581886",
            "Abstract": "Unmanned aerial vehicles (UAVs) will be an integral part of the next generation wireless communication networks. Their adoption in various communication-based applications is expected to improve coverage and spectral efficiency, as compared to traditional ground-based solutions. However, this new degree of freedom that will be included in the network will also add new challenges. In this context, the machine-learning (ML) framework is expected to provide solutions for the various problems that have already been identified when UAVs are used for communication purposes. In this article, we provide a detailed survey of all relevant research works, in which ML techniques have been used on UAV-based communications for improving various design and functional aspects such as channel modeling, resource management, positioning, and security. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Enhancing fairness in wireless multi-hop networks",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Anagnostopoulos-4/publication/221223399_Enhancing_Fairness_in_Wireless_Multi-Hop_Networks/links/02bfe50dda478bfa37000000/Enhancing-Fairness-in-Wireless-Multi-Hop-Networks.pdf",
            "Abstract": "Wireless multi-hop networks have recently been conceived as a networking paradigm. However, their deployment has been limited, mainly due to the fact that they lack fairness. In this research effort, we briefly review the state of art in fairness mechanisms in multi-hop networks and we propose an algorithm that tries to differentiate the traffic among the connections in a wireless multi-hop ad-hoc sensor network, so that the fairness is enhanced. This is achieved by an adaptive scheme, which tries to assign a higher priority to the traffic connections that experience delay greatly larger than the average, so that their delay is reduced, and the fairness of the system is improved.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy-aware clustering of CoMP-DPS transmission points",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366418307928",
            "Abstract": "The main idea behind CoMP operation is to efficiently coordinate multiple transmission points to provide better transmission quality and QoS, while improving spectral efficiency. This concept can be extended to the heterogeneous networking environment of 5G systems and is expected to be one of the key technologies of the future. In this work, we focus on the CoMP transmission with Dynamic Point Selection (DPS) due to its low complexity and the gains it can offer to the reduction of the size of the clusters and to the network’s power consumption. Therefore, in this paper, we present an Energy-Aware Clustering (EnAC) scheme to be utilized with CoMP-DPS in LTE-A. The goal of the proposed scheme is to reduce, as much as possible, the power consumption at each BS of a cluster without compromising the CoMP operation. In other words, we incorporate energy-related parameters into the CoMP clustering …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:UxriW0iASnsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Towards wireless control for a permanent magnet synchronous motor",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7005336/",
            "Abstract": "The problem of speed control of a permanent magnet synchronous motor is investigated in the presence of time delays due to wireless signal transmission among the controller, the sensors and the actuators. In the present paper, the decoupling controller approach proposed in [1] is extended to compensate the presence of the delays and to achieve satisfactory performance despite their presence. In particular, the research focuses mainly on the stability of the time delay closed loop system.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Biomedical Time Series Processing and Analysis Methods: The Case of Empirical Mode Decomposition",
            "Publication year": 2011,
            "Publication url": "https://www.intechopen.com/books/advanced-biomedical-engineering/biomedical-time-series-processing-and-analysis-methods-the-case-of-empirical-mode-decomposition",
            "Abstract": "Computational processing and analysis of biomedical signals applied on the time series follow a chain of finite number of processes. Typical schemes front process is the acquisition of signal via the sensory subsystem. Next steps in the acquisition processing and analysis chain include buffers and preamplifiers, the filtering stage, the analog-digital conversion part, the removal of possible artifacts, the event detection and the analysis and feature extraction. Figure 1 depicts this process.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "InTech Open Access Publisher"
        },
        {
            "Title": "Relay selection for buffer-aided non-orthogonal multiple access networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8269082/",
            "Abstract": "Non-Orthogonal Multiple Access (NOMA) has the potential to increase the spectral efficiency of fifth generation (5G) networks by allowing simultaneous transmission to/from multiple users in the same wireless channel. In this work, a Buffer-Aided (BA) NOMA multiple relay network is considered, where the source transmits with fixed rate towards two users. By adopting BA relays, increased robustness can be achieved, as additional degrees of freedom are provided to relay selection. In order to increase the diversity of NOMA transmissions, two BA Half-Duplex (HD) relay selection algorithms are developed, considering the required transmission rate for each user, for Successive Interference Cancellation (SIC) at the reception and the Buffer State Information (BSI) at the relays. Then, results are provided in terms of outage probability, average throughput and average delay for the two algorithms. Finally, conclusions …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cooperation framework for LTE femtocells' efficient integration in cellular infrastructures based on femto relay concept",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6335358/",
            "Abstract": "The fast emerging technology of femtocells, through the utilization of existing IP infrastructures, promises to improve critical performance indicators in cellular networks, such as coverage and capacity, with minimum cost. However, the random placement of femtocells contrary to the structured deployment of the current cellular network raises challenges for interference management. In this context, we propose a Cooperation Framework for LTE Femtocells' Efficient Integration (COF-FEI) in cellular infrastructures in order to: 1) reduce interference in the forward link of femtocells caused by the macrocell Base Station (BS) and, 2) improve the Signal-to-Interference plus Noise ratio (SINR) of macrocell users located in the vicinity of femtocells. COF-FEI introduces a novel merging of relaying and femtocells (i.e. femto-relays) and sets the base for an efficient cooperation between macro BS and femtocells through wireless …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint routing and per-flow fairness in wireless multihop networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4556301/",
            "Abstract": "In wireless multihop networks communication between two end-nodes is carried out by hopping over multiple short wireless links. Traditional CSMA/CA based media access control does not work satisfactory in a multihop scenario, since an intended target of a communication may be subject to mutual interference imposed by concurrent transmissions from nodes which cannot directly sense each other, causing unfair throughput allocation. Although TDMA seems to be a more promising solution, careful transmission scheduling is needed in order to achieve error-free communication and fairness. In our previous work, a TDMA scheduling algorithm has been proposed that schedules the transmissions in a fair manner and takes into account the communication requirements of the active flows of the network. In this paper, in order to further improve this scheme, we combine the TDMA scheduling algorithm with two …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Angle-based time fingerprint positioning technique for indoor UWB systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7249310/",
            "Abstract": "The knowledge of direction information of the transmitted signals requires angle-based position estimation techniques, as well as the orientation of the individual nodes of the system. When using omnidirectional antennas, this information is difficult to be calculated in order to find the Blind Node's (BLN or BN) position. Also, the combination of Ultra Wide-Band (UWB) systems with angle-based techniques is not the best option when tracking down an unknown target, especially indoors, due to the large bandwidth of the UWB signals and the huge number of paths. This paper proposes a geometrical angle-based positioning approach for UWB omnidirectional systems which also combines Fingerprint (FP) and Time-of-Flight (ToF), aiming to calculate the BN's position with the minimum positioning error. The efficiency of the proposed positioning scheme is demonstrated through simulation results in terms of error …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power angle profile measurements and capacity evaluation of a SIMO system at 60 GHz",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5672088/",
            "Abstract": "This paper presents an experimental power angle profile measurement procedure, as well as theoretical capacity results of a single-input-multiple-output (SIMO) system which operates in the millimeter wave band and especially at 60 GHz. Power angle profiles (PAPs) were measured in different indoor locations while detailed angle-of-arrival (AoA) shape factors describing the spatial properties of the millimeter wave channel were derived. The measurement results were related to the site-specific environments and showed correlation between the propagation environments and the multipath channel structure. The 10% outage capacity was found theoretically between 5.7 and 6.2 b/s/Hz for a 1 × 4 SIMO system, and in the range of 4.3 and 4.6 b/s/Hz for a 1 × 2 SIMO system.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of an enhanced uplink 3.5 G system for mobile healthcare applications",
            "Publication year": 2008,
            "Publication url": "https://www.hindawi.com/journals/ijta/2008/417870/",
            "Abstract": "The present paper studies the prospective and the performance of a forthcoming high-speed third generation (3.5G) networking technology, called enhanced uplink, for delivering mobile health (m-health) applications. The performance of 3.5G networks is a critical factor for successful development of m-health services perceived by end users. In this paper, we propose a methodology for performance assessment based on the joint uplink transmission of voice, real-time video, biological data (such as electrocardiogram, vital signals, and heart sounds), and healthcare records file transfer. Various scenarios were concerned in terms of real-time, nonreal-time, and emergency applications in random locations, where no other system but 3.5G is available. The accomplishment of quality of service (QoS) was explored through a step-by-step improvement of enhanced uplink system's parameters, attributing the network system for the best performance in the context of the desired m-health services.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Indoor Radio Channel Characterization of Spread Spectrum Systems",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Use Ultra-Wideband Discone Rectenna for Broadband RF Energy Harvesting Applications",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/698976",
            "Abstract": "In this study, a broadband Radio Frequency (RF) energy harvester implementation is presented. The system uses a broadband discone antenna, which can operate efficiently in a broad frequency spectrum, including LTE, DCS 1800 and UMTS 2100 cellular frequency bands. The system is able to harvest energy from various electromagnetic field sources, thus has the potential to efficiently charge a storage energy element in a short time. The prototype broadband RF energy harvester was tested in the laboratory and also in a typical urban environment. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A survey on buffer-aided relay selection",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7365416/",
            "Abstract": "Relays receive and retransmit signals between one or more sources and one or more destinations. Cooperative relaying is a novel technique for wireless communications that increases throughput and extends the coverage of networks. The task of relay selection serves as a building block to realize cooperative relaying. Recently, relays with buffers have been incorporated into cooperative relaying providing extra degrees of freedom in selection, thus improving various performance metrics, such as outage probability, power reduction, and throughput, at the expense of tolerating an increase in packet delay. In this survey, we review and classify various buffer-aided relay selection policies and discuss their importance through applications. The classification is mainly based on the following aspects: 1) duplexing capabilities, 2) channel state information (CSI), 3) transmission strategies, 4) relay mode, and 5 …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity improvement through buffer-aided successive opportunistic relaying",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6617051/",
            "Abstract": "In this work, we propose a buffer-aided successive opportunistic relaying scheme that aims to improve the average capacity of the network when inter-relay interference arises between relays that are selected for transmission and reception. In order to exploit the benefits of buffering at the relays, we propose a relay-pair selection policy that decouples the receiving relay at the previous time slot from being the transmitting relay at the next slot. Furthermore, we impose an interference cancellation threshold allowing the relay that is selected for reception, to decode and subtract the inter-relay interference. The proposed relaying scheme selects the relaying pair that maximizes the average capacity of the relay network. The performance of the proposed scheme is evaluated via simulation and comparisons with other state-of-the-art half and full-duplex relay selection schemes, in terms of outage probability, average …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Outage probability analysis in multi-user FSO/RF and UAV-enabled MIMO communication networks",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1874490721002123",
            "Abstract": "This paper considers a mixed free-space optical/radio frequency (FSO/RF) system, which facilitates the communication between a ground central unit (CU) and multiple ground users (GUs) via a hovering unmanned aerial vehicle (UAV) acting as a decode-and-forward (DF) aerial relay. It is considered that the CU employs multiple transmit apertures and is interconnected with the aerial relay via an FSO link with transmit aperture selection (TAS), whereas the relay communicates with the GUs over multiple-input multiple-output (MIMO) RF links with orthogonal space–time block coding (OSTBC) transmission. It is assumed that the optical channels are mainly affected by atmospheric attenuation as well as geometric and misalignment loss (GML). Besides, the atmospheric turbulence is assumed weak for short-range links. Also, fully correlated shadowed conditions are considered in the RF links and the MIMO channels …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:eflP2zaiRacC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optical interplatform links scenarios for 20 km altitude",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4299106/",
            "Abstract": "This paper presents a theoretical analysis of a detailed optical link between two communication platforms (HAPs), both situated at 20 km height from the Earth's surface. The main objective here is the calculation of data rate load which can be transmitted through the link for various link parameters. The proposed scenarios cover different cases concerning the transmitter and receiver characteristics. The principal convention throughout this study is a constraint on transmit power (less than 1 W) independently of the data rate.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity Evaluation of an Indoor Smart Antenna System at 60 GHz",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_32",
            "Abstract": "In this paper, a study for indoor channel modeling is presented for the millimeter frequency band, by using various configurations of multiple element antenna systems. A multi-ray model is proposed and verified through simulation process for capacity prediction of a high data rate wireless system. The proposed model utilizes the geometric characteristics of the environment, the angle of arrival and angle of departure of each one of the propagation paths, the antenna elements and their spacing. The results showed that the system capacity increases significantly if two or four elements are used at both terminal antennas instead of the basic SISO configuration. In order to accomplish major improvement in the data rates, a MIMO system at 60 GHz should operate within a range of 10 to 20 m in an indoor environment with the view of obtaining sufficient Signal to Noise Ratios.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Evaluation of TV and radio performance in the coexistence of a spread spectrum system",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1045227/",
            "Abstract": "Performance degradation of analog FM and PAL-G signals due to spread spectrum (SS) interference is investigated. An analytical expression between RF TV protection ratio (CIR) and baseband unweighted signal-to-noise ratio (SNR/sub V/), for cochannel spread spectrum and noise interference, is derived. Also, we express the audio frequency signal-to-noise ratio (AF SNR) output due to SS overlay for various types of spreading scenarios and for different carrier frequency differences (/spl Delta/f).",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "WPAN's Technologies for Pervasive e-Health Applications–State of the Art and Future Trends",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=5196749414587535631&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing Fairness in Wireless Multi-Hop Networks",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/53499965/Enhancing_fairness_in_wireless_multi-hop20170614-23165-1ikk0yv.pdf",
            "Abstract": "Wireless multi-hop networks have recently been conceived as a networking paradigm. However, their deployment has been limited, mainly due to the fact that they lack fairness. In this research effort, we briefly review the state of art in fairness mechanisms in multi-hop networks and we propose an algorithm that tries to differentiate the traffic among the connections in a wireless multi-hop ad-hoc sensor network, so that the fairness is enhanced. This is achieved by an adaptive scheme, which tries to assign a higher priority to the traffic connections that experience delay greatly larger than the average, so that their delay is reduced, and the fairness of the system is improved.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rural path loss measurements and models for a fixed wireless access TD-LTE network at 3.7 GHz",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8739456/",
            "Abstract": "This paper examines the validity and applicability of different path loss models, based on an extensive measurement campaign in a rural environment at 3.7 GHz (3GPP band 43) for line-of-sight (LOS) conditions. The measurements were carried out using a commercial fixed wireless access (FWA) network operating with Time-Division Long Term Evolution (TD-LTE) configuration. From the path loss analysis, not all of the examined models are appropriate to describe accurately the expected losses. The close-in, WINNER II, and 3GPP/ITU-R models present the best performance. On the other hand, the Extended Hata model is not accurate for the specific area since it over-predicts path loss. Finally, from the statistical analysis the shadow fading is approximated by the Lognormal distribution with zero mean and a standard deviation of 5.8 dB. An almost excellent fit is achieved regardless of the dissimilar propagation …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Indoor angular profile measurements and channel characterization at the millimeter-wave band",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5781813/",
            "Abstract": "This paper presents a power angle profile (PAP) measurement campaign at the millimetre-wave band. Angular profiles were measured in different indoor topographies such as offices, corridors and a residence. Detailed angle-of-arrival (AoA) shape factors were derived, describing the spatial properties of the millimeter wave channel. The measurement results were related to the site-specific environments and correlation between the propagation condition and the multipath channel structure was observed. Finally, from the measurement results, it is found that the PAPs can be modeled as a finite scatterer model with a direct component plus multipath arriving within a variable sector α.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "International Journal of Antennas and Propagation, Special Issue on Beamforming techniques for wireless MIMO relay networks",
            "Publication year": 2014,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01059856/",
            "Abstract": "Archive ouverte HAL - International Journal of Antennas and Propagation, Special Issue on \nBeamforming techniques for wireless MIMO relay networks Accéder directement au contenu \nAccéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL \nListe des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues \nDocumentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts \nPar type de publication Par discipline Par année de publication Par structure de recherche \nLes portails de l'archive Recherche Documentation hal-01059856, version 1 Direction \nd'ouvrage, Proceedings, Dossier International Journal of Antennas and Propagation, Special \nIssue on Beamforming techniques for wireless MIMO relay networks Athanasios G. Kanatas \n1 Demosthenes Vouyioukas 2 Gan Zheng 3 Laurent Clavier 4 Détails 1 Department of [] 2 [’…",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Hindawi Publishing Corporation"
        },
        {
            "Title": "ANN Prediction Models for Outdoor SIMO Millimeter Band System",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=17057987202272864206&hl=en&oi=scholarr",
            "Abstract": "This paper presents the prediction propagation paths of angle of arrivals (AoAs) of a Smart Antenna System in an outdoor environment",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A dynamic hybrid clustering scheme for LTE-A networks employing CoMP-DPS",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8031614/",
            "Abstract": "In this paper, we propose a low complexity Dynamic Hybrid Clustering (DHC) scheme for LTE-A networks employing Coordinated MultiPoint with Dynamic Point Selection (CoMP-DPS). Although CoMP-DPS is considered to be a simpler CoMP scheme, its simplicity allows us to define more efficient cell clustering procedures. Thus, DHC is able to provide backhaul load balancing for the eNBs while offering high quality wireless connections and high data rates to the users. DHC exploits the feedback from the mobile devices and takes into account the backhaul load conditions in order to adjust the backhaul latency to tolerable levels and maintain optimal channel quality. Numerical results and comparisons with other schemes are provided showing improved performance by the proposed solution.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A context-aware framework for the efficient integration of femtocells in IP and cellular infrastructures",
            "Publication year": 2013,
            "Publication url": "https://jwcn-eurasipjournals.springeropen.com/articles/10.1186/1687-1499-2013-62",
            "Abstract": "In today’s heterogeneous networking (HetNet) environments, where end users are provided with universal connectivity opportunities, femtocell deployments can become key players in the enhancement of critical performance indicators such as capacity, coverage, QoS, etc. In order to confront the up-to-date LTE femtocell challenges, we propose a context-aware framework that provides a controlled environment from the femtocell point of view, which is required for applicable functionality. More specifically, we aim to (a) control the local environment where the femtocell is placed within, by efficiently managing the total incoming traffic load and by continuously adjusting the distribution of the backhaul capacity among the coexisting networks and (b) control the macro–femto interference caused by macrocell users transmitting close to the femtocell by investigating the “femtocell as a relay” concept. Finally, the performance of the proposed framework is evaluated via simulation results showing that the overall performance of a HetNet environment can be leveraged in terms of QoS requirements, energy saving and data rate enhancement.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:maZDTaKrznsC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Provision of Electronic Healthcare Services via DVB-RCS Satellite Communication Technology",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Feasibility study of coexistence between spread spectrum and analog broadcasting systems",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1543669/",
            "Abstract": "The study considers the viability and limitations of a spread spectrum radio concept. This concept proposed a spectrum overlay of a spread spectrum system on the existing narrowband FM broadcasting system. The overlaid spread spectrum (SS) system is assumed to utilize direct sequence (DS) spreading, using maximal length pseudorandom sequences with long spreading codes. We studied the performance analysis of the SS system due to the overlaying analog FM system, consisting of multiple narrowband FM stations. The received narrowband interference (NBI) on the SS receiver performance was calculated and compared with a set of threshold criteria that derived in previous studies by the authors, in terms of carrier-to-interference ratio (CIR). The probability of error for the SS signal was determined for various types of spreading scenarios, for various signal-to-interference ratios and for different processing …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards remote control of planar redundant robotic manipulators",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8118561/",
            "Abstract": "The problem of remote position control of a planar redundant manipulator is studied for the case of a 3dof Cartesian robot including disturbance forces at the end effector. The robotic manipulator controlled through a wireless network using the ZigBee protocol, imposing communication delays between the sensors and the controller, as well as between the controller and actuators. The kinetic model of the system is presented and a static feedback with dynamic precompensator controller involving time delays is proposed. Based on these two aspects the following four design goals are imposed: a) non-square I/O decoupling, b) D/O diagonalization, c) attenuation of the influence of the disturbances to the performance output, and d) balanced allotment of the steady state behavior of the redundant degrees of freedom. The design goals are proven to be satisfied and the solution of the controller matrices are derived.",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pervasive Homecare Monitoring Technologies and Applications",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ltqgDwAAQBAJ&oi=fnd&pg=PA45&dq=info:6DeVtqyNV2wJ:scholar.google.com&ots=2loc2L-BBb&sig=AKuOjY6LAtzAKL6JomM81LFhWMk",
            "Abstract": "Research studies and population statistics records indicate that elderly population increases in the developed countries whilst forecasts reveal that 65 and over age group will be nearly 20% of the overall population. One of the major challenges related to this observation is the delivery of homecare and the reduction of healthcare cost without compromising the quality of services provided. Pervasive homecare systems provide information and mechanisms to alert when pathological situations are identified. The implementation of technological solutions for homecare applications minimizes the time to provide help in abnormal situations and improve quality of life in elderly and chronically ills. Pervasive homecare networks provide continuous medical monitoring, control of home appliances, medical data storage and processing and emergency situations awareness. Constant monitoring provides early detection of emergency conditions and assists in optimum scheduling of a wide range of healthcare services for people with various degrees of cognitive and physical disabilities. Researchers continuously explore technological solutions in order to provide homecare and healthcare services for the elderly, chronically ill and children. The amount of proposals reveal a rapidly growing scientific area of high impact on sensitive groups that significantly improve quality of life and prevent or deal with life threatening situations. However, the use of this wireless sensor technology in medical practice not only allows a supreme level of complexity in patient monitoring with regards to existing parameters (such as vital signs), but also offers the prospect of …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:-f6ydRqryjwC",
            "Publisher": "InTech Open Access Publisher"
        },
        {
            "Title": "LoCo—link: A low-complexity link selection algorithm for delay mitigation in asymmetric two-hop networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7997058/",
            "Abstract": "While buffer-aided relaying improves the diversity of a multi-hop network, its deployment introduces time-delays, thus rendering buffering unreliable for delay-intolerant applications. To alleviate excessive delays, various studies propose delayaware protocols, but at the expense of reduced diversity, and consequently, increased outage probability. Attempts to maintain the diversity of the system while trying to reduce delays, however, may lead to even higher delays, especially in asymmetric topologies. In this work, we propose a Low-Complexity (LoCo) link selection algorithm, herein called LoCo - Link, that aims at reducing packet delays and enhancing the performance of practical asymmetric two-hop networks. The complexity of LoCo - Link is derived and compared with other state-of-the-art relay selection policies. The performance of the proposed algorithm is evaluated in terms of outage probability, average …",
            "Abstract entirety": 0,
            "Author pub id": "iYvovHEAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hybrid resource sharing for QoS preservation in virtual wireless networks",
            "Publication year": 2017,
            "Publication url": "http://ndl.ethernet.edu.et/bitstream/123456789/31456/1/Cloud%20and%20Fog%20Computing%20in%205G%20Mobile%20Networks%20Emerging%20advances%20and%20applications.pdf#page=318",
            "Abstract": "An enabling technology for the fifth generation (5G) of wireless communications is the virtualisation of network resources. 5G networks are expected to consist of dense deployments and efficient resource allocation is a top priority [1]. At present, there is a growing number of research projects, investigating network virtualisation at different levels. The virtualisation of core network functionalities is the topic of the T-NOVA project [2] where a virtualised cloud infrastructure is responsible to provide them, thus achieving elasticity and flexibility in network deployment. Moreover, various tools such as OpenFlow [3] have been developed allowing the dynamic and scalable adaptation of the core network regarding the routing of data. Also, open-source solutions such as OpenStack have been adopted for the management of public and private clouds as well as the well-timed creation and effective maintenance of virtual machines [4].",
            "Abstract entirety": 1,
            "Author pub id": "iYvovHEAAAAJ:D03iK_w7-QYC",
            "Publisher": "IET"
        }
    ]
}]