[{
    "name": "Δημήτριος Γκιζόπουλος",
    "romanize name": "Dimitrios Gkizopoulos",
    "School-Department": "Πληροφορικής και Τηλεπικοινωνιών",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 18398,
    "Scholar name": "Dimitris Gizopoulos",
    "Scholar id": "8V03GF4AAAAJ",
    "Affiliation": "National and Kapodistrian University of Athens",
    "Citedby": 4133,
    "Interests": [
        "Computer Architecture",
        "Hardware",
        "Dependability",
        "Reliability",
        "Energy Efficiency"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=8V03GF4AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Software-based self-testing of symmetric shared-memory multiprocessors",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5184820/",
            "Abstract": "Software-based or instruction-based self-testing has recently emerged as an effective alternative for the manufacturing and online testing of microprocessors, and is progressively adopted by major microprocessor manufacturers mainly as a supplement to other mature and well-established testing approaches to reach higher test quality. Thus far, software-based self-test approaches presented in the literature have focused almost exclusively on uniprocessors. With the continuing prevalence of multiprocessors, the focus of such research approaches moves from the uniprocessor to the multiprocessor case. In this paper, we study the application of software-based self-testing on symmetric shared-memory multiprocessors (SMP) considering the most common interconnection architectures, shared bus and crossbar switch. We focus on the impact of the shared-memory system architecture, the cache coherence …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Error-resilient server ecosystems for edge and cloud datacenters",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8220477/",
            "Abstract": "The explosive growth of Internet-connected devices that form the Internet of Things and the flood of data they yield require new energy-efficient and error-resilient hardware and software server stacks for next-generation cloud and edge datacenters.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:5qfkUJPXOUwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "rACE: reverse-order processor reliability analysis",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9116355/",
            "Abstract": "Modern microprocessors suffer from increased error rates that come along with fabrication technology scaling. Processor designs continuously become more prone to hardware faults that lead to execution errors and system failures, which raise the requirement of protection mechanisms. However, error mitigation strategies have to be applied diligently, as they impose significant power, area, and performance overheads. Early and accurate reliability estimation of a microprocessor design is essential in order to determine the most vulnerable hardware structures and the most efficient protection schemes. One of the most commonly used techniques for reliability estimation is Architecturally Correct Execution (ACE) analysis.ACE analysis can be applied at different abstraction models, including microarchitecture and RTL and often requires a single or few simulations to report the Architectural Vulnerability Factor (AVF …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:Aul-kAQHnToC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A system-level voltage/frequency scaling characterization framework for multicore CPUs",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2106.09975",
            "Abstract": "Supply voltage scaling is one of the most effective techniques to reduce the power consumption of microprocessors. However, technology limitations such as aging and process variability enforce microprocessor designers to apply pessimistic voltage guardbands to guarantee correct operation in the field for any foreseeable workload. This worst-case design practice makes energy efficiency hard to scale with technology evolution. Improving energy-efficiency requires the identification of the chip design margins through time-consuming and comprehensive characterization of its operational limits. Such a characterization of state-of-the-art multi-core CPUs fabricated in aggressive technologies is a multi-parameter process, which requires statistically significant information. In this paper, we present an automated framework to support system-level voltage and frequency scaling characterization of Applied Micro's state-of-the-art ARMv8-based multicore CPUs used in the X-Gene 2 micro-server family. The fully automated framework can provide fine-grained information of the system's state by monitoring any abnormal behavior that may occur during reduced supply voltage conditions. We also propose a new metric to quantify the behavior of a microprocessor when it operates beyond nominal conditions. Our experimental results demonstrate potential uses of the characterization framework to identify the limits of operation for improved energy efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:9pM33mqn1YgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guest editorial-testing and verification of communication system-on-chip devices",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1232239/",
            "Abstract": "Dimitris Gizopoulos Robert C. Aitken ommunication systems are being used in many different application domains, offering an increasing number of sophisticated services to end users. These services are based on the ability of the systems to both transfer multiple types of information at very high speeds and process complex information efficiently. User requirements for electronic products that provide new services with lower cost and higher quality are the driving force for high technology researchers and practitioners. The trade-offs among more complex functionality, lower overall cost, and better quality are the most important challenges being faced by modern electronic products developers.Modern communication devices not only provide sophisticated functionality but also are developed within strict time-to-market and time-to-volume constraints. To enhance productivity in integrated circuit (IC) design, the system …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modern hardware margins: CPUs, GPUs, FPGAs recent system-level studies",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8854386/",
            "Abstract": "Modern large-scale computing systems (data centers, supercomputers, cloud and edge setups and high-end cyber-physical systems) employ heterogeneous architectures that consist of multicore CPUs, general-purpose many-core GPUs, and programmable FPGAs. The effective utilization of these architectures poses several challenges, among which a primary one is power consumption. Voltage reduction is one of the most efficient methods to reduce power consumption of a chip. With the galloping adoption of hardware accelerators (i.e., GPUs and FPGAs) in large datacenters and other large-scale computing infrastructures, a comprehensive evaluation of the safe voltage reduction levels for each different chip can be employed for efficient reduction of the total power. We present a survey of recent studies in voltage margins reduction at the system level for modern CPUs, GPUs and FPGAs. The pessimistic voltage …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:DJbcl8HfkQkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Built-in sequential fault self-testing of array multipliers",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1397804/",
            "Abstract": "Microprocessor datapath architectures operate on signed numbers usually represented in two's-complement or sign-magnitude formats. The multiplication operation is performed by optimized array multipliers of various architectures which are often produced by automatic module generators. Array multipliers have either a standard, nonrecoded signed (or unsigned) architecture or a recoded (modified Booth's algorithm) architecture. High-quality testing of array multipliers based on a comprehensive sequential fault model and not affecting their well-optimized structure has not been proposed in the past. In this paper, we present a built-in self-testing (BIST) architecture for signed and unsigned array multipliers with respect to a comprehensive sequential fault model. The BIST architecture does not alter the well-optimized multiplier structure. The proposed test sets can be applied externally but their regular nature …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Software-Based Processor Self-Testing",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-2801-4_5",
            "Abstract": "In this Chapter we discuss a processor self-testing approach which has recently attracted the interest of several test technologists. The approach is based on the execution of embedded self-test programs and is known as software-based self-testing. We present software-based self-testing as a lowcost or cost-effective self-testing technique that aims to high structural fault coverage of the processor at a minimum test cost.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:9vf0nzSNQJEC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Microprocessor software-based self-testing",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5396292/",
            "Abstract": "This article discusses the potential role of software-based self-testing in the microprocessor test and validation process, as well as its supplementary role in other classic functional- and structural-test methods. In addition, the article proposes a taxonomy for different SBST methodologies according to their test program development philosophy, and summarizes research approaches based on SBST techniques for optimizing other key aspects.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "for Sequential Fault Testing in Datapath Multipliers",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=11000930732525574558&hl=en&oi=scholarr",
            "Abstract": "The modified Booth array multiplier is the most ubiquitous multiplier architecture in the datapaths of either general purpose microprocessors or specialized Digital Signal Processors. Sequential fault testing for Booth array multipliers has never been proposed in the past. In this paper, we present two BIST architectures for modified Booth array multipliers with respect 10 the Realistic Sequential Cell Fault model (RS-CFM). The first BIST architecture aims 10 resolve the test invalidation problem to the larger possible extent, while the second one aims 10 test cost reduction. Both BIST architectures achieve very high sequential fault coverage and impose moderate hardware and delay overhead. Simplified variations of the two BIST architectures are also presented for the non-recoded signed array multipliers. Thus, the proposed BIST architectures offer a universal BIST solution that covers the totality of signed array multipliers: non-recoded and recoded.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:48xauSegjOkC",
            "Publisher": "Institute of Electrical & Electronics Engineers (IEEE)"
        },
        {
            "Title": "Towards improved survivability in safety-critical systems",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5994536/",
            "Abstract": "Performance demand of Critical Real-Time Embedded (CRTE) systems implementing safety-related system features grows at an exponential rate. Only modern semiconductor technologies can satisfy CRTE systems performance needs efficiently. However, those technologies lead to high failure rates, thus lowering survivability of chips to unacceptable levels for CRTE systems. This paper presents SESACS architecture (Surviving Errors in SAfety-Critical Systems), a paradigm shift in the design of CRTE systems. SESACS is a new system design methodology consisting of three main components: (i) a multicore hardware/firmware platform capable of detecting and diagnosing hardware faults of any type with minimal impact on the worst-case execution time (WCET), recovering quickly from errors, and properly reconfiguring the system so that the resulting system exhibits a predictable and analyzable degradation in …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Selecting power-optimal SBST routines for on-line processor testing",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4221582/",
            "Abstract": "Software-based self-test (SBST) has emerged as an effective strategy for on-line testing of processors integrated in non-safety critical embedded system applications. Among the most popular applications falling in this category are the various mobile devices. However, in-field testing of processors integrated in mobile devices has the extra requirement of minimum energy consumption, since these devices are operating on battery. In this paper initially we present the parameters contributing to energy consumption in order to set the scope of the problem and make a qualitative analysis about the efficiency of the SBST routines from a low energy perspective. Then we propose a power evaluation framework based on a combination of tools from the testing and computer architecture technical areas. Utilizing this framework we evaluate for the first time the most effective structural SBST strategies in terms of energy …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special Issue on Manufacturable and Dependable Multicore Architectures at Nanoscale (MEDIAN)",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Gizopoulos/publication/257579878_Guest_Editorial/links/004635291eb24d0ddb000000/Guest-Editorial.pdf",
            "Abstract": "Electronic devices are pervading human lives in various areas and for a wide range of applications affecting our behavior; from medical to consumer electronics, from railways to the automotive and avionics scenarios and in server and cloud computing infrastructures. Reliability and dependable operation of such devices are critical issues and are pushing the requirement for dependable operation of computing systems for embedded as well as for high-performing applications way higher than ever in the past.Constant research and development advances in manufacturing yield, lifetime and field reliability are important enabling factors to meet these requirements. But at the same time more challenges arise as both technology and architectures are at a turning point today. At the technology level many ideas are being proposed to push the end of Moore’s law further ahead such as extending CMOS technology and deploying FinFET structures as well as finding alternatives to it like making use of carbon nanotubes (CNTFET), QCA, memristors, etc. From an architectural perspective, the spin towards deploying ever higher",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:0N-VGjzr574C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Statistical analysis of multicore CPUs operation in scaled voltage conditions",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8270368/",
            "Abstract": "Designers try to reduce the voltage margins of CPU chips to gain energy without sacrificing reliable operation. Statistical analysis methods are appealing to predict the safe operational margins at the system level as they do not induce area overheads and they can be applied during manufacturing or after the chips' release to the market. In this study, we present a comprehensive statistical analysis of the behavior of ARMv8 64-bit cores that are part of the enterprise 8-core X-Gene 2 micro-server family when they operate in scaled voltage conditions. Our prediction schemes that use real hardware counters as input are based on linear regression models with several feature selection techniques that aim to predict the safe voltage margins of any given workload when the cores operate in scaled conditions. Our findings show that our model is able to accurately predict safe voltage margins that provide up to 20.28 …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:kh2fBNsKQNwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DF for low cost testers [Tutorial]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1268806/",
            "Abstract": "This tutorial addresses state-of-the-art methods used to verify properties of sequential digital systems. The focus is on providing an overview of the main technologies and their applicability to complex designs. We cover the core algorithms involved in model checking, symbolic simulation and theorem proving methods, their application for specific aspects of formal verification and their deployment in verification software currently available both from industry and from academia.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Input Vector Monitoring Concurrent BIST Architecture Based on a Precomputed Test Set",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=13543812149102463008&hl=en&oi=scholarr",
            "Abstract": "Built-In Self-Test (BIST) techniques constitute an effective and practical approach for VLSI circuits testing. BIST schemes are typically classified into two categories: off-line and on-line. Input vector monitoring concurrent BIST schemes are a class of on-line techniques that circumvent the problems appearing separately in on-line and in off-line BIST. The utilization of input vector monitoring concurrent BIST techniques provides the capability to perform testing at different stages, manufacturing, periodic off-line and concurrent online. The input vector monitoring concurrent BIST schemes proposed so far have targeted either exhaustive or pseudorandom testing separately. In this paper a novel input vector monitoring concurrent BIST scheme based on a pre-computed test set is presented. The proposed scheme can perform both concurrent on-line and off-line testing; therefore it can be equally well utilized for manufacturing and concurrent on-line testing in the field. The applicability of the scheme is validated with respect to the hardware overhead and the time required for completion of the test in benchmark circuits. To the best of our knowledge, the proposed scheme is the first to be presented in the open literature based on a pre-computed test set that can perform both concurrent on line and off-line testing.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:ILKRHgRFtOwC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Harnessing voltage margins for energy efficiency in multicore CPUs",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3123939.3124537",
            "Abstract": "In this paper, we present the first automated system-level analysis of multicore CPUs based on ARMv8 64-bit architecture (8-core, 28nm X-Gene 2 micro-server by AppliedMicro) when pushed to operate in scaled voltage conditions. We report detailed system-level effects including SDCs, corrected/uncorrected errors and application/system crashes. Our study reveals large voltage margins (that can be harnessed for energy savings) and also large V min variation among the 8 cores of the CPU chip, among 3 different chips (a nominal rated and two sigma chips), and among different benchmarks.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:edDO8Oi4QzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cross-layer early reliability evaluation: Challenges and promises",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6873704/",
            "Abstract": "Evaluation of computing systems reliability must be accurate enough to provide hints for the required fault protection mechanisms that will guarantee correctness of operation at acceptance costs. To be useful, reliability evaluation must be performed early enough in the design cycle when, however, the available details of the system are largely unknown. This inherent contradiction in terms: early vs. accurate, requires a cross-layer approach for reliability evaluation. Different layers of abstraction contribute differently in the overall system reliability; if this contribution can be assessed independently, the reliability of the system can be evaluated at the early stages of the design. We review the state-of-the-art in the area and discuss corresponding challenges .",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Anatomy of microarchitecture-level reliability assessment: Throughput and accuracy",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7482075/",
            "Abstract": "The increasing density and complexity of modern microprocessors, which is driven by manufacturing technologies scaling, significantly affect their reliability. Reliability evaluation during the early design stages is a challenging process for microprocessor designers. Statistical fault-injection on microarchitecture simulators is commonly used, among other techniques, since it can deliver early and accurate reliability estimations for many important microprocessor hardware structures. However, full-system microarchitectural simulators have a relatively small simulation throughput. Thus, the number of injection experiments that can be performed during a fault injection campaign can be limited and therefore lead to smaller statistical significance of the reliability assessment. Aiming to boost the throughput of microarchitecture-level fault injection, we present, in this paper, a multi-faceted microarchitecture-level toolset for …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:LI9QrySNdTsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Embedded processor-based self-test",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=uOnSBwAAQBAJ&oi=fnd&pg=PR9&dq=info:p--cppFcJiEJ:scholar.google.com&ots=W3nenaEI2S&sig=I52LTk0RXFYxLSsnH6NxjRWcVeQ",
            "Abstract": "Embedded Processor-Based Self-Test is a guide to self-testing strategies for embedded processors. Embedded processors are regularly used today in most System-on-Chips (SoCs). Testing of microprocessors and embedded processors has always been a challenge because most traditional testing techniques fail when applied to them. This is due to the complex sequential structure of processor architectures, which consists of high performance datapath units and sophisticated control logic for performance optimization. Structured Design-for-Testability (DfT) and hardware-based self-testing techniques, which usually have a non-trivial impact on a circuit’s performance, size and power, can not be applied without serious consideration and careful incorporation into the processor design. Embedded Processor-Based Self-Test shows how the powerful embedded functionality that processors offer can be utilized as a self-testing resource. Through a discussion of different strategies the book emphasizes on the emerging area of Software-Based Self-Testing (SBST). SBST is based on the idea of execution of embedded software programs to perform self-testing of the processor itself and its surrounding blocks in the SoC. SBST is a low-cost strategy in terms of overhead (area, speed, power), development effort and test application cost, as it is applied using low-cost, low-speed test equipment. Embedded Processor-Based Self-Test can be used by designers, DfT engineers, test practitioners, researchers and students working on digital testing, and in particular processor and SoC test. This book sets the framework for comparisons among different SBST …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Comparison of fault-tolerance techniques for massively defective fine-and coarse-grained nanochips",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5289570/",
            "Abstract": "The fundamental question addressed in this paper is how to maintain the operation dependability of future chips built from forthcoming nano- (or subnano-) technologies characterized by the reduction of component dimensions, the increase of atomic fluctuations and the massive occurrence of physical defects. We focus on fault tolerance at the architectural level, and especially on fault-tolerance approaches, which are based on chip self-diagnosis and self-reconfiguration. We study test and reconfiguration methodologies in massively defective nanoscale devices, either at fine granularity field programmable devices or at coarse granularity multi-core arrays. In particular, we address the important question of up to which point could future chips have self-organizing fault-tolerance mechanisms to autonomously ensure their own dependable operation. In the case of FPGAs, we present known fault tolerant approaches …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Testability analysis and scalable test generation for high-speed floating-point units",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1705453/",
            "Abstract": "High-speed datapaths in microprocessors and embedded processors contain complex floating-point (FP) arithmetic units which have a critical role in the processor's performance. Although the FP units' complex structure consists of classic integer arithmetic components, the embedded components encounter serious testability problems due to their limited accessibility from the FP unit ports and testability loss due to FP unit inherent operations, such as rounding and normalization. In this paper, we analyze the testability problems and present scalable test generation for FP units using as a demonstration vehicle the popular, high-speed, two-path architecture of the most complex unit, the FP adder. The key feature of the presented methodology is the identification of testability conditions that guarantee effective test pattern application and fault propagation for each of the components of the FP adder. The identified test …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low energy on-line SBST of embedded processors",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4700581/",
            "Abstract": "Software-based self-test (SBST) has emerged as an effective strategy for on-line testing of processors integrated in non-safety critical applications. Among the various systems that fall in the previous category, wireless sensor networks (WSN) are often deployed in harsh environments where the possibility of permanent and especially intermittent faults due to environmental hazards is significantly increased, thus on-line and in-field testing is necessary to guarantee the accuracy of the sensed values. At the same time, on-line testing of processors integrated in WSN has the extra requirement of minimum energy consumption, because these devices are operating on battery, cannot be connected to any external power supply, and the battery duration determines the lifetime of the system. In this paper we present a methodology for the optimization of SBST routines from the energy perspective. Techniques utilized for …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Faults in data prefetchers: Performance degradation and variability",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7477312/",
            "Abstract": "High-performance microprocessors employ data prefetchers to mitigate the ever-growing gap between CPU computing rates and memory latency. Technology scaling along with low voltage operation exacerbates the likelihood and rate of hard (permanent) faults in technologies used by prefetchers such as SRAM and flip flop arrays. Faulty prefetch behavior does not affect correctness but can be detrimental to performance. Hard faults in data prefetchers (unlike their soft counterparts which are rare) can cause significant single-thread performance degradation and lead to large performance variability across otherwise identical cores. In this paper, we characterize in-depth both of these aspects in microprocessors suffering from multiple hard faults in their data prefetcher components. Our study reveals fault scenarios in the prefetcher table that can degrade IPC by more than 17%, while faults in the prefetch input and …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:MLfJN-KU85MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Test program generation for communication peripherals in processor-based SoC devices",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4850411/",
            "Abstract": "Testing communication peripherals in an environment of systems on a chip is particularly challenging. The authors explore two test program generation approaches-one fully automated and one deterministically guided-and propose a novel combination of the two schemes that can be applied in a generic manner on a wide set of communication cores.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Djezzar, B., see Tahi, H., TDMR March 2017 99-105 Du, M., see Hu, Z., TDMR Dec. 2017 785-794 Du, P., see Guo, J., TDMR March 2017 121-129 Duncan, AR, see Gadlage, MJ, TDMR March 2017 157-162 Dupuy, J., see Mukherjee, C., TDMR Sept. 2017 490-506",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8242710/",
            "Abstract": "2017 Index IEEE Transactions on Device and Materials Reliability Vol. 17 Page 1 IEEE \nTRANSACTIONS ON DEVICE AND MATERIALS RELIABILITY, VOL. 17, NO. 4, \nDECEMBER 2017 1 2017 Index IEEE Transactions on Device and Materials Reliability Vol. \n17 This index covers all technical items — papers, correspondence, reviews, etc. — that \nappeared in this periodical during 2017, and items from previous years that were \ncommented upon or corrected in 2017. Departments and other items may also be covered if \nthey have been judged to have archival value. The Author Index contains the primary entry \nfor each item, listed under the first author’s name. The primary entry includes the coauthors’ \nnames, the title of the paper or other item, and its location, specified by the publication \nabbreviation, year, month, and inclusive pagination. The Subject Index contains entries \ndescribing the item under all appropriate , plus ’…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:Ehil0879vHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cross-Layer Reliability of Computing Systems",
            "Publication year": 2020,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02986877/",
            "Abstract": "Cross-Layer Reliability of Computing Systems - Ecole Centrale de Lyon Accéder directement \nau contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS \nTEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org \nEpisciences.org Revues Documentation Sciencesconf.org Support Ecole Centrale de Lyon \nArchive Ouverte HAL Accueil Consultation Liste des documents Par type de document Liste \npar année Consultation des derniers dépôts Consultation des dernières publications Liste par \ndiscipline Consultation par auteur Consultation par laboratoire Consultation par collections \nRechercher Informations Modalités et bénéfices du dépôt Ressources et outils La recherche à \nl'ECL Les laboratoires de l'Ecole AMPERE ICJ INL LIRIS LMFA LTDS hal-02986877, version \n1 Ouvrage (y compris édition critique et traduction) Cross-Layer Reliability of Computing Di 1 [-…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:Bg7qf7VwUHIC",
            "Publisher": "iet-the institution of engineering and technology"
        },
        {
            "Title": "A bayesian model for system level reliability estimation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7138745/",
            "Abstract": "Nowadays, the scientific community is looking for ways to understand the effect of software execution on the reliability of a complex system when the hardware layer is unreliable. This paper proposes a statistical reliability analysis model able to estimate system reliability considering both the hardware and the software layer of a system. Bayesian Networks are employed to model hardware resources of the processor and instructions of program traces. They are exploited to investigate the probability of input errors to alter both the correct behavior and the output of the program. Experimental results show that Bayesian networks prove to be a promising model, allowing to get accurate and fast reliability estimations w.r.t. fault injection/simulation approaches.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust and Low-Cost BIST Architectures",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=2662892890081741613&hl=en&oi=scholarr",
            "Abstract": "The modified Booth array multiplier is the most ubiquitous multiplier architecture in the datapaths of either general purpose microprocessors or specialized Digital Signal Processors. Sequential fault testing for Booth array multipliers has never been proposed in the past. In this paper, we present two BIST architectures for modified Booth array multipliers with respect to the Realistic Sequential Cell Fault model (RS-CFM). The first BIST architecture aims to resolve the test invalidation problem to the larger possible extent, while the second one aims to test cost reduction. Both BIST architectures achieve very high sequential fault coverage and impose moderate hardware and delay overhead. Simplified variations of the two BIST architectures are also presented for the non-recoded signed array multipliers. Thus, the proposed BIST architectures offer a universal BIST solution that covers the totality of signed array multipliers: non-recoded and recoded.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:0CzhzZyukY4C",
            "Publisher": "Institute of Electrical & Electronics Engineers (IEEE)"
        },
        {
            "Title": "Testing of Processor-Based SoC",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-2801-4_3",
            "Abstract": "The problem of testing complex SoC architectures has attracted researchers’ interest the recent years because it is a problem of increasing difficulty and importance for the electronic circuits development community.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:JoZmwDi-zQgC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Assessing the effects of low voltage in branch prediction units",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8695668/",
            "Abstract": "Branch prediction units are key performance components in modern microprocessors as they are widely used to address control hazards and minimize misprediction stalls. The continuous urge of high performance has led designers to integrate highly sophisticated predictors with complex prediction algorithms and large storage requirements. As a result, BPUs in modern microprocessors consume large amounts of power. But when a system is under a limited power budget, critical decisions are required in order to achieve an equilibrium point between the BPU and the rest of the microprocessor. In this work, we present a comprehensive analysis of the effects of low voltage configuration Branch Prediction Units (BPU). We propose a design with separate voltage domain for the BPU, which exploits the speculative nature of the BPU (which is self-correcting) that allows reduction of power without affecting functional …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:mNrWkgRL2YcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Chip self-organization and fault tolerance in massively defective multicore arrays",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5374421/",
            "Abstract": "We study chip self-organization and fault tolerance at the architectural level to improve dependable continuous operation of multicore arrays in massively defective nanotechnologies. Architectural self-organization results from the conjunction of self-diagnosis and self-disconnection mechanisms (to identify and isolate most permanently faulty or inaccessible cores and routers), plus self-discovery of routes to maintain the communication in the array. In the methodology presented in this work, chip self-diagnosis is performed in three steps, following an ascending order of complexity: interconnects are tested first, then routers through mutual test, and cores in the last step. The mutual testing of routers is especially important as faulty routers are disconnected by good ones with no assumption on the behavior of defective elements. Moreover, the disconnection of faulty routers is not physical (“hard”) but logical (“soft”) in …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards Accurate Performance Modeling of RISC-V Designs",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2106.09991",
            "Abstract": "Microprocessor design, debug, and validation research and development are increasingly based on modeling and simulation at different abstraction layers. Microarchitecture-level simulators have become the most commonly used tools for performance evaluation, due to their high simulation throughput, compared to lower levels of abstraction, but usually come at the cost of loss of hardware accuracy. As a result, the implementation, speed, and accuracy of microarchitectural simulators are becoming more and more crucial for researchers and microprocessor architects. One of the most critical aspects of a microarchitectural simulator is its ability to accurately express design standards as various aspects of the microarchitecture change during design refinement. On the other hand, modern microprocessor models rely on dedicated hardware implementations, making the design space exploration a time-consuming process that can be performed using a variety of methods, ranging from high-level models to hardware prototyping. Therefore, the tradeoff between simulation speed and accuracy, can be significantly varied, and an application's performance measurements uncertain. In this paper, we present a microarchitecture-level simulation modeling study, which enables as accurate as possible performance modeling of a RISC-V out-of-order superscalar microprocessor core. By diligently adjusting several important microarchitectural parameters of the widely used gem5 simulator, we investigate the challenges of accurate performance modeling on microarchitecture-level simulation compared to accuracy and low simulation throughput of RTL …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:CaZNVDsoPx4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Published online: 1 March 2008© Springer Science+ Business Media, LLC 2008",
            "Publication year": 2008,
            "Publication url": "https://search.proquest.com/openview/d18b49717e0914f37ed9df61f51f67dd/1?pq-origsite=gscholar&cbl=54186",
            "Abstract": "Issue Title: Special Issue on Defect and Fault Tolerance; Guest Editors: Nur A. Touba, Adelio Salsano, and Minsu Choi",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software-based self-test for pipelined processors: a case study",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1544553/",
            "Abstract": "Software-based self-test (SBST) for processors and processor-based systems recently captured the interest of test technology researchers and practitioners due to its several advantages over traditional hardware built-in self-test (BIST). In this paper, we demonstrate for first time the full applicability of a recently proposed SBST methodology to a publicly available complex RISC processor implementation which includes a full pipelined architecture consisting of five pipeline stages, hazard detection, data forwarding and exceptions handling. We first show that the straightforward application of SBST routines developed for the nonpipelined version of the RISC processor can only reach a fault coverage less than 85% in the fully pipelined model. Then, we identify and classify areas with poor testability and provide solutions that extend the SBST methodology and achieve fault coverage more than 95% for this complex …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "9th IEEE International On-Line Testing Symposium (IOLTS 2003), Kos Island, Greece, July 7-9, 2003",
            "Publication year": 2003,
            "Publication url": "https://hal.univ-grenoble-alpes.fr/hal-00016846/",
            "Abstract": "Starting from this year the IEEE International On-Line Testing Workshop is transformed to Symposium, to reflect the continues growing in size and improvement in quality of the event, and the increased importance of on-line testing in modern electronics systems. In particularly, the huge complexity of electronic systems has seen reliability needs growing up in various application domains as well as pressure for low cost products. There is a corresponding increasing demand for cost-effective on-line testing techniques. These needs have increased dramatically with the introduction of very deep submicron and nanometer technologies. These technologies impact adversely noise margins and make mandatory integrating on-line test in modern ICs. The Symposium is also emphasizing on on-line testing in the continuous operation of large applications such as wired, cellular and satellite telecommunication, as well as in …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hierarchical synthesis of quantum and reversible architectures",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10766-016-0407-8",
            "Abstract": "Reversible hardware finds application in emerging areas such as low power circuit design, quantum computing, optical computing, and DNA computing. Intensive research has recently focused on the synthesis of quantum and reversible architectures. Quantum architectures often take advantage of reversible circuit synthesis methods but in general they require dedicated synthesis approaches because they represent a more general computing paradigm. Most of these quantum and reversible synthesis approaches derive efficient or even optimal circuits with scalability being their major drawback: they can only handle small circuits (up to a few hundred inputs for the most promising ones). In this paper, we propose a graph-based hierarchical synthesis method for large reversible and quantum architectures which can be combined with any of the existing synthesis methods to deliver unlimited scalability in …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:epqYDVWIO7EC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Low energy online self-test of embedded processors in dependable WSN nodes",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5714702/",
            "Abstract": "Wireless Sensor Network (WSN) nodes are often deployed in harsh environments where the possibility of permanent and especially intermittent faults due to environmental hazards is significantly increased, while silicon aging effects are also exacerbated. Thus, online and in-field testing is necessary to guarantee correctness of operation. At the same time, online testing of processors integrated in WSN nodes has the requirement of minimum energy consumption, because these devices operate on battery, cannot be connected to any external power supply, and the battery duration determines the lifetime of the system. Software-Based Self-Test (SBST) has emerged as an effective strategy for online testing of processors integrated in nonsafety critical applications. However, the notion of dependability includes not only reliability but also availability. Thus, in order to encase both aspects we present a methodology for …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-layer system reliability assessment framework for hardware faults",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7805863/",
            "Abstract": "System reliability estimation during early design phases facilitates informed decisions for the integration of effective protection mechanisms against different classes of hardware faults. When not all system abstraction layers (technology, circuit, microarchitecture, software) are factored in such an estimation model, the delivered reliability reports must be excessively pessimistic and thus lead to unacceptably expensive, over-designed systems. We propose a scalable, cross-layer methodology and supporting suite of tools for accurate but fast estimations of computing systems reliability. The backbone of the methodology is a component-based Bayesian model, which effectively calculates system reliability based on the masking probabilities of individual hardware and software components considering their complex interactions. Our detailed experimental evaluation for different technologies, microarchitectures, and …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:S16KYo8Pm5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Merlin: Exploiting dynamic instruction behavior for fast and accurate microarchitecture level reliability assessment",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3079856.3080225",
            "Abstract": "Early reliability assessment of hardware structures using microarchitecture level simulators can effectively guide major error protection decisions in microprocessor design. Statistical fault injection on microarchitectural structures modeled in performance simulators is an accurate method to measure their Architectural Vulnerability Factor (AVF) but requires excessively long campaigns to obtain high statistical significance.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:xtoqd-5pKcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measuring and exploiting guardbands of server-grade ARMv8 CPU cores and DRAMs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8416198/",
            "Abstract": "In this paper, we present the results of our comprehensive measurement study of the timing and voltage guardbands in memories and cores of a commodity ARMv8 based micro-server. Using various synthetic micro-benchmarks, we reveal how the adopted voltage margins vary among the 8 cores of the CPU chip, and among 3 different sigma chips and we show how prone they are to worst-case voltage noise. In addition, we characterize the variation of 'weak' DRAM cells in terms of their retention time across 72 DRAM chips and evaluate the error mitigation efficacy of the available error-correcting codes in case of operation under aggressively relaxed refresh periods. Finally, we show the overall energy savings that could be achieved by shaving the adopted guardbands in the cores and memories using various applications. Our characterization results show the potential to obtain up-to 38.8% energy savings in …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:NXb4pA-qfm4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The IEEE International Symposium on Defect and Fault Tolerance in VLSI Systems",
            "Publication year": 2009,
            "Publication url": "https://www.computer.org/csdl/pds/api/csdl/proceedings/download-article/12OmNCwlag2/pdf",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Power-aware optimization of software-based self-test for L1 caches in microprocessors",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6873688/",
            "Abstract": "In the era of terascale integration, the “reliability wall” and the “power wall” arise as barriers imposing significant challenges to the microprocessor industry. Nowadays, on-line testing is essential for modern microprocessors to detect latent defects that either escaped manufacturing testing or appear during system operation. Moreover, many-core scaling is now facing the “power wall”. More cores can now be placed on a chip than can be concurrently operating due to energy/power limitations. Software-Based Self-Test (SBST) is a flexible and low-cost solution for on-line March test application and defect detection in small memories, such as L1 caches, that lack Memory Built-In Self-Test (MBIST) hardware. In this paper, a power-aware optimization of the SBST methodology introduced in [10] is presented targeting Ll caches by analyzing the unique characteristics of March SBST routines and possible power …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Defect diagnosis and silicon debug: the continuing detective story [Tutorial]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1268812/",
            "Abstract": "Platforms that combine CPUs with a reconfigurable fabric on the same chip have been recently introduced. Such devices are ideally suited for many application domains ranging from multimedia to communication. A major challenge to their wider use is the lack of high level programming and design space exploration tools. This tutorial focuses on three aspects of this emerging technology:(1) the intrinsic potential of the temporal/spatial paradigm (2) The wide range of architectures, fine and coarse grained, and the trade-offs between performance and flexibility.(3) A survey of current and future applications in multimedia and mobile communication and analysis of their performance and energy requirements. It is intended for an audience of developers and researchers in high-end embedded systems.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards Local Industry Needs",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=1VD1CAAAQBAJ&oi=fnd&pg=PA197&dq=info:3kVtdnhZ3vQJ:scholar.google.com&ots=xXZyQXSNjW&sig=bdDW6Z0EzOV2137oynEgbHHz7Ek",
            "Abstract": "In this paper we present an application-oriented microelectronics education perspective to be applied in two closely collaborating university departments. The specific application domains in which local and european industry is specialized, provide valuable information about how the university courses must be oriented so that well-educated and well-focused computer scientists and microelectronics systems designers graduate from the departments. Such qualified graduates can be easily become part of design flows in local specialized design houses.An important aspect that we must always keep in mind in educating system designers is the target application domains where they are going to be active in their future professional steps. Usually, the local design industry that the two university departments (among others) feed with engineers is interested in designers/",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:zLWjf1WUPmwC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Foreword to the Special Section on the IEEE International On-Line Testing and Robust System Design Symposium (IOLTS) 2016",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7872534/",
            "Abstract": "This Special Section of IEEE Transactions on Device and Materials Reliability includes a collection of the best papers of the latest (2016) edition of an established IEEE symposium which focuses for more than two decades on the challenges and solutions for electronic circuits and systems on-line testing and fault tolerance. Held for 21 years as the IEEE International On-Line Testing Symposium it was renamed in 2016 to International On-Line Testing and Robust Systems Design Symposium keeping its well recognized acronym IOLTS.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:PoWvk5oyLR8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Combining checkpointing and scrubbing in FPGA-based real-time systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6548910/",
            "Abstract": "SRAM-based FPGAs provide an attractive solution for building high-performance embedded computing systems. Fault tolerant mechanisms are usually implemented in FPGA-based critical systems to improve their vulnerability to transient faults. Most fault tolerant approaches proposed so far in the literature for FPGA systems utilize checkpointing and scrubbing techniques for the fault recovery and repair operations, respectively, and rely on redundancy-based fault detection solutions. In this paper, we study the feasibility of building a low-cost fault-tolerant approach for FPGA-based realtime systems that combines checkpointing and scrubbing, the latter for both fault detection and repair. We calculate the checkpoint frequencies that guarantee the execution of the tasks within their deadlines in the presence of transient faults, taking into consideration the scrubbing time of the FPGA processor. Furthermore, we propose …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On-Line Periodic Self-Testing of High-Speed Floating-Point Units in Microprocessors",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4358407/",
            "Abstract": "On-line periodic testing of microprocessors is a viable low-cost alternative for a wide variety of embedded systems which cannot afford hardware or software redundancy techniques but necessitate the detection of intermittent or permanent faults. Low-cost, on-line periodic testing has been previously applied to the integer datapaths of microprocessors but not to their high-performance real number processing counterparts consisting of sophisticated high-speed floating-point (FP) units. In this paper, we present, an effective on-line periodic self-testing methodology for high-speed FP units and demonstrate it on high-speed FP adders/subtracters of both single and double precision. The proposed self-test code development methodology leads to compact self-test routines that exploit the integer part of the processors instruction set architecture to apply test sets to the FP subsystem periodically. The periodic self-test …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power-aware testing and test strategies for low power devices",
            "Publication year": 2008,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/date/2008/04484642/12OmNs0C9WM",
            "Abstract": "We propose an on-line algorithm to extract a human by foreground/background segmentation and estimate pose of the human from the videos captured by moving cameras. We claim that a virtuous cycle can be created by appropriate interactions between the two modules to solve individual problems. This joint estimation problem is divided into two sub problems, foreground/background segmentation and pose tracking, which alternate iteratively for optimization, segmentation step generates foreground mask for human pose tracking, and human pose tracking step provides fore-ground response map for segmentation. The final solution is obtained when the iterative procedure converges. We evaluate our algorithm quantitatively and qualitatively in real videos involving various challenges, and present its outstanding performance compared to the state-of-the-art techniques for segmentation and pose estimation.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "The future of fault tolerant computing",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7229841/",
            "Abstract": "Fault tolerant (or dependable) computing has always been an exciting research area in the intersection of computer science and engineering and electrical and electronics engineering. During the last two decades the applicability of the methods and tools that the fault tolerance research community produces has expanded to virtually all application domains. The type of fault tolerance methods employed in a computing system depend on: (a) the faults expected to affect the system, (b) the importance of errors in the system operation, (c) the design, cost and power budgets that can allocated to fault tolerance and reliable operation. New solutions and tools in fault tolerant computing are emerging to deal with the very broad spectrum of values that all (a), (b) and (c) can take in today's computing landscape.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:4MWp96NkSFoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-Layer Soft-Error Resilience Analysis of Computing Systems",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9159134/",
            "Abstract": "In a world with computation at the epicenter of every activity, computing systems must be highly resilient to errors even if miniaturization makes the underlying hardware unreliable. Techniques able to guarantee high reliability are associated to high costs. Early resilience analysis has the potential to support informed design decisions to maximize system-level reliability while minimizing the associated costs. This tutorial focuses on early cross-layer (hardware and software) resilience analysis considering the full computing continuum (from IoT/CPS to HPC applications) with emphasis on soft errors.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:nVrZBo8bIpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New JETTA Editors, 2006",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s10836-006-6905-7",
            "Abstract": "Bashir M. Al-Hashimi received the BSc degree with First Class in Electrical and Electronics Engineering from the University of Bath, UK, and the PhD degree from York University, UK. Following those he worked in the semiconductor industry designing integrated circuits for signal processing applications, developing CAD tools for simulation and synthesis of analogue and digital circuits. In 1999, he joined the School of Electronics and Computer Science, Southampton University, UK, where he is currently a Professor of Computer Engineering. He has authored one book on SPICE simulation (CRC Press, 1995), and coauthored two books, Power Constrained Testing of VLSI circuits (Springer, 2002), and System-Level Design Techniques for Energy-Efficient",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:vV6vV6tmYwMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Online periodic self-test scheduling for real-time processor-based systems dependability enhancement",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4803847/",
            "Abstract": "Online periodic self-testing is a cost-effective technique to ensure correct operation of microprocessor-based systems in the field and improve their dependability in the presence of failures caused by components aging/wearout. Effective online self-test tasks in embedded systems should have limited resource requirements: memory, execution time, and power consumption, while at the same time, they should guarantee the highest possible self-test quality levels. These requirements are not always easy to satisfy in real-time embedded systems with hard task deadlines. In this paper, we investigate the maximization of the effective self-test utilization and present solutions for the scheduling of online self-test tasks in hard real-time systems. The primary goal is to guarantee high self-test quality without affecting the deadline requirements of normal hard real-time tasks. We show that with appropriate selection of the …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low power/energy BIST scheme for datapaths",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/843822/",
            "Abstract": "Power in processing cores (microprocessors, DSPs) is primarily consumed in the functional modules of the datapath. Among these modules, multipliers consume the largest amount of power due to their size and complexity. We propose low power BIST schemes for datapath architectures built around multiplier-accumulator pairs, based on deterministic test patterns. Two alternatives are proposed depending on whether the target is low energy dissipation during a BIST session or low power dissipation (i.e. average energy dissipation between successive test vectors). The proposed BIST schemes are more efficient than pseudorandom BIST for the same high fault coverage target. Up to 78.33% energy saving is achieved by the proposed low energy BIST scheme and up to 82.22% power saving is achieved by the proposed low power BIST scheme, compared with pseudorandom BIST.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multi-bit upsets vulnerability analysis of modern microprocessors",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9042036/",
            "Abstract": "Miniaturization of integrated circuits brings more devices (thus more functionality) on the same silicon area but also makes them more vulnerable to soft (transient) errors. Assessment and understanding of the magnitude of a microprocessor's vulnerability to soft errors in early stages of the design can steer wise, cost-effective protection decision at the hardware or software level. In recent fabrication technologies, the effect of radiation (neutrons or other particles) is significantly more severe on silicon devices and leads to increased numbers of multi-bit upsets. In this paper, we analyze the effects of multi-bit upsets in modern microprocessors, using microarchitecture level fault injection and a complete system stack. We present details about the effects of multi-bit upsets on 6 major hardware components of an ARM Cortex-A9 CPU modeled on Gem5 microarchitectural simulator, with 15 workloads across 8 fabrication …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:nZcligLrVowC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mt-sbst: Self-test optimization in multithreaded multicore architectures",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5699277/",
            "Abstract": "Instruction-based or software-based self-testing (SBST) is a scalable functional testing paradigm that has gained increasing acceptance in testing of single-threaded uniprocessors. Recent computer architecture trends towards chip multiprocessing and multithreading have raised new challenges in the test process. In this paper, we present a novel self-test optimization strategy for multithreaded, multicore microprocessor architectures and apply it to both manufacturing testing (execution from on-chip cache memory) and post-silicon validation (execution from main memory) setups. The proposed self-test program execution optimization aims to: (a) take maximum advantage of the available execution parallelism provided by multiple threads and multiple cores, (b) preserve the high fault coverage that single-thread execution provides for the processor components, and (c) enhance the fault coverage of the thread …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instruction-based self-testing of processor cores",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1022873120308",
            "Abstract": "Software based self-testing of embedded processor cores provides an excellent technique for balancing the testing effort for complex Systems-on-Chip (SoC) between slow, inexpensive external testers and embedded code stored in memory cores. In this paper we propose an efficient methodology for processor core self-testing based on the knowledge of its instruction set architecture and register transfer level description and we demonstrate it on a processor core benchmark. We also demonstrate that our methodology is superior in terms of test development effort and has significantly smaller code size and memory requirements, while the same fault coverage is achieved with an order of magnitude smaller test application time compared with a recently published structural methodology for processor core self-testing.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Demystifying the System Vulnerability Stack: Transient Fault Effects Across the Layers",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9499847/",
            "Abstract": "In this paper, we revisit the system vulnerability stack for transient faults. We reveal severe pitfalls in widely used vulnerability measurement approaches, which separate the hardware and the software layers. We rely on microarchitecture level fault injection to derive very tight full-system vulnerability measurements. For our architectural and microarchitectural measurements, we employ GeFIN, a state-of-the-art fault injector built on top of the gem5 simulator, while for software level measurements we employ the LLFI fault injector. Analyzing two different Arm ISAs and two different microarchitectures for each ISA, we quantify the sources and the magnitude of error of architecture and software level vulnerability evaluation methods, which aim to reproduce the effects of hardware faults. We show that widely applied methodologies for system resilience evaluation fail to capture important fault manifestation and propagation …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:buQ7SEKw-1sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TOPIC CHAIRS",
            "Publication year": 2009,
            "Publication url": "https://past.date-conference.com/proceedings-archive/2009/DATE09/PDFFILES/TOPIC_CHAIRS.PDF",
            "Abstract": "TOPIC CHAIRS Page 1 www.date-conference.com 20-24 April 2009 A cropolis Nice, Fran ce D \nA TE09 TOPIC CHAIRS System Specification and Modeling Eugenio Villar Universidad de \nCantabria, ES Grant Martin Tensilica, US MPSoC and System Design Methods Luciano Lavagno \nCadence, US Wido Kruijtzer NXP Semiconductors, NL System Synthesis and Optimization Peter \nMarwedel U of Dortmund, DE Paul Pop TU of Denmark, DK Simulation and Validation Franco \nFummi U of Verona, IT Ian Harris U of California Irvine, US Design of Low Power Systems Miguel \nMiranda IMEC, BE Alberto Macii Politecnico di Torino, IT Power Estimation and Optimization \nJoerg Henkel U of Karlsruhe, DE Kaushik Roy Purdue U, US Emerging Technologies, \nSystems and Applications Sandeep Shukla Virginia Tech, US Yuan Xie Penn State U, \nUS Formal Methods and Verification Jason Baumgartner IBM Corporation, Austin, TX, -, -…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Test Technology Newsletter",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s10836-008-5094-y",
            "Abstract": "The 2009 IEEE Latin-American Test Workshop (LATW) will be held in Búzios, Brazil. The LATW09 provides an annual forum for test and fault tolerance professionals and technologists from Latin America and all over the world to present and discuss various aspects of system, board and component testing and fault-tolerance with design, manufacturing and field considerations in mind. See the technical program at http://inf. ufrgs. br/latw/.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fast quantum modular exponentiation architecture for Shor's factorization algorithm",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1207.0511",
            "Abstract": "We present a novel and efficient in terms of circuit depth design for Shor's quantum factorization algorithm. The circuit effectively utilizes a diverse set of adders based on the quantum Fourier transform (QFT) Draper's adders to build more complex arithmetic blocks: quantum multiplier/accumulators by constants and quantum dividers by constants. These arithmetic blocks are effectively architected into a generic modular quantum multiplier which is the fundamental block for modular exponentiation circuit, the most computational intensive part of Shor's algorithm. The proposed modular exponentiation circuit has a depth of about  and requires  qubits, where  is the number of bits of the classical number to be factored. The total quantum cost of the proposed design is . The circuit depth can be further decreased by more than three times if the approximate QFT implementation of each adder unit is exploited.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reliability-Aware System Software Support on ARM Microservers.",
            "Publication year": 2017,
            "Publication url": "https://pure.qub.ac.uk/en/publications/reliability-aware-system-software-support-on-arm-microservers",
            "Abstract": "Reliability-Aware System Software Support on ARM Microservers. — Queen's University \nBelfast Skip to main navigation Skip to search Skip to main content Queen's University \nBelfast Logo Help & FAQ Home Profiles Organisations Research output Projects Impact \nDatasets Activities Prizes Press / Media Student theses Facilities Search by expertise, name \nor affiliation Reliability-Aware System Software Support on ARM Microservers. \nAntonopoulos, C., S. Lallis, N. Bellas, D. Gizopoulos, and P. Lawthers , Georgios \nKarakonstantis, Dimitrios Nikolopoulos School of Electronics, Electrical Engineering and \nComputer Science Research output: Contribution to conference › Abstract › peer-review \nOverview Original language English Pages 1 Publication status Published - 2017 Event \nARM Research Summit - Cambridge, United Kingdom Duration: 11 Sep 2017 → 13 Sep \n2017 https://developer.arm.com/research/summit ARM //'…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:wMgC3FpKEyYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Energy-Efficient and Error-Resilient Server Ecosystem Exceeding Conservative Scaling Limits",
            "Publication year": 2016,
            "Publication url": "https://pure.qub.ac.uk/en/publications/an-energy-efficient-and-error-resilient-server-ecosystem-exceedin",
            "Abstract": "The explosive growth of Internet-connected devices will result in a flood of generated data, which will increase the demand for network bandwidth as well as compute power to process the generated data. Consequently, there is a need for more energy efficient servers to empower traditional centralized (Cloud) data-centers as well as emerging decentralized data-centers at the Edges of the Internet. In this paper, we present our approach, which aims at developing a new class of micro-servers–the UniServer-that exceed the conservative energy and performance scaling boundaries by introducing novel mechanisms at all layers of the design stack. The main idea lies on the realization of the intrinsic hardware heterogeneity and the development of mechanisms that will automatically expose the unique varying capabilities of each hardware component and allow their operation at new extended operating points. Low overhead schemes are employed to monitor and predict the hardware behavior and report it to the system software, which is responsible for optimizing the system operation in terms of energy or performance, while guaranteeing non-disruptive operation under extended operating points. To efficiently manage any potential fault that may incur under extended margins, we aim at identifying critical/vulnerable software structures and developing low cost techniques for protecting them. This eventually, allows us to enhance the fault tolerance of the overall system software that is representative of any state of the art cloud data-center, since it adopts a virtualization environment as well as popular resource management packages. Our initial …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:DUooU5lO8OsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SyRA: Early system reliability analysis for cross-layer soft errors resilience in memory arrays of microprocessor systems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8580414/",
            "Abstract": "Cross-layer reliability is becoming the preferred solution when reliability is a concern in the design of a microprocessor-based system. Nevertheless, deciding how to distribute the error management across the different layers of the system is a very complex task that requires the support of dedicated frameworks for cross-layer reliability analysis. This paper proposes SyRA, a system-level cross-layer early reliability analysis framework for radiation induced soft errors in memory arrays of microprocessor-based systems. The framework exploits a multi-level hybrid Bayesian model to describe the target system and takes advantage of Bayesian inference to estimate different reliability metrics. SyRA implements several mechanisms and features to deal with the complexity of realistic models and implements a complete tool-chain that scales efficiently with the complexity of the system. The simulation time is significantly …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:_5tno0g5mFcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A concurrent BIST scheme for on-line/off-line testing based on a pre-computed test set",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1584079/",
            "Abstract": "Manufacturing testing is carried-out once in order to ensure the correct operation of the circuit under test right after fabrication, while either periodic off-line testing or concurrent on-line testing is carried-out in order to ensure that the circuit under test continues to operate correctly in field. The utilization of input vector monitoring concurrent BIST techniques provides the capability to perform all types of testing, namely manufacturing, periodic off-line and concurrent on-line. The input vector monitoring concurrent BIST schemes proposed so far have targeted either exhaustive or pseudorandom testing. In this paper a novel input-vector monitoring concurrent BIST scheme based on a pre-computed test set is introduced. To the best of our knowledge, the proposed scheme is the first to be presented in the open literature based on a pre-computed test set that can perform both on line and off-line testing",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Voltage margins identification on commercial x86-64 multicore microprocessors",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8046198/",
            "Abstract": "In this paper, we explore the pessimistic voltage guardbands of two multicore x86-64 microprocessor chips that belong to different microarchitectures (one ultra-low power and one high-performance microprocessor), when programs are executed on individual cores of the CPU chips. We also examine the energy and temperature gains as positive effects of lowering the voltage in both chips while preserving the functional correctness of programs. The behavior of the cores was examined executing 8 different workloads from the SPEC CPU2006 suite. Our differential experimental study is performed on two state-of-the-art x86-64 microprocessors: an ultra-low power Intel Core i5-4200U and a high-performance Intel Core i7-3970X. Based on the results, the cores on each microprocessor chip behave differently for different workloads when undervolted, and the voltage guardbands are more than 15% below the nominal …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:ClCfbGk0d_YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Accumulator-based built-in self-test generator for robustly detectable sequential fault testing",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=10345222822885893122&hl=en&oi=scholarr",
            "Abstract": "In this paper an algorithm for the generation of single input change (SIC) pairs is presented, termed the accumulator-based SIC pair generation (ASG) algorithm; SIC pairs have been effectively utilised for testing robustly detectable sequential faults. ASG is implemented in hardware utilising an accumulator whose inputs are driven by a barrel shifter. Since such structures (accumulators whose inputs are driven by barrel shifters) are commonly found in current, high-speed signal processing VLSI circuits, the presented schema provides a practical solution for the built-in testing of such circuits for testing delay and stuck-open faults. Utilisation of ASG to applying SIC pairs to adjacent pairs of inputs of the CUT, resulting in pseudoexhaustive schemes, is also addressed.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accumulator based 3-weight pattern generation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5710025/",
            "Abstract": "Weighted pseudorandom built-in self test (BIST) schemes have been utilized in order to drive down the number of vectors to achieve complete fault coverage in BIST applications. Weighted sets comprising three weights, namely 0, 1, and 0.5 have been successfully utilized so far for test pattern generation, since they result in both low testing time and low consumed power. In this paper an accumulator-based 3-weight test pattern generation scheme is presented; the proposed scheme generates set of patterns with weights 0, 0.5, and 1. Since accumulators are commonly found in current VLSI chips, this scheme can be efficiently utilized to drive down the hardware of BIST pattern generation, as well. Comparisons with previously presented schemes indicate that the proposed scheme compares favorably with respect to the required hardware.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effective software self-test methodology for processor cores",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/998361/",
            "Abstract": "Software self-testing for embedded processor cores based on their instruction set, is a topic of increasing interest since it provides an excellent test resource partitioning technique for sharing the testing task of complex systems-on-chip (SoC) between slow, inexpensive testers and embedded code stored in memory cores of the SoC. We introduce an efficient methodology for processor cores self-testing which requires knowledge of their instruction set and Register Transfer (RI) level description. Compared with functional testing methodologies proposed in the past, our methodology is more efficient in terms of fault coverage, test code size and test application time. Compared with recent software based structural testing methodologies for processor cores, our methodology is superior in terms of test development effort and has significantly smaller code size and memory requirements, while virtually the same fault …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Microprocessor reliability-performance tradeoffs assessment at the microarchitecture level",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7477300/",
            "Abstract": "Early decisions in microprocessor design require a careful consideration of the corresponding performance and reliability implications of transient faults. The size and organization of important on-chip hardware components such as caches, register files and buffers have a direct impact on both the microprocessor resilience to soft errors and the execution time of the applications. In this paper, we employ a state-of-the-art x86-64 full-system micro-architectural simulator and a comprehensive fault injection framework built on top of it to deliver a detailed evaluation of the reliability and performance tradeoffs for major hardware components across several important parameters of their design (size, associativity, write policy, etc.). We also propose a simple and flexible fitness function that measures the aggregate effect of such design changes on the reliability and the performance of the studied workload.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:tuHXwOkdijsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient parallelization of the Discrete Wavelet Transform algorithm using memory-oblivious optimizations",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7347583/",
            "Abstract": "As the rate of single-thread CPU performance improvement per generation has diminished due to lower transistor-speed scaling and energy related issues, researchers and industry have shifted their interest towards multi-core and many-core architectures for improving performance. Comparisons between optimized applications for parallel architectures have been quantified many times in the literature, but contradictory results have been reported mainly due to biased methods of evaluating and comparing these architectures. In this paper, we present memory-oblivious optimizations of the widely used Discrete Wavelet Transform (DWT), and provide detailed comparisons of the algorithm on Intel and AMD multi-core CPUs, Nvidia many-core GPUs, as well as the Intel's Xeon Phi many-core coprocessor. Our results indicate that, compared to their respective non-optimized single thread implementations, memory …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:EYYDruWGBe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest Editorial: Special Section on “Autonomous Silicon Validation and Testing of Microprocessors and Microprocessor-Based Systems”",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4212143/",
            "Abstract": "The five papers in this special section focus on autonomous silicon validation and testing of microprocessors and microprocessor-based systems. The papers cover several important aspects of the technical area: from first silicon validation and debug to manufacturing and production testing, including both software-based and hardware-based techniques and design-for-test methods that range from pure functional instruction-based to structural scan-based tests. The scope of the papers extends from embedded uniprocessors to multicore microprocessors.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance assessment of data prefetchers in high error rate technologies",
            "Publication year": 2014,
            "Publication url": "https://www.clereco.eu/images/presentations/2014-04-01-SELSE.pdf",
            "Abstract": "Performance Assessment of Data Prefetchers in High Error Rate Technologies Page 1 \nPerformance Assessment of Data Prefetchers in High Error Rate Technologies Nikos Foutris, \nDimitris Gizopoulos, Athanasios Chatzidimitriou University of Athens, Dept. of Informatics & \nTelecom., Greece John Kalamatianos, Vilas Sridharan AMD, USA SELSE 2014, Stanford, US 1 \nPage 2 Background Motivation Scope Performance Impact Performance Variability Conclusions \nSELSE 2014, Stanford, US 2 Outline Page 3 • Hide latency of memory accesses – cache \nmemory – prefetcher • Extreme integration levels • Near-threshold voltage operation • High \nSRAM cell failure probability – pfail 10-6 to 10-4 (single-bit failure) – 5,000-bit SRAM @ 12nm \n→ 7.25E-1 (cum. prob. of 5-faults) • Measure prefetcher’s reliability SELSE 2014, Stanford, US \n3 Background Page 4 • Stride data prefetcher – prefetch data based on memory access • * • : (…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:KbBQZpvPDL4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessing the impact of hard faults in performance components of modern microprocessors",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6657044/",
            "Abstract": "A growing portion of the silicon area of modern high-performance microprocessors is dedicated to components that increase performance but do not determine functional correctness. Permanent hardware faults in these components can lead to performance fluctuation (not necessarily degradation) and do not produce functional errors. Although this fact has been identified previously, extensive research has not yet been conducted to accurately classify and quantify permanent faults in these components over a set of CPU benchmarks or measure the magnitude of the performance impact. Depending on the results of such studies, performance-related components of microprocessors can be disabled in fine or coarse granularities, salvaging microprocessor functionality at different performance levels. This paper analyzes the impact of permanent faults in the arrays and control logic of key microprocessor performance …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:JQOojiI6XY0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recursive pseudo-exhaustive two-pattern generation",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5272395/",
            "Abstract": "Pseudo-exhaustive pattern generators for built-in self-test (BIST) provide high fault coverage of detectable combinational faults with much fewer test vectors than exhaustive generation. In ( n ,  k )-adjacent bit pseudo-exhaustive test sets, all 2 k  binary combinations appear to all adjacent  k -bit groups of inputs. With recursive pseudoexhaustive generation, all ( n ,  k )-adjacent bit pseudoexhaustive tests are generated for  k  ¿  n  and more than one modules can be pseudo-exhaustively tested in parallel. In order to detect sequential (e.g., stuck-open) faults that occur into current CMOS circuits, two-pattern tests are exercised. Also, delay testing, commonly used to assure correct circuit operation at clock speed requires two-pattern tests. In this paper a pseudoexhaustive two-pattern generator is presented, that recursively generates all two-pattern ( n ,  k )-adjacent bit pseudoexhaustive tests for all  k  ¿  n . To the best of …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Functional self-testing for bus-based symmetric multiprocessors",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1403375.1403690",
            "Abstract": "Functional, instruction-based self-testing of microprocessors has recently emerged as an effective alternative or supplement to other testing approaches, and is progressively adopted by major microprocessor manufacturers. In this paper, we study, for first time, the applicability of functional self-testing on bus-based symmetric multiprocessors (SMP) and the exploitation of SMPs parallelism during testing. We focus on the impact of the memory system architecture and the cache coherency mechanisms on the execution of self-test programs on the processor cores. We propose a generic self-test routines scheduling algorithm aiming at the reduction of the total test application time for the SMP by reducing both bus contention and data cache coherency invalidation. We demonstrate the proposed solutions with detailed experiments in two-core and four-core SMP benchmarks based on a RISC processor core.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A software-based self-test methodology for in-system testing of processor cache tag arrays",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5560214/",
            "Abstract": "Software-Based Self-Test (SBST) has emerged as an effective alternative for processor manufacturing and in-system testing. For small memory arrays that lack BIST circuitry such as cache tag arrays, SBST can be a flexible and low-cost solution for March test application and thus a viable supplement to hardware approaches. In this paper, a generic SBST program development methodology is proposed for periodic in-system (on-line) testing of L1 data and instruction cache memory tag arrays (both for direct mapped and set associative organization) based on contemporary March test algorithms. The proposed SBST methodology utilizes existing special performance instructions and performance monitoring mechanisms of modern processors to overcome cache tag testability challenges. Experimental results on OpenRISC 1200 processor core demonstrate that high test quality of contemporary March test algorithms …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Healthlog monitor: Errors, symptoms and reactions consolidated",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8607016/",
            "Abstract": "Advances in reliability research have presented novel techniques for early identification of upcoming failures (both long-term and short-term) as well as sophisticated isolation and mitigation of error occurrences. The existing primitive error monitoring tools usually deliver very basic information of errors and do not allow integration of all system health-related information to be combined under the same context. The absence of common tools becomes more noticeable when new and more aggressive and dynamic schemes are concerned, such as processor undervolting or overclocking. In this paper, we present HealthLog monitor, a flexible Linux system monitoring service that offers a generic abstraction layer to combine health-related information as well as action features. HealthLog is capable of monitoring hardware metrics (performance, sensor, and errors) as well as external health-related data, allowing …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:2VqYfGB8ITEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust System Design IEEE IOLTS 2019",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9109791/",
            "Abstract": "You are reading the Editorial of the Special Section of IEEE Transactions on Device and Materials Reliability with a collection of the best papers of the 2019 edition of the IEEE IOLTS, an established IEEE symposium which focuses for exactly one quarter of a century on the challenges and solutions for computing and electronic circuits and systems  robust design . Robustness from the IOLTS technical point of view spans across the circuit, microarchitecture, architecture, system, and software layers.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:_OXeSy2IsFwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sequential fault modeling and test pattern generation for CMOS iterative logic arrays",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/888044/",
            "Abstract": "Iterative Logic Arrays (ILAs) are widely used in the datapath parts of digital circuits, like general purpose microprocessors, embedded processors, and digital signal processors. Testing strategies based on more comprehensive fault models than the traditional combinational fault models have become an imperative need in CMOS technology. In this paper, first, we introduce a comprehensive, cell-level, sequential fault model suitable for ILAs, termed Realistic Sequential Cell Fault Model (RS-CFM). RS-CFM drastically reduces test complexity compared to exhaustive two-pattern testing proposed so far in the literature for sequential ILA testing, without sacrificing test quality. In addition, it favors robustness of sequential test sets both at the cell and the array levels. Second, a new Automatic Test Pattern Generator (ILA-ATPG) based on RS-CFM for the case of one-dimensional ILAs is presented. ILA-ATPG can handle all …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal Periodic Testing of Intermittent Faults In Embedded Pipelined Processor Applications",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=5903555855147567969&hl=en&oi=scholarr",
            "Abstract": "Today's nanometer technology trends have a very negative impact on the reliability of semiconductor products. Intermittent faults constitute the largest part of reliability failures that are manifested in the field during the semiconductor product operation. Since software-based self-test (SBST) has been proposed as an effective strategy for on-line testing of processors integrated in non-safety critical low-cost embedded system applications, optimal test period specification is becoming increasingly challenging. In this paper we first introduce a reliability analysis for optimal periodic testing of intermittent faults that minimizes the test cost incurred based on a two-state Markov model for the probabilistic modeling of intermittent faults. Then, we present for the first time an enhanced SBST strategy for on-line testing of complex pipelined embedded processors. Finally, we demonstrate the effectiveness of the proposed optimal periodic SBST strategy by applying it to a fully-pipelined RISC embedded processor and providing experimental results",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:IUKN3-7HHlwC",
            "Publisher": "IEEE Xplore"
        },
        {
            "Title": "Application and analysis of rt-level software-based self-testing for embedded processor cores",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.560.7344&rep=rep1&type=pdf",
            "Abstract": "Embedded processor testing techniques based on the execution of self-test routines, have been recently proposed as an eflective alternative to classical hardware Built-In Self Test. Software-based self-testing provides atspeed testing capability and does not add hardware or performance penalties. It eficiently partitions the testing task between external testers and internal processor resources.In this paper we analyze the application of a softwarebased self-testing methodology to different implementations of a complex embedded processor architecture. We demonstrate that such a methodology provides high test quality in different processor implementations with low test development and low test application costs.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Impact of SoC Integration and OS Deployment on the Reliability of Arm Processors",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9408178/",
            "Abstract": "Arm CPU architectures, thanks to their efficiency and flexibility, have been widely adopted in portable user devices such as smartphones, tablets, and laptops. Recently, the high computing efficiency, together with the unique possibility that Arm offers to adapt the architecture for a specific application, pushed the adoption of Arm-based systems both in HPC (High Performance Computing) applications and autonomous vehicles. The possibility of modifying Arm architecture can potentially be extremely beneficial, as selective fault tolerance solutions can be added at the microarchitectural level. The current trend in the design of computing devices is to integrate several functionalities on the same SoC (System-On-Chip). Modern SoCs usually integrate (one or more) CPUs and (one or more) accelerators, such as GPUs (Graphics Processing Units) or FPGAs (Field Programmable Gate Arrays). These SoCs typically allow …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:4xDN1ZYqzskC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Software-based self-testing of embedded processors",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-5530-0_20",
            "Abstract": "No silicon integrated circuit (IC) manufacturing process is perfect. Therefore, IC testing is used to screen imperfect devices before shipping them to customers. Chips containing manufacturing defects are potentially malfunctioning chips that may cause system crashes and lead to financial deficit, environmental disaster, and/or jeopardize human life. Moreover, if manufacturing defects are not detected early, the cost of repair is increased by an order of magnitude at each step after the chip fabrication line. It comes naturally that chip testing is an important factor of the business in computer and communications industries, since customers demand reliable products at a reasonable cost and manufacturers, in order to stay competitive in business, must find the means to provide the best products at the lowest cost.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Software-based self test methodology for on-line testing of L1 caches in multithreaded multicore architectures",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6180021/",
            "Abstract": "The flexibility that allows the application of different March tests is a critical requirement for on-line testing of memory arrays. In a previous study, we have introduced a low-cost software-based self test (SBST) program development methodology for on-line periodic testing of L1 caches that utilizes direct cache access (DCA) instructions and exploits the native monitoring hardware available in modern architectures. In this brief, we discuss a multithreaded optimization of this SBST methodology that exploits the thread level parallelism of multithreaded multicore architectures in order to speed up March test execution by elaborating the low level multiple sub-bank cache organization. The effectiveness of the methodology and its multithreaded optimization is demonstrated on the L1 caches of OpenSPARC T1 processor. Our results showed a speedup of more than 1.7 when the multithreaded optimization is applied and an …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy Efficiency in ARMv8-based Microservers by Hardware Margins Identification.",
            "Publication year": 2017,
            "Publication url": "https://pure.qub.ac.uk/en/publications/energy-efficiency-in-armv8-based-microservers-by-hardware-margins",
            "Abstract": "Energy Efficiency in ARMv8-based Microservers by Hardware Margins Identification. — Queen's \nUniversity Belfast Skip to main navigation Skip to search Skip to main content Queen's University \nBelfast Logo Help & FAQ Home Profiles Organisations Research output Projects Impact \nDatasets Activities Prizes Press / Media Student theses Facilities Search by expertise, name or \naffiliation Energy Efficiency in ARMv8-based Microservers by Hardware Margins Identification. \nD. Gizopoulos, Y. Sazeides, S. Das, P. Lawthers , Georgios Karakonstantis, Dimitrios \nNikolopoulos School of Electronics, Electrical Engineering and Computer Science Research \noutput: Contribution to conference › Abstract › peer-review Overview Original language English \nNumber of pages 1 Publication status Published - 2017 Event 2017 ARM Research Summit \n- Cambridge, United Kingdom Duration: 01 Sep 2017 → … Conference Conference 01//.…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:QD3KBmkZPeQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Test generation methodology for high-speed floating point adders",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1498166/",
            "Abstract": "High performance real number operations in embedded processors' and microprocessors' datapaths are realized by floating point (FP) arithmetic units. FP units have a complex structure which although consisting of classic integer arithmetic components faces serious testability problems due to the limited accessibility of the components from the FP unit ports. In this paper we present a test generation methodology for FP adders based on the high-speed, two-path architecture. The key feature of the presented methodology is the identification of testability conditions that guarantee effective test pattern application and fault propagation for each of the components of the FP adder. According to our test methodology, the testability conditions guide test generation process. The identified test conditions are independent of the internal structure and the size of the components. Thus, they can be applied to floating point …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RIIF-2: Toward the next generation reliability information interchange format",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7604693/",
            "Abstract": "This paper describes the joint effort of the two FP7 EU projects CLERECO and MoRV toward the definition of an extended reliability information exchange format able to manage reliability information for the full system stack, from technology up to the software level. The paper starts from the RIIF language initiative, proposing a set of new features to improve the expression power of the language and to extend it to the software layer of a system. The proposed extended reliability information exchange format named RIIF-2 has the potential to support the development of next generation reliability analysis tools that will help to fully include reliability evaluation into an automated design flow, pushing cross-layer reliability considerations at the same level of importance as area, timing and power consumption when performing design exploration for new products.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:oNZyr7d5Mn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "2009 Index IEEE Transactions on Dependable and Secure Computing Vol. 6",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6214909/",
            "Abstract": "This index covers all technical items - papers, correspondence, reviews, etc. - that appeared in this periodical during the year, and items from previous years that were commented upon or corrected in this year. Departments and other items may also be covered if they have been judged to have archival value. The Author Index contains the primary entry for each item, listed under the first author's name. The primary entry includes the co-authors' names, the title of the paper or other item, and its location, specified by the publication abbreviation, year, month, and inclusive pagination. The Subject Index contains entries describing the item under all appropriate subject headings, plus the first author's name, the publication abbreviation, month, and year, and inclusive pages. Note that the item title is found only under the primary entry in the Author Index.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Differential fault injection on microarchitectural simulators",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7314163/",
            "Abstract": "Fault injection on micro architectural structures modeled in performance simulators is an effective method for the assessment of microprocessors reliability in early design stages. Compared to lower level fault injection approaches it is orders of magnitude faster and allows execution of large portions of workloads to study the effect of faults to the final program output. Moreover, for many important hardware components it delivers accurate reliability estimates compared to analytical methods which are fast but are known to significantly over-estimate a structure's vulnerability to faults. This paper investigates the effectiveness of micro architectural fault injection for x86 and ARM microprocessors in a differential way: by developing and comparing two fault injection frameworks on top of the most popular performance simulators, MARSS and Gem5. The injectors, called MaFIN and GeFIN (for MARSS-based and Gem5 …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:p__nRnzSRKYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nano and FIFO",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=12184824482539706716&hl=en&oi=scholarr",
            "Abstract": "not available.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting thread-level parallelism in functional self-testing of CMT processors",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5170456/",
            "Abstract": "Major microprocessor vendors have integrated functional software-based self-testing in their manufacturing test flows during the last decade. Functional self-testing is performed by test programs that the processor executes at-speed from on-chip memory. Multiprocessors and multithreaded architectures are constantly becoming the typical general-purpose computing paradigm, and thus the various existing uniprocessor functional self-testing schemes must be adopted and adjusted to meet the testing requirements of complex multiprocessors. A major challenge in porting a functional self-testing approach from the uniprocessor to the multiprocessor case is to take advantage of the inherent execution parallelism offered by the multiple cores and the multiple threads in order to reduce test execution time. In this paper, we study the application of functional self-testing to chip multithreaded (CMT) processors. We propose …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Software-based self-test for small caches in microprocessors",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6926831/",
            "Abstract": "Nowadays, on-line testing is essential for modern microprocessors to detect latent defects that either escape manufacturing testing or appear during system operation. Small memories, such as L1 caches and translation lookaside buffers (TLBs) are not usually equipped with memory built-in self-test (MBIST) hardware. Software-based self-test (SBST) is a flexible and low-cost solution for on-line March test application and error detection in such small memories. Although, L1 caches and TLBs are small components, their reliable operation is crucial for the system performance due to the large penalties caused when L1 cache or TLB misses occur. In this paper, an SBST program development methodology is proposed for on-line testing of small cache memories in microprocessors. To overcome testability challenges that are due to the “hidden” or implicit operation of such memories, the proposed SBST methodology …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:XD-gHx7UXLsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An energy-efficient and error-resilient server ecosystem exceeding conservative scaling limits",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8342175/",
            "Abstract": "The explosive growth of Internet-connected devices will soon result in a flood of generated data, which will increase the demand for network bandwidth as well as compute power to process the generated data. Consequently, there is a need for more energy efficient servers to empower traditional centralized Cloud data-centers as well as emerging decentralized data-centers at the Edges of the Cloud. In this paper, we present our approach, which aims at developing a new class of micro-servers - the UniServer - that exceed the conservative energy and performance scaling boundaries by introducing novel mechanisms at all layers of the design stack. The main idea lies on the realization of the intrinsic hardware heterogeneity and the development of mechanisms that will automatically expose the unique varying capabilities of each hardware. Low overhead schemes are employed to monitor and predict the hardware …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:4fGpz3EwCPoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of Processor-Based SoC",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-2801-4_2",
            "Abstract": "Integrated circuit (IC) manufacturing technologies have reached today a maturity level which is the driving force for the development of sophisticated, multi-functional and high-performance electronic systems. According to the prediction of the 2003 International Technology Roadmap for Semiconductors (ITRS) [76], by year 2018 the half pitch1 of dynamic random access memories (DRAM), microprocessors and application-specific ICs (ASIC) will drop to 18 nm and the microprocessor physical gate length will drop to 7 nm. The implementation of correctly operating electronic circuits in such small geometries — usually referred to as Very Deep Submicron (VDSM) manufacturing technologies — was believed, just a few years ago, to be extremely difficult, if at all possible, due to major hurdles imposed by the fundamental laws of microelectronics physics when circuit elements are manufactured in such small …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:LjlpjdlvIbIC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Cross-layer early reliability evaluation for the computing continuum",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6927245/",
            "Abstract": "Advanced multifunctional computing systems realized in forthcoming technologies hold the promise of a significant increase of the computational capability that will offer end-users ever improving services and functionalities (e.g., next generation mobile devices, cloud services, etc.). However, the same path that is leading technologies toward these remarkable achievements is also making electronic devices increasingly unreliable, posing a threat to our society that is depending on the ICT in every aspect of human activities. Reliability of electronic systems is therefore a key challenge for the whole ICT technology and must be guaranteed without penalizing or slowing down the characteristics of the final products. CLERECO EU FP7 (GA No. 611404) research project addresses early accurate reliability evaluation and efficient exploitation of reliability at different design phases, since these aspects are two of the most …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:9Nmd_mFXekcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Challenges in Scaling Software-Based Self-Testing to Multithreaded Chip Multiprocessors",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4700679/",
            "Abstract": "Functional software-based self-testing (SBST) has been recently studied by leading academic research groups and applied by major microprocessor manufacturers as a complement to other classic structural testing techniques for microprocessors and processor-based SoCs. Is the SBST paradigm scalable to testing multithreaded chip multiprocessors (CMPs) and effectively detect faults not only in the functional components but also in the thread-specific and core interoperability logic? We study the challenges in scaling existing software-based self-test capital (uniprocessor self-test programs and self-test generation techniques) to real, multithreaded CMPs, like Sun's OpenSPARC T1 and T2. Since this type of CMPs is built around well studied microprocessor cores of mature architecture (like SPARC v9 in the OpenSPARC case), tailoring, enhancing and scheduling of existing uniprocessor self-test programs can be …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SIFI: AMD southern islands GPU microarchitectural level fault injector",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8046209/",
            "Abstract": "General Purpose computing on Graphics Processing Unit offers a remarkable speedup for data parallel workloads, leveraging GPUs computational power. However, differently from graphic computing, it requires highly reliable operation in several application domains. In this paper we present SIFI a reliability evaluation framework for soft-errors on AMD GPUs built on top of Multi2Sim, a micro-architectural level simulator. SIFI is capable of computing different reliability metrics by means of two different techniques: fault injection and ACE analysis. Experiments performed on a set of 14 GPGPU applications targeting the AMD Southern Islands GPU architecture show the capability of the tool and the potential of its use to support decisions about the best architectural parameters for a given application.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:FPJr55Dyh1AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ALU-based Built-In Self Test Generator for Transition Fault Testing",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=14971785918002779665&hl=en&oi=scholarr",
            "Abstract": "The detection of transition faults in high-speed CMOS circuits if favored by the application of Single Input Change (SIC) pairs of patterns. A novel ALU-based SIC pair Generation (ASG) algorithm is presented that can be easily implemented using an ALU and a barrel shifter. Since such functional modules are common in the datapath of RISC processor cores embedded in Systems on Chip (SoC), we can utilize the processor by executing a specific test pattern generation routine to generate SIC pairs for testing at-speed other cores of the SoC.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:KUbvn5osdkgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A software-based self-test methodology for on-line testing of processor caches",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6139154/",
            "Abstract": "Nowadays, on-line testing is essential for modern high-density microprocessors to detect either latent hardware defects or new defects appearing during lifetime both in logic and memory modules. For cache arrays, the flexibility to apply online different March tests is a critical requirement. For small memory arrays that may lack programmable Memory Built-In Self-Test (MBIST) circuitry, such as L1 cache arrays, Software-Based Self-Test (SBST) can be a flexible and low-cost solution for on-line March test application. In this paper, an SBST program development methodology is proposed for online periodic testing of L1 data and instruction cache, both for tag and data arrays. The proposed SBST methodology utilizes existing special purpose instructions that modern Instruction Set Architectures (ISAs) implement to access caches for debug-diagnostic and performance purposes, termed hereafter Direct Cache Access …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Evaluation of the Total-Cost-of-Ownership Trade-offs in Edge vs Cloud deployments: A Wireless-Denial-of-Service Case Study",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8618604/",
            "Abstract": "We are witnessing an explosive growth in the number of Internet-connected devices and the emergence of several new classes of Internet of Things (IoT) applications that require rapid processing of an abundance of data. To overcome the resulting need for more network bandwidth and low network latency, a new paradigm has emerged that promotes the offering of Cloud services at the Edge, closer to users. However, the Edge is a highly constrained environment with limited power budget for servers per Edge installation which, in turn, limits the number of Internet-connected devices, such as sensors, that an installation can service. Consequently, the limited number of sensors leads to a reduction in the area coverage provided by them and puts in question the effectiveness for deploying IoT applications at the Edge. In this paper, we investigate the benefits of running an emerging security focused IoT application …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:WJVC3Jt7v1AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Easily testable cellular carry lookahead adders",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1023749030268",
            "Abstract": "Cellular Carry Lookahead (CLA) adders are systematically implemented in arithmetic units due to their regular, well-balanced structure. In terms of testability and with respect to the classical Cell Fault Model (CFM), cellular CLA adders have poor testability by construction. Design-for-testability (DFT) modifications for cellular CLA adders have been proposed in the literature providing complete CFM testability making the adders either level-testable or C-testable. These designs impose significant area and performance overheads. In this paper, we propose DFT modifications for cellular CLA adders to achieve complete CFM testability with special emphasis on the minimum impact in terms of area and performance. Complete CFM testability is achieved without adding any extra inputs to the adder, with very small area and performance overheads, thus providing a practical solution. The proposed DFT scheme …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:4DMP91E08xMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Microarchitecture-level reliability assessment of multi-core processors",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=18054931687485708547&hl=en&oi=scholarr",
            "Abstract": "Only components that are accurately modeled at the microarchitecture level, which are mostly memory elements (Static Random-Access Memory (SRAM) arrays, flops, and latches), can be assessed. Combinational logic and sequential elements are (in majority) functionally modeled, and thus, they cannot be evaluated at microarchitecture level. Fortunately, literature suggests that only a small portion (< 10%) of failures sources from these elements, which implies that the accuracy loss that can be attributed to the un-modeled resources at microarchitecture-level is limited. In this chapter, we present the throughput, capabilities, and accuracy of microarchitecturelevel reliability assessment, and how it can be effectively used at early design stages.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:gVv57TyPmFsC",
            "Publisher": "Institution of Engineering and Technology"
        },
        {
            "Title": "The functional and performance tolerance of gpus to permanent faults in registers",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6604089/",
            "Abstract": "Massively parallel many-core Graphics Processing Unit (GPU) architectures offer significant performance speedup in workloads with thread-level parallelism compared to contemporary multicore CPUs. For this reason, general-purpose computing using GPUs (GPGPU) is a rapidly expanding research direction in different contexts. Unlike graphics processing, GPGPU computing requires reliable operation in the presence of hardware faults whose occurrence probabilities in current and forthcoming advanced manufacturing technologies will be significant. In this paper, we focus on the aspect of tolerance of GPUs to permanent faults in their most critical storage elements: register files. By performing a comprehensive fault injection campaign on a cycle-accurate GPGPU architectural simulator, we first evaluate and classify the behavior of NVIDIA GPU CUDA kernels in the presence of permanent faults in registers …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:uLbwQdceFCQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exceeding conservative limits: A consolidated analysis on modern hardware margins",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9076808/",
            "Abstract": "Modern large-scale computing systems (data centers, supercomputers, cloud and edge setups and high-end cyber-physical systems) employ heterogeneous architectures that consist of multicore CPUs, general-purpose many-core GPUs, and programmable FPGAs. The effective utilization of these architectures poses several challenges, among which a primary one is power consumption. Voltage reduction is one of the most efficient methods to reduce power consumption of a chip. With the galloping adoption of hardware accelerators (i.e., GPUs and FPGAs) in large datacenters and other large-scale computing infrastructures, a comprehensive evaluation of the safe voltage reduction levels for each different chip can be employed for efficient reduction of the total power. We present a survey of recent studies in voltage margins reduction at the system level for modern CPUs, GPUs and FPGAs. The pessimistic voltage …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:8xutWZnSdmoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy optimal on-line Self-Test of microprocessors in WSN nodes",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5647693/",
            "Abstract": "Wireless Sensor Network (WSN) applications often need to be deployed in harsh environments, where the possibility of faults due to environmental hazards is significantly increased, while silicon aging and wearout effects are also exacerbated. For such applications, periodic on-line testing of the WSN nodes is an important step towards correctness of operation. However, on-line testing of processors integrated in WSN nodes has to address the additional challenge of minimum energy consumption, because these devices operate on battery, which usually cannot be replaced and in the absence of catastrophic failures determines the lifetime of the system. In this paper initially we derive analytically the optimal way for executing on-line periodic test with adjustable period, taking into account the degrading behavior of the system due to silicon aging effects but also the limited energy budget of WSN applications. The …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Foreword to the Special Section on the IEEE International On-Line Testing and Robust System Design Symposium (IOLTS) 2016 (in IEEE Transactions on Device and Materials Reliability)",
            "Publication year": 2017,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02011795/",
            "Abstract": "This Special Section of IEEE Transactions on Device and Materials Reliability includes a collection of the best papers of the latest (2016) edition of an established IEEE symposium which focuses for more than two decades on the challenges and solutions for electronic circuits and systems on-line testing and fault tolerance. Held for 21 years as the IEEE International On-Line Testing Symposium it was renamed in 2016 to International On-Line Testing and Robust Systems Design Symposium keeping its well recognized acronym IOLTS.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:mlAyqtXpCwEC",
            "Publisher": "ieee"
        },
        {
            "Title": "Effective software-based self-test strategies for on-line periodic testing of embedded processors",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1372664/",
            "Abstract": "Software-based self-test (SBST) strategies are particularly useful for periodic testing of deeply embedded processors in low-cost embedded systems with respect to permanent and intermittent operational faults. Such strategies are well suited to embedded systems that do not require immediate detection of errors and cannot afford the well-known hardware, information, software, or time-redundancy mechanisms. We first identify the stringent characteristics of a SBST program to be suitable for on-line periodic testing. Also, we study the probability for a SBST program to detect permanent and intermittent faults during on-line periodic testing. Then, we introduce a new SBST methodology with a new classification and test-priority scheme for processor components. After that, we analyze the self-test routine code styles for the three more effective test pattern generation (TPG) strategies in order to select the most effective …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Soft error analysis and concurrent testing",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=5334953259629175979&hl=en&oi=scholarr",
            "Abstract": "not available.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A methodology for detecting performance faults in microprocessors via performance monitoring hardware",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4437646/",
            "Abstract": "Speculative execution of instructions boosts performance in modern microprocessors. Control and data flow dependencies are overcome through speculation mechanisms, such as branch prediction or data value prediction. Because of their inherent self-correcting nature, the presence of defects in speculative execution units does not affect their functionality (and escapes traditional functional testing approaches) but impose severe performance degradation. In this paper, we investigate the effects of performance faults in speculative execution units and propose a generic, software-based test methodology, which utilizes available processor resources: hardware performance monitors and processor exceptions, to detect these faults in a systematic way. We demonstrate the methodology on a publicly available fully pipelined RISC processor that has been enhanced with the most common speculative execution unit …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power-/energy-efficient BIST schemes for processor data paths",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/895003/",
            "Abstract": "Processor core power is primarily consumed in a data path consisting of high-activity functional modules. We propose low-power/energy BIST schemes for data path architectures built around the most common combinations of multipliers, adders, ALUs, and shifters.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Software-Based Self-Test methodology for on-line testing of data TLBs",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6233043/",
            "Abstract": "For small memory arrays that usually lack Memory Built-In Self-Test (MBIST), such as Translation Lookaside Buffer (TLB) arrays, Software-Based Self-Test (SBST) can be a flexible and low-cost solution for on-line March test application. In this paper, an SBST program development methodology is proposed for on-line testing of data TLB (D-TLB), both for data (SRAM) and tag (CAM) memory arrays. The SBST methodology exploits existing special purpose instructions that modern ISAs implement to access the TLBs for debug-diagnostic purposes, termed hereafter Direct TLB Access (DTA) instructions, as well as, the trap handler mechanism.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Agile Post-Silicon Validation Methodology for the Address Translation Mechanisms of Modern Microprocessors",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7776838/",
            "Abstract": "Detection of bugs in the complex address translation mechanisms (ATMs) of modern microprocessors is much harder than in other microprocessor structures because their output (the physical address) is not directly observable to program or architecture visible locations during post-silicon validation. Errata reports, by major microprocessor vendors about ATM-related bugs found after chips massive production, plea for more efficient validation solutions. In this paper, we formulate the problem of post-silicon validation of microprocessors' address translation hardware, by defining a comprehensive set of bug models. We then propose an ISA-independent post-silicon validation methodology for the ATMs of high-end microprocessors. The method detects ATM bugs right after their manifestation, reveals mismatches due to them and facilitates diagnosis and debug. Our experiment evaluation on an enhanced version of …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:-FonjvnnhkoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced self-configurability and yield in multicore grids",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5195986/",
            "Abstract": "As we move deeper in the nanotechnology era, computer architecture is solicited to manipulate tremendous numbers of devices per chip with high defect densities. These trends provide new computing opportunities but efficiently exploiting them will require a shift towards novel, highly parallel architectures. Fault tolerant mechanisms will have to be integrated to the design to deal with the low yield of future nanofabrication processes. In this paper we consider multi processor grid (MPG) architectures that assure scalability beyond hundreds of cores per chip. We study self-diagnosis and self-configuration methods at the architectural level and propose an enhanced self-configuration methodology that enables usage of a maximum percentage of available fault-free cores in MPGs with high defect densities. We show that our approach achieves usability of all fault-free cores for the case of fault-free routers whereas …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multi-faceted microarchitecture level reliability characterization for nvidia and amd gpus",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8368665/",
            "Abstract": "State-of-the-art GPU chips are designed to deliver extreme throughput for graphics as well as for data-parallel general purpose computing workloads (GPGPU computing). Unlike computing for graphics, GPGPU computing requires highly reliable operations. Since provisioning for high reliability may affect performance, the design of GPGPU systems requires the vulnerability of GPU workloads to soft-errors to be jointly evaluated with the performance of GPU chips. We present an extended study based on a consolidated workflow for the evaluation of the reliability in correlation with the performance of four GPU architectures and corresponding chips: AMD Southern Islands and NVIDIA G80/GT200/Fermi. We obtained reliability measurements (AVF and FIT) employing both fault injection and ACE-analysis based on microarchitecture-level simulators. Apart from the reliability-only and performance-only measurements …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:FAceZFleit8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Systematic software-based self-test for pipelined processors",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4636714/",
            "Abstract": "Software-based self-test (SBST) has recently emerged as an effective methodology for the manufacturing test of processors and other components in systems-on-chip (SoCs). By moving test related functions from external resources to the SoC's interior, in the form of test programs that the on-chip processor executes, SBST significantly reduces the need for high-cost, big-iron testers, and enables high-quality at-speed testing and performance binning. Thus far, SBST approaches have focused almost exclusively on the functional (programmer visible) components of the processor. In this paper, we analyze the challenges involved in testing an important component of modern processors, namely, the pipelining logic, and propose a systematic SBST methodology to address them. We first demonstrate that SBST programs that only target the functional components of the processor are not sufficient to test the pipeline logic …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special session 8B—Panel: In-field testing of SoC devices: Which solutions by which players?",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6818780/",
            "Abstract": "In-field testing of SoC devices is increasingly important to face the dependability requirements of several application domains. Different solutions can be devised and adopted. We summarize the main solutions currently adopted by industry, identify the most critical open issues, and discuss important future trends.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-layer reliability evaluation, moving from the hardware architecture to the system level: A CLERECO EU project overview",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933115000824",
            "Abstract": "Advanced computing systems realized in forthcoming technologies hold the promise of a significant increase of computational capabilities. However, the same path that is leading technologies toward these remarkable achievements is also making electronic devices increasingly unreliable. Developing new methods to evaluate the reliability of these systems in an early design stage has the potential to save costs, produce optimized designs and have a positive impact on the product time-to-market.CLERECO European FP7 research project addresses early reliability evaluation with a cross-layer approach across different computing disciplines, across computing system layers and across computing market segments. The fundamental objective of the project is to investigate in depth a methodology to assess system reliability early in the design cycle of the future systems of the emerging computing continuum. This …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Accelerated online error detection in many-core microprocessor architectures",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6818755/",
            "Abstract": "Forthcoming many-core processors are expected to be highly unreliable due to their high design complexity and aggressive manufacturing technology scaling. Online functional testing is an attractive low-cost error detection solution. A functional error detection scheme for many-core architectures can easily employ existing techniques from single-core microprocessors and exploit the available massive parallelism to reduce the total test execution time. However, the straightforward execution of test programs on such parallel architectures does not achieve the maximum theoretical speedup due to severe congestion on common hardware resources, especially the shared memory and the interconnection network. In this paper, we first identify the memory hierarchy parameters of many-core architectures that slow down the execution of parallel test programs. Then, we study typical test programs to identify which of their …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advances in electronic testing: challenges and methodologies",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/0-387-29409-0.pdf",
            "Abstract": "Advances in electronic testing: challenges and methodologies Edited by Dimitris Gizopoulos \nFrontiers in Electronic Testing π π σ α π δ θ τ µ Advances in Electronic TestingChallenges and \nMethodologies Page 2 ADVANCES IN ELECTRONIC TESTING CHALLENGES AND \nMETHODOLOGIES Page 3 . FRONTIERS IN ELECTRONIC TESTING Consulting Editor Vishwani \nD. Agrawal Books in the series: Introduction to Advanced System-on-Chip Test Design and \nOptimi... Larsson, E., Vol. 29 ISBN: 1-4020-3207-2 Embedded Processor-Based Self-Test \nGizopoulos, D., Vol. 28 ISBN: 1-4020-2785-0 Gizopoulos, D., Vol. 27 ISBN: 0-387-29408-2 \nTesting Static Random Access Memories Hamdioui, S., Vol. 26, ISBN: 1-4020-7752-1 Verification \nby Error Modeling Radecka, K. and Zilic, Vol. 25 ISBN: 1-4020-7652-5 Elements of STIL: \nPrinciples and Applications of IEEE Std. 1450 Maston, G., Taylor, T.(et al.), Vol. 24 ISBN: 1-4020.…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Defect and Fault Tolerance in VLSI Systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4641143/",
            "Abstract": "Defect and Fault Tolerance in VLSI Systems Page 1 IEEE Computer Society Published by \nthe IEEE Computer Society 10662 Los Vaqueros Circle PO Box 3014 Los Alamitos, CA \n90720-1314 IEEE Computer Society Press Order Number P3365 BMS Part Number: \nCFP08078-PRT ISBN 978-0-7695-3365-0 ISSN 1550-5774 The 23rd IEEE International \nSymposium on Defect and Fault Tolerance in VLSI Systems Boston, Massachusetts 1-3 \nOctober, 2008 Edited by Cristiana Bolchini, Yong-Bin Kim, Dimitris Gizopoulos, and \nMohammad Tehranipoor Sponsored by The IEEE Computer Society Test Technology \nTechnical Council The IEEE Computer Society Technical Committee on Fault-Tolerant \nComputing The 23rd IEEE International Symposium on Defect and Fault Tolerance in VLSI \nSystems ISBN 978-0-7695-3365-0 90000 9 780769 533650 …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rt level vs. microarchitecture-level reliability assessment: Case study on arm (r) cortex (r)-a9 cpu",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8023713/",
            "Abstract": "Reliability assessment has always been a major concern in the design of computing systems. The results of the assessment highlight and guide enhancements which trigger redesign cycles; thus early and accurate reliability assessment is of profound importance. For the purposes of early reliability analysis, abstract models of the design (which are available in early design stages) are typically used. These models, however, may not be completely accurate compared to the actual final design. Existing literature has not quantified this inaccuracy, through a comparison between Register-Transfer-Level (RTL) and microarchitecture-level reliability assessment on the same commercial microprocessor design. In this paper, we perform reliability assessment using statistical fault-injection on the RTL and Microarchitectural models of the same commercial ARM ®  Cortex ® -A9 processor. The assessment was performed …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:XoXfffV-tXoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deterministic software-based self-testing of embedded processor cores",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/915006/",
            "Abstract": "A deterministic software-based self-testing methodology for processor cores is introduced that efficiently tests the processor datapath modules without any modification of the processor structure. It provides a guaranteed high fault coverage without repetitive fault simulation experiments which is necessary in pseudorandom software-based processor self-testing approaches. Test generation and output analysis are performed by utilizing the processor functional modules like accumulators (arithmetic part of ALU) and shifters (if they exist) through processor instructions. No extra hardware is required and there is no performance degradation.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-cost software-based self-testing of RISC processor cores",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/document/1245605/",
            "Abstract": "Software self-testing of embedded processor cores, which effectively partitions the testing effort between low-speed external equipment and internal processor resources, has been recently proposed as an alternative to classical hardware built-in self-test techniques over which it provides significant advantages. A low-cost software-based self-testing methodology for processor cores is presented with the aim of producing compact test code sequences developed with a limited engineering effort and achieving a high fault coverage for the processor core. The objective of small test code sequences is directly related to the utilisation of low-speed external testers, since test time is primarily determined by the time required to download the test code to the processor memory at the tester's low frequency. Successful application of the methodology to an RISC processor core architecture with a three-stage pipeline is …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:Y0pCki6q_DkC",
            "Publisher": "IET"
        },
        {
            "Title": "Efficient memory repair using cache-based redundancy",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6069833/",
            "Abstract": "In modern processes, conventional defect density and variability related yield losses are a major concern for the aggressive memory designs in integrated circuits. Synergistic action for memory repair at the circuit and architectural level is essential to maintain the yields and profitability of past technology nodes. In this paper, we propose a scalable memory repair architecture that utilizes a set of direct-mapped cache banks to replace faulty words. Statistical and mathematical probability analysis shows that the proposed scheme achieves high repairability levels with low area and static power dissipation overheads, the latter being a dominant issue in nanometer technologies. It is therefore a suitable solution along with other mature memory repair techniques, to enhance the overall repairability features and guarantee the correct and reliable operation of embedded memories in nanometer technologies.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Case Studies—Experimental Results",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-2801-4_6",
            "Abstract": "In this Chapter we discuss the application of software-based self-testing to several embedded processor designs that are publicly available. As in Dther cases of engineering research, one of the most difficult problems in software-based self-testing is the availability of reasonably complex and representative benchmark cases to demonstrate the practical value and applicability of the methodology",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:5awf1xo2G04C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Towards resilient EU HPC systems: A blueprint",
            "Publication year": 2020,
            "Publication url": "https://hal.inria.fr/hal-02922257/",
            "Abstract": "One of the greatest challenges in High-Performance Computing (HPC) is the need to build resilient systems. Resilience is an especially difficult challenge in HPC, in which tightly coupled compute jobs typically execute across a large number of nodes for several hours or even days. Without effective provisions for resilience, in hardware and/or software, a single failure in one node or server typically causes a domino effect, resulting in the termination of the whole job. Such job termination normally results in no useful outcome, so the node hours that have already been expended on the job are wasted. Recently, the most common use of supercomputers and HPC systems are applications that solve large-scale real-world simulation problems [1, 2, 3]. Such applications, implemented as workflows or multi-scale systems are inherently fault-tolerant and have error-containment capabilities that eliminate the domino effects caused by failures. However, failure in a node executing a distributed thread leads to contained error recovery, which translates into decreased performance and throughput.System reliability is also an important limiter on the ability to scale to larger systems. This is because increasing the number of nodes causes the overheads of error containment and error recovery to increase exponentially. Reliability is therefore an important requirement and challenge for exascale, as recognized by the HPC strategic research agendas of the European Technology Platform for High Performance Computing (ETP4HPC)[4, 5, 6], Eurolab4HPC [7], the US Department of Energy [8, 9, 10, 11] and the US National laboratories [12, 13].",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:5icHVeHT4IsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving the Energy Efficiency by Exceeding the Conservative Operating Limits",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-92792-3_13",
            "Abstract": "This chapter presents UniServer that exploits the increased variability within CPUs and memories manufactured in advanced nanometer nodes that give rise to another type of heterogeneity; the intrinsic hardware heterogeneity which differs from the functional heterogeneity, which is discussed in the previous chapters. In particular, the aggressive miniaturization of transistors led to worsening of the static and temporal variations of transistor parameters, resulting eventually to large variations in the performance and energy efficiency of the manufactured chips. Such increased variability causes otherwise-identical nanoscale circuits to exhibit different performance or power-consumption behaviors, even though they are designed using the same processes and architectures and manufactured using the same exact production lines. The UniServer approach discussed in this chapter attempts to quantify the intrinsic …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:HtEfBTGE9r8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "GUFI: A framework for GPUs reliability assessment",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7482077/",
            "Abstract": "Modern many-core Graphics Processing Units (GPUs) are extensively employed in general purpose computing (GPGPU), offering a remarkable execution speedup to inherently data parallel workloads. Unlike graphics computing, GPGPU computing has more stringent reliability requirements. Thus, accurate reliability assessment of GPU hardware structures is important for making informed decisions for error protection. In this paper we focus on microarchitecture-level reliability assessment for GPU architectures. The paper makes the following contributions. First, it presents a comprehensive fault injection framework that targets key hardware structures of GPU architectures such as the register file, the shared memory, the SIMT stack and the instruction buffer, which altogether occupy large part of a modern GPU silicon area. Second, it reports our reliability assessment findings for the target structures, when the GPU …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:VaXvl8Fpj5cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Online error detection in multiprocessor chips: A test scheduling study",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6604071/",
            "Abstract": "Multicore architectures are employed in the majority of computing domains (general-purpose microprocessors as well as specialized high-performance architectures such as network processors). Online error detection in such chips can employ effective techniques from single core microprocessors, however, effective test scheduling should be employed to minimize the overall chip test execution time which can significantly increase due to congestion on common hardware resources used by the cores. In this paper, we analyze the most important aspects of online error detection and scheduling in multiprocessor chips and evaluate test execution time in several different configurations of Intel's SCC architecture.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Demystifying soft error assessment strategies on arm cpus: Microarchitectural fault injection vs. neutron beam experiments",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8809532/",
            "Abstract": "Fault injection in early microarchitecture-level simulation CPU models and beam experiments on the final physical CPU chip are two established methodologies to access the soft error reliability of a microprocessor at different stages of its design flow. Beam experiments, on one hand, estimate the devices expected soft error rate in realistic physical conditions by exposing it to accelerated particles fluxes. Fault injection in microarchitectural models of the processor, on the other hand, provides deep insights on faults propagation through the entire system stack, including the operating system. Combining beam experiments and fault injection data can deliver deep insights about the devices expected reliability when deployed in the field. However, it is yet largely unclear if the fault injection error rates can be compared to those reported by beam experiments and how this comparison can lead to informed soft error …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:HtS1dXgVpQUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An input vector monitoring concurrent BIST scheme exploiting “X” values",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5196015/",
            "Abstract": "Input Vector Monitoring Concurrent Built-In Self Test schemes provide the capability to perform testing while the Circuit Under Test operates normally, by exploiting vectors that appear at the inputs of the CUT during its normal operation. The Concurrent Test Latency of an input vector monitoring scheme is the time required for the concurrent test to complete. Input Vector Monitoring Concurrent BIST schemes that have been proposed to date, are based mainly on test sets containing binary (1 or 0) values. Test sets extracted by modern CAD tools, largely contain don't care (dasiaXpsila) values. In this work a novel input vector monitoring concurrent BIST scheme is presented, based on a test set containing dasiaXpsila values. The proposed scheme compares favourably with respect to the hardware overhead - concurrent test latency trade off with previously proposed techniques.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DEPENDABLE AND SECURE COMPUTING",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6078485/",
            "Abstract": "[Front cover] Page 1 IEEE TRANSACTIONS ON DEPENDABLE AND SECURE \nCOMPUTING A publication of the IEEE Computer Society VOLUME 9 NUMBER 1 ITDSCM (ISSN \n1545-5971) www.computer.org tdsc@computer.org JANUARY/FEBRUARY 2012 Editorial R. \nSandhu .......................................................................................................................................................................... \n1 PAPERS A Flexible Approach to Improving System Reliability with Virtual Lockstep CM \nJeffery and RJO Figueiredo .................................................................................................................................... \n2 A Flexible Approach to Multisession Trust Negotiations AC Squicciarini, E. Bertino, A. \nTrombetta, and S. Braghin ............................................................................................... 16 A \nStochastic Model of Multivirus Dynamics S. Xu, W. Lu, and Z. Zhan .................................................................................................................................................. \n30 Conditional Diagnosability of under …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SBST for on-line detection of hard faults in multiprocessor applications under energy constraints",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5560233/",
            "Abstract": "Software-Based Self-Test (SBST) has emerged as an effective method for on-line testing of processors integrated in non safety-critical systems. However, especially for multi-core processors, the notion of dependability encompasses not only high quality on-line tests with minimum performance overhead but also methods for preventing the generation of excessive power and heat that exacerbate silicon aging mechanisms and can cause long term reliability problems. In this paper, we initially extend the capabilities of a multiprocessor simulator in order to evaluate the overhead in the execution of the useful application load in terms of both performance and energy consumption. We utilize the derived power evaluation framework to assess the overhead of SBST implemented as a test thread in a multiprocessor environment. A range of typical processor configurations is considered. The application load consists of …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A concurrent built-in self-test architecture based on a self-testing RAM",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1402683/",
            "Abstract": "Manufacturing test is carried-out once to ensure the correct operation of the circuit under test right after fabrication, while testing is carried-out periodically to ensure that the circuit under test continues to operate correctly on the field. The use of offline built-in self-test (BIST) techniques for periodic testing imposes the interruption of the normal operation of the circuit under test. On the other hand, the use of input vector monitoring concurrent BIST techniques for periodic testing provides the capability to perform the test, while the circuit under test continues to operate normally. In this paper, a novel input-vector monitoring concurrent BIST technique for combinational circuits based on a self-testing RAM, termed R-CBIST, is presented. The presented technique compares favorably to the other input vector monitoring concurrent BIST techniques proposed so far with respect to the hardware overhead, and the time required …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis and characterization of ultra low power branch predictors",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8615680/",
            "Abstract": "Branch predictors are widely used to boost the performance of microprocessors. However, this comes at the expense of power because accurate branch prediction requires simultaneous access to several large tables on every fetch. Consumed power can be drastically reduced by operating the predictor under sub-nomimal voltage levels (undervolting) using a separate voltage domain. Faulty behavior resulting from undervolting the predictor arrays impacts performance due to additional mispredictions but does not compromise system reliability or functional correctness. In this work, we explore how two well established branch predictors (Tournament and L-Tage) behave when aggressively undervolted below minimum fault-free supply voltage (Vmin). Our results based on fault injection and performance simulations show that both predictors significantly reduce their power consumption by more than 63% and can …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:6ZxmRoH8BuwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hybrid-SBST methodology for efficient testing of processor cores",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4447912/",
            "Abstract": "In this article, we introduce a hybrid-SBST methodology for efficient testing of commercial processor cores that effectively uses the advantages of various SBST methodologies. Self-test programs based on deterministic structural SBST methodologies combined with verification-based self-test code development and directed RTPG constitute a very effective H-SBST test strategy. The proposed methodology applies directed RTPG as a supplement to improve overall fault coverage results after component-based self-test code development has been performed.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest editors' introduction: Design for yield and reliability",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/41750753/Guest_Editors_Introduction_Design_for_Y20160129-17425-1k4tf5b.pdf",
            "Abstract": "■ A similar variation in layer thickness can cause electromigration in metallic or dielectric layers. This results in a higher resistance that manifests as intermittent delays. Over time, the high-resistance in interconnects can become permanent opens.■ The variation in layer thickness can also result in adjacent or crossing conductor signals, which cause intermittent contacts. This can, over time, turn into permanent shorts.The third fault type is transient faults, also known as soft errors. They typically occur because of temporary environmental conditions. Possible causes of transient faults are neutron and alpha particles; power supply and interconnect noise; electromagnetic interference; and electrostatic discharge. Trends in nanometer technologies are having a very negative impact on reliability because of shrinking geometries, lower power voltages, and higher frequencies. This is increasing process variation and manufacturing residuals, and, as a result, increasing the likelihood of intermittent faults. The same smaller transistors and lower voltages result in higher sensitivity to alpha particles and neutrons, thus causing significantly higher rates of particle-induced transient faults. Smaller interconnect features, causing the Miller effect, and higher performances, causing the skin effect, result in a higher number of transient timing errors. Finally, the increased coupling capacitance between adjacent conductors causes higher crosstalk noise and results in crosstalk-induced transient delays. Given these nanometer trends, conventional techniques for improving yield and screening for reliability failures face serious limitations. For instance, the effectiveness …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Accelerated microarchitectural fault injection-based reliability assessment",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7315134/",
            "Abstract": "Statistical Fault Injection on microarchitectural simulators can provide early and accurate reliability characterization for array based hardware components. Besides, microarchitectural fault injectors are easily configurable (facilitating many reliability studies) and orders of magnitude faster than RTL fault injectors, rendering them appropriate tools for early reliability estimation using large and realistic benchmarks. However, the throughput of the fault injection campaigns on microarchitectural simulators remains a bottleneck when a batch of campaigns must run for early reliability estimation of a processor (different microarchitectural characteristics, different workloads). This paper presents two different operation modes on top of a baseline framework for statistical fault injection campaigns, trading off between accuracy and speedup of the injection campaigns with a state-of-the-art out-of-order full-system ×86-64 …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:BwyfMAYsbu0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unveiling difficult bugs in address translation caching arrays for effective post-silicon validation",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7753339/",
            "Abstract": "Post-silicon validation is one of the most important parts of the microprocessor prototype chip lifecycle. It is the last chance for debug engineers to detect defects and bugs that escaped pre-silicon verification, before the chip is released to the market. Effective solutions are required to harness the peak performance of the hardware prototype and evaluate whether the microprocessor chip is fully compliant with the instruction set and other specifications. We perform a comprehensive experimental study on a state-of-the-art microarchitecture to assess and identify the most difficult bugs in address translation caching arrays (multi-level TLBs and MMU Caches), and explain why these bugs persist across generations. We also categorize them into distinct bug scenarios. We then propose a novel methodology for generating random self-checking stimuli programs, which expose and detect such bug scenarios. Our …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:WZBGuue-350C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effective low power BIST for datapaths",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/840890/",
            "Abstract": "Power in processing cores (microprocessors, DSPs) is primarily consumed in the datapath part. Among the datapath functional modules, multipliers consume the largest amount of power due to their size and complexity. We propose a low power BIST scheme for datapaths built around multiplier-accumulator pairs. The target is low average power dissipation between successive test vectors. This is achieved by taking advantage of the regularity of multiplier modules and achieving very high fault coverage by a linear-sized test set with as small as possible input switching activity. The proposed BIST scheme is more efficient than pseudorandom BIST for the same high fault coverage target. Up to 77.2% power saving is achieved in the set of experimental results provided in the paper.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Jerzy Dabrowski DK Das Shamik Das Pallab Dasgupta",
            "Publication year": 2014,
            "Publication url": "https://search.proquest.com/openview/125b8ecec72778567d0692325ecf57a7/1?pq-origsite=gscholar&cbl=54186",
            "Abstract": "2013 Reviewers Page 1 2013 Reviewers Published online: 7 February 2014 © Springer \nScience+Business Media New York 2014 Abdellatif Abu-Issa Miguel Angel Aguirre Waleed \nAl-Assadi Yousra Alkabani Himyanshu Anand Lorena Anghel Daniel Arumi Nicholas Axelos \nFlorence Azais Jose Rodrigo Azambuja Luz Balado Lars Bauer Jayanta Bhadra Sanjukta Bhanja \nSwarup Bhunia Shawn Blanton Christophe Bobda Cristiana Bolchini Alberto Bosio Alex Brodsky \nLuigi Carro Amlan Chakrabarti Rajat Chakraborty Santanu Chattopadhyay Jwu-E Chen Min \nChen Mingsong Chen Mingjing Chen Minsu Choi Lukasz Chruszczyk Bruce Cockburn Edmond \nCooley Enrico Costenaro Erika Cota Jerzy Dabrowski DK Das Shamik Das Pallab Dasgupta \nStefano Di Carlo Luigi Dilillo Michael Dimopoulos Jennifer Dworak Stephan Eggersglues \nOsman Ekekon Luis Entrena Yaniv Fais Hongxia Fang Bernhard Fechner Shaun Fey -…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:tKAzc9rXhukC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Functional processor-based testing of communication peripherals in systems-on-chip",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4276771/",
            "Abstract": "Software-based self-testing (SBST) of microprocessors and processor-based testing of systems-on-chip (SoCs) recently captured intense test technology research efforts because they provide an effective alternative or supplement to other classic testing and self-testing approaches. Despite the importance of peripheral cores in SoCs (in terms of functionality and size), the applicability and limits of SBST on them have not been comprehensively studied. In this paper, we study the effectiveness of SBST on a broad class of communication peripheral cores in SoCs. A systematic application of SBST on two popular peripherals (universal asynchronous receiver transmitter and Ethernet) demonstrates the effectiveness of SBST on SoCs with such cores.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An effective deterministic BIST scheme for shifter/accumulator pairs in datapaths",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1011113508662",
            "Abstract": "In this paper an effective Built-In Self-Test (BIST) scheme for the shifter-accumulator pair (accumulation performed either by an adder or an ALU) which appears very often in embedded processor, microprocessor or DSP datapaths is introduced. The BIST scheme provides very high fault coverage (>99%) with respect to the stuck-at fault model for any datapath width with a regular, very small and counter-generated deterministic test set, as it is verified by a comprehensive set of experiments.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:dhFuZR0502QC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Dependable multicore architectures at nanoscale: The view from europe",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6905763/",
            "Abstract": "This article presented a survey of dependability issues faced by multi-core architectures at nanoscale technology nodes. Existing solutions against these challenges were also discussed, describing their scope of application, from technology level methodologies, to design approaches to the metrics required to evaluate the overall dependability of a system. In the future, the constant reduction of the feature size of the devices will exacerbate the issues related to aging and soft errors. This will create further challenges and at design level, an integrated design approach that will cope with the occurrence of faults at any time of their occurrence i.e., at manufacturing (thus increasing yield) and in the field (thus increasing reliability) will become more and more important to obtain economically viable and dependable systems. Dependability assessment will also need an integrated approach for cross-layer, pre- and post …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:t7zJ5fGR-2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The impact of cpu voltage margins on power-constrained execution",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9296366/",
            "Abstract": "CPUs typically operate at a voltage which is higher than what is strictly required, using voltage margins to account for process variability and anticipate any combination of adverse operating conditions. However, these worst-case scenarios occur rarely, if ever, thus the operating voltage is overly pessimistic resulting in excessive power dissipation which leads to decreased performance under power capping. In this paper, we investigate the impact of reducing voltage margins beyond the nominal level on the efficiency of CPU power capping mechanisms, for three commercial systems, two Applied Micro ARMv8 micro-servers (X-Gene2 and X-Gene3) and an Intel x86-64 (Xeon E3). We show that CPU power capping at reduced voltage margins compared with Intel's RAPL and Dynamic Frequency Scaling (DFS) mechanisms results in performance improvement by up to 64% and 24% on average, respectively. In …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:sJsF-0ZLhtgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Systematic software-based self-test for pipelined processors",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1688828/",
            "Abstract": "Software-based self-test (SBST) has recently emerged as an effective methodology for the manufacturing test of processors and other components in systems-on-chip (SoCs). By moving test related functions from external resources to the SoC's interior, in the form of test programs that the on-chip processor executes, SBST eliminates the need for high-cost testers, and enables high-quality at-speed testing. Thus far, SBST approaches have focused almost exclusively on the functional (directly programmer visible) components of the processor. In this paper, we analyze the challenges involved in testing an important component of modern processors, namely, the pipelining logic, and propose a systematic SBST methodology to address them. We first demonstrate that SBST programs that only target the functional components of the processor are insufficient to test the pipeline logic, resulting in a significant toss of fault …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deconfigurable microprocessor architectures for silicon debug acceleration",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2485922.2485976",
            "Abstract": "The share of silicon debug in the overall microprocessor chips development cycle is rapidly expanding due to the ever growing design complexity and the limited efficiency of pre-silicon validation methods. Massive application of short random test programs on the prototype microprocessor chips is one of the most effective parts of silicon debug. However, a major bottleneck and source of\" noise\" in this phase is that large numbers of random test programs fail due to the same or similar design bugs. This redundant behavior adds long delays in the debug flow since each failing random program must be separately examined, although it does not usually bring new debug information. The development of effective techniques that detect dominant modes of failure among random programs and triage them into common categories eliminate redundant debug sessions and significantly boost silicon debug.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance-aware reliability assessment of heterogeneous chips",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7928940/",
            "Abstract": "Technology evolution has raised serious reliability considerations, as transistor dimensions shrink and modern microprocessors become denser and more vulnerable to faults. Reliability studies have proposed a plethora of methodologies for assessing system vulnerability which, however, highly rely on traditional reliability metrics that solely express failure rate over time. Although Failures In Time (FIT) is a very strong and representative reliability metric, it may fail to offer an objective comparison of highly diverse systems, such as CPUs against GPUs or other accelerators that are often employed to execute the same algorithms implemented for these platforms. In this paper, we propose a reliability evaluation methodology that takes into account the probability of a workload execution failure in order to compare heterogeneous systems, while we also capture the differences in the performance of these systems. We …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:Dip1O2bNi0gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest Editorial Robust System Design: IEEE International On-Line Testing and Robust System Design Symposium (IOLTS) 2018",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8661589/",
            "Abstract": "You are reading the Editorial of the Special Section of IEEE Transactions on Device and Materials Reliability (TDMR) with a collection of the best papers of the 2018 edition of the IEEE International On-Line Testing 50 and Robust System Design Symposium (IOLTS), an established IEEE symposium which has focused for more than two decades on the challenges and solutions for electronic circuits and systems  robust design . Held for its first 21 years as the IEEE International On-Line Testing Symposium, it was recently renamed to the  International On-Line Testing and Robust Systems Design Symposium , keeping its well-recognized acronym IOLTS; it continues a healthy history with its quarter-century (25th) edition planned for July 2019.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:4vMrXwiscB8C",
            "Publisher": "ieee"
        },
        {
            "Title": "Processor Testing Techniques",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-2801-4_4",
            "Abstract": "Intensive research has been performed since the appearance of the first microprocessor in the field of processor testing. A variety of generic methodologies as well as several ad hoc solutions has been presented in the literature. In this Chapter we provide an overview of the open literature in processor testing, putting emphasis on the different characteristics of the approaches and the requirements that each of them tries to meet.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:eq2jaN3J8jMC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Soft Errors: System Effects, Protection Techniques and Case Studies",
            "Publication year": 2008,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/date/2008/04484646/12OmNynJMIS",
            "Abstract": "Formal analysis and optimisation of networked real-time systems has reached industrial maturity and is now regularly used, eg in automotive system design. More recently, such formal methods have been extended to MpSoCs, as a complement to simulation in order to improve predictability and reach performance guarantees.The tutorial starts with an introduction to formal platform performance analysis covering the main communication and resource modelling techniques and their application to embedded systems and MpSoC. Next is an overview on industrial applications and experiences followed by a comprehensive use case from automotive design which demonstrates how to acquire the necessary model data. The fourth presentation provides an approach to predictable MpSoC platform sharing using service shaping concepts and a corresponding formal performance analysis approach. The current …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Architectures for online error detection and recovery in multicore processors",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5763096/",
            "Abstract": "The huge investment in the design and production of multicore processors may be put at risk because the emerging highly miniaturized but unreliable fabrication technologies will impose significant barriers to the life-long reliable operation of future chips. Extremely complex, massively parallel, multi-core processor chips fabricated in these technologies will become more vulnerable to: (a) environmental disturbances that produce transient (or soft) errors, (b) latent manufacturing defects as well as aging/wearout phenomena that produce permanent (or hard) errors, and (c) verification inefficiencies that allow important design bugs to escape in the system. In an effort to cope with these reliability threats, several research teams have recently proposed multicore processor architectures that provide low-cost dependability guarantees against hardware errors and design bugs. This paper focuses on dependable multicore …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest Editors' Introduction: Special Section on Dependable Computer Architecture",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Gizopoulos/publication/220331336_Guest_Editors'_Introduction_Special_Section_on_Dependable_Computer_Architecture/links/53e5dce70cf25d674e9c3795/Guest-Editors-Introduction-Special-Section-on-Dependable-Computer-Architecture.pdf",
            "Abstract": "COMPUTER architecture is a wide active research field that spans all aspects of computer systems design. Dependability-the trustworthiness of a computing system which allows reliance to be justifiably placed on the service it delivers-has always been a key aspect of computer architecture and has been extensively investigated since the first days of computing. Traditionally, dependable computer architectures are utilized in high-end computing systems or computing systems for critical applications, where continuous, uninterrupted operation is among the most important requirements and systems are characterized by high reliability, availability, and maintainability (wellknown measures to quantify dependability). The time has now come for the wealth of concepts and methodologies in the field of dependable (also known as fault-tolerant) computer architecture that have been proposed during the last several decades, to be adopted and extended in mainstream, general-purpose computing systems. Dependable operation of computing systems is a mandatory requirement in virtually all application fields (at lower or higher costs), due to the increasing reliance of everyday human activities on computers or microprocessor-based systems in general. Unfortunately, this ubiquitous computing revolution comes in hand with hard-tosolve technological issues that are closely related to dependable operation of a computing system. Integrated circuits are implemented today in miniaturized and inherently unreliable technologies that render circuits more vulnerable to both temporary disturbances leading to transient (or soft) errors and to permanent (or hard …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Accumulator-based test generation for robust sequential fault testing in DSP cores in near-optimal time",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1525040/",
            "Abstract": "The detection of robustly detectable sequential faults has been extensively studied. A number of researchers have provided theoretical as well as experimental results designating that the application of single input change (SIC) pairs of test patterns results in favorable results for sequential fault testing. In this paper, a novel algorithm for the generation of SIC pairs is presented, termed Accumulator-based test generation for Robust sequential fault testing in Near-optimal time (ARN). ARN is implemented in hardware utilizing an accumulator whose inputs are driven by a barrel shifter. Since such structures are commonly found in general-purpose or specialized microprocessors or digital signal processors (DSP), the presented architecture provides a practical solution for the built-in testing of such circuits.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-cost, on-line software-based self-testing of embedded processor cores",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1214382/",
            "Abstract": "A comprehensive online test strategy requires both concurrent and non-concurrent fault detection capabilities to guarantee SoCs's successful normal operation in-field at any level of its life cycle. While concurrent fault detection is mainly achieved by hardware or software redundancy, like duplication, non-concurrent fault detection, particularly useful for periodic testing, is usually achieved through hardware BIST. Software-based self-test has been recently proposed as an effective alternative to hardware-based self-test allowing at-speed testing while eliminating area, performance and power consumption overheads. In this paper we focus on the applicability of software-based self-test to non-concurrent on-line testing of embedded processor cores. Low-cost in-field testing requirements, particularly small test execution time and low power consumption guide the development of self-test routines. We show how self …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An input vector monitoring concurrent BIST architecture based on a precomputed test set",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4479445/",
            "Abstract": "Built-In Self-Test (BIST) techniques constitute an effective and practical approach for VLSI circuits testing. BIST schemes are typically classified into two categories: off-line and on-line. Input vector monitoring concurrent BIST schemes are a class of on-line techniques that circumvent the problems appearing separately in on-line and in off-line BIST. The utilization of input vector monitoring concurrent BIST techniques provides the capability to perform testing at different stages, manufacturing, periodic off-line and concurrent online. The input vector monitoring concurrent BIST schemes proposed so far have targeted either exhaustive or pseudorandom testing separately. In this paper a novel input vector monitoring concurrent BIST scheme based on a pre-computed test set is presented. The proposed scheme can perform both concurrent on-line and off-line testing; therefore it can be equally well utilized for …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-cost, on-line self-testing of processor cores based on embedded software routines☆",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269204000035",
            "Abstract": "On-line testing for complex system-on-chip architectures requires a synergy of concurrent and non-concurrent fault detection mechanisms. While concurrent fault detection is mainly achieved by hardware or software redundancy, like duplication, non-concurrent fault detection, particularly useful for periodic testing, is usually achieved through hardware-based self-test.Software-based self-test has been recently proposed as an effective alternative to hardware-based self-test allowing at-speed testing while eliminating area, performance and power consumption overheads.In this paper, we investigate the applicability of software-based self-test to non-concurrent on-line testing of embedded processor cores and define, for the first time, the corresponding requirements. Low-cost, in-field testing requirements, particularly small test execution time and low power consumption guide the development of self-test routines. We …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:7PzlFSSx8tAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Effective low power BIST for datapaths (poster paper)",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/343647.344345",
            "Abstract": "Power in processing cores (microprocessors, DSPs) is primarily consumed in the datapath part. Among the datapath functional modules, multipliers consume the largest amount of power due to their size and complexity. We propose a low power BIST scheme for datapaths built around multiplieraccumulator pairs. The target is low average power dissipation between successive test vectors. This is achieved by taking advantage of the regularity of multiplier modules and achieving very high fault coverage by a linearsized test set with as small as possible input switching activity. The proposed BIST scheme is more efficient than pseudorandom BIST for the same high fault coverage target. Up to 77.25% power saving is achieved in the set of experimental results provided in the paper.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:6yz0xqPARnAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bayesian network early reliability evaluation analysis for both permanent and transient faults",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7229819/",
            "Abstract": "Analyzing the impact of software execution on the reliability of a complex digital system is an increasing challenging task. Current approaches mainly rely on time consuming fault injections experiments that prevent their usage in the early stage of the design process, when fast estimations are required in order to take design decisions. To cope with these limitations, this paper proposes a statistical reliability analysis model based on Bayesian Networks. The proposed approach is able to estimate system reliability considering both the hardware and the software layer of a system, in presence of hardware transient and permanent faults. In fact, when digital system reliability is under analysis, hardware resources of the processor and instructions of program traces are employed to build a Bayesian Network. Finally, the probability of input errors to alter both the correct behavior of the system and the output of the program …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:ML0RJ9NH7IQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive voltage/frequency scaling and core allocation for balanced energy and performance on multicore CPUs",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8675246/",
            "Abstract": "Energy efficiency is a known major concern for computing system designers. Significant effort is devoted to power optimization of modern systems, especially in large-scale installations such as data centers, in which both high performance and energy efficiency are important. Power optimization can be achieved through different approaches, several of which focus on adaptive voltage regulation. In this paper, we present a comprehensive exploration of how two server-grade systems behave in different frequency and core allocation configurations beyond nominal voltage operation. Our analysis, which is built on top of two state-of-the-art ARMv8 microprocessor chips (Applied Micro's X-Gene 2 and X-Gene 3) aims (1) to identify the best performance per watt operation points when the servers are operating in various voltage/frequency combinations, (2) to reveal how and why the different core allocation options on the …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:IRz6iEL74y4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "4 Microprocessor Software",
            "Publication year": 2010,
            "Publication url": "https://www.computer.org/csdl/magazine/dt/2010/03/mdt20100300c2/13rRUB6SpPT",
            "Abstract": "Table of Contents IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE \nComputer Society Digital Library Jobs Tech News Resource Center Press Room Browse By \nDate Advertising About Us IEEE IEEE Computer Society IEEE Computer Society Digital Library \nMy Subscriptions Magazines Journals Conference Proceedings Institutional Subscriptions IEEE \nIEEE Computer Society More Jobs Tech News Resource Center Press Room Browse By Date \nAdvertising About Us Cart Advanced Search IEEE Design and Test IEEE Design and Test \nHome Current Issue Early Access IEEE Design and Test Download 1.Home 2.magazines \n3.IEEE Design and Test 4.Table of Contents 2010, pp. c2-c2, vol. 27 DOI Bookmark: \n10.1109/MDT.Keywords Authors Abstract Presents the front cover/table of contents for this issue \nof the periodical. [IEEE Design & Test] 6/5/10 15:49:35,Features,4,M,icroprocessor,Self-Testing,,…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ISA-independent post-silicon validation for the address translation mechanisms of modern microprocessors",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7604675/",
            "Abstract": "Post-silicon validation complements traditional simulation-based pre-silicon verification and offers very high throughput since validation programs run at the speed of the actual hardware. Detection of bugs in the address translation subsystem of a microprocessor is much less straightforward than other hardware blocks because the address translation is an implicit process, which does not have an easily observable output to architecture or program visible locations. Validation of the correctness of the address translation mechanisms (ATMs) of microprocessors is both very important and challenging problem. In this paper, we present an ISA-independent methodology for the post-silicon validation of the ATMs in modern microprocessors. We first capture the effects of design bugs in address translation, by presenting actual bugs scenarios reported for commercial chips. We also describe an effective method for the …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:M7yex6snE4oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Transactions/Journals Department",
            "Publication year": 2014,
            "Publication url": "https://www.computer.org/csdl/journal/si/2014/05/06803926/13rRUyfbwok",
            "Abstract": "IEEE TRANSACTIONS ON VERY LARGE SCALE INTEGRATION (VLSI) SYSTEMS, The Circuits and Systems Society is an association of IEEE members with professional interest in the, fi, eld of circuits and systems theory. All members of the IEEE are eligible for membership in the, Circuits and Systems Society upon payment of the annual Society membership fee of $19.00. The Computer Society is an association of people with profes, sional interest in the, fi, eld of computers. All, members of the IEEE are eligible for membership in the Computer Society upon payment of the annual Society membership fee of $56.00. For information on, joining, write to the IEEE Computer, Society, 1730 Massachusetts Avenue, NW, Washington, DC 20036-1903. The annual subscription fee for members of either society is $34.00. For informa, tion on joining, write to the IEEE at the, address below., Member copies of Transactions …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "HealthLog monitor: A flexible system-monitoring Linux service",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8474119/",
            "Abstract": "Error monitoring is a critical procedure for most computing systems, varying from HPC to embedded systems domains. Several generic architectures have been proposed and employed in modern processors, offering the capability of hardware-level error detection. This critical information is required to isolate and/or mitigate failures. However, research has revealed many cases where indications of upcoming failures can be identified early and before the actual fail occurrence, known as symptoms. Such cases become more frequent as technology trends try to exploit the conservative worst-case voltage guardbands and push computing systems towards more aggressive and often hazardous regions. In this paper we present HealthLog monitor, a flexible system monitoring service that offers a generic abstraction layer to combine both error and symptom monitoring. HealthLog is capable of monitoring hardware …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:XvxMoLDsR5gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust and low-cost BIST architectures for sequential fault testing in datapath multipliers",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/923412/",
            "Abstract": "The modified Booth array multiplier is the most ubiquitous multiplier architecture in the datapaths of either general purpose microprocessors or specialized Digital Signal Processors. Sequential fault testing for Booth array multipliers has never been proposed in the past. In this paper, we present two BIST architectures for modified Booth array multipliers with respect to the Realistic Sequential Cell Fault model (RS-CFM). The first BIST architecture aims to resolve the test invalidation problem to the largest possible extent, while the second one aims to test cost reduction. Both BIST architectures achieve very high sequential fault coverage and impose moderate hardware and delay overhead. Simplified variations of the two BIST architectures are also presented for the non-recoded signed array multipliers. Thus, the proposed BIST architectures offer a universal BIST solution that covers the totality of signed array …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A functional self-test approach for peripheral cores in processor-based SoCs",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4274866/",
            "Abstract": "Functional Software-Based Self-Testing (SBST) of microprocessors and processor-based testing of Systems-on- Chip (SoCs) have recently attracted the attention of test technology research community because they provide an effective alternative to other traditional testing and self- testing approaches. SBST allows at-speed functional testing of SoC cores with virtually no circuit overhead and limited dependence on external testers. Despite the importance of peripheral control cores in SoCs (in terms of functionality and size), the applicability and limits of SBST on them have not been comprehensively studied. In this paper, we study the effectiveness of SBST on a broad class of communication peripherals. A systematic application of SBST on two popular peripheral cores (UART and Ethernet) demonstrates the effectiveness of SBST on SoCs with such cores.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low cost convolutional code based concurrent error detection in FSMs",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1250130/",
            "Abstract": "We discuss the use of convolutional codes to perform concurrent error detection (CED) in finite state machines (FSMs). We examine a previously proposed methodology, we identify its limitations, and we outline two improvements that reduce its cost and enhance its effectiveness. More specifically, we demonstrate how the existing FSM hardware can be reused for computing the convolutional code keys and we formulate the optimization problem of maximizing hardware reusability. Additionally we extend the proposed methodology to detect errors that only affect the output logic but not the next state of the FSM, and which are not detected by the previously proposed methodology.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Versatile architecture-level fault injection framework for reliability evaluation: A first report",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6873686/",
            "Abstract": "Forthcoming technologies hold the promise of a significant increase in integration density, performance and functionality. However, a dramatic change in microprocessor's reliability is also expected. Developing mechanisms for early and accurate reliability estimation will save significant design effort, resources and consequently will positively impact product's time-to-market (TTM). In this paper, we propose a versatile architecture-level fault injection framework, built on top of a state-of-the-art x86 microprocessor simulator, for thorough and fast characterization of a wide range of hardware components with respect to various fault models.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:j8SEvjWlNXcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dependable multicore architectures at nanoscale",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-54422-9.pdf",
            "Abstract": "The increasing diversity, density, and complexity of electronic devices is enabling the so-called digital revolution with the evident pervasive presence of electronics in everybody’s lives. The benefits of this ubiquitous presence are impressive and widespread: from the constant improvement of productivity in the workplace to the societal impact of a constantly connected and sharing community. Whatever is the considered scenario, all this incredible progress has been relying on the assumption that the devices can be depended on in their application and for their purposes. The foundations for this assumption are based on a constant work behind the scenes of the technical and scientific community aimed at enhancing the dependability of the devices.Dependability is a broad term that summarizes several aspects of a system, which typically include availability, reliability, maintainability, safety, and security. All these …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Springer"
        },
        {
            "Title": "Measuring the performance impact of permanent faults in modern microprocessor architectures",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6604075/",
            "Abstract": "Large silicon parts of modern microprocessors are dedicated to components that increase performance but don't determine functional correctness. Permanent hardware faults in such components lead to performance fluctuation (not necessarily degradation) but do not produce functional errors. This fact has been identified previously but neither an accurate classification of the behavior of permanent faults in these components over a set of CPU benchmarks nor detailed measurements of the magnitude of their performance impact has been reported. Depending on such measurements the performance-related components of microprocessors can be disabled in fine or coarse granularities, salvaging the microprocessor functionality although at different performance levels. In this paper, we describe a comprehensive framework for the analysis of the impact of permanent faults in the arrays and the control logic of key …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Processor-Based Testing of SoC",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4020-2801-4_7.pdf",
            "Abstract": "In this Chapter, we discuss the concept of software-based self-testing of SoC designs as an extension of software-based self-testing of embedded processors.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Micro-viruses for fast system-level voltage margins characterization in multicore CPUs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8366935/",
            "Abstract": "In this paper, we propose the employment of fast targeted programs (diagnostic micro-viruses) that aim to stress individually the main hardware components of a multicore CPU architecture which most likely determine the limits of voltage scaling, i.e. safe Vmin values. We describe in detail the complex development process for the diagnostic micro-viruses and their comprehensive validation in modern multicore CPU hardware. The combined execution of the micro-viruses takes very short time compared to regular programs execution, and can quickly reveal the voltage limits of the cores and chips at voltage levels below nominal. The micro-virus based characterization flow requires orders of magnitude shorter time while it delivers virtually identical: (a) Vmin values for the different CPU chips, and (b) Vmin values for the different cores within a CPU chip. We evaluate our micro-viruses based characterization flow (and …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:_FM0Bhl9EiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proceedings of the 23rd IEEE International Symposium on Defect and Fault-Tolerance in VLSI Systems (DFT 2008)",
            "Publication year": 2008,
            "Publication url": "https://re.public.polimi.it/handle/11311/560488",
            "Abstract": "La presente simulazione è stata realizzata sulla base delle regole riportate nel DM 598/2018 e allegata Tabella A. Cineca non si assume alcuna responsabilità in merito all’uso che il diretto interessato o terzi faranno della simulazione. Si specifica inoltre che la simulazione contiene calcoli effettuati con dati e algoritmi di pubblico dominio e deve quindi essere considerata come un mero ausilio al calcolo svolgibile manualmente o con strumenti equivalenti. Informazioni sui dati: vengono considerati tutti i prodotti in stato definitivo. Per i prodotti indicizzati wos/scopus, l’anno di riferimento e la tipologia sono quelli riportati in banca-dati.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:_axFR9aDTf0C",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Optimal periodic testing of intermittent faults in embedded pipelined processor applications",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1656847/",
            "Abstract": "Today's nanometer technology trends have a very negative impact on the reliability of semiconductor products. Intermittent faults constitute the largest part of reliability failures that are manifested in the field during the semiconductor product operation. Since software-based self-test (SBST) has been proposed as an effective strategy for on-line testing of processors integrated in non-safety critical low-cost embedded system applications, optimal test period specification is becoming increasingly challenging. In this paper we first introduce a reliability analysis for optimal periodic testing of intermittent faults that minimizes the test cost incurred based on a two-state Markov model for the probabilistic modeling of intermittent faults. Then, we present for the first time an enhanced SBST strategy for on-line testing of complex pipelined embedded processors. Finally, we demonstrate the effectiveness of the proposed optimal …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DEPENDABLE AND SECURE COMPUTING",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5692143/",
            "Abstract": "[Front cover] Page 1 IEEE TRANSACTIONS ON DEPENDABLE AND SECURE \nCOMPUTING A publication of the IEEE Computer Society VOLUME 8 NUMBER 2 ITDSCM (ISSN \n1545-5971) www.computer.org tdsc@computer.org MARCH-APRIL 2011 PAPERS \nAdaptive Fault-Tolerant QoS Control Algorithms for Maximizing System Lifetime of Query-Based \nWireless Sensor Networks I.-R. Chen, AP Speer, and M. Eltoweissy ......................................................................................................................... \n161 Application-Level Diagnostic and Membership Protocols for Generic Time-Triggered \nSystems M. Serafini, P. Bokor, N. Suri, J. Vinter, A. Ademaj, W. Brandstätter, F. Tagliabò, and \nJ. Koch .......................................... 177 A Tamper-Resistant Programming Language System D. \nHeimbigner ..................................................................................................................................................................... \n194 Chip Self-Organization and Fault Tolerance in , P.…",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:OTTXONDVkokC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accumulator-based built-in self-test generator for robustly detectable sequential fault testing",
            "Publication year": 2004,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-cdt_20040850",
            "Abstract": "In this paper an algorithm for the generation of single input change (SIC) pairs is presented, termed the accumulator-based SIC pair generation (ASG) algorithm; SIC pairs have been effectively utilised for testing robustly detectable sequential faults. ASG is implemented in hardware utilising an accumulator whose inputs are driven by a barrel shifter. Since such structures (accumulators whose inputs are driven by barrel shifters) are commonly found in current, high-speed signal processing VLSI circuits, the presented schema provides a practical solution for the built-in testing of such circuits for testing delay and stuck-open faults. Utilisation of ASG to applying SIC pairs to adjacent pairs of inputs of the CUT, resulting in pseudoexhaustive schemes, is also addressed.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:ZeXyd9-uunAC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Accumulator-based weighted pattern generation",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1498164/",
            "Abstract": "Weighted pseudorandom BIST schemes have been efficiently utilized in order to drive down the number of vectors required to achieve complete fault coverage in built in self test (BIST) applications. Sets of patterns comprising weights 0, 0.5 and 1 have been successfully utilized within the weighted pattern generation paradigm. In this paper an accumulator-based scheme is presented, that generates set of patterns with weights 0, 0.5 and 1. Since accumulators and ALUs are commonly found in current VLSI chips, the presented scheme can be efficiently utilized to drive down the hardware of BIST pattern generation.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Early component-based system reliability analysis for approximate computing systems",
            "Publication year": 2016,
            "Publication url": "https://wapco.e-ce.uth.gr/2016/papers/SESSION1/wapco2016_1_3.pdf",
            "Abstract": "A key enabler of real applications on approximate computing systems is the availability of instruments to analyze system reliability, early in the design cycle. Accurately measuring the impact on system reliability of any change in the technology, circuits, microarchitecture and software is most of the time a multi-team multi-objective problem and reliability must be traded off against other crucial design attributes (or objectives) such as power, performance and cost. Unfortunately, tools and models for cross-layer reliability analysis are still at their early stages compared to other very mature design tools and this represents a major issue for mainstream applications. This paper presents preliminary information on a cross-layer framework built on top of a Bayesian model designed to perform component-based reliability analysis of complex systems.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accelerating microprocessor silicon validation by exposing ISA diversity",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2155620.2155666",
            "Abstract": "Microprocessor design validation is a time consuming and costly task that tends to be a bottleneck in the release of new architectures. The validation step that detects the vast majority of design bugs is the one that stresses the silicon prototypes by applying huge numbers of random tests. Despite its bug detection capability, this step is constrained by extreme computing needs for random tests simulation to extract the bug-free memory image for comparison with the actual silicon image.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application-Oriented Microelectronics Education",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-94-015-9506-3_45.pdf",
            "Abstract": "In this paper we present an application-oriented microelectronics education perspective to be applied in two closely collaborating university departments.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:dTyEYWd-f8wC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Instruction-based online periodic self-testing of microprocessors with floating-point units",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4674370/",
            "Abstract": "Online periodic testing of microprocessors is a valuable means to increase the reliability of a low-cost system, when neither hardware nor time redundant protection schemes can be applied. This is particularly valid for floating-point (FP) units, which are becoming more common in embedded systems and are usually protected from operational faults through costly hardware redundant approaches. In this paper, we present scalable instruction-based self-test program development for both single and double precision FP units considering different instruction sets (MIPS, PowerPC, and Alpha), different microprocessor architectures (32/64-bit architectures) and different memory configurations. Moreover, we introduce bit-level manipulation instruction sequences that are essential for the development of FP unit's self-test programs. We developed self-test programs for single and double precision FP units on 32-bit and 64 …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reliability challenges of real-time systems in forthcoming technology nodes",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6513486/",
            "Abstract": "Forthcoming technology nodes are posing major challenges on the manufacturing of reliable (real-time) systems: process variations, accelerated degradation aging, as well as external and internal noise are key examples. This paper focuses on real-time systems reliability and analyzes the state-of-the-art and the emerging reliability bottlenecks from three different perspectives: technology, circuit/IP and full system.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On-Line Testing Symposium",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5560244/",
            "Abstract": "The following topics are dealt with: degradation modeling and monitoring; transients analysis and evaluation; multicore/manycore on-line testing; fault tolerance in 3D ICs and FPGAs; memory test, repair, and fault tolerance; soft and timing error tolerance; analog and mixed-signal circuit testing; reliability.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:yFnVuubrUp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Microarchitecture level reliability comparison of modern gpu designs: First findings",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7975280/",
            "Abstract": "State-of-the-art GPU chips are designed to deliver extreme throughput for graphics as well as for data-parallel general purpose computing workloads (GPGPU computing). Unlike graphics computing, GPGPU computing requires highly reliable operation. The performance-oriented design of GPUs requires to jointly evaluate the vulnerability of GPU workloads to soft-errors with the performance of GPU chips. We briefly present a summary of the findings of an extensive study aiming at the evaluation of the reliability of four GPU architectures and corresponding chips, orrelating them with the performance of the workloads.",
            "Abstract entirety": 1,
            "Author pub id": "8V03GF4AAAAJ:foquWX3nUaYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low-cost SEU fault emulation platform for SRAM-based FPGAs",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1655554/",
            "Abstract": "In this paper, we introduce a fully automated low cost hardware/software platform for efficiently performing fault emulation experiments targeting SEUs in the configuration bits of FPGA devices, without the need for expensive radiation experiments. We propose a method for significantly reducing the fault list by removing the faults on unused LUT bit positions. We also target the design flip-flops found in the configurable logic blocks (CLBs) inside the FPGA. Run-time reconfigurability of Virtex devices using JBits is exploited to provide the means not only for fault injection but fault detection as well. First, we consider five possible application scenarios for evaluating different self-test schemes. Then, we apply the least favorite and most time consuming of these scenarios on two 32times32 multiplier designs, demonstrating that transferring the simulation processing workload to FPGA hardware can allow for acceleration of …",
            "Abstract entirety": 0,
            "Author pub id": "8V03GF4AAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        }
    ]
}]