[{
    "name": "Δημήτριος Φωτάκης",
    "romanize name": "Dimitrios Fotakis",
    "School-Department": "Ηλεκτρολόγων Μηχανικών & Μηχανικών Υπολογιστών",
    "University": "ntua",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 15257,
    "Scholar name": "Dimitris Fotakis",
    "Scholar id": "zFDLf0UAAAAJ",
    "Affiliation": "Associate Professor, Electrical & Computer Eng., NTU Athens",
    "Citedby": 2686,
    "Interests": [
        "Algorithms and Complexity",
        "Approximation Algorithms",
        "Online Algorithms",
        "Algorithmic Game Theory"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=zFDLf0UAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "The structure and complexity of Nash equilibria for a selfish routing game",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397508000261",
            "Abstract": "In this work, we study the combinatorial structure and the computational complexity of Nash equilibria for a certain game that models selfish routing over a network consisting of m parallel links. We assume a collection of n users, each employing a mixed strategy, which is a probability distribution over links, to control the routing of her own traffic. In a Nash equilibrium, each user selfishly routes her traffic on those links that minimize her expected latency cost, given the network congestion caused by the other users. The social cost of a Nash equilibrium is the expectation, over all random choices of the users, of the maximum, over all links, latency through a link. We embark on a systematic study of several algorithmic problems related to the computation of Nash equilibria for the selfish routing game we consider. In a nutshell, these problems relate to deciding the existence of a pure Nash equilibrium, constructing a …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Strategyproof facility location with concave costs",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2692359.2692370",
            "Abstract": "In k-Facility Location games, n strategic agents report their locations on the real line and a mechanism maps them to k facilities. Each agent seeks to minimize her connection cost to the nearest facility and the mechanism should be strategyproof and approximately efficient. Facility Location games have received considerable attention in the framework of approximate mechanism design without money. In this letter, we discuss some recent positive results on the approximability of k-Facility Location by randomized strategyproof mechanisms. Interestingly, these results hold even if the agents' connection cost is a concave cost function of the distance.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:uWQEDVKXjbEC",
            "Publisher": "ACM"
        },
        {
            "Title": "Online Facility Location in Evolving Metrics",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1011644",
            "Abstract": "The Dynamic Facility Location problem is a generalization of the classic Facility Location problem, in which the distance metric between clients and facilities changes over time. Such metrics that develop as a function of time are usually called\" evolving metrics\", thus Dynamic Facility Location can be alternatively interpreted as a Facility Location problem in evolving metrics. The objective in this time-dependent variant is to balance the trade-off between optimizing the classic objective function and the stability of the solution, which is modeled by charging a switching cost when a client’s assignment changes from one facility to another. In this paper, we study the online variant of Dynamic Facility Location. We present a randomized O (log m+ log n)-competitive algorithm, where m is the number of facilities and n is the number of clients. In the first step, our algorithm produces a fractional solution, in each timestep, to the objective of Dynamic Facility Location involving a regularization function. This step is an adaptation of the generic algorithm proposed by Buchbinder et al. in their work\" Competitive Analysis via Regularization.\" Then, our algorithm rounds the fractional solution of this timestep to an integral one with the use of exponential clocks. We complement our result by proving a lower bound of Ω (m) for deterministic algorithms and lower bound of Ω (log m) for randomized algorithms. To the best of our knowledge, these are the first results for the online variant of the Dynamic Facility Location problem.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:SdhP9T11ey4C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Efficient Money Burning in General Domains",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-016-9720-2",
            "Abstract": "We study mechanism design where the objective is to maximize the residual surplus, i.e., the total value of the outcome minus the payments charged to the agents, by truthful mechanisms. The motivation comes from applications where the payments charged are not in the form of actual monetary transfers, but take the form of wasted resources. We consider a general mechanism design setting with m discrete outcomes and n multidimensional agents. We present two randomized truthful mechanisms that extract an O(logm) fraction of the maximum social surplus as residual surplus. The first mechanism achieves an O(logm)-approximation to the social surplus, which is improved to an O(1)-approximation by the second mechanism. An interesting feature of the second mechanism is that it optimizes over an appropriately restricted space of probability distributions, thus achieving an efficient tradeoff between …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Incremental algorithms for facility location and k-median",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30140-0_32",
            "Abstract": "In the incremental versions of Facility Location and k-Median, the demand points arrive one at a time and the algorithm must maintain a good solution by either adding each new demand to an existing cluster or placing it in a new singleton cluster. The algorithm can also merge some of the existing clusters at any point in time. We present the first incremental algorithm for Facility Location with uniform facility costs which achieves a constant performance ratio and the first incremental algorithm for k-Median which achieves a constant performance ratio using  medians.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Strategyproof facility location for concave cost functions",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-015-0026-6",
            "Abstract": "We consider k-Facility Location games, where n strategic agents report their locations on the real line and a mechanism maps them to k facilities. Each agent seeks to minimize his connection cost, given by a nonnegative increasing function of his distance to the nearest facility. Departing from previous work, that mostly considers the identity cost function, we are interested in mechanisms without payments that are (group) strategyproof for any given cost function, and achieve a good approximation ratio for the social cost and/or the maximum cost of the agents. We present a randomized mechanism, called Equal Cost, which is group strategyproof and achieves a bounded approximation ratio for all k and n, for any given concave cost function. The approximation ratio is at most 2 for Max Cost and at most n for Social Cost. To the best of our knowledge, this is the first mechanism with a bounded approximation ratio for …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:rO6llkc54NcC",
            "Publisher": "ACM"
        },
        {
            "Title": "Minimum and Maximum Category Constraints in the Orienteering Problem with Time Windows",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-34029-2_23",
            "Abstract": "We introduce a new variation of the Orienteering Problem (OP), the Minimum-Maximum Category Constraints Orienteering Problem with Time Windows. In the Orienteering Problem we seek to determine a path from node  to node  in a weighted graph where each node has a score. The total weight of the path must not exceed a predetermined budget and the goal is to maximize the total score. In this variation, each Activity is associated with a category and the final solution is required to contain at least a minimum and at most a maximum of specific categories. This variation better captures the problem of tourists visiting cities. For example, the tourists can decide to visit exactly one restaurant at a specific time window and at least one park. We present a Replace Local Search and an Iterated Local Search which utilizes Stochastic Gradient Descent to identify the tightness of the constraints. We perform exhaustive …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Radiocoloring in planar graphs: Complexity and approximations",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397505001349",
            "Abstract": "The Frequency Assignment Problem (FAP) in radio networks is the problem of assigning frequencies to transmitters, by exploiting frequency reuse while keeping signal interference to acceptable levels. The FAP is usually modelled by variations of the graph coloring problem. A Radiocoloring (RC) of a graph G (V, E) is an assignment function Φ: V→ N such that| Φ (u)-Φ (v)|⩾ 2, when u, v are neighbors in G, and| Φ (u)-Φ (v)|⩾ 1 when the distance of u, v in G is two. The number of discrete frequencies and the range of frequencies used are called order and span, respectively. The optimization versions of the Radiocoloring Problem (RCP) are to minimize the span or the order. In this paper we prove that the radiocoloring problem for general graphs is hard to approximate (unless NP= ZPP) within a factor of n 1/2-ε (for any ε> 0), where n is the number of vertices of the graph. However, when restricted to some …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Graph Labelling and Assignment of Non-Reusable Frequencies?",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.33.1351&rep=rep1&type=pdf",
            "Abstract": "In this work, we study Graph Radio Labelling, that is to assign unique integer labels to all the vertices of a graph, such that adjacent vertices get labels at distance at least 2. The objective is to minimize the label span. Radio labelling models the assignment of frequencies, in case that the transmitters are not allowed to operate at the same channel.At rst, we show that radio labelling is related to TSP (1, 2), and it is NP-complete and MAX {SNP-hard. Then, we present a polynomial time algorithm for computing an optimal radio labelling, given a coloring of the graph with constant number of colors. Thus, we prove that radio labelling in planar graphs is in P. Also, we describe an NC algorithm that, given an arbitrary graph G (V; E), computes a radio labelling of value at most jV j plus the cardinality of the Maximum Clique (Chromatic Number) of G. Hence, it achieves an approximation ratio of",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evolutionary multimodel partitioning filters: A unified framework",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=16529604807528966293&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Truthful Scheduling and Resource Allocation through Monitoring",
            "Publication year": 2020,
            "Publication url": "https://livrepository.liverpool.ac.uk/3115492/1/AAAI-2021(final)_Elements.pdf",
            "Abstract": "We study the power and limitations of the Vickrey-Clarke-Groves mechanism with monitoring (VCGmon) for cost minimization problems with objective functions that are more general than the social cost. We identify a simple and natural sufficient condition for VCGmon to be truthful for general objectives. As a consequence, we obtain that for any cost minimization problem with non-decreasing objective µ, VCGmon is truthful, if the allocation is Maximal-in-Range and µ is 1-Lipschitz (eg, µ can be the Lp-norm of the agents’ costs, for any p≥ 1 or p=∞). We apply VCGmon to scheduling on restricted-related machines and obtain a polynomial-time truthful-in-expectation 2-approximate (resp. O (1)-approximate) mechanism for makespan (resp. Lpnorm) minimization. Moreover, applying VCGmon, we obtain polynomial-time truthful O (1)-approximate mechanisms for some fundamental bottleneck network optimization problems with single-parameter agents. On the negative side, we provide strong evidence that VCGmon could not lead to computationally efficient truthful mechanisms with reasonable approximation ratios for binary covering social cost minimization problems. However, we show that VCGmon results in computationally efficient approximately truthful mechanisms for binary covering problems.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal Learning of Mallows Block Model",
            "Publication year": 2019,
            "Publication url": "http://proceedings.mlr.press/v99/busa-fekete19a.html",
            "Abstract": "The Mallows model, introduced in the seminal paper of Mallows 1957, is one of the most fundamental ranking distribution over the symmetric group . To analyze more complex ranking data, several studies considered the Generalized Mallows model defined by Fligner and Verducci 1986. Despite the significant research interest of ranking distributions, the exact sample complexity of estimating the parameters of a Mallows and a Generalized Mallows Model is not well-understood. The main result of the paper is a tight sample complexity bound for learning Mallows and Generalized Mallows Model. We approach the learning problem by analyzing a more general model which interpolates between the single parameter Mallows Model and the  parameter Mallows model. We call our model Mallows Block Model–referring to the Block Models that are a popular model in theoretical statistics. Our sample complexity analysis gives tight bound for learning the Mallows Block Model for any number of blocks. We provide essentially matching lower bounds for our sample complexity results. As a corollary of our analysis, it turns out that, if the central ranking is known, one single sample from the Mallows Block Model is sufficient to estimate the spread parameters with error that goes to zero as the size of the permutations goes to infinity. In addition, we calculate the exact rate of the parameter estimation error.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the competitive ratio for online facility location",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45061-0_51",
            "Abstract": "We consider the problem of Online Facility Location, where demands arrive online and must be irrevocably assigned to an open facility upon arrival. The objective is to minimize the sum of facility and assignment costs. We prove that the competitive ratio for Online Facility Location is Θ(log n/log log n). On the negative side, we show that no randomized algorithm can achieve a competitive ratio better than Ω(log n/log log n) against an oblivious adversary even if the demands lie on a line segment. On the positive side, we present a deterministic algorithm achieving a competitive ratio of O(log n/log log n). The analysis is based on a hierarchical decomposition of the optimal facility locations such that each component either is relatively well-separated or has a relatively large diameter, and a potential function argument which distinguishes between the two kinds of components.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Who to Trust for Truthful Facility Location?",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-51753-7_6",
            "Abstract": "We consider approximate mechanisms without money and with selective verification for k-Facility Location problems. We show how a deterministic greedy mechanism and a randomized proportional mechanism become truthful with selective verification.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Birkhäuser, Cham"
        },
        {
            "Title": "Sub-exponential Approximation Schemes for CSPs: from Dense to Almost Sparse",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1507.04391",
            "Abstract": "It has long been known, since the classical work of (Arora, Karger, Karpinski, JCSS~99), that \\MC\\ admits a PTAS on dense graphs, and more generally, \\kCSP\\ admits a PTAS on \"dense\" instances with  constraints. In this paper we extend and generalize their exhaustive sampling approach, presenting a framework for $(1-\\eps)$-approximating any \\kCSP\\ problem in \\emph{sub-exponential} time while significantly relaxing the denseness requirement on the input instance. Specifically, we prove that for any constants  and $\\eps > 0$, we can approximate \\kCSP\\ problems with  constraints within a factor of $(1-\\eps)$ in time $2^{O(n^{1-\\delta}\\ln n /\\eps^3)}$. The framework is quite general and includes classical optimization problems, such as \\MC, {\\sc Max}-DICUT, \\kSAT, and (with a slight extension) -{\\sc Densest Subgraph}, as special cases. For \\MC\\ in particular (where ), it gives an approximation scheme that runs in time sub-exponential in  even for \"almost-sparse\" instances (graphs with  edges). We prove that our results are essentially best possible, assuming the ETH. First, the density requirement cannot be relaxed further: there exists a constant  such that for all , \\kSAT\\ instances with  clauses cannot be approximated within a ratio better than  in time . Second, the running time of our algorithm is almost tight \\emph{for all densities}. Even for \\MC\\ there exists  such that for all , \\MC\\ instances with  edges cannot be approximated within a ratio better than  in time .",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assignment of Reusable and Non-Reusable Frequencies",
            "Publication year": 2002,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812778215_0006",
            "Abstract": "Graph radio coloring and graph radio labelling are combinatorial models for two interesting cases of Frequency Assignment. In both problems positive integer labels (channels) must be assigned to all the vertices of a graph such that adjacent vertices get labels at distance at least two. In radio labelling all the labels must be distinct, while in radio coloring only the vertices being at distance no more than two in the input graph must be assigned distinct labels. For both problems the objective is to minimize the maximum label used.We first prove that both radio coloring and radio labelling remain -complete for graphs of diameter two, and we show that a 2α-approximation algorithm for radio coloring can be obtained from any α-approximation algorithm for coloring squares of graphs. We also show that radio labelling is equivalent to Hamiltonian Path with distances one and two (HP(1,2)), and we present a polynomial-time …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:Zph67rFs4hoC",
            "Publisher": "WORLD SCIENTIFIC PUBLISHING"
        },
        {
            "Title": "Congestion games with linearly independent paths: Convergence time and price of anarchy",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-79309-0_5",
            "Abstract": "We investigate the effect of linear independence in the strategies of congestion games on the convergence time of best response dynamics and on the pure Price of Anarchy. In particular, we consider symmetric congestion games on extension-parallel networks, an interesting class of networks with linearly independent paths, and establish two remarkable properties previously known only for parallel-link games. More precisely, we show that for arbitrary non-negative and non-decreasing latency functions, any best improvement sequence converges to a pure Nash equilibrium in at most n steps, and that for latency functions in class , the pure Price of Anarchy is at most .",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Covering Clients with Types and Budgets",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=2248839367715956628&hl=en&oi=scholarr",
            "Abstract": "In this paper, we consider a variant of the facility location problem. Imagine the scenario where facilities are categorized into multiple types such as schools, hospitals, post offices, etc. and the cost of connecting a client to a facility is realized by the distance between them. Each client has a total budget on the distance she/he is willing to travel. The goal is to open the minimum number of facilities such that the aggregate distance of each client to multiple types is within her/his budget. This problem closely resembles to the set cover and r-domination problems. Here, we study this problem in different settings. Specifically, we present some positive and negative results in the general setting, where no assumption is made on the distance values. Then we show that better results can be achieved when clients and facilities lie in a metric space.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik"
        },
        {
            "Title": "Stackelberg strategies for atomic congestion games",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-008-9152-8",
            "Abstract": "We investigate the effectiveness of Stackelberg strategies for atomic congestion games with unsplittable demands. In our setting, only a fraction of the players are selfish, while the rest are willing to follow a predetermined strategy. A Stackelberg strategy assigns the coordinated players to appropriately selected strategies trying to minimize the performance degradation due to the selfish players. We consider two orthogonal cases, namely congestion games with affine latency functions and arbitrary strategies, and congestion games on parallel links with arbitrary non-decreasing latency functions. We restrict our attention to pure Nash equilibria and derive strong upper and lower bounds on the pure Price of Anarchy (PoA) under different Stackelberg strategies.For affine congestion games, we consider the Stackelberg strategies LLF and Scale introduced by Roughgarden (SIAM J. Comput. 33(2):332–350, 2004 …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer New York"
        },
        {
            "Title": "On the Approximability of Multistage Min-Sum Set Cover",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2107.13344",
            "Abstract": "We investigate the polynomial-time approximability of the multistage version of Min-Sum Set Cover (), a natural and intriguing generalization of the classical List Update problem. In , we maintain a sequence of permutations  on  elements, based on a sequence of requests . We aim to minimize the total cost of updating  to , quantified by the Kendall tau distance , plus the total cost of covering each request  with the current permutation , quantified by the position of the first element of  in . Using a reduction from Set Cover, we show that  does not admit an -approximation, unless , and that any  (resp. ) approximation to  implies a sublogarithmic (resp. ) approximation to Set Cover (resp. where each element appears at most  times). Our main technical contribution is to show that  can be approximated in polynomial-time within a factor of  in general instances, by randomized rounding, and within a factor of , if all requests have cardinality at most , by deterministic rounding.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Aggregating Incomplete and Noisy Rankings",
            "Publication year": 2020,
            "Publication url": "http://proceedings.mlr.press/v130/fotakis21a.html",
            "Abstract": "We consider the problem of learning the true ordering of a set of alternatives from largely incomplete and noisy rankings. We introduce a natural generalization of both the Mallows model, a popular model of ranking distributions, and the extensively studied model of ranking from pairwise comparisons. Our selective Mallows model outputs a noisy ranking on any given subset of alternatives, based on an underlying Mallows distribution. Assuming a sequence of subsets where each pair of alternatives appears frequently enough, we obtain strong asymptotically tight upper and lower bounds on the sample complexity of learning the underlying complete central ranking and the (identities and the) ranking of the top k alternatives from selective Mallows rankings. Moreover, building on the work of (Braverman and Mossel, 2009), we show how to efficiently compute the maximum likelihood complete ranking from selective Mallows rankings.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient methods for selfish network design",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397512003982",
            "Abstract": "Intuitively, Braess’s paradox states that destroying a part of a network may improve the common latency of selfish flows at Nash equilibrium. Such a paradox is a pervasive phenomenon in real-world networks. Any administrator who wants to improve equilibrium delays in selfish networks, is facing some basic questions:–Is the network paradox-ridden?–How can we delete some edges to optimize equilibrium flow delays?–How can we modify edge latencies to optimize equilibrium flow delays? Unfortunately, such questions lead to NP-hard problems in general. In this work, we impose some natural restrictions on our networks, eg we assume strictly increasing linear latencies. Our target is to formulate efficient algorithms for the three questions above. We manage to provide:–A polynomial-time algorithm that decides if a network is paradox-ridden, when latencies are linear and strictly increasing.–A reduction of the …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Efficient Algorithms for Learning from Coarse Labels",
            "Publication year": 2021,
            "Publication url": "https://proceedings.mlr.press/v134/fotakis21a.html",
            "Abstract": "For many learning problems one may not have access to fine grained label information; eg, an image can be labeled as husky, dog, or even animal depending on the expertise of the annotator. In this work, we formalize these settings and study the problem of learning from such coarse data. Instead of observing the actual labels from a set , we observe coarse labels corresponding to a partition of (or a mixture of partitions). Our main algorithmic result is that essentially any problem learnable from fine grained labels can also be learned efficiently when the coarse data are sufficiently informative. We obtain our result through a generic reduction for answering Statistical Queries (SQ) over fine grained labels given only coarse labels. The number of coarse labels required depends polynomially on the information distortion due to coarsening and the number of fine labels . We also investigate the case of (infinitely many) real valued labels focusing on a central problem in censored and truncated statistics: Gaussian mean estimation from coarse data. We provide an efficient algorithm when the sets in the partition are convex and establish that the problem is NP-hard even for very simple non-convex sets.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:PR6Y55bgFSsC",
            "Publisher": "PMLR"
        },
        {
            "Title": "Resolving Braess’s Paradox in Random Networks",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Online and incremental algorithms for facility location",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1959045.1959065",
            "Abstract": "In the online and incremental variants of Facility Location, the demands arrive one-by-one and must be assigned to an open facility upon arrival, without any knowledge about future demands. In the online variant, the decisions of opening a facility at a particular location and of assigning a demand to some facility are irrevocable. In the incremental variant, the algorithm can also merge existing facilities (and the corresponding demand clusters) with each other, and only the decision of assigning some demands to the same facility is irrevocable. The goal is to maintain, either online or incrementally, a set of facilities and an assignment of the demands to them that minimize the total facility opening cost plus the assignment cost for all demands.In this survey, we discuss the previous work on online and incremental algorithms for Facility Location. In addition to the main results, namely that the competitive ratio for the …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:hFOr9nPyWt4C",
            "Publisher": "ACM"
        },
        {
            "Title": "Atomic congestion games among coalitions",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11786986_50",
            "Abstract": "We consider algorithmic questions concerning the existence, tractability and quality of atomic congestion games, among users that are considered to participate in (static) selfish coalitions. We carefully define a coalitional congestion model among atomic players.Our findings in this model are quite interesting, in the sense that we demonstrate many similarities with the non–cooperative case. For example, there exist potentials proving the existence of Pure Nash Equilibria (PNE) in the (even unrelated) parallel links setting; the Finite Improvement Property collapses as soon as we depart from linear delays, but there is an exact potential (and thus PNE) for the case of linear delays, in the network setting; the Price of Anarchy on identical parallel links demonstrates a quite surprising threshold behavior: it persists on being asymptotically equal to that in the case of the non–cooperative KP–model, unless …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Efficient Online Scheduling of Electric Vehicle Charging Using a Service-Price Menu",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9543430/",
            "Abstract": "Along with high penetration of Electric Vehicles (EVs), charging stations are required to service a large amount of charging requests while accounting for constraints on the station's peak electricity consumption. To this end, a charging station needs to make online charging scheduling decisions often under limited future information. An important challenge relates to the prioritization of EVs that have unknown valuations for different levels of charging services. In this paper, we take into consideration the inability of EV users to express these valuations explicitly. We consider a paradigm where a menu of possible charging schedules and corresponding prices is generated online. By letting the EV users pick their most preferable menu option, the proposed algorithm commits on each EV's charging completion time upon its arrival, achieves a near optimal total weighted charging completion time, and prevents the users …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:eq2jaN3J8jMC",
            "Publisher": "TechRxiv"
        },
        {
            "Title": "Online sum-radii clustering",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397513002119",
            "Abstract": "In Online Sum-Radii Clustering, n demand points arrive online and must be irrevocably assigned to a cluster upon arrival. The cost of each cluster is the sum of a fixed opening cost and its radius, and the objective is to minimize the total cost of the clusters opened by the algorithm. We show that the deterministic competitive ratio of Online Sum-Radii Clustering for general metric spaces is Θ (log n), where the upper bound follows from a primal–dual algorithm and holds for general metric spaces, and the lower bound is valid for ternary Hierarchically Well-Separated Trees (HSTs) and for the Euclidean plane. Combined with the results of (Csirik et al., MFCS 2010), this result demonstrates that the deterministic competitive ratio of Online Sum-Radii Clustering changes abruptly, from constant to logarithmic, when we move from the line to the plane. We also show that Online Sum-Radii Clustering in metric spaces …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:NhqRSupF_l8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Radiocolorings in Periodic Planar Graphs: PSPACE-Completeness and Efficient Approximations for the Optimal Number of Frequencies",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=5185632617519338236&hl=en&oi=scholarr",
            "Abstract": "The Frequency Assignment Problem (FAP) in radio networks is the problem of assigning frequencies to transmitters exploiting frequency reuse while keeping signal interference to acceptable levels. The FAP is usually modelled by variations of the graph coloring problem. The Radiocoloring (RC) of a graph G (V, E) is an assignment function Λ: V→ IN such that| Λ (u)− Λ (v)|≥ 2, when u, v are neighbors in G, and| Λ (u)− Λ (v)|≥ 1 when the distance of u, v in G is two. The discrete number of frequencies used is called order and the range of frequencies used, span. The optimization versions of the Radiocoloring Problem (RCP) are to minimize the span (min span RCP) or the order (min order RCP). Here, we consider the optimization version of RCP where one tries to minimize the order of the assignment.In this paper, we deal with an interesting variation of the radiocoloring problem: that of satisfying frequency …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Glimpse at Paul G. Spirakis",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24024-4_1",
            "Abstract": "Paul Spirakis is an eminent, talented, and influential researcher that contributed significantly to computer science. This article is a modest attempt of a biographical sketch of Paul, which we drafted with extreme love and honor.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:P5F9QuxV20EC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Reallocating Multiple Facilities on the Line",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397521000517",
            "Abstract": "We study the K-Facility Reallocation problem on the real line, where we maintain K facility locations over T stages, based on the stage-dependent locations of n agents. Each agent is connected to the nearest facility at each stage, and the facilities may move from one stage to another, to accommodate different agent locations. The objective is to minimize the connection cost of the agents plus the total moving cost of the facilities, over all stages. The K-Facility Reallocation problem was introduced by de Keijzer and Wojtczak, where they mostly focused on the special case of a single facility. Using an LP-based approach, we present a polynomial time algorithm that computes the optimal solution for any number of facilities. We also consider the online K-Facility Reallocation problem, where the algorithm becomes aware of agent locations in a stage-by-stage fashion. By exploiting an interesting connection to the …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stochastic Congestion Games with Risk-Averse Players",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41392-6_8",
            "Abstract": "Congestion games ignore the stochastic nature of resource delays and the risk-averse attitude of the players to uncertainty. To take these aspects into account, we introduce two variants of atomic congestion games, one with stochastic players, where each player assigns load to her strategy independently with a given probability, and another with stochastic edges, where the latency functions are random. In both variants, the players are risk-averse, and their individual cost is a player-specific quantile of their delay distribution. We focus on parallel-link networks and investigate how the main properties of such games depend on the risk attitude and on the participation probabilities of the players. In a nutshell, we prove that stochastic congestion games on parallel-links admit an efficiently computable pure Nash equilibrium if the players have either the same risk attitude or the same participation probabilities …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Preface to Special Issue on Algorithms and Complexity",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=1407270334816062870&hl=en&oi=scholarr",
            "Abstract": "This special issue of Theoretical Computer Science contains selected and expanded papers of the 10th edition of the International Conference on Algorithms and Complexity (CIAC), held at the National Technical University of Athens, Greece, on May 24–26, 2017. The purpose of CIAC is to provide a forum for researchers working in the theory and applications of algorithms and computational complexity.The symposium received 90 submissions and the Program Committee selected 36 papers, among which we decided to pick 8 excellent papers composing this special issue. These journal papers have been rigorously reviewed, according to the usual high standards of Theoretical Computer Science.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:LPZeul_q3PIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An Evolutionary Computation Technique for User Profile Optimization",
            "Publication year": 2001,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/26632",
            "Abstract": "An Evolutionary Computation Technique for User Profile Optimization Αρχική Σελίδα → \nΚεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε περιοδικά \n→ Εμφάνιση Τεκμηρίου HEAL DSpace An Evolutionary Computation Technique for User Profile \nOptimization Αποθετήριο DSpace/Manakin An Evolutionary Computation Technique for User \nProfile Optimization Likothanassis, S; Beligiannis, G; Fotakis, D; Fragoudis, D; Giotopoulos, K \nURI: http://hdl.handle.net/123456789/26632 Ημερομηνία: 2003 Εμφάνιση πλήρους εγγραφής \nΑρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή Δεν υπάρχουν αρχεία που \nσχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην ακόλουθη συλλογή(ές) \nΔημοσιεύσεις μελών ΔΕΠσε περιοδικά Περιήγηση Σε όλο το DSpace Κοινότητες & Συλλογές \nΑνά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Αυτή η Συλλογή Ανά Ημερομηνία Τίτλοι / …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multilingual implementations of OSI applications",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.28.6122&rep=rep1&type=pdf",
            "Abstract": "In this work the problem of supporting multilingual environments over OSI applications is addressed. Initially a solution based on the idea of using multilingual structures and transcription techniques is presented. Another solution based on the major principles of the former follows, which exploits the coding of all of character sets uniformally.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning Augmented Online Facility Location",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2107.08277",
            "Abstract": "Following the research agenda initiated by Munoz & Vassilvitskii [1] and Lykouris & Vassilvitskii [2] on learning-augmented online algorithms for classical online optimization problems, in this work, we consider the Online Facility Location problem under this framework. In Online Facility Location (OFL), demands arrive one-by-one in a metric space and must be (irrevocably) assigned to an open facility upon arrival, without any knowledge about future demands. We present an online algorithm for OFL that exploits potentially imperfect predictions on the locations of the optimal facilities. We prove that the competitive ratio decreases smoothly from sublogarithmic in the number of demands to constant, as the error, i.e., the total distance of the predicted locations to the optimal facility locations, decreases towards zero. We complement our analysis with a matching lower bound establishing that the dependence of the algorithm's competitive ratio on the error is optimal, up to constant factors. Finally, we evaluate our algorithm on real world data and compare our learning augmented approach with the current best online algorithm for the problem.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A primal-dual algorithm for online non-uniform facility location",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_5",
            "Abstract": "In the online version of Facility Location, the demand points arrive one at a time and must be irrevocably assigned to an open facility upon arrival. The objective is to minimize the sum of facility and assignment costs. We present a simple primal-dual deterministic algorithm for the general case of non-uniform facility costs. We prove that its competitive ratio is no greater than 4log(n+1) + 2, which is close to the lower bound of $\\Omega(\\frac{log n}{log log n})$.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Externalities among advertisers in sponsored search",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-24829-0_11",
            "Abstract": "We introduce a novel computational model for single-keyword auctions in sponsored search, which models explicitly externalities among advertisers, an aspect that has not been fully reflected in the existing models, and is known to affect the behavior of real advertisers. Our model takes into account both positive and negative correlations between any pair of advertisers, so that the click-through rate of an ad depends on the identity, relative order and distance of other ads appearing in the advertisements list. In the proposed model we present several computational results concerning the Winner Determination problem for Social Welfare maximization. These include hardness of approximation and polynomial time exact and approximation algorithms. We conclude with an evaluation of the Generalized Second Price mechanism in presence of externalities.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "On the impacts of allowance banking and the financial sector on the EU Emissions Trading System",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s41207-020-00167-x",
            "Abstract": "The European Union Emissions Trading System (EU ETS) is the largest cap-and-trade system in the world. Price instability and allowance oversupply are two characteristics that affect the objectives and the efficiency of this policy. In this work, we investigate the impact of storing allowances (“banking”) on the allowance price and the power of the financial sector in the trading network of the ETS. To that end, we use data from the EU Transaction Log (EUTL) along with data on the most important allowance price determinants. We apply a multiple regression analysis that considers many important price determinants that are both endogenous and exogenous to the ETS, and quantify how the allowance price depends on the total volume of stored allowances. Our analysis indicates that banking is a notable—though not the dominant—price determinant, and quantifies its significance. Moreover, we study the role of …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:HE397vMXCloC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Efficient Lineage for SUM Aggregate Queries",
            "Publication year": 2013,
            "Publication url": "https://content.iospress.com/articles/ai-communications/aic647",
            "Abstract": "AI systems typically make decisions and find patterns in data based on the computation of aggregate and specifically sum functions, expressed as queries, on data’s attributes. This computation can become costly or even inefficient when these queries concern the whole or big parts of the data and especially when we are dealing with big data. New types of intelligent analytics require also the explanation of why something happened.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimating the Number of Induced Subgraphs from Incomplete Data and Neighborhood Queries",
            "Publication year": 2021,
            "Publication url": "https://www.aaai.org/AAAI21Papers/AAAI-10103.FotakisD.pdf",
            "Abstract": "We consider a natural setting where network parameters are estimated from noisy and incomplete information about the network. More specifically, we investigate how we can efficiently estimate the number of small subgraphs (eg, edges, triangles, etc.) based on full access to one or two noisy and incomplete samples of a large underlying network and on few queries revealing the neighborhood of carefully selected vertices. After specifying a random generator which removes edges from the underlying graph, we present estimators with strong provable performance guarantees, which exploit information from the noisy network samples and query a constant number of the most important vertices for the estimation. Our experimental evaluation shows that, in practice, a single noisy network sample and a couple of hundreds neighborhood queries suffice for accurately estimating the number of triangles in networks with millions of vertices and edges.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Malleable scheduling beyond identical machines",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1903.11016",
            "Abstract": "In malleable job scheduling, jobs can be executed simultaneously on multiple machines with the processing time depending on the number of allocated machines. In this setting, jobs are required to be executed non-preemptively and in unison, in the sense that they occupy, during their execution, the same time interval over all the machines of the allocated set. In this work, we study generalizations of malleable job scheduling inspired by standard scheduling on unrelated machines. Specifically, we introduce a general model of malleable job scheduling, where each machine has a (possibly different) speed for each job, and the processing time of a job  on a set of allocated machines  depends on the total speed of  with respect to . For machines with unrelated speeds, we show that the optimal makespan cannot be approximated within a factor less than , unless . On the positive side, we present polynomial-time algorithms with approximation ratios  for machines with unrelated speeds,  for machines with uniform speeds, and  for restricted assignments on identical machines. Our algorithms are based on deterministic LP rounding. They result in sparse schedules, in the sense that each machine shares at most one job with other machines. We also prove lower bounds on the integrality gap of  for unrelated speeds ( is the golden ratio) and  for uniform speeds and restricted assignments. To indicate the generality of our approach, we show that it also yields constant factor approximation algorithms for a variant where we determine the effective speed of a set of allocated machines based on the  norm of their speeds.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Opinion Formation Games with Aggregation and Negative Influence",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-018-9891-0",
            "Abstract": "In this paper, we study continuous opinion formation games with aggregation aspects. In many domains, expressed opinions of people are not only affected by local interaction and personal beliefs, but also by influences that stem from global properties of the opinions present in the society. To capture the interplay of such global and local effects, we propose a model of opinion formation games with aggregation, where we concentrate on the average public opinion as a natural way to represent a global trend in the society. While the average alone does not have good strategic properties as an aggregation rule, we show that with a limited influence of the average public opinion, the good properties of opinion formation models are preserved. More formally, we show that a unique equilibrium exists in average-oriented opinion formation games. Simultaneous best-response dynamics converge to within …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Scheduling MapReduce Jobs on Unrelated Processors.",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.429.2278&rep=rep1&type=pdf",
            "Abstract": "MapReduce framework is established as the standard approach for parallel processing of massive amounts of data. In this work, we extend the model of MapReduce scheduling on unrelated processors (Moseley et al., SPAA 2011) and deal with the practically important case of jobs with any number of Map and Reduce tasks. We present a polynomial-time (32+✏)-approximation algorithm for minimizing the total weighted completion time in this setting. To the best of our knowledge, this is the most general setting of MapReduce scheduling for which an approximation guarantee is known. Moreover, this is the first time that a constant approximation ratio is obtained for minimizing the total weighted completion time on unrelated processors under a nontrivial class of precedence constraints.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Size and the Approximability of Minimum Temporally Connected Subgraphs",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1602.06411",
            "Abstract": "We consider temporal graphs with discrete time labels and investigate the size and the approximability of minimum temporally connected spanning subgraphs. We present a family of minimally connected temporal graphs with  vertices and  edges, thus resolving an open question of (Kempe, Kleinberg, Kumar, JCSS 64, 2002) about the existence of sparse temporal connectivity certificates. Next, we consider the problem of computing a minimum weight subset of temporal edges that preserve connectivity of a given temporal graph either from a given vertex r (r-MTC problem) or among all vertex pairs (MTC problem). We show that the approximability of r-MTC is closely related to the approximability of Directed Steiner Tree and that r-MTC can be solved in polynomial time if the underlying graph has bounded treewidth. We also show that the best approximation ratio for MTC is at least  and at most , for any constant , where  is the number of temporal edges and  is the maximum degree of the underlying graph. Furthermore, we prove that the unweighted version of MTC is APX-hard and that MTC is efficiently solvable in trees and -approximable in cycles.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Memoryless facility location in one pass",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11672142_50",
            "Abstract": "We present the first one-pass memoryless algorithm for metric Facility Location which maintains a set of facilities approximating the optimal facility configuration within a constant factor. The algorithm considers the demand points one-by-one in arbitrary order, is randomized and very simple to state and implement. It runs in linear time and keeps in memory only the facility locations currently open. We prove that its competitive ratio is less than 14 in the special case of uniform facility costs and less than 49 in the general case of non-uniform facility costs.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "The structure and complexity of Nash equilibria for a selfish routing game",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45465-9_12",
            "Abstract": "In this work, we study the combinatorial structure and the computational complexity of Nash equilibria for a certain game that models selfish routing over a network consisting of m parallel links. We assume a collection of n users, each employing a mixed strategy, which is a probability distribution over links, to control the routing of its own assigned traffic. In a Nash equilibrium, each user selfishly routes its traffic on those links that minimize its expected latency cost, given the network congestion caused by the other users. The social cost of a Nash equilibrium is the expectation, over all random choices of the users, of the maximum, over all links, latency through a link.We embark on a systematic study of several algorithmic problems related to the computation of Nash equilibria for the selfish routing game we consider. In a nutshell, these problems relate to deciding the existence of a Nash equilibrium …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Malleable Scheduling on Non-identical Machines",
            "Publication year": 2019,
            "Publication url": "https://lirias.kuleuven.be/3366164?limo=0",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Evolutionary Annealing Approach to Graph",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=3658266279828120125&hl=en&oi=scholarr",
            "Abstract": "This paper presents a new heuristic algorithm for the graph coloring problem based on a combination of genetic algorithms and simulated annealing. Our algorithm exploits a novel crossover operator for graph coloring. Moreover, we investigate various ways in which simulated annealing can be used to enhance the performance of an evolutionary al-gorithm. Experiments performed on various collections of instances have justified the potential of this approach. We also discuss some possible enhancements and directions for further research.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:UHK10RUVsp4C",
            "Publisher": "Springer"
        },
        {
            "Title": "A Selective Tour Through Congestion Games",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24024-4_14",
            "Abstract": "We give a sketchy and mostly informal overview of research on algorithmic properties of congestion games in the last ten years. We discuss existence of potential functions and pure Nash equilibria in games with weighted players, simple and fast algorithms that reach a pure Nash equilibrium, and efficient approaches to improving the Price of Anarchy.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Asymptotically Optimal Communication in Simple Mechanisms",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-57980-7_2",
            "Abstract": "In this work, we show how well-known mechanisms for extensively studied single-parameter environments can be implemented with asymptotically optimal communication complexity. Specifically, we first turn our attention to single-parameter domains in auctions, namely single item and multi-unit auctions. For the former case, we show that the Vickrey auction can be implemented with an expected communication complexity of at  bits per bidder, for any , assuming that the valuations can be represented with a constant number of bits. As a corollary, we provide a compelling method to increment the price in English auctions. By employing an efficient encoding scheme, we show that the same bound can be obtained for multi-item auctions with additive bidders and a constant number of items, and for multi-unit auctions with unit demand bidders. Moreover, we apply our framework to games without monetary transfers …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:olpn-zPbct0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "HIPPOCRATES: A Tool for Distance Education",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Fotakis/publication/2360557_HIPPOCRATES_A_Tool_for_Distance_Education/links/55acfc0308aea3d086862e1e/HIPPOCRATES-A-Tool-for-Distance-Education.pdf",
            "Abstract": "In this paper we present a software tool for the realisation of the distance education service, that is the conduction of classes through the use of computers. The classes are directed towards personnel in various areas and aim at the retraining and update of the personnel in subjects of special interest in their line of work. The conduction of classes takes place, from and towards, remote regions with the aid of a computer network. Hippocrates is a flexible and easy-to-use application, which permits students, who sit in front of remotely situated workstations, to attend classes or seminars given by a teacher or expert, who can also be located in some remote geographical area. Hippocrates can be thought of as a distributed transparency projector. The teacher can project transparencies on the screens of the students’ workstations and can emphasize or indicate regions of interest on them by using the graphical tools offered by Hippocrates. Immediate results of the use of Hippocrates are the fast updating of the personnel in remote areas and the upgrading of the quality of the services they offer.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithmic Issues in Coalitional and Dynamic Network Games",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.60.4462&rep=rep1&type=pdf",
            "Abstract": "We discuss some new algorithmic and complexity issues in coalitional and dynamic/evolutionary games, related to the understanding of modern selfish and Complex networks. In particular:(a) We examine the achievement of equilibria via natural distributed and greedy approaches in networks.(b) We present a model of a coalitional game in order to capture the anarchy cost and complexity of constructing equilibria in such situations.(c) We propose a stochastic approach to some kinds of local interactions in networks, that can be viewed also as extensions of the classical evolutionary game theoretic setting.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Maximum Latency of Unsplittable Flows in Capacitated Networks⋆",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=14259567096884115948&hl=en&oi=scholarr",
            "Abstract": "We study the price of anarchy in (unweighted) single-commodity network congestion games relative to the objective of maximum latency. We prove that for any network of m edges and edge delays de (x)= aex, the price of anarchy is Θ (log m log log m).",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:mB3voiENLucC",
            "Publisher": "Technical report, Research Academic Computer Technology Institute"
        },
        {
            "Title": "Minimum Congestion Redundant Assignments",
            "Publication year": 2008,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/28268",
            "Abstract": "Minimum Congestion Redundant Assignments Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ\n→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε περιοδικά → Εμφάνιση Τεκμηρίου \nHEAL DSpace Minimum Congestion Redundant Assignments Αποθετήριο DSpace/Manakin \nMinimum Congestion Redundant Assignments Fotakis, D; Spirakis, P URI: http://hdl.handle.net/123456789/28268 \nΗμερομηνία: 2008 Εμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος \nΜορφότυπο Προβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το \nτεκμήριο εμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά \nΠεριήγηση Σε όλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς \nΤίτλοι Θέματα Αυτή η Συλλογή Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Ο \nΛογαριασμός μου Σύνδεση Εγγραφή Οδηγίες / Βοήθεια Οδηγίες Υποβολής Οδηγίες ΙΑ - /…",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Preface to Special Issue on Algorithmic Game Theory",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-015-9628-2",
            "Abstract": "This special issue of TOCS contains selected papers of the 6th edition of the Symposium on Algorithmic Game Theory (SAGT). The purpose of SAGT is to bring together researchers from Computer Science, Economics, Physics, Biology and Mathematics to present and discuss original research at the intersection of Algorithms and Game Theory.We devote this issue to the memory of Berthold Vöcking, who died on June 11th, 2014, after a long struggle with cancer. Berthold was a leading scientist in the area of Algorithmic Game Theory and very active in our community. He had been a member of the Steering Committee of SAGT since its very beginning. In October 2013, he organized the 6th Symposium on Algorithmic Game Theory at RWTH Aaachen University, in Germany, where he also acted as the Program Committee chair. During the symposium, Berthold asked us to become co-editors for this special issue. The …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The impact of social ignorance on weighted congestion games",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-10841-9_29",
            "Abstract": "We consider weighted linear congestion games, and investigate how social ignorance, namely lack of information about the presence of some players, affects the inefficiency of pure Nash equilibria (PNE) and the convergence rate of the ε-Nash dynamics. To this end, we adopt the model of graphical linear congestion games with weighted players, where the individual cost and the strategy selection of each player only depends on his neighboring players in the social graph. We show that such games admit a potential function, and thus a PNE. Our main result is that the impact of social ignorance on the Price of Anarchy (PoA) and the Price of Stability (PoS) is naturally quantified by the independence number α(G) of the social graph G. In particular, we show that the PoA grows roughly as α(G)(α(G) + 2), which is essentially tight as long as α(G) does not exceed half the number of players, and that …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Strategyproof Facility Location in Perturbation Stable Instances",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2107.11977",
            "Abstract": "We consider -Facility Location games, where  strategic agents report their locations on the real line, and a mechanism maps them to  facilities. Each agent seeks to minimize her distance to the nearest facility. We are interested in (deterministic or randomized) strategyproof mechanisms without payments that achieve a reasonable approximation ratio to the optimal social cost of the agents. To circumvent the inapproximability of -Facility Location by deterministic strategyproof mechanisms, we restrict our attention to perturbation stable instances. An instance of -Facility Location on the line is -perturbation stable (or simply, -stable), for some , if the optimal agent clustering is not affected by moving any subset of consecutive agent locations closer to each other by a factor at most . We show that the optimal solution is strategyproof in -stable instances whose optimal solution does not include any singleton clusters, and that allocating the facility to the agent next to the rightmost one in each optimal cluster (or to the unique agent, for singleton clusters) is strategyproof and -approximate for -stable instances (even if their optimal solution includes singleton clusters). On the negative side, we show that for any  and any , there is no deterministic anonymous mechanism that achieves a bounded approximation ratio and is strategyproof in -stable instances. We also prove that allocating the facility to a random agent of each optimal cluster is strategyproof and -approximate in -stable instances. To the best of our knowledge, this is the first time that the existence of deterministic (resp. randomized) strategyproof …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Congestion games with linearly independent paths: Convergence time and price of anarchy",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-009-9205-7",
            "Abstract": "We investigate the effect of linear independence in the strategies of congestion games on the convergence time of best improvement sequences and on the pure Price of Anarchy. In particular, we consider symmetric congestion games on extension-parallel networks, an interesting class of networks with linearly independent paths, and establish two remarkable properties previously known only for parallel-link games. We show that for arbitrary (non-negative and non-decreasing) latency functions, any best improvement sequence reaches a pure Nash equilibrium in at most as many steps as the number of players, and that for latency functions in class   , the pure Price of Anarchy is at most   , i.e. it is bounded by the Price of Anarchy for non-atomic congestion games. As a by-product of our analysis, we obtain that for symmetric network congestion games with latency functions in class   , the Price of Stability …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Genetically determined variable structure multiple model estimation",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/950781/",
            "Abstract": "In this paper, the multimodel partitioning theory is combined with genetic algorithms to produce a new generation of multimodel partitioning filters, whose structure varies to conform to a model set being determined dynamically and on-line by using a suitably designed genetic algorithm. The proposed algorithm does not require any knowledge of the model switching law, is practically implementable, and exhibits superior performance compared with a fixed-structure multimodel partitioning filter (MMPF), as indicated by simulation experiments.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Algorithms and Complexity",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-57586-5.pdf",
            "Abstract": "This volume contains the papers selected for presentation at CIAC 2017, the 10th International Conference on Algorithms and Complexity, held at the National Technical University of Athens, Greece, during May 24–26, 2017. This series of conferences presents original research contributions in the theory and applications of algorithms and computational complexity. The volume begins with abstracts of the invited lectures, continues with contributed papers, arranged alphabetically by the last names of their authors, and concludes with an article devoted to the celebration of the 70th birthday of Stathis Zachos. The volume contains 36 accepted papers, selected by the Program Committee from 90 submissions received. Each submission was reviewed by at least three Program Committee members. Paper selection was based on originality, technical quality, and relevance. We thank all the authors who submitted …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Springer International Publishing AG"
        },
        {
            "Title": "The Online Min-Sum Set Cover Problem",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2003.02161",
            "Abstract": "We consider the online Min-Sum Set Cover (MSSC), a natural and intriguing generalization of the classical list update problem. In Online MSSC, the algorithm maintains a permutation on  elements based on subsets  arriving online. The algorithm serves each set  upon arrival, using its current permutation , incurring an access cost equal to the position of the first element of  in . Then, the algorithm may update its permutation to , incurring a moving cost equal to the Kendall tau distance of  to . The objective is to minimize the total access and moving cost for serving the entire sequence. We consider the -uniform version, where each  has cardinality . List update is the special case where . We obtain tight bounds on the competitive ratio of deterministic online algorithms for MSSC against a static adversary, that serves the entire sequence by a single permutation. First, we show a lower bound of  on the competitive ratio. Then, we consider several natural generalizations of successful list update algorithms and show that they fail to achieve any interesting competitive guarantee. On the positive side, we obtain a -competitive deterministic algorithm using ideas from online learning and the multiplicative weight updates (MWU) algorithm. Furthermore, we consider efficient algorithms. We propose a memoryless online algorithm, called Move-All-Equally, which is inspired by the Double Coverage algorithm for the -server problem. We show that its competitive ratio is  and , and conjecture that it is -competitive. We also compare Move-All-Equally against the dynamic optimal solution and obtain …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Label Ranking through Nonparametric Regression",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2111.02749",
            "Abstract": "Label Ranking (LR) corresponds to the problem of learning a hypothesis that maps features to rankings over a finite set of labels. We adopt a nonparametric regression approach to LR and obtain theoretical performance guarantees for this fundamental practical problem. We introduce a generative model for Label Ranking, in noiseless and noisy nonparametric regression settings, and provide sample complexity bounds for learning algorithms in both cases. In the noiseless setting, we study the LR problem with full rankings and provide computationally efficient algorithms using decision trees and random forests in the high-dimensional regime. In the noisy setting, we consider the more general cases of LR with incomplete and partial rankings from a statistical viewpoint and obtain sample complexity bounds using the One-Versus-One approach of multiclass classification. Finally, we complement our theoretical contributions with experiments, aiming to understand how the input regression noise affects the observed output.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Winner-imposing strategyproof mechanisms for multiple Facility Location games",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397512010791",
            "Abstract": "We study Facility Location games, where a number of facilities are placed in a metric space based on locations reported by strategic agents. A mechanism maps the agents’ locations to a set of facilities. The agents seek to minimize their connection cost, namely the distance of their true location to the nearest facility, and may even misreport their location. We are interested in mechanisms that are strategyproof, ie, ensure that no agent can benefit from misreporting her location, do not resort to monetary transfers, and approximate the optimal social cost. We focus on the closely related problems of k-Facility Location and Facility Location with a uniform facility opening cost, instead of a bound of k on the number of facilities. In the former, the social cost is the agents’ total connection cost, while in the latter, the social cost is the sum of the total connection cost and the total facility opening cost. We mostly study …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:u9iWguZQMMsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the Efficiency of Influence-and-Exploit Strategies for Revenue Maximization under Positive Externalities⋆",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397514003314",
            "Abstract": "The mitigated effectiveness of traditional forms of advertising along with winner-take-all phenomena caused by globalization and the Internet necessitates a new approach in marketing. Hartline et al. (2008) [16] introduced a marketing model for social networks, where a seller is trying to exploit positive externalities between the buyers and to maximize his revenue by designing an intelligent series of individualized offers. Under this setting, we study the problem of revenue maximization and mostly focus on Influence-and-Exploit (IE) marketing strategies. We show that in undirected social networks, revenue maximization is NP-hard not only when we search for an optimal marketing strategy, but also when we search for the best IE strategy. Rather surprisingly, we observe that allowing IE strategies to offer prices smaller than the myopic price in the exploit step leads to a significant improvement on their performance …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On Radiocoloring Hierarchically Specified Planar Graphs: PSPACE P S P A C E-Completeness and Approximations",
            "Publication year": 2002,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Radiocolorings in periodic planar graphs: PSPACE-completeness and efficient approximations for the optimal range of frequencies",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S157086670500064X",
            "Abstract": "The Frequency Assignment Problem (FAP) in radio networks is the problem of assigning frequencies to transmitters exploiting frequency reuse while keeping signal interference to acceptable levels. The FAP is usually modelled by variations of the graph coloring problem. A Radiocoloring (RC) of a graph G (V, E) is an assignment function Λ: V→ N such that| Λ (u)− Λ (v)|⩾ 2, when u, v are neighbors in G, and| Λ (u)− Λ (v)|⩾ 1 when the distance of u, v in G is two. The discrete number of frequencies used is called order and the range of frequencies used, span. The optimization versions of the Radiocoloring Problem (RCP) are to minimize the span (min span RCP) or the order (min order RCP). In this paper, we deal with an interesting, yet not examined until now, variation of the radiocoloring problem: that of satisfying frequency assignment requests which exhibit some periodic behavior. In this case, the …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:blknAaTinKkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Mechanism Design for Perturbation Stable Combinatorial Auctions",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-57980-7_4",
            "Abstract": "Motivated by recent research on combinatorial markets with endowed valuations by (Babaioff et al., EC 2018) and (Ezra et al., EC 2020), we introduce a notion of perturbation stability in Combinatorial Auctions (CAs) and study the extend to which stability helps in social welfare maximization and mechanism design. A CA is -stable if the optimal solution is resilient to inflation, by a factor of , of any bidder’s valuation for any single item. On the positive side, we show how to compute efficiently an optimal allocation for 2-stable subadditive valuations and that a Walrasian equilibrium exists for 2-stable submodular valuations. Moreover, we show that a Parallel 2nd Price Auction (P2A) followed by a demand query for each bidder is truthful for general subadditive valuations and results in the optimal allocation for 2-stable submodular valuations. To highlight the challenges behind optimization and mechanism design for stable CAs …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:Mojj43d5GZwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On the efficiency of influence-and-exploit strategies for revenue maximization under positive externalities",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397514003314",
            "Abstract": "The mitigated effectiveness of traditional forms of advertising along with winner-take-all phenomena caused by globalization and the Internet necessitates a new approach in marketing. Hartline et al. (2008) [16] introduced a marketing model for social networks, where a seller is trying to exploit positive externalities between the buyers and to maximize his revenue by designing an intelligent series of individualized offers. Under this setting, we study the problem of revenue maximization and mostly focus on Influence-and-Exploit (IE) marketing strategies. We show that in undirected social networks, revenue maximization is NP-hard not only when we search for an optimal marketing strategy, but also when we search for the best IE strategy. Rather surprisingly, we observe that allowing IE strategies to offer prices smaller than the myopic price in the exploit step leads to a significant improvement on their performance …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "NP-Completeness results and efficient approximations for radiocoloring in planar graphs",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44612-5_32",
            "Abstract": "The Frequency Assignment Problem (FAP) in radio networks is the problem of assigning frequencies to transmitters exploiting frequency reuse while keeping signal interference to acceptable levels. The FAP is usually modelled by variations of the graph coloring problem. The Radiocoloring (RC) of a graph G(V,E) is an assignment function Φ: V → IN such that ¦Φ(u)-Φ(v)≥ 2, when u; v are neighbors in G, and ¦Φ(u)-Φ(v)≥1 when the minimum distance of u; v in G is two. The discrete number and the range of frequencies used are called order and span, respectively. The optimization versions of the Radiocoloring Problem (RCP) are to minimize the span or the order. In this paper we prove that the min span RCP is NP-complete for planar graphs. Next, we provide an O(nΔ) time algorithm (¦V¦ = n) which obtains a radiocoloring of a planar graph G that approximates the minimum order within a ratio which tends …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Scheduling MapReduce Jobs under Multi-Round Precedences",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-43659-3_16",
            "Abstract": "We consider non-preemptive scheduling of MapReduce jobs consisitng of multiple map-reduce rounds so as to minimize the average weighted completion time on identical and unrelated processors. For identical processors, we present LP-based O(1)-approximation algorithms, while for unrelated processors the approximation ratio naturally depends on the maximum number of rounds of any job (a small constant in practice). For the single-round case, we substantially improve on previously best known approximation ratios for both identical and unrelated processors. Moreover, we conduct an experimental analysis and compare the performance of our algorithms against a fast heuristic and a lower bound on the optimal solution, thus demonstrating their promising practical performance.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Memoryless Algorithms for the Generalized -server Problem on Uniform Metrics",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2007.08669",
            "Abstract": "We consider the generalized -server problem on uniform metrics. We study the power of memoryless algorithms and show tight bounds of  on their competitive ratio. In particular we show that the \\textit{Harmonic Algorithm} achieves this competitive ratio and provide matching lower bounds. This improves the  doubly-exponential bound of Chiplunkar and Vishwanathan for the more general setting of uniform metrics with different weights.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scheduling MapReduce Jobs on Identical and Unrelated Processors",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-019-09956-6",
            "Abstract": "We consider non-preemptive scheduling of MapReduce jobs consisting of multiple map-reduce rounds so as to minimize their average weighted completion time on identical or unrelated processor environments. For identical processors, we present LP-based O(1)-approximation algorithms, while for unrelated processors the approximation ratio naturally depends on the maximum number of rounds of any job (which is a small constant in practice). For the single-round case, we substantially improve on previously best known approximation ratios, while also we introduce into our model the crucial cost of the data shuffle phase, i.e., the cost for the transmission of intermediate data from Map to Reduce tasks. Finally, we evaluate our algorithms via simulations in the general case of unrelated processors, comparing them with a lower bound on the optimal cost of the problem as well as with a fast algorithm which …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Influence Maximization in Switching-Selection Threshold Models",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44803-8_11",
            "Abstract": "We study influence maximization problems over social networks, in the presence of competition. Our focus is on diffusion processes within the family of threshold models. Motivated by the general lack of positive results establishing monotonicity and submodularity of the influence function for threshold models, we introduce a general class of switching-selection threshold models where the switching and selection functions may also depend on the node activation history. This extension allows us to establish monotonicity and submodularity when (i) the switching function is linear and depends on the influence by all active neighbors, and (ii) the selection function is linear and depends on the influence by the nodes activated only in the last step. This implies a (1 − 1/e − ε)-approximation for the influence maximization problem in the competitive setting. On the negative side, we present a collection of …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:D03iK_w7-QYC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Opinion Dynamics with Limited Information",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-04612-5_19",
            "Abstract": "We study opinion formation games based on the Friedkin-Johnsen (FJ) model. We are interested in simple and natural variants of the FJ model that use limited information exchange in each round and converge to the same stable point. As in the FJ model, we assume that each agent i has an intrinsic opinion  and maintains an expressed opinion  in each round t. To model limited information exchange, we assume that each agent i meets with one random friend j at each round t and learns only . The amount of influence j imposes on i is reflected by the probability  with which i meets j. Then, agent i suffers a disagreement cost that is a convex combination of  and .An important class of dynamics in this setting are no regret dynamics. We show an exponential gap between the convergence rate of no regret dynamics and of more general dynamics that do not ensure no regret. We prove …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On Radiocoloring Hierarchically Specified Planar Graphs:\\ mathcal {PSPACE}-completeness and Approximations",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24024-4_8",
            "Abstract": "Hierarchical specifications of graphs have been widely used in many important applications, such as VLSI design, parallel programming and software engineering. A well known hierarchical specification model, considered in this work, is that of Lengauer [21, 22], referred to as L-specifications. In this paper we discuss a restriction on the L-specifications resulting to graphs which we call Well-Separated (WS). This class is recognized in polynomial time.In this work we study the Radiocoloring Problem (RCP) on WS L-specified hierarchical planar graphs. The optimization version of RCP studied here, consists in assigning colors to the vertices of a graph, such that any two vertices of distance at most two get different colors. The objective here is to minimize the number of colors used.We first show that RCP is -complete for WS L-specified hierarchical planar graphs. Second, we …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Who to Trust for Truthfully Maximizing Welfare?",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1507.02301",
            "Abstract": "We introduce a general approach based on \\emph{selective verification} and obtain approximate mechanisms without money for maximizing the social welfare in the general domain of utilitarian voting. Having a good allocation in mind, a mechanism with verification selects few critical agents and detects, using a verification oracle, whether they have reported truthfully. If yes, the mechanism produces the desired allocation. Otherwise, the mechanism ignores any misreports and proceeds with the remaining agents. We obtain randomized truthful (or almost truthful) mechanisms without money that verify only  agents, where  is the number of outcomes, independently of the total number of agents, and are -approximate for the social welfare. We also show that any truthful mechanism with a constant approximation ratio needs to verify  agents. A remarkable property of our mechanisms is \\emph{robustness}, namely that their outcome depends only on the reports of the truthful agents.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Selﬁsh unsplittable ﬂows",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=12162903553062495735&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Redundant Assignments under",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=tGNqCQAAQBAJ&oi=fnd&pg=PA156&dq=info:YdIltL6dlp4J:scholar.google.com&ots=Nn9uxaCYXC&sig=BN05WtOB8H_31D8qOSu1B4luAJ4",
            "Abstract": "We consider the problem of computing minimum congestion, fault-tolerant, redundant assignments of messages to faulty parallel delivery channels. In particular, we are given a set M of faulty channels, each having an integer capacity c, and failing independently with probability f. We are also given a set of messages to be delivered over M, and a fault-tolerance constraint (1–6), and we seek a redundant assignment© that minimizes congestion Cong (@), ie the maximum channel load, subject to the constraint that, with probability no less than (1–6), all the messages have a copy on at least one active channel. We present a 4-approximation algorithm for identical capacity channels and arbitrary influl/e lm (1/fmax.) capacity channels and unit size messages. Both algorithms are based on computing a collection of disjoint chan-nel subsets such that, with probability no less than (1–6), at least one channel is active in each subset. The objective is to maximize the sum of message sizes, and a 2||-approximation algorithm for related the minimum subset capacities. Since the exact version of this problem is VP-complete, we present a 2-approximation algorithm for identical capacities, and a (8+ of 1))-approximation algorithm for arbitrary ca-pacities.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Symmetry in network congestion games: Pure equilibria and anarchy cost",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11671411_13",
            "Abstract": "We study computational and coordination efficiency issues of Nash equilibria in symmetric network congestion games. We first propose a simple and natural greedy method that computes a pure Nash equilibrium with respect to traffic congestion in a network. In this algorithm each user plays only once and allocates her traffic to a path selected via a shortest path computation. We then show that this algorithm works for series-parallel networks when users are identical or when users are of varying demands but have the same best response strategy for any initial network traffic. We also give constructions where the algorithm fails if either the above condition is violated (even for series-parallel networks) or the network is not series-parallel (even for identical users). Thus, we essentially indicate the limits of the applicability of this greedy approach.We also study the price of anarchy for the objective of …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Radiocolorings in periodic planar graphs: PSPACE-completeness and efficient approximations for the optimal range of frequencies",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36379-3_20",
            "Abstract": "The Frequency Assignment Problem (FAP) in radio networks is the problem of assigning frequencies to transmitters exploiting frequency reuse while keeping signal interference to acceptable levels. The FAP is usually modelled by variations of the graph coloring problem. The Radiocoloring (RC) of a graph G(V,E) is an assignment function Φ: V → IN such that ∣Φ(u) - Φ(v)∣ ≥2, when u, v are neighbors in G, and ∣Φ(u) - Φ(v)∣ ≥1 when the distance of u, v in G is two. The range of frequencies used is called span. Here, we consider the optimization version of the Radiocoloring Problem (RCP) of finding a radiocoloring assignment of minimum span, called min span RCP. In this paper, we deal with a variation of RCP: that of satisfying frequency assignment requests with some periodic behavior. In this case, the interference graph is an (infinite) periodic graph. Infinite periodic graphs model finite networks that …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Learning Powers of Poisson Binomial Distributions",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1707.05662",
            "Abstract": "We introduce the problem of simultaneously learning all powers of a Poisson Binomial Distribution (PBD). A PBD of order  is the distribution of a sum of  mutually independent Bernoulli random variables , where . The 'th power of this distribution, for  in a range , is the distribution of , where each Bernoulli random variable  has . The learning algorithm can query any power  several times and succeeds in learning all powers in the range, if with probability at least : given any , it returns a probability distribution  with total variation distance from  at most . We provide almost matching lower and upper bounds on query complexity for this problem. We first show a lower bound on the query complexity on PBD powers instances with many distinct parameters  which are separated, and we almost match this lower bound by examining the query complexity of simultaneously learning all the powers of a special class of PBD's resembling the PBD's of our lower bound. We study the fundamental setting of a Binomial distribution, and provide an optimal algorithm which uses  samples. Diakonikolas, Kane and Stewart [COLT'16] showed a lower bound of  samples to learn the 's within error . The question whether sampling from powers of PBDs can reduce this sampling complexity, has a negative answer since we show that the exponential number of samples is inevitable. Having sampling access to the powers of a PBD we then give a nearly optimal algorithm that learns its 's. To prove our two last lower bounds we extend the classical minimax risk definition from statistics to …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A primal-dual algorithm for online non-uniform facility location",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570866706000268",
            "Abstract": "In the online version of Facility Location, the demand points arrive one at a time and must be irrevocably assigned to an open facility upon arrival. The objective is to minimize the sum of facility and assignment costs. We present a simple deterministic primal-dual algorithm for the general case of non-uniform facility costs. We prove that its competitive ratio is no greater than 4 log (n+ 1)+ 2, which is close to the lower bound of Ω (log n log log n).",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:0EnyYjriUFMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Stochastic Opinion Dynamics for Interest Prediction in Social Networks",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2107.03449",
            "Abstract": "We exploit the core-periphery structure and the strong homophilic properties of online social networks to develop faster and more accurate algorithms for user interest prediction. The core of modern social networks consists of relatively few influential users, whose interest profiles are publicly available, while the majority of peripheral users follow enough of them based on common interests. Our approach is to predict the interests of the peripheral nodes starting from the interests of their influential connections. To this end, we need a formal model that explains how common interests lead to network connections. Thus, we propose a stochastic interest formation model, the Nearest Neighbor Influence Model (NNIM), which is inspired by the Hegselmann-Krause opinion formation model and aims to explain how homophily shapes the network. Based on NNIM, we develop an efficient approach for predicting the interests of the peripheral users. At the technical level, we use Variational Expectation-Maximization to optimize the instantaneous likelihood function using a mean-field approximation of NNIM. We prove that our algorithm converges fast and is capable of scaling smoothly to networks with millions of nodes. Our experiments on standard network benchmarks demonstrate that our algorithm runs up to two orders of magnitude faster than the best known node embedding methods and achieves similar accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Memoryless facility location in one pass",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2000807.2000817",
            "Abstract": "We present the first one-pass memoryless algorithm for metric Facility Location that maintains a set of facilities approximating the optimal facility configuration within a constant factor. The algorithm is randomized and very simple to state and implement. It processes the demand points one-by-one as they arrive, and keeps in memory only the facility locations currently open. We prove that its competitive ratio is less than 14 in the special case of uniform facility costs, and less than 49 in the general case of nonuniform facility costs.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:35N4QoGY0k4C",
            "Publisher": "ACM"
        },
        {
            "Title": "On the existence of optimal taxes for network congestion games with heterogeneous users",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16170-4_15",
            "Abstract": "We consider network congestion games in which a finite number of non-cooperative users select paths. The aim is to mitigate the inefficiency caused by the selfish users by introducing taxes on the network edges. A tax vector is strongly (weakly)-optimal if all (at least one of) the equilibria in the resulting game minimize(s) the total latency. The issue of designing optimal tax vectors for selfish routing games has been studied extensively in the literature. We study for the first time taxation for networks with atomic users which have unsplittable traffic demands and are heterogeneous, i.e., have different sensitivities to taxes. On the positive side, we show the existence of weakly-optimal taxes for single-source network games. On the negative side, we show that the cases of homogeneous and heterogeneous users differ sharply as far as the existence of strongly-optimal taxes is concerned: there are parallel-link …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Combinatorial Auctions without Money",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An evolutionary annealing approach to graph coloring",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45365-2_13",
            "Abstract": "This paper presents a new heuristic algorithm for the graph coloring problem based on a combination of genetic algorithms and simulated annealing. Our algorithm exploits a novel crossover operator for graph coloring. Moreover, we investigate various ways in which simulated annealing can be used to enhance the performance of an evolutionary algorithm. Experiments performed on various collections of instances have justified the potential of this approach. We also discuss some possible enhancements and directions for further research.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Spirakis: NP-completeness Results and Efficient Approximations for Radiocoloring in Planar Graphs",
            "Publication year": 2000,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/25853",
            "Abstract": "Spirakis: NP-completeness Results and Efficient Approximations for Radiocoloring in \nPlanar Graphs Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → \nΔημοσιεύσεις μελών ΔΕΠσε περιοδικά → Εμφάνιση Τεκμηρίου HEAL DSpace Spirakis: NP-completeness \nResults and Efficient Approximations for Radiocoloring in Planar Graphs Αποθετήριο \nDSpace/Manakin Spirakis: NP-completeness Results and Efficient Approximations for \nRadiocoloring in Planar Graphs Fotakis, D; Nikoletseas, S; Papadoulou, V URI: http://hdl.handle.net/123456789/25853 \nΗμερομηνία: 2000 Εμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος \nΜορφότυπο Προβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το \nτεκμήριο εμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά \nΠεριήγηση Σε όλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Τίτλοι …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Node-Max-Cut and the Complexity of Equilibrium in Linear Weighted Congestion Games",
            "Publication year": 2020,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2020/12457/",
            "Abstract": "In this work, we seek a more refined understanding of the complexity of local optimum computation for Max-Cut and pure Nash equilibrium (PNE) computation for congestion games with weighted players and linear latency functions. We show that computing a PNE of linear weighted congestion games is PLS-complete either for very restricted strategy spaces, namely when player strategies are paths on a series-parallel network with a single origin and destination, or for very restricted latency functions, namely when the latency on each resource is equal to the congestion. Our results reveal a remarkable gap regarding the complexity of PNE in congestion games with weighted and unweighted players, since in case of unweighted players, a PNE can be easily computed by either a simple greedy algorithm (for series-parallel networks) or any better response dynamics (when the latency is equal to the congestion). For the latter of the results above, we need to show first that computing a local optimum of a natural restriction of Max-Cut, which we call Node-Max-Cut, is PLS-complete. In Node-Max-Cut, the input graph is vertex-weighted and the weight of each edge is equal to the product of the weights of its endpoints. Due to the very restricted nature of Node-Max-Cut, the reduction requires a careful combination of new gadgets with ideas and techniques from previous work. We also show how to compute efficiently a (1+ ε)-approximate equilibrium for Node-Max-Cut, if the number of different vertex weights is constant.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "Efficient Parameter Estimation of Truncated Boolean Product Distributions",
            "Publication year": 2020,
            "Publication url": "http://proceedings.mlr.press/v125/fotakis20a.html",
            "Abstract": "We study the problem of estimating the parameters of a Boolean product distribution in  dimensions, when the samples are truncated by a set  accessible through a membership oracle. This is the first time that the computational and statistical complexity of learning from truncated samples is considered in a discrete setting. We introduce a natural notion of\\emph {fatness} of the truncation set , under which truncated samples reveal enough information about the true distribution. We show that if the truncation set is sufficiently fat, samples from the true distribution can be generated from truncated samples. A stunning consequence is that virtually any statistical task (eg, learning in total variation distance, parameter estimation, uniformity or identity testing) that can be performed efficiently for Boolean product distributions, can also be performed from truncated samples, with a small increase in sample complexity. We generalize our approach to ranking distributions over  alternatives, where we show how fatness implies efficient parameter estimation of Mallows models from truncated samples. Exploring the limits of learning discrete models from truncated samples, we identify three natural conditions that are necessary for efficient identifiability:(i) the truncation set  should be rich enough;(ii)  should be accessible through membership queries; and (iii) the truncation by  should leave enough randomness in all directions. By carefully adapting the Stochastic Gradient Descent approach of (Daskalakis et al., FOCS 2018), we show that these conditions are also sufficient for efficient learning of truncated Boolean product distributions.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Impact of Social Ignorance on Weighted Congestion Games",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-011-9355-2",
            "Abstract": "We consider weighted linear congestion games, and investigate how social ignorance, namely lack of information about the presence of some players, affects the inefficiency of pure Nash equilibria (PNE) and the convergence rate of the ε-Nash dynamics. To this end, we adopt the model of graphical linear congestion games with weighted players, where the individual cost and the strategy selection of each player only depends on his neighboring players in the social graph. We show that such games admit a potential function, and thus a PNE. Next, we investigate the Price of Anarchy (PoA) and the Price of Stability (PoS) of graphical linear congestion games with respect to the players’ total actual cost. Our main result is that the impact of social ignorance on the PoA and on the PoS is naturally quantified by the independence number α(G) of the social graph G. In particular, we show that the PoA …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Efficient heuristic algorithms for correcting the Cascade Vulnerability Problem for interconnected networks",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366406000326",
            "Abstract": "The Cascade Vulnerability Problem for interconnected networks is a potential problem faced when the interconnected accredited system approach of the Trusted Network Interpretation is used. It belongs to a subset of the problem set that addresses the issue of whether the composition of secure systems via a secure channel results in a secure network. The Cascade Vulnerability Problem appears when an attacker can take advantage of network connections to compromise information across a range of security levels that is greater than the accreditation range of any of the component systems she must defeat to do so.In this paper, the general Cascade Vulnerability Problem is presented, and the basic properties of the most important detection and correction algorithms are briefly described. Two new efficient heuristic algorithms are proposed for correcting the Cascade Vulnerability Problem: (a) a conceptually …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Sampling Multiple Nodes in Large Networks: Beyond Random Walks",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.13324",
            "Abstract": "Sampling random nodes is a fundamental algorithmic primitive in the analysis of massive networks, with many modern graph mining algorithms critically relying on it. We consider the task of generating a large collection of random nodes in the network assuming limited query access (where querying a node reveals its set of neighbors). In current approaches, based on long random walks, the number of queries per sample scales linearly with the mixing time of the network, which can be prohibitive for large real-world networks. We propose a new method for sampling multiple nodes that bypasses the dependence in the mixing time by explicitly searching for less accessible components in the network. We test our approach on a variety of real-world and synthetic networks with up to tens of millions of nodes, demonstrating a query complexity improvement of up to  compared to the state of the art.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mechanism Design with Selective Verification",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2940716.2940743",
            "Abstract": "We introduce a general approach based on selective verification and obtain approximate mechanisms without money for maximizing the social welfare in the general domain of Utilitarian Voting. Having a good allocation in mind, a mechanism with verification selects few critical agents and detects, using a verification oracle, whether they have reported truthfully. If yes, the mechanism produces the desired allocation. Otherwise, the mechanism ignores any misreports and proceeds recursively with the remaining agents. We obtain randomized truthful (or almost truthful) mechanisms without money that verify only O (ln m/eps) agents, where m is the number of outcomes, independently of the total number of agents, and are (1-eps)-approximate for the social welfare. We also show that any truthful mechanism with a constant approximation ratio needs to verify Omega (log m) agents. A remarkable property of our …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:WbkHhVStYXYC",
            "Publisher": "ACM"
        },
        {
            "Title": "Enumerating subgraph instances using map-reduce",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6544814/",
            "Abstract": "The theme of this paper is how to find all instances of a given “sample” graph in a larger “data graph,” using a single round of map-reduce. For the simplest sample graph, the triangle, we improve upon the best known such algorithm. We then examine the general case, considering both the communication cost between mappers and reducers and the total computation cost at the reducers. To minimize communication cost, we exploit the techniques of [1] for computing multiway joins (evaluating conjunctive queries) in a single map-reduce round. Several methods are shown for translating sample graphs into a union of conjunctive queries with as few queries as possible. We also address the matter of optimizing computation cost. Many serial algorithms are shown to be “convertible,” in the sense that it is possible to partition the data graph, explore each partition in a separate reducer, and have the total computation …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Local Aggregation in Preference Games",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2002.01251",
            "Abstract": "In this work we introduce a new model of decision-making by agents in a social network. Agents have innate preferences over the strategies but, because of the social interactions, the decision of the agents are not only affected by their innate preferences but also by the decision taken by their social neighbors. We assume that the strategies of the agents are embedded in an {approximate} metric space. Furthermore, departing from the previous literature, we assume that, due to the lack of information, each agent locally represents the trend of the network through an aggregate value, which can be interpreted as the output of an aggregation function. We answer some fundamental questions related to the existence and efficiency of pure Nash equilibria.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scheduling MapReduce Jobs and Data Shuffle on Unrelated Processors",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-20086-6_11",
            "Abstract": "We propose a constant approximation algorithm for generalizations of the Flexible Flow Shop (FFS) problem which form a realistic model for non-preemptive scheduling in MapReduce systems. Our results concern the minimization of the total weighted completion time of a set of MapReduce jobs on unrelated processors and improve substantially on the model proposed by Moseley et al. (SPAA 2011) in two directions: (i) we consider jobs consisting of multiple Map and Reduce tasks, which is the key idea behind MapReduce computations, and (ii) we introduce into our model the crucial cost of the data shuffle phase, i.e., the cost for the transmission of intermediate data from Map to Reduce tasks. Moreover, we experimentally evaluate our algorithm compared with a lower bound on the optimal cost of our problem as well as with a fast algorithm, which combines a simple online assignment of tasks to …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Node Max-Cut and Computing Equilibria in Linear Weighted Congestion Games",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1911.08704",
            "Abstract": "In this work, we seek a more refined understanding of the complexity of local optimum computation for Max-Cut and pure Nash equilibrium (PNE) computation for congestion games with weighted players and linear latency functions. We show that computing a PNE of linear weighted congestion games is PLS-complete either for very restricted strategy spaces, namely when player strategies are paths on a series-parallel network with a single origin and destination, or for very restricted latency functions, namely when the latency on each resource is equal to the congestion. Our results reveal a remarkable gap regarding the complexity of PNE in congestion games with weighted and unweighted players, since in case of unweighted players, a PNE can be easily computed by either a simple greedy algorithm (for series-parallel networks) or any better response dynamics (when the latency is equal to the congestion). For the latter of the results above, we need to show first that computing a local optimum of a natural restriction of Max-Cut, which we call \\emph{Node-Max-Cut}, is PLS-complete. In Node-Max-Cut, the input graph is vertex-weighted and the weight of each edge is equal to the product of the weights of its endpoints. Due to the very restricted nature of Node-Max-Cut, the reduction requires a careful combination of new gadgets with ideas and techniques from previous work. We also show how to compute efficiently a $(1+\\eps)$-approximate equilibrium for Node-Max-Cut, if the number of different vertex weights is constant.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Selfish unsplittable flows",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-27836-8_51",
            "Abstract": "What is the price of anarchy when unsplittable demands are routed selfishly in general networks with load-dependent edge delays? Motivated by this question we generalize the model of [14] to the case of weighted congestion games. We show that varying demands of users crucially affect the nature of these games, which are no longer isomorphic to exact potential games, even for very simple instances. Indeed we construct examples where even a single-commodity (weighted) network congestion game may have no pure Nash equilibrium.On the other hand, we study a special family of networks (which we call the l-layered networks) and we prove that any weighted congestion game on such a network with resource delays equal to the congestions, possesses a pure Nash Equilibrium. We also show how to construct one in pseudo-polynomial time. Finally, we give a surprising answer to the question …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Space efficient hash tables with worst case constant access time",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36494-3_25",
            "Abstract": "We generalize Cuckoo Hashing [16] to d-ary Cuckoo Hashing and show how this yields a simple hash table data structure that stores n elements in (1 + ∈) n memory cells, for any constant ∈ > 0. Assuming uniform hashing, accessing or deleting table entries takes at most d = O(ln 1/∈ ) probes and the expected amortized insertion time is constant. This is the first dictionary that has worst case constant access time and expected constant update time, works with (1+∈) n space, and supports satellite information. Experiments indicate that d = 4 choices suffice for ∈ ≈ 0.03. We also describe a hash table data structure using explicit constant time hash functions, using at most d = O(ln2 1/∈ ) probes in the worst case.A corollary is an expected linear time algorithm for finding maximum cardinality matchings in a rather natural model of sparse random bipartite graphs.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Incremental algorithms for facility location and k-median",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S030439750600329X",
            "Abstract": "In the incremental versions of Facility Location and k-Median, the demand points arrive one at a time and the algorithm maintains a good solution by either adding each new demand to an existing cluster or placing it in a new singleton cluster. The algorithm can also merge some of the existing clusters at any point in time. For Facility Location, we consider the case of uniform facility costs, where the cost of opening a facility is the same for all points, and present the first incremental algorithm which achieves a constant performance ratio. Using this algorithm as a building block, we obtain the first incremental algorithm for k-Median which achieves a constant performance ratio using O (k) medians. The algorithm is based on a novel merge rule which ensures that the algorithm's configuration monotonically converges to the optimal facility locations according to a certain notion of distance. Using this property, we reduce …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:roLk4NBRz8UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the power of deterministic mechanisms for facility location games",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2665005",
            "Abstract": "We consider K-Facility Location games, where n strategic agents report their locations in a metric space and a mechanism maps them to K facilities. The agents seek to minimize their connection cost, namely the distance of their true location to the nearest facility, and may misreport their location. We are interested in deterministic mechanisms that are strategyproof, that is, ensure that no agent can benefit from misreporting her location, do not resort to monetary transfers, and achieve a bounded approximation ratio to the total connection cost of the agents (or to the Lp norm of the connection costs, for some p ∈ [1, ∞) or for p = ∞).Our main result is an elegant characterization of deterministic strategyproof mechanisms with a bounded approximation ratio for 2-Facility Location on the line. In particular, we show that for instances with n ≥ 5 agents, any such mechanism either admits a unique dictator or always places …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:M05iB0D1s5AC",
            "Publisher": "ACM"
        },
        {
            "Title": "A Bridge between Liquid and Social Welfare in Combinatorial Auctions with Submodular Bidders",
            "Publication year": 2018,
            "Publication url": "https://ojs.aaai.org/index.php/AAAI/article/view/5192",
            "Abstract": "We study incentive compatible mechanisms for Combinatorial Auctions where the bidders have submodular (or XOS) valuations and are budget-constrained. Our objective is to maximize the liquid welfare, a notion of efficiency for budgetconstrained bidders introduced by Dobzinski and Paes Leme (2014). We show that some of the known truthful mechanisms that best-approximate the social welfare for Combinatorial Auctions with submodular bidders through demand query oracles can be adapted, so that they retain truthfulness and achieve asymptotically the same approximation guarantees for the liquid welfare. More specifically, for the problem of optimizing the liquid welfare in Combinatorial Auctions with submodular bidders, we obtain a universally truthful randomized O (log m)-approximate mechanism, where m is the number of items, by adapting the mechanism of Krysta and Vöcking (2012).",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the competitive ratio for online facility location",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-007-9049-y",
            "Abstract": " We consider the problem of Online Facility Location, where the demand points arrive online and must be assigned irrevocably to an open facility upon arrival. The objective is to minimize the sum of facility and assignment costs. We prove that the competitive ratio for Online Facility Location is Θ  . On the negative side, we show that no randomized algorithm can achieve a competitive ratio better than Ω   against an oblivious adversary even if the demands lie on a line segment. On the positive side, we present a deterministic algorithm which achieves a competitive ratio of    in every metric space. ",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Machine Partitioning and Scheduling under Fault-Tolerance Constraints",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4757-3145-3_14",
            "Abstract": "We consider the problem of computing fault-tolerant, redundant assignments of jobs to faulty parallel machines with objective to minimize the maximum machine load. In particular, we are given a set M of faulty parallel machines, each having an integer speedy υ  i  and failing independently with probability f  i . We are also given a set of jobs to be processed on M, and a fault-tolerance constraint (1 − ∈), and we seek a redundant assignment φ that minimizes maximum machine load L∞(φ), subject to the constraint that, with probability no less than (1 − ∈), all the jobs have a copy on at least one active machine. We present a polynomial-time 4-approximation algorithm for identical speed machines and arbitrary job sizes, and a  -approximation algorithm for related speed machines and unit size jobs.Both algorithms are based on computing a …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:isC4tDSrTZIC",
            "Publisher": "KLUWER ACADEMIC PUBLISHERS"
        },
        {
            "Title": "Minimum congestion redundant assignments to tolerate random faults",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-001-0080-0",
            "Abstract": "We consider the problem of computing minimum congestion, fault-tolerant, redundant assignments of messages to faulty, parallel delivery channels. In particular, we are given a set Kof faulty channels, each having an integer capacity c i and failing independently with probability f i  . We are also given a set Mof messages to be delivered over K , and a fault-tolerance constraint (1-ɛ) , and we seek a redundant assignment ϕthat minimizes congestion \\lilsf Cong(ϕ) , i.e. the maximum channel load, subject to the constraint that, with probability no less than (1-ɛ) , all the messages have a copy on at least one active channel. We present a polynomial-time 4-approximation algorithm for identical capacity channels and arbitrary message sizes, and a 2 \\lceil\\ln(|K|/\\e)/\\ln(1/fmax ) \\rceil  -approximation algorithm for related capacity channels and unit size messages.Both …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cost-balancing tolls for atomic network congestion games",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-77105-0_19",
            "Abstract": "We investigate the existence of optimal tolls for atomic symmetric network congestion games with unsplittable traffic and arbitrary non-negative and non-decreasing latency functions. We focus on pure Nash equilibria and a natural toll mechanism, which we call cost-balancing tolls. A set of cost-balancing tolls turns every path with positive traffic on its edges into a minimum cost path. Hence any given configuration is induced as a pure Nash equilibrium of the modified game with the corresponding cost-balancing tolls. We show how to compute in linear time a set of cost-balancing tolls for the optimal solution such that the total amount of tolls paid by any player in any pure Nash equilibrium of the modified game does not exceed the latency on the maximum latency path in the optimal solution. Our main result is that for congestion games on series-parallel networks with increasing latencies, the optimal solution …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Truthfulness Flooded Domains and the Power of Verification for Mechanism Design",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2790086",
            "Abstract": "In this work, we investigate the reasons that make symmetric partial verification essentially useless in virtually all domains. Departing from previous work, we consider any possible (finite or infinite) domain and general symmetric verification. We identify a natural property, namely, that the correspondence graph of a symmetric verification M is strongly connected by finite paths along which the preferences are consistent with the preferences at the endpoints, and prove that this property is sufficient for the equivalence of truthfulness and M-truthfulness. In fact, defining appropriate versions of this property, we obtain this result for deterministic and randomized mechanisms with and without money. Moreover, we show that a slightly relaxed version of this property is also necessary for the equivalence of truthfulness and M-truthfulness. Our conditions provide a generic and convenient way of checking whether truthful …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Hardness results and efficient approximations for frequency assignment problems: Radio labelling and radio coloring",
            "Publication year": 2001,
            "Publication url": "http://www.cai2.sk/ojs/index.php/cai/article/view/514",
            "Abstract": "The Frequency Assignment Problem (FAP) in radio networks is the problem of assigning frequencies to transmitters, exploiting frequency reuse while keeping signal interference to acceptable levels. The FAP is usually modeled by variations of graph coloring. In this work we first survey the variations of the FAP and then we study two (similar but still different) frequency assignment problems: radio labelling and radiocoloring. For radio labelling, we prove that the problem is NP-complete for general graphs and we provide efficient NC approximation algorithms. We also give a polynomial time algorithm computing an optimal radio labelling for planar graphs, thus showing that radio labelling is in P for planar graphs. On the other hand, we prove that radiocoloring remains NP-complete even for planar graphs and we provide an efficient 2-ratio approximation algorithm. We also present a fully polynomial randomized …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:aqlVkmm33-oC",
            "Publisher": "Slovak Academy of Sciences"
        },
        {
            "Title": "Dimensionality, Coordination, and Robustness in Voting",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2109.02184",
            "Abstract": "We study the performance of voting mechanisms from a utilitarian standpoint, under the recently introduced framework of metric-distortion, offering new insights along three main lines. First, if  represents the doubling dimension of the metric space, we show that the distortion of STV is , where  represents the number of candidates. For doubling metrics this implies an exponential improvement over the lower bound for general metrics, and as a special case it effectively answers a question left open by Skowron and Elkind (AAAI '17) regarding the distortion of STV under low-dimensional Euclidean spaces. More broadly, this constitutes the first nexus between the performance of any voting rule and the \"intrinsic dimensionality\" of the underlying metric space. We also establish a nearly-matching lower bound, refining the construction of Skowron and Elkind. Moreover, motivated by the efficiency of STV, we investigate whether natural learning rules can lead to low-distortion outcomes. Specifically, we introduce simple, deterministic and decentralized exploration/exploitation dynamics, and we show that they converge to a candidate with  distortion. Finally, driven by applications in facility location games, we consider several refinements and extensions of the standard metric-setting. Namely, we prove that the deterministic mechanism recently introduced by Gkatzelis, Halpern, and Shah (FOCS '20) attains the optimal distortion bound of  under ultra-metrics, while it also comes close to our lower bound under distances satisfying approximate triangle inequalities.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stathis Zachos at 70!",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-57586-5_39",
            "Abstract": "This year we are celebrating the 70th birthday of Stathis! We take this chance to recall some of his remarkable contributions to Computer Science.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Winner-imposing strategyproof mechanisms for multiple facility location games",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-17572-5_19",
            "Abstract": "We study Facility Location games, where a number of facilities are placed in a metric space based on locations reported by strategic agents. A mechanism maps the agents’ locations to a set of facilities. The agents seek to minimize their connection cost, namely the distance of their true location to the nearest facility, and may misreport their location. We are interested in mechanisms that are strategyproof, i.e., ensure that no agent can benefit from misreporting her location, do not resort to monetary transfers, and approximate the optimal social cost. We focus on the closely related problems of k-Facility Location and Facility Location with a uniform facility opening cost, and mostly study winner-imposing mechanisms, which allocate facilities to the agents and require that each agent allocated a facility should connect to it. We show that the winner-imposing version of the Proportional Mechanism (Lu et al., EC ’10 …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Selfish unsplittable flows",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397505005347",
            "Abstract": "What is the price of anarchy when unsplittable demands are routed selfishly in general networks with load-dependent edge delays? Motivated by this question we generalize the model of Koutsoupias and Papadimitriou (Worst-case equilibria, in: Proc. of the 16th Annual Symp. on Theoretical Aspects of Computer Science (STACS’99), Lecture Notes in Computer Science, Vol. 1563, Springer, Berlin, 1999, pp. 404–413) to the case of weighted congestion games. We show that varying demands of users crucially affect the nature of these games, which are no longer isomorphic to exact potential games, even for very simple instances. Indeed we construct examples where even a single-commodity (weighted) network congestion game may have no pure Nash equilibrium. On the other hand, we prove that any weighted network congestion game with linear edge delays admits a pure Nash equilibrium that can be found in …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Atomic congestion games: Fast, myopic and concurrent",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-009-9198-2",
            "Abstract": "We study here the effect of concurrent greedy moves of players in atomic congestion games where n selfish agents (players) wish to select a resource each (out of m resources) so that her selfish delay there is not much. The problem of “maintaining” global progress while allowing concurrent play is exactly what is examined and answered here. We examine two orthogonal settings: (i) A game where the players decide their moves without global information, each acting “freely” by sampling resources randomly and locally deciding to migrate (if the new resource is better) via a random experiment. Here, the resources can have quite arbitrary latency that is load dependent. (ii) An “organised” setting where the players are pre-partitioned into selfish groups (coalitions) and where each coalition does an improving coalitional move. Our work considers concurrent selfish play for arbitrary latencies for the first time …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Metric-Distortion Bounds under Limited Information",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-85947-3_20",
            "Abstract": "In this work we study the metric distortion problem in voting theory under a limited amount of ordinal information. Our primary contribution is threefold. First, we consider mechanisms which perform a sequence of pairwise comparisons between candidates. We show that a widely-popular deterministic mechanism employed in most knockout phases yields distortion  while eliciting only  out of  possible pairwise comparisons, where m represents the number of candidates. We also provide a matching lower bound on its distortion. In contrast, any mechanism which performs fewer than  pairwise comparisons has unbounded distortion. Moreover, we study the power of deterministic mechanisms under incomplete rankings. Most notably, when every agent provides her k-top preferences we show an upper bound of  on the distortion, for any , substantially improving over the previous …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solving Inverse Problems for Spectral Energy Distributions with Deep Generative Networks",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2012.06331",
            "Abstract": "We propose an end-to-end approach for solving inverse problems for a class of complex astronomical signals, namely Spectral Energy Distributions (SEDs). Our goal is to reconstruct such signals from scarce and/or unreliable measurements. We achieve that by leveraging a learned structural prior in the form of a Deep Generative Network. Similar methods have been tested almost exclusively for images which display useful properties (e.g., locality, periodicity) that are implicitly exploited. However, SEDs lack such properties which make the problem more challenging. We manage to successfully extend the methods to SEDs using a Generative Latent Optimization model trained with significantly fewer and corrupted data.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the hardness of network design for bottleneck routing games",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397513008797",
            "Abstract": "In routing games, the selfish behavior of the players may lead to a degradation of the network performance at equilibrium. In more than a few cases however, the equilibrium performance can be significantly improved if we remove some edges from the network. This counterintuitive fact, widely known as Braessʼs paradox, gives rise to the (selfish) network design problem, where we seek to recognize routing games suffering from the paradox, and to improve their equilibrium performance by edge removal. In this work, we investigate the computational complexity and the approximability of the network design problem for non-atomic bottleneck routing games, where the individual cost of each player is the bottleneck cost of her path, and the social cost is the bottleneck cost of the network, ie the maximum latency of a used edge. We first show that bottleneck routing games do not suffer from Braessʼs paradox either if …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Conference Program Design with Single-Peaked and Single-Crossing Preferences",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-662-54110-4_16.pdf",
            "Abstract": "We consider the Conference Program Design (CPD) problem, a multi-round generalization of (the maximization versions of) q-Facility Location and the Chamberlin-Courant multi-winner election, introduced by (Caragiannis, Gourvès and Monnot, IJCAI 2016). CPD asks for the selection of kq items and their assignment to k disjoint sets of size q each. The agents receive utility only from their best item in each set and we want to maximize the total utility derived by all agents from all sets. Given that CPD is -hard for general utilities, we focus on utility functions that are either single-peaked or single-crossing. For general single-peaked utilities, we show that CPD is solvable in polynomial time and that Percentile Mechanisms are truthful. If the agent utilities are given by distances in the unit interval, we show that a Percentile Mechanism achieves an approximation ratio 1 / 3, if , and at least , for any …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Efficient Online Learning of Optimal Rankings: Dimensionality Reduction via Gradient Descent",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2011.02817",
            "Abstract": "We consider a natural model of online preference aggregation, where sets of preferred items  along with a demand for  items in each , appear online. Without prior knowledge of , the learner maintains a ranking  aiming that at least  items from  appear high in . This is a fundamental problem in preference aggregation with applications to, e.g., ordering product or news items in web pages based on user scrolling and click patterns. The widely studied Generalized Min-Sum-Set-Cover (GMSSC) problem serves as a formal model for the setting above. GMSSC is NP-hard and the standard application of no-regret online learning algorithms is computationally inefficient, because they operate in the space of rankings. In this work, we show how to achieve low regret for GMSSC in polynomial-time. We employ dimensionality reduction from rankings to the space of doubly stochastic matrices, where we apply Online Gradient Descent. A key step is to show how subgradients can be computed efficiently, by solving the dual of a configuration LP. Using oblivious deterministic and randomized rounding schemes, we map doubly stochastic matrices back to rankings with a small loss in the GMSSC objective.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving Selfish Routing for Risk-Averse Players",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-019-09946-8",
            "Abstract": "We investigate how and to which extent one can exploit risk-aversion and modify the perceived cost of the players in selfish routing so that the Price of Anarchy (PoA) wrt. the total latency is improved. The starting point is to introduce some small random perturbations to the edge latencies so that the expected latency does not change, but the perceived cost of the players increases, due to risk-aversion. We adopt the simple model of γ-modifiable routing games, a variant of selfish routing games with restricted tolls. We prove that computing the best γ-enforceable flow is NP-hard for parallel-link networks with affine latencies and two classes of heterogeneous risk-averse players. On the positive side, we show that for parallel-link networks with heterogeneous players and for series-parallel networks with homogeneous players, there exists a nicely structured γ-enforceable flow whose PoA improves fast as γ increases …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "The Power of Verification for Greedy Mechanism Design",
            "Publication year": 2015,
            "Publication url": "https://www.jair.org/index.php/jair/article/view/11215",
            "Abstract": "Greedy algorithms are known to provide, in polynomial time, near optimal approximation guarantees for Combinatorial Auctions (CAs) with multidimensional bidders. It is known that truthful greedy-like mechanisms for CAs with multi-minded bidders do not achieve good approximation guarantees.In this work, we seek a deeper understanding of greedy mechanism design and investigate under which general assumptions, we can have efficient and truthful greedy mechanisms for CAs. Towards this goal, we use the framework of priority algorithms and weak and strong verification, where the bidders are not allowed to overbid on their winning set or on any subset of this set, respectively. We provide a complete characterization of the power of weak verification showing that it is sufficient and necessary for any greedy fixed priority algorithm to become truthful with the use of money or not, depending on the ordering of the bids. Moreover, we show that strong verification is sufficient and necessary to obtain a 2-approximate truthful mechanism with money, based on a known greedy algorithm, for the problem of submodular CAs in finite bidding domains. Our proof is based on an interesting structural analysis of the strongly connected components of the declaration graph.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:abG-DnoFyZgC",
            "Publisher": "International Foundation for Autonomous Agents and Multiagent Systems"
        },
        {
            "Title": "On Radiocoloring Hierarchically Specified Planar Graphs:                                                                                       -Completeness and Approximations",
            "Publication year": 2002,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.springer-d7a3f658-d376-39c5-b3df-0218755d3f94",
            "Abstract": "Hierarchical specifications of graphs have been widely used in many important applications, such as VLSI design, parallel programming and software engineering. A well known hierarchical specification model, considered in this work, is that of Lengauer [9, 10] referred to as L-specifications. In this paper we discuss a restriction on the L-specifications resulting to graphs which we call Well-Separated (WS). This class is characterized by a polynomial time (to the size of the specification of the graph) testable combinatorial property.        In this work we study the Radiocoloring Problem (RCP) on WS L-specified hierarchical planar graphs. The optimization version of RCP studied here, consists in assigning colors to the vertices of a graph, such that any two vertices of distance at most two get different colors. The objective here is to minimize the number of colors used. This problem is equivalent to the problem of vertex coloring the square of a graph G, G           2, where G           2 has the same vertex set as G and there is an edge between any two vertices of G           2 if their distance in G is at most 2.        We first show that RCP is       -complete for WS L-specified hierarchical planar graphs. Second, we present a polynomial time 3-approximation algorithm as well as a more efficient 4-approximation algorithm for RCP on graphs of this class.        We note that, the best currently known approximation ratio for the RCP on ordinary (non-hierarchical) planar graphs of general degree is 2 ([6, 1]). Note also that the only known results on any kind of coloring problems have been shown for another special kind of hierarchical graphs (unit disk graphs …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithmic Game Theory: 12th International Symposium, SAGT 2019, Athens, Greece, September 30–October 3, 2019, Proceedings",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3NyvDwAAQBAJ&oi=fnd&pg=PP6&dq=info:MqYTdQr8Bb4J:scholar.google.com&ots=0riDIPxI54&sig=w_gdrnptG2ztTVEBi-ufuZosaCo",
            "Abstract": "This book constitutes the refereed proceedings of the 12th International Symposium on Algorithmic Game Theory, SAGT 2019, held in Athens, Greece, in September/October 2019. The 25 full papers presented together with 3 invited talks and one abstract paper were carefully reviewed and selected from 55 submissions. The papers are organized in topical sections named: Algorithmic Mechanism Design; Auctions and Markets; Computational Aspects of Games; Network Games and Congestion Games; Social Choice; and Matchings and Fair Division.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:XiVPGOgt02cC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Hardness Results and Efficient Appromixations for Frequency Assignment Problems and the Radio Coloring Problem",
            "Publication year": 2001,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/26108",
            "Abstract": "Hardness Results and Efficient Appromixations for Frequency Assignment Problems and the \nRadio Coloring Problem Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο \n→ Δημοσιεύσεις μελών ΔΕΠσε περιοδικά → Εμφάνιση Τεκμηρίου HEAL DSpace Hardness \nResults and Efficient Appromixations for Frequency Assignment Problems and the Radio \nColoring Problem Αποθετήριο DSpace/Manakin Hardness Results and Efficient Appromixations \nfor Frequency Assignment Problems and the Radio Coloring Problem Fotakis, D; Nikoletseas, \nS; Papadopoulou, V; Spirakis, P URI: http://hdl.handle.net/123456789/26108 Ημερομηνία: 2001 \nΕμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή \nΔεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται \nστην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά Περιήγηση Σε όλο / …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Strategyproof facility location for concave cost functions",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-015-0026-6",
            "Abstract": "We consider k-Facility Location games, where n strategic agents report their locations on the real line and a mechanism maps them to k facilities. Each agent seeks to minimize his connection cost, given by a nonnegative increasing function of his distance to the nearest facility. Departing from previous work, that mostly considers the identity cost function, we are interested in mechanisms without payments that are (group) strategyproof for any given cost function, and achieve a good approximation ratio for the social cost and/or the maximum cost of the agents. We present a randomized mechanism, called Equal Cost, which is group strategyproof and achieves a bounded approximation ratio for all k and n, for any given concave cost function. The approximation ratio is at most 2 for Max Cost and at most n for Social Cost. To the best of our knowledge, this is the first mechanism with a bounded approximation ratio for …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "ACM"
        },
        {
            "Title": "Stackelberg strategies for atomic congestion games",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75520-3_28",
            "Abstract": "We investigate the effectiveness of Stackelberg strategies for atomic congestion games with unsplittable demands. In our setting, only a fraction of the players are selfish, while the rest are willing to follow a predetermined strategy. A Stackelberg strategy assigns the coordinated players to appropriately selected strategies trying to minimize the performance degradation due to the selfish players. We consider two orthogonal cases, namely linear congestion games with arbitrary strategies and congestion games on parallel links with arbitrary non-negative and non-decreasing latency functions. We restrict our attention to pure Nash equilibria and derive strong upper and lower bounds on the Price of Anarchy under different Stackelberg strategies.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Atomic congestion games among coalitions",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1383369.1383383",
            "Abstract": "We consider algorithmic questions concerning the existence, tractability, and quality of Nash equilibria, in atomic congestion games among users participating in selfish coalitions.We introduce a coalitional congestion model among atomic players and demonstrate many interesting similarities with the noncooperative case. For example, there exists a potential function proving the existence of pure Nash equilibria (PNE) in the unrelated parallel links setting; in the network setting, the finite improvement property collapses as soon as we depart from linear delays, but there is an exact potential (and thus PNE) for linear delays. The price of anarchy on identical parallel links demonstrates a quite surprising threshold behavior: It persists on being asymptotically equal to that in the case of the noncooperative KP-model, unless the number of coalitions is sublogarithmic.We also show crucial differences, mainly concerning …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:LkGwnXOMwfcC",
            "Publisher": "ACM"
        },
        {
            "Title": "Space efficient hash tables with worst case constant access time",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-004-1195-x",
            "Abstract": " We generalize Cuckoo Hashing  to d-ary Cuckoo Hashing and show how this yields a simple hash table data structure that stores n elements in (1 + ε)n memory cells, for any constant ε >  0. Assuming uniform hashing, accessing or deleting table entries takes at most d=O (ln (1/ε)) probes and the expected amortized insertion time is constant. This is the first dictionary that has worst case constant access time and expected constant update time, works with (1 + ε)n space, and supports satellite information. Experiments indicate that d = 4 probes suffice for ε ≈ 0.03. We also describe variants of the data structure that allow the use of hash functions that can be evaluated in constant time. ",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Online sum-radii clustering",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-32589-2_36",
            "Abstract": "In Online Sum-Radii Clustering, n demand points arrive online and must be irrevocably assigned to a cluster upon arrival. The cost of each cluster is the sum of a fixed opening cost and its radius, and the objective is to minimize the total cost of the clusters opened by the algorithm. We show that the deterministic competitive ratio of Online Sum-Radii Clustering for general metric spaces is Θ(logn), where the upper bound follows from a primal-dual online algorithm, and the lower bound is valid for ternary Hierarchically Well-Separated Trees (HSTs) and for the Euclidean plane. Combined with the results of (Csirik et al., MFCS 2010), this result demonstrates that the deterministic competitive ratio of Online Sum-Radii Clustering changes abruptly, from constant to logarithmic, when we move from the line to the plane. We also show that Online Sum-Radii Clustering in HSTs is closely related to the Parking Permit …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "An Advanced Hierarchical algorithm for protein complex prediction",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5687616/",
            "Abstract": "High throughput experimental methods which detect protein-protein interactions have generated large datasets offering a first estimation and representation of an organism's protein interaction network. However, there is still lack of information concerning protein complexes, although many automated methods have been applied to this problem. In this paper, a new hierarchical clustering algorithm, called Advanced Hierarchical Clustering (AHC) algorithm, is proposed which detects protein complexes with high predictive ratio. The main advantage of our algorithm is the accuracy of prediction of the protein complexes from the initial protein interaction graphs. We present experimental results using 7 experimental datasets and compare them with those derived from other existing algorithms (such as Mcode, HCS, RNSC and SideS), to demonstrate the efficiency of the AHC regarding successful prediction ratio of protein …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient Online Learning for Dynamic k-Clustering",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2106.04336",
            "Abstract": "We study dynamic clustering problems from the perspective of online learning. We consider an online learning problem, called \\textit{Dynamic -Clustering}, in which  centers are maintained in a metric space over time (centers may change positions) such as a dynamically changing set of  clients is served in the best possible way. The connection cost at round  is given by the \\textit{-norm} of the vector consisting of the distance of each client to its closest center at round , for some  or . We present a \\textit{-regret} polynomial-time online learning algorithm and show that, under some well-established computational complexity conjectures, \\textit{constant-regret} cannot be achieved in polynomial-time. In addition to the efficient solution of Dynamic -Clustering, our work contributes to the long line of research on combinatorial online learning.",
            "Abstract entirety": 1,
            "Author pub id": "zFDLf0UAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving Selfish Routing for Risk-Averse Players",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-48995-6_24",
            "Abstract": "We investigate how and to which extent one can exploit risk-aversion and modify the perceived cost of the players in selfish routing so that the Price of Anarchy () is improved. We introduce small random perturbations to the edge latencies so that the expected latency does not change, but the perceived cost of the players increases due to risk-aversion. We adopt the model of -modifiable routing games, a variant of routing games with restricted tolls. We prove that computing the best -enforceable flow is -hard for parallel-link networks with affine latencies and two classes of heterogeneous risk-averse players. On the positive side, we show that for parallel-link networks with heterogeneous players and for series-parallel networks with homogeneous players, there exists a nicely structured -enforceable flow whose  improves fast as  increases. We show that the complexity of computing such a -enforceable flow …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Atomic congestion games: Fast, myopic and concurrent",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-79309-0_12",
            "Abstract": "We study here the effect of concurrent greedy moves of players in atomic congestion games where n selfish agents (players) wish to select a resource each (out of m resources) so that her selfish delay there is not much. The problem of “maintaining” global progress while allowing concurrent play is exactly what is examined and answered here. We examine two orthogonal settings : (i) A game where the players decide their moves without global information, each acting “freely” by sampling resources randomly and locally deciding to migrate (if the new resource is better) via a random experiment. Here, the resources can have quite arbitrary latency that is load dependent. (ii) An “organised” setting where the players are pre-partitioned into selfish groups (coalitions) and where each coalition does an improving coalitional move. Our work considers concurrent selfish play for arbitrary latencies for the first time …",
            "Abstract entirety": 0,
            "Author pub id": "zFDLf0UAAAAJ:Se3iqnhoufwC",
            "Publisher": "Springer Berlin/Heidelberg"
        }
    ]
}]