[{
    "name": "Ειρήνη Ντούτση",
    "romanize name": "Eirini Ntoutsi",
    "School-Department": "Faculty of Electrical Engineering and Computer Science",
    "University": "Leibniz University Hannover, Germany",
    "Rank": "Αναπληρωτής καθηγητής",
    "Apella_id": 27772,
    "Scholar name": "Eirini Ntoutsi",
    "Scholar id": "RdA9uxYAAAAJ",
    "Affiliation": "Freie Universität Berlin",
    "Citedby": 2473,
    "Interests": [
        "Machine Learning",
        "Data Stream Mining",
        "Fairness-aware learning",
        "Artificial Intelligence",
        "Responsible AI"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=RdA9uxYAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "The Notion of Similarity in Data and Pattern Spaces.",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.73.3888&rep=rep1&type=pdf",
            "Abstract": "In the recent years, our ability of collecting information rapidly increases and huge databases that change over time in a high frequency have been developed. On the other hand, the data mining techniques used for extracting essential information from raw data are rather complex, thus not synchronized to underlying data changes. There is a need of detecting whether synchronization operations should take place so as to rescue resources. Motivated from the above problem, we introduce the notion of similarity in data and pattern space and examine their relationship.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fast group recommendations by applying user clustering",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34002-4_10",
            "Abstract": "Recommendation systems have received significant attention, with most of the proposed methods focusing on personal recommendations. However, there are contexts in which the items to be suggested are not intended for a single user but for a group of people. For example, assume a group of friends or a family that is planning to watch a movie or visit a restaurant. In this paper, we propose an extensive model for group recommendations that exploits recommendations for items that similar users to the group members liked in the past. We do not exhaustively search for similar users in the whole user base, but we pre-partition users into clusters of similar ones and use the cluster members for recommendations. We efficiently aggregate the single user recommendations into group recommendations by leveraging the power of a top-k algorithm. We evaluate our approach in a real dataset of movie ratings.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:dhFuZR0502QC",
            "Publisher": "ER"
        },
        {
            "Title": "Enriching lexicons with ephemeral words for sentiment analysis in social streams",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3227609.3227664",
            "Abstract": "Lexical approaches for sentiment analysis like SentiWordNet rely upon a fixed dictionary of words with fixed sentiment, ie, sentiment that does not change. With the rise of Web 2.0 however, what we observe more and more often is that words that are not sentimental per se, are often associated with positive/negative feelings, for example,\" refugees\",\" Trump\",\" iphone\". Typically, those feelings are temporary as responses to external events; for example,\" iphone\" sentiment upon latest iphone version release or\" Trump\" sentiment after USA withdraw from Paris climate agreement.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:Vr2j17o0sqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scalable online-offline stream clustering in apache spark",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7836645/",
            "Abstract": "Two of the most popular approaches for dealing with big data are distributed computing and stream mining. In this paper, we incorporate both approaches in order to bring a competitive stream clustering algorithm, namely CluStream, into a modern framework for distributed computing, namely, Apache Spark. CluStream is one of the most popular clustering approaches for stream clustering and the one that introduced the online-offline mining process: the online phase summarizes the stream through statistical summaries and the offline phase generates the final clusters upon these summaries. We obtain a scalable stream clustering method which is open source and can be used by the Apache Spark community. Our experiments show that our adaptation, our achieves similar quality to the original approach, while it is more efficient.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:AZju0d2GQJ0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Opinion Stream Mining.",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=12653494231937478319&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:ji7lAbPyDbYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Traffic mining in a road-network: How does the traffic flow?",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJBIDM.2008.017977",
            "Abstract": "The flow of data coming from modern sensing devices enables the development of novel research techniques related to data management and knowledge extraction. In this work, we undertake the problem of analysing traffic in a road network so as to help the city authorities to optimise traffic flow. A graph based modelling of the network traffic is presented which provides insights on the flow of movements within the network. We exploit this graph in order to analyse the traffic flow in the network and to discover traffic relationships like propagation, split and merge of traffic among the road segments. First experimental results illustrate the applicability and usefulness of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Web Futures: Inclusive, Intelligent, Sustainable The 2020 Manifesto for Web Science",
            "Publication year": 2021,
            "Publication url": "https://hal.inria.fr/hal-03189474/",
            "Abstract": "This Manifesto was produced from the Perspectives Workshop 18262 entitled \"10 Years of Web Science\" that took place at Schloss Dagstuhl from June 24-29, 2018. At the Workshop, we revisited the origins of Web Science, explored the challenges and opportunities of the Web, and looked ahead to potential futures for both the Web and Web Science. We explain issues that society faces in the Web by the ambivalences that are inherent in the Web. All the enormous benefits that the Web offers-for information sharing, collective organization and distributed activity, social inclusion and economic growth-will always carry along negative consequences, too, and 30 years after its creation negative consequences of the Web are only too apparent. The Web continues to evolve and its next major step will involve Artificial Intelligence (AI) at large. AI has the potential to amplify positive and negative outcomes, and we explore these possibilities, situating them within the wider debate about the future of regulation and governance for the Web. Finally, we outline the need to extend Web Science as the science that is devoted to the analysis and engineering of the Web, to strengthen our role in shaping the future of the Web and present five key directions for capacity building that are necessary to achieve this: (i), supporting interdisciplinarity, (ii), supporting collaboration, (iii), supporting the sustainable Web, (iv), supporting the Intelligent Web, and (v), supporting the Inclusive Web. Our writing reflects our background in several disciplines of the social and technical sciences and that these disciplines emphasize topics to various extents. We are acutely aware that …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:xGWFX6Gbr9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey on datasets for fairness-aware machine learning",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.00530",
            "Abstract": "As decision-making increasingly relies on machine learning and (big) data, the issue of fairness in data-driven AI systems is receiving increasing attention from both research and industry. A large variety of fairness-aware machine learning solutions have been proposed which propose fairness-related interventions in the data, learning algorithms and/or model outputs. However, a vital part of proposing new approaches is evaluating them empirically on benchmark datasets that represent realistic and diverse settings. Therefore, in this paper, we overview real-world datasets used for fairness-aware machine learning. We focus on tabular data as the most common data representation for fairness-aware machine learning. We start our analysis by identifying relationships among the different attributes, particularly w.r.t. protected attributes and class attributes, using a Bayesian network. For a deeper understanding of bias and fairness in the datasets, we investigate the interesting relationships using exploratory analysis.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:J3LtWjKFLicC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobility, data mining and privacy: Geographic knowledge discovery",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ClK0YSZ3iAQC&oi=fnd&pg=PA1&dq=info:NM1kNic7gdYJ:scholar.google.com&ots=YR62uWWC5r&sig=VRxiNnxfHfEIP1Xs3Qxo7w1IMk4",
            "Abstract": "The technologies of mobile communications and ubiquitous computing are p-vading our society. Wireless networks are becoming the nerves of our territory, especially in the urban setting; through these nerves, the movement of people and vehicles may be sensed and possibly recorded, thus producing large volumes of mobility data. This is a scenario of great opportunities and risks. On one side, data mining can be put to work to analyse these data, with the purpose of producing useful knowledge in support of sustainable mobility and intelligent transportation systems. On the other side, individual privacy is at risk, as the mobility data may reveal, if misused, highly sensitive personal information. In a nutshell, a novel multi-disciplinary research area is emerging within this challenging con? ict of opportunities and risks and at the crossroads of three s-jects: mobility, data mining and privacy. This book is aimed at shaping up this frontier of research, from a computer science perspective: we investigate the v-ious scienti? c and technologicalachievementsthat are needed to face the challenge, anddiscussthecurrentstate oftheart, theopenproblemsandtheexpectedroad-map of research. Hence, this is a book for researchers:? rst of all for computer science researchers, from any sub-area of the? eld, and also for researchers from other disciplines (such as geography, statistics, social sciences, law, telecommunication and transportation engineering) who are willing to engage in a multi-disciplinary research area with potential for broad social and economic impact.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Monitoring user evolution in twitter",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6425633/",
            "Abstract": "Nowadays social media are widely used for the broadcasting of different types of information, such as events, activities and opinions. Analyzing this vast amount of data for extracting models that describe individual users or groups of users has gained a lot of attention lately. In this work we analyze individual users and monitor changes in their published content over time. We propose a topic-based user profiling and monitoring approach for change detection and monitoring of profile evolution. Our method is capable of detecting persistent topics representing long term interests of the user as well as short term topics that refer to everyday events or reactions to the news. We evaluate our approach on real data from Twitter.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Summarizing cluster evolution in dynamic environments",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21887-3_43",
            "Abstract": "Monitoring and interpretation of changing patterns is a task of paramount importance for data mining applications in dynamic environments. While there is much research in adapting patterns in the presence of drift or shift, there is less research on how to maintain an overview of pattern changes over time. A major challenge lays in summarizing changes in an effective way, so that the nature of change can be understood by the user, while the demand on resources remains low. To this end, we propose FINGERPRINT, an environment for the summarization of cluster evolution. Cluster changes are captured into an “evolution graph”, which is then summarized based on cluster similarity into a fingerprint of evolution by merging similar clusters. We propose a batch summarization method that traverses and summarizes the Evolution Graph as a whole, and an incremental method that is applied during the process …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Evaluation and experimental design in data mining and machine learning: Motivation and summary of EDML 2019",
            "Publication year": 2019,
            "Publication url": "https://www.repo.uni-hannover.de/bitstream/handle/123456789/9883/Publishing%20at%20CEUR-WS%20CC-Lizenz.pdf?sequence=2",
            "Abstract": "The copyright and any similar right for the proceedings and all included material remain with the papers' authors (for the individual papers) and with the proceedings editors (for the proceedings volume as a whole). The publisher of proceedings volumes at CEUR-WS. org are the respective editors. Users are allowed to access and read papers and proceedings published via CEUR-WS. org. Fair use is allowed for private and academic purposes. If work results are derived from papers published via CEUR-WS. org, then the derived work must include proper attribution/citation of the original paper. Fair use includes the right to store the paper on personal devices, and to print the paper for private and academic use. Re-publication of material published at CEUR-WS. org requires the permission by the copyright holders, ie to the paper's authors or the volume editors, or both. CEUR-WS. org provides published proceedings and papers as' open access'. CEUR-WS. org employs no access control.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:9NZAP19TdFAC",
            "Publisher": "Aachen: RWTH"
        },
        {
            "Title": "A neighborhood-augmented LSTM model for taxi-passenger demand prediction",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-38081-6_8",
            "Abstract": "Taxi is a convenient means of transportation worldwide. Accurately predicting the taxi-demand is crucial for taxi-companies to effectively allocate their fleet to taxi-stands and reduce the waiting time for passengers thus increasing their overall satisfaction and customer retention. Nowadays precise information about taxi-rides is available and can be used to infer the taxi-passenger demand across different locations and time-points. In this paper, we propose an approach for predicting the pick-demand of a given taxi-stand, that takes into account not only the demand-history of the particular stand but it also considers information from neighboring stands. Our model is an LSTM neural network augmented with information from the spatial neighborhood of the stands. Experiments with two versions of the taxi demand dataset from the city of Porto, Portugal show that our approach can provide better predictions comparing to …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:L24QuVWYgZ0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Consequence-aware Sequential Counterfactual Generation",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.05592",
            "Abstract": "Counterfactuals have become a popular technique nowadays for interacting with black-box machine learning models and understanding how to change a particular instance to obtain a desired outcome from the model. However, most existing approaches assume instant materialization of these changes, ignoring that they may require effort and a specific order of application. Recently, methods have been proposed that also consider the order in which actions are applied, leading to the so-called sequential counterfactual generation problem. In this work, we propose a model-agnostic method for sequential counterfactual generation. We formulate the task as a multi-objective optimization problem and present an evolutionary approach to find optimal sequences of actions leading to the counterfactuals. Our cost model considers not only the direct effect of an action, but also its consequences. Experimental results show that compared to state of the art, our approach generates less costly solutions, is more efficient, and provides the user with a diverse set of solutions to choose from.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:ifOnle78iJkC",
            "Publisher": "Unknown"
        },
        {
            "Title": " - Online Fairness-Aware Learning Under Class Imbalance",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-61527-7_11",
            "Abstract": "Data-driven algorithms are employed in many applications, in which data become available in a sequential order, forcing the update of the model with new instances. In such dynamic environments, in which the underlying data distributions might evolve with time, fairness-aware learning cannot be considered as a one-off requirement, but rather it should comprise a continual requirement over the stream. Recent fairness-aware stream classifiers ignore the problem of class distribution skewness. As a result, such methods mitigate discrimination by “rejecting” minority instances at large due to their inability to effectively learn all classes. In this work, we propose , an online fairness-aware approach that maintains a valid and fair classifier over a stream.  is an online boosting approach that changes the training distribution in an online fashion based on both stream imbalance and discriminatory …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:wyM6WWKXmoIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Monitoring patterns through an integrated management and mining tool",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87481-2_46",
            "Abstract": "Patterns upon the data of many real applications are affected by changes in these data. We employ Pattern-Miner tool to detect changes of clusterings extracted from dynamic data and thus, to provide insight on the dataset and to support strategic decisions. Pattern-Miner, is an integrated environment for pattern (data mining model) management and mining that deals with the whole lifecycle of patterns, from their generation (using data mining techniques) to their storage and querying, putting also emphasis on the comparison between patterns and meta-mining operations over the extracted patterns. In the current version, Pattern-Miner integrates also an algorithm and technique for monitoring patterns (currently clusters) over time.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "GMMbuilder–user-driven discovery of clustering structure for bioarchaeology",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-46131-1_2",
            "Abstract": "We present GMMbuilder, a tool that allows domain scientists to build Gaussian Mixture Models (GMM) that adhere to domain specific constraints like spatial coherence. Domain experts use this tool to generate different models, extract stable object communities across these models, and use these communities to interactively design a final clustering model that explains the data but also considers prior beliefs and expectations of the domain experts.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:wSy_KLzO7YEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Data mining for isotopic mapping of bioarchaeological finds in a central european alpine passage",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2791347.2791357",
            "Abstract": "Isotopic mapping has become an indispensable tool for the assessment of mobility and trade of the past. However, modeling and understanding spatio-temporal isotopic variation is complicated by the small number of available samples, potential mobility of the investigated samples, sample preservation quality, uncertainty of measurements, and so forth. In this work, we use data mining techniques to build an isotopic map (descriptive modeling) and to determine the spatial origin of new samples (predictive modeling). In particular, we propose a clustering-based isotope ratio model and a scoring function for the origin prediction of new samples. Our data was extracted from real animal finds from an Alpine passage that spans three countries (Germany, Austria, and Italy) and comprises a high variety of isotopes and geological characteristics. Our results and evaluation by domain experts show that it is possible to …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:dAp6zn-oMfAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Clustering high dimensional data: Examining differences and commonalities between subspace clustering and text clustering-A position paper",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2641190.2641192",
            "Abstract": "The goal of this position paper is to contribute to a clear understanding of the commonalities and differences between subspace clustering and text clustering. Often text data is foisted as an ideal fit for subspace clustering due to its high dimensional nature and sparsity of the data. Indeed, the areas of subspace clustering and text clustering share similar challenges and the same goal, the simultaneous extraction of both clusters and the dimensions where these clusters are defined. However, there are fundamental differences between the two areas w.r.t object feature representation, dimension weighting and incorporation of these weights in the dissimilarity computation. We make an attempt to bridge these two domains in order to facilitate the exchange of ideas and best practices between them.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:jtI9f0ekYq0C",
            "Publisher": "ACM"
        },
        {
            "Title": "Drift-Aware Multi-Memory Model for Imbalanced Data Streams",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9378101/",
            "Abstract": "Online class imbalance learning deals with data streams that are affected by both concept drift and class imbalance. Online learning tries to find a trade-off between exploiting previously learned information and incorporating new information into the model. This requires both the incremental update of the model and the ability to unlearn outdated information. The improper use of unlearning, however, can lead to the retroactive interference problem, a phenomenon that occurs when newly learned information interferes with the old information and impedes the recall of previously learned information. The problem becomes more severe when the classes are not equally represented, resulting in the removal of minority information from the model. In this work, we propose the Drift-Aware Multi-Memory Model (DAM3), which addresses the class imbalance problem in online learning for memory-based models. DAM3 …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:WWeOtg8bX_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tweetskb: A public and large-scale rdf corpus of annotated tweets",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-93417-4_12",
            "Abstract": "Publicly available social media archives facilitate research in a variety of fields, such as data science, sociology or the digital humanities, where Twitter has emerged as one of the most prominent sources. However, obtaining, archiving and annotating large amounts of tweets is costly. In this paper, we describe TweetsKB, a publicly available corpus of currently more than 1.5 billion tweets, spanning almost 5 years (Jan’13–Nov’17). Metadata information about the tweets as well as extracted entities, hashtags, user mentions and sentiment information are exposed using established RDF/S vocabularies. Next to a description of the extraction and annotation process, we present use cases to illustrate scenarios for entity-centric information exploration, data integration and knowledge discovery facilitated by TweetsKB.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:hNSvKAmkeYkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Networking in bioarchaeology: the example of the DFG Research group FOR 1670 transalpine mobility and culture transfer",
            "Publication year": 2015,
            "Publication url": "https://opus.bibliothek.uni-augsburg.de/opus4/frontdoor/index/index/docId/71487",
            "Abstract": "OPUS 4 | Networking in bioarchaeology: the example of the DFG Research group FOR 1670 \ntransalpine mobility and culture transfer&quot; Deutsch Login Open Access Home Search \nBrowse Publish/report a document Help Networking in bioarchaeology: the example of the DFG \nResearch group FOR 1670 transalpine mobility and culture transfer\" Martin Grünewald, Gisela \nGrupe, Markus Gschwind, Stefan Hölzl, Balazs Kocsis, Peer Kröger, Amei Lang, Markus \nMauder, Christoph Mayr, George C. McGlynn, Carola Metzner-Nebelsick, Eirini Ntoutsi, Joris \nPeters, Matthias Renz, Simone Reuß, Wolfgang W. Schmahl, Frank Söllner, C. Sebastian \nSommer, Bernd Steidl, Anita Toncala, Simon Trixl, Dominika Wycisk Export metadata BibTeX \nRIS Statistics Number of document requests Additional Services Share in Twitter Search Google \nScholar Metadaten Author: Martin GrünewaldGND, Gisela Grupe, Markus Gschwind, Hölzl…",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:I8rxH6phXEkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Faht: an adaptive fairness-aware decision tree classifier",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1907.07237",
            "Abstract": "Automated data-driven decision-making systems are ubiquitous across a wide spread of online as well as offline services. These systems, depend on sophisticated learning algorithms and available data, to optimize the service function for decision support assistance. However, there is a growing concern about the accountability and fairness of the employed models by the fact that often the available historic data is intrinsically discriminatory, i.e., the proportion of members sharing one or more sensitive attributes is higher than the proportion in the population as a whole when receiving positive classification, which leads to a lack of fairness in decision support system. A number of fairness-aware learning methods have been proposed to handle this concern. However, these methods tackle fairness as a static problem and do not take the evolution of the underlying stream population into consideration. In this paper, we introduce a learning mechanism to design a fair classifier for online stream based decision-making. Our learning model, FAHT (Fairness-Aware Hoeffding Tree), is an extension of the well-known Hoeffding Tree algorithm for decision tree induction over streams, that also accounts for fairness. Our experiments show that our algorithm is able to deal with discrimination in streaming environments, while maintaining a moderate predictive performance over the stream.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:FsLZdJ3BAzkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PBMS Querying and Storage Issues",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=783402061049263616&hl=en&oi=scholarr",
            "Abstract": "Motivated by a benchmark pattern base, we present a wish list of queries that should be supported by a Pattern-Base Management System (PBMS) and examine alternative approaches regarding the physical representation layer, namely the relational, the objectrelational, and the semi-structured data model. A primitive comparative study of their advantages and disadvantages follows.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:ufrVoPGSRksC",
            "Publisher": "PANDA Technical Report PANDA-TR-2004-02"
        },
        {
            "Title": "Density-based projected clustering over high dimensional data streams",
            "Publication year": 2012,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611972825.85",
            "Abstract": "Clustering of high dimensional data streams is an important problem in many application domains, a prominent example being network monitoring. Several approaches have been lately proposed for solving independently the different aspects of the problem. There exist methods for clustering over full dimensional streams and methods for finding clusters in subspaces of high dimensional static data. Yet only a few approaches have been proposed so far which tackle both the stream and the high dimensionality aspects of the problem simultaneously. In this work, we propose a new density-based projected clustering algorithm, HDDSTREAM, for high dimensional data streams. Our algorithm summarizes both the data points and the dimensions where these points are grouped together and maintains these summaries online, as new points arrive over time and old points expire due to ageing. Our experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:aqlVkmm33-oC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "The Notion of Patterns in Data Mining∗",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.502.7455",
            "Abstract": "Several heterogeneous pattern types are available nowadays as a result of the different goals that a mining task tries to accomplish and of the application of Data Mining techniques over different domains. In this chapter we overview three popular pattern types, namely frequent itemsets and association rules, clusters and clusterings, and decision trees. We also adopt a pattern representation schema based on both extensional and intensional description of patterns and describe how the different pattern types are expressed with respect to this schema. 1",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:yY3RG6sOEgwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "GeoPKDD Deliverable D. 1.1. Privacy-aware Trajectory Warehouse Alignment Report",
            "Publication year": 2006,
            "Publication url": "https://air.unimi.it/handle/2434/31296",
            "Abstract": "GeoPKDD Deliverable D.1.1. Privacy-aware Trajectory Warehouse Alignment Report IRIS \nnascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i \nprodotti per: Autore Titolo Riviste Serie Settore Scientifico Disciplinare Tipologia Login \nSUrplus Archivio Istituzionale della Ricerca Prodotti della ricerca 08 - Relazione interna o \nrapporto di ricerca GeoPKDD Deliverable D.1.1. Privacy-aware Trajectory Warehouse \nAlignment Report Italiano Italiano Italiano Italiano English English GeoPKDD Deliverable D.1.1. \nPrivacy-aware Trajectory Warehouse Alignment Report / ML Damiani, E. Frentzos, A. \nGkoulalas-Divanis, D. Gougoulas, B. Kuijpers, J.Macedo, G. Marketos, A. Mazzoni, I. Ntoutsi, \nW. Othman, N. Pelekis, S. Puntoni, C. Renso, E. Savas, S. Spaccapietra, Y. Theodoridis, C. \nVangenot, V. Verykios. - Pisa : CNR, 2006. …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:m92CDrhVnKEC",
            "Publisher": "CNR"
        },
        {
            "Title": "Fair-Capacitated Clustering",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.12116",
            "Abstract": "Traditionally, clustering algorithms focus on partitioning the data into groups of similar instances. The similarity objective, however, is not sufficient in applications where a fair-representation of the groups in terms of protected attributes like gender or race, is required for each cluster. Moreover, in many applications, to make the clusters useful for the end-user, a balanced cardinality among the clusters is required. Our motivation comes from the education domain where studies indicate that students might learn better in diverse student groups and of course groups of similar cardinality are more practical e.g., for group assignments.To this end, we introduce the fair-capacitated clustering problem that partitions the data into clusters of similar instances while ensuring cluster fairness and balancing cluster cardinalities. We propose a two-step solution to the problem: i) we rely on fairlets to generate minimal sets that satisfy the fair constraint and ii) we propose two approaches, namely hierarchical clustering and partitioning-based clustering, to obtain the fair-capacitated clustering. The hierarchical approach embeds the additional cardinality requirements during the merging step while the partitioning-based one alters the assignment step using a knapsack problem formulation to satisfy the additional requirements. Our experiments on four educational datasets show that our approaches deliver well-balanced clusters in terms of both fairness and cardinality while maintaining a good clustering quality.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:U0iAMwwPxtsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Working Group on Values",
            "Publication year": 2018,
            "Publication url": "https://lirias.kuleuven.be/retrieve/524553",
            "Abstract": "This working group focused on the values of the Web Scienc community which stem from and reflect the vision of the Web Science community in accordance with human rights. It is important to acknowledge the distinctive role of Web Science Community (as stated in previous documentation) in the promotion of social goals. Therefore, the values need to reflect this. In response to the call of Sir Tim Berners-Lee to fix the Web, it is now the time to design and develop a training process for web scientists’ reflectivity on ethical values. It is critical for Web Science to have/reflect on such values due to the huge impact of the Web in our society.The discussion in this working group was triggered by the following questions: What is the Web we want (what are our values to be reflected on the Web)? How do we position ourselves in ethical and societal debates? We cannot be neutral, we need to take a stance adopting the human rights. What is the role of the web scientist? How do we make these things explicit? How should the values and the training process of web scientists’ reflectivity on these values become part of a Web Science curriculum?",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:cBPnxVikjH8C",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik GmbH"
        },
        {
            "Title": "Sentiment analysis on big sparse data streams with limited labels",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-019-01392-9",
            "Abstract": "Sentiment analysis is an important task in order to gain insights over the huge amounts of opinionated texts generated on a daily basis in social media like Twitter. Despite its huge amount, standard supervised learning methods won’t work upon such sort of data due to lack of labels and the impracticality of (human) labeling at this scale. In this work, we leverage distant supervision and semi-supervised learning to annotate a big stream of tweets from 2015 which consists of 228 million tweets without retweets (and 275 million with retweets). We present the insights from our annotation process regarding the effect of different semi-supervised learning approaches, namely Self-Learning, Co-Training and Expectation–Maximization. Moreover, we propose two annotation modes, the batch mode where all labeled and unlabeled data are available to the algorithms from the beginning and a lightweight streaming mode that …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:7H_jS4BsgvYC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Exploiting entity information for stream classification over a stream of reviews",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3297280.3297333",
            "Abstract": "Opinion stream classification algorithms adapt the model to the arriving review texts and, depending on the forgetting scheme, reduce the contribution old reviews have upon the model. Reviews are assumed independent, and information on the entity to which a review refers, ie to the opinion target, is thereby ignored. This implies that the prediction of a review's label is based more on reviews referring to other, more popular or simply more recently inspected entities, while reviews referring to the same entity might be ignored as too old. In this study, we enforce that the reviews to each entity are taken into account for learning, adaption and forgetting.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:Azgs6IHzeyYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cluster-based contextual recommendations",
            "Publication year": 2016,
            "Publication url": "https://kbs.uni-hannover.de/~ntoutsi/papers/16.EDBT.pdf",
            "Abstract": "In this work, we address the problem of contextual recommendations by exploiting the concept of subspace clustering. Specifically, we pre-partition users that have rated subsets of data items similarly into clusters and we associate a context situation with each cluster. The cluster context is defined as any internally stored information that can be used to characterize the cluster members per se. Then, given a query context, we identify the clusters with the most similar context, and we use their members for making suggestions in a collaborative filtering manner.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:naSTrk-c4S8C",
            "Publisher": "Konstanz: OpenProceedings. org"
        },
        {
            "Title": "Machine Learning and Knowledge Discovery in Databases-European Conference, ECML PKDD 2015, Porto, Portugal, September 07-11, 2015",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=5749520830461085194&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:QoJ_w57xiyAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interpretable Visual Understanding with Cognitive Attention Network",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-86362-3_45",
            "Abstract": "While image understanding on recognition-level has achieved remarkable advancements, reliable visual scene understanding requires comprehensive image understanding on recognition-level but also cognition-level, which calls for exploiting the multi-source information as well as learning different levels of understanding and extensive commonsense knowledge. In this paper, we propose a novel Cognitive Attention Network (CAN) for visual commonsense reasoning to achieve interpretable visual understanding. Specifically, we first introduce an image-text fusion module to fuse information from images and text collectively. Second, a novel inference module is designed to encode commonsense among image, query and response. Extensive experiments on large-scale Visual Commonsense Reasoning (VCR) benchmark dataset demonstrate the effectiveness of our approach. The implementation is …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:BAanoTsO0WEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Building real-world trajectory warehouses",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1626536.1626539",
            "Abstract": "The flow of data generated from low-cost modern sensing technologies and wireless telecommunication devices enables novel research fields related to the management of this new kind of data and the implementation of appropriate analytics for knowledge extraction. In this work, we investigate how the traditional data cube model is adapted to trajectory warehouses in order to transform raw location data into valuable information. In particular, we focus our research on three issues that are critical to trajectory data warehousing:(a) the trajectory reconstruction procedure that takes place when loading a moving object database with sampled location data originated eg from GPS recordings,(b) the ETL procedure that feeds a trajectory data warehouse, and (c) the aggregation of cube measures for OLAP purposes. We provide design solutions for all these issues and we test their applicability and efficiency in real world …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sentiment classification over opinionated data streams through informed model adaptation",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-67008-9_29",
            "Abstract": "Opinionated data streams are very popular data paradigms nowadays as more and more users share their opinions online about almost everything from products to persons, brands and ideas. One of the key challenges for opinionated stream mining is dealing with concept drifts in the underlying stream population by building learners that adapt to such concept changes. Ageing is a typical way of adapting to change in a stream environment as it potentially allows us to discard outdated information from the learning models and focus on the most recent information. Most of the existing approaches follow a fixed ageing strategy which remains the same over the whole stream; for example, a fixed window size in the sliding window model or a fixed ageing factor in the damped window model. This implies that we forget at the same rate over the whole course of the stream, which is counterintuitive given the …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:nPTYJWkExTIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "grecs: A group recommendation system based on user clustering",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29035-0_25",
            "Abstract": "In this demonstration paper, we present gRecs, a system for group recommendations that follows a collaborative strategy. We enhance recommendations with the notion of support to model the confidence of the recommendations. Moreover, we propose partitioning users into clusters of similar ones. This way, recommendations for users are produced with respect to the preferences of their cluster members without extensively searching for similar users in the whole user base. Finally, we leverage the power of a top-k algorithm for locating the top-k group recommendations.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:4DMP91E08xMC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Extracting opinionated (sub) features from a stream of product reviews using accumulated novelty and internal re-organization",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S002002551500482X",
            "Abstract": "Opinion stream mining extends conventional opinion mining by monitoring a stream of reviews and detecting changes in the attitude of people toward products. However, next to the opinions of people on concrete products, product features—on which people also bestow their opinions—are equally important: such features appear on all products of a given brand and can deliver clues to product vendors on what improvements should be done in the next version of a product. In this study, we propose an opinion stream mining framework that discovers implicit product features and assesses their polarity, while it also monitors features and their polarity as the stream evolves. An earlier version of this framework has been presented in Zimmermann et al. (2013). The extended framework encompasses an additional mechanism that merges clusters representing similar product features. We report on extensive …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:JWITY9-sCbMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Adafair: Cumulative fairness adaptive boosting",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3357384.3357974",
            "Abstract": "The widespread use of ML-based decision making in domains with high societal impact such as recidivism, job hiring and loan credit has raised a lot of concerns regarding potential discrimination. In particular, in certain cases it has been observed that ML algorithms can provide different decisions based on sensitive attributes such as gender or race and therefore can lead to discrimination. Although, several fairness-aware ML approaches have been proposed, their focus has been largely on preserving the overall classification accuracy while improving fairness in predictions for both protected and non-protected groups (defined based on the sensitive attribute (s)). The overall accuracy however is not a good indicator of performance in case of class imbalance, as it is biased towards the majority class. As we will see in our experiments, many of the fairness-related datasets suffer from class imbalance and therefore …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:In6cVmBjs0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning under feature drifts in textual streams",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3269206.3271717",
            "Abstract": "Huge amounts of textual streams are generated nowadays, especially in social networks like Twitter and Facebook. As the discussion topics and user opinions on those topics change drastically with time, those streams undergo changes in data distribution, leading to changes in the concept to be learned, a phenomenon called concept drift. One particular type of drift, that has not yet attracted a lot of attention is feature drift, ie, changes in the features that are relevant for the learning task at hand. In this work, we propose an approach for handling feature drifts in textual streams. Our approach integrates i) an ensemble-based mechanism to accurately predict the feature/word values for the next time-point by taking into account the different features might be subject to different temporal trends and ii) a sketch-based feature space maintenance mechanism that allows for a memory-bounded maintenance of the feature …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:QsKbpXNoaWkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "UNIPI-ISL-TR-2007-01 March 2007",
            "Publication year": 2007,
            "Publication url": "http://infolab.cs.unipi.gr/pubs/TR/UNIPI-ISL-TR-2007-01.pdf",
            "Abstract": "The need for pattern management has become compulsory nowadays due to the spreading of the data mining technology as a result of the information flood. This need has been recognized by both academic and industrial parts resulting in a number of approaches towards efficient pattern management. In this chapter we review the work performed so far in the area of pattern management and outline open research directions regarding complete pattern management. 1",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:KS-xo-ZNxMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fingerprint: Summarizing cluster evolution in dynamic environments",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/article/content/67572",
            "Abstract": "Monitoring and interpretation of changing patterns is a task of paramount importance for data mining applications in dynamic environments. While there is much research in adapting patterns in the presence of drift or shift, there is less research on how to maintain an overview of pattern changes over time. A major challenge is summarizing changes in an effective way, so that the nature of change can be understood by the user, while the demand on resources remains low. To this end, the authors propose FINGERPRINT, an environment for the summarization of cluster evolution. Cluster changes are captured into an “evolution graph,” which is then summarized based on cluster similarity into a fingerprint of evolution by merging similar clusters. The authors propose a batch summarization method that traverses and summarizes the Evolution Graph as a whole and an incremental method that is applied during the …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Current issues in modeling data mining processes and results",
            "Publication year": 2003,
            "Publication url": "http://isl.cs.unipi.gr/people/ntoutsi/papers/03.TR02.pdf#page=13",
            "Abstract": "So far, research and industrial community has recognized the need for standards in order to create, store and manage data mining results. These standards should be independent of the underlying data mining systems and should allow the communication between different vector applications. In this paper we address the current and evolving efforts towards this aim. As we will see there are a lot of standards and tools, with PMML being the most prominent one, however most of them deal with patterns in a traditional manner (usually with relational tables). As the amount of data produced by data processing systems increases, it has become clear the need for a system, similar to DBMS, for efficient pattern management.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Similarity search in trajectory databases",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4438678/",
            "Abstract": "Trajectory database (TD) management is a relatively new topic of database research, which has emerged due to the explosion of mobile devices and positioning technologies. Trajectory similarity search forms an important class of queries in TD with applications in trajectory data analysis and spatiotemporal knowledge discovery. In contrast to related works which make use of generic similarity metrics that virtually ignore the temporal dimension, in this paper we introduce a framework consisting of a set of distance operators based on primitive (space and time) as well as derived parameters of trajectories (speed and direction). The novelty of the approach is not only to provide qualitatively different means to query for similar trajectories, but also to support trajectory clustering and classification mining tasks, which definitely imply a way to quantify the distance between two trajectories. For each of the proposed distance …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dagstuhl Reports, Vol. 8, Issue 6 ISSN 2192-5283",
            "Publication year": 2019,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2019/10175/pdf/dagrep-v008-i006_pi_frontmatter.pdf",
            "Abstract": "Volume 8, Issue 6, June 2018 Page 1 Volume 8, Issue 6, June 2018 The Constraint Satisfaction \nProblem: Complexity and Approximability (Dagstuhl Seminar 18231) Martin Grohe, Venkatesan \nGuruswami, and Stanislav Zivny ...................... 1 High-Performance Graph Algorithms (Dagstuhl \nSeminar 18241) Henning Meyerhenke, Richard Peng, and Ilya Safro .............................. 19 \nSecure Routing for the Internet (Dagstuhl Seminar 18242) Phillipa Gill, Adrian Perrig, and \nMatthias Wählisch ............................. 40 Database Architectures for Modern Hardware (Dagstuhl \nSeminar 18251) Peter A. Boncz, Goetz Graefe, Bingsheng He, and Kai-Uwe Sattler .............. \n63 Ubiquitous Gaze Sensing and Interaction (Dagstuhl Seminar 18252) Lewis Chuang, \nAndrew Duchowski, Pernilla Qvarfordt, and Daniel Weiskopf ..... 77 Discipline Convergence \nin Networked Systems (Dagstuhl Seminar 18261) Yungang Bao, Lars Eggert, Simon Peter, …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:EaFouW7jFu4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Revealing cluster formation over huge volatile robotic data",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6137414/",
            "Abstract": "In this paper, we propose a driven by the robotics field method for revealing global clusters over a fast, huge and volatile stream of robotic data. The stream comes from a mobile robot which autonomously navigates in an unknown environment perceiving it through its sensors. The sensor data arrives fast, is huge and evolves quickly over time as the robot explores the environment and observes new objects or new parts of already observed objects. To deal with the nature of data, we propose a grid-based algorithm that updates the grid structure and adjusts the so far built clusters online. Our method is capable of detecting object formations over time based on the partial observations of the robot at each time point. Experiments on real data verify the usefulness and efficiency of our method.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of the Trajectory Warehouse Architecture. GeoPKDD Deliverable D. 1.3.",
            "Publication year": 2006,
            "Publication url": "https://air.unimi.it/handle/2434/31295",
            "Abstract": "Design of the Trajectory Warehouse Architecture. GeoPKDD Deliverable D.1.3. IRIS \nnascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i \nprodotti per: Autore Titolo Riviste Serie Settore Scientifico Disciplinare Tipologia Login SUrplus \nArchivio Istituzionale della Ricerca Prodotti della ricerca 08 - Relazione interna o rapporto di \nricerca Design of the Trajectory Warehouse Architecture. GeoPKDD Deliverable D.1.3. Italiano \nItaliano Italiano Italiano English English Design of the Trajectory Warehouse Architecture. \nGeoPKDD Deliverable D.1.3. / ML Damiani, C. Vangenot, E. Frentzos, G. Marketos, I. Ntoutsi, N. \nPelekis, Y. Theodoridis, V.Verykios, A. Rafaetta.. - Pisa : CNR, 2006. Scheda breve Scheda \ncompleta Titolo: Design of the Trajectory Warehouse Architecture. GeoPKDD Deliverable D.1.3. \nAutori: DAMIANI, MARIA LUISA (Primo) mostra contributor esterni Data di pubblicazione: : ING'…",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:m4fbC6XIj1kC",
            "Publisher": "CNR"
        },
        {
            "Title": "Influence of oxygen isotope ratio on classification",
            "Publication year": 2014,
            "Publication url": "https://kbs.uni-hannover.de/~ntoutsi/papers/14.TR.BioArchaeo.pdf",
            "Abstract": "Isotopic fingerprinting is a task of paramount importance for region description and origin prediction. In this work, we use isotopic data, namely oxygen, strontium and lead, from animal remains in the Alps region. Our current samples are not cremated, however the majority of the data to be analysed in the project would be cremated. It is known that oxygen isotopes are not stable under high temperatures, making their application in the analysis of cremated material problematic. We study through Data Mining techniques the effect of oxygen on isotopic fingerprinting (treated as a supervised learning task) and on origin prediction (treated as a supervised task) and explore whether including oxygen in these analyses makes a significant difference to the results.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:s85pQhAUCrAC",
            "Publisher": "Technical report, FOR1670: Transalpine mobility and cultural transfer"
        },
        {
            "Title": "\" Strength Lies in Differences\" Diversifying Friends for Recommendations through Subspace Clustering",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2661829.2662026",
            "Abstract": "Nowadays, WWW brings overwhelming variety of choices to consumers. Recommendation systems facilitate the selection by issuing recommendations to them. Recommendations for users, or groups, are determined by considering users similar to the users in question. Scanning the whole database for locating similar users, though, is expensive. Existing approaches build cluster models by employing full-dimensional clustering to find sets of similar users. As the datasets we deal with are high-dimensional and incomplete, full-dimensional clustering is not the best option. To this end, we explore the fault-tolerant subspace clustering approach. We extend the concept of fault tolerance to density-based subspace clustering, and to speed up our algorithms, we introduce the significance threshold for considering only promising dimensions for subspace extension. Moreover, as we potentially receive a multitude of users …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:nqdriD65xNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bias in AI-systems: A multi-step approach",
            "Publication year": 2020,
            "Publication url": "https://aclanthology.org/2020.nl4xai-1.2/",
            "Abstract": "Algorithmic-based decision making powered via AI and (big) data has already penetrated into almost all spheres of human life, from content recommendation and healthcare to predictive policing and autonomous driving, deeply affecting everyone, anywhere, anytime. While technology allows previously unthinkable optimizations in the automation of expensive human decision making, the risks that the technology can pose are also high, leading to an ever increasing public concern about the impact of the technology in our lives. The area of responsible AI has recently emerged in an attempt to put humans at the center of AI-based systems by considering aspects, such as fairness, reliability and privacy of decision-making systems. In this talk, we will focus on the fairness aspect. We will start with understanding the many sources of bias and how biases can enter at each step of the learning process and even get propagated/amplified from previous steps. We will continue with methods for mitigating bias which typically focus on some step of the pipeline (data, algorithms or results) and why it is important to target bias in each step and collectively, in the whole (machine) learning pipeline. We will conclude this talk by discussing accountability issues in connection to bias and in particular, proactive consideration via bias-aware data collection, processing and algorithmic selection and retroactive consideration via explanations.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:R22Rs3tN8aoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Introduction to The Special Section on Bias and Fairness in AI",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3468507.3468509",
            "Abstract": "Fairness in Artificial Intelligence rightfully receives a lot of attention these days. Many life-impacting decisions are being partially automated, including health-care resource planning decisions, insurance and credit risk predictions, recidivism predictions, etc. Much of work appearing on this topic within the Data Mining, Machine Learning and Artificial Intelligence community is focused on technological aspects. Nevertheless, fairness is much wider than this as it lies at the intersection of philosophy, ethics, legislation, and practical perspectives. Therefore, to fill this gap and bring together scholars of these disciplines working on fairness, the first workshop on Bias and Fairness in AI was held online on September 18, 2020 at the ECML-PKDD 2020 conference. This special section includes six articles presenting different perspectives on bias and fairness from different angles.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:lbI08cpqPnQC",
            "Publisher": "ACM"
        },
        {
            "Title": "Guest Editorial: Special Issue on Intelligent Robotics and Multi-Agent Systems",
            "Publication year": 2019,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/01969722.2019.1677328",
            "Abstract": "This special issue includes extended versions of selected papers presented in the Intelligent Robotics and Multi-Agent Systems (IRMAS) track of the 34th ACM/SIGAPP Symposium on Applied Computing (SAC 2019), held in Limassol, Cyprus, on 9th April 2019, an international event sponsored by the ACM Special Interest Group on Applied Computing (SIGAPP). The SAC conference has been a primary gathering forum for applied computer scientists, computer engineers, software engineers, and application developers from around the world. The IRMAS track focuses on all aspects of intelligent robotics and multi-agent systems (MAS) including related areas and applications. Its primary goal is to exploit synergies between robotics and artificial intelligence (AI), more precisely between intelligent robotics and MAS, and bring together researchers from both fields. For many years, robotics and AI researchers have …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:yTLRzDEmwhEC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Discovering and monitoring product features and the opinions on them with OPINSTREAM",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231214013162",
            "Abstract": "Opinion stream mining encompasses methods for monitoring and understanding how people׳s attitude towards products changes over time. For many applications, though, not only a specific product is of interest but also the properties that people consider important for the whole category of products. Understanding which product features influence a buyer׳s choice positively or negatively allows decision makers to make well-informed decisions on improving their products or marketing them properly. In this study, we propose OPINSTREAM, a framework for the discovery and polarity monitoring of implicit product features deemed important in the people׳s reviews on different products. Our framework encompasses stream clustering, extraction of product features from the clusters, cluster adaptation and semi-supervised sentiment learning inside each cluster. These components build upon our earlier work on product …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:z8nqeaKD1nsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "ECML PKDD 2020 Workshops Workshops of the European Conference on Machine Learning and Knowledge Discovery in Databases (ECML PKDD 2020): SoGood 2020, PDFL 2020, MLCS 2020, NFMCP 2020, DINA 2020, EDML 2020, XKDD 2020 and INRA 2020, Ghent, Belgium, September 14–18, 2020, Proceedings",
            "Publication year": 2021,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03130787/",
            "Abstract": "ECML PKDD 2020 Workshops Workshops of the European Conference on Machine \nLearning and Knowledge Discovery in Databases (ECML PKDD 2020): SoGood 2020, \nPDFL 2020, MLCS 2020, NFMCP 2020, DINA 2020, EDML 2020, XKDD 2020 and INRA \n2020, Ghent, Belgium, September 14–18, 2020, Proceedings - Archive ouverte HAL \nAccéder directement au contenu Accéder directement à la navigation Toggle navigation \nCCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data \nDocumentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org \nSupport hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par \ndiscipline Par année de publication Par structure de recherche Les portails de l'archive \nRecherche Documentation hal-03130787, version 1 Direction d'ouvrage, Proceedings, \nDossier ECML PKDD 2020 Workshops Workshops of the …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:aEW5N-EHWIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trajectory database systems",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75177-9_7",
            "Abstract": "In this chapter, we deal with trajectory database management issues and physical aspects of trajectory database systems, such as indexing and query processing. Our emphasis is on historical databases handling past positions of moving objects represented as trajectories. This is because only such databases can be used in the context of trajectory data warehouses, which is the core subject of this book.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Large scale sentiment learning with limited labels",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3097983.3098159",
            "Abstract": "Sentiment analysis is an important task in order to gain insights over the huge amounts of opinions that are generated in the social media on a daily basis. Although there is a lot of work on sentiment analysis, there are no many datasets available which one can use for developing new methods and for evaluation. To the best of our knowledge, the largest dataset for sentiment analysis is TSentiment [8], a 1.6 millions machine-annotated tweets dataset covering a period of about 3 months in 2009. This dataset however is too short and therefore insufficient to study heterogeneous, fast evolving streams. Therefore, we annotated the Twitter dataset of 2015 (228 million tweets without retweets and 275 million with retweets) and we make it publicly available for research. For the annotation we leverage the power of unlabeled data, together with labeled data using semi-supervised learning and in particular, Self-Learning …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:jlhcAiayVhoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Social-Based Collaborative Filtering.",
            "Publication year": 2018,
            "Publication url": "https://homepages.tuni.fi/konstantinos.stefanidis/docs/StefanidisNKV17.pdf",
            "Abstract": "Collaborative filtering is a special category of recommender systems that generate recommendations to the users about certain items, eg, products or services, by relying on preferences of similar users. Social-based collaborative filtering exploits the vast amount of data generated in the social networks to improve the quality of recommendations. Such data are utilized for different purposes, eg, to deal with traditional recommendation problems, such as the cold start problem, which is caused due to lack of user-related data in the recommender, to derive a better quality user neighborhood by integrating user-related information from the social networks and to enrich the recommendations by capturing different aspects of the users as they are manifested through the content they share and their interactions in the social networks.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:R-LXmdHK_14C",
            "Publisher": "Unknown"
        },
        {
            "Title": "FAE: A fairness-aware ensemble framework",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9006487/",
            "Abstract": "Automated decision making based on big data and machine learning (ML) algorithms can result in discriminatory decisions against certain protected groups defined upon personal data like gender, race, sexual orientation etc. Such algorithms designed to discover patterns in big data might not only pick up any encoded societal biases in the training data, but even worse, they might reinforce such biases resulting in more severe discrimination. The majority of thus far proposed fairness-aware machine learning approaches focus solely on the pre-, in- or post-processing steps of the machine learning process, that is, input data, learning algorithms or derived models, respectively. However, the fairness problem cannot be isolated to a single step of the ML process. Rather, discrimination is often a result of complex interactions between big data and algorithms, and therefore, a more holistic approach is required. The …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:bVQMTfhMCi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Online Fairness-Aware Learning with Imbalanced Data Streams",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2108.06231",
            "Abstract": "Data-driven learning algorithms are employed in many online applications, in which data become available over time, like network monitoring, stock price prediction, job applications, etc. The underlying data distribution might evolve over time calling for model adaptation as new instances arrive and old instances become obsolete. In such dynamic environments, the so-called data streams, fairness-aware learning cannot be considered as a one-off requirement, but rather it should comprise a continual requirement over the stream. Recent fairness-aware stream classifiers ignore the problem of class imbalance, which manifests in many real-life applications, and mitigate discrimination mainly because they \"reject\" minority instances at large due to their inability to effectively learn all classes. In this work, we propose \\ours, an online fairness-aware approach that maintains a valid and fair classifier over the stream. \\ours~is an online boosting approach that changes the training distribution in an online fashion by monitoring stream's class imbalance and tweaks its decision boundary to mitigate discriminatory outcomes over the stream. Experiments on 8 real-world and 1 synthetic datasets from different domains with varying class imbalance demonstrate the superiority of our method over state-of-the-art fairness-aware stream approaches with a range (relative) increase [11.2\\%-14.2\\%] in balanced accuracy, [22.6\\%-31.8\\%] in gmean, [42.5\\%-49.6\\%] in recall, [14.3\\%-25.7\\%] in kappa and [89.4\\%-96.6\\%] in statistical parity (fairness).",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:PuOEWVtPfzwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recommendations beyond the ratings matrix",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2911187.2914580",
            "Abstract": "Recommender systems have become indispensable for several Web sites, such as Amazon, Netflix and Google News, helping users navigate through the abundance of available choices. Although the field has advanced impressively in the last years with respect to models, usage of heterogeneous information, such as ratings and text reviews, and recommendations for modern applications beyond purchases, almost all of the approaches rely on the data that exist within the recommender and on user explicit input. In a rapidly connected world, though, information is not isolated and does not necessarily lie in the database of a single recommender. Rather, Web offers tremendous amount of information on almost everything, from items to users and their tendency to certain items, but also information on general trends and demographics. We envision an out-of-the-box recommender system that exploits the existing …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:sJPMR1oEGYQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tracking the history and evolution of entities: entity-centric temporal analysis of large social media archives",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00799-018-0257-7",
            "Abstract": "How did the popularity of the Greek Prime Minister evolve in 2015? How did the predominant sentiment about him vary during that period? Were there any controversial sub-periods? What other entities were related to him during these periods? To answer these questions, one needs to analyze archived documents and data about the query entities, such as old news articles or social media archives. In particular, user-generated content posted in social networks, like Twitter and Facebook, can be seen as a comprehensive documentation of our society, and thus, meaningful analysis methods over such archived data are of immense value for sociologists, historians, and other interested parties who want to study the history and evolution of entities and events. To this end, in this paper we propose an entity-centric approach to analyze social media archives and we define measures that allow studying how entities were …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:DXE8ND7PrJAC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Mining trajectory databases via a suite of distance operators",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4401043/",
            "Abstract": "With the rapid progress of mobile devices and positioning technologies, Trajectory databases (TD) have been in the core of database research during the last decade. Analysis and knowledge discovery in TD is an emerging field which has recently gained great interest. Extracting knowledge from TD using certain types of mining techniques, such as clustering and classification, impose that there is a mean to quantify the distance between two trajectories. Having as a main objective the support of effective similarity query processing, existing approaches utilize generic distance metrics that ignore the peculiarities of the trajectories as complex spatio-temporal data types. In this paper, we define a novel set of trajectory distance operators based on primitive (space and time) as well as derived parameters of trajectories (speed and direction). Aiming at providing a powerful toolkit for analysts who require producing …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The isotopic fingerprint: new methods of data mining and similarity search",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-41550-5_5",
            "Abstract": "The generation of an isotopic map of the reference region featuring local stable isotopic fingerprints requires the application of data mining methods due to the heterogeneity and complexity of the generated data. In this chapter, we explore new techniques to process isotopic data with the ultimate goal of constructing a map of locally characteristic isotopic fingerprints that help predict the places of origin of particular findings and, thus, supports archaeologists in deriving and testing hypotheses. In particular, we propose a new method for feature selection and apply it to a sample dataset of animal bones from the reference region. This application confirms that a multivariate fingerprint is clearly superior over univariate analysis and that the impact of oxygen on the reliability of the fingerprints is not very prominent. These findings confirm that it is possible to explore cremated human material for provenance analysis …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:iyewoVqAXLQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Interactive verification of game design and playing strategies",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1180834/",
            "Abstract": "Reinforcement learning is considered as one of the most suitable and prominent methods for solving game problems due to its capability to discover good strategies by extended se self-training and limited initial knowledge. In this paper we elaborate on using reinforcement learning for verifying game designs and playing strategies. Specifically, we examine a new strategy game that has been trained on self-playing games and analyze the game performance after human interaction. We demonstrate, through selected game instances, the impact of human interference to the learning process, and eventually the game design.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Networking in bioarchaeology: the example of the DFG research group for 1670 “transalpine mobility and culture transfer”",
            "Publication year": 2015,
            "Publication url": "https://www.academia.edu/download/59302293/DOAB_12_Grupe_et_al_screen20190518-80449-eveva6.pdf",
            "Abstract": "Bioarchaeology is a scientific subject that integrates aspects of natural and cultural sciences in the course of research studies on past populations. Some biological disciplines, especially physical anthropology, archaeozoology and palaeobotany, are specialized on the investigation of bioarchaeological finds, but at the same time separated themselves to a certain degree from the larger subject of biology. Today, also geologists, mineralogists, and to a growing extent also computer scientists are engaged in bioarchaeological research. The majority of natural sciences involved, however, belong to the so-called “small academic subjects”, which are at a high risk of losing their academic identity and visibility in the modern structures of German universities. To support their survival, scientific networking, the foundation of centres, and alliances in the field of academic teaching are recommended. How such a networking can be brought into being is illustrated by use of the example of the research group “Transalpine mobility and culture transfer” at the Ludwig-Maximilian-University in Munich.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:6VlyvFCUEfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discovering global and local bursts in a stream of news",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2245276.2245433",
            "Abstract": "Reports on major events like hurricanes and earthquakes, and major topics like the financial crisis or the Egyptian revolution appear in Internet news and become (ir) regularly updated, as new insights are acquired. Tracking emerging subtopics in a major or even local event is important for the news readers but challenging for the operator: subtopics may emerge gradually or in a bursty way; they may be of some importance inside the event, but too rare to be visible inside the whole stream of news. In this study, we propose a text stream clustering method that detects, tracks and updates large and small bursts of news in a two-level topic hierarchy. We report on our first results on a stream of news from February to April 2011.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "ACM"
        },
        {
            "Title": "Database support for data mining patterns",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_2",
            "Abstract": "The need of extracting useful knowledge from large collections of data has led to a great development of data mining systems and techniques. The results of data mining are known as patterns. Patterns can also be found in other scientific areas, such as biology, astronomy, mathematics etc. Today requirements impose the need for a system that efficiently manipulates complex and diverse patterns. In this work, we study the problem of the efficient representation and storage of patterns in a so-called pattern-base Management System. Towards this aim we examine three well known models from the database domain, the relational, the object-relational and the semi-structured (XML) model. The three alternative models are presented and compared based on criteria like generality, extensibility and querying effectiveness. The comparison shows that the semi-structure representation is more appropriate for a …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Data augmentation for dealing with low sampling rates in NILM",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.02055",
            "Abstract": "Data have an important role in evaluating the performance of NILM algorithms. The best performance of NILM algorithms is achieved with high-quality evaluation data. However, many existing real-world data sets come with a low sampling quality, and often with gaps, lacking data for some recording periods. As a result, in such data, NILM algorithms can hardly recognize devices and estimate their power consumption properly. An important step towards improving the performance of these energy disaggregation methods is to improve the quality of the data sets. In this paper, we carry out experiments using several methods to increase the sampling rate of low sampling rate data. Our results show that augmentation of low-frequency data can support the considered NILM algorithms in estimating appliances' consumption with a higher F-score measurement.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:M0leSnx2MbUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sentiment analysis in the Twitter stream",
            "Publication year": 2012,
            "Publication url": "https://kbs.uni-hannover.de/~ntoutsi/papers/12.GfKL_a(ppt).pdf",
            "Abstract": "Co-occurrence Patterns in Market-Basket Data Page 1 Sentiment analysis in the Twitter \nstream Alina Sinelnikova, Eirini Ntoutsi, Hans-Peter Kriegel Institute for Informatics, Ludwig-Maximilians-Universität \n(LMU), Munich The 36th Annual Conference of the German Classification Society on Data \nAnalysis, Machine Learning and Knowledge Discovery, 1-3 August 2012, Hildesheim Page 2 \nEirini Ntoutsi Outline ∎ Introduction ∎ Data preprocessing ∎ Sentiment Analysis ∎ \nConclusions & Outlook 2 Page 3 Eirini Ntoutsi Outline ∎ Introduction ∎ Data preprocessing ∎ \nSentiment Analysis ∎ Conclusions & Outlook 3 Page 4 Eirini Ntoutsi Sentiment Analysis ∎ \nWith the advent of Web 2.0 and its social character a lot of opinion-rich resources have arisen \n❑ People have the power to influence each other in the decision making process ❑ \nCompanies turn into social media monitoring in order to optimize and strengthen their and 4 : '…",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trajectory data models",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75177-9_6",
            "Abstract": "Trajectory databases is an important research area that has received a lot of interest in the last decade. The objective of trajectory databases is to extend database technology to support the representation and querying of moving objects and their trajectory.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A framework for modeling, computing and presenting time-aware recommendations",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41221-9_6",
            "Abstract": "Lately, recommendation systems have received significant attention. Most existing approaches though, recommend items of potential interest to users by completely ignoring the temporal aspects of ratings. In this paper, we argue that time-aware recommendations need to be pushed in the foreground. We introduce an extensive model for time-aware recommendations from two perspectives. From a fresh-based perspective, we propose using different aging schemes for decreasing the effect of historical ratings and increasing the influence of fresh and novel ratings. From a context-based perspective, we focus on providing different suggestions under different temporal specifications. To facilitate user browsing, we propose an effective presentation layer for time-aware recommendations based on user preferences and summaries for the suggested items. Our experiments with real movies ratings show that time …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:mB3voiENLucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "10 Years of Web Science: Closing The Loop (Dagstuhl Perspectives Workshop 18262)",
            "Publication year": 2019,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2019/10059/",
            "Abstract": "This report documents the program and the outcomes of Dagstuhl Seminar 18262\" 10 years Web Science: Closing the Loop\" that took place in Schloss Dagstuhl from 25-29 June 2018. In total, an interdisciplinary team of 22 researchers from computer science, sociology, philosophy and law gathered and discussed on the past, present and future of Web Science and what sort of actions the community should take to stay faithful to its initial mission for societal good. The role of Web Science is more critical than ever given the ever growing impact of the Web in our society.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:ndLnGcHYRF0C",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik"
        },
        {
            "Title": "Adaptive semi supervised opinion classifier with forgetting mechanism",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2554850.2555039",
            "Abstract": "Opinion stream classification methods face the challenge of learning with a limited amount of labeled data: inspecting and labeling opinions is a tedious task, so systems analyzing opinions must devise mechanisms that label the arriving stream of opinionated documents with minimal human intervention. We propose an opinion stream classifier that only uses a seed of labeled documents as input and thereafter adapts itself, as it reads documents with unknown labels. Since the stream of opinions is subject to concept drift, we use two adaptation mechanisms: forward adaptation, where the classifier incorporates to the training set only those un-labeled documents that it considers informative enough in comparison to those seen thus far; and backward adaptation, where the classifier gradually forgets old documents by eliminating them from the model. We evaluate our method on opinionated tweets and show that it …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:X0DADzN9RKwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "UNIPI-ISL-TR-2007-02 March 2007",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.502.7455&rep=rep1&type=pdf",
            "Abstract": "Several heterogeneous pattern types are available nowadays as a result of the different goals that a mining task tries to accomplish and of the application of Data Mining techniques over different domains. In this chapter we overview three popular pattern types, namely frequent itemsets and association rules, clusters and clusterings, and decision trees. We also adopt a pattern representation schema based on both extensional and intensional description of patterns and describe how the different pattern types are expressed with respect to this schema.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proceedings of the 1st Workshop on Evaluation and Experimental Design in Data Mining and Machine Learning co-located with SIAM International Conference on Data Mining (SDM 2019)",
            "Publication year": 2019,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02284857/",
            "Abstract": "Proceedings of the 1st Workshop on Evaluation and Experimental Design in Data Mining \nand Machine Learning co-located with SIAM International Conference on Data Mining (SDM \n2019) - Archive ouverte HAL Accéder directement au contenu Accéder directement à la \nnavigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails \nAURéHAL API Data Documentation Episciences.org Episciences.org Revues \nDocumentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers \ndépôts Par type de publication Par discipline Par année de publication Par structure de \nrecherche Les portails de l'archive Recherche Documentation hal-02284857, version 1 \nDirection d'ouvrage, Proceedings, Dossier Proceedings of the 1st Workshop on Evaluation \nand Experimental Design in Data Mining and Machine Learning co-located with SIAM \nInternational Conference on Data Mining (SDM '[…",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:tz746QTLzJkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards subspace clustering on dynamic data: an incremental version of PreDeCon",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1833280.1833285",
            "Abstract": "Todays data are high dimensional and dynamic, thus clustering over such kind of data is rather complicated. To deal with the high dimensionality problem, the subspace clustering research area has lately emerged that aims at finding clusters in subspaces of the original feature space. So far, the subspace clustering methods are mainly static and thus, cannot address the dynamic nature of modern data. In this paper, we propose an incremental version of the density based projected clustering algorithm PreDeCon, called incPreDeCon. The proposed algorithm efficiently updates only those subspace clusters that might be affected due to the population update.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:_FxGoFyzp5QC",
            "Publisher": "ACM"
        },
        {
            "Title": "Resource management for model learning at entity level",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s12243-020-00800-4",
            "Abstract": "Many current and future applications plan to provide entity-specific predictions. These range from individualized healthcare applications to user-specific purchase recommendations. In our previous stream-based work on Amazon review data, we could show that error-weighted ensembles that combine entity-centric classifiers, which are only trained on reviews of one particular product (entity), and entity-ignorant classifiers, which are trained on all reviews irrespective of the product, can improve prediction quality. This came at the cost of storing multiple entity-centric models in primary memory, many of which would never be used again as their entities would not receive future instances in the stream. To overcome this drawback and make entity-centric learning viable in these scenarios, we investigated two different methods of reducing the primary memory requirement of our entity-centric approach. Our first method …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:KTwcwpFFj4wC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Predicting polarities of entity-centered documents without reading their contents",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3167132.3172870",
            "Abstract": "Opinion stream mining algorithms learn and adapt a polarity model as new opinionated texts arrive. Text understanding is computationally expensive though, and sensitive to the emergence of new words. In this work, we study polarity prediction for opinions on given entities and investigate how prediction quality is affected when we ignore the text of past opinions but exploit the entity-opinion link and the past polarity scores on it. We model each entity as a trajectory of polarity scores and propose learning algorithms that exploit these trajectories for polarity prediction. We study the performance of our approach on the Tools & Home Improvement products of the Amazon Reviews Dataset 1.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:lg2tdxc6qMwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ageing-based multinomial naive bayes classifiers over opinionated data streams",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23528-8_25",
            "Abstract": "The long-term analysis of opinionated streams requires algorithms that predict the polarity of opinionated documents, while adapting to different forms of concept drift: the class distribution may change but also the vocabulary used by the document authors may change. One of the key properties of a stream classifier is adaptation to concept drifts and shifts; this is typically achieved through ageing of the data. Surprisingly, for one of the most popular classifiers, Multinomial Naive Bayes (MNB), no ageing has been considered thus far. MNB is particularly appropriate for opinionated streams, because it allows the seamless adjustment of word probabilities, as new words appear for the first time. However, to adapt properly to drift, MNB must also be extended to take the age of documents and words into account.In this study, we incorporate ageing into the learning process of MNB, by introducing the …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:OzeSX8-yOCQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Survey on Bias in Visual Datasets",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2107.07919",
            "Abstract": "Computer Vision (CV) has achieved remarkable results, outperforming humans in several tasks. Nonetheless, it may result in major discrimination if not dealt with proper care. CV systems highly depend on the data they are fed with and can learn and amplify biases within such data. Thus, both the problems of understanding and discovering biases are of utmost importance. Yet, to date there is no comprehensive survey on bias in visual datasets. To this end, this work aims to: i) describe the biases that can affect visual datasets; ii) review the literature on methods for bias discovery and quantification in visual datasets; iii) discuss existing attempts to collect bias-aware visual datasets. A key conclusion of our study is that the problem of bias discovery and quantification in visual datasets is still open and there is room for improvement in terms of both methods and the range of biases that can be addressed; moreover, there is no such thing as a bias-free dataset, so scientists and practitioners must become aware of the biases in their datasets and make them explicit. To this end, we propose a checklist that can be used to spot different types of bias during visual dataset collection.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:3A3nxV7CjKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Taxi Demand Prediction using an LSTM-based Deep Sequence Model and Points of Interest",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9202791/",
            "Abstract": "Nowadays, urban mobility plays an important role in modern cities for city planning, navigation, and other mobility services. Taxicabs are vital public services in large cities that are taken by passengers thousands of times every day. Reducing the number of vacant vehicles on the streets will help service providers to raise drivers' incomes, reduce energy consumption, optimize traffic efficiency, and control air pollution problems in large cities. Since drivers do not have enough information about the location of passengers and other taxis, most of them might drive to the same area. Due to the lack of passenger information, they often end up without picking up any passengers while there are highly demanded areas in their neighborhood. To address these issues, machine learning techniques can be applied to analyze mobility data acquired from the IoT sensors and help companies to organize the taxi fleet or minimize …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:natZJ_-F0IUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards predicting places of origin from isotopic fingerprints: A case study on the mobility of people in the central European Alps",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-48339-8_13",
            "Abstract": "Isotopic fingerprinting is a task of paramount importance for region description and origin prediction in many archaeo-related and biology-related sciences. In fact, isotopic fingerprinting aims at describing spatial areas by a characteristic fingerprint of isotopic measurements. The data upon which such an isotopic map is based is a prototype of enriched geo-data: it consists of isotopic values that specifically represent samples taken from archaeological finds or geological formations, each associated with the spatial location of the site where these samples were found (or excavated). In this work, we use isotopic data from animal remains in the Central European Alps to derive isotopic fingerprints of this alpine region. These fingerprints are used for determining the places of origin of individual finds, an information necessary for archaeologists exploring past mobility and trade in that region. Our initial step in …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:BOlwja0KXvYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multi-aspect entity-centric analysis of big social media archives",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-67008-9_21",
            "Abstract": "Social media archives serve as important historical information sources, and thus meaningful analysis and exploration methods are of immense value for historians, sociologists and other interested parties. In this paper, we propose an entity-centric approach to analyze social media archives and we define measures that allow studying how entities are reflected in social media in different time periods and under different aspects (like popularity, attitude, controversiality, and connectedness with other entities). A case study using a large Twitter archive of 4 years illustrates the insights that can be gained by such an entity-centric multi-aspect analysis.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:1r-w4gtu6w8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A framework for trajectory data warehousing",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Gerasimos-Marketos/publication/228971768_A_Framework_for_Trajectory_Data_Warehousing/links/0fcfd505bbc883c370000000/A-Framework-for-Trajectory-Data-Warehousing.pdf",
            "Abstract": "Technological advances in sensing technologies and wireless telecommunication devices enable novel research fields related to the management of trajectory data. As it usually happens in data management world, the challenge after storing the data is the implementation of appropriate analytics that could extract useful knowledge. However, traditional data warehousing systems and techniques were not designed for analyzing trajectory data. Thus, in this work, we investigate how the traditional data cube model is adapted to trajectory warehouses in order to transform raw location data into valuable information. In particular, we focus our research on three issues that are critical to trajectory data warehousing:(a) the trajectory reconstruction procedure that takes place in order to transform sampled location data originated eg from GPS recordings into trajectories and load them to a moving object database,(b) the ETL procedure that feeds a trajectory data warehouse, and (c) the aggregation of cube measures for OLAP purposes. We provide design solutions for all these issues and we test their applicability and efficiency in real world settings.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework for time-aware recommendations",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-32597-7_29",
            "Abstract": "Recently, recommendation systems have received significant attention. However, most existing approaches focus on recommending items of potential interest to users, without taking into consideration how temporal information influences the recommendations. In this paper, we argue that time-aware recommendations need to be pushed in the foreground. We introduce an extensive model for time-aware recommendations from two perspectives. From a fresh-based perspective, we propose using a suite of aging schemes towards making recommendations mostly depend on fresh and novel user preferences. From a context-based perspective, we focus on providing different suggestions under different temporal specifications. The proposed strategies are experimentally evaluated using real movies ratings.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:QIV2ME_5wuYC",
            "Publisher": "DEXA"
        },
        {
            "Title": "Bias in data‐driven artificial intelligence systems—An introductory survey",
            "Publication year": 2020,
            "Publication url": "https://wires.onlinelibrary.wiley.com/doi/abs/10.1002/widm.1356",
            "Abstract": "Artificial Intelligence (AI)‐based systems are widely employed nowadays to make decisions that have far‐reaching impact on individuals and society. Their decisions might affect everyone, everywhere, and anytime, entailing concerns about potential human rights issues. Therefore, it is necessary to move beyond traditional AI algorithms optimized for predictive performance and embed ethical and legal principles in their design, training, and deployment to ensure social good while still benefiting from the huge potential of the AI technology. The goal of this survey is to provide a broad multidisciplinary overview of the area of bias in AI systems, focusing on technical challenges and solutions as well as to suggest new research directions towards approaches well‐grounded in a legal frame. In this survey, we focus on data‐driven AI, as a large part of AI is powered nowadays by (big) data and powerful machine learning …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:yeL6HyUMUGUC",
            "Publisher": "Wiley Periodicals, Inc"
        },
        {
            "Title": "Isotopic mapping and migration research based on bioarchaeological finds",
            "Publication year": 2017,
            "Publication url": "https://bibliographie.uni-tuebingen.de/xmlui/bitstream/handle/10900/74124/SFB_1070_5_Scholz%20et%20al_ResourceCultures.pdf?sequence=1#page=196",
            "Abstract": "The desire to better understand past human and animal mobility and patterning in prehistoric and historic times has benefited substantially from GHYHORSPHQWV HVSHFLDOO\\LQ WKH ȴHOG RI UDGLRJHQLF isotope research (stable strontium and lead iso-WRSLF UDWLRV: KLOH WKH GHȴQLWLRQ RI QRQ ORFDO ȴQGV can be rather easy by use of the exclusion princi-SOH GHȴQLWLRQ RI SODFH RI RULJLQ LV VWLOO IUHTXHQW-ly fraught with ambiguity, be it due to an overall geo graphical redundancy of isotopic ratios, or an overwhelming imprint of a few edibles only on the isotopic composition of the consumer’s skeleton. Moreover, the eminent danger of false positive results brought about by diagenetic signals overprinting the original, biological signal remains. As a result, the question arises whether’isotopic landscapes’ in bioarchaeology do exist at all–are we dealing with an ecogeographical reality, or rather with a concept, and is this concept really a ‘silver bullet’?",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:orDZ08hpP44C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Induction of decision trees in numeric domains using set-valued attributes",
            "Publication year": 2000,
            "Publication url": "https://content.iospress.com/articles/intelligent-data-analysis/ida00023",
            "Abstract": "Conventional algorithms for decision tree induction use an attribute-value representation scheme for instances. This paper explores the empirical consequences of using set-valued attributes. This simple representational extension, when used as a pre-processor for numeric data, is shown to yield significant gains in accuracy combined with attractive build times. It is also shown to improve the accuracy for the second best classification option, which has valuable ramifications for post-processing. To do so an intuitive and practical version of pre-pruning is employed. Moreover, the implementation of a simple pruning scheme serves as an example of pruning applicability over the resulted trees and also as an indication that the proposed discretization absorbs much of pruning potential. Finally, we construct several versions of the basic algorithm to examine the value of every component that comprises it.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:_kc_bZDykSQC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Fairness-enhancing interventions in stream classification",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-27615-7_20",
            "Abstract": " The wide spread usage of automated data-driven decision support systems has raised a lot of concerns regarding accountability and fairness of the employed models in the absence of human supervision. Existing fairness-aware approaches tackle fairness as a batch learning problem and aim at learning a fair model which can then be applied to future instances of the problem. In many applications, however, the data comes sequentially and its characteristics might evolve with time. In such a setting, it is counter-intuitive to “fix” a (fair) model over the data stream as changes in the data might incur changes in the underlying model therefore, affecting its fairness. In this work, we propose fairness-enhancing interventions that modify the input data so that the outcome of any stream classifier applied to that data will be fair. Experiments on real and synthetic data show that our approach achieves good predictive …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:W2uZP3ddy8sC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "MONIC and followups on modeling and monitoring cluster transitions",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40994-3_41",
            "Abstract": "There is much recent discussion on data streams and big data, which except of their volume and velocity are also characterized by volatility. Next to detecting change, it is also important to interpret it. Consider customer profiling as an example: Is a cluster corresponding to a group of customers simply disappearing or are its members migrating to other clusters? Does a new cluster reflect a new type of customers or does it rather consist of old customers whose preferences shift? To answer such questions, we have proposed the framework MONIC [20] for modeling and tracking cluster transitions. MONIC has been re-discovered some years after publication and is enjoying a large citation record from papers on community evolution, cluster evolution, change prediction and topic evolution.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:HDshCWvjkbEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Monic: modeling and monitoring cluster transitions",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1150402.1150491",
            "Abstract": "There is much recent work on detecting and tracking change in clusters, often based on the study of the spatiotemporal properties of a cluster. For the many applications where cluster change is relevant, among them customer relationship management, fraud detection and marketing, it is also necessary to provide insights about the nature of cluster change: Is a cluster corresponding to a group of customers simply disappearing or are its members migrating to other clusters? Is a new emerging cluster reflecting a new target group of customers or does it rather consist of existing customers whose preferences shift? To answer such questions, we propose the framework MONIC for modeling and tracking of cluster transitions. Our cluster transition model encompasses changes that involve more than one cluster, thus allowing for insights on cluster change in the whole clustering. Our transition tracking mechanism is not …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pattern comparison in data mining: a survey",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/pattern-comparison-data-mining/28422",
            "Abstract": "Many patterns are available nowadays due to the widespread use of knowledge discovery in databases (KDD), as a result of the overwhelming amount of data. This “flood” of patterns imposes new challenges regarding their management. Pattern comparison, which aims at evaluating how close to each other two patterns are, is one of these challenges resulting in a variety of applications. In this chapter we investigate issues regarding the pattern comparison problem and present an overview of the work performed so far in this domain. Due to heterogeneity of data mining patterns, we focus on the most popular pattern types, namely frequent itemsets and association rules, clusters and clusterings, and decision trees.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Density based subspace clustering over dynamic data",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-22351-8_24",
            "Abstract": "Modern data are often high dimensional and dynamic. Subspace clustering aims at finding the clusters and the dimensions of the high dimensional feature space where these clusters exist. So far, the subspace clustering methods are mainly static and cannot address the dynamic nature of modern data. In this paper, we propose a dynamic subspace clustering method, which extends the density based projected clustering algorithm PreDeCon for dynamic data. The proposed method efficiently examines only those clusters that might be affected due to the population update. Both single and batch updates are considered.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Measuring and evaluating dissimilarity in data and pattern spaces",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.70.8263&rep=rep1&type=pdf#page=49",
            "Abstract": "Nowadays, the amount of patterns extracted from Knowledge Discovery and Data Mining (KDD) is rapidly growing, thus imposing new challenges regarding their management. One of the most important operations on pattern sets (or pattern bases) is that of similarity comparison. In our research, we investigate issues regarding pattern comparison and the degree of distance preservation in pattern space with respect to the original data space.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A general framework for estimating similarity of datasets and decision trees: exploring semantic similarity of decision trees",
            "Publication year": 2008,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611972788.73",
            "Abstract": "Decision trees are among the most popular pattern types in data mining due to their intuitive representation. However, little attention has been given on the definition of measures of semantic similarity between decision trees. In this work, we present a general framework for similarity estimation that includes as special cases the estimation of semantic similarity between decision trees, as well as various forms of similarity estimation on classification datasets with respect to different probability distributions defined over the attribute-class space of the datasets. The similarity estimation is based on the partitions induced by the decision trees on the attribute space of the datasets. We use the proposed framework in order to estimate the semantic similarity of decision trees induced from different subsamples of classification datasets; we evaluate its performance with respect to the empirical semantic similarity, which we …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:Se3iqnhoufwC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Top-k computations in mapreduce: A case study on recommendations",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7364088/",
            "Abstract": "Top-k is a well-studied problem in the literature, due to its wide spectrum of applications, like information retrieval, database querying, Web search and data mining. In the big data era, the volume of the data and their velocity, call for efficient parallel solutions that overcome the restricted resources of a single machine. Our motivating application is recommenders, which typically deal with big numbers of users and items, but other applications might benefit as well, like keyword search. In this paper, we propose a parallel top-k MapReduce algorithm that, unlike existing MapReduce solutions, manages to handle cases in which the k results do not fit in memory.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:ijdKiLOsEJMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "XPROAX-Local explanations for text classification with progressive neighborhood approximation",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9564153/",
            "Abstract": "The importance of the neighborhood for training a local surrogate model to approximate the local decision boundary of a black box classifier has been already highlighted in the literature. Several attempts have been made to construct a better neighborhood for high dimensional data, like texts, by using generative autoencoders. However, existing approaches mainly generate neighbors by selecting purely at random from the latent space and struggle under the curse of dimensionality to learn a good local decision boundary. To overcome this problem, we propose a progressive approximation of the neighborhood using counterfactual instances as initial landmarks and a careful 2-stage sampling approach to refine counterfactuals and generate factuals in the neighborhood of the input instance to be explained. Our work focuses on textual data and our explanations consist of both word-level explanations from the …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:vnF2_uLGgtgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A semi-supervised self-adaptive classifier over opinionated streams",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7022627/",
            "Abstract": "We investigate the problem of polarity learning over a stream of opinionated documents. We deal with two challenges. First, if the opinions are not labeled, then we cannot assume that a human expert will be regularly and frequently available to assess the sentiment of arriving documents for learning and model adaption. Further, the vocabulary of the stream, and thus the feature space used for learning, changesover time: people use an abundancy of words, and sometime seven invent new ones to express their feelings. We propose a semi-supervised opinion stream classification algorithm that uses only an initial training set of labeled documents for polarity learning and gradually adapts to changes in the vocabulary. In particular, our algorithm S*3 Learner starts with the vocabulary of opinionated words that are in the documents of the initial training set, and then expands it with new words, as soon as there is …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:lYAcb2jw7qUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An evaluation of data stream clustering algorithms",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sam.11380",
            "Abstract": "Data stream clustering is a hot research area due to the abundance of data streams collected nowadays and the need for understanding and acting upon such sort of data. Unsupervised learning (clustering) comprises one of the most popular data mining tasks for gaining insights into the data. Clustering is a challenging task, while clustering over data streams involves additional challenges such as the single pass constraint over the raw data and the need for fast response. Moreover, dealing with an infinite and fast changing data stream implies that the clustering model extracted upon such sort of data is also subject to evolution over time. Several stream clustering surveys exist already in the literature; however, they focus on a theoretical presentation of the surveyed algorithms. On the contrary, in this paper, we survey the state‐of‐the‐art stream clustering algorithms and we evaluate their performance in different …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:WwIwg2wKZ0QC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Active feature acquisition for opinion stream classification under drift",
            "Publication year": 2019,
            "Publication url": "https://www.repo.uni-hannover.de/handle/123456789/9875",
            "Abstract": "Active stream learning is frequently used to acquire labels for instances and less frequently to determine which features should be considered as the stream evolves. We introduce a framework for active feature selection, intended to adapt the feature space of a polarity learner over a stream of opinionated documents. We report on the first results of our framework on substreams of reviews on different product categories.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:H7nrzBkawXsC",
            "Publisher": "Aachen: RWTH"
        },
        {
            "Title": "Multi-Fair Pareto Boosting",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.13312",
            "Abstract": "Fairness-aware machine learning for multiple protected at-tributes (referred to as multi-fairness hereafter) is receiving increasing attention as traditional single-protected attribute approaches cannot en-sure fairness w.r.t. other protected attributes. Existing methods, how-ever, still ignore the fact that datasets in this domain are often imbalanced, leading to unfair decisions towards the minority class. Thus, solutions are needed that achieve multi-fairness,accurate predictive performance in overall, and balanced performance across the different classes.To this end, we introduce a new fairness notion,Multi-Max Mistreatment(MMM), which measures unfairness while considering both (multi-attribute) protected group and class membership of instances. To learn an MMM-fair classifier, we propose a multi-objective problem formulation. We solve the problem using a boosting approach that in-training,incorporates multi-fairness treatment in the distribution update and post-training, finds multiple Pareto-optimal solutions; then uses pseudo-weight based decision making to select optimal solution(s) among accurate, balanced, and multi-attribute fair solutions",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:kUhpeDhEZMUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pattern-miner: integrated management and mining over data mining models",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1401890.1402024",
            "Abstract": "This demo presents Pattern-Miner, an integrated environment for pattern management and mining that deals with the whole lifecycle of patterns, from their generation (using data mining techniques) to their storage and querying, putting also emphasis on the comparison between patterns and meta-mining operations over the extracted patterns. Pattern comparison (comparing results of the data mining process) and meta-mining are high level pattern operations that can be applied in a variety of applications, from database change management to image comparison and retrieval.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Incremental active opinion learning over a stream of opinionated documents",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1509.01288",
            "Abstract": "Applications that learn from opinionated documents, like tweets or product reviews, face two challenges. First, the opinionated documents constitute an evolving stream, where both the author's attitude and the vocabulary itself may change. Second, labels of documents are scarce and labels of words are unreliable, because the sentiment of a word depends on the (unknown) context in the author's mind. Most of the research on mining over opinionated streams focuses on the first aspect of the problem, whereas for the second a continuous supply of labels from the stream is assumed. Such an assumption though is utopian as the stream is infinite and the labeling cost is prohibitive. To this end, we investigate the potential of active stream learning algorithms that ask for labels on demand. Our proposed ACOSTREAM 1 approach works with limited labels: it uses an initial seed of labeled documents, occasionally requests additional labels for documents from the human expert and incrementally adapts to the underlying stream while exploiting the available labeled documents. In its core, ACOSTREAM consists of a MNB classifier coupled with \"sampling\" strategies for requesting class labels for new unlabeled documents. In the experiments, we evaluate the classifier performance over time by varying: (a) the class distribution of the opinionated stream, while assuming that the set of the words in the vocabulary is fixed but their polarities may change with the class distribution; and (b) the number of unknown words arriving at each moment, while the class polarity may also change. Our results show that active learning on a stream of opinionated documents …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:QVtou7C4vgoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reinforcement learning based decision tree induction over data streams with concept drifts",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8588810/",
            "Abstract": "Traditional decision tree induction algorithms are greedy with locally-optimal decisions made at each node based on splitting criteria like information gain or Gini index. A reinforcement learning approach to decision tree building seems more suitable as it aims at maximizing the long-term return rather than optimizing a short-term goal. In this paper, a reinforcement learning approach is used to train a Markov Decision Process (MDP), which enables the creation of a short and highly accurate decision tree. Moreover, the use of reinforcement learning naturally enables additional functionality such as learning under concept drifts, feature importance weighting, inclusion of new features and forgetting of obsolete ones as well as classification with incomplete data. To deal with concept drifts, a reset operation is proposed that allows for local re-learning of outdated parts of the tree. Preliminary experiments show that such …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:_tF6a-HnqWAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Call for Special Issue Papers: Evaluation and Experimental Design in Data Mining and Machine Learning: Deadline for Manuscript Submission: February 1, 2021",
            "Publication year": 2020,
            "Publication url": "https://www.liebertpub.com/doi/pdf/10.1089/big.2020.29037.cfp2",
            "Abstract": "A vital part of proposing new machine learning and data mining approaches is evaluating them empirically to allow an assessment of their capabilities. Numerous choices go into setting up such experiments: how to choose the data, how to preprocess them (or not), potential problems associated with the selection of datasets, what other techniques to compare to (if any), what metrics to evaluate, etc. and last but not least how to present and interpret the results. Learning how to make those choices on-the-job, often by copying the evaluation protocols used in the existing literature, can easily lead to the development of problematic habits. Numerous, albeit scattered, publications have called attention to those questions and have occasionally called into question published results, or the usability of published methods.Those studies consider different evaluation aspects in isolation, and the issue becomes even more …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:rOcdG6UcVlcC",
            "Publisher": "Mary Ann Liebert, Inc., publishers"
        },
        {
            "Title": "Tracing cluster transitions for different cluster types.",
            "Publication year": 2009,
            "Publication url": "https://kbs.uni-hannover.de/~ntoutsi/papers/09.CCjournal.pdf",
            "Abstract": "Clustering algorithms detect groups of similar population members, like customers, news or genes. In many clustering applications the observed population evolves and changes over time, subject to internal and external factors. Detecting and understanding changes is important for decision support. In this work, we present the MONIC+ framework for cluster-type-specific transition modeling and detection. MONIC+ encompasses a typification of clusters and cluster-type-specific transition indicators, by exploiting cluster topology and cluster statistics for the transition detection process. Our experiments on both synthetic and real datasets demonstrate the usefulness and applicability of our framework.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Entity-level stream classification: exploiting entity similarity to label the future observations referring to an entity",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s41060-019-00177-1",
            "Abstract": "Stream classification algorithms traditionally treat arriving instances as independent. However, in many applications, the arriving examples may depend on the “entity” that generated them, e.g. in product reviews or in the interactions of users with an application server. In this study, we investigate the potential of this dependency by partitioning the original stream of instances/“observations” into entity-centric substreams and by incorporating entity-specific information into the learning model. We propose a k-nearest-neighbour-inspired stream classification approach, in which the label of an arriving observation is predicted by exploiting knowledge on the observations belonging to this entity and to entities similar to it. For the computation of entity similarity, we consider knowledge about the observations and knowledge about the entity, potentially from a domain/feature space different from that in which predictions are …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:xm0LlTxljI0C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "ECML PKDD 2020 Workshops: Workshops of the European Conference on Machine Learning and Knowledge Discovery in Databases (ECML PKDD 2020): SoGood 2020, PDFL 2020, MLCS 2020, NFMCP 2020, DINA 2020, EDML 2020, XKDD 2020 and INRA 2020, Ghent, Belgium, September 14-18, 2020, Proceedings",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=nhUZEAAAQBAJ&oi=fnd&pg=PR8&dq=info:NoOeYG9C_yQJ:scholar.google.com&ots=Mhy1s1dZx1&sig=5mCujbuE03jo6P_gKkKLQbC1S4Q",
            "Abstract": "This volume constitutes the refereed proceedings of the workshops which complemented the 20th Joint European Conference on Machine Learning and Knowledge Discovery in Databases, ECML PKDD, held in September 2020. Due to the COVID-19 pandemic the conference and workshops were held online. The 43 papers presented in volume were carefully reviewed and selected from numerous submissions. The volume presents the papers that have been accepted for the following workshops: 5th Workshop on Data Science for Social Good, SoGood 2020; Workshop on Parallel, Distributed and Federated Learning, PDFL 2020; Second Workshop on Machine Learning for Cybersecurity, MLCS 2020, 9th International Workshop on New Frontiers in Mining Complex Patterns, NFMCP 2020, Workshop on Data Integration and Applications, DINA 2020, Second Workshop on Evaluation and Experimental Design in Data Mining and Machine Learning, EDML 2020, Second International Workshop on eXplainable Knowledge Discovery in Data Mining, XKDD 2020; 8th International Workshop on News Recommendation and Analytics, INRA 2020. The papers from INRA 2020 are published open access and licensed under the terms of the Creative Commons Attribution 4.0 International License.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:VRfTbSk87rEC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Density-based community detection in social networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6156357/",
            "Abstract": "This paper deals with community detection in social networks using density-based clustering. We compare two well-known concepts for community detection that are implemented as distance functions in the algorithms SCAN [1] and DEN-GRAPH [2], the structural similarity of nodes and the number of interactions between nodes, respectively, in order to evaluate advantages and limitations of these approaches. Additionally, we propose to use a hierarchical approach for clustering in order to get rid of the problem of choosing an appropriate density threshold for community detection, a severe limitation of the applicability and usefulness of the SCAN and DENGRAPH algorithms in real life applications. We conduct all experiments on data sets with different characteristics, particularly Twitter data and Enron data.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Anomaly Detection in Data Streams",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Amit-Tyagi-3/publication/317888487_Anomaly_Detection_in_Data_Streams/links/5950c33daca27248ae45f62d/Anomaly-Detection-in-Data-Streams.pdf",
            "Abstract": "■ Objective:❑ To find multiple probabilistic models to identify anomalies, evaluate for thier robustness and prove that relevant non-trivial anomalies can be identified automatically",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:9DLIHnF0jcYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Redundancies in data and their effect on the evaluation of recommendation systems: a case study on the amazon reviews datasets",
            "Publication year": 2017,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611974973.44",
            "Abstract": "A collection of datasets crawled from Amazon, “Amazon reviews”, is popular in the evaluation of recommendation systems. These datasets, however, contain redundancies (duplicated recommendations for variants of certain items). These redundancies went unnoticed in earlier use of these datasets and thus incurred to a certain extent wrong conclusions in the evaluation of algorithms tested on these datasets. We analyze the nature and amount of these redundancies and their impact on the evaluation of recommendation methods. While the general and obvious conclusion is that redundancies should be avoided and datasets should be carefully preprocessed, we observe more specifically that their impact depends on the complexity of the methods. With this work, we also want to raise the awareness of the importance of data quality, model understanding, and appropriate evaluation.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:wUn16MOA3RoC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Significance and limitations of stable oxygen isotope ratios in the apatite phosphate of archaeological vertebrate finds for provenance analysis in an Alpine reference region",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/arcm.12399",
            "Abstract": "A multi‐isotope fingerprint consisting of δ18Ophosphate, 87Sr/86Sr, 208Pb/204Pb, 207Pb/204Pb, 206Pb/204Pb, 208Pb/207Pb and 206Pb/207Pb was established in the bioapatite of 219 individual archaeofaunal remains (cattle, pig, red deer) excavated from sites located along a specific transect of the European Alps, namely the Inn–Eisack–Adige–Brenner Passage, that has been of eminent importance since European prehistory. This reference area is vertically stratified, and since δ18O in the skeleton is influenced by climate, water source, physiology and even culture, we tested the relative contribution and importance of δ18O as a component of the multi‐isotope fingerprint for provenance analysis in this alpine region by a novel mathematical approach. In particular, we adapted a supervised learning approach through expectation–maximization (EM) clustering for fingerprint extraction and evaluated the …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:N4u4nq0IxgcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Online template matching over a stream of digitized documents",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2791347.2791354",
            "Abstract": "Although living in the information age for decades, paperwork is still a tedious part of everybody's life. Assistance systems that implement techniques of digitization and document understanding may offer considerable reductions in time and effort for the users. A large portion of paper documents like invoices, delivery receipts or admonitions are based on a fixed company specific template and therefore exhibit a high degree of similarity. In this work, we propose a template extraction method over a stream of incoming documents and a template allocation method for assigning new instances from the stream to the most suitable templates. Our method employs text augmented by layout information to represent the digital image of the paper document. Document similarity is assessed with respect to both textual and layout parts of the document; the matching terms contribute accordingly to their distance to the query terms …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:jmjb1lOE9QIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards trajectory data warehouses",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75177-9_8",
            "Abstract": "Data warehouses have received the attention of the database community as a technology for integrating all sorts of transactional data, dispersed within organisations whose applications utilise either legacy (non-relational) or advanced relational database systems. Data warehouses form a technological framework for supporting decision-making processes by providing informational data. A data warehouse is defined as a subject-oriented, integrated, time-variant, non-volatile collection of data in support of management of decision-making process [10].",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Applying data mining methods for the analysis of stable isotope data in bioarchaeology",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7870904/",
            "Abstract": "Data science methods have the potential to benefit other scientific fields by shedding new light on common questions. One such task is choosing good features for analysis. In this paper, we introduce a data science framework that was designed to allow domain experts to consider their domain knowledge in assembling suitable data sources for complex analyses. The structure of experimental data as represented by a clustering is used to measure the relevance as well as the redundancy of each feature. We present an application of this technique to bioarchaelogical data from a region in the European Alps, a transalpine passage of eminent archaeological importance in European prehistory, the Inn-Eisack-Adige passage, spanning Italy, Austria, and Germany. These results are applied to the task of provenance analysis. The application of the presented data mining technique leads to new insights which were not …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:2vr6o8x5NLkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A unified and flexible framework for comparing simple and complex patterns",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30116-5_45",
            "Abstract": "One of the most important operations involving Data Mining patterns is computing their similarity. In this paper we present a general framework for comparing both simple and complex patterns, i.e., patterns built up from other patterns. Major features of our framework include the notion of structure and measure similarity, the possibility of managing multiple coupling types and aggregation logics, and the recursive definition of similarity for complex patterns.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Extracting opinionated (sub) features from a stream of product reviews",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40897-7_23",
            "Abstract": "We propose a stream mining method that learns opinionated product features from a stream of reviews. Monitoring the attitude of customers towards products is a field of much interest, but the products themselves may come in and out of the market. We rather investigate which (implicit) features of the products are important for the customers, and monitor how customer attitude towards such features evolves. To this purpose, we use a two-level stream clustering algorithm that extracts features and subfeatures from an opinionated stream, and couple it with dedicated feature-specific classifiers that assess the polarity of each extracted (sub)feature. We evaluate our method on a stream of reviews and we elaborate on how changes in the arrival rate of features (drift) affects algorithm performance.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Tracing cluster transitions for different cluster types",
            "Publication year": 2007,
            "Publication url": "http://infolab.cs.unipi.gr/people/ntoutsi/papers/UNIPI-ISL-TR-2007-03.pdf",
            "Abstract": "Clustering algorithms detect groups of similar population members, like customers, news or genes. In many clustering applications the observed population evolves and changes, subject to internal and external factors. Detecting and understanding change is important for decision support. We extend our earlier framework MONIC for cluster transition modeling and detection, into MONIC+ for cluster-type specific transition monitoring. MONIC+ encompasses a typification of clusters and cluster-type-specific transition indicators, by exploiting cluster topology and cluster statistics for transition detection. 3",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:qmtmRrLr0tkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring subspace clustering for recommendations",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2618243.2618283",
            "Abstract": "Typically, recommendations are computed by considering users similar to the user in question. However, scanning the whole database of users for locating similar users is expensive. Existing approaches build user profiles by employing full-dimensional clustering to find sets of similar users. As the datasets we deal with are high-dimensional and incomplete, full-dimensional clustering is not the best option. To this end, we explore the fault tolerance subspace clustering approach that detects clusters of similar users in subspaces of the original feature space and also allows for missing values. Our experiments on real movie datasets show that the diversification of the similar users through subspace clustering results in better recommendations comparing to traditional collaborative filtering and full dimensional clustering approaches.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:TaaCk18tZOkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dealing with bias via data augmentation in supervised learning scenarios",
            "Publication year": 2018,
            "Publication url": "http://l3s.de/~iosifidis/Publications/bias_augmentation.pdf",
            "Abstract": "There is an increasing amount of work from different communities in data mining, machine learning, information retrieval, semantic web, and databases on bias discovery and discrimination-aware learning with the goal of developing not only good quality models but also models that account for fairness. In this work, we focus on supervised learning where biases towards certain attributes like race or gender might exist. We propose data augmentation techniques to correct for bias at the input/data layer. Our experiments with real world datasets show the potential of augmentation techniques for dealing with bias.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:pYKElYtJMmwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The MONIC framework for cluster transition detection",
            "Publication year": 2006,
            "Publication url": "https://kbs.uni-hannover.de/~ntoutsi/papers/06.HDMS.pdf",
            "Abstract": "There is much recent work on detecting and tracking changes in clusters, often based on the study of their spatiotemporal properties. For the many applications where cluster change is relevant, among them customer relationship management, fraud detection and marketing, it is also necessary to provide insights about the nature of change: Is a cluster corresponding to a group of customers simply disappearing or are its members migrating to other clusters? Is a new emerging cluster reflecting a new target group of customers or does it rather consist of existing customers whose preferences shift? To answer such questions, we propose the MONIC framework for modelling and tracking of cluster transitions. Our cluster transition model encompasses changes that involve more than one cluster, thus allowing for insights on cluster change in the whole clustering. Our transition tracking mechanism is not based on the topological properties of clusters, which are only available for some types of clustering, but on the contents of the underlying data stream. We present our first results on monitoring cluster transitions over the ACM digital library.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparing datasets using frequent itemsets: Dependency on the mining parameters",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_20",
            "Abstract": "Comparison between sets of frequent itemsets has been traditionally utilized for raw dataset comparison assuming that frequent itemsets inherit the information lying in the original raw datasets. In this work, we revisit this assumption and examine whether dissimilarity between sets of frequent itemsets could serve as a measure of dissimilarity between raw datasets. In particular, we investigate how the dissimilarity between two sets of frequent itemsets is affected by the minSupport threshold used for their generation and the adopted compactness level of the itemsets lattice, namely frequent itemsets, closed frequent itemsets or maximal frequent itemsets. Our analysis shows that utilizing frequent itemsets comparison for dataset comparison is not as straightforward as related work has argued, a result which is verified through an experimental study and opens issues for further research in the KDD field.",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "FairNN - Conjoint Learning of Fair Representations for Fair Decisions",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-61527-7_38",
            "Abstract": "In this paper, we propose FairNN a neural network that performs joint feature representation and classification for fairness-aware learning. Our approach optimizes a multi-objective loss function which (a) learns a fair representation by suppressing protected attributes (b) maintains the information content by minimizing the reconstruction loss and (c) allows for solving a classification task in a fair manner by minimizing the classification error and respecting the equalized odds-based fairness regularizer. Our experiments on a variety of datasets demonstrate that such a joint approach is superior to separate treatment of unfairness in representation learning or supervised learning. Additionally, our regularizers can be adaptively weighted to balance the different components of the loss function, thus allowing for a very general framework for conjoint fair representation learning and decision making. ",
            "Abstract entirety": 1,
            "Author pub id": "RdA9uxYAAAAJ:TesyEGJKHF4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Active feature acquisition on data streams under feature drift",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s12243-020-00775-2",
            "Abstract": "Traditional active learning tries to identify instances for which the acquisition of the label increases model performance under budget constraints. Less research has been devoted to the task of actively acquiring feature values, whereupon both the instance and the feature must be selected intelligently and even less to a scenario where the instances arrive in a stream with feature drift. We propose an active feature acquisition strategy for data streams with feature drift, as well as an active feature acquisition evaluation framework. We also implement a baseline that chooses features randomly and compare the random approach against eight different methods in a scenario where we can acquire at most one feature at the time per instance and where all features are considered to cost the same. Our initial experiments on 9 different data sets, with 7 different degrees of missing features and 8 different budgets show that …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:YPNY0knpFBYC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "The Panda framework for comparing patterns",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X08001353",
            "Abstract": "Data Mining techniques are commonly used to extract patterns, like association rules and decision trees, from huge volumes of data. The comparison of patterns is a fundamental issue, which can be exploited, among others, to synthetically measure dissimilarities in evolving or different datasets and to compare the output produced by different data mining algorithms on a same dataset. In this paper, we present the Panda framework for computing the dissimilarity of both simple and complex patterns, defined upon raw data and other patterns, respectively. In Panda the problem of comparing complex patterns is decomposed into simpler sub-problems on the component (simple or complex) patterns and so-obtained partial solutions are then smartly aggregated into an overall dissimilarity score. This intrinsically recursive approach grants Panda with a high flexibility and allows it to easily handle patterns with highly …",
            "Abstract entirety": 0,
            "Author pub id": "RdA9uxYAAAAJ:IjCSPb-OGe4C",
            "Publisher": "North-Holland"
        }
    ]
}]