[{
    "name": "Ελισάβετ Κωνσταντίνου",
    "romanize name": "Elisavet Konstantinou",
    "School-Department": "Μηχανικών Πληροφοριακών και Επικοινωνιακών Συστημάτων",
    "University": "aegean",
    "Rank": "Επίκουρος Καθηγητής (Μόνιμος)",
    "Apella_id": 5934,
    "Scholar name": "Elisavet Konstantinou",
    "Scholar id": "V5atJsEAAAAJ",
    "Affiliation": "Assistant Professor, Dep. of Information & Communication Systems Engineering, Univ. of the Aegean",
    "Citedby": 517,
    "Interests": [
        "Cryptography"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=V5atJsEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A framework for identity privacy in SIP",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804509001052",
            "Abstract": "Secure multimedia delivery in modern and future networks is one of the most challenging problems towards the system integration of fourth generation (4G) networks. This integration means that different service and network providers will have to interoperate in order to offer their services to end users. This multidomain environment poses serious threats to the end user who has contract with, and trusts only a limited number of operators and service providers. One such threat is end users’ privacy on which we will focus in this paper. Probably the most promising protocol for multimedia session management is the Session Initiation Protocol (SIP), which is an application layer protocol and thus can operate on top of different lower layer technologies. SIP is quite popular and a lot of research has been conducted; however, it still has some security issues, one of which is related to privacy and more particularly the …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Efficient generation of secure elliptic curves",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10207-006-0009-3.pdf",
            "Abstract": "In many cryptographic applications it is necessary to generate elliptic curves (ECs) whose order possesses certain properties. The method that is usually employed for the generation of such ECs is the so-called Complex Multiplication method. This method requires the use of the roots of certain class field polynomials defined on a specific parameter called the discriminant. The most commonly used polynomials are the Hilbert and Weber ones. The former can be used to generate directly the EC, but they are characterized by high computational demands. The latter have usually much lower computational requirements, but they do not directly construct the desired EC. This can be achieved if transformations of their roots to the roots of the corresponding (generated by the same discriminant) Hilbert polynomials are provided. In this paper we present a variant of the Complex Multiplication method that generates …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "TNFS resistant families of pairing-friendly elliptic curves",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397519306462",
            "Abstract": "Recently there has been a significant progress on the tower number field sieve (TNFS) method, reducing the complexity of the discrete logarithm problem (DLP) in finite field extensions of composite degree. These new variants of the TNFS attacks have a major impact on pairing-based cryptography and particularly on the selection of the underlying elliptic curve groups and extension fields. In this paper we revise the criteria for selecting pairing-friendly elliptic curves considering these new TNFS attacks in finite extensions of composite embedding degree. Additionally we update the criteria for finite extensions of prime degree in order to meet today's security requirements.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Efficient certification path discovery for MANET",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2010/243985.pdf",
            "Abstract": "A Mobile Ad Hoc Network (MANET) is characterized by the lack of any infrastructure, absence of any kind of centralized administration, frequent mobility of nodes, network partitioning, and wireless connections. These properties make traditional wireline security solutions not straightforwardly applicable in MANETs, and of course, constitute the establishment of a Public Key Infrastructure (PKI) in such networks a cumbersome task. After surveying related work, we propose a novel public key management scheme using the well-known web-of-trust or trust graph model. Our scheme is based on a binary tree formation of the network's nodes. The binary tree structure is proved very effective for building certificate chains between communicating nodes that are multihops away and the cumbersome problem of certificate chain discovery is avoided. We compare our scheme with related work and show that it presents …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Cluster-based group key agreement for wireless ad hoc networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4529389/",
            "Abstract": "The establishment of a group key in wireless ad hoc networks is considered a difficult task from both an algorithmic and computational point of view. The reason is the special nature and the constraints posed by these networks. In this paper, we present an efficient group key agreement protocol which is particularly suitable for energy constrained, dynamically evolving wireless ad hoc networks. The topology of the network is reflected in a structure composed by small clusters. This clustering allows the synchronous execution of efficient tripartite key agreement protocols based on pairings. The required computations are simple for the devices to implement, the size of the exchanged messages is minimum and the storage memory required in every node is very small. The proposed protocol also avoids the usage of a TTP or a central authority and achieves a good energy balance. Finally, we compare the …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Constant round group key agreement protocols: A comparative study",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404811001088",
            "Abstract": "The scope of this paper is to review and evaluate all constant round Group Key Agreement (GKA) protocols proposed so far in the literature. We have gathered all GKA protocols that require 1,2,3,4 and 5 rounds and examined their efficiency. In particular, we calculated each protocol’s computation and communication complexity and using proper assessments we compared their total energy cost. The evaluation of all protocols, interesting on its own, can also serve as a reference point for future works and contribute to the establishment of new, more efficient constant round protocols.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Introducing Ramanujan's Class Polynomials in the Generation of Prime Order Elliptic Curves",
            "Publication year": 2008,
            "Publication url": "https://arxiv.org/abs/0804.1652",
            "Abstract": "In this paper, we propose the use of Ramanujan class of polynomials for the construction of prime order elliptic curves using the CM-method. We compare (theoretically and experimentally) the efficiency of using this new class against the use of the Weber,  and  polynomials and show that they clearly outweigh all of them in the generation of prime order elliptic curves.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "What is your “birthday elliptic curve”?",
            "Publication year": 2012,
            "Publication url": "http://users.uoa.gr/~kontogar/OldWEB/bibtex/Aristides-Elisavet-ChikHow.pdf",
            "Abstract": "In 2009 at Max Planck Institut für Mathematik (Bonn), P. Stevenhagen asked the following question:",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agent-based distributed group key establishment in wireless sensor networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4351807/",
            "Abstract": "Wireless sensor networks are comprised of a vast number of ultra-small autonomous computing, communication and sensing devices, with restricted energy and computing capabilities, that co-operate to accomplish a large sensing task. Such networks can be very useful in practice, e.g. in the local monitoring of ambient conditions and reporting them to a control center. In this paper we propose a distributed group key establishment protocol that uses mobile agents (software) and is particularly suitable for energy constrained, dynamically evolving ad-hoc networks. Our approach totally avoids the construction and the maintenance of a distributed structure that reflects the topology of the network. Moreover, it trades-off complex message exchanges by performing some amount of additional local computations in order to be applicable at dense and dynamic sensor networks. The extra computations are simple for the …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Securing Embedded Computing Systems through Elliptic Curve Cryptography",
            "Publication year": 2013,
            "Publication url": "https://www.igi-global.com/chapter/content/76967",
            "Abstract": "Embedded computing devices dominate our everyday activities, from cell phones to wireless sensors that collect and process data for various applications. Although desktop and high-end server security seems to be under control by the use of current security technology, securing the low-end embedded computing systems is a difficult long-term problem. This is mainly due to the fact that the embedded systems are constrained by their operational environment and the limited resources they are equipped with. Recent research activities focus on the deployment of lightweight cryptographic algorithms and security protocols that are well suited to the limited resources of low-end embedded systems. Elliptic Curve Cryptography (ECC) offers an interesting alternative to the classical public key cryptography for embedded systems (eg, RSA and ElGamal), since it uses smaller key sizes for achieving the same security level …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Ramanujan’s class invariants and their use in elliptic curve cryptography",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0898122110001173",
            "Abstract": "The Complex Multiplication (CM) method is a method frequently used for the generation of elliptic curves (ECs) over a prime field F p. The most demanding and complex step of this method is the computation of the roots of a special type of class polynomials, called Hilbert polynomials. However, there are several polynomials, called class polynomials, which can be used in the CM method, having much smaller coefficients, and fulfilling the prerequisite that their roots can be easily transformed to the roots of the corresponding Hilbert polynomials. In this paper, we propose the use of a new class of polynomials which are derived from Ramanujan’s class invariants t n. We explicitly describe the algorithm for the construction of the new polynomials and give the necessary transformation of their roots to the roots of the corresponding Hilbert polynomials. We provide a theoretical asymptotic bound for the bit …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:UebtZRa9Y70C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "On the Use of Weber polynomials in elliptic curve cryptography",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-25980-0_28",
            "Abstract": "In many cryptographic applications it is necessary to generate elliptic curves (ECs) with certain security properties. These curves are commonly constructed using the Complex Multiplication method which typically uses the roots of Hilbert or Weber polynomials. The former generate the EC directly, but have high computational demands, while the latter are faster to construct but they do not lead, directly, to the desired EC. In this paper we present in a simple and unifying manner a complete set of transformations of the roots of a Weber polynomial to the roots of its corresponding Hilbert polynomial for all discriminant values on which they are defined. Moreover, we prove a theoretical estimate of the precision required for the computation of Weber polynomials. Finally, we experimentally assess the computational efficiency of the Weber polynomials along with their precision requirements for various discriminant …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the efficient generation of prime-order elliptic curves",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00145-009-9037-2.pdf",
            "Abstract": "We consider the generation of prime-order elliptic curves (ECs) over a prime field    using the Complex Multiplication (CM) method. A crucial step of this method is to compute the roots of a special type of class field polynomials with the most commonly used being the Hilbert and Weber ones. These polynomials are uniquely determined by the CM discriminant D. In this paper, we consider a variant of the CM method for constructing elliptic curves (ECs) of prime order using Weber polynomials. In attempting to construct prime-order ECs using Weber polynomials, two difficulties arise (in addition to the necessary transformations of the roots of such polynomials to those of their Hilbert counterparts). The first one is that the requirement of prime order necessitates that D≡3mod8), which gives Weber polynomials with degree three times larger than the degree of their corresponding Hilbert polynomials (a fact that could affect …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A software library for elliptic curve cryptography",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45749-6_55",
            "Abstract": "We present an implementation of an EC cryptographic library targeting three main objectives: portability, modularity, and ease of use. Our goal is to provide a fully-equipped library of portable source code with clearly separated modules that allows for easy development of EC cryptographic protocols, and which can be readily tailored to suit different requirements and user needs. We discuss several implementation issues regarding the development oft he library and report on some preliminary experiments.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Efficient cluster-based group key agreement protocols for wireless ad hoc networks",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804510000962",
            "Abstract": "The special nature and the constraints posed by wireless ad hoc networks make the establishment of a group key among all nodes a difficult and challenging task. Therefore, the execution of a group key agreement protocol which involves all the nodes in the network must be very carefully selected having in mind both the computation and communication efficiency. In this paper, we present an efficient group key agreement protocol which is particularly suitable for energy constrained, dynamically evolving wireless ad hoc networks. The topology of the network is reflected in a structure composed by small clusters. This clustering allows the synchronous execution of efficient tripartite key agreement protocols based on pairings. The required computations are simple for the devices to implement, the size of the exchanged messages is minimum and the storage memory required in every node is very small. The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "DNSSEC vs. DNSCurve: A side-by-side comparison",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/content/62383",
            "Abstract": "Without a doubt, Domain Name System (DNS) security is a complicated topic of growing concern. In fact, it can be argued that the whole Internet infrastructure depends on the smooth operation of the DNS service. Despite this fact, the original DNS design concentrated on availability, not security, and thus included no authentication. Nowadays, this security gap has been addressed by two cryptographic mechanisms: DNSSEC and DNSCurve. They both utilize public key cryptography and extend the core DNS protocol. Although the second mechanism is still in its infancy while the first is well-standardized, they are both promising and are quite likely to compete with each other in the near future to gain acceptance. This work aims to provide a comprehensive and constructive comparison between the aforementioned security mechanisms. Towards this direction, the authors theoretically cross-evaluate and assess the …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A cluster-based framework for the security of medical sensor environments",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03748-1_6",
            "Abstract": "The adoption of Wireless Sensor Networks (WSNs) in the healthcare sector poses many security issues, mainly because medical information is considered particularly sensitive. The security mechanisms employed are expected to be more efficient in terms of energy consumption and scalability in order to cope with the constrained capabilities of WSNs and patients’ mobility. Towards this goal, cluster-based medical WSNs can substantially improve efficiency and scalability. In this context, we have proposed a general framework for cluster-based medical environments on top of which security mechanisms can rely. This framework fully covers the varying needs of both in-hospital environments and environments formed ad hoc for medical emergencies. In this paper, we further elaborate on the security of our proposed solution. We specifically focus on key establishment mechanisms and investigate the group …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Revisiting the Complex Multiplication Method for the Construction of Elliptic Curves",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-18275-9_12",
            "Abstract": "In this article we give a detailed overview of the Complex Multiplication (CM) method for constructing elliptic curves with a given number of points. In the core of this method, there is a special polynomial called Hilbert class polynomial which is constructed with input a fundamental discriminantd < 0. The construction of this polynomial is the most demanding and time-consuming part of the method and thus the use of several alternative polynomials has been proposed in previous work. All these polynomials are calledclass polynomials and they are generated by proper values of modular functions calledclass invariants. Besides an analysis on these polynomials, in this paper we will describe our results about finding new class invariants using the Shimura reciprocity law. Finally, we will see how the choice of the discriminant can affect the degree of the class polynomial and consequently the efficiency of the …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Generating pairing-friendly elliptic curve parameters using sparse families",
            "Publication year": 2018,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/jmc-2017-0024/html",
            "Abstract": "The majority of methods for constructing pairing-friendly elliptic curves are based on representing the curve parameters as polynomial families. There are three such types, namely complete, complete with variable discriminant and sparse families. In this paper, we present a method for constructing sparse families and produce examples of this type that have not previously appeared in the literature, for various embedding degrees. We provide numerical examples obtained by these sparse families, considering for the first time the effect of the recent progress on the tower number field sieve (TNFS) method for solving the discrete logarithm problem (DLP) in finite field extensions of composite degree.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the construction of prime order elliptic curves",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24582-7_23",
            "Abstract": "We consider a variant of the Complex Multiplication (CM) method for constructing elliptic curves (ECs) of prime order with additional security properties. Our variant uses Weber polynomials whose discriminant D is congruent to 3 (mod 8), and is based on a new transformation for converting roots of Weber polynomials to their Hilbert counterparts. We also present a new theoretical estimate of the bit precision required for the construction of the Weber polynomials for these values of D. We conduct a comparative experimental study investigating the time and bit precision of using Weber polynomials against the (typical) use of Hilbert polynomials. We further investigate the time efficiency of the new CM variant under four different implementations of a crucial step of the variant and demonstrate the superiority of two of them.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Electronic national lotteries",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-27809-2_18",
            "Abstract": "We describe the design and implementation of secure and robust protocol and system for a national electronic lottery. Electronic lotteries at a national level are a viable cost effective alternative to mechanical ones when there is a business need to support many types of ”games of chance” and to allow increased drawing frequency. Electronic lotteries are, in fact, extremely high risk financial application: If one discovers a way to predict or otherwise claim the winning numbers (even once) the result is huge financial damages. Moreover, the e-lottery process is complex, which increases the possibility of fraud or costly accidental failures. In addition, a national lottery must adhere to auditability and (regulatory) fairness requirements regarding its drawings. Our mechanism, which we believe is the first one of its kind to be described in the literature, builds upon a number of cryptographic primitives that ensure the …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Clustering oriented architectures in medical sensor environments",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4529443/",
            "Abstract": "Wireless sensor networks are expected to make a significant contribution in the healthcare sector by enabling continuous patient monitoring. Since medical services and the associated to them information are considered particularly sensitive, the employment of wireless sensors in medical environments poses many security issues and challenges. However, security services and the underlying key management mechanisms cannot be seen separately from the efficiency and scalability requirements. Network clustering used in both routing and group key management mechanisms can improve the efficiency and scalability and therefore can also be envisioned in medical environments. This paper introduces a general framework for cluster-based wireless sensor medical environments on the top of which efficient security mechanisms can rely. We describe two different scenarios for infrastructure and infrastructure …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient constant round id-based group key agreement protocol for ad hoc networks",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38631-2_41",
            "Abstract": "We present an authenticated ID-based Group Key Agreement (GKA) protocol which requires only one round for its execution. The protocol is contributory, energy-balanced and does not require an online TTP. All these properties and in particular the minimum round requirement, makes the protocol especially suited for ad hoc networks. In the paper, we will demonstrate the security properties of the new GKA protocol and present its communication/computation efficiency. Finally, we will compare the new protocol with all the one-round GKA protocols proposed so far in the literature and show that it outperforms all the ID-based protocols of this category.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Ordinary Pairing-Friendly Genus 2 Hyperelliptic Curves with Absolutely Simple Jacobians",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-72453-9_33.pdf",
            "Abstract": "We present a method for producing pairing-friendly, simple, ordinary Jacobian varieties of genus 2 hyperelliptic curves defined over a prime field . The proposed method heavily relies on the construction of a suitable p-Weil number and a corresponding quartic CM-field. Our Jacobians are absolutely simple and for this special class of Jacobians we give the first examples in the literature with -values below 4, while previous results had in general -values between 6 and 8. These examples derive from “families” of pairing-friendly Jacobians, which are basically polynomial representations of the Jacobian parameters.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Some remarks on the construction of class polynomials",
            "Publication year": 2011,
            "Publication url": "https://www.aimsciences.org/article/doi/10.3934/amc.2011.5.109",
            "Abstract": "Class invariants are singular values of modular functions which generate the class fields of imaginary quadratic number fields. Their minimal polynomials, called class polynomials, are uniquely determined by a discriminant− D< 0 and are used in many applications, including the generation of elliptic curves. In all these applications, it is desirable that the size of the polynomials is as small as possible. Among all known class polynomials, Weber polynomials constructed with discriminants− D≡ 1 (mod 8) have the smallest height and require the least precision for their construction. In this paper, we will show that this fact does not necessarily lead to the most efficient computations, since the congruences modulo 8 of the discriminants affect the degrees of the polynomials.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:5nxA0vEk-isC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Performance evaluation of ID-based group key agreement protocols",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6045988/",
            "Abstract": "In this paper we present all ID-based Group Key Agreement (GKA) protocols proposed so far in the literature and evaluate their efficiency. The protocols have been categorized into 5 different classes and we have computed their computation and communication complexity having as parameter the size of the group. Our theoretical analysis shows in detail the computation and communication cost of the protocols taking into account also the size of the sent messages, while our extensive experimental assessments compare their total energy cost for different group sizes. Furthermore, our evaluation is presented in a generalized way and can therefore serve as a reference point for future evaluations and for the design of new, improved ID-based GKA protocols.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Revisiting WiMAX MBS security",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0898122110000052",
            "Abstract": "IEEE 802.16 technology also well known as WiMax is poised to deliver the next step in the wireless evolution. This is further fostered by the 802.16e specification which, amongst other things, introduces support for mobility. The Multicast/Broadcast Service (MBS) is also an integral part of 802.16e destined to deliver next generation services to subscribers. In this paper we concentrate on the Multicast and Broadcast Rekeying Algorithm (MBRA) of 802.16e. This algorithm has been recently criticized for various vulnerabilities and security inefficiencies, as its designers are trying to balance wisely between performance and security. After surveying related work, we extensively discuss MBRA security issues and propose the use of a novel asymmetric group key agreement protocol based on the work in Wu et al. (2009) [3]. Our scheme guarantees secure delivery of keys to all the members of a given group and mandates …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Modeling Multiple Modes of Operation with Alloy",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35264-5_11",
            "Abstract": "Specification (or modeling) languages can be very handy in describing certain aspects of a system and check properties of interest about it. Also, once a model is constructed, one is able to use the associated analyzer to create examples and/or counterexamples to explore hypotheses posed about the system. In the context of cryptography this verification process is of great importance as it can contribute towards finding weaknesses and assessing system’s robustness. This paper capitalizes on the well-known Alloy language to model and analyze attacks on DES triple modes namely ECB∣ECB∣CBC− 1 and ECB∣OFB∣OFB. We model attacks described in [5] and show that they can be fruitful in the general case. This work can serve as a framework in modeling similar cryptosystems and assessing certain attacks on them.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the efficient generation of elliptic curves over prime fields",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36400-5_25",
            "Abstract": "We present a variant of the complex multiplication method that generates elliptic curves of cryptographically strong order. Our variant is based on the computation ofWeber polynomials that require significantly less time and space resources than their Hilbert counterparts. We investigate the time efficiency and precision requirements for generating off-line Weber polynomials and its comparison to another variant based on the off-line generation of Hilbert polynomials. We also investigate the efficiency of our variant when the computation of Weber polynomials should be made on-line due to limitations in resources (e.g., hardware devices of limited space).We present trade-offs that could be useful to potential implementors of elliptic curve cryptosystems on resource-limited hardware devices.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Elliptic Curve & Algebraic Geometry-On the Construction of Prime Order Elliptic Curves",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=10279165500367356008&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:TFP_iSt0sucC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Generating prime order elliptic curves: difficulties and efficiency considerations",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/11496618_20",
            "Abstract": "We consider the generation of prime order elliptic curves (ECs) over a prime field  using the Complex Multiplication (CM) method. A crucial step of this method is to compute the roots of a special type of class field polynomials with the most commonly used being the Hilbert and Weber ones, uniquely determined by the CM discriminant D. In attempting to construct prime order ECs using Weber polynomials two difficulties arise (in addition to the necessary transformations of the roots of such polynomials to those of their Hilbert counterparts). The first one is that the requirement of prime order necessitates that D ≡ 3 (mod 8), which gives Weber polynomials with degree three times larger than the degree of their corresponding Hilbert polynomials (a fact that could affect efficiency). The second difficulty is that these Weber polynomials do not have roots in . In this paper we show how to overcome the above difficulties and …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "More sparse families of pairing-friendly elliptic curves",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-12280-9_25",
            "Abstract": "Generating pairing-friendly elliptic curves is a crucial step in the deployment of pairing-based cryptographic applications. The most efficient method for their construction is based on polynomial families, namely complete families, complete families with variable discriminant and sparse families. In this work we further study the case of sparse families which seem to produce more pairing-friendly elliptic curves than the other two polynomial families and also can lead to better ρ-values in many cases. We present two general methods for producing sparse families and we apply them for four embedding degrees . Particularly for k = 5 we introduce for the first time the use of Pell equations by setting a record with ρ = 3/2 and we present a family that has better chances in producing suitable curve parameters than any other reported family for . In addition we generalise some existing examples …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Computing polynomials of the Ramanujan tn class invariants",
            "Publication year": 2009,
            "Publication url": "https://www.cambridge.org/core/journals/canadian-mathematical-bulletin/article/computing-polynomials-of-the-ramanujan-tn-class-invariants/94C2980C158CA87B70DB8C32F59D07AD",
            "Abstract": "We compute the minimal polynomials of the Ramanujan values , where , using the Shimura reciprocity law. These polynomials can be used for defining the Hilbert class field of the imaginary quadratic field and have much smaller coefficients than the Hilbert polynomials.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Pairing-Friendly Elliptic Curves Resistant to TNFS Attacks⋆",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Fotiadis/publication/328051782_Pairing-Friendly_Elliptic_Curves_Resistant_to_TNFS_Attacks/links/5bb5149892851ca9ed379357/Pairing-Friendly-Elliptic-Curves-Resistant-to-TNFS-Attacks.pdf",
            "Abstract": "The recent progress on the tower number field sieve (TNFS) method reduce the complexity of the discrete logarithm problem (DLP) in finite extensions Fqk of composite degree and this has a major impact on the selection of pairing-friendly elliptic curve parameters. In this paper we revise the criteria for selecting pairing-friendly elliptic curves in order to surpass the TNFS attacks in finite extensions of composite embedding degree. We also update the criteria for selecting suitable elliptic curves of prime embedding degree in order to meet today’s security requirements.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design, analysis and performance evaluation of group key establishment in wireless sensor networks",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1571066107000655",
            "Abstract": "Wireless sensor networks are comprised of a vast number of ultra-small autonomous computing, communication and sensing devices, with restricted energy and computing capabilities, that co-operate to accomplish a large sensing task. Such networks can be very useful in practice, e.g. in the local monitoring of ambient conditions and reporting them to a control center. In this paper we propose a new lightweight, distributed group key establishment protocol suitable for such energy constrained networks. Our approach basically trade-offs complex message exchanges by performing some amount of additional local computations. The extra computations are simple for the devices to implement and are evenly distributed across the participants of the network leading to good energy balance. We evaluate the performance our protocol in comparison to existing group key establishment protocols both in simulated and real …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Developing quantum nanocomputing for pervasive health environments",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1579114.1579182",
            "Abstract": "A model of quantum information processing is proposed for applications in health-care and assistive environments. It uses implanted nano-chips which could incorporate quantum computing technology and make use of the advantages of high computing and large memory capacity of a quantum system to the data storage procedure of a medical sensor. Quantum information and its storage has not yet been physically demonstrated due to the problem of decoherence that dominates such quantum systems. Fault-tolerant quantum error-correction (QEC) circuits have done great efforts to reduce the noise level. In this work a QEC circuit simulator is proposed which takes into consideration the memory noise and the gate noise produced during the evolving process of qubits. For any computational step the probability crash is estimated under different error rates and various parameters. A case study is presented …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "“Trust Engineering:” From Requirements to System Design and Maintenance–A Working National Lottery System Experience",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11556992_4",
            "Abstract": "Based on our experience in designing, building and maintaining an information system for supporting a large scale electronic lottery, we present in this paper a unified approach to the design and implementation of electronic lotteries with the focus on pragmatic trust establishment. This approach follows closely the methodologies commonly employed in the development of general information systems. However, central to the proposed approach is the decomposition of a security critical system into layers containing basic trust components so as to facilitate the management of trust, first along the layers, and then as we move from layer to layer. We believe that such a structured approach, based on layers and trust components, can help designers of security critical applications produce demonstrably robust and verifiable systems that people will not hesitate to use.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Binary tree based public-key management for mobile ad hoc networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4726144/",
            "Abstract": "The establishment of a public key infrastructure (PKI) in mobile ad hoc networks (MANETs) is considered a difficult task because of the intrinsic characteristics of these networks. The absence of centralized services and the possible network partitions make traditional security solutions not straightforwardly applicable in MANETs. In this paper, we propose a public key management scheme based on a binary tree formation of the network¿s nodes. Using the binary tree structure, certificate chains are easily built between communicating nodes that are multi-hops away and the cumbersome problem of certificate chain discovery is avoided. We argue that our mechanism has several advantages over similar solutions, especially when a fair balancing between security and performance is terminus.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the efficient generation of generalized mnt elliptic curves",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40663-8_15",
            "Abstract": "Finding suitable elliptic curves for pairing-based cryptosystems is a crucial step for their actual deployment. Miyaji, Nakabayashi and Takano [12] (MNT) were the first to produce ordinary pairing-friendly elliptic curves of prime order with embedding degree . Scott and Barreto [16] as well as Galbraith et al. [10] extended this method by allowing the group order to be non-prime. The advantage of this idea is the construction of much more suitable elliptic curves, which we will call generalized MNT curves. A necessary step for the construction of such elliptic curves is finding the solutions of a generalized Pell equation. However, these equations are not always solvable and this fact considerably affects the efficiency of the curve construction. In this paper we discuss a way to construct generalized MNT curves through Pell equations which are always solvable and thus considerably improve the efficiency of …",
            "Abstract entirety": 0,
            "Author pub id": "V5atJsEAAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Ramanujan invariants for discriminants congruent to 5 (mod 24)",
            "Publication year": 2012,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S1793042112500157",
            "Abstract": "In this paper we compute the minimal polynomials of Ramanujan values  for discriminants D ≡ 5 (mod 24). Our method is based on Shimura Reciprocity Law as which was made computationally explicit by Gee and Stevenhagen in [Generating class fields using Shimura reciprocity, in Algorithmic Number Theory, Lecture Notes in Computer Science, Vol. 1423 (Springer, Berlin, 1998), pp. 441–453; MR MR1726092 (2000m:11112)]. However, since these Ramanujan values are not class invariants, we present a modification of the method used in [Generating class fields using Shimura reciprocity, in Algorithmic Number Theory, Lecture Notes in Computer Science, Vol. 1423 (Springer, Berlin, 1998), pp. 441–453; MR MR1726092 (2000m:11112)] which can be applied on modular functions that do not necessarily yield class invariants.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:0EnyYjriUFMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "A survey on cluster-based group key agreement protocols for WSNs",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5522466/",
            "Abstract": "The scope of this survey is to examine and thoroughly evaluate the cluster-based Group Key Agreement (GKA) protocols for Wireless Sensor Networks (WSNs). Towards this goal, we have grouped the WSNs application environments into two major categories (i.e., infrastructure-based and infrastructureless) and have examined: a) which of the cluster-based Group Key Agreement (GKA) protocols that appear in the literature are applicable to each category, and b) to which degree these protocols will impact the systems' performance and energy consumption. In order to answer these questions we have calculated the complexity of each protocol and the energy cost it will add to the system. The evaluation of all discussed protocols is presented in a generalized way and can therefore serve as a reference point for future evaluations and for the design of new, improved GKA protocols.",
            "Abstract entirety": 1,
            "Author pub id": "V5atJsEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        }
    ]
}]