[{
    "name": "Εμμανουήλ Μαραγκουδάκης",
    "romanize name": "Emmanouil Maragkoudakis",
    "School-Department": "Πληροφορικής",
    "University": "ionio",
    "Rank": "Καθηγητής",
    "Apella_id": 19548,
    "Scholar name": "Manolis Maragoudakis",
    "Scholar id": "MYXXMRIAAAAJ",
    "Affiliation": "University of the Aegean, Greece",
    "Citedby": 1187,
    "Interests": [
        "Data Mining",
        "Artificial Intelligence",
        "Machine Learning"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=MYXXMRIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Intelligent-Miner: The Conceptual and Architectural Design of a Web Based Data Mining Service",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/47489067/Intelligent_-_Miner_The_Conceptual_and_A20160724-8901-nhxdle.pdf",
            "Abstract": "The purpose of this paper is to present the conceptual and architectural design of a web enabled service that supports the implementation of data mining techniques. The particular service is addressed mainly to scientists who lack of data mining domain expertise but want to investigate hidden relationships among their experimental or observational data. A novelty of the proposed service relies on the fact that it proposes a common data presentation format which is scalable, robust and extensible, thus allowing scientists from different applications areas to adapt their raw data and use the proposed service. This particular service introduces the most proper data mining technique by investigating several complementary principles like Bayesian networks, neural networks, decision trees, support vector machines and other core algorithms from the field of machine learning and artificial intelligence. The service has been effectively used in a case study which is briefly described.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital storytelling for good with Tappetina game",
            "Publication year": 2019,
            "Publication url": "https://munin.uit.no/handle/10037/16613",
            "Abstract": "Context - Storytelling is an important asset in today’s society. Digital platforms for storytelling can facilitate collaborative development of stories. The storytelling process, if properly facilitated, can lead to the creation of stories that improve the relations between the players. Moreover, stories convey important information about the players and their interaction. Extended knowledge and better tools are needed about how to facilitate storytelling for good and analysis to exploit the power of the generated data. Research question - How to facilitate Digital Storytelling for good? Method - The investigation is based on a case study approach in which participants have been engaged in the creation of stories. The study is based on empirical data collection and analysis: from the stories recorded, we extract the storytelling features and performance. We have provided qualitative (Domain Expert) and quantitative (Machine Learning) analysis of the stories. In total, 58 users played the game in 15 sessions. Results and conclusions - The main result is a framework for analysing digital stories. The analysis gives an indication of which game building blocks lead to stories for good. Future work will include a redesign of the game and its building blocks which lead to stories for good and further analyses.Research question - How to facilitate Digital Storytelling for good? Method - The investigation is based on a case study approach in which participants have been engaged in the creation of stories. The study is based on empirical data collection and analysis: from the stories recorded, we extract the storytelling features and performance. We have provided qualitative (Domain Expert) and quantitative (Machine Learning) analysis of the stories. In total, 58 users played the game in 15 sessions. Results and conclusions - The main result is a framework for analysing digital stories. The analysis gives an indication of which game building blocks lead to stories for good. Future work will include a redesign of the game and its building blocks which lead to stories for good and further analyses.Method - The investigation is based on a case study approach in which participants have been engaged in the creation of stories. The study is based on empirical data collection and analysis: from the stories recorded, we extract the storytelling features and performance. We have provided qualitative (Domain Expert) and quantitative (Machine Learning) analysis of the stories. In total, 58 users played the game in 15 sessions. Results and conclusions - The main result is a framework for analysing digital stories. The analysis gives an indication of which game building blocks lead to stories for good. Future work will include a redesign of the game and its building blocks which lead to stories for good and further analyses.Results and conclusions - The main result is a framework for analysing digital stories. The analysis gives an indication of which game building blocks lead to stories for good. Future work will include a redesign of the game and its building blocks which lead to stories for good and further analyses.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Improving quality of educational processes providing new knowledge using data mining techniques",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877042814040282",
            "Abstract": "One of the biggest challenges that Higher Education Institutions (HEI) faces is to improve the quality of their educational processes. Thus, it is crucial for the administration of the institutions to set new strategies and plans for a better management of the current processes. Furthermore, the managerial decision is becoming more difficult as the complexity of educational entities increase. The purpose of this study is to suggest a way to support the administration of a HEI by providing new knowledge related to the educational processes using data mining techniques. This knowledge can be extracted among other from educational data that derive from the evaluation processes that each department of a HEI conducts. These data can be found in educational databases, in students’ questionnaires or in faculty members’ records. This paper presents the capabilities of data mining in the context of a Higher Education Institute …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:lSLTfruPkqcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Dealing with imbalanced data using Bayesian techniques",
            "Publication year": 2006,
            "Publication url": "https://aclanthology.org/L06-1303/",
            "Abstract": "For the present work, we deal with the significant problem of high imbalance in data in binary or multi-class classification problems. We study two different linguistic applications. The former determines whether a syntactic construction (environment) co-occurs with a verb in a natural text corpus consists a subcategorization frame of the verb or not. The latter is called Name Entity Recognition (NER) and it concerns determining whether a noun belongs to a specific Name Entity class. Regarding the subcategorization domain, each environment is encoded as a vector of heterogeneous attributes, where a very high imbalance between positive and negative examples is observed (an imbalance ratio of approximately 1: 80). In the NER application, the imbalance between a name entity class and the negative class is even greater (1: 120). In order to confront the plethora of negative instances, we suggest a search tactic during training phase that employs Tomek links for reducing unnecessary negative examples from the training set. Regarding the classification mechanism, we argue that Bayesian networks are well suited and we propose a novel network structure which efficiently handles heterogeneous attributes without discretization and is more classification-oriented. Comparing the experimental results with those of other known machine learning algorithms, our methodology performs significantly better in detecting examples of the rare class.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel approach for visual data mining in Twitter micro-blogging platform",
            "Publication year": 2016,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSNM.2016.082647",
            "Abstract": "In today's world of data dominance, social networking websites and especially micro-blogging platforms, form the largest share in current unstructured textual data. If the proper tools, such as sentiment analysis and topic modelling are applied to that data, valuable information would be produced. That information in turn could offer insights from understanding market trends to interpreting social phenomena. A question that comes to mind is: How can we use that information to enhance knowledge discovery and results readability? The answer is data visualisation. The purpose of this paper is to present a tool that was designed and developed to make use of network analysis algorithms in order to visualise social networking data. The goal of implementing this system is to create visual patterns from social media that leads to knowledge discovery and readable analysis results.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "Natural language in dialogue systems. A case study on a medical application",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.75.4549&rep=rep1&type=pdf",
            "Abstract": "The effective acquisition of information, along with the comprehensive dialogue system’s response, happen to be of great importance in the medical applications domain, where accuracy of information is essential and users are usually inexperienced and unwilling to participate in long, exhausting interactions. The use of natural language is a promising idea since it is direct, natural for the humans and does not require any special training. Our effort presents a natural language interaction system, developed by Hellenic partners and utilized with success in the medical domain of pneumonia treatment. Experimental results and comparisons with other approaches tabulate improvement in time response as well as in the correctness of the answers. The evaluation of the method was made using a group of 20 persons of different specialties (medical stuff/doctors/computer users/students) which were already informed about how to use the system and each one supplied 25 different questions.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Random forests identification of gas turbine faults",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4616625/",
            "Abstract": "In the present paper, Random Forests are used in a critical and at the same time non trivial problem concerning the diagnosis of Gas Turbine blading faults, portraying promising results. Random forests-based fault diagnosis is treated as a Pattern Recognition problem, based on measurements and feature selection. Two different types of inserting randomness to the trees are studied, based on different theoretical assumptions. The classifier is compared against other Machine Learning algorithms such as Neural Networks, Classification and Regression Trees, Naive Bayes and K-Nearest Neighbor. The performance of the prediction model reaches a level of 97% in terms of precision and recall, improving the existing state-of-the-art levels achieved by Neural Networks by a factor of 1.5%-2%. Furthermore, emphasis is given on the pre-processing phase, where feature selection and outliers identification is carried out …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improving SMS usability using Bayesian networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46014-4_17",
            "Abstract": "During the last years, the significant increase of mobile communications has resulted in the wide acceptance of a plethora of new services, like communication via written short messages (SMS). The limitations of the dimensions and the number of keys of the mobile phone keypad are probably the main obstacles of this service. Numerous intelligent techniques have been developed aiming at supporting users of SMS services. Special emphasis has been provided to the efficient and effective editing of words. In the presented research, we introduce a predictive algorithm that forecasts Greek letters occurrence during the process of compiling an SMS. The algorithm is based on Bayesian networks that have been trained with sufficient Greek corpus. The extracted network infers the probability of a specific letter in a word given one, two or three previous letter that have been keyed by the user with precision that …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Preference learning for cognitive modeling: a case study on entertainment preferences",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5272451/",
            "Abstract": "Learning from preferences, which provide means for expressing a subject's desires, constitutes an important topic in machine learning research. This paper presents a comparative study of four alternative instance preference learning algorithms (both linear and nonlinear). The case study investigated is to learn to predict the expressed entertainment preferences of children when playing physical games built on their personalized playing features (  entertainment modeling ). Two of the approaches are derived from the literature-the large-margin algorithm (LMA) and preference learning with Gaussian processes-while the remaining two are custom-designed approaches for the problem under investigation: meta-LMA and neuroevolution. Preference learning techniques are combined with feature set selection methods permitting the construction of effective preference models, given suitable individual playing features …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Human-Computer Interaction using Natural Language. An Application in the Medical Treatment Domain",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.77.3897&rep=rep1&type=pdf",
            "Abstract": "The effective information retrieval, along with the comprehensive dialogue systems response, happen to be of great importance in medical applications domain, where the precision of information is critical and users are usually inexperienced and unwilling to participate in long, tiring interactions. The use of natural language is a promising idea because it is direct, natural for the humans and does not need any special training. Our work presents a natural language interaction system, developed by Hellenic partners and utilized with success in the medical domain. Experimental results and comparisons with other methods tabulate improvement in time response as well as in the correctness of the answer. The evaluation of the model was done using a group of 20 persons of different specialties (medical stuff-doctors-computer users-students) which were already trained about how to use the system and each one supplied 25 different questions.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Technical Report, Wire Communication Laboratory, Department of Electrical Engineering and Computer Technology, University of Patras"
        },
        {
            "Title": "A medical ontology for intelligent web-based skin lesions image retrieval",
            "Publication year": 2011,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1460458211405009",
            "Abstract": "Researchers have applied increasing efforts towards providing formal computational frameworks to consolidate the plethora of concepts and relations used in the medical domain. In the domain of skin related diseases, the variability of semantic features contained within digital skin images is a major barrier to the medical understanding of the symptoms and development of early skin cancers. The desideratum of making these standards machine-readable has led to their formalization in ontologies. In this work, in an attempt to enhance an existing Core Ontology for skin lesion images, hand-coded from image features, high quality images were analyzed by an autonomous ontology creation engine. We show that by exploiting agglomerative clustering methods with distance criteria upon the existing ontological structure, the original domain model could be enhanced with new instances, attributes and even relations …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:ULOm3_A8WrAC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Towards stock market data mining using enriched random forests from textual resources and technical indicators",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16239-8_37",
            "Abstract": "The present paper deals with a special Random Forest Data Mining technique, designed to alleviate the significant issue of high dimensionality in volatile and complex domains, such as stock market prediction. Since it has been widely acceptable that media affect the behavior of investors, information from both technical analysis as well as textual data from various on-line financial news resources are considered. Different experiments are carried out to evaluate different aspects of the problem, returning satisfactory results. The results show that the trading strategies guided by the proposed data mining approach generate higher profits than the buy-and-hold strategy, as well as those guided by the level-estimation based forecasts of standard linear regression models and other machine learning classifiers such as Support Vector Machines, ordinary Random Forests and Neural Networks.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Time series forecasting in cyberbullying data",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23983-5_27",
            "Abstract": "The present article deals with sexual cyberbullying, a serious subject that has gained significant attention throughout recent years of emerging social media platforms. The detection of sexual predation is one of the most important and challenging tasks in our days. Using real-world data, we follow a time series modeling approach, in which predator’s posts (i.e. questions) are associated with numeric labels, according to the style of the attack (e.g. attempts for physical approach, grooming, retrieval of personal information, etc.). Upon modeling the domain as time series, in order to allow for forecasting the severity of a future question of a predator (i.e. the class label), a sliding window method was adopted. Two well-known methods that have been traditionally applied in time series problems, namely Support Vector Machines and Neural Networks, were utilized for forecasting. Simultaneously, since text …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Ensemble learning of high-dimensional stock market data",
            "Publication year": 2014,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.4324/9780203084984-25/ensemble-learning-high-dimensional-stock-market-data-manolis-maragoudakis-dimitrios-serpanos",
            "Abstract": "Recently, ensemble classification has gained much popularity within the machine learning and data mining community. The idea behind the aggregation of multiple single classifiers is based on the statement that non-correlated classifiers have the ability to outperform the total prediction error when aggregated. The following scenario exemplifies how an ensemble method can improve a classifier’s performance. Suppose a set of K binary classifiers is constructed, each of which predicts the class with an average error rate of ε. As previously mentioned, an ensemble classifier performs the classification based on the majority vote of each base classifier. In the case that all base classifiers are identical, the error rate of the ensemble will remain ε, while, if the base classifiers are independent (ie they portray non-correlated error), then the ensemble will make false prediction if and only if more than half of the base …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:RGFaLdJalmkC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Privacy preserving neural networks in iris signature feature extraction",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2413097.2413101",
            "Abstract": "The iris signature is used in\" Iridology\", for person identification and calculation of torsional eye movements in video-oculography. Iris data are expensive and difficult to be acquired and their amount plays an important role in recognition accuracy when data mining methods are used. However, privacy issues often restrict open exchange of data between stakeholders. The present article presents a privacy-preserving neural network protocol, for horizontally-partitioned datasets, ie datasets that share common attributes but contain different records at each party. The proposed protocol assumes a malicious user model and does not use homomorphic cryptographic methods which are inherently only suited for a semi-trusted user environment. The performance analysis shows that the communication overhead is low enough to warrant its use while the computational complexity is identical in most cases with the …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Domain knowledge acquisition and plan recognition by probabilistic reasoning",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213004001570",
            "Abstract": "This paper introduces a statistical framework for extracting medical domain knowledge from heterogeneous corpora. The acquired information is incorporated into a natural language understanding agent and applied to DIKTIS, an existing web-based educational dialogue system for the chemotherapy of nosocomial and community acquired pneumonia, aiming at providing a more intelligent natural language interaction. Unlike the majority of existing dialogue understanding engines, the presented system automatically encodes semantic representation of a user's query using Bayesian networks. The structure of the networks is determined from annotated dialogue corpora using the Bayesian scoring method, thus eliminating the tedious and costly process of manually coding domain knowledge. The conditional probability distributions are estimated during a training phase using data obtained from the same set of …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "User modeling and plan recognition under conditions of uncertainty",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39398-6_53",
            "Abstract": "For the present paper, we endeavor with the issue of identification of a user’s plan, in terms of user modeling under uncertainty. Unlike the majority of existing natural language understanding engines, the presented framework automatically encodes semantic representation of a user’s query using a Bayesian networks framework. The structure of the networks is determined from annotated dialogue corpora, thus eliminating the monotonous and costly process of manually coding domain knowledge. The conditional probability tables are computed accurately from the available data, obtained from the same set of dialogue acts. In order to cope with words absent from our restricted dialogue corpus, we have incorporated a separate, offline module, which estimates their semantic role from both medical and general raw text corpora, correlating them with known lexical-semantically similar words or predefined …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Bayesian feature construction for the improvement of classification performance",
            "Publication year": 2020,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJDATS.2020.105152",
            "Abstract": "In this paper we are going to talk about the problem of the increase in validity, concerning the process of classification, but not through approaches having to do with the improvement of the ability to construct a precise classification model using any algorithm of machine learning. On the contrary, we approach this important matter by the view of a wider encoding of the training data and more specifically under the perspective of the creation of more features so that the hidden angles of the subject areas, which model the available data, are revealed to a higher degree. We suggest the use of a novel feature construction algorithm, which is based on the ability of the Bayesian networks to re-enact the conditional independence assumptions of features, bringing forth properties concerning their interrelation that are not clear when a classifier provides the data in their initial form. The results from the increase of the features …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:dshw04ExmUIC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "Prediction of propensity for enterprise cloud computing adoption",
            "Publication year": 2017,
            "Publication url": "https://aisel.aisnet.org/hicss-50/os/enterprise_system_integration/3/",
            "Abstract": "Cloud computing (CC) can offer significant benefits to enterprises. However, it can pose some risks as well, and this has led to lower adoption than the initial expectations. For this reason, it would be very useful to develop ‘predictive analytics’ in this area, enabling us to predict which enterprises will exhibit a propensity for CC adoption. In this direction, we investigate the use of six well-established classifiers (fast large margin Support Vector Machine, Naive Bayes, Decision Tree, Random Forest, k-Nearest Neighbor, and Linear Regression) for the prediction of enterprise level propensity for CC adoption. Having as our theoretical foundation the Technology–Organization–Environment (TOE) framework, we are using for this prediction of set of technological (concerning existing enterprise information systems), organizational and environmental characteristics. Our first results, using a dataset collected from 676 manufacturing firms of the glass, ceramic and cement sectors from six European countries (Germany, France, Italy, Poland, Spain, and UK) through the e-Business W@ tch Survey of the European Commission, are encouraging. It is concluded that among the examined characteristics the technological ones, concerning the existing enterprise systems, seem to be the most important predictors.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PPDM-TAN: A Privacy-Preserving Multi-Party Classifier. Computation 2021, 9, 6",
            "Publication year": 2021,
            "Publication url": "https://search.proquest.com/openview/7667106f095967ee95e3f723ebe28046/1?pq-origsite=gscholar&cbl=2032414",
            "Abstract": "Distributed medical, financial, or social databases are analyzed daily for the discovery of patterns and useful information. Privacy concerns have emerged as some database segments contain sensitive data. Data mining techniques are used to parse, process, and manage enormous amounts of data while ensuring the preservation of private information. Cryptography, as shown by previous research, is the most accurate approach to acquiring knowledge while maintaining privacy. In this paper, we present an extension of a privacy-preserving data mining algorithm, thoroughly designed and developed for both horizontally and vertically partitioned databases, which contain either nominal or numeric attribute values. The proposed algorithm exploits the multi-candidate election schema to construct a privacy-preserving tree-augmented naive Bayesian classifier, a more robust variation of the classical naive Bayes …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:vRqMK49ujn8C",
            "Publisher": "s Note: MDPI stays neu-tral with regard to jurisdictional clai-ms in published maps and institutio-nal affiliations."
        },
        {
            "Title": "PPDM-TAN: A Privacy-Preserving Multi-Party Classifier",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/962858",
            "Abstract": "Distributed medical, financial, or social databases are analyzed daily for the discovery of patterns and useful information. Privacy concerns have emerged as some database segments contain sensitive data. Data mining techniques are used to parse, process, and manage enormous amounts of data while ensuring the preservation of private information. Cryptography, as shown by previous research, is the most accurate approach to acquiring knowledge while maintaining privacy. In this paper, we present an extension of a privacy-preserving data mining algorithm, thoroughly designed and developed for both horizontally and vertically partitioned databases, which contain either nominal or numeric attribute values. The proposed algorithm exploits the multi-candidate election schema to construct a privacy-preserving tree-augmented naive Bayesian classifier, a more robust variation of the classical naive Bayes classifier. The exploitation of the Paillier cryptosystem and the distinctive homomorphic primitive shows in the security analysis that privacy is ensured and the proposed algorithm provides strong defences against common attacks. Experiments deriving the benefits of real world databases demonstrate the preservation of private data while mining processes occur and the efficient handling of both database partition types.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:tOudhMTPpwUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Meteorological Data Science: exploiting causality discovery in time-series for knowledge discovery and improved forecasting",
            "Publication year": 2017,
            "Publication url": "https://cest2019.gnest.org/sites/default/files/presentation_file_list/cest2019_00828_oral_paper.pdf",
            "Abstract": "Climate change and its impact on everyday life still remains one of the greatest challenge of our era. The complex nature of climate data addresses the use of data science techniques to provide predictive analytics to the task at hand. While most existing approaches exploit correlation between observations and features to improve forecasting, the present work deals with causality, a principle that enhances robustness and provides better insight to domain experts. More specifically, a novel framework for causality discovery is proposed, based on statistical (ie Granger causality tests) as well as on nonlinear state space reconstruction algorithms (ie Convergent Cross Mapping, a very effective algorithm in dynamic systems, such as the task at hand) in order to find the causal relations between meteorological time series. Furthermore, the framework also supports methods for graph analysis, thus providing informative visualizations on the influential levels of causality. Experiment results on a dataset of real observations from different cities of Greece, obtained through crawling of Internet sites of Davis weather stations demonstrate the ability to model and visualize the relations of the meteorological parameters amongst the cities. Moreover, by utilizing such causal inference knowledge, the forecasting performance for each city is significantly improved, since only relevant and informative features were taken into consideration.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On mining opinions from social media",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41013-0_49",
            "Abstract": "The broad use of social media nowadays has led many users to express their opinions on various subjects through them. The need for these opinions to be automatically labeled and categorized according to their sentiment, has also arisen. In this paper, a novel sentiment analysis approach is introduced, which takes into account the total number of idiomatic expressions and emoticons that are used in the text, and simultaneously processes the original text in Greek along with its automatic translation in English as well. Moreover, the novelty of the proposed solution lies in the difficulty of Modern Greek language and the fact that the text in social media is mainly unstructured. The proposed methodology is tested on two distinct data sets of opinions regarding a certain matter, which have been collected from Facebook and Twitter respectively. Finally, we discuss the performance of various classiffication …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:BqipwSGYUEgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Using Government Data and Machine Learning for Predicting Firms’ Vulnerability to Economic Crisis",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-57599-1_26",
            "Abstract": "The COVID-19 pandemic is expected to lead to a severe recessionary economic crisis with quite negative consequences for large numbers of firms and citizens; however, this is an ‘old story’: recessionary economic crises appear repeatedly in the last 100 years in the market-based economies, and they are recognized as one of the most severe and threatening weaknesses of them. They can result in closure of numerous firms, and decrease of activities of many more, as well as poverty and social exclusion for large parts of the population, and finally lead to political upheaval and instability; so they constitute one of the most threatening and difficult problems that governments often face. For the above reasons it is imperative that governments develop effective public policies and make drastic interventions for addressing these economic crises. Quite useful for these interventions can be the prediction of the …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:XiSMed-E-HIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Eksairesis: A Domain-Adaptable System for Ontology Building from Unstructured Text.",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/35948622/147_paper.pdf",
            "Abstract": "This paper describes Eksairesis, a system for learning economic domain knowledge automatically from Modern Greek text. The knowledge is in the form of economic terms and the semantic relations that govern them. The entire process in based on the use of minimal language-dependent tools, no external linguistic resources, and merely free, unstructured text. The methodology is thereby easily portable to other domains and other languages. The text is pre-processed with basic morphological annotation, and semantic (named and other) entities are identified using supervised learning techniques. Statistical filtering, ie corpora comparison is used to extract domain terms and supervised learning is again employed to detect the semantic relations between pairs of terms. Advanced classification schemata, ensemble learning, and one-sided sampling, are experimented with in order to deal with the noise in the data, which is unavoidable due to the low pre-processing level and the lack of sophisticated resources. An average f-score of 68, 5% over all the classes is achieved when learning semantic relations. Bearing in mind the use of minimal resources and the highly automated nature of the process, classification performance is very promising, compared to results reported in previous work.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special issue articles Theme: E-learning and Human-Computer Interaction: Exploring Design Synergies for more Effective Learning Experiences",
            "Publication year": 2006,
            "Publication url": "https://www.ds.unipi.gr/et&s/journals/9_4/ets_9_4_contents.pdf",
            "Abstract": "Journal of Educational Technology & Society Page 1 iii ISSN 1436-4522. © International Forum \nof Educational Technology & Society (IFETS). The authors and the forum jointly retain the \ncopyright of the articles. Permission to make digital or hard copies of part or all of this work for \npersonal or classroom use is granted without fee provided that copies are not made or distributed \nfor profit or commercial advantage and that copies bear the full citation on the first page. \nCopyrights for components of this work owned by others than IFETS must be honoured. \nAbstracting with credit is permitted. To copy otherwise, to republish, to post on servers, or to \nredistribute to lists, requires prior specific permission and/or a fee. Request permissions from the \neditors at kinshuk@massey.ac.nz. ISSN 1436-4522 (online) and 1176-3647 (print). © \nInternational Forum of Educational Technology & Society (IFETS). The authors and the forum the . …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MeteoBayes: Effective plan recognition in a weather dialogue system",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4078958/",
            "Abstract": "When you've called a voice portal for any kind of information retrieval, chances are that an automated system guided the entire interaction. It might have correctly identified your goal, but probably only after asking too many questions. MeteoBayes is a meteorological information dialogue system that lets you use natural language to direct the interaction. Based on Bayesian networks, MeteoBayes' inference engine attempts to identify user intentions by consulting its past dialogue repository. For unfamiliar words, MeteoBayes has an unknown-term disambiguation module that learns word similarities from texts to avoid unnecessary system inquiries, thus speeding up the understanding process",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cyberbullying detection using time series modeling",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7022621/",
            "Abstract": "Cyber bullying is a new phenomenon resulting from the advance of new communication technologies including the Internet, cell phones and Personal Digital Assistants. It is a challenging bullying problem occurring in a new territory. Online bullying can be particularly damaging and upsetting because it's usually anonymous or hard to trace. In this paper, the proposed method is utilizing a dataset of real world conversations (i.e. Pairs of questions and answers between cyber predator and the victim), in which each predator question is manually annotated in terms of severity using a numeric label. We approach the issue as a sequential data modelling approach, in which the predator's questions are formulated using a Singular Value Decomposition representation. The motivation of this procedure is to study the accuracy of predicting the level of cyber bullying attack using classification methods and also to examine …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sports & Nutrition Data Science using Gradient Boosting Machines",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201060",
            "Abstract": "Throughout1 recent years, a significant amount of research has dealt with how humans could beat time. According to the extracted outcome, the main weapons in this battle are balanced nutrition and systematic exercise. Outdoor running, ranging from short distances up to even marathons, is gaining popularity, boosting the clothing, shoes and even gadget industry as well. The current rapid development of technology leads to the supply of a vast amount of information that enables us to properly process valuable knowledge. Smart watches, wristbands, mobile phone applications, shoes and clothes sensors, etc. have provided practitioners the tools to collect numerous data regarding their fitness levels. The recent challenge data mining is about to serve, lies to the fact of how one can combine and analyze the abundance of data from daily activities, nutrition habits and fitness activities into one, unified model that …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling Promotion Factors Using Bayesian Networks and Video Games",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-10-0557-2_77",
            "Abstract": "The advent of electronic media, social networks and the transformation of infotainment solutions into an everyday habit has attracted the interest of creative promotion, resulting in one of the highest revenue business of today. The vast number of products and services that need to be promoted through the aforementioned channels has augmented the need for innovative, fresh and foremost successful ideas from the campaign designer perspective in order to attract customers. Towards this direction, a reasoning tool for supporting ad managers in setting up a new campaign is more than useful. This paper describes an innovative approach, in which a video game is developed in order to collect and annotate data from existing ad videos, including subjective information as regards to the impact they pose on the players. Upon collection of data, Bayesian networks are learned in order to create a mechanism for …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "Improving handwritten character segmentation by incorporating Bayesian knowledge with support vector machines",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/35948623/icassp_2002.pdf",
            "Abstract": "Learning Bayesian Belief Networks (BBN) from corpora and incorporating the extracted inferring knowledge with a Support Vector Machines (SVM) classifier has been applied to character segmentation for unconstrained handwritten text. By taking advantage of the plethora in unlabeled data found in image databases in addition to some available labeled examples, we overcome the expensive task of annotating the whole set of training data and the performance of the character segmentation learner is increased. Apart from this approach, which has not previously used for this task, we have experimented with two well-known machine learning methods (Learning Vector Quantization and a simplified version of the Transformation-Based Learning theory). We argue that a classifier generated from BBN and SVM is well suited for learning to identify the correct segment boundaries. Empirical results will support this claim. Performance has been methodically evaluated using both English and Modern Greek corpora in order to determine the unbiased behaviour of the trained models. Limited training data are proved to endow with satisfactory results. We have been able to achieve precision exceeding 86%.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE; 1999"
        },
        {
            "Title": "A hierarchical, ontology-driven Bayesian concept for ubiquitous medical environments-A case study for pulmonary diseases",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4650038/",
            "Abstract": "The present paper extends work on an existing computer-based Decision Support System (DSS) that aims to provide assistance to physicians as regards to pulmonary diseases. The extension deals with allowing for a hierarchical decomposition of the task, at different levels of domain granularity, using a novel approach, i.e. Hierarchical Bayesian Networks. The proposed framework uses data from various networking appliances such as mobile phones and wireless medical sensors to establish a ubiquitous environment for medical treatment of pulmonary diseases. Domain knowledge is encoded at the upper levels of the hierarchy, thus making the process of generalization easier to accomplish. The experimental results were carried out under the Pulmonary Department, University Regional Hospital Patras, Patras, Greece. They have supported our initial beliefs about the ability of Bayesian networks to provide an …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Learning Automatic Acquisition of Subcategorization Frames using Bayesian Inference and Support Vector Machines",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/989583/",
            "Abstract": "Learning Bayesian belief networks (BBN) from corpora and support vector machines (SVM) have been applied to the automatic acquisition of verb subcategorization frames for Modern Greek. We are incorporating minimal linguistic resources, i.e. basic morphological tagging and phrase chunking, to demonstrate that verb subcategorization, which is of great significance for developing robust natural language human computer interaction systems, could be achieved using large corpora, without having any general-purpose, syntactic parser at all. In addition, apart from BBN and SVM, which have not previously used for this task, we have experimented with three well-known machine learning methods (feedforward backpropagation neural networks, learning vector quantization and decision tables), which are also being applied to the task of verb subcategorization frame defection for the first time. We argue that both …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Examining students' graduation issues using data mining techniques-The case of TEI of Athens",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4907845",
            "Abstract": "One of the major issues that Greek Higher Education Institutes face is the delayed completion of studies of their students. For example, in the case of the Technological Educational Institute of Athens, in the academic year 2012-2013, the percentage of graduates with a length of studies of more than 6 years was 53%. This \"problem\" becomes harder if we consider that according to the new legislation, the Greek Higher Education Institutes (HEI) must cut off access to the students who \"linger\" too long. This means that many of these graduates wouldn't be able to complete their studies. While many institutes have systems to quantify and report the length of studies of all graduates, far less attention is typically paid to each student's reason(s) for delayed graduation. In this paper, we focus on examining the question of why students delay in the completion of their studies using several data mining techniques. Through the …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:70eg2SAEIzsC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Accurate and large-scale privacy-preserving data mining using the election paradigm",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X09000950",
            "Abstract": "With the proliferation of the Web and ICT technologies there have been concerns about the handling and use of sensitive information by data mining systems. Recent research has focused on distributed environments where the participants in the system may also be mutually mistrustful. In this paper we discuss the design and security requirements for large-scale privacy-preserving data mining (PPDM) systems in a fully distributed setting, where each client possesses its own records of private data. To this end we argue in favor of using some well-known cryptographic primitives, borrowed from the literature on Internet elections. More specifically, our framework is based on the classical homomorphic election model, and particularly on an extension for supporting multi-candidate elections. We also review a recent scheme [Z. Yang, S. Zhong, R.N. Wright, Privacy-preserving classification of customer data without loss …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:2osOgNQ5qMEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Political sentiment analysis of tweets before and after the Greek elections of May 2012",
            "Publication year": 2013,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSNM.2013.059090",
            "Abstract": "Political sentiment analysis using social media content has attracted significant interest in the last years. The present work utilises limited linguistic resources in a knowledge-poor approach to political sentiment identification from Greek tweets, posted a few days before and a few days after the Greek parliamentary elections of May 6th, 2012. Rather than the accurate prediction of the election results, the main focus of the proposed work is the investigation of the alignment between web and actual political sentiment in a bi-directional manner: the impact/reflection of the tweets’ sentiment on the elections as well as the impact of the elections’ results on web sentiment, and its shift around such a major political event.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Mining query-logs towards learning useful kick-off ontologies: an incentive to semantic web content creation",
            "Publication year": 2011,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJKEDM.2011.040652",
            "Abstract": "The aim of the paper is to present an ontology learning method that automatically (unsupervised) builds useful kick-off ontologies from query logs. We introduce tasks related to the proposed method in all phases of an ontology engineering lifecycle, extending human-centred and collaborative engineering methodologies for devising continuously evolving ontologies such as the human centred ontology engineering methodology (HCOME). Users, both knowledge workers of an organisational knowledge management setting and WWW users, are provided with a useful kick-off ontology that is automatically built from users’   search interests  in order to meet ontology engineering and ontology-based application needs. The paper provides evidences that this new approach plays a significant role as an   incentive  in the semantic content creation   bottleneck  .",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Predicting depression: a comparative study of machine learning approaches based on language usage",
            "Publication year": 2017,
            "Publication url": "https://www.cnps.cl/index.php/cnps/article/view/297",
            "Abstract": "Depression is a major public health concern and a leading cause of disability. Globally, more than 332 million people of all ages suffer from depression. Several studies in the literature show that people language usage is indicative of their psychological states. That is why, there is growing interest in the application of natural language processing techniques for predicting depression. In this work, we present a comparative study of different machine learning methods and alternative ways of representing documents to automatically detect social media users who have reported to had been diagnosed with depression. The obtained results have demonstrated that a Deep Learning approach had the superior classification performance, when combined with a Synthetic Minority Oversampling Technique to deal with the problem of class imbalances in the dataset used in our experiments. The F1 score achieved was 82.93% with an accuracy of more than 94%.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Forecasting Winter Precipitation based on Weather Sensors Data in Apache Spark",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9555553/",
            "Abstract": "The proposed paper introduces an approach providing weather information on winter precipitation types using machine learning techniques. The proposed methodology takes as input the data received from weather sensors and in following the winter precipitation model aims at forecasting the weather type given three precipitation classes, namely rain, freezing rain, and snow, as registered in the Automated Surface Observing System (ASOS). To enable the proposed classification, six supervised machine learning models were selected: Naive Bayes, Decision Stump, Hoeffding Tree, HoeffdingOption Tree, HoeffdingAdaptive Tree, and OzaBag. Results depicted that all the models performed well in terms of accuracy and computation time, while some achieved even better outcomes. Specifically, among all six models, OzaBag presented the best classification results, followed by HoeffdingOption Tree.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Imposing Classification Bias in Bayesian Network Learning",
            "Publication year": 2004,
            "Publication url": "https://elibrary.ru/item.asp?id=15580781",
            "Abstract": "This paper deals with the use of Bayesian classifiers for improving the prediction performance of character segmentation for unconstrained handwritten text. A novel network structure is presented, in which the learning is supervised and biased in order to favor the classification process. As regards the computational complexity, an analysis conducted is proved to have a satisfactory factor of O (n 2 logn), which is competitive with other Bayesian learning methods. Furthermore, we show that the induced network best describes the probability distribution over training data and, at the same time, is able to perform a feature selection concerning the class attribute. Experimental results against different Bayesian classifiers and other well-known machine learning methods support our claim. More specifically, the proposed methodology outperforms all others by a varying scale of 3-13%.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:8k81kl-MbHgC",
            "Publisher": "Pleiades Publishing, Ltd.(Плеадес Паблишинг, Лтд)"
        },
        {
            "Title": "De Novo Drug Design using Artificial Intelligence ASYNT-GAN",
            "Publication year": 2020,
            "Publication url": "https://www.preprints.org/manuscript/202010.0196",
            "Abstract": "In this paper we propose the generation of synthetic small and more sophisticated molecule structures that optimize the binding affinity to a target (ASYNT-GAN). To achieve this we leverage on three important achievements in AI: Attention, Deep Learning on Graphs and Generative Adversarial Networks. Similar to text generation based on parts of text we are able to generate a molecule architecture based on an existing target. By adopting this approach, we propose a novel way of searching for existing compounds that are suitable candidates. Similar to question and answer Natural Language solutions we are able to find drugs with highest relevance to a target. We are able to identify substructures of the molecular structure that are the most suitable for binding. In addition, we are proposing a novel way of generating the molecule in 3D space in such a way that the binding is optimized. We show that we are able to generate compound structures and protein structures that are optimised for binding to a target.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:WbkHhVStYXYC",
            "Publisher": "Preprints"
        },
        {
            "Title": "Hong Kong protests: using natural language processing for fake news detection on twitter",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49186-4_34",
            "Abstract": "The automation of fake news detection is the focus of a great deal of scientific research. With the rise of social media over the years, there has been a strong preference for users to be informed using their social media account, leading to a proliferation of fake news through them. This paper evaluates the veracity of politically-oriented news and in particular the tweets about the recent event of Hong Kong protests, with the aid of a dataset recently published by Twitter. From this dataset, Chinese tweets are translated into English, which are kept along with originally English tweets. By utilizing a language-independent filtering process, relevant tweets are identified. To complete the dataset, tweets originating from valid sources are used as the real portion, with journalists rather than news agencies being considered, which constitutes a novel aspect of the methodology. Well-known Machine Learning algorithms …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:UxriW0iASnsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A biology-inspired, data mining framework for extracting patterns in sexual cyberbullying data",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0950705115005031",
            "Abstract": "With the rapid growth of social media, users, especially adolescents, are spending significant amount of time on various social networking sites to connect with others, to share information, and to pursue common interests. However, as social networking has become widespread, certain people are finding illegal and unethical ways to use these communities as means for opening the door of inappropriate online activities. Thus, they are providing an open way for cybercrimes such as cyberbullying. In this paper, we deal with the aforementioned issue as a time series modelling methodology, aiming at the recognition of bullying patterns within the questions posed by a predator to his victims. Given a set of real world transcripts (i.e. the whole set of predator′s questions), in which each question is numerically labelled in terms of severity, we first model each set of predator′s questions as a time series. The next step is …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Privacy preservation by k-anonymization of weighted social networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6425729/",
            "Abstract": "Privacy preserving analysis of a social network aims at a better understanding of the network and its behavior, while at the same time protecting the privacy of its individuals. We propose an anonymization method for weighted graphs, i.e., for social networks where the strengths of links are important. This is in contrast with many previous studies which only consider unweighted graphs. Weights can be essential for social network analysis, but they pose new challenges to privacy preserving network analysis. In this paper, we mainly consider prevention of identity disclosure, but we also touch on edge and edge weight disclosure in weighted graphs. We propose a method that provides k-anonymity of nodes against attacks where the adversary has information about the structure of the network, including its edge weights. The method is efficient, and it has been evaluated in terms of privacy and utility on real word datasets.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Heart murmurs identification using random forests in assistive environments",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1839294.1839304",
            "Abstract": "The aging population in many countries, in combination with high government deficits and financial resources limitations, necessitates new methods for the home care of the elderly at reasonable costs based on the exploitation of modern information and communication technologies (ICT). This requires the installation of assistive environments at the homes of elderly people, which include various types of sensors, generating biosignals of other types of signals, which are transferred through networks to local health centers or hospitals in order to be monitored. However, scaling up the application of such ICT-based methods of elderly home care is going to increase tremendously the workload of the medical staff of local health centers or hospitals. Therefore it is of critical importance to develop capabilities for an automated first screening of these signals and identification of abnormal elements and diseases. In this …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Domain knowledge acquisition and plan recognition by probabilistic reasoning",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45226-3_39",
            "Abstract": "In this paper, a probabilistic framework for acquiring domain knowledge from heterogeneous corpora is introduced. The acquired information is used for intelligent human-computer interaction through the web. The application selected for the framework experimentation was education on issues of chemotherapy of nosocomial and community acquired pneumonia. Contrasting to existing educational dialogue engines which use handcrafted knowledge of the application domain, our approach utilizes automatic encoding of the semantic model of the application, based on learning Bayesian networks from past user questions. The structure of the networks as well as the conditional probability distributions are computed automatically from dialogue corpora, thus eliminating the tedious process of manual insertion of domain knowledge. Furthermore, we attempt to overcome the significant issue of limited …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:Se3iqnhoufwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Bayesian reinforcement for a probabilistic neural net part-of-speech tagger",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30120-2_18",
            "Abstract": "The present paper introduces a novel stochastic model for Part-of-Speech tagging of natural language texts. While previous statistical approaches, such as Hidden Markov Models, are based on theoretical assumptions that are not always met in natural language, we propose a methodology which incorporates fundamental elements of two distinct machine learning disciplines. We make use of Bayesian knowledge representation to provide a robust classifier, namely a Probabilistic Neural Network one, with additional context information in order to better infer on the correct Part-of-Speech label. As for training material, we make use of minimal linguistic information, i.e. only a small lexicon which contains the words that belong to non-declinable POS categories and closed-class words. Such minimal information is augmented by statistical parameters generated by Bayesian networks learning and the outcome …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Swarm intelligence in intrusion detection: A survey",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016740481100109X",
            "Abstract": "Intrusion Detection Systems (IDS) have nowadays become a necessary component of almost every security infrastructure. So far, many different approaches have been followed in order to increase the efficiency of IDS. Swarm Intelligence (SI), a relatively new bio-inspired family of methods, seeks inspiration in the behavior of swarms of insects or other animals. After applied in other fields with success SI started to gather the interest of researchers working in the field of intrusion detection. In this paper we explore the reasons that led to the application of SI in intrusion detection, and present SI methods that have been used for constructing IDS. A major contribution of this work is also a detailed comparison of several SI-based IDS in terms of efficiency. This gives a clear idea of which solution is more appropriate for each particular case.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:hC7cP41nSMkC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Learning verb complements for Modern Greek: balancing the noisy dataset",
            "Publication year": 2008,
            "Publication url": "https://www.cambridge.org/core/journals/natural-language-engineering/article/learning-verb-complements-for-modern-greek-balancing-the-noisy-dataset/B388C0F43A0C015F60F68087F475C1C2",
            "Abstract": "Attempting to automatically learn to identify verb complements from natural language corpora without the help of sophisticated linguistic resources like grammars, parsers or treebanks leads to a significant amount of noise in the data. In machine learning terms, where learning from examples is performed using class-labelled feature-value vectors, noise leads to an imbalanced set of vectors: assuming that the class label takes two values (in this work complement/non-complement), one class (complements) is heavily underrepresented in the data in comparison to the other. To overcome the drop in accuracy when predicting instances of the rare class due to this disproportion, we balance the learning data by applying one-sided sampling to the training corpus and thus by reducing the number of non-complement instances. This approach has been used in the past in several domains (image processing, medicine, etc …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:IWHjjKOFINEC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Heart sound screening in real-time assistive environments through MCMC Bayesian data mining",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s10209-013-0293-4",
            "Abstract": "Emerging pervasive assistive environment applications for remote home healthcare monitoring of the elderly, disabled and also patients with various chronic diseases generate massive amounts of sensor signal data, which are transmitted from numerous homes to local health centers or hospitals. While it is critical to process this data efficiently (in a fast and accurate manner) and cost-effectively, in a large-scale application of the above technologies, it is not possible to do so manually by specialized human resources. This paper proposes a methodology for automatic real-time screening of heart sound signals (one of the most widely acquired signals from the human body for diagnostic purposes) and identification of those that are abnormal and require some action to be taken, which can be applied to many other similar types of bio-signals generated in assistive environments. It is based on a novel Markov …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:blknAaTinKkC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Player modeling impact on player’s entertainment in computer games",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11527886_11",
            "Abstract": "In this paper we introduce an effective mechanism for obtaining computer games of high interest (i.e. satisfaction for the player). The proposed approach is based on the interaction of a player modeling tool and a successful on-line learning mechanism from the authors’ previous work on prey/predator computer games. The methodology demonstrates high adaptability into dynamical playing strategies as well as reliability and justifiability to the game user.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Skyline and reverse skyline query processing in spatialhadoop",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X18300715",
            "Abstract": "In this paper, we study the problem of skyline and reverse skyline computation using SpatialHadoop, an extension of Hadoop that enhances its capabilities with spatial awareness. The exploitation of spatial indexing structures and the spatial properties of data can exploit MapReduce-based methods by reducing the reading, writing, computational and communicational overhead. Through our study, we propose two methods for skyline and reverse skyline computation, which operates in the spatial aware environment that SpatialHadoop provides. This environment allows for performing filtering on the initial dataset to retrieve an answer efficiently by using existing state-of-the-art indexing approaches. The proposed algorithms make use of the full capabilities of the indexing mechanisms provided by the SpatialHadoop and have been tested against large-scale datasets including a real-life, large-scale OpenStreetMap …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:abG-DnoFyZgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Buying behavior on daily-deal sites: the role of face value, product involvement, information, and website quality",
            "Publication year": 2015,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15332861.2015.1011568",
            "Abstract": "The aim of this research is to identify factors that may have an effect on e-voucher sales, in the context of daily-deal sites. While previous research has focused on purchase intentions as the dependent variable and on fictitious coupons and/or brands, this article extends previous work by investigating what actually impacts vouchers sales, using real voucher data, as basic research units of analysis. Using content analysis, researchers analyzed 596 vouchers from different daily-deal websites. Taking the inherent capability of Bayesian Networks for reasoning under conditions of uncertainty into account, a series of learning and simulation processes reveal the influential degree that website and information quality, face value, and product involvement exert on vouchers sales. The results of the study provide management with specific guidelines for setting the right prices in vouchers and designing effective promotional …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:ldfaerwXgEUC",
            "Publisher": "Routledge"
        },
        {
            "Title": "A Bayesian Network Model for Information Retrieval from Greek Texts",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410356/",
            "Abstract": "The present paper describes a Bayesian network approach to information retrieval (IR) from natural language texts in Greek. The network structure provides an intuitive representation of uncertainty relationships and the embedded conditional probability table is used by inference algorithms in an attempt to identify documents that are relevant to the user's needs, expressed in the form of Boolean queries. Our research has been directed in constructing a probabilistic IR framework that focus on assisting users perform ad-hoc retrieval of Greek documents from the domain of economics. Furthermore, users can integrate feedback regarding the relevance of the retrieved documents in an attempt to improve performance on upcoming requests. Towards these goals, we have developed the Bayesian network IR system and tested it on several web corpora with different application domains. We have developed two different …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "How conditional independence assumption affects handwritten character segmentation",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/953792/",
            "Abstract": "This paper deals with the use of Bayesian Belief Networks in order to improve the accuracy and training time of character segmentation for unconstrained handwritten text. Comparative experimental results have been evaluated against Naive Bayes classification, which is based on the assumption of the independence of the parameters and two additional previous commonly used methods. Results have depicted that obtaining the inferential dependencies of the training data, could lead to the reduction of the required training time and size by a factor of 55%. Moreover, the achieved accuracy in detecting segment boundaries exceeds 86% whereas limited training data are proved to endow with very satisfactory results.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measuring the impact of financial news and social media on stock market modeling using time series mining techniques",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/361760",
            "Abstract": "In this work, we study the task of predicting the closing price of the following day of a stock, based on technical analysis, news articles and public opinions. The intuition of this study lies in the fact that technical analysis contains information about the event, but not the cause of the change, while data like news articles and public opinions may be interpreted as a cause. The paper uses time series analysis techniques such as Symbolic Aggregate Approximation (SAX) and Dynamic Time Warping (DTW) to study the existence of a relation between price data and textual information, either from news or social media. Pattern matching techniques from time series data are also incorporated, in order to experimentally validate potential correlations of price and textual information within given time periods. The ultimate goal is to create a forecasting model that exploits the previously discovered patterns in order to augment the forecasting accuracy. Results obtained from the experimental phase are promising. The performance of the classifier shows clear signs of improvement and robustness within the time periods where patterns between stock price and the textual information have been identified, compared to the periods where patterns did not exist. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:_xSYboBqXhAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A medical, description logic based, ontology for skin lesion images",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4696706/",
            "Abstract": "Researchers have portrayed an increasing effort towards providing formal computational frameworks to consolidate the plethora of notions and relations used in the medical domain. Despite the fact that there are many reasons for this, the need for standardization of protocols and terminology is critical, not only for the provision of uniform levels of health care, but also to facilitate medical science research. In the domain of skin lesions, the variability of semantic features contained within images is major among the barriers to the medical understanding of the symptoms and development of early skin cancers. Such variability is acknowledged across specialist fields of medicine, motivating standardization of terminologies for reporting medical practice. The desideratum of making these standards machine-readable has led to their formalization in the form of ontologies. Ontologies are computational artifacts designed to …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Combining Bayesian and Support Vector Machines Learning to automatically complete Syntactical Information for HPSG-like Formalisms.",
            "Publication year": 2002,
            "Publication url": "http://lrec.elra.info/proceedings/lrec2002/pdf/126.pdf",
            "Abstract": "Learning Bayesian Belief Networks (BBN) from corpora and incorporating the extracted inferring knowledge with a Support Vector Machines (SVM) classifier has been applied to the automatic acquisition of verb subcategorization frames for Modern Greek. We have made use of minimal linguistic resources, such as basic morphological tagging and phrase chunking, to demonstrate that verb subcategorization, which is of great significance for developing robust natural language human computer interaction systems, could be achieved using large corpora, without having any general-purpose syntactic parser at all. Moreover, by taking advantage of the plethora in unlabeled data found in text corpora in addition to some available labeled examples, we overcome the expensive task of annotating the whole set of training data and the performance of the subcategorization frames learner is increased. We argue that a classifier generated from BBN and SVM is well suited for learning to identify verb subcategorization frames. Empirical results will support this claim. Performance has been methodically evaluated using two different corpora, one balanced and one domain-specific in order to determine the unbiased behavior of the trained models. Limited training data are proved to endow with satisfactory results. We have been able to achieve precision exceeding 90% on the identification of subcategorization frames which were not known beforehand. The obtained valid frames have been used to fill out the subcategorization field of verb entries in an HPSG-like lexicon using the LKB grammar development environment.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bayesian Semantics Incorporation to Web Content for Natural Language Information Retrieval.",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Manolis-Maragoudakis/publication/228441273_Bayesian_Semantics_Incorporation_to_Web_Content_for_Natural_Language_Information_Retrieval/links/00b49526f96b891a71000000/Bayesian-Semantics-Incorporation-to-Web-Content-for-Natural-Language-Information-Retrieval.pdf",
            "Abstract": "For the present work, we endeavor with the important aspect of information retrieval of Web content using natural language queries. Currently, markup languages and formalisms do not fully provide mechanisms for effective and accurate analysis of Web content but rather provide means for describing the content in a more human-centric approach. As a result, natural language queries cannot be handled by the Internet search engines. Other approaches use grammar markup labels that attempt to fully match an unforeseen query. For the purposes of this paper, we introduce the theoretical and implementation issues of a novel, statistical framework that can cope with Web content analysis and information retrieval using natural language. The framework is based on Bayesian networks, a tool for knowledge representation and reasoning under conditions of uncertainty. The Web page designer provides the lexical items that contain useful information and labels the corresponding semantic interpretation, from a pre-defined set of domain categories. This knowledge is used for learning the structure and the parameters of a Bayesian network. At the time a user’s query is encountered, the network is used in order to return pages that contain the most related semantic content to the user’s query.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting financial news and social media opinions for stock market analysis using MCMC Bayesian inference",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10614-015-9492-9.pdf",
            "Abstract": "Stock market analysis by using Information and Communication Technology methods is a dynamic and volatile domain. Over the past years, there has been an increasing focus on the development of modeling tools, especially when the expected outcomes appear to yield significant profits to the investors’ portfolios. In alignment with modern globalized economy, the available resources are becoming gradually more plentiful, thus difficult to be analyzed by standard statistical tools. Thus far, there have been a number of research papers that emphasize solely in past data from stock bond prices and other technical indicators. Nevertheless, throughout recent studies, prediction is also based on textual information, based on the logical assumption that the course of a stock price can also be affected by news articles and perhaps by public opinions, as posted on various Web 2.0 platforms. Despite the recent …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A Bayesian Model for Shallow Syntactic Parsing of Natural Language Texts.",
            "Publication year": 2004,
            "Publication url": "http://www.lrec-conf.org/proceedings/lrec2004/pdf/302.pdf",
            "Abstract": "For the present work, we introduce and evaluate a novel Bayesian syntactic shallow parser that is able to perform robust detection of pairs of subject-object and subject-direct object-indirect object for a given verb, in a natural language sentence. The shallow parser infers on the correct subject-object pairs based on knowledge provided by Bayesian network learning from annotated text corpora. The DELOS corpus, a collection of economic domain texts that has been automatically annotated using various morphological and syntactic tools was used as training material. Our shallow parser makes use of limited linguistic input. More specifically, we consider only part of speech tagging, the voice and the mood of the verb as well as the head word of a noun phrase. For the task of detecting the head word of a phrase we used a sentence boundary detector. Identifying the head word of a noun phrase, ie the word that holds the morphological information (case, number) of the whole phrase, also proves to be very helpful for our task as its morphological tag is all the information that is needed regarding the phrase. The evaluation of the proposed method was performed against three other machine learning techniques, namely naïve Bayes, k-Nearest Neighbor and Support Vector Machines, methods that have been previously applied to natural language processing tasks with satisfactory results. The experimental outcomes portray a satisfactory performance of our proposed shallow parser, which reaches almost 92 per cent in terms of precision.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated aortic and mitral valves diseases diagnosis from heart sound signals using novel ensemble classification techniques",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5671404/",
            "Abstract": "The development of 'intelligent' medical equipment, which can not only acquire various signals from the human body, but also process them and provide recommendations as to probable pathological conditions, will be highly beneficial for both the medical personnel and the patients. However, this necessitates the development and exploitation of advanced highly efficient classification techniques. In this direction this paper presents a novel ensemble classification technique, combining Random Forests with the `Markov Blanket' notion, which is used for the automated diagnosis of aortic and mitral heart valves diseases from low-cost and easily acquired heart sound signals. It has been tested in a highly 'difficult' global and heterogeneous dataset of 198 heart sound signals, which been acquired from both healthy and pathological medical cases. The proposed ensemble classification technique exhibited a higher …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data mining for player modeling in videogames",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5298778/",
            "Abstract": "In this paper we propose a method of video game player modeling based on clustering of behavior data collected during game play. Based on the style of play, and game mechanics, we define two player types the action player and the tactical player. We then use the CURE clustering method to classify the game players according to their style of play. We demonstrate that the CURE algorithm can successfully assign the per-defined gamer type. The knowledge of the gamer type can then be used to adjust the game difficulty accordingly.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A skyline-based decision boundary estimation method for binominal classification in big data",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/822752",
            "Abstract": "One of the most common tasks nowadays in big data environments is the need to classify large amounts of data. There are numerous classification models designed to perform best in different environments and datasets, each with its advantages and disadvantages. However, when dealing with big data, their performance is significantly degraded because they are not designed—or even capable—of handling very large datasets. The current approach is based on a novel proposal of exploiting the dynamics of skyline queries to efficiently identify the decision boundary and classify big data. A comparison against the popular k-nearest neighbor (k-NN), support vector machines (SVM) and naïve Bayes classification algorithms shows that the proposed method is faster than the k-NN and the SVM. The novelty of this method is based on the fact that only a small number of computations are needed in order to make a prediction, while its full potential is revealed in very large datasets. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Breast cancer detection in mammogram medical images with data mining techniques",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41142-7_35",
            "Abstract": "A domain of interest for data mining applications is the study of biomedical data which, in combination with the field of image processing, provide thorough analysis in order to discover hidden patterns or behavior. Towards this direction, the present paper deals with the detection of breast cancer within digital mammography images. Identification of breast cancer poses several challenges to traditional data mining applications, particularly due to the high dimensionality and class imbalance of training data. In the current approach, genetic algorithms are utilized in an attempt to reduce the feature set to the informative ones and class imbalance issues were also dealt by incorporating a hybrid boosting and genetic sub-sampling approach. As regards to the feature extraction approach, the idea of trainable segmentation is borrowed, using Decision Trees as the base learner. Results show that the best precision …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Using Ensemble Random Forests for the extraction and exploitation of knowledge on gas turbine blading faults identification",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1057/ori.2011.15",
            "Abstract": "The extraction and exploitation of existing knowledge assets for supporting decision making and increasing the effectiveness of various internal and external interventions is of critical importance for the success of modern organizations. The use of advanced Operational Research-based quantitative methods in combination with high capabilities information systems can be very useful for this purpose. In this article, we are investigating the use of Ensemble Random Forests for extracting, codifying and exploiting existing organizational knowledge on gas turbine blading faults identification, in the form of a large number of decision trees (called a ‘forest’); each of them has internal nodes corresponding to various tests on features of signals acquired from the gas turbine and leaf nodes corresponding to classifications to the healthy condition or particular faults. Two heterogeneous kinds of inserting randomness to the …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Bayesian induction of verb sub-categorization frames in imbalanced heterogeneous data",
            "Publication year": 2005,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09296170500172486",
            "Abstract": "The problem of high imbalance in data in the binary classification task of determining whether a syntactic construction (environment) co-occurring with a verb in a natural text corpus consists of a subcategorization frame of the verb or not is the central focus of the present paper. Each environment is encoded as a vector of heterogeneous attributes, where a very high imbalance between positive and negative examples is observed (an imbalance ratio of approximately 1:80). In order to cope with the plethora of negative examples, we propose a search tactic during training that employs Tomek links for eliminating unnecessary negative examples from the training set. As for a classification mechanism, we argue that Bayesian networks are well suited and we propose a novel network structure which efficiently handles heterogeneous attributes without discretization and is more classification-oriented. Comparing the …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:-f6ydRqryjwC",
            "Publisher": "Taylor & Francis Ltd"
        },
        {
            "Title": "Using financial news articles with minimal linguistic resources to forecast stock behaviour",
            "Publication year": 2015,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJDMMM.2015.071452",
            "Abstract": "Stock prediction has always constituted a great challenge due to its complex and volatile nature. Most existing methods neglect the significant impact that mass media broadcasts have on the behaviour of investors. In this paper an innovative system is presented, combining information from news releases and technical indicators, in order to enhance the predictability of the daily stock price trends, and experimental results confirm the aforementioned impact. The news articles are in Modern Greek, a resource-poor language, presenting the challenge to utilise minimal linguistic resources. The impact of the number of related broadcast articles on stock prediction is estimated, and experimentation shows that too few articles may be harmful instead of helpful for capturing the investors' behaviour. A comparative evaluation against a similar prediction system, which makes on English newswire articles related to US stocks …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "An effective stochastic estimation of handwritten character segmentation bounds",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.79.6744&rep=rep1&type=pdf",
            "Abstract": "Networks in order to improve the accuracy and training time of character segmentation for unconstrained handwritten text. Comparative experimental results have been evaluated against Naive Bayes classification, which is based on the assumption of the independence of the parameters and two other previous commonly used methods. Results have depicted that obtaining the inferential dependencies of the training data, could lead to the reduction of the required training time and size by a factor of 55%. Moreover, the achieved accuracy in detecting segment boundaries exceeds 86% whereas limited training data are proved to endow with very satisfactory results.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fake news detection regarding the Hong Kong events from Tweets",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49190-1_16",
            "Abstract": "The rapid development of network services has led to the exponential growth of online information and the increasing number of social media users. These services are exploited by malicious accounts that spread fake news and propaganda in vast user networks. Consequently, an automated solution for fake news and deception detection is required. This paper introduces a new data set consisting of 2,366 tweets written in English, regarding the Hong Kong events (August, 2019), and a well-defined method for fake news detection that uses both linguistic and network features. Our approach is tested with experiments using 2 machine learning models, achieving high performance compared to previous research.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:SP6oXDckpogC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Europe in the shadow of financial crisis: Policy Making via Stance Classification",
            "Publication year": 2017,
            "Publication url": "https://scholarspace.manoa.hawaii.edu/handle/10125/41499",
            "Abstract": "Since 2009, the European Union (EU) is phasing a multi–year financial crisis affecting the stability of its involved countries. Our goal is to gain useful insights on the societal impact of such a strong political issue through the exploitation of topic modeling and stance classification techniques.  \\  \\ To perform this, we unravel public’s stance towards this event and empower citizens’ participation in the decision making process, taking policy’s life cycle as a baseline. The paper introduces and evaluates a bilingual stance classification architecture, enabling a deeper understanding of how citizens’ sentiment polarity changes based on the critical political decisions taken among European countries.  \\  \\ Through three novel empirical studies, we aim to explore and answer whether stance classification can be used to: i) determine citizens’ sentiment polarity for a series of political events by observing the diversity of opinion among European citizens, ii) predict political decisions outcome made by citizens such as a referendum call, ii) examine whether citizens’ sentiments agree with governmental decisions during each stage of a policy life cycle.  \\",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Privacy preserving data mining using radial basis functions on horizontally partitioned databases in the malicious model",
            "Publication year": 2014,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213014500079",
            "Abstract": "This paper presents a privacy preserving protocol for the computation of a Radial Basis Function (RBF) neural network model between N participants which share horizontally partitioned datasets. The RBF model is used for regression analysis tasks. The novel aspect of the proposed protocol lies to the fact that it assumes a malicious user model and does not use homomorphic cryptographic methods, which are inherently only suited for a semi-trusted user environment. The performance analysis shows that the communication overhead is low enough to warranty its use while the computational complexity is identical in most cases with the centralized computation scenario (e.g. a trusted third party). The accuracy of the output model is only marginally subpar to a centralized computation on the union of all datasets.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:GnPB-g6toBAC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Digital storytelling for good with Tappetina game",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1875952118300909",
            "Abstract": "Storytelling is an important asset in today’s society. Digital platforms for storytelling can facilitate collaborative development of stories. The storytelling process, if properly facilitated, can lead to the creation of stories that improve the relations between the players. Moreover, stories convey important information about the players and their interaction. Extended knowledge and better tools are needed about how to facilitate storytelling for good and analysis to exploit the power of the generated data.How to facilitate Digital Storytelling for good?The investigation is based on a case study approach in which participants have been engaged in the creation of stories. The study is based on empirical data collection and analysis: from the stories recorded, we extract the storytelling features and performance. We have provided qualitative (Domain Expert) and quantitative (Machine Learning …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Gas turbine fault diagnosis using random forests",
            "Publication year": 2008,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/4491",
            "Abstract": "In the present paper, Random Forests are used in a critical and at the same time non trivial problem concerning the diagnosis of Gas Turbine blading faults, portraying promising results. Random forests-based fault diagnosis is treated as a Pattern Recognition problem, based on measurements and feature selection. Two different types of inserting randomness to the trees are studied, based on different theoretical assumptions. The classifier is compared against other Machine Learning algorithms such as Neural Networks, Classification and Regression Trees, Naive Bayes and K-Nearest Neighbor. The performance of the prediction model reaches a level of 97% in terms of precision and recall, improving the existing state-of-the-art levels achieved by Neural Networks by a factor of 1.5%–2%.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A review of opinion mining methods for analyzing citizens’ contributions in public policy debate",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-23333-3_26",
            "Abstract": "Electronic Participation (eParticipation), both in its traditional form and in its emerging Web 2.0 based form, results in the production of large quantities of textual contributions of citizens concerning government policies and decisions under formation, which contain valuable relevant opinions and knowledge of the society, however are exploited to a limited only extent. It is of critical importance to analyze these contributions in order to extract the opinions and knowledge they contain in a cost-efficient way. This paper reviews a wide range of opinion mining methods, which have been developed for analyzing commercial product opinions and reviews posted on the Web, as to the capabilities they can offer for meeting the above challenges. The review has revealed the great potential of these methods for the analysis of textual citizens’ contributions in public policy debates, both for assessing contributors’ general …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Opinion mining and sentiment analysis in policy formulation initiatives: The EU-community approach",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-22500-5_12",
            "Abstract": "In the last decade there is extensive and continuously growing creation of political content in the Internet, and especially in the Web 2.0 social media, which can be quite useful for government agencies in order to understand the needs and problems of societies and formulate effective public policies for addressing them. So a variety of ICT-based methods have been developed for the exploitation of this political content by governments (‘citizensourcing’), initially simpler and later more sophisticated ones. These ICT-based methods are increasingly based on the use of opinion mining (OM) and sentiment analysis (SA) techniques, in order to process the extensive political content collected from numerous sources. This paper describes a novel approach to OM and SA use, created as part of an advanced ICT-based method of exploiting political content created in the Internet, and especially in social media, by …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Influence of conditional independence assumption on verb subcategorization detection",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44805-5_8",
            "Abstract": "Learning Bayesian Belief Networks from corpora has been applied to the automatic acquisition of verb subcategorization frames for Modern Greek (MG). We are incorporating minimal linguistic resources, i.e. morphological tagging and phrase chunking, since a general-purpose syntactic parser for MG is currently unavailable. Comparative experimental results have been evaluated against Naive Bayes classification, which is based on the conditional independence assumption along with two widely used methods, Log-Likelihood (LLR) and Relative Frequencies Threshold (RFT).We have experimented with a balanced corpus in order to assure unbiased behavior of the training model. Results have depicted that obtaining the inferential dependencies of the training data could lead to a precision improvement of about 4% compared to that of Naive Bayes and 7% compared to LLR and RFT Moreover, we have …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Machine learning for water bodies identification from satellite images",
            "Publication year": 2018,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJDMMM.2018.093881",
            "Abstract": "Examining satellite images on residential areas and more particularly bodies of water such as swimming pools are of great interest in the field of image mining. Initially, the unobstructed water consumption for pool operation can lead to the reduction of water supplies especially during summer months, a fact that can influence water sources for firefighting. Moreover, they may serve as potential mosquito habitat, especially if they are surrounded by dense vegetation. Towards this direction, this paper presents an efficient classification system for identifying swimming pools from satellite images. A new method of trainable segmentation is presented for feature extraction. In this study, a support vector machine algorithm is used for reducing the feature set to the more appropriate one. The proposed method was tested on different areas of Greece with an overall accuracy of 99.82% that was achieved by using an ensemble …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "MCMC Bayesian inference for heart sounds screening in assistive environments",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2141622.2141642",
            "Abstract": "The large scale application of ICT-based assistive environment technologies for the home care of elderly and disabled people is going to generate huge numbers of signals transmitted from homes to local health centers or hospitals in order to be monitored by medical personnel. This task is going to be of critical importance and at the same time-if manually performed-quite demanding for specialized human resources and costly. In order to perform it in a cost-efficient manner it is necessary to develop mechanisms and methods for automated screening of these signals in order to identify abnormal ones that require some action to be taken. This paper proposes a method for automatic screening of heart sound signals, which are the most widely acquired signals from the human body for diagnostic purposes in both the'traditional'medicine and the emerging ICT-based assistive environments. It is based on a novel …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dealing with high dimensional sentiment data using gradient boosting machines",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-44944-9_42",
            "Abstract": "One of the most common classification tasks that applies on textual information is sentiment analysis, i.e. the prediction of the sentiment of a given document. With the vast use of social media and internet applications such as e-commerce, e-tourism and e-government, numerous comments and opinions are broadcasted per day, thus an automatic way of analyzing them is of great importance. The present paper focuses on sentiment analysis for Greek texts, obtained from Web 2.0 platforms. Greek is a language that lacks an in-depth availability of natural language processing tools in the sense that most of them are not publicly available. The novelty of the article is that instead of utilizing preprocessing tools such as Part-of-Speech taggers, text stemmers and polar-word lexica, it incorporates the translation of the Greek token as provided by the Google Translator® API. Since automatic translation of Greek …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Enhancing user support in open problem solving environments through Bayesian Network inference techniques",
            "Publication year": 2006,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.9.4.150.pdf",
            "Abstract": "During the last years, development of open learning environments that support effectively their users has been a challenge for the research community of educational technologies. The open interactive nature of these environments results in users experiencing difficulties in coping with the plethora of available functions, especially during their initial efforts to use the system. In addition,-from the tutors’ perspectivethe problem solving strategies of the students are often particularly difficult to identify. In this paper, we argue that such problems could be tackled using machine learning techniques such as Bayesian Networks. We show how we can take advantage of log files obtained during field studies to build an adaptive help system providing the most useful support to the student, according to the state of interaction. On the other hand, we attempt to support the tutor, by automating the process of diagnosing students …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:_FxGoFyzp5QC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Deep learning for fake news detection on Twitter regarding the 2019 Hong Kong protests",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-021-06230-0",
            "Abstract": "The dissemination of fake news on social media platforms is an issue of considerable interest, as it can be used to misinform people or lead them astray, which is particularly concerning when it comes to political events. The recent event of Hong Kong protests triggered an outburst of fake news posts that were identified on Twitter, which were then promptly removed and compiled into datasets to promote research. These datasets focusing on linguistic content were used in previous work to classify between tweets spreading fake and real news using traditional machine learning algorithms (Zervopoulos et al., in: IFIP international conference on artificial intelligence applications and innovations, Springer, Berlin, 2020). In this paper, the experimentation process on the previously constructed dataset is extended using deep learning algorithms along with a diverse set of input features, ranging from raw text to …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Mining natural language programming directives with class-oriented bayesian networks",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-88192-6_4",
            "Abstract": "Learning a programming language is a painstaking process, as it requires knowledge of its syntax, apart from knowing the basic process of representing logical sequences to programming stages. This fact deteriorates the coding process and expels most users from programming. Particularly for novice users or persons with vision problems, learning of how to program and tracing the syntax errors could be improved dramatically by using the most natural of all interfaces, i.e. natural language. Towards this orientation, we suggest a wider framework for allowing programming using natural language. The framework can be easily extended to support different object-oriented programming languages such as C, C++, Visual Basic or Java. Our suggested model is named “Language Oriented Basic” and it concerns an intelligent interface that supports code creation, modification and control in Visual Basic. Users …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "House of ads: a multiplayer action game for annotating ad video content",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2797143.2797174",
            "Abstract": "Content-based search in a large collection of media is a task that cannot be fully automated. Semantic annotations provided by humans through crowdsourcing techniques can be attached to media elements in the form of metadata and be used by search engines to provide the required results. However, the manual annotation of large collections is a tedious and time-consuming process and proper incentives need to be provided to attract contributors. Games with a purpose, or human computation games are based on the idea that people could solve computational tasks while playing online games. Numerous such games have been created and used in various areas, including media annotation. However, the majority of them contain limited game elements and the main challenge is the annotation task itself. This paper presents the design, implementation and early evaluation of a human computation game for …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning to predict Pitch Accents using Bayesian Belief Networks for Greek",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/43392930/Learning_to_predict_Pitch_Accents_using_20160305-5411-1tu077i.pdf",
            "Abstract": "Any text-to-speech (TTS) system that aims at producing understandable and natural-sounding output needs to have a module for predicting prosody. In natural speech, some words are said to be stressed, or to bear Pitch Accents. Errors at this level may impede the listener in the correct understanding of the spoken utterance. Regarding the performance of data driven methods, the scale and quality of the corpus are important. Since there is no suitable corpus available for modeling Modern Greek prosody, we created a corpus consisted of 5.500 words, distributed in 500 paragraphs. In describing pitch accent in particular and intonation features in general, we use Pierrehumbert’s theory adopted for MG. In the present study, we try to predict four categories of PA H*, L*, L+ H* and unaccented.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:4JMBOYKVnBMC",
            "Publisher": "LREC"
        },
        {
            "Title": "Designing a Support Tool for Creative Advertising by Mining Collaboratively Tagged Ad Video Content: The Architecture of PromONTotion",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41142-7_2",
            "Abstract": "Creative advertising constitutes one of the highest-budget enterprises today. The present work describes the architecture of PromONTotion, an innovative tool for supporting ad designers in setting up a new campaign. The content of existing ad videos is collaboratively tagged, while playing a multi-player web-based game, and the provided annotations populate the support tool-thesaurus, a hierarchical ontological structure. Annotators-players will also provide information regarding the impact the ads had on them. Data mining and machine learning techniques are then employed for detecting interdependencies and correlations between ontology concepts and attributes, and for discovering underlying knowledge regarding the product type, the ad content and its impact on the players. The support tool will make ad videos, terms, statistical information and mined knowledge available to the ad designer, a …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Learning Greek verb complements: addressing the class imbalance",
            "Publication year": 2004,
            "Publication url": "https://www.aclweb.org/anthology/C04-1153.pdf",
            "Abstract": "Imbalanced training sets, where one class is heavily underrepresented compared to the others, have a bad effect on the classification of rare class instances. We apply One-sided Sampling for the first time to a lexical acquisition task (learning verb complements from Modern Greek corpora) to remove redundant and misleading training examples of verb nondependents and thereby balance our training set. We experiment with well-known learning algorithms to classify new examples. Performance improves up to 22% in recall and 15% in precision after balancing the dataset1.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Statistical decision making from text and dialogue corpora for effective plan recognition",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46154-X_52",
            "Abstract": "In this paper, we introduce an architecture designed to achieve effective plan recognition using Bayesian Networks which encode the semantic representation of the user’s utterances. The structure of the networks is determined from dialogue corpora, thus eliminating the high cost process of hand-coding domain knowledge. The conditional probability distributions are learned during a training phase in which data are obtained by the same set of dialogue acts. Furthermore, we have incorporated a module that learns semantic similarities of words from raw text corpora and uses the extracted knowledge to resolve the issue of the unknown terms, thus enhancing plan recognition accuracy, and improves the quality of the discourse. We present experimental results of an implementation of our platform for a weather information system and compare its performance against a similar, commercial one. Results depict …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Development of a Methodology for the Design and Management of Academic Strategy–A Holist Approach using Multi-criteria Analysis Techniques",
            "Publication year": 2020,
            "Publication url": "https://www.ejers.org/index.php/ejers/article/view/2303",
            "Abstract": "Aim of the current research paper is to propose an innovative solution for the problematic of the holistic management of an academic strategy. The systematic bibliographic surveys conducted showed that the combination of BSC method together with a multitude of MCDA techniques constitute the most important tools for this issue. Thus, we propose a holistic process-based methodology for the management of an academic strategy which spans from its design and oversight, to interpretation issues of the academic classification of departments of Universities or between Universities where assembly bodies (Quality Assurance Unit, HAHE) are active. We claim that our methodology is of particular importance and that its use will highlight the operational quality of well organised Universities.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bayesian Induction of intonational phrase breaks",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.78.9111&rep=rep1&type=pdf",
            "Abstract": "For the present paper, a Bayesian probabilistic framework for the task of automatic acquisition of intonational phrase breaks was established. By considering two different conditional independence assumptions, the naïve Bayes and Bayesian networks approaches were regarded and evaluated against the CART algorithm, which has been previously used with success. A finite length window of minimal morphological and syntactic resources was incorporated, ie the POS label and the kind of phrase boundary, a novel syntactic feature that has not been applied to intonational phrase break detection before. This feature can be used in languages where syntactic parsers are not available and proves to be important, not only for the proposed Bayesian methodologies but for other algorithms, like CART. Trained on a 5500 word database, Bayesian networks proved to be the most effective in terms of precision (82, 3%) and recall (77, 2%) for predicting phrase breaks.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Artificial intelligence-based public sector data analytics for economic crisis policymaking",
            "Publication year": 2020,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/TG-11-2019-0113/full/html",
            "Abstract": "Public sector has started exploiting artificial intelligence (AI) techniques, however, mainly for operational but much less for tactical or level tasks. The purpose of this study is to exploit AI for the highest strategic-level task of government: to develop an AI-based public sector data analytics methodology for supporting policymaking for one of the most serious and large-scale challenges that governments repeatedly face, the economic crises that lead to economic recessions (though the proposed methodology is of much more general applicability).A public sector data analytics methodology has been developed, which enables the exploitation of existing public and private sector data, through advanced processing of them using a big data-oriented AI technique, “all-relevant” feature selection, to identify characteristics of firms as well as their external environment that affect (positively …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Mining Web queries to boost semantic content creation",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30816466/WWW-Internet09-Kotis.pdf",
            "Abstract": "The aim of the paper is to present an ontology learning approach that automatically constructs useful ontologies from query logs. By providing users with a useful ontology that is automatically built from “their needs” ie users’ search interests, in order to address “their needs” ie use of the learned ontology to query information precisely, a new approach that can be considered an incentive in the semantic content creation bottleneck is introduced. The approach can be applied in any set of queries (query logs) given that the queries are classified in specific domains.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Player Modeling Using HOSVD towards Dynamic Difficulty Adjustment in Videogames",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33412-2_13",
            "Abstract": "In this work, we propose and evaluate a Higher Order Singular Value Decomposition (HOSVD) of a tensor as a means to classify player behavior and adjust game difficulty dynamically. Applying this method to player data collected during a plethora of game sessions resulted in a reduction of the dimensionality of the classification problem and a robust classification of player behavior. Simultaneously HOSVD was able to perform significant data compression without significant reduction as regards to the accuracy of the classification outcome and furthermore, was able to alleviate the data sparseness problem common within data collected from game sessions.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Extracting Knowledge from Collaboratively Annotated Ad Video Content",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44722-2_10",
            "Abstract": "Creative advertising support tools have relied so far on static knowledge represented in creativity templates and decision making systems that indirectly impose restrictions on the brainstorming process. PromONTotion is a system under development that aims at creating a support tool for advertisers for the creative process of designing a novel ad campaign that is based on user-driven, generic, automatically mined and thus dynamic semantic knowledge. Semantic terms and concepts are collaboratively provided via crowdsourcing. The present work describes data mining techniques that are applied to the collected annotations and some interesting initial results regarding ad content, ad genre, ad style and ad impact/popularity information.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Privacy preserving tree augmented Naïve Bayesian multi-party implementation on horizontally partitioned databases",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-22890-2_6",
            "Abstract": "The evolution of new technologies and the spread of the Internet have led to the exchange and elaboration of massive amounts of data. Simultaneously, intelligent systems that parse and analyze patterns within data are gaining popularity. Many of these data contain sensitive information, a fact that leads to serious concerns on how such data should be managed and used from data mining techniques. Extracting knowledge from statistical databases is an essential step towards deploying intelligent systems that assist in making decisions, but also must preserve the privacy of parties involved. In this paper, we present a novel privacy preserving data mining algorithm from statistical databases that are horizontally partitioned. The novelty lies to the multi-candidate election schema and its capabilities of being a basic foundation for a privacy preserving Tree Augmented Naïve Bayesian (TAN) classifier, in order …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Artificial Intelligence Applications and Innovations 2010",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=12549080955086283634&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Privacy-Preserving Data Mining and Private Information Retrieval-Accuracy in Privacy-Preserving Data Mining Using the Paradigm of Cryptographic Elections",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=13613861038990745737&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method and apparatus for automatic text input insertion in digital devices with a restricted number of keys",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1707.09487",
            "Abstract": "A device which contains number of symbol input keys, where the number of available keys is less than the number of symbols of an alphabet of any given language, screen, and dynamic reordering table of the symbols which are mapped onto those keys, according to a disambiguation method based on the previously entered symbols. The device incorporates a previously entered keystrokes tracking mechanism, and the key selected by the user detector, as well as a mechanism to select the dynamic symbol reordering mapped onto this key according to the information contained to the reordering table. The reordering table occurs from a disambiguation method which reorders the symbol appearance. The reordering information occurs from Bayesian Belief network construction and training from text corpora of the specific language.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a Bayesian Stochastic Part-Of-Speech and Case Tagger of Natural Language Corpora",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/47652819/Towards_a_Bayesian_Stochastic_Part-Of-Sp20160730-20365-xu1noq.pdf",
            "Abstract": "This paper introduces and evaluates a Bayesian Network probabilistic model for automatic Part-Of-Speech tagging of Modern Greek natural language texts. The Bayesian model for the task of POS tagging is mathematically formed and is compared to that of Hidden Markov, a broadly applied methodology. Our model is trained from annotated corpora, using lexical as well as contextual information. Unlike the majority of existing taggers, it uses minimal linguistic resources, namely a small lexicon which contains the words that belong to non-declinable POS categories and closed-class words. Furthermore, the model is augmented to infer on the case of an unseen word as well. Experimental results depict accuracy in the range of 91%-96% for POS and a range of 93%-97% for case tagging.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning subcategorization frames from corpora: A case study for modern Greek",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.17.9989&rep=rep1&type=pdf",
            "Abstract": "Certain Natural Language Processing (NLP) applications such as parsing and semantic processing require complete lexicons that provide subcategorization information for a word of interest, ie the necessary information about the set (s) of syntactic constituents the word must combine with, in order for its meaning to be fully expressed. Modern Greek presents high flexibility in the allowable orderings of its syntactic phrases as well as rich variety of syntactic constructions, which may function as arguments to verbs. In this paper, we describe a set of machine learning techniques used to automatically extract subcategorization frames of verbs from corpora.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel, gradient boosting framework for sentiment analysis in languages where NLP resources are not plentiful: a case study for modern Greek",
            "Publication year": 2017,
            "Publication url": "https://www.mdpi.com/184534",
            "Abstract": "Sentiment analysis has played a primary role in text classification. It is an undoubted fact that some years ago, textual information was spreading in manageable rates; however, nowadays, such information has overcome even the most ambiguous expectations and constantly grows within seconds. It is therefore quite complex to cope with the vast amount of textual data particularly if we also take the incremental production speed into account. Social media, e-commerce, news articles, comments and opinions are broadcasted on a daily basis. A rational solution, in order to handle the abundance of data, would be to build automated information processing systems, for analyzing and extracting meaningful patterns from text. The present paper focuses on sentiment analysis applied in Greek texts. Thus far, there is no wide availability of natural language processing tools for Modern Greek. Hence, a thorough analysis of Greek, from the lexical to the syntactical level, is difficult to perform. This paper attempts a different approach, based on the proven capabilities of gradient boosting, a well-known technique for dealing with high-dimensional data. The main rationale is that since English has dominated the area of preprocessing tools and there are also quite reliable translation services, we could exploit them to transform Greek tokens into English, thus assuring the precision of the translation, since the translation of large texts is not always reliable and meaningful. The new feature set of English tokens is augmented with the original set of Greek, consequently producing a high dimensional dataset that poses certain difficulties for any traditional classifier …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Economic Crisis Policy Analytics Based on Artificial Intelligence",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-27325-5_20",
            "Abstract": "An important trend in the area of digital government is its expansion beyond the support of internal processes and operations, as well as transactions and consultations with citizens and firms, which were the main objectives of its first generations, towards the support of higher-level functions of government agencies, with main emphasis on public policy making. This gives rise to the gradual development of policy analytics. Another important trend in the area of digital government is the increasing exploitation of artificial intelligence techniques by government agencies, mainly for the automation, support and enhancement of operational tasks and lower-level decision making, but only to a very limited extent for the support of higher-level functions, and especially policy making. Our paper contributes towards the advancement and the combination of these two important trends: it proposes a policy analytics …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Bayesian feature construction",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_25",
            "Abstract": "The present paper discusses the issue of enhancing classification performance by means other than improving the ability of certain Machine Learning algorithms to construct a precise classification model. On the contrary, we approach this significant problem from the scope of an extended coding of training data. More specifically, our method attempts to generate more features in order to reveal the hidden aspects of the domain, modeled by the available training examples. We propose a novel feature construction algorithm, based on the ability of Bayesian networks to represent the conditional independence assumptions of a set of features, thus projecting relational attributes which are not always obvious to a classifier when presented in their original format. The augmented set of features results in a significant increase in terms of classification performance, a fact that is depicted to a plethora of machine …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Random Forests Text Transliteration System for Greek Digraphia",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-23960-1_24",
            "Abstract": "Greeklish to Greek transcription does undeniably seem to be a challenging task since it cannot be accomplished by directly mapping each Greek character to a corresponding symbol of the Latin alphabet. The ambiguity in the human way of Greeklish writing, since Greeklish users do not follow a standardized way of transliteration makes the process of transcribing Greeklish back to Greek alphabet challenging. Even though a plethora of deterministic approaches for the task at hand exists, this paper presents a non-deterministic, vocabulary-free approach, which produces comparable and even better results, supports argot and other linguistic peculiarities, based on an ensemble classification methodology of Data Mining, namely Random Forests. Using data from real users from a conglomeration of resources such as Blogs, forums, email lists, etc., as well as artificial data from a robust stochastic Greek to …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:HDshCWvjkbEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Automated pool detection from satellite images using data mining techniques",
            "Publication year": 2016,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJIM.2016.083911",
            "Abstract": "A significant part of data mining is image mining, a principle that deals with image data relationship or patterns which are not explicitly found in the images. The basic objective is to gather knowledge from images with some known methods such as image retrieval, image processing and artificial intelligence. Towards this direction, this paper proposes a classification system for identifying pools from satellite area images. For the feature extraction of every photograph, and therefore the creation of the data set, the method of trainable segmentation is applied. In the current approach, genetic algorithms are utilised in an attempt to reduce the feature set to only the informative ones and class imbalance issues were also dealt with by incorporating a hybrid boosting and genetic sub-sampling approach. Results show that the best precision and recall rates are achieved by using a combination of AdaBoost and neural …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:yD5IFk8b50cC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "Accuracy in privacy-preserving data mining using the paradigm of cryptographic elections",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87471-3_24",
            "Abstract": "Data mining technology raises concerns about the handling and use of sensitive information, especially in highly distributed environments where the participants in the system may by mutually mistrustful. In this paper we argue in favor of using some well-known cryptographic primitives, borrowed from the literature on large-scale Internet elections, in order to preserve accuracy in privacy-preserving data mining (PPDM) systems. Our approach is based on the classical homomorphic model for online elections, and more particularly on some extensions of the model for supporting multi-candidate elections. We also describe some weaknesses and present an attack on a recent scheme [1] which was the first to use a variation of the homomorphic model in the PPDM setting. In addition, we show how PPDM can be used as a building block to obtain a Random Forests classification algorithm over a set of …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "PP-TAN: a Privacy Preserving Multi-party Tree Augmented Naive Bayes Classifier",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9221844/",
            "Abstract": "The rapid growth of Information and Communication Technologies emerges deep concerns on how data mining techniques and intelligent systems parse, analyze and manage enormous amount of data. Due to sensitive information contained within, data can be exploited by potential aggressors. Previous research has shown the most accurate approach to acquire knowledge from data while simultaneously preserving privacy is the exploitation of cryptography. In this paper we introduce an extension of a privacy preserving data mining algorithm designed and developed for both horizontally and vertically partitioned databases. The proposed algorithm exploits the multi-candidate election schema and its capabilities to build a privacy preserving Tree Augmented Naive Bayesian classifier. Security analysis and experimental results ensure the preservation of private data throughout mining processes.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Incorporating conditional independence assumption with support vector machines to enhance handwritten character segmentation performance",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1048181/",
            "Abstract": "Learning Bayesian belief networks (BBN) from corpora and incorporating the extracted inferring knowledge with a support vector machines (SVM) classifier has been applied to character segmentation for unconstrained handwritten text. By taking advantage of the plethora of unlabeled data found in image databases in addition to available labeled examples, we overcome the expensive task of annotating the whole set of training data and the performance of the character segmentation learner is increased. In addition to this approach, which has not yet been used for this task, we have experimented with two well-known machine learning methods (learning vector quantization and a simplified version of the transformation-based learning theory). We argue that a classifier generated from BBN and SVM is well suited for learning to identify the correct segment boundaries. Empirical results support this claim …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "BAYESIAN RETRIEVAL USING A SIMILARITY-BASED LEMMATIZER",
            "Publication year": 2012,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213012500248",
            "Abstract": "The present paper describes a Bayesian network approach to Information Retrieval (IR) from Web documents. The network structure provides an intuitive representation of uncertainty relationships and the embedded conditional probability table is used by inference algorithms in an attempt to identify documents that are relevant to the user's needs, expressed in the form of Boolean queries. Our research has been directed in constructing a probabilistic IR framework that focus on assisting users to perform Ad-hoc retrieval of documents from the various domains such as economics, news, sports, etc. Furthermore, users can integrate feedback regarding the relevance of the retrieved documents in an attempt to improve performance on upcoming requests. Towards these goals, we have expanded the traditional Bayesian network IR system and tested it on several Greek web corpora on different application domains. We …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:isC4tDSrTZIC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "De Novo Drug Design Using Artificial Intelligence Applied on SARS-CoV-2 Viral Proteins ASYNT-GAN",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1060460",
            "Abstract": "Computer-assisted de novo design of natural product mimetics offers a viable strategy to reduce synthetic efforts and obtain natural-product-inspired bioactive small molecules, but suffers from several limitations. Deep learning techniques can help address these shortcomings. We propose the generation of synthetic molecule structures that optimizes the binding affinity to a target. To achieve this, we leverage important advancements in deep learning. Our approach generalizes to systems beyond the source system and achieves the generation of complete structures that optimize the binding to a target unseen during training. Translating the input sub-systems into the latent space permits the ability to search for similar structures, and the sampling from the latent space for generation.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "of Deliverable",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=17900768266110869323&hl=en&oi=scholarr",
            "Abstract": "The present deliverable is based on the development and the documentation of the first opinion mining prototype for EU Community project. It utilizes the strong aspects of the former version and attempts to correct some disadvantages that were identified throughout the project’s review phase. Therefore, an analysis of the existing levels of opinion mining is provided, followed by a rather detailed explanation on challenges and potential problems for the task at hand. Then, the algorithmic and technical augmentations that are present within the second version are portrayed, followed by an analysis on interconnection with other modules. Finally, there are some future directions and implementation steps for the upcoming, third and final version.",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust stock market miniung, incorporating financial news and technical analysis data",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=17169108682189332923&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MYXXMRIAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A data-driven framework for intonational phrase break prediction",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39398-6_27",
            "Abstract": "For the present work, we attempt to study the issue of automatic acquisition of intonational phrase breaks. A mathematically well-formed framework is suggested, which is based on Bayesian theory. Based on two different assumptions regarding the conditional independence of the input attributes, we have come up with two Bayesian implementations, namely the Naïve Bayes and the Bayesian Networks classifiers. As a performance benchmark, we evaluated the experimental result against CART, an acclaimed algorithm in the field of intonational phrase break detection that has demonstrated stat-of-the-art figures. Our approach utilizes minimal morphological and syntactic resources in a finite length window, i.e. the POS label and the type of syntactic phrase boundary, a novel attribute that has not been applied to the specific task before. On a 5500 word training set, the Bayesian networks approach proved to …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Skin lesion diagnosis from images using novel ensemble classification techniques",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5687620/",
            "Abstract": "Reduction of the error rate of melanoma diagnosis, a critical and very dangerous skin cancer that could be treated when early detected, is of major importance. Towards this direction, the present paper presents a novel ensemble classification technique, combining traditional Random Forests with the `Markov Blanket' notion. The proposed algorithm performs an inherent feature selection phase where only truly informative features are carried forward, thus alleviating the curse of dimensionality and augmenting classification performance. It has been evaluated in a high-dimensional and imbalanced dataset of 1041 skin lesion images, which been preprocessed using the ABCD-rule of dermatology. The proposed ensemble classification technique exhibited a higher classification performance in comparison with the classical Random Forest algorithms, as well as other widely-used classification algorithms where …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data analysis, simulation and visualization for environmentally safe maritime data",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/399212",
            "Abstract": "Marine transportation in Aegean Sea, a part of the Mediterranean Sea that serves as gateway between three continents has recently seen a significant increase. Despite the commercial benefits to the region, there are certain issues related to the preservation of the local ecosystem and safety. This danger is further deteriorated by the absence of regulations on allowed waterways. Marine accidents could cause a major ecological disaster in the area and pose big socio-economic impacts in Greece. Monitoring marine traffic data is of major importance and one of the primary goals of the current research. Real-time monitoring and alerting can be extremely useful to local authorities, companies, NGO’s and the public in general. Apart from real-time applications, the knowledge discovery from historical data is also significant. Towards this direction, a data analysis and simulation framework for maritime data has been designed and developed. The framework analyzes historical data about ships and area conditions, of varying time and space granularity, measures critical parameters that could influence the levels of hazard in certain regions and clusters such data according to their similarity. Upon this unsupervised step, the degree of hazard is estimated and along with other important parameters is fed into a special type of Bayesian network, in order to infer on future situations, thus, simulating future data based on past conditions. Another innovative aspect of this work is the modeling of shipping traffic as a social network, whose analysis could provide useful and informative visualizations. The use of such a system is particularly beneficial for multiple …",
            "Abstract entirety": 0,
            "Author pub id": "MYXXMRIAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        }
    ]
}]