[{
    "name": "Εμμανουήλ Ψαράκης",
    "romanize name": "Emmanouil Psarakis",
    "School-Department": "Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής",
    "University": "upatras",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 1032,
    "Scholar name": "Emmanouil Psarakis",
    "Scholar id": "gqDlpycAAAAJ",
    "Affiliation": "Associate Professor, University of Patras, Greece",
    "Citedby": 1237,
    "Interests": [
        "signal processing",
        "computer vision",
        "statistical signal processing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=gqDlpycAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Top Viewing Human Tracking in Shopping Centres",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-21290-6_42",
            "Abstract": "The problem of top viewing human tracking in a closed environment, such as is the area of a shopping centre is a challenging one. In this paper we test a number of Kalman and simple particles filters-based algorithms for solving the visual tracking problem. Although results obtained from the experiments that we have conducted are promising and can be considered as adequate from all practical perspectives, more research must be done so that the filter used takes into account the existing peculiarities in the movements of human beings.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A new hypothesis testing based technique for the simultaneous detection of seismic events",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6151604/",
            "Abstract": "One of the most difficult tasks in the solution of a hypothesis testing problem is the estimation of the probability density functions of the null and the alternative hypothesis. In this paper, the simultaneous detection of seismic events contained in a given data record is formulated as such a problem and an approximation of the probability density function under the null hypothesis, of a ratio based test statistic is proposed. By exploiting some interesting properties satisfied by the ratio of identical distributed Random Variables, as well as the sparsity of the seismic events in the data record, we succeed in obtaining such an approximation. From a series of experiments we have conducted in both synthetic and real seismic data, the effectiveness of the proposed technique is confirmed.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A weighted L2-based method for the design of arbitrary one-dimensional FIR digital filters",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165168405002434",
            "Abstract": "In FIR filter design problems, filter specifications do not constrain in any way the ideal frequency response inside the transition regions. Most existing L 2-based filter design techniques utilize this flexibility in order to improve their performance. In this paper we propose a new general method for the weighted L 2-based design of arbitrary FIR filters. In particular, we propose a well-defined optimization criterion that depends on the selection of the desired response inside the transition regions. By optimizing our criterion we obtain desired responses that produce weighted mean square error optimum filters with extremely good characteristics. The proposed method is computationally simple since it requires the solution of a linear system of equations.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "PupilTAN: A Few-Shot Adversarial Pupil Localizer",
            "Publication year": 2021,
            "Publication url": "https://openaccess.thecvf.com/content/CVPR2021W/GAZE/html/Poulopoulos_PupilTAN_A_Few-Shot_Adversarial_Pupil_Localizer_CVPRW_2021_paper.html",
            "Abstract": "The eye center localization is a challenging problem faced by many computer vision applications. The challenges typically stem from the scene variability, such as, the wide range of shapes, the lighting conditions, the view angles and the occlusions. Nowadays, the increasing interest on deep neural networks requires a large volume of training data. However, a significant issue is the dependency on labeled data, which are expensive to obtain and susceptible to errors. To address these issues, we propose a deep network, dubbed PupilTAN, that performs image-to-heatmap Translation and an Adversarial training framework that solves the eye localization problem in a few-shot unsupervised way. The key idea is to estimate, by using only a few ground-truth shots, the heatmaps centers' pdf and use it as a generator to create random heatmaps that follow the same probability distribution of the real ones. We showcase that training the deep network with these artificial heatmaps in an adversarial framework not only makes us less dependent on labeled data, but also leads to a significant accuracy improvement. The proposed network achieves realtime performance in a general-purpose computer environment and improves the state-of-the-art accuracy for both MUCT and BioID datasets, even compared with supervised techniques. Furthermore, our model is robust even in the case of reducing its size of up to 1/16 of the original network (0.2 M parameters), demonstrating comparable accuracy to the state-of-the-art with high practical value to real-time applications.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An ECC-based Iterative Algorithm for Photometric Invariant Projective Registration",
            "Publication year": 2009,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S021821300900007X",
            "Abstract": "The ability of an algorithm to accurately estimate the parameters of the geometric transformation which aligns two image profiles even in the presence of photometric distortions can be considered as a basic requirement in many computer vision applications. Projective transformations constitute a general class which includes as special cases the affine, as well as the metric subclasses of transformations. In this paper the applicability of a recently proposed iterative algorithm, which uses the Enhanced Correlation Coefficient as a performance criterion, in the projective image registration problem is investigated. The main theoretical results concerning the proposed iterative algorithm are presented. Furthermore, the performance of the iterative algorithm in the presence of nonlinear photometric distortions is compared against the leading Lucas-Kanade algorithm and its simultaneous inverse compositional variant with …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:QIV2ME_5wuYC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "An improved 3D shape visibility graph with application to mesh segmentation",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S092359652030148X",
            "Abstract": "While most existing 3D shape representation features exploit either surface or volumetric information to describe the mesh, in this paper we propose a method that efficiently combines this dual information. Using both representations, convex as well as concave regions are captured, a property which is necessary for effective shape segmentation. The method extends the well-known volumetric visibility descriptor to a novel geodesic variant that can represent the surface and thus provides complementary information. Specifically, for a pair of mesh nodes, this novel surface representation is constructed by computing the joint visibility among all nodes of the geodesic path connecting them and are at a certain absolute distance each other. By considering different such distances, multiple joint visibility values are computed, organized in a sequence. Although the proposed mesh descriptor can be used in many different …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A ratio test for the accurate automatic P—wave onset detection",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5656125/",
            "Abstract": "In this paper a new nonlinear transformation of the raw data based on the notion of the length of seismogram and a ratio test statistic for the accurate automatic P - wave onset detection problem are proposed. The basic characteristic of the proposed statistic is that it makes no assumptions for the properties of the noise, apart from very loose stationarity requirements. Based on this statistic, we propose an algorithm for the accurate estimation of the arrival times. From a series of experiments on real signals we have conducted, the proposed picking method seems to outperform well known in the literature methods.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Least Squares based Groupwise Image Registration Technique.",
            "Publication year": 2020,
            "Publication url": "https://www.scitepress.org/Papers/2020/91807/91807.pdf",
            "Abstract": "Compared with pairwise registration, groupwise registration is capable of handling a large-scale population of images simultaneously in an unbiased way. In this work we improve upon the state-of-the-art pixel-level, Least-Squares (LS) based groupwise image registration methods. Specifically, we propose a new iterative algorithm which outperforms in terms of its computational cost, a recently introduced LS based iterative congealing scheme. Namely, the particle system that was introduced in that work is used and by imposing its “center of mass” to be motionless, during each iteration of the minimization process, a sequence of “centroid” images whose limit is the unknown “mean” image is optimally in closed form defined, thus solving in a reduced computational cost the groupwise problem. Moreover, the registration technique is properly adapted by the use of Self Quotient Images (SQI) in order to become capable for solving the groupwise registration of multimodal images. Since the proposed congealing technique is invariant to the size of the image set, it can be used for the successful solution of the problem on large image sets with low complexity. From the application of the proposed technique on a series of experiments for the groupwise registration of face, unimodal and multimodal magnetic resonance image sets its performance seems to be very good.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A New Two Step Correlation Based Technique for the Classification of Seismic Events",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=4215801271435072112&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A blobs detection algorithm based on a simplified form of the fast radial symmetry transform",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8096117/",
            "Abstract": "Automatic blobs detection constitutes a basic but difficult problem. In this work a new fast blobs detection technique based on a scale-space representation of the original image, is proposed. The scale-space representation is constructed by using a new simplified form of the Fast Radial Symmetry Transform to precisely detect the essential blobs. From the experiments we have conducted, the proposed technique seems to outperform well known blobs detection methods such as the conventional FRST, Hough and SIFT based techniques, in both accuracy and detection rate. In addition, the proposed technique can be used for the automatic and perfect elimination of the well known Moiré effect which substantially degrades the quality of radiography (X-ray) images.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The April 2007 swarm in Trichonis Lake using data from a microseismic network",
            "Publication year": 2010,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/geosociety/article/view/11409",
            "Abstract": "A series of strong earthquakes took place at the Trichonis lake area, during April 2007. Three events, with M~ 5.0 occurred within one day, causing damages to almost all nearby villages and especially at the small town of Thermo. The sequence lasted for more than one month with small to moderate size events. It was recorded by regional networks and results related to its time and space evolution have already been published. Just after the major events a microseismic network was deployed in the area, by the University of Patras, Seismology Laboratory. Eight stations were installed, with short period, three component sensors and portable digital recorders. The network was in operation for a period of one month and a lot of events were recorded by enough stations to provide a reliable location. We present here the analysis of these data using modern methodologies like waveform cross-correlation techniques and further relocation of the events using waveform based differential time. The results partially support the findings of the regional networks, as regards the gross characteristics of the aftershock sequence, but provide an enhanced description of it. The space time evolution of the aftershock sequence reveals the activation of more than one fault in the area and suggests the connection of the sequence with an unmapped fault.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real time eye localization and tracking",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-00232-9_59",
            "Abstract": "In this paper a reduced complexity eye tracking technique is introduced. The proposed technique is based on a recently introduced eye localization method [5]. In order to exploit its accuracy and robustness under difficult illumination conditions, the presence of occlusions, shadows and pose variations, and making possible its use in real-time applications, we drastically reduce its computational cost while in the same time its accuracy is increased, by the use of an efficient tracking scheme. We also implement the proposed method in low-level C++ programming, using the OpenCV library, thus reducing even more its computational cost. All experiments we have conducted confirm our claims.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A New Chi-Squared based Test Statistic for the Detection of Seismic Events and HOS based Pickers’ Evaluation, 32nd ESC Assembly",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=7912854873162743066&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:blknAaTinKkC",
            "Publisher": "Montpellier"
        },
        {
            "Title": "Computer aided detection of prostate cancer using fused information from dynamic contrast enhanced and morphological magnetic resonance images",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4728462/",
            "Abstract": "This paper presents a computer-aided diagnosis scheme for the detection of prostate cancer. The pattern recognition scheme proposed, utilizes fused dynamic and morphological features extracted from magnetic resonance images (MRIs). The performance of the proposed scheme has been evaluated through extensive training and testing on several patient cases, where the staging of their condition has been previously evaluated by both ultrasoundguided biopsy and radiological assessment. The classification scheme is based on Probabilistic Neural Networks (PNNs), whose parameters are estimated using the Expectation-Maximization (EM) algorithm during a training phase. Fusion of the image characteristics is performed by properly aligning the respective T1-weighted dynamic and T2-weighted morphological images, allowing accurate feature selection from both images. The proposed classification scheme …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A 2-D Wrist Motion Based Sign Language Video Summarization",
            "Publication year": 2021,
            "Publication url": "http://culturetechlab.culture.upatras.gr/sites/default/files/downloads/BMVC_2021.pdf",
            "Abstract": "In this paper we present a keyframe extraction scheme based on the wrist motion using differential geometry. More specifically, the time (t)-parameterized Frennet-Serret frame for tracking the signer’s wrist is used and the curvature of the trajectory, is proposed for the identification of the Sign Language (SL) video keyframes. Specifically, a video frame is characterized as keyframe if on that time instance the t-parameterized curvature function attains a maximum value. Finally, in order to properly define the wrist 2-D motion model, a skeleton tracker is used. The proposed scheme is adaptable, ie, the number of extracted keyframes varies according to the complexity of the signs, while preserving the semantic content. This in turn makes it attractive for applications like video-calling. Its performance in terms of the achieved compression and intelligibility ratios was evaluated on a ground-truth sequence and outperformed its s-parameterized counterpart (s is the arc length); it also outperformed a moment-based SL summarization technique. Furthermore, the proposed scheme was experimentally evaluated on a dataset containing 5500 signs by SL specialists with very promising results. Finally, the proposed keyframe extraction was evaluated against the aforementioned techniques on the same dataset via the use of a GRU neural network on the gloss classification problem; its superior accuracy in identifying the gloss meaning was confirmed.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic seismic signal detection via record segmentation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7029037/",
            "Abstract": "The automatic seismic signal detection constitutes a very interesting and challenging task. The main difficulty in solving this problem is attributed to the fact that both the statistical properties of seismic noise and the characteristics of the recorded events are in general unknown. In this paper, by exploiting the particular nature of the signals we are treating, as well as a number of very interesting properties possessed by exchangeable random variables, we formulate the problem at hand as a record segmentation one and propose the use of two functionally linked test statistics for its efficient and robust solution, in a two-step procedure. By following this approach, we succeed not only in detecting a seismic wave arrival, but also in identifying the entire interval occupied by the signal, while minimizing the number of the required parameters. The performance of the proposed technique is confirmed by a series of …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new Least Squares based congealing technique",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865517301964",
            "Abstract": "The aim of this work is to improve upon the state-of-the-art pixel-level, Least-Squares (LS) based congealing methods. Specifically, we propose a new iterative algorithm, which outperforms in terms of speed, convergence rate and robustness the state-of-the-art inverse compositional LS based iterative scheme. Namely, by associating the geometric distortion of each image of the ensemble with the position of a particle of a multi particle system, we succeed to align the ensemble without having to align all the individual pairs resulting from it. Instead we align each image with the “mean”, but unknown, image. To this end, by imposing the “center of mass” of the particle system to be motionless during each iteration of the minimization process, a sequence of “centroid” images whose limit is the unknown “mean” image is defined, thus solving the congealing problem. The proposed congealing technique is invariant to the …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:u-x6o8ySG0sC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A New Blind Beamforming Technique for the Alignment and Enhancement of Seismic Signals",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8553538/",
            "Abstract": "Blind beamforming constitutes a unified framework for the solution of two very important problems in seismological applications involving ensembles of similar signals, namely the signal alignment and signal enhancement problems. The former problem translates into the estimation of the time delays that exist between the signals, while the second problem deals with the optimal weighting of the signals, so that the SNR of their weighted average is maximized. A global optimization technique for the solution of the alignment problem with a sample-level accuracy, is proposed in this manuscript. The sample-level alignment problem is formulated as a combinatorial optimization problem and an approximate solution is proposed by using the technique of SDP relaxation. Finally, the signal enhancement problem is formulated as a quadratic maximization problem which in the vast majority of cases has an analytical …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new chi-squared based test statistic for the detection of seismic events and HOS based pickers’ evaluation",
            "Publication year": 2010,
            "Publication url": "http://seismo.geology.upatras.gr/pdf/A%20new%20Chi-Square%20based%20Test%20Statistic%20for%20the%20Detection%20of%20Seismic%20Events%20and%20HOS%20based%20Pickers%20Evaluation.pdf",
            "Abstract": "Automatic P-phase onset identification problem involves the solution of two well defined sub-problems; the detection and the picking. Regarding the first one we propose a new parameter free Chi-Square based statistic and its use in a sequential hypothesis testing framework. The main theoretical aspects concerning the proposed detector and its important features are also presented. Among them, the fact that its performance does not depend on the Gaussian noise assumption, as the majority of existing detection schemes do, is pointed out. Furthermore, we compare the performance of the proposed detector against the well known STA/LTA detector, by applying the rivals in a large number of manually identified seismic events. In most cases the proposed detector outperforms its rival. Regarding the picking sub-problem, using the above mentioned dataset, we evaluate the performance of a number of well known …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An enhanced correlation-based method for stereo correspondence with subpixel accuracy",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541350/",
            "Abstract": "The invariance of the similarity measure in photometric distortions as well as its capability in producing subpixel accuracy are two desired and often required features in most stereo vision applications. In this paper we propose a new correlation-based measure which incorporates both mentioned requirements. Specifically, by using an appropriate interpolation scheme in the candidate windows of the matching image, and using the classical zero mean normalized cross correlation function, we introduce a suitable measure. Although the proposed measure is a nonlinear function of the sub-pixel displacement parameter, its maximization results in a closed form solution, resulting in reduced complexity for its use in matching techniques. Application of the proposed measure in a number of benchmark stereo pair images reveals its superiority over existing correlation-based techniques used for subpixel accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient unsupervised diffusion clustering algorithm with application to shape decomposition based on visibility context",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0923596516301941",
            "Abstract": "In this paper the two and three dimensional of a single shape partitioning problem is revisited by means of an iterative, non supervised, very fast and effective algorithm. The notion of visibility context is used as the shape signature, which actually provides a physical meaning to the representation. The visibility serves as a means to manipulate on the shape parts applying clustering techniques to the corresponding graph. Therefore, the decomposition problem is re-casted as a clustering problem. An unsupervised Diffusion Clustering Algorithm is proposed, which efficiently achieves to capture the functional shape parts. Although the proposed algorithm is developed and fits very well to the specific problem of the shape partitioning, its utility is undoubtedly much more general. Experimental results conducted on two and three dimensional shape databases are very promising.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Groupwise Image Alignment via Self Quotient Images",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/695492",
            "Abstract": "Compared with pairwise registration, the groupwise one is capable of handling a large-scale population of images simultaneously in an unbiased way. In this work we improve upon the state-of-the-art pixel-level, Least-Squares (LS)-based groupwise image registration methods. Specifically, the registration technique is properly adapted by the use of Self Quotient Images (SQI) in order to become capable for solving the groupwise registration of photometrically distorted, partially occluded as well as unimodal and multimodal images. Moreover, the proposed groupwise technique is linear to the cardinality of the image set and thus it can be used for the successful solution of the problem on large image sets with low complexity. From the application of the proposed technique on a series of experiments for the groupwise registration of photometrically and geometrically distorted, partially occluded faces as well as unimodal and multimodal magnetic resonance image sets and its comparison with the Lucas–Kanade Entropy (LKE) algorithm, the obtained results look very promising, in terms of alignment quality, using as figures of merit the mean Peak Signal to Noise Ratio (m P S N R) and mean Structural Similarity (m S S I M), and computational cost. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Parametric image alignment using enhanced correlation coeeficient maximization. submitted to IEEE Trans. on PAMI",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=3588456847387721141&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:JV2RwH3_ST0C",
            "Publisher": "submission TPAMI-0026"
        },
        {
            "Title": "A robust initialization scheme for the Remez exchange algorithm",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1172817/",
            "Abstract": "A well-known least squares optimum approximation method is proposed as an efficient initialization scheme for the Remez exchange algorithm. More specifically, we theoretically demonstrate that the \"don't care\" least squares optimum solution guarantees, inside the bands of interest, the correct number of alternating in-sign extrema of the error function, thus satisfying one of the two basic conditions that are sufficient for obtaining the L/sub /spl infin// optimum solution. Although convergence of Remez: is theoretically assured, its practical implementations may fail to converge in \"difficult\" design problems when classical initialization is used. In particular, Matlab's realization of Remez, when initialized with the proposed scheme, exhibits a significantly better overall performance that translates into faster convergence and more robust behavior, especially in difficult design problems.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low cost image processing of Bunsen flame photography for estimation of flame speeds",
            "Publication year": 2019,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00102202.2018.1512105",
            "Abstract": "The need for measuring laminar flame speeds for various fuels and blends is crucial for determining flame stabilization characteristics and design parameters for practical burner configurations. Various methodologies have been used over the years to estimate laminar flame speeds with axisymmetric Bunsen flames being one of the oldest and “simplest” techniques. Nonetheless, the cost of the instrumentation to measure laminar flame speeds with minimum experimental uncertainties remains noticeably high. The present work describes a low-cost flame speed estimation methodology and investigates its efficacy for methane and propane-air mixtures at different equivalence ratios. Flame propagation speeds with respect to the unburned gas were evaluated using both the cone angle and the surface area measurement methods. The experimental approach involves an automated image processing procedure that …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "On the effect of noise on κ estimation",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=9791117819512380334&hl=en&oi=scholarr",
            "Abstract": "The amplitude of the Fourier acceleration spectrum decays rapidly at high frequencies. This has been modeled by the parameter κr (Anderson and Hough, 1984). The site-specific component of κr, named κ0, describes the contribution of the first few km of the geological profile beneath a certain site. κ0 is an important parameter in characterizing high-frequency ground motion, crucial for certain structures such as nuclear facilities and small concrete dams. Large scatter has been observed in the values of κ0 published in literature, which may be due to different analysts, different approaches and frequency bands used for its estimation, and the different regions data may come from, the trade-offs with the source (stress drop) or the site (amplification). As it is the case with any parameter estimation problem, the presence of noise in the data constitutes an important factor of uncertainty in the obtained estimates. Nevertheless, despite the extensive research on the topic of kappa, a detailed study treating the impact of noise on the problem of kappa estimation is missing from the literature. This is exactly the goal of the present work. To this end, we conducted a series of experiments using various synthetic noise models, both correlated and uncorrelated, as well as noise from real records. The kappa estimations were based on ‘noisy’ versions of a high-quality real dataset. We used recordings from an accelerometric downhole array in the Corinth Gulf, Greece, whose high sampling rate and high SNR render it ‘best-case’ scenario in practice. Kappa estimates obtained from this ‘pure’ dataset constituted our control sample. The results confirm our belief that …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Steady state Kalman filter: a new approach",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Emmanouil-Psarakis/publication/220345862_Steady_State_Kalman_Filter_A_New_Approach/links/09e41512d0d8e63ac0000000/Steady-State-Kalman-Filter-A-New-Approach.pdf",
            "Abstract": "In this paper a new approach for the steady state Kalman Filter implementation is proposed. The method is faster than the classical one; this is very important due to the fact that, in most real-time applications, it is essential to obtain the estimate in the shortest possible time.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A visibility graph based shape decomposition technique",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7294852/",
            "Abstract": "In this paper, a new shape decomposition method named Visibility Shape Decomposition (VSD) is presented. Inspired from an idealization of the visibility matrix having a block diagonal form, the definition of a neighborhood based visibility graph is proposed and a two step iterative algorithm for its transformation into a block diagonal form, that can be used for a visually meaningful decomposition of the candidate shape, is presented. Although the proposed technique is applied to shapes of the MPEG7 database, it can be extended to 3D objects. The preliminary results we have obtained are promising.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new thresholding type technique for the detection of seismic events",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6811698/",
            "Abstract": "The problem of seismic events detection constitutes one of the most important and vital tasks for the automatic identification of the seismic phase arrivals. In this work, we propose a new thresholding type technique, tailored to fit real world situations where our knowledge on the statistical characteristics of the background noise process are unknown and a strict hypothesis testing framework can not be followed. In such cases the replacement of the unknown probability density function under the null hypothesis by its empirical counterpart, constitutes a possibility. In this work, a two stage procedure is proposed. The first one concerns the estimation of the empirical functions of the noise process itself as well as its whitened counterpart. In the second stage, using the above empirical functions, a thresholding scheme is proposed in order to solve the problem of the detection of seismic events in a non strict hypothesis …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An improved GAN semantic image inpainting",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-40605-9_38",
            "Abstract": "Image inpainting is used to fill in missing regions based on remaining image data. Although the existing methods, that use deep generative models to infer the missing content, produce realistic images, sometimes the results are unsatisfactory due to arithmetical issues caused by the use of unbalanced ingredients of the proposed cost functions. In this paper, we propose a loss that generates more plausible results. Experiments on two datasets show that our method predicts information in large missing regions and achieves pixel-level photorealism, significantly outperforming state-of-the-art methods [24] and [25]. Having improved the semantic image inpainting we focus on applying the method to laparoscopic images that suffer from glares. The modified technique again outperforms its rivals. Moreover, it is faster than classical PDE based inpainting techniques and, more importantly, its running time is almost …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Closed form expressions for optimum FIR polynomial predictive filtering",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071865/",
            "Abstract": "We propose two different approaches for finding optimum FIR polynomial predictive filters. The first reveals an important property of these filters and can lead to a numerical solution that is of the size of the number of constraints imposed instead of the size of the filter. With the second method, using a different parametrization of the filter coefficients, it is possible to obtain closed form expressions for the optimum filter coefficients and for the minimum output noise power, in the general case. Previous approaches were successful in providing closed forms expressions only for special cases.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectral shape decomposition by using a constrained NMF algorithm",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-16634-6_3",
            "Abstract": "In this paper, the shape decomposition problem is addressed as a solution of an appropriately constrained Nonnegative Matrix Factorization Problem (NMF). Inspired from an idealization of the visibility matrix having a block diagonal form, special requirements while formulating the NMF problem are taken into account. Starting from a contaminated observation matrix, the objective is to reveal its low rank almost block diagonal form. Although the proposed technique is applied to shapes on the MPEG7 database, it can be extended to 3D objects. The preliminary results we have obtained are very promising.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Pixel-ECC Based Laparoscopic Image Alignment In Presence of Large Untextured Regions",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8251294/",
            "Abstract": "The performance of most of the image alignment algorithms degrades in the presence of untextured and homogeneous image regions. Such large regions, and thus inappropriate for using them for alignment, appeared in most of the biological objects. In this paper the Pixel-ECC image alignment algorithm to laparoscopic surgery tailored to avoid this form of degradation is proposed. This is achieved by the use of the Frobenius norms of the Hessian matrices of the image pair for the dynamic detection of the problematic regions in each iteration of alignment algorithm. The proposed algorithm as well as other state of the art image alignment algorithms are used in a number of experiments based on artificial and real laparoscopic data, and the proposed algorithm seems to outperform its rivals.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast Detection and Removal of Glare in Gray Scale Laparoscopic Images.",
            "Publication year": 2018,
            "Publication url": "https://www.scitepress.org/Papers/2018/66542/66542.pdf",
            "Abstract": "Images captured by laparoscopic cameras, often suffer from glare due to specular reflections from surgical tools and some tissue surfaces that can disturb the attention of surgeon. In this paper, inspired by their form, the photometric distortions caused by specular reflections are modeled as the superposition of a smooth and a pulse shaped curve. Based on this model a new fast technique for the detection and removal of glare in gray scale laparoscopic images is proposed. The proposed technique, as well as other state of the art image inpainting algorithms are used in a number of experiments based on artificial and real laparoscopic data, and the proposed algorithm seems to outperform its rivals.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new automatic method for seismic signals segmentation",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6288788/",
            "Abstract": "The solution to the problem of seismic signals segmentation constitutes a very interesting and challenging task. The main difficulty in solving this problem is attributed to the fact that both the statistical properties of seismic noise, as well the characteristics of the recorded events are in general unknown. In this paper, by exploiting the particular nature of the signals we are treating, and by using some interesting properties that obeys a difference based test statistic as well as its ingredients, we propose an approach that results in a robust and efficient automatic detection method. From a series of experiments we have conducted in both synthetic and real seismic data, the effectiveness of the proposed technique is confirmed.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Maximal correlation: An alternative criterion for training generative networks",
            "Publication year": 2020,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/54987",
            "Abstract": "Generative adversarial networks (GANs) require the design of a generator and a discriminator network which is achieved by solving min-max optimization problems. Min-max/adversarial optimizations are implemented with the help of two stochastic gradient algorithms, one for each optimization problems. This data-driven approach is known to suffer from non-robustness and need for excessive computations and processing time. In this work we propose a kernel based correlation criterion which we only maximize. Under ideal conditions this non-adversarial approach is shown to achieve the same goal as the existing adversarial methods. Under a pure data-driven scenario we only need a generator network which we train with a single gradient algorithm. Since the proposed criterion is a nonlinear combination of three expectations of functions, as opposed to the standard case of a single expectation of a function …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:RGFaLdJalmkC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "THEASIS System for Early Detection of Wildfires in Greece: Preliminary Results from its Laboratory and Small Scale Tests",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9000445/",
            "Abstract": "This paper presents the preliminary results of the THEASIS system which is under development for early detection of wildfires in Greece. Firstly, the proposed system in terms of conceptual design, the early fire detection methodology as well as the main software modules are presented. Laboratory and small-scale experiments made in the University of Patras campus as well as in the Strofylia forest are presented. The concluding remarks are promising towards the development of an efficient system for early detection of wildfires.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D image acquisition and NURBS based geometry modelling of natural objects",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0965997800000600",
            "Abstract": "This paper presents a recently developed Image Acquisition–Geometric Modelling system for the construction of geometric models of natural or artificial objects. This construction is achieved in a two-step procedure. First, the object of interest is digitised, i.e. points on the surface of the object are computed. Then, based on the cloud of digitised 3D points, an approximating surface, a geometric model of the object of interest, is constructed. Coupled with a mesh generation package, the system presented allows for further processing and analysis of the resulting model instead of the real object itself.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Photometric Invariant Projective Registration Using ECC Maximization",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new depth camera calibration algorithm",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7002236/",
            "Abstract": "Camera calibration constitutes a basic problem in many robot applications. In this paper two algorithms tailored to the calibration of the parameters of a depth camera are proposed. More precisely, a closed form solution that requires the coordinates of three corresponding points in the world and the camera coordinates systems, for the noise free case is proposed. Moreover, a robust algorithm that can be used for the successful estimation of the parameters in the presence of both uniform noise that models the quantization error along the axes of the “volume”, as well as of a sparse noise component for the modeling of large errors presented in depth measurements, is presented. From the simulation results we have obtained, the proposed methods seem to outperform in terms of the average worst case estimation errors frequently used algorithms for the problem at hand.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Robust Pixel ECC based Algorithm for Occluded Image Alignment.",
            "Publication year": 2016,
            "Publication url": "https://www.scitepress.org/papers/2016/57882/57882.pdf",
            "Abstract": "The alignment of occluded images constitutes a common and difficult problem. In this paper we propose a new method based on ECC algorithm tailored to occluded image alignment problem which enjoy a simple closed-form solution with low computational cost. Moreover, the use of a proper subset of the region of interest that limits the impact of the outliers in the estimation of the parameters is proposed. The use of this set seems to make the proposed method insensitive to the use of the occluded image as template or as warped in the alignment process. The proposed method is compared against two well known Gradient Corellation based methods by its application in several image alignment problems and in all cases outperforms its rivals in terms of accuracy and percentage of convergence.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Kernel-based training of generative networks",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1811.09568",
            "Abstract": "Generative adversarial networks (GANs) are designed with the help of min-max optimization problems that are solved with stochastic gradient-type algorithms which are known to be non-robust. In this work we revisit a non-adversarial method based on kernels which relies on a pure minimization problem and propose a simple stochastic gradient algorithm for the computation of its solution. Using simplified tools from Stochastic Approximation theory we demonstrate that batch versions of the algorithm or smoothing of the gradient do not improve convergence. These observations allow for the development of a training algorithm that enjoys reduced computational complexity and increased robustness while exhibiting similar synthesis characteristics as classical GANs.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stochastic Modeling as a Method of Arriving at Higher Frequencies: An Application to κ Estimation",
            "Publication year": 2020,
            "Publication url": "https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2019JB018768",
            "Abstract": "We present a framework for stochastically modeling the Fourier spectrum of the noisy seismic recording based on the fundamental assumption that the latter constitutes a random rather than a deterministic quantity. First we demonstrate (mathematically and through simulations) that, under the stochastic‐signal assumption, the periodogram ordinates of the noisy recording can be considered independent exponential random variables with a frequency‐dependent mean. Using this finding, the estimation of seismological parameters is translated into a well‐defined maximum likelihood (ML) problem, allowing a fast, accurate, and robust solution. Although the proposed ML methodology constitutes a general estimation framework that we believe can improve any spectral analysis, here we specifically apply it to the high‐frequency attenuation parameter (κ), crucial for understanding rock ground motion. Other …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A kronecker product model for repeated pattern detection on 2d urban images",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8417901/",
            "Abstract": "Repeated patterns (such as windows, balconies, and doors) are prominent and significant features in urban scenes. Therefore, detection of these repeated patterns becomes very important for city scene analysis. This paper attacks the problem of repeated pattern detection in a precise, efficient and automatic way, by combining traditional feature extraction with a Kronecker product based low-rank model. We introduced novel algorithms that extract repeated patterns from rectified images with solid theoretical support. Our method is tailored for 2D images of building façades and tested on a large set of façade images.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new iterative graph based clustering method",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6399734/",
            "Abstract": "In this paper we propose a new iterative graph based clustering technique. The proposed method has three desirable characteristics as compared to well known clustering techniques. Specifically, because of its iterative nature, the number of clusters contained in a given data set it is not necessary to be known a priori as partitional clustering techniques demand. Its performance, in terms of the quality of the achieved clustering, does not depend on the distribution of the cluster's size. Finally, no threshold value is required for achieving the clustering as hierarchical clustering techniques demand. All these features manifest themselves in the important problem of clustering homologous proteins when only sequence information is available. The proposed method is tested against well known and widely used techniques, by conducting a number of experiments based on both artificial and real protein data sets and all …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "AN L2 BASED METHOD FOR THE DESIGN OF ONE DIMENSIONAL FIR DIGITAL FILTERS",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Photometric Invariant Projective Registration",
            "Publication year": 2007,
            "Publication url": "http://xanthippi.ceid.upatras.gr/people/psarakis/publications/projective.pdf",
            "Abstract": "The ability of an algorithm to accurately estimate the parameters of the geometric transformation which aligns two image profiles even in the presence of photometric distortions can be considered as a basic requirement in many computer vision applications. Projective transformations constitute a general class which includes as special cases the affine, as well as the metric subclasses of transformations. In this paper the applicability of a recently proposed iterative algorithm, which uses the Enhanced Correlation Coefficient as a performance criterion, in the projective image registration problem is investigated. The main theoretical results concerning the iterative algorithm and an efficient approximation that leads to an optimal closed form solution (per iteration) are presented. Furthermore, the performance of the iterative algorithm in the presence of nonlinear photometric distortions is compared against the leading Lucas-Kanade algorithm and its simultaneous inverse compositional variant by performing numerous simulations. In most cases the proposed algorithm outperforms the other algorithms in convergence speed and robustness against photometric distortions under ideal and noisy conditions.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new high precision eye center localization technique",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8296794/",
            "Abstract": "The accurate eye center localization constitutes a challenging problem. In this paper a new technique based on a modified version of Radial Symmetry Transform is proposed. Specifically, computing the components of the transform from different modalities of the original image, we succeeded to improve the accuracy of the eye center localizer. The results we obtained from the application of the proposed method to the most challenging face databases show that our technique outperforms in accuracy most of the state of the art techniques.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "UAV forest monitoring in case of fire: Robustifying video stitching by the joint use of optical and thermal cameras",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-00232-9_17",
            "Abstract": "In this paper a new UAV video stitching method which is robust even in the presence of forest fire is proposed. The proposed method exploits in a complementary way both optical and thermal cameras. In particular, the visibility of the optical cameras in the presence of smoke is improved by exploiting the transparency of the thermal cameras to smoke. In addition, a new system based on the ECC image alignment algorithm that is capable in solving the video stabilization and stitching problems is proposed. Preliminary results obtained from the application of the proposed system in UAV captured videos are very promising.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A new approach for arriving at higher frequencies through stochastic modelling: application to site attenuation (kappa)",
            "Publication year": 2020,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2020EGUGA..2221645P/abstract",
            "Abstract": "We propose a framework for stochastically modelling the Fourier spectrum of the noisy seismic recording, considering that a seismic signal is a random rather than a deterministic quantity. We show that under this assumption, the noisy recording's periodogram can be modelled as independent Exponential random variables with a frequency-dependent mean. With this model, estimating seismological parameters can be tackled through Maximum Likelihood (ML), allowing a fast, accurate and robust solution. This new approach constitutes a general estimation framework applicable to any parameter estimation that uses spectral analysis. Here we apply it to the high-frequency decay parameter kappa, which is particularly important for estimating and adjusting ground motion on rock. The improved ML performance is shown through a series of experiments on synthetic and recorded seismograms. The biggest …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient image registration with subpixel accuracy",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071581/",
            "Abstract": "The contribution of this paper is twofold. First, a new spatial domain image registration technique with subpixel accuracy is presented. This technique is based on a double maximization of the correlation coefficient and provides a closed-form solution to the subpixel translation estimation problem. Second, an efficient iterative scheme for integer registration is proposed, which reduces significantly the number of searches, as compared to the exhaustive search. This scheme can be used as a pre-processing step in the sub-pixel accuracy technique, leading to lower computational complexity. Extensive simulation results have shown that the performance of the proposed technique compares very favorably with respect to existing ones.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient spatial domain technique for subpixel image registration",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S092359650800088X",
            "Abstract": "In this paper a new technique for performing image registration with subpixel accuracy is presented. The proposed technique, which is based on the maximization of the correlation coefficient function, does not require the reconstruction of the intensity values and provides a closed-form solution to the subpixel translation estimation problem. Moreover, an efficient iterative scheme is proposed, which reduces considerably the overall computational cost of the image registration problem. This scheme properly combined with the proposed similarity measure results in a fast spatial domain technique for subpixel image registration.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fractal analysis of tree paintings by Piet Mondrian (1872-1944)",
            "Publication year": 2017,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJART.2017.083902",
            "Abstract": "We examine two paintings by Piet Mondrian, and suggest that his depiction of tree foliages exhibit fractal patterns of a specific dimension. Our analysis implies that fractality may possess an aesthetic value that affected Mondrian, perhaps in a similar way as it inspired Jackson Pollock, another famous painter who incorporated fractality in several of his paintings. In recent years there has been a stimulating debate among scientists arguing for and against the thesis that Jackson Pollock's drip paintings when analysed at small scales can be described by the mathematics of fractal geometry. Our suggestion that fractal patterns exist in the paintings of a second famous artist - in this case Piet Mondrian - further supports the hypothesis that the beauty which exists in fractality may affect consciously or subconsciously such great painters as Jackson Pollock and Piet Mondrian.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "Seismic event relocation",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=10330752079904593593&hl=en&oi=scholarr",
            "Abstract": "Event relocation (or relative location) techniques exploit the particularities of similar (i.e. closely spaced) seismic events in order to minimize the impact of unmodelled velocity errors in the estimation of the hypocenter parameters. The location uncertainty obtained from relocation procedures is typically orders of magnitude lower than that obtained from conventional event location methods. The relocation of hypocentral parameters constitutes a complex procedure that comprises of three main steps. The first step involves the examination the available data set of seismic records with the goal of recognizing groups of similar events. It can be further decomposed in smaller tasks involving the detection of seismic events from continuous records, the assessment of the pairwise similarity of the events and the clustering of similar pairs of event. The second step of the relocation procedure concerns the estimation of travel time differences between event pairs of the same cluster, at the same station. Finally, the third (and final) step of the relocation procedure consists of solving the inverse problem for the estimation of the relative locations that best fit the differential times obtained from the second step. The main contributions of the present thesis can be summarized as follows: Event detection and picking. In the present thesis we treat the detection problem as a problem of record segmentation by exploiting the particular nature of seismic signals, as well as a number of very interesting properties possessed by exchangeable random variables. By following this approach, we succeed not only in detecting a seismic wave arrival, but also in identifying the entire …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A generative model for the joint registration of multiple point sets",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-10584-0_8",
            "Abstract": "This paper describes a probabilistic generative model and its associated algorithm to jointly register multiple point sets. The vast majority of state-of-the-art registration techniques select one of the sets as the “model” and perform pairwise alignments between the other sets and this set. The main drawback of this mode of operation is that there is no guarantee that the model-set is free of noise and outliers, which contaminates the estimation of the registration parameters. Unlike previous work, the proposed method treats all the point sets on an equal footing: they are realizations of a Gaussian mixture (GMM) and the registration is cast into a clustering problem. We formally derive an EM algorithm that estimates both the GMM parameters and the rotations and translations that map each individual set onto the “central” model. The mixture means play the role of the registered set of points while the variances …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A computer-aided system for the detection of prostate cancer based on magnetic resonance image analysis",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4537440/",
            "Abstract": "This paper presents an overview of a computer- aided system for the detection of carcinomas in the prostate gland. The proposed system incorporates information from two different types of magnetic resonance images (MRIs), namely the T2-weighted morphological images and the T1-weighted dynamic contrast enhanced (DCE) images, to extract discriminative features that will be used in the training phase of a classification algorithm for the differentiation between malignant and benign tissue. The resulting feature vectors are also used for the assessment of new patient cases. The pattern recognition scheme is based on probabilistic neural networks (PNNs). The parameters of the PNNs are estimated using the expectation- maximization (EM) algorithm. The performance of the proposed computer-aided detection system is evaluated through training and testing on several patient cases, whose condition has been …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A comparison of the characteristics of disk stabilized lean propane flames operated under premixed or stratified inlet mixture conditions",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0894177714000909",
            "Abstract": "The work investigates some of the differences and similarities between fully-premixed and stratified lean propane flames stabilized in an axisymmetric bluff-body swirl burner configuration. In this arrangement a double-cavity propane–air premixer, formed along three concentric disks, supplies the afterbody disk recirculation region with a regulated radial equivalence ratio gradient. Flame stabilization can be established at a range of co-flow swirl intensities under, either uniformly premixed or stratified inlet mixture conditions. Measurements of turbulent velocities, temperatures, chemiluminescence imaging of OH* and CH* and gas analysis provided information for lean and close to blow-off flame configurations. Supporting Large Eddy Simulations were undertaken with the Thickened Flame Model and a nine-step mechanism for propane combustion to complement the experiments. The combined methodology helped …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Projective Image Alignment by Using ECC Maximization.",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.167.4770&rep=rep1&type=pdf",
            "Abstract": "Nonlinear projective transformation provides the exact number of desired parameters to account for all possible camera motions thus making its use a natural choice in image alignment problems. Moreover, the ability of an alignment algorithm to quickly and accurately estimate the parameter values of the geometric transformation even in cases of over-modelling of the warping process constitutes a basic requirement for many computer vision applications. In this paper the appropriateness of the Enhanced Correlation Coefficient (ECC) function as a performance criterion in the projective image registration problem is investigated. Since this measure is a highly nonlinear function of the warp parameters, its maximization by using an iterative technique is achieved. The main theoretical results concerning the nonlinear optimization problem and an efficient approximation leads to an optimal closed form solution (per iteration) are presented. The performance of the iterative algorithm is compared against the well known Lucas-Kanade algorithm through a series of experiments involving strong or weak geometric deformations, ideal and noisy conditions and even over-modelling of the warping process. In all cases ECC based algorithm exhibits a better behavior in speed, as well as in the probability of convergence as compared to the Lucas-Kanade scheme.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "From pillars to AI technology-based Forest fire protection systems",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=RmH9DwAAQBAJ&oi=fnd&pg=PA125&dq=info:z2aSWGg4dvQJ:scholar.google.com&ots=IQA8xWumAm&sig=Ff-FdvDNbsd36FpalwTFlNf4gqo",
            "Abstract": "The importance of forest environment in the perspective of the biodiversity as well as from the economic resources which forests enclose, is more than evident. Any threat posed to this critical component of the environment should be identified and attacked through the use of the most efficient available technological means. Early warning and immediate response to a fire event are critical in avoiding great environmental damages. Fire risk assessment, reliable detection and localization of fire as well as motion planning, constitute the most vital ingredients of a fire protection system. In this chapter, we review the evolution of the forest fire protection systems and emphasize on open issues and the improvements that can be achieved using artificial intelligence technology. We start our tour from the pillars which were for a long time period, the only possible method to oversee the forest fires. Then, we will proceed to the exploration of early AI systems and will end-up with nowadays systems that might receive multimodal data from satellites, optical and thermal sensors, smart phones and UAVs and use techniques that cover the spectrum from early signal processing algorithms to latest deep learning-based ones to achieving the ultimate goal.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "Multi-contrast MR Image/Volume Alignment via ECC Maximization",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8941937/",
            "Abstract": "The multi-contrast MRI volume registration problem constitutes one of the basic steps in many computer vision applications. Since different types of MRI images have totally different intensity distributions, the use of well known area based image alignment techniques does not consist a good choice for the solution of the problem at hand. In this paper the usage of Self Quotient Volumes as an efficient representation of the candidate volumes, to permit the exploitation of area based techniques, is proposed. In addition, a well known \"signal\" similarity measure based on the Enhanced Correlation Coefficient, is adapted for solving the volume alignment problem. From the application of the proposed technique in a series of experiments with artificial, as well as real, MRI brain sequences and its comparison against state of the art volume registration techniques it seems that its performance is better for both types (same and …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Parametric image alignment using enhanced correlation coefficient maximization",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4515873/",
            "Abstract": "In this work we propose the use of a modified version of the correlation coefficient as a performance criterion for the image alignment problem. The proposed modification has the desirable characteristic of being invariant with respect to photometric distortions. Since the resulting similarity measure is a nonlinear function of the warp parameters, we develop two iterative schemes for its maximization, one based on the forward additive approach and the second on the inverse compositional method. As it is customary in iterative optimization, in each iteration the nonlinear objective function is approximated by an alternative expression for which the corresponding optimization is simple. In our case we propose an efficient approximation that leads to a closed form solution (per iteration) which is of low computational complexity, the latter property being particularly strong in our inverse version. The proposed schemes are …",
            "Abstract entirety": 0,
            "Author pub id": "gqDlpycAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computer Vision—ECCV 2014",
            "Publication year": 2014,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer"
        },
        {
            "Title": "Automatic Kronecker product model based detection of repeated patterns in 2D urban images",
            "Publication year": 2013,
            "Publication url": "https://www.cv-foundation.org/openaccess/content_iccv_2013/html/Liu_Automatic_Kronecker_Product_2013_ICCV_paper.html",
            "Abstract": "Repeated patterns (such as windows, tiles, balconies and doors) are prominent and significant features in urban scenes. Therefore, detection of these repeated patterns becomes very important for city scene analysis. This paper attacks the problem of repeated patterns detection in a precise, efficient and automatic way, by combining traditional feature extraction followed by a Kronecker product lowrank modeling approach. Our method is tailored for 2D images of building fac, ades. We have developed algorithms for automatic selection of a representative texture within fac, ade images using vanishing points and Harris corners. After rectifying the input images, we describe novel algorithms that extract repeated patterns by using Kronecker product based modeling that is based on a solid theoretical foundation. Our approach is unique and has not ever been used for fac, ade analysis. We have tested our algorithms in a large set of images.",
            "Abstract entirety": 1,
            "Author pub id": "gqDlpycAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        }
    ]
}]