[{
    "name": "Εμμανουήλ Μάγκος",
    "romanize name": "Emmanouil Magkos",
    "School-Department": "Πληροφορικής",
    "University": "ionio",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 17022,
    "Scholar name": "Emmanouil (Manos) Magkos",
    "Scholar id": "qy_LFbsAAAAJ",
    "Affiliation": "Associate Professor, Department of Informatics, Ionian University",
    "Citedby": 1023,
    "Interests": [
        "Computer Security",
        "Applied Cryptography"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=qy_LFbsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "The privacy paradox in the context of online health data disclosure by users",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-65930-5_34",
            "Abstract": "The privacy paradox phenomenon corresponds to the inconsistency between the privacy concerns and the actual behavior of online users. The existence of the phenomenon has been studied in many fields, such as for social networks and especially for a variety of forums and online communities. This paper questions its existence in the context of sensitive data, and more specific in the health data area via a survey which took place in Greece. Given that health-related information is perceived as sensitive personal data it is often excluded from discussions and sharing. This research aims to unravel the paradox’s existence regarding the disclosure of health data information when individuals visit related online forums and communities.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Electronic voting systems",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=8340694124038302085&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Critical infrastructure protection: a holistic methodology for Greece",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-61437-3_2",
            "Abstract": " The protection of Critical Infrastructures (CI) is, by definition, of high importance for the welfare of citizens, due to direct threats (dictated by the current international political situation) and also due to their dependencies at international and European levels. Today, Greece remains one of the countries of the European Union, which has no comprehensive strategy to safeguard national CI, nor any process of developing such an integrated plan, except for some initiatives taken from the General Secretariat of Digital Policy. This paper aims to contribute to: (i) The creation of an inventory of all stakeholders, (legislative, supervisory or regulatory) involved in CI protection in Greece, (ii) the identification of potential national CI, as well as their interdependencies, (iii) the development of a structured identification based on impact assessment methodology for national CI, that takes into account internationally applied CI …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:maZDTaKrznsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Strengthening privacy protection in VANETs",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4654290/",
            "Abstract": "In the not so far future, vehicles are expected to be able to communicate with each other and with the road infrastructure, to enhance driving experience and support road safety, among others. Vehicular ad-hoc networks (VANETs) introduce a number of security challenges to the research community, mainly concerning the tradeoff between the privacy of the drivers and the accountability of misbehaving vehicles. Another challenge is how to satisfy privacy in the presence of an adversary that has access to all communication (a global observer), and that can perform traffic analysis in order to link messages and identify vehicles. In this paper we attempt to address such issues and propose a set of cryptographic mechanisms that balance the tradeoff between privacy and accountability in a VANET. Furthermore, we examine techniques for location privacy against adversaries that perform a Bayesian traffic analysis, and …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Uncoercible e-bidding games",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:ELEC.0000009284.64158.0a",
            "Abstract": "The notion of uncoercibility was first introduced in e-voting systems to deal with the coercion of voters. However this notion extends to many other e-systems for which the privacy of users must be protected, even if the users wish to undermine their own privacy. In this paper we consider uncoercible e-bidding games. We discuss necessary requirements for uncoercibility, and present a general uncoercible e-bidding game that distributes the bidding procedure between the bidder and a tamper-resistant token in a verifiable way. We then show how this general game can be used to design provably uncoercible e-auctions and e-elections. Finally, we discuss the practical consequences of uncoercibility in other areas of e-commerce.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "DEFeND DSM: A Data Scope Management Service for Model-Based Privacy by Design GDPR Compliance",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-58986-8.pdf#page=188",
            "Abstract": "The introduction of the European General Data Protection Regulation (GDPR) has brought significant benefits to citizens, but it has also created challenges for organisations, which are facing with difficulties interpreting it and properly applying it. An important challenge is compliance with the Privacy by Design and by default (PbD) principles, which require that data protection is integrated into processing activities and business practices from the design stage. Recently, the European Data Protection Board (EDPB) released an official document with PbD guidelines, and there are various efforts to provide approaches to support these. However, organizations are still facing difficulties in identifying a flow for executing, in a coherent, linear and effective way, these activities, and a complete toolkit for supporting this. In this paper, we:(i) identify the most important PbD activities and strategies,(ii) design a coherent, linear …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Modeling Security in Cyber-Physical Systems",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1874548212000443",
            "Abstract": "This paper describes a framework for modeling the security of a cyber–physical system in which the behavior of the adversary is controlled by a threat model that captures – in a unified manner – the cyber aspects (with discrete values) and the physical aspects (with continuous values) of the cyber–physical system. In particular, the framework addresses combined (dependent) vector attacks and synchronization/localization issues. The framework identifies the cyber–physical features that must be protected according to the prevailing security policy. Also, the framework can be used for formal proofs of the security of cyber–physical systems.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:_kc_bZDykSQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Common Security Model for Conducting e-Auctions and e-Elections",
            "Publication year": 2002,
            "Publication url": "http://users.ionio.gr/~emagos/Common%20Security%20Model.pdf",
            "Abstract": "With the advent of new technologies, traditional systems are currently replaced with electronic ones. Throughout this transition, security concerns such as privacy and anonymity are increasingly raised. In this paper we consider, from a security point of view, electronic auctions and electronic voting systems. We present, at high level, a common model for securely conducting both systems. It is also shown how several application-specific requirements can be incorporated into this model.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards secure and practical location privacy through private equality testing",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11257-2_24",
            "Abstract": "In this paper, we propose a practical, privacy-preserving equality testing primitive which allows two users to learn if they share the same encrypted input data. Our protocol assumes no trust on a third party and/or other peers, and it is specifically suited for low-min entropy data (i.e., data that can be exhaustively searched by an attacker), such as encrypted users locations. We demonstrate that our primitive is secure and efficient: Two public-key exponentiations are required, per each user, for each equality testing. We give implementation results, showing that our primitive is practical in a multiple users scenario. Finally, we describe how we could use our primitive as a building block for a proximity testing buddy-finder service for social networks.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Uncertainty for anonymity and 2-dimensional range query distortion",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15838-4_8",
            "Abstract": "In this work, we study the problem of anonymity-preserving data publishing in moving objects databases. In particular, the trajectory of a mobile user on the plane is no longer a polyline in a two-dimensional space, instead it is a two-dimensional surface: we know that the trajectory of the mobile user is within this surface, but we do not know exactly where. We transform the surface’s boundary poly-lines to dual points and we focus on the information distortion introduced by this space translation. We develop a set of efficient spatio-temporal access methods and we experimentally measure the impact of information distortion by comparing the performance results of the same spatio-temporal range queries executed on the original database and on the anonymized one.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer Berlin/Heidelberg LNCS 6344"
        },
        {
            "Title": "Engaging Students in Basic Cybersecurity Concepts Using Digital Game-Based Learning: Computer Games as Virtual Learning Environments",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-41196-1_4",
            "Abstract": "Teaching various topics using gamification elements or Game-Based Learning (GBL) methods is a top trend nowadays. Gamification has shown great results towards this direction, however, the usage of GBL methods has not been sufficiently studied for the effectiveness of the learning process. This study examines how instructional design could be applied and how computer games could be a learning environment for acquiring the basic skills and experience in fundamental cybersecurity topics. Towards this direction, this research aspires to discover how specific computer games, designed as simulations, could be converted into virtual learning environments and enhance the learning process, by increasing the levels of motivation and engagement of undergraduate students in the topics of cybersecurity. Computer games are appropriate for creating effective virtual learning environments specific to cybersecurity …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A framework for secure and verifiable logging in public communication networks",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11962977_22",
            "Abstract": "In this paper we are focusing on secure logging for public network providers. We review existing security threat models against system logging and we extend these to a new threat model especially suited in the environment of telecommunication network providers. We also propose a framework for secure logging in public communication networks as well as realistic implementations designs, which are more resilient to the identified security threats. A key role to the proposed framework is given to an independent Regulatory Authority, which is responsible to verify the integrity of the log files.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer LNCS 434"
        },
        {
            "Title": "Treating scalability and modelling human countermeasures against local preference worms via gradient models",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11416-008-0099-8",
            "Abstract": "A network worm is a specific type of malicious software that self propagates by exploiting application vulnerabilities in network-connected systems. Worm propagation models are mathematical models that attempt to capture the propagation dynamics of scanning worms as a means to understand their behaviour. It turns out that the emerged scalability in worm propagation plays an important role in order to describe the propagation in a realistic way. On the other hand human-based countermeasures also drastically affect the propagation in time and space. This work elaborates on a recent propagation model (Avlonitis et al. in J Comput Virol 3, 87–92, 2007) that makes use of Partial Differential Equations in order to treat correctly scalability and non-uniform behaviour (e.g., local preference worms). The aforementioned gradient model is extended in order to take into account human-based countermeasures …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Towards Efficient Cryptography for Privacy Preserving Data Mining in Distributed Systems.",
            "Publication year": 2008,
            "Publication url": "https://www.scitepress.org/papers/2008/15314/15314.pdf",
            "Abstract": "A common fact for both businesses and physical entities is that sensitive, accurate information would be more easily diffused if adequate measures for protection were in place. This could also lead to higher quality data mining results, in a privacy preserving manner. Recent research has proved that it is possible to provide both privacy and accuracy assurances in a distributed computing scenario, where all participants may be mutually untrusted, without the presence of an unconditionally trusted third party. We believe that valuable knowledge can be borrowed from the vast body of literature on e-auction and e-voting systems, in order to be adapted to privacy preserving data mining systems in a distributed environment. These systems tend to balance well the efficiency and security criteria, because they need to be implementable in medium to large scale environments.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Uncertainty for Privacy and 2-Dimensional Range Query Distortion",
            "Publication year": 2011,
            "Publication url": "https://www.koreascience.or.kr/article/JAKO201128762648378.page",
            "Abstract": "In this work, we study the problem of privacy-preservation data publishing in moving objects databases. In particular, the trajectory of a mobile user in a plane is no longer a polyline in a two-dimensional space, instead it is a two-dimensional surface of fixed width , where  defines the semi-diameter of the minimum spatial circular extent that must replace the real location of the mobile user on the XY-plane, in the anonymized (kNN) request. The desired anonymity is not achieved and the entire system becomes vulnerable to attackers, since a malicious attacker can observe that during the time, many of the neighbors' ids change, except for a small number of users. Thus, we reinforce the privacy model by clustering the mobile users according to their motion patterns in (u, ) plane, where u and  define the velocity measure and the motion direction (angle) respectively. In this case, the anonymized (kNN) request looks up neighbors, who belong to the same cluster with the mobile requester in (u, ) space: Thus, we know that the trajectory of the k-anonymous mobile user is within this surface, but we do not know exactly where. We transform the surface's boundary poly-lines to dual points and we focus on the information distortion introduced by this space translation. We develop a set of efficient spatiotemporal access methods and we experimentally measure the impact of information distortion by comparing the performance results of the same spatiotemporal range queries executed on the original database and on the anonymized one.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:dhFuZR0502QC",
            "Publisher": "KIISE"
        },
        {
            "Title": "Privacy, security, legal and technology acceptance elicited and consolidated requirements for a GDPR compliance platform",
            "Publication year": 2020,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/ICS-01-2020-0002/full/html",
            "Abstract": "General data protection regulation (GDPR) entered into force in May 2018 for enhancing personal data protection. Even though GDPR leads toward many advantages for the data subjects it turned out to be a significant challenge. Organizations need to implement long and complex changes to become GDPR compliant. Data subjects are empowered with new rights, which, however, they need to become aware of. GDPR compliance is a challenging matter for the relevant stakeholders calls for a software platform that can support their needs. The aim of data governance for supporting GDPR (DEFeND) EU project is to deliver such a platform. The purpose of this paper is to describe the process, within the DEFeND EU project, for eliciting and analyzing requirements for such a complex platform.The platform needs to satisfy legal and privacy requirements and provide …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:RGFaLdJalmkC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Fingerprint verification based on image processing segmentation using an onion algorithm of computational geometry",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702593_0058",
            "Abstract": "In this study, we applied a digital image processing system using the onion algorithm of Computational geometry to develop fingerprint verification. This method may be characterized as an alternative method to the used minutiae extraction algorithm proposed by Ratha et al. The proposed algorithm is also compared to a well-known commercial verification algorithm that is based on Ratha's algorithm. In the experimental part the results of the above comparison showed that the proposed method yields correct positive and correct negative verification scores greater than 99%.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:YsMSGLbcyi4C",
            "Publisher": "World Scientific publications"
        },
        {
            "Title": "A Digital Twin-Based Cyber Range for SOC Analysts",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-81242-3_17",
            "Abstract": "Security Operations Centers (SOCs) provide a holistic view of a company’s security operations. While aiming to harness this potential, companies are lacking sufficiently skilled cybersecurity analysts. One approach to meet this demand is to create a cyber range to equip potential analysts with the skills required. The digital twin paradigm offers great benefit by providing a realistic virtual environment to create a cyber range. However, to the best of our knowledge, tapping this potential to train SOC analysts has not been attempted yet. To address this research gap, a concept of a digital twin-based cyber range for SOC analysts is proposed and implemented. As part of the virtual training environment, several attacks against an industrial system are simulated. Being provided with a SIEM system that displays the real-time log data, the trainees solve increasingly complex tasks in which they have to detect the …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluating low interaction honeypots and on their use against advanced persistent threats",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2645791.2645850",
            "Abstract": "In this paper we evaluate several Low Interaction Honeypots (LIHs) according to several usability and performance criteria. Furthermore we argue on the utilization of LIHs that could indicate early signs of jeopardy from Advanced Persistent Threats (APT).",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Receipt-freeness in large-scale elections without untappable channels",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-306-47009-8_50",
            "Abstract": "For an electronic election to be fully democratic there is a need for security mechanisms that will assure the privacy of the voters. With receipt-free electronic voting, a voter neither obtains nor is able to construct a receipt proving the content of her vote. In this paper we first consider the minimal requirements for receipt-free elections, without untappable communication channels between the voter and the voting authorities. We then propose a solution, which satisfies these requirements. This solution is based on an encryption blackbox, which uses its own randomness. Finally we present an implementation with smartcards, suitable for Internet voting.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Kluwer Academic Publishers (Springer)"
        },
        {
            "Title": "Towards secure online elections: models, primitives and open issues",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/EG.2007.014161",
            "Abstract": "Electronic voting may be a feasible option for several election environments, from closed-group elections to nationwide elections. Especially with online voting, people will be able to cast their votes through a web browser, from their home or any other location where they can get internet access. This paper reviews the generic cryptographic models that have been proposed in the academic literature for secure electronic voting and provides a comprehensive assessment, in terms of security and functionality, of recent cryptographic schemes that extend the generic models to support online elections. The paper also highlights several critical security and implementation issues that need to be addressed before online voting is adopted for critical elections.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Lightweight private proximity testing for geospatial social networks",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366415002558",
            "Abstract": "The wide adoption of smart phones has enabled Online Social Networks (OSNs) to exploit the location awareness capabilities offering users better interaction and context aware content. While these features are very attractive, the publication of users’ location in an OSN exposes them to privacy hazards. Recently, various protocols have been proposed for private proximity testing, where users are able to check if their online friends are near, without disclosing their locations. However, the computation cost of the required cryptographic operations utilized in such protocols is not always efficient for mobile devices. In this paper we introduce a lightweight and secure proximity testing protocol, suitable for online mobile users. We show that our protocol is provably secure under the well-known factoring problem and we analyze its efficiency. Our results show that our approach outperforms other existing protocols, by …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Accuracy in privacy-preserving data mining using the paradigm of cryptographic elections",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87471-3_24",
            "Abstract": "Data mining technology raises concerns about the handling and use of sensitive information, especially in highly distributed environments where the participants in the system may by mutually mistrustful. In this paper we argue in favor of using some well-known cryptographic primitives, borrowed from the literature on large-scale Internet elections, in order to preserve accuracy in privacy-preserving data mining (PPDM) systems. Our approach is based on the classical homomorphic model for online elections, and more particularly on some extensions of the model for supporting multi-candidate elections. We also describe some weaknesses and present an attack on a recent scheme [1] which was the first to use a variation of the homomorphic model in the PPDM setting. In addition, we show how PPDM can be used as a building block to obtain a Random Forests classification algorithm over a set of …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer Berlin/Heidelberg LNCS 5262"
        },
        {
            "Title": "Design and Implementation of an Anonymous and Secure Online Evaluation Protocol",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/814524",
            "Abstract": "Course evaluations have become a common practice in most academic environments. To enhance participation, evaluations should be private and ensure a fair result. Related privacy-preserving method and technologies (eg, anonymous credentials, Privacy Attribute-Based Credentials, and domain signatures) fail to address, at least in an obvious way, the minimal security and practicality requirements. In this paper, we propose, evaluate, and implement an efficient, anonymous evaluation protocol for academic environments. The protocol borrows ideas from well-known and efficient cryptographic approaches for anonymously submitting ballots in Internet elections for issuing one-time credentials and for anonymously broadcasting information. The proposed protocol extends the above approaches in order to provably satisfy properties such as the eligibility, privacy, fairness and verifiability of the evaluation system. Compared to the state of the art, our approach is less complex and more effective, while security properties of the proposed protocol are verified using the ProVerif cryptographic protocol verifier. A web-based implementation of the protocol has been developed and compared to other approaches and systems. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Towards secure and practical e-elections in the new era",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-0239-5_5",
            "Abstract": "We overview the main e-voting schemes currently proposed in the literature and assess their security and practicality. We also analyze the security risks and discuss methods to minimize them.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Kluwer Academic Publishers (Springer)"
        },
        {
            "Title": "National Critical Infrastructure Protection: An Identification and Assessment Methodology",
            "Publication year": 2016,
            "Publication url": "https://www.infosec.aueb.gr/Publications/OLIKY-2016%20Magkos.pdf",
            "Abstract": "National Critical Infrastructure Protection: An Identification and Assessment Methodology \nPage 1 National Critical Infrastructure Protection: An Identification and Assessment \nMethodology E. Magkos June 2016 Page 2 Προστασία Εθνικών Κρίσιμων Υποδομών: \nΜεθοδολογία Προσδιορισμού και Αξιολόγησης Επίκουρος Καθηγητής Εμμανουήλ Β. \nΜάγκος Τμήμα Πληροφορικής | Ιόνιο Πανεπιστήμιο Εργαστήριο Δικτύων, Πολυμέσων και \nΑσφάλειας Συστημάτων (NMSLab) (Εξωτερικός Συνεργάτης INFOSEC Laboratory, ΟΠΑ) \nemagos@ionio.gr Page 3 Περιεχόμενα Εισαγωγή Μεθοδολογία προσδιορισμού & \nαξιολόγησης ΚΥ ➢ Συστηματική προσέγγιση 5 βημάτων ➢ Τομέας → Υποτομέας → \nΥπηρεσία → Υποσύστημα Περιγραφή και Επιλογή Κριτηρίων αξιολόγησης ➢ Οριζόντια \nκριτήρια ➢ Κλίμακες Αξιολόγησης ανά κριτήριο Ενδεικτική Εφαρμογή Κριτηρίων στις πιθανές \nΚΥ ➢ Τομείς Ενέργειας, Μεταφορών, ΤΠΕ ➢ Συνυπολογισμός …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure Log Management for Privacy Assurance in Electronic Communications",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404808000400",
            "Abstract": "In this paper we examine logging security in the environment of electronic communication providers. We review existing security threat models for system logging and we extend these to a new security model especially suited for communication network providers, which also considers internal modification attacks. We also propose a framework for secure log management in public communication networks as well as an implementation design, in order to provide traceability under the extended security model. A key role to the proposed framework is given to an independent Regulatory Authority, which is responsible to maintain log integrity proofs in a remote environment and verify the integrity of the provider's log files during security audits.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:UebtZRa9Y70C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Accurate and large-scale privacy-preserving data mining using the election paradigm",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X09000950",
            "Abstract": "With the proliferation of the Web and ICT technologies there have been concerns about the handling and use of sensitive information by data mining systems. Recent research has focused on distributed environments where the participants in the system may also be mutually mistrustful. In this paper we discuss the design and security requirements for large-scale privacy-preserving data mining (PPDM) systems in a fully distributed setting, where each client possesses its own records of private data. To this end we argue in favor of using some well-known cryptographic primitives, borrowed from the literature on Internet elections. More specifically, our framework is based on the classical homomorphic election model, and particularly on an extension for supporting multi-candidate elections. We also review a recent scheme [Z. Yang, S. Zhong, R.N. Wright, Privacy-preserving classification of customer data without loss …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:9yKSN-GCB0IC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "An asymmetric key establishment protocol for multiphase self-organized sensor networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5758224/",
            "Abstract": "We propose an asymmetric key establishment protocol for decentralized sensor networks (DSN's). The protocol supports multiphase deployment i.e., the sensor nodes are deployed in the network in multiple groups, known as \"generations\". After their deployment, the nodes of the first generation are engaged in a key establishment protocol, in order to establish secure communication channels with their neighbors. Then, each forthcoming generation initializes a new key establishment phase, which allows the new nodes to communicate with other nodes of their own generation as well as with the older nodes of the network. The protocol extends the hybrid scheme of Kotzanikolaou et al. By making the scheme of \"P. Kotzanikolaou et al, Hybrid key establishment for multiphase self-organized sensor networks\" fully asymmetric, the proposed protocol corrects a security weakness found in \"P. Kotzanikolaou et al, Hybrid …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cryptographic approaches for privacy preservation in location-based services: a survey",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/content/66929",
            "Abstract": "Current research in location-based services (LBSs) highlights the importance of cryptographic primitives in privacy preservation for LBSs, and presents solutions that attempt to support the (apparently) mutually exclusive requirements for access control and context privacy (ie, identity and/or location), while at the same time adopting more conservative assumptions in order to reduce or completely remove the need for trust on system entities (eg, the LBS provider, the network operator, or other peer nodes). This paper surveys the current state of knowledge concerning the use of cryptographic primitives for privacy-preservation in LBS applications.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Empirical paraphrasing of modern Greek text in two phases: an application to steganography",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00382-0_43",
            "Abstract": "This paper describes the application of paraphrasing to steganography, using Modern Greek text as the cover medium. Paraphrases are learned in two phases: a set of shallow empirical rules are applied to every input sentence, leading to an initial pool of paraphrases. The pool is then filtered through supervised learning techniques. The syntactic transformations are shallow and require minimal linguistic resources, allowing the methodology to be easily portable to other inflectional languages. A secret key shared between two communicating parties helps them agree on one chosen paraphrase, the presence of which (or not) represents a binary bit of hidden information. The ability to simultaneously apply more than one rules, and each rule more than one times, to an input sentence increases the paraphrase pool size, ensuring thereby steganographic security.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer Berlin/Heidelberg LNCS 5449"
        },
        {
            "Title": "Parental Control and Children’s Internet Safety: The Good, the Bad and the Ugly",
            "Publication year": 2014,
            "Publication url": "https://users.ionio.gr/~emagos/Magkos%20et%20al_%20v_final-ICIL-2014.pdf",
            "Abstract": "In this paper we assess the threats and risks that children are exposed to as a by-product of their Internet experience. We assess good and bad strategies and practices for increasing children’s online safety, from a technological, legal and ethical point of view, and explore some of the challenges that law, ethos, technology must overcome towards Internet safety for children. For example we pose the question whether a parent could ever become, intentionally or not, a threat source for a child’s privacy loss. At the technical field, we run an experiment that demonstrates why parental control software has a long road ahead in meeting some minimum goals for filtering effectiveness.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring Scalability and Fast Spreading of Local Preference Worms via Gradient Models",
            "Publication year": 2008,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated and On-Demand Cybersecurity Certification",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9527958/",
            "Abstract": "The digital world nowadays consists of a very high number of devices and software services that are being used and constantly exposed to the Internet. Furthermore, with the evolution of the Internet of Things (IoT), the cybersecurity threat landscape has overall increased. Consequently, various certification frameworks have been developed for maintaining the overall security posture and supporting the required security tests. This paper describes an approach for conducting automated and on-demand cybersecurity certification on systems and software components. Taking the existing cybersecurity frameworks and guidelines into consideration, the developed software/service component aims to provide auditing information and insights from the systems-on-the-test, to certify newly entering components that could increase the security risk. The recommended approach can be used for collecting, extracting, and …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A distributed privacy-preserving scheme for location-based queries",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5534928/",
            "Abstract": "In this paper we deal with security and historical privacy in Location Based Service (LBS) applications where users submit accurate location samples to an LBS provider. Specifically we propose a distributed scheme that establishes access control while protecting the privacy of a user in both sporadic and continuous LBS queries. Our solution employs a hybrid network architecture where LBS users: (a) are able to communicate with an LBS provider through a network (e.g., cellular) operator, and (b) they are also able to create wireless ad-hoc networks with other peers in order to obtain privacy against an adversary that performs traffic analysis. Our threat model considers the network operator, the LBS provider and other peers, as potential privacy adversaries. For historical privacy we adopt the generic approach of using multiple pseudonyms that are changed frequently. In order to establish untraceability against …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Analysis and Evaluation of Open Source Capture the Flag Platforms as Cybersecurity e-Learning Tools",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-59291-2_5",
            "Abstract": " Capture the Flag (CTF) challenges are typically used for hosting competitions related to cybersecurity. Like any other event, CTF competitions vary in terms of context, topics and purpose and integrate various features and characteristics. This article presents the results of a comparative evaluation between 4 popular open source CTF platforms, regarding their use for learning purposes. We conducted this evaluation as part of the user-centered design process by demonstrating the platforms to the potential participants, in order to collect descriptive insights regarding the features of each platform. The results of this evaluation demonstrated that participants approved the high importance of the selected features and their significance for enhancing the learning process. This study may be useful for organizers of learning events to select the right platform, as well as for future researchers to upgrade and to extend any …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Comparison between computational geometry and coherence methods applied to the EEG for medical diagnostic purposes",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.142.3220&rep=rep1&type=pdf",
            "Abstract": "The examination of differences in intra-hemispheric coherence and a novel method based on computational geometric algorithms between the left and right hemispheres of the same EEG. The Coherence and Computational geometry methods are computed from the same EEG segment and especially in the alpha and beta activities. The Results of the application of Coherence and Computational geometry methods showed that beta activity differed dramatically in the occipital intra-hemisphere. In conclusion, Computational Geometry method showed that it can give an accurate solution for EEG medical diagnostic purposes, especially in those patient cases which present severe asymmetric brain damage.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PocketCTF: A Fully Featured Approach for Hosting Portable Attack and Defense Cybersecurity Exercises",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1220904",
            "Abstract": "Capture the flag (CTF) challenges are broadly used for engaging trainees in the technical aspects of cybersecurity, maintaining hands-on lab exercises, and integrating gamification elements. However, deploying the appropriate digital environment for conducting cybersecurity exercises can be challenging and typically requires a lot of effort and system resources by educators. In this paper, we present PocketCTF, an extensible and fully independent CTF platform, open to educators to run realistic virtual labs to host cybersecurity exercises in their classrooms. PocketCTF is based on containerization technologies to minimize the deployment effort and to utilize less system resources. A proof-of-concept implementation demonstrates the feasibility of deploying CTF challenges that allows the trainees to engage not only in offensive security but also in defensive tasks that have to be conducted during cybersecurity incidents. When using PocketCTF, educators can deploy hands-on labs, spending less time on the deployment and without necessarily having the advanced technical background to deploy complex labs and scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:rO6llkc54NcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "T-ABAC: An Attribute-Based Access Control Model for Real-Time Availability in Highly Dynamic Systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6754936/",
            "Abstract": "In highly dynamic systems resources may have to be accessed in real-time, within the strict time limits of underlying physical processes, with availability becoming critical. Current access control models such as RBAC and ABAC do not address real-time availability in a scalable way for such scenarios. In this paper we propose a real-time attribute-based access control model that extends the functionality of ABAC by using real-time attributes that reflect the requirements of critical applications. We describe two applications of our model: (a) a substation automation system, and (b) a medical cyber-physical system.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An asymmetric traceability scheme for copyright protection without trust assumptions",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44700-8_18",
            "Abstract": "Traceability schemes have been proposed as a method to establish copyright protection of broadcast information. With asymmetric traceability, the merchant cannot frame an innocent user, while no user can abuse the system without being detected. We propose an asymmetric solution for traceability, based on the very efficient symmetric scheme of Kurosawa-Desmedt [13]. We do not make any trust assumptions about the broadcasting center or other authorities. Furthermore, we establish anonymity protection for all honest users: the identity of a user is protected, until a “fingerprint” of that user is found on a pirate decoder. We make use of well-known cryptographic techniques, such as oblivious transfer, time-lock puzzles and blind signatures. Finally, we propose a cut-and-choose technique to assure the correctness of the decryption keys.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer-Verlag LNCS 2115"
        },
        {
            "Title": "Strong forward security",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-306-46998-7_8",
            "Abstract": "Forward security has been proposed as a method to minimize the consequences of key exposure. In this paper we analyze this method and consider a vulnerability, which is due to the fact that the exposure may not have been detected. All forward secure cryptosystems proposed so far are vulnerable during the pesriod between key exposure and its detection. We consider the notion of strong forward security in which cryptographically processed data is protected not only for the periods prior to key exposure but also after key exposure, and present two applications with this novel property: a basic public key cryptosystem and an ElGamal-based key escrow scheme.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Kluwer Academic Publishers (Springer)"
        },
        {
            "Title": "A spatial stochastic model for worm propagation: scale effects",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s11416-007-0048-y",
            "Abstract": "Realistic models for worm propagation in the Internet have become one of the major topics in the academic literature concerning network security. In this paper, we propose an evolution equation for worm propagation in a very small number of Internet hosts, hereinafter called a subnet and introduce a generalization of the classical epidemic model by including a second order spatial term which models subnet interactions. The corresponding gradient coefficient is a measure of the characteristic scale of interactions and as a result a novel scale approach for understanding the evolution of worm population in different scales, is considered. Results concerning random scan strategies and local preference scan worms are presented. A comparison of the proposed model with simulation results is also presented. Based on our model, more efficient monitoring strategies could be deployed.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Secure fingerprint verification based on image processing segmentation using computational geometry algorithms",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.218.9047&rep=rep1&type=pdf",
            "Abstract": "In this paper, fingerprint segmentation for secure Internet verification purposes is investigated. The novel application of computational geometry algorithms in the fingerprint segmentation stage showed that the extracted feature (characteristic polygon) may be used as a secure and accurate method for fingerprint-based verification over the Internet. On the other hand the proposed method promisingly allows very small false acceptance and false rejection rates, as it is based on specific segmentation.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Engaging Students in Basic Cybersecurity Concepts Using Digital",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ylXsDwAAQBAJ&oi=fnd&pg=PA55&dq=info:YGL7O_YmyUsJ:scholar.google.com&ots=_fKkUAPtBJ&sig=A3LJ1n_TDG-SFWQP33FHwn4JHEk",
            "Abstract": "Teaching various topics using gamification elements or Game-Based Learning (GBL) methods is a top trend nowadays. Gamification has shown great results towards this direction, however, the usage of GBL methods has not been sufficiently studied for the effectiveness of the learning process. This study examines how instructional design could be applied and how computer games could be a learning environment for acquiring the basic skills and experience in fundamental cybersecurity topics. Towards this direction, this research aspires to discover how specific computer games, designed as simulations, could be converted into virtual learning environments and enhance the learning process, by increasing the levels of motivation and engagement of undergraduate students in the topics of cybersecurity. Computer games are appropriate for creating effective virtual learning environments specific to cybersecurity, providing positive learning outcomes. More specifically, in this study a commercial computer game is evaluated for the effectiveness of using GBL to the learning process. The result of this approach is a learning experience, featuring positive outcomes in terms of engagement and distinct impact in terms of perceived learning. For this study, the ARCS motivation model was used, for evaluating motivation levels and for investigating potential attributes which are related to perceived learning, knowledge and skill acquisition.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Secure and practical key establishment for distributed sensor networks",
            "Publication year": 2009,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.102",
            "Abstract": "Key establishment in sensor networks is a challenging task, due to the physical constraints of sensor devices and their exposure to several threats. Existing protocols based on symmetric cryptography are very efficient but they are weak against several node impersonation and insider attacks. On the other hand, asymmetric protocols are resilient to such attacks but unfortunately, they are not feasible for sensor networks, even in their most efficient versions (e.g. the elliptic curve (EC) Diffie‐Hellman family of key agreement protocols). In this paper, we present two pairwise key establishment protocols for sensor nodes in unattended distributed sensor networks (DSNs). The first protocol is hybrid and it combines asymmetric (elliptic curve (EC)) cryptography with symmetric key techniques. The second protocol is fully asymmetric. Furthermore, through simulations, we measure the efficiency of the proposed protocols in …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Automated CAPTCHA solving: An empirical comparison of selected techniques",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6978951/",
            "Abstract": "CAPTCHAs exploit the gap in the ability between a human and a machine to understand the semantics of specific multimedia content, with vast applications in computer security. In this paper we compare two techniques in automated CAPTCHA solving for text-based CAPTCHA schemes, i.e., Classification based on the Vector Space Model (VSM) versus a popular Optical Character Recognition (OCR) engine. For each technique, we build a CAPTCHA solver and give it specific sets of text-based challenges to break. From our results we draw conclusions whether it is efficient to create a CAPTCHA solver by applying parts of the VSM theory and implementing a Vector Space Image Recognizer (VSIR).",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low user awareness against social malware: An empirical study and design of a security awareness application",
            "Publication year": 2016,
            "Publication url": "https://users.ionio.gr/~emagos/emcis2016.pdf",
            "Abstract": "During the past few years, in harmony with the fast growing rate of user population in Online Social Networks (OSNs), a trend for malware writers has been to take advantage of the social relationships of OSN users, in order to lure them into following malicious URLs that lead to malware infection. One reason for the success of such Social Engineering (SE)-based malware has been the low security awareness of OSN users. Indeed, it can be shown that, on the average, OSN users do not have sufficient knowledge of the malicious link threats they may come up against, and thus are easy victims of SE attacks. In this paper we conduct an empirical investigation which, on the one hand, demonstrates Facebook users' low awareness of malicious link threats, and on the other hand explores the views of OSN users on the desirable properties of a security application that protects them against social malware. Furthermore, we design and describe the architecture of a security application which intends to raise Facebook users' security awareness by informing them about (possibly) malicious posts on their walls before or after they get infected. Our application acts proactively by helping users to not get infected by malicious posts, and reactively by helping the users who got infected to gain an understanding of the threat and become more alerted towards identifying malware links.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multilayer key establishment for large-scale sensor networks",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSN.2008.016197",
            "Abstract": "Research on key establishment for Distributed Sensor Networks (DSNs) focuses on lightweight protocols that are feasible for the sensor nodes, which by default have restricted capabilities. Although the most efficient protocols for key establishment are based on symmetric key encryption, these protocols are unable to provide adequate security against attacks, such as node impersonation and fake generation attacks. For this reason, several hybrid key establishment protocols have been developed, making limited use of public key cryptography and more particularly of Elliptic Curve Cryptography. However, although these protocols seem to be efficient for sensor nodes, they reduce performance, especially in large-scale networks. In this paper, we propose a multilayer key establishment protocol for DSNs, which combines hybrid and symmetric key establishment techniques. The performance analysis shows a …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "A novel stochastic approach for modeling random scanning worms",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5298324/",
            "Abstract": "Scanning worms grow with different local velocities in different areas, because of non-uniformities that are present in real networks. The present work introduces a new stochastic model elaborating the classical epidemiological model for random scanning strategies. More specifically, random effects in worm spreading velocity are modeled by means of a stochastic differential equation where an explicit expression quantifying randomness is proposed. Furthermore, we explore whether deterministic or stochastic models are appropriate in order to describe the worm propagation phenomenon. To this end we introduce the scale of observation as a crucial parameter. Simulation results are presented validating the proposed analytical results.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fair Anonymous Authentication for Location Based Services",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35890-6_1",
            "Abstract": "We propose an efficient anonymous authentication scheme that provides untraceability and unlinkability of mobile devices, while accessing Location-Based Services. Following other recent approaches for mobile anonymity, in our scheme the network operator acts as an anonymous credential issuer for its users. However, our scheme supports credential non-transferability, without requiring embedded hardware security features. In addition it supports fairness characteristics. On one hand, it reduces the trust assumptions for the issuer by supporting non-frameability: the issuer, even in collaboration with the LBS provider, cannot simulate a transaction that opens back to an honest user. On the other hand, it supports anonymity revocation for illegally used credentials. Our scheme uses standard primitives such as zero-knowledge proofs, MACs and challenge/responses. We provide formal security proofs based …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer LNCS"
        },
        {
            "Title": "Corfunet: A mesh network providing wireless services AT metropolitan level",
            "Publication year": 2008,
            "Publication url": "https://users.ionio.gr/~emagos/Corfunet%202008.pdf",
            "Abstract": "This paper discusses the technology and commercialization challenges of a research initiative intended to establish a wireless metropolitan network for the city of Corfu. Key wireless mesh networking issues are discussed and value for the potential service providers and users of the network is specified. The network development builds on advanced features of wireless mesh networks, like multi-channel and multi-radio operation, connectivity to a fixed network infrastructure through multiple links and general purpose applications support, which overcome many of the limitations that are currently imposed by wireless ad-hoc networks. The proposed network is designed to provide apart from broadband Internet access a number of sophisticated services to the citizens, tourists and business visitors of the island. To assure viability and expansion for the CorfuNet initiative, the present study discusses scenarios on two alternative business models, namely the collaborative and the single provider models, differentiated on the basis of the network’s owner.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid key establishment for multiphase self-organized sensor networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1443571/",
            "Abstract": "Recent work on key establishment for sensor networks has shown that it is feasible to employ limited elliptic curve cryptography in sensor networks through hybrid protocols. We propose a hybrid key establishment protocol for uniform self-organized sensor networks. The proposed protocol combines elliptic curve Diffie-Hellmann key establishment with implicit certificates and symmetric-key cryptographic techniques. The protocol can be implemented on uniform networks comprised of restricted functional devices. Furthermore, due to its public-key nature, the protocol is resilient to a wide range of passive and active attacks, such as known-key attacks, as well as attacks against the confidentiality, integrity and authenticity of the communication. The protocol is scalable and efficient for low-capability devices in terms of storage, communication and computational complexity; the cost per node for a key establishment is …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A DATA SCOPE MANAGEMENT SERVICE TO SUPPORT PRIVACY BY DESIGN AND GDPR COMPLIANCEa",
            "Publication year": 2021,
            "Publication url": "https://cris.brighton.ac.uk/ws/files/24184373/136_165.pdf",
            "Abstract": "In order to empower user data protection and user rights, the European General Data Protection Regulation (GDPR) has been enforced. On the positive side, the user is obtaining advantages from GDPR. However, organisations are facing many difficulties in interpreting GDPR, and to properly applying it, and, in the meanwhile, due to their lack of compliance, many organisations are receiving huge fines from authorities. An important challenge is compliance with the Privacy by Design and by default (PbD) principles, which require that data protection is integrated into processing activities and business practices from the design stage. Recently, the European Data Protection Board (EDPB) released an official document with PbD guidelines, and there are various efforts to provide approaches to support these. However, organizations are still facing difficulties in identifying a flow for executing, in a coherent, linear and effective way, these activities, and a complete toolkit for supporting this. In this paper, we propose the design of such flow, and our comprehensive supporting toolkit, as part of the DEFeND EU Project platform. Within DEFeND, we identified candidate tools, fulfilling specific GDPR aspects, and integrated them in a comprehensive toolkit: the DEFeND Data Scope Management service (DSM). The aim of DSM is to support organizations for continuous GDPR compliance through model-based Privacy by Design analysis. Here, we present DSM, its design, flow, and a preliminary case study and evaluation performed with pilots from the healthcare, banking, public administration and energy sectors.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sandboxing the Cyberspace for Cybersecurity Education and Learning",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-66504-3_11",
            "Abstract": "Deploying the appropriate digital environment for conducting cybersecurity exercises can be challenging and typically requires a lot of effort and system resources. Usually, for deploying vulnerable webservices and setting up labs for hands-on cybersecurity exercises to take place, more configuration is required along with technical expertise. Containerization techniques and solutions provide less overhead and can be used instead of virtualization techniques to revise the existing approaches. Furthermore, it is important to sandbox or replicate existing systems or services for the cybersecurity exercises to be realistic. To address such challenges, we conducted a performance evaluation of some of the existing deployment techniques to analyze their benefits and drawbacks. We tested techniques relevant to containerization or MicroVMs that include less overhead instead of the regular virtualization …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Towards Early Warning Against Internet Worms Based on Critical-Sized Networks",
            "Publication year": 2013,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.534",
            "Abstract": "In this paper, we build on a recent worm propagation stochastic model, in which random effects during worm spreading were modeled by means of a stochastic differential equation. On the basis of this model, we introduce the notion of the critical size of a network, which is the least size of a network that needs to be monitored, in order to correctly project the behavior of a worm in substantially larger networks. We provide a method for the theoretical estimation of the critical size of a network in respect to a worm with specific characteristics. Our motivation is the requirement in real systems to balance the needs for accuracy (i.e., monitoring a network of a sufficient size in order to reduce false alarms) and performance (i.e., monitoring a small‐scale network to reduce complexity). In addition, we run simulation experiments in order to experimentally validate our arguments. Finally, based on notion of critical‐sized networks …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:aqlVkmm33-oC",
            "Publisher": "Wiley Interscience"
        },
        {
            "Title": "Enhancing Privacy-Preserving Access Control for Pervasive Computing Environments",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-17502-2_5",
            "Abstract": "The exchange of user-related sensitive data within a Pervasive Computing Environment (PCE) raises security and privacy concerns. On one hand, service providers require user authentication and authorization prior to the provision of a service, while at the same time users require anonymity, i.e., untraceability and unlinkability for their transactions. In this paper we discuss privacy and security requirements for access control in PCEs and show why a recently proposed efficient scheme [1] fails to satisfy these requirements. Furthermore, we discuss a generic approach for achieving a desired level of privacy against malicious insiders, while balancing with competing demands for access control and accountability.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:5nxA0vEk-isC",
            "Publisher": "LNICST, Springer"
        },
        {
            "Title": "Software-Based Receipt-Freeness in On-Line Elections",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/646932.710573",
            "Abstract": "Software-Based Receipt-Freeness in On-Line Elections | Proceedings of the IFIP TC11 \nWG11.4 First Annual Working Conference on Network Security: Advances in Network and \nDistributed Systems Security ACM Digital Library home ACM home Google, Inc. (search) \nAdvanced Search Browse About Sign in Register Advanced Search Journals Magazines \nProceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch \nAdvanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsProceedings \nof the IFIP TC11 WG11.First Annual Working Conference on Network Security: Advances in \nNetwork and Distributed Systems SecuritySoftware-Based Receipt-Freeness in On-Line \nElections ARTICLE Software-Based Receipt-Freeness in On-Line Elections Share on \nAuthors: Nikolaos Alexandris profile image Nikos Alexandris View Profile , Emmanouil profile .…",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure Key Recovery for Archived and Communicated Data in the Corporate Intranet",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Equitably Fair Internet Voting",
            "Publication year": 2002,
            "Publication url": "http://www.ionio.gr/~emagos/JIT%202001_final.pdf",
            "Abstract": "With the advent of Internet Communications Technologies (ICT), the use of cryptographic protocols is a technical response to the loss of all traditional means that were used so far to establish security in democratic elections. We employ simple cryptographic techniques to address the “abstaining voters” problem in electronic elections with central administration. In such elections, voting authorities can cast a bogus vote on behalf of an authorized voter who decides to abstain. Our system is equitably fair: while a voter who registers for the election is allowed to abstain from voting (legal abstention), all registered voters who cast an encrypted vote must acknowledge, at some time later, the fact that they have voted. If not (illegal abstention), a cryptographic time capsule will be broken and their identity will be disclosed. Our system satisfies most requirements of a secure election and could be used in similar frameworks such as electronic polling and/or surveys over the Web.",
            "Abstract entirety": 1,
            "Author pub id": "qy_LFbsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Taiwan Academic Network"
        },
        {
            "Title": "Privacy in Statistical Databases: CENEX-SDC Project International Conference, PSD 2006, Rome, Italy, December 13-15, 2006, Proceedings",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/11930242.pdf",
            "Abstract": "Privacy in statistical databases is a discipline whose purpose is to provide solutions to the conflict between the increasing social, political and economical demand of accurate information, and the legal and ethical obligation to protect the privacy of the individuals and enterprises to which statistical data refer. Beyond law and ethics, there are also practical reasons for statistical agencies and data collectors to invest in this topic: if individual and corporate respondents feel their privacy guaranteed, they are likely to provide more accurate responses. There are at least two traditions in statistical database privacy: one stems from official statistics, where the discipline is also known as statistical disclosure control (SDC), and the other originates from computer science and database technology. Both started in the 1970s, but the 1980s and the early 1990s saw little privacy activity on the computer science side. The Internet …",
            "Abstract entirety": 0,
            "Author pub id": "qy_LFbsAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer"
        }
    ]
}]