[{
    "name": "Ευάγγελος Δερματάς",
    "romanize name": "Evangelos Dermatas",
    "School-Department": "Τμήματος Μηχανικών\nΗλεκτρονικών Υπολογιστών και Πληροφορικής",
    "University": "upatras",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 4803,
    "Scholar name": "Evangelos Dermatas",
    "Scholar id": "ireNT3QAAAAJ",
    "Affiliation": "Associate professor, Department of Computer Engineering & Informatics, University of Patras",
    "Citedby": 2111,
    "Interests": [
        "Pattern Recognition",
        "Speech",
        "Image and Video Processing",
        "Robotics",
        "Biomedical Engineering"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=ireNT3QAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "FINGER VEIN PATTERN EXTRACTION USING STEERABLE FILTERS BASED ON DYADIC WAVELET TRANSFORM",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812814852_0039",
            "Abstract": "In this paper an efficient automatic method for robust segmentation of finger vessel-network and vein pattern extraction from infrared images, acquired by a low-cost monochrome or multichannel camera, is presented. After brightness normalization, the fingerprint lines are eliminated using the 2D dimensional discrete wavelet transformation. A set of twelve directional kernels is constructed, based on a dyadic wavelet transform, and is used to enhance the directional properties of veins. From maximum filters' response, a neighborhood thresholding derives a binary segmented image to produce reliable patterns of finger veins. A post-processing module is used in case where low-quality images are segmented. Preliminary evaluation experiments of the proposed method demonstrate a number of advantages, compared to recently published methods.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finger vein segmentation and centerlines extraction in infrared images",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814322034_0036",
            "Abstract": "In the narrow bandwidth of the near-infrared spectrum, the light is propagated through human tissue with low absorption rates, but strong scattering effects produce extremely low contrast images. In this paper, an algorithm for finger vein segmentation and centerlines extraction in infrared images is presented. Finger veins are detected in pixels with positive divergence of the gradient vector field, while centerlines are extracted in pixels with positive divergence of the normalized gradient vector field estimated at various orientations. The segmentation algorithm has been evaluated on both artificial and real finger infrared images and high segmentation rates are achieved in terms of sensitivity, specificity and accuracy using manual annotation data obtained by human observers.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the development of a wireless motion capture sensor node for upper limb rehabilitation",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8820559/",
            "Abstract": "This article presents the development of a custom designed motion capture system for assisting physicians in upper limb rehabilitation. The scope of the implementation is the reduction in costs and hospitalization time related with existing systems. The system architecture revolves around motion sensing nodes, each utilizing an Inertial Measurement Unit (IMU), mounted on the upper limb of a patient. A physical working prototype is implemented and evaluated using vision-based passive marker detection techniques. Additionally, a generic upper limb kinematic model, derived from robotic kinematic theory is developed. The parameterization of the model allows for modularity, since a variety of sensing modalities can be rapidly integrated. The combination of the theoretical and physical implementation are evaluated in a preliminary motion sensing scenario for the upper limb of a patient, to depict the feasibility of this …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "ESTIMATION OF HUMAN RBC SIZE USING LIGHT SCATTERING IMAGES AT MULTIPLE WAVELENGTHS",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814322034_0017",
            "Abstract": "In this paper, a novel method for the estimation of the human Red Blood Cell (RBC) size using light scattering images at multiple wavelengths is presented. The information retrieval process includes, image normalization, a two-dimensional discrete Wavelet transformation (DWT2), and a Radial Basis Neural Network (RBF-NN) is used to estimate the RBC geometrical properties. The proposed method was evaluated in both regression and identification tasks by processing images of simulated device used to acquire scattering phenomena of moving RBCs. The database includes 1575 images of 50×50 pixles, is created with the boundary element method (BEM) in 9 different wavelengths. The experimental setup consists of nine, equally spaced, light beams from 632.8 to 1032.8 nm moving RBCs in a thin glass. When artificial white Gaussian noise is added to the simulated images at 10 dB SNR, the mean absolute …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-parametric estimation of camera function",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1653119/",
            "Abstract": "In this paper a non-parametric, direct estimation of camera response function is presented and evaluated in real and simulated data, using multiple images of an arbitrary scene acquired in different exposure times. Initially, it is proved that the subtraction of the logarithm of the inverse response function of any pair of pixels is invariant to the integration time and equal to the logarithm of the ratio of the camera responses. Based on this property, the proposed method estimates the response function in a non-iterative manner, solving an appropriately set linear system of equations. The direct solution, evaluated under a representative set of experiments, shows that even in the case of unknown exposure times, the mean absolute error of the camera's estimated response function is lower than 0.020 in all simulation experiments and 0.018, 0.021, and 0.023 for the RGB channels of the Olympus 5050Zoom digital camera",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Neural recognition and genetic features selection for robust detection of e-mail spam",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_54",
            "Abstract": "In this paper a method for feature selection and classification of email spam messages is presented. The selection of features is performed in two steps: The selection is performed by measuring their entropy and a fine-tuning selection is implemented using a genetic algorithm. In the classification process, a Radial Basis Function Network is used to ensure robust classification rate even in case of complex cluster structure. The proposed method shows that, when using a two-level feature selection, a better accuracy is achieved than using one-stage selection. Also, the use of a lemmatizer or a stop-word list gives minimal classification improvement. The proposed method achieves 96-97% average accuracy when using only 20 features out of 15000.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Classification of acoustic emission and drop signals using SVM, MLP and RBF networks",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10025362897/",
            "Abstract": "CiNii 論文 - Classification of acoustic emission and drop signals using SVM, MLP and RBF \nnetworks CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学\n図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて \n本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版\n年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 Classification of acoustic \nemission and drop signals using SVM, MLP and RBF networks KAPPATOS V 被引用文献: 1件 \n著者 KAPPATOS V 収録刊行物 Proceedings of the 5th national NDT conference of the Hellenic \nSociety of Non-Destructive Testing, 2005 Proceedings of the 5th national NDT conference of \nthe Hellenic Society of Non-Destructive Testing, 2005, 2005 被引用文献: 1件中 1-1件を 表示 \n1 Neural localization of acoustic emission sources in ship hulls KAPPATOS Vassilios , of and …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Polygonal approximation of fabrics with curved edges based on Genetic Algorithms for robot handling towards sewing",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/P-Zacharia/publication/256195267_Polygonal_approximation_of_fabrics_with_curved_edges_based_on_Genetic_Algorithms_for_robot_handling_towards_sewing/links/00463521f30c2822a6000000/Polygonal-approximation-of-fabrics-with-curved-edges-based-on-Genetic-Algorithms-for-robot-handling-towards-sewing.pdf",
            "Abstract": "This paper proposes a polygonal approximation of a fabric with curved edges based on Genetic Algorithms. The main task is to handle the fabric in the sewing process with the exclusive use of robots without human intervention. This is achieved using a visual servoied manipulator controller to guide the fabric along the sewing line. The task of the end-effector is to manipulate a randomly located fabric on a table and feed it to the sewing needle along the desired seam. Using Genetic Algorithms, the curve is approximated by a polygon section. The main goal is to find the polygonal approximation of the curve with the minimal number of vertices, such that the approximation error is no more than a specified value and move the fabric so that the seam coincide with the polygonal line. The experimental results demonstrate the efficiency and the robustness of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:tOudhMTPpwUC",
            "Publisher": "CIRP"
        },
        {
            "Title": "GDF v2. 0, an enhanced version of GDF",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010465507003761",
            "Abstract": "An improved version of the function estimation program GDF is presented. The main enhancements of the new version include: multi-output function estimation, capability of defining custom functions in the grammar and selection of the error function. The new version has been evaluated on a series of classification and regression datasets, that are widely used for the evaluation of such methods. It is compared to two known neural networks and outperforms them in 5 (out of 10) datasets. Program summary Title of program: GDF v2. 0 Catalogue identifier: ADXC_v2_0 Program summary URL: http://cpc. cs. qub. ac. uk/summaries/ADXC_v2_0. html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc. cs. qub. ac. uk/licence/licence. html No. of lines in distributed program, including test data, etc.: 98 147 No. of bytes in distributed …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:bnK-pcrLprsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Vibration Monitoring for Position Sensor Fault Diagnosis in Brushless DC Motor Drives",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1075680",
            "Abstract": "A non-invasive technique for condition monitoring of brushless DC motor drives is proposed in this study for Hall-effect position sensor fault diagnosis. Position sensor faults affect rotor position feedback, resulting in faulty transitions, which in turn cause current fluctuations and mechanical oscillations, derating system performance and threatening life expectancy. The main concept of the proposed technique is to detect the faults using vibration signals, acquired by low-cost piezoelectric sensors. With this aim, the frequency spectrum of the piezoelectric sensor output signal is analyzed both under the healthy and faulty operating conditions to highlight the fault signature. Therefore, the second harmonic component of the vibration signal spectrum is evaluated as a reliable signature for the detection of misalignment faults, while the fourth harmonic component is investigated for the position sensor breakdown fault, considering both single and double sensor faults. As the fault signature is localized at these harmonic components, the Goertzel algorithm is promoted as an efficient tool for the harmonic analysis in a narrow frequency band. Simulation results of the system operation, under healthy and faulty conditions, are presented along with the experimental results, verifying the proposed technique performance in detecting the position sensor faults in a non-invasive manner. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Morphological image denoising and random-walks spot detection in microarry images",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814322034_0015",
            "Abstract": "In this paper, a novel method for noise reduction and spot detection in microarray images, based on mathematical morphology and Random-Walks model is presented and evaluated. Initially, an automatic method detects the subarrays and a morphological denoising method is used to reduce artifacts at each individual subarray. In the enhanced images, a novel segmentation algorithm based on Random-Walker algorithm (RWA) derives the spot positions. The proposed method is validated in two different databases of real distorted microarray images, giving quite satisfying results both in noise elimination and spot detection accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Flash crowd detection using decoy hyperlinks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4239036/",
            "Abstract": "In this paper a novel method for detecting denial of service attacks (DoS) on web services are presented and evaluated by using decoy hyperlinks embedded in web pages. The decoys are hyperlinks without semantic information or are invisible to the human user, acting like traps for DoS attacks because a human user would never follow them. An attack on a web server is detected when such hyperlink is followed. This approach has significant advantages over other approaches like graphic Turing tests, it is transparent to the user, it can be used on general-purpose web sites and retains the web site's usability. The proposed method has been evaluated using real web sites and the results show false positive rates that are less than 10 -4 . A genetic algorithm is used for the optimum placement of the decoys using simulated web sites. The aspects of this new method are discussed and some experimental results are …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic Light Detection and Recognition Using Image Processing and Convolution Neural Networks",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-29750-3_14",
            "Abstract": "Automatic traffic light detection and mapping is an open research problem. In this paper, a method for detecting the position and recognizing the state of the traffic lights in video sequences is presented and evaluated using LISA Traffic Light Dataset which contains annotated traffic light video data. The first stage is the detection, which is accomplished through image processing technics such as image cropping, Gaussian low-pass filtering, color transformation, segmentation, morphological dilation, Canny edge detection, and Circle Hough transform to estimate the position and radius of possible traffic lights. The second stage is the recognition, whose purpose is to identify the color of the traffic light and is accomplished through deep learning, using a Convolutional Neural Network. Day and night images were used in both training and evaluation, giving excellent location rates in all conditions.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:5awf1xo2G04C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "EXTRACTION IN INFRARED IMAGES",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=RuwKiX6lXEoC&oi=fnd&pg=PA345&dq=info:-Hy7LKhbES0J:scholar.google.com&ots=1q9HK5o6h1&sig=vTiurjJmwFvCSJFF4qncYEtG2QE",
            "Abstract": "In the narrow bandwidth of the near-infrared spectrum, the light is propagated through human tissue with low absorption rates. but strong scattering effects produce extremely low contrast images. In this paper. an algorithm for ﬁnger vein segmentation and centerlines extraction in infrared images is presented. Finger veins are detected in pixels with positive divergence of the gradient vector ﬁeld, while centerlines are extracted in pixels with positive divergence of the normalized gradient vector field estimated at various orientations. The segmentation algorithm has been evaluated on both artiﬁcial and real ﬁnger infrared images and high segmentation rates are achieved in terms of sensitivity. speciﬁcity and accuracy using manual annotation data obtained by human observers.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:isC4tDSrTZIC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Visual servoing of a robotic manipulator based on fuzzy logic control for handling fabric lying on a table",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vNNYJJa--OoC&oi=fnd&pg=PA411&dq=info:eReuOvTxK00J:scholar.google.com&ots=iglElnrpHx&sig=41-yspgA4OR4uRu62_T-SxBOd-M",
            "Abstract": "This paper introduces a visual servoed manipulator controller based on fuzzy logic to guide a fabric towards a sewing machine. The task of the end-effector is to handle a randomly located fabric on a table and feed it to the sewing needle along the desired seam. The proposed fuzzy controller determines the linear and angular velocity of the end-effector taking into account the current position and orientation of the fabric which derive from the vision system. The fuzzy rules are derived after studying the behavior of human workers during sewing and the membership functions are formed after simulation and extended experimentation. The experimental results demonstrate the efficiency of the system as well as the robustness of the controller performance.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving simultaneous speech recognition in real room environments using overdetermined blind source separation",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/43392956/Improving_simultaneous_speech_recognitio20160305-26621-rjm3fo.pdf",
            "Abstract": "In this paper we present a novel solution to the Overdetermined Blind Speech Separation (OBSS) problem for improving speech recognition accuracy of N simultaneous speakers in real room environments using M,(M> N) microphones. The proposed OBSS system uses basic NxN Blind Speech Separation networks that process in parallel all different combinations of the available mixture signals in the frequency domain, resulting to lower computational complexity and faster convergence. Extensive experiments using an array of two to ten microphones and two simultaneous speakers in a simulated real room, showed that when the number of the microphones increases beyond two, the separation performance is improved and the phoneme recognition accuracy of an HMM based decoder increases drastically (more than 6%). Therefore, the introduction of more microphones than speakers is justified in order to improve speech recognition accuracy in multi simultaneous speaker environments.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Local adaptive contrast enchancement in digital images",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1385289.1385299",
            "Abstract": "In this paper an algorithm for optical quality enhancement in low contrast images is proposed. The brightness dynamic region is increased using a non-linear transformation function, which is adapted from the local contrast. In a new approach, the local contrast is defined in every central pixel, using a four direction masking method and a statistical estimation of the local contrast value. Two adaptive thresholds locate the exact pixel positions where the proposed contrast adjustment algorithm is used to improve the image quality. In the evaluation process, several artificially distorted images are enhanced and the mean square error and peak noise ratio between the restored and the original images are estimated. The experimental results show both objective and subjective improvements in the image quality.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "GDF: A tool for function estimation through grammatical evolution",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010465505005874",
            "Abstract": "This article introduces a tool for data fitting that is based on genetic programming and especially on the grammatical evolution technique. The user needs to input a series of points and the accompanied dimensionality n and the tool will produce via the genetic programming paradigm a function f: R n→ R which is an approximate solution to the symbolic regression problem. The tool is entirely written in ANSI C++ and it can be installed in any UNIX system. Program summary Title of program: GDF Catalogue identifier: ADXC Program obtainable from: CPC Program Library, Queen's University of Belfast, N. Ireland Program summary URL: http://cpc. cs. qub. ac. uk/summaries/ADXC Computer for which the program is designed and others on which is has been tested: The tool is designed to be portable in all systems running the GNU C++ compiler Installation: University of Ioannina and University of Patras, Greece …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:roLk4NBRz8UC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Visual servoing controller for robot handling fabrics of curved edges",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780080451572500560",
            "Abstract": "This chapter proposes a visual servoing manipulator controller to guide fabrics during the sewing process. The task of the end-effector is to handle a randomly located fabric on a table and feed it to the sewing needle along the desired seam. The proposed system is capable of handling fabrics having straight-line edges and curved edges with arbitrary curvatures. The vision system identifies the type of the fabric edges and the system decides the procedure that should be followed, so that the fabric is successfully handled. The experimental results show that the proposed approach is an effective and efficient method for guiding the fabric towards the sewing machine, sewing each one (straight- or curved) edge and rotating it around the needle. The system demonstrates flexibility, since fabric of any shape, size, or color can be sewed without requirements in special geometrical computations. Fuzzy …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Elsevier Science Ltd"
        },
        {
            "Title": "Improving the Diagnosis of Breast Cancer by Combining Visual and Semantic Feature Descriptors",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-80568-5_7",
            "Abstract": "Mammography still remains the foremost effective procedure for early diagnosis of breast cancer. To compensate with the increasing number of readings that radiologists have to undertake, Computer-aided Diagnosis (CAD) systems have become a significant assistance tool, that are used to help identify abnormal and normal regions of interest in mammograms faster and more effectively than human readers. In this paper, we propose a new approach for breast cancer identification of all type of lesions in digital mammograms by combining low-and high-level mammogram descriptors in a compact quaternionic form. Our proposed method has two major stages. Initially, a feature extraction process is proposed to extract low-level visual descriptors of Region of Suspicion (ROS), that utilizes two dimensional discrete transforms based on Angular Radial Transform (ART), Shapelets as well as textural representations …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:UHK10RUVsp4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evolutionary Grammar Induction for Protein Relation Extraction",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/46541867/protein.pdf",
            "Abstract": "A novel method is presented for protein relation extraction from scientific abstracts. The proposed method is based on Meta-Grammars, a novel method for grammar inference that uses genetic programming and a BNF description to discover a tree representation of sentence structure that can be used for information extraction. A series if transformations are applied to the original corpus before the Meta-Grammars genetic algorithm is applied. The proposed method is evaluated against extracting protein relations from scientific abstracts and it is shown that it requires a train corpus which has minimum requirements from field experts and giving precision of 79.165%.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-Time detection, classification and DOA estimation of Unmanned Aerial Vehicle",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1902.11130",
            "Abstract": "The present work deals with a new passive system for real-time detection, classification and direction of arrival estimator of Unmanned Aerial Vehicles (UAVs). The proposed system composed of a very low cost hardware components, comprises two different arrays of three or six-microphones, non-linear amplification and filtering of the analog acoustic signal, avoiding also the saturation effect in case where the UAV is located nearby to the microphones. Advance array processing methods are used to detect and locate the wide-band sources in the near and far-field including array calibration and energy based beamforming techniques. Moreover, oversampling techniques are adopted to increase the acquired signals accuracy and to also decrease the quantization noise. The classifier is based on the nearest neighbor rule of a normalized Power Spectral Density, the acoustic signature of the UAV spectrum in short periods of time. The low-cost, low-power and high efficiency embedded processor STM32F405RG is used for system implementation. Preliminary experimental results have shown the effectiveness of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Acoustic emission source location in dispersive media",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165168407001934",
            "Abstract": "In this paper, the acoustic emission source (AE) is located by a non-iterative method using the time-of-arrival (TOA) of several events, received in an array of sensors arbitrary positioning in the 3D space. If at least two event velocities are different, a common property in dispersive propagation, and the array of sensors is not lying in a plane, a close-form estimation of the source–sensors distances, AE time and material constant is derived. Moreover, a direct estimation of the source position is achieved using the multidimensional scaling approach. In simulation experiments, the proposed method detects accurately the location of AE sources, reducing also the ambiguity introduced by noisy arrival times.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A robotic system based on fuzzy visual servoing for handling flexible sheets lying on a table",
            "Publication year": 2009,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/01439910910980213/full/html",
            "Abstract": "The purpose of this paper is to present a flexible automation system for the manipulation of fabrics lying on a work table and focuses on the design of a robot control system based on visual servoing and fuzzy logic for handling flexible sheets lying on a table. The main contribution of this paper is that the developed system tolerates deformations that may appear during robot handling of fabrics due to buckling without the need for fabric rigidization.The vision system, consisting of two cameras, extracts the features that are necessary for handling the fabric despite possible deformations or occlusion from the robotic arm. An intelligent controller based on visual servoing is implemented enabling the robot to handle a variety of fabrics without the need for a mathematical model or complex mathematical/geometrical computations. To enhance its performance, the conventional …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:LPZeul_q3PIC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Continuous speech recognition in noise using a spectrum-entropy beam-former",
            "Publication year": 2007,
            "Publication url": "https://www.actapress.com/PDFViewer.aspx?paperId=31006",
            "Abstract": "International Journal of Robotics and Automation, Vol. 22, No. 2, 2007 CONTINUOUS \nSPEECH RECOGNITION IN NOISE USING A SPECTRUM-ENTROPY BEAM-FORMER G. \nNokas∗ and E. Dermatas∗ Abstract Detection of the speaker position is a crucial task in \ndistant speech recognition applications. In this paper, we present a novel speech beam-former \nfor noisy environments. Initially, the localization algorithm extracts a set of candidate directions \nof the signal sources using spatial correlation matrices of a microphone array in the frequency \ndomain. Then, the beam-former identiﬁes the speech signal in the direction where the signal’s \nspectrum entropy is minimized. The proposed method is evaluated by a phoneme recognition \nsystem, using the TIMIT speech corpus and noise recordings from air-condition and computer \nfan. Extended experiments, carried out in anechoic environment in the range of −10 to 25 dB, ’…",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Anaheim, Calif.; Calgary, Alta.: Acta Press,[1986]-"
        },
        {
            "Title": "Detection of Web Denial-of-Service Attacks using decoy hyperlinks",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/8087694/10.1.1.127.3245.pdf",
            "Abstract": "Service attacks in Web sites is presented. The detection of Web attacks are distinguished from normal user patterns by inserting decoy hyperlinks into some key pages in the Website. Typical types of decoy hyperlinks are described and experimental results derived from real Web-sites gives the extremely low false positive rate of 0.0421%. A method for selecting an effective and minimal number of decoy hyperlinks and pages is also presented and evaluated in real and simulated data.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Filter selection for multi-spectral image acquisition using the feature vector analysis methods",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780080451572500535",
            "Abstract": "The selection of filters plays a fundamental role for the setup and the performance of a multispectral image acquisition system. The selection of the filters incorporated to the system affects the spectral response which in turn affects substantially the accuracy of the reflectance reconstruction task. When the number of available filters is large, the full search method becomes computationally expensive. This chapter defines the filter selection problem as a dimensionality reduction process by selecting the filters that contains most of the essential information, using the same criteria as the Principal Component Analysis. This method is expanded by processing multiple filter estimations to improve the stability and the quality of the results. The filter selection methods are evaluated under the CIE standard illuminants A and D65 using 160 filters and a spectral reflectance database of 1269 curves.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Elsevier Science Ltd"
        },
        {
            "Title": "Solving the Inverse Kinematics of Robotic Arm Using Autoencoders",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-29743-5_23",
            "Abstract": "In the modern era, robotics is an attractive field for many researchers since robots are involved in many aspects of everyday life due to the conveniences and solutions that they provide in various daily difficulties. For this reason, the inverse kinematics of robotic arms is a challenging problem that seems more appealing to researchers as years pass by. In this paper, a novel approach to solve this problem is assessed, which is based on autoencoders. In our implementation the goal is not only to find one random (of the infinite solutions) of this problem, but to determine the one that minimizes both the position error between the actual and desired position of the end-effector of the robotic arm and the joint movement. For the training of the Neural Network of the autoencoder, four different types of the loss function and their corresponding results are examined. A robotic arm with three Degrees of Freedom is used …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Spectral characterization of digital cameras using genetic algorithms",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B978008045157250105X",
            "Abstract": "In camera characterization, a number of techniques is applied to minimize the impact of different hardware and software implementation in image acquisition systems, and preserve color distortion between devices. This chapter presents and evaluates a new method for spectral response estimation based on genetic algorithms. The optimization criterion minimizes the maximum difference between a mixture of Gaussian functions and the real spectral response. A genetic optimization process estimates the parameters of the Gaussian mixture, implemented in Java using the tournament selection method. The experimental results show significant improvement of the proposed spectral estimation method over the well-known principle component analysis (PCA) method using the first six to ten most significant eigenvectors in the presence of three additive noises: the noise, which is statistically …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Elsevier Science Ltd"
        },
        {
            "Title": "Stochastic classification of scientific abstracts",
            "Publication year": 2005,
            "Publication url": "http://users.cs.uoi.gr/~itsoulos/publications/stochastic.pdf",
            "Abstract": "In this paper a method for feature selection and scientific documents classification is presented. The initial selection of features is performed by measuring their entropy and the final selection is implemented using a genetic algorithm. A neural classifier is used to ensure robust classification rate even in case of complex cluster structure. For the evaluation of the proposed method, 650 abstracts are derived from the PUBMED and were used for features selection and classification into 5 categories. A classification rate of 85% is achieved using only 20 features.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crack detection in noisy environment including raining conditions",
            "Publication year": 2007,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/00022660710732716/full/html",
            "Abstract": "In outside constructions (e.g. aircraft frames, bridges, tanks and ships) real‐life noises reduce significantly the capability of location and characterization of crack events. Among the most important types of noise is the rain, producing a signal similar to crack. This paper seeks to present a robust crack detection system with simultaneous raining conditions and additive white‐Gaussian noise at −20 to 20 dB signal‐to‐noise ratio (SNR).The proposed crack detection system consists of two sequentially, connected modules: the feature extraction module where 15 robust features are derived from the signal and a radial basis function neural network is built up in the pattern classification module to extract the crack events.The evaluation process is carried out in a database consisting of over 4,000 simulated cracks and drops signals. The analysis showed that the …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:lSLTfruPkqcC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "A finger vein pattern extraction algorithm based on filtering in multiple directions",
            "Publication year": 2006,
            "Publication url": "http://139.91.210.27/CBML/PROCEEDINGS/2006_ESBME/5th%20ESBME%202006/5th_ESBME_2006_PDFs/Session_4/Vlachos_full%20paper.pdf",
            "Abstract": "In this paper an algorithm for finger vein pattern extraction in infrared images is proposed. The low contrast images, due to the light scattering effect, are enhanced and the fingerprint lines are removed using 2D discrete wavelet filtering. Kernel filtering produces multiple images by rotating the kernel in six different directions, focus into the expected directions of the vein patterns. The maximum of all images is transformed into a binary image. Further improvement is achieved by a two-level morphological process: a majority filter smoothes the contours and removes some of the misclassified isolated pixels, and a reconstruction procedure removes the remaining misclassified regions. The final image has segmented into two regions, the vein and the tissue.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of human red blood cells size using light scattering images",
            "Publication year": 2009,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm00254",
            "Abstract": "In this paper, a novel method for the estimation of the human Red Blood Cell (RBC) size using light scattering images is presented. The information retrieval process includes, image normalization, a two-dimensional Discrete Cosine Transformation (DCT2) or Wavelet transformation (DWT2), and a Radial Basis Neural Network (RBF-NN) estimates the RBC geometrical properties. The proposed method is evaluated in both regression and identification tasks when three important geometrical properties of the human RBC are estimated using a database of 1575 simulated images generated with the boundary element method. The experimental setup consists of a light beam at 632.8 nm and moving RBCs in a thin glass and additive noise distortion is simulated using white Gaussian noise from 60 to 0 dB SNR. The regression and identification accuracy of actual RBC sizes is estimated using three feature sets, giving a …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IOS press"
        },
        {
            "Title": "Wireless Motion Capture System for Upper Limb Rehabilitation",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2571-5577/4/1/14",
            "Abstract": "This work is devoted to the presentation of a Wireless Sensor System implementation for upper limb rehabilitation to function as a complementary system for a patient’s progress supervision during rehabilitation exercises. A cost effective motion capture sensor node composed by a 9 Degrees-of-Freedom (DoF) Inertial Measurement Unit (IMU) is mounted on the patient’s upper limb segments and sends wirelessly the corresponding measured signals to a base station. The sensor orientation and the upper limb individual segments movement in 3-Dimensional (3D) space are derived by processing the sensors’ raw data. For the latter purpose, a biomechanical model which resembles that of a kinematic model of a robotic arm based on the Denavit-Hartenberg (DH) configuration is used to approximate in real time the upper limb movements. The joint angles of the upper limb model are estimated from the extracted sensor node’s orientation angles. The experimental results of a human performing common rehabilitation exercises using the proposed motion capture sensor node are compared with the ones using an off-the-shelf sensor. This comparison results to very low error rates with the root mean square error (RMSE) being about 0. 02 m.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:hkOj_22Ku90C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Crack Characterization in Ship Hulls Based on Features Selected Using the Binary Particle Swarm Algorithm",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=17941578914327577535&hl=en&oi=scholarr",
            "Abstract": "26500 Patras, Greece e-mail: kappatos@ george. wcl2. ee. upatras. gr, dermatas@ george. wcl2. ee. upatras. gr 2School of Electrical & Computer Engineering Georgia Institute of Technology Atlanta, GA, USA, 30332 e-mail: georgoul@ gmail. c0m",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Broken rotor bar fault diagnosis in induction motors using a Goertzel algorithm",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8506726/",
            "Abstract": "Broken bars are a common fault in induction cage motors and their reliable detection has raised wide research over the last decades. Several diagnostic techniques have been proposed for prompt detection. In this paper the 2 nd  order Goertzel Algorithm, a novel advantageous signal processing technique is proposed for robust diagnosis of the fault. A detailed theoretical explanation of the algorithm and a comparison to traditional signal processing techniques is followed by extensive experimental verification. To this direction motors with different rotor designs have been studied, when supplied by the grid or fed by an inverter.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:tkaPQYYpVKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computer aided classification of mammographic tissue using independent component analysis and support vector machines",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11840930_59",
            "Abstract": "In this paper a robust regions-of-suspicion (ROS) diagnosis system on mammograms, recognizing all types of abnormalities is presented and evaluated. A new type of statistical descriptors, based on Independent Component Analysis (ICA), derive the source regions that generate the observed ROS in mammograms. The reduced set of linear transformation coefficients, estimated from ICA after principal component analysis (PCA), compose the features vector that describes the observed regions in an effective way. The ROS are diagnosed using support-vector-machines (SVMs) with polynomial and radial basis function kernels. Taking into account the small number of training data, the PCA preprocessing step reduces the dimensionality of the features vector and consequently improves the classification accuracy of the SVM classifier. Extensive experiments using the Mammographic Image Analysis Society …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Vision and Image Processing (I)-Computer Aided Classification of Mammographic Tissue Using Independent Component Analysis and Support Vector Machines",
            "Publication year": 2006,
            "Publication url": "https://philpapers.org/rec/KOUVAI",
            "Abstract": "Athanasios Koutras, Ioanna Christoyianni, George Georgoulas & Evangelos Dermatas, Vision \nand Image Processing (I)-Computer Aided Classification of Mammographic Tissue Using \nIndependent Component Analysis and Support Vector Machines - PhilPapers Sign in | Create \nan account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax \nAdvanced Search Syntax Advanced Search Syntax Advanced Search Vision and Image \nProcessing (I)-Computer Aided Classification of Mammographic Tissue Using Independent \nComponent Analysis and Support Vector Machines Athanasios Koutras, Ioanna Christoyianni, \nGeorge Georgoulas & Evangelos Dermatas In O. Stock & M. Schaerf (eds.), Lecture Notes in \nComputer Science. Springer Verlag. pp. 568-577 (2006) Abstract This article has no associated \nabstract. (fix it) Keywords No keywords specified (fix it) Categories Philosophy of in of (this .…",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust pre-processing and noise reduction in microarray images",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=11045719499252691919&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Feature selection for robust detection of distributed denial-of-service attacks using genetic algorithms",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_29",
            "Abstract": "In this paper we present a robust neural network detector for Distributed Denial-of-Service (DDoS) attacks in computers providing Internet services. A genetic algorithm is used to select a small number of efficient features from an extended set of 44 statistical features, which are estimated only from the packet headers. The genetic evaluation produces an error-free neural network DDoS detector using only 14 features. Moreover, the experimental results showed that the features that best qualify for DDoS detection are the SYN and URG flags, the probability of distinct Source Ports in each timeframe, the number of packets that use certain port ranges the TTL and the window size in each timeframe.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:XiVPGOgt02cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An Alternative Approach for Condition Monitoring of Brushless DC Motor Drives",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9271071/",
            "Abstract": "In this study, an alternative approach based on redundant and complementary fault signatures is proposed for reliable condition monitoring of a Brushless DC motor drive in critical applications. Focusing on Hall-effect position sensorbased drives, a data-driven approach for the unbalanced system operation diagnosis is presented. To improve the fault detection accuracy under multiple faults, a multi-source database is synthesized, exploiting voltage and current sensors along with piezoelectric sensors for the vibration analysis. The frequency spectra of the electronic controller input and output power signals and the piezoelectric sensor signals are analyzed for the fault diagnosis. Thus, a multi-sensor control scheme is presented and different configurations of misaligned position sensors, with either positive or negative commutation angle errors, are investigated to verify the effectiveness of the proposed fault …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Neural localization of acoustic emission sources in ship hulls",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00773-009-0051-8.pdf",
            "Abstract": "In this paper a radial-basis-function neural network is used to localize acoustic emission events in ship hulls. It is shown that using a tiny network configuration and a small set of robust features, selected automatically by the K-means algorithm from a superset of 90 signal parameters, the location of a single event can be classified efficiently into three typical areas found in ship hulls. In simulation experiments, where a stiffened plate model is partially sunk into the water, the localization rate of acoustic emission events in a noise-free environment is 100% using four sensors and only four features per sensor. In the proposed method, the feature set is adapted and estimated automatically in cases of noisy environments. Robust acoustic emission localization rates, greater than 90%, are achieved using less than ten features per sensor in case of additive white Gaussian noise at 0 dB SNR or more.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer Japan"
        },
        {
            "Title": "Computer aided diagnosis of breast cancer in digital in digitized mammograms",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=8934250787629453778&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time detection of distributed denial-of-service attacks using RBF networks and statistical features",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128604003445",
            "Abstract": "In this paper we present and evaluate a Radial-basis-function neural network detector for Distributed-Denial-of-Service (DDoS) attacks in public networks based on statistical features estimated in short-time window analysis of the incoming data packets. A small number of statistical descriptors were used to describe the DDoS attacks behaviour, and an accurate classification is achieved using the Radial-basis-function neural networks (RBF-NN). The proposed method is evaluated in a simulated public network and showed detection rate better than 98% of DDoS attacks using only three statistical features estimated from one window of data packets of 6 s length. The same type of experiments were carried out on a real network giving significantly better results: a 100% DDoS detection rate is achieved followed by a 0% of false alarm rate using different statistical descriptors and training conditions for the RBF-NN.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Acoustic emission source location using multi-frequency arrival times",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1653120/",
            "Abstract": "In this paper, a method for a direct estimation of the source-sensor distances and the time of an acoustic emission event is presented using multiple sensors and the arrival-times for a certain number of frequencies. The mean square error (MSE) problem is solved directly for any set of available data. It is also proved that in case of error-free arrival-times, the source position can be derived analytically as a function of the material constant",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Detection, tracking and classification of road signs in adverse conditions",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1653157/",
            "Abstract": "In this paper a complete automatic system for road-sign detection, tracking, and classification is presented and evaluated. The processing of video frames in the L*a*b color space improves significantly the sign detection rate by processing the same frame in different normalized color spaces. The tracking module reduces significantly the processing time by transferring the sign detection information in the next frames and processing different radii signs in parallel. The proposed system is evaluated in normal, raining and night driving conditions. In a total number of 266 road-sign recordings, the complete system track and recognize successfully 216. The main source of system fault appears in city night driving due to the presence of a great number of light sources",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic detection of abnormal tissue in bilateral mammograms using neural networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_28",
            "Abstract": "A novel method for accurate detection of regions of interest (ROIs) that contain circumscribed lesions in X-rays mammograms based on bilateral subtraction is presented. Implementing this method requires left and right breast images alignment using a cross-correlation criterion followed by a windowing analysis in mammogram pairs. Furthermore, a set of qualification criteria is employed to filter these regions, retaining the most suspicious for which a Radial-Basis Function Neural Network makes the final decision marking them as ROIs that contain abnormal tissue. Extensive experiments have shown that the proposed method detects the location of the circumscribed lesions with accuracy of 95.8% in the MIAS database.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Fusing Low-Level Visual Features and High-Level Semantic Features for Breast Cancer Diagnosis in Digital Mammograms",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9288060/",
            "Abstract": "Mammography is still the most effective procedure for early diagnosis of breast cancer. Computer-aided Diagnosis (CAD) systems can be very helpful in this direction and an assistance tool for radiologists to recognize abnormal and normal regions of interest in digital mammograms faster than traditional screening program. In this paper, we propose a new method for breast cancer recognition of all types of lesions in digital mammograms using multimodal features in a quaternionic representation. The proposed method consists of two steps: First, a feature extraction module utilizes two dimensional discrete transforms based on ART, Shapelets and Gabor filters to extract low-level visual descriptors of ROS. In addition, semantic mammogram information provided by radiologists, is encoded into a 16-bit length word used as high-level feature vector. All multimodal features are fused in a compact quaternionic …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Best sensors position for accurate location of acoustic emission sources on cylindrical surfaces",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/E-Dermatas/publication/265533921_Best_sensors_position_for_accurate_location_of_acoustic_emission_sources_on_cylindrical_surfaces/links/556046b808ae86c06b638650/Best-sensors-position-for-accurate-location-of-acoustic-emission-sources-on-cylindrical-surfaces.pdf",
            "Abstract": "In this paper we present a method for detecting the location of an acoustic emission source using the differences in the time of arrival (DTA) of the source signal at several sensors on cylindrical surfaces. Assuming complete absorption of the acoustic waves at the material boundaries, the best sensors position is derived by minimizing the mean source location error in the whole surface, taking into account the presence of white-Gaussian noise in the DTA estimation process. In addition, simulation experiments carried out on a large cylindrical surface show the influence of the sampling frequency to the source location accuracy using three, four and five sensors. The elimination of the mean location error set up the sensors on the boundaries of the cylindrical surface.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Disguised face identification using multi-modal features in a quaternionic form",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8267314/",
            "Abstract": "Disguised face recognition is considered as very challenging and important problem in the face recognition field. A disguised face recognition algorithm is proposed using quaternionic representation. The feature extraction module is accomplished with a new method, decomposing each face image into a linear decomposition of a set of localized basis functions. The feature sets, related to Shapelets and Gabor filters, are used to encode the image data. The coefficients of the integral transformations are fused and presented in quaternionic representation to the Classification module. This study shows that the proposed algorithm can achieve high recognition results under disguised conditions.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:5ugPr518TE4C",
            "Publisher": "IET"
        },
        {
            "Title": "Identification the shape of biconcave Red Blood Cells using Histogram of Oriented Gradients and covariance features",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701700/",
            "Abstract": "In this paper, a novel methodology for estimating the shape of human biconcave Red Blood Cells (RBCs), using color scattering images, is presented. The information retrieval process includes, image normalization, features extraction using both Histogram of Oriented Gradients (HoG) and region covariance features (RCoV); and features dimensionality reduction using the Independent Component Analysis (ICA). The points of interest (PoIs) are detected using the Harriscorner detector in order to extract the image features. A scheme using adjustable algorithms, i.e. support vectors machine (SVM) is adopted in order to fuse the multimodal features. A Radial Basis Function Neural Network (RBF-NN) estimates the RBC geometrical properties. The proposed method is evaluated in both regression and identification tasks by processing images of a simulated device used to acquire scattering phenomena of moving …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:vRqMK49ujn8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Feature selection for robust classification of crack and drop signals",
            "Publication year": 2009,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1475921708094790",
            "Abstract": "This paper presents a study to the problem of features selection for accurate recognition of crack signals in raining conditions, using a multilayer perceptron and a radial basis function neural network. The features extraction process is accomplished for two time frames: in the first time frame the presence of the signal reflection is minimal; in the later a wider window include signal reflections at the specimen edges. An extensive set of 90 features (41 of them are novel), 67 in the time domain and 23 in the frequency domain, are extracted from the normalized signals and are sorted according to Fisher ratio (F-ratio). The signals database consists of over than 20,000 simulated cracks and drops signals. The NNs classification accuracy of a single crack signal in rain conditions using the most robust features ranges from 80.08% to 99.08%, which remains in the same levels when white-Gaussian noise up to 0 dB signal-to …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:r0BpntZqJG4C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Classification of occluded 2D objects using deep learning of 3D shape surfaces",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201061",
            "Abstract": "This paper presents a novel deep learning method for partially occluded 2D object classification. A 2D Convolutional Neural Network (CNN) was trained with partial and whole images of the 3D models obtained from different camera views. The efficiency of the proposed method in classifying partial objects in 40 categories is more than 80% in most objects and exceeds 95% in some of them.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Acoustic-emission source location using the lower-frequencies of flexural waves",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702593_0036",
            "Abstract": "In this paper a novel method for acoustic emission (AE) source location in dispersive media is presented by processing the low-frequency components of the flexural waves arrived in arbitrary positioning transducers. The accurate location of the source is obtained by minimizing the time-domain square error (TDSE) between a model-based AE source signals arrived at any sensor and the real signals. In the multi-variable optimization problem, the huge number of local minima is avoided using modifications in the definition of the TDSE-function and the use of a dedicated simulated annealing method. In the case of thin plates, a three sensors configuration can be used to estimate the AE source position. It has also been showed that the proposed method can be used to determine the AE source position in more complex surfaces even in the presence of additive Gaussian noise in extremely low signal-to-noise ratios.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of The Best Sensors Position For Minimum Error Location of Acoustic Emission Sources On Spherical Surfaces",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Vasileios-Kappatos/publication/267410399_ESTIMATION_OF_THE_BEST_SENSORS_POSITION_FOR_MINIMUM_ERROR_LOCATION_OF_ACOUSTIC_EMISSION_SOURCES_ON_SPHERICAL_SURFACES/links/56f119f608ae519284fbd475/ESTIMATION-OF-THE-BEST-SENSORS-POSITION-FOR-MINIMUM-ERROR-LOCATION-OF-ACOUSTIC-EMISSION-SOURCES-ON-SPHERICAL-SURFACES.pdf",
            "Abstract": "In this paper a novel method for the estimation of the best sensors position for accurate acoustic emission (AE) source location on empty spherical surfaces is presented. The best sensors position is defined in the minimum of the mean source-location error (SLE) using the differences in the time-of-arrival (DTA) of the AE-signal in sensors. Taking into account that the optimization criterion cannot be expressed in close form, a huge number of AE sources, uniformly distributed on the sphere, is tested for three, four and five sensors.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finger vein segmentation from infrared images based on a modified separable mumford shah model and local entropy thresholding",
            "Publication year": 2015,
            "Publication url": "https://www.hindawi.com/journals/cmmm/2015/868493/",
            "Abstract": "A novel method for finger vein pattern extraction from infrared images is presented. This method involves four steps: preprocessing which performs local normalization of the image intensity, image enhancement, image segmentation, and finally postprocessing for image cleaning. In the image enhancement step, an image which will be both smooth and similar to the original is sought. The enhanced image is obtained by minimizing the objective function of a modified separable Mumford Shah Model. Since, this minimization procedure is computationally intensive for large images, a local application of the Mumford Shah Model in small window neighborhoods is proposed. The finger veins are located in concave nonsmooth regions and, so, in order to distinct them from the other tissue parts, all the differences between the smooth neighborhoods, obtained by the local application of the model, and the corresponding windows of the original image are added. After that, veins in the enhanced image have been sufficiently emphasized. Thus, after image enhancement, an accurate segmentation can be obtained readily by a local entropy thresholding method. Finally, the resulted binary image may suffer from some misclassifications and, so, a postprocessing step is performed in order to extract a robust finger vein pattern.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Automatic quality control of seam puckers based on shadow detection",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCAET.2009.022788",
            "Abstract": "A novel method performing automatic seam quality control based on visual information is introduced. More specifically, oblique illumination is applied and greyscale images of seam specimens are acquired. The amount of shadowing present in each image is being estimated through dynamic thresholding and first order statistics and is used by a simple linear classifier to estimate the seam quality by means of ordinary least squares (OLS) regression. The proposed method has been evaluated in the case of 112 seam specimens classified by human experts into five discrete quality grades and a correct classification rate of 84.82% has been produced exceeding the experts' average performance. Moreover, in case one grade disagreement is acceptable, the classification results become error free.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Direct Estimation of Polynomial Densities",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=15677711960716093546&hl=en&oi=scholarr",
            "Abstract": "We present a direct estimation method of the output layer weights in a polynomial extension of the generalized radial-basis-function networks when used in pattern classification problems. The estimation is based on the L2-distance minimization of the density and the population moments. Each synaptic weight in the output layer is derived as a non-linear function of the training data moments. The experimental results, using one-and two-dimensional simulated data and different polynomial orders, show that the classification rate of the polynomial densities is very close to the optimum rate.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:JQOojiI6XY0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Vein segmentation in infrared images using compound enhancing and crisp clustering",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-79547-6_38",
            "Abstract": "In this paper an efficient fully automatic method for finger vein pattern extraction is presented using the second order local structure of infrared images. In a sequence of processes, the veins structure is normalized and enhanced, eliminating also the fingerprint lines using wavelet decomposition methods. A compound filter which handles the second order local structure and exploits the multidirectional matching filter response in the direction of the smallest curvature is used in order to enrich the vein patterns. Edge suppression decreases the misclassified edges as veins in the forthcoming crisp clustering step. In a postprocessing module, a morphological majority filter is applied in the segmented image to smooth the contours and to remove some small isolated regions and a reconstruction process reduces the outliers in the finger vein pattern. The proposed method was evaluated in a small database of …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Combining outlier detection with random walker for automatic brain tumor segmentation",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33412-2_3",
            "Abstract": "The diagnosis of brain neoplasms has been facilitated by the emerging of high-quality imaging techniques, such as Magnetic Resonance Imaging (MRI), while the combination of several sequences from conventional and advanced protocols has increased the diagnostic information. Treatment planning and therapy follow-up require the detection of neoplastic and edematous tissue boundaries, a very time consuming task when manually performed by medical experts based on the 3D MRI data. Automating the detection process is challenging, due to the high diversity in appearance of neoplastic tissue among different patients and, in many cases, similarity between neoplastic and normal tissue. In this paper, we propose an automatic brain tumor segmentation method based on a multilabel multiparametric random walks approach initialized by an outlier detection scheme. Segmentation assessment is …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Evolutionary dimensionality reduction for crack localization in ship structures using a hybrid computational intelligent approach",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5178852/",
            "Abstract": "Acoustic emission (AE) is one of the most important non-destructive testing (NDT) methods for materials and constructions. Using AE testing, the location of a single event (crack) can be classified efficiently into three typical areas in a ship hull. The problem is a typical classification problem based on the use of features extracted from piezo-sensors' signal. As in most classification problems, the extraction and selection of the most appropriate set of features plays a major role in the overall performance of the system. In this research work we investigate the use of an evolutionary algorithm to extract new features from a set of primitive features in a lower dimensional space through a linear transformation. These features are subsequently fed into a probabilistic neural network (PNN) that performs the classification. In simulation experiments, where a stiffened plate model (SPM) is partially sank into water, the localization …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identification of geometrical properties of red blood cells from light scattering images using SVD",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895717712003743",
            "Abstract": "In this paper an automatic identification method of geometrical properties of Red Blood Cells (RBCs) using light scattering images, is presented. A small number of features are estimated by the pixels’ intensity projection into an RBC-space. The basis of the RBC-space is derived using the singular vectors of a set of known RBCs. The nearest neighbor rule is used to classify any image projection to the known RBC coordinates. Since, the dimension ability of the RBC-space is significantly lower than the whole scattering image-space, it is easier to compare projections than original images. Considering the above idea, a Singular Value Decomposition (SVD) approach is implemented in this work. The database includes 1188 simulated scattering images, obtained by means of the Boundary Element Method (BEM). The identification accuracy of the actual RBC shape is estimated using three feature sets in the presence …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:P5F9QuxV20EC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A methodology for estimating the shape of biconcave red blood cells using multicolor scattering images",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1746809412001164",
            "Abstract": "In this paper, a novel methodology for estimating the shape of human biconcave red blood cells (RBCs), using color scattering images, is presented. The information retrieval process includes, image normalization, features extraction using two-dimensional discrete transforms, such as angular radial transform (ART), Zernike moments and Gabor filters bank and features dimension reduction using both independent component analysis (ICA) and principal component analysis (PCA). A radial basis neural network (RBF-NN) estimates the RBC geometrical properties. The proposed method is evaluated in both regression and identification tasks by processing images of a simulated device used to acquire scattering phenomena of moving RBCs. The simulated device consists of a tricolor light source (light emitting diode – LED) and moving RBCs in a thin glass. The evaluation database includes 23,625 scattering images …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Design of Automatic Target Recognition system based on multistatic passive RADAR",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-D-Polyzos/publication/330897099_Design_of_Automatic_Target_Recognition_system_based_on_multistatic_passive_RADAR/links/5d98a8c0a6fdccfd0e7933d6/Design-of-Automatic-Target-Recognition-system-based-on-multistatic-passive-RADAR.pdf#page=128",
            "Abstract": "Nowadays, a great number of researchers are concerned about aerial targets since they are involved in many aspects of everyday life, such as military issues, including aircrafts and missiles, or Unmanned Aerial Vehicles (UAVs) flying over city centers or airport areas. The design of an efficient Automatic Target Recognition (ATR) system has been an attractive problem and for this reason many researchers rely on experiments to extract the necessary data for the ATR system. In this paper, a new method for extracting the radar cross-section (RCS) data has been proposed, which uses the Boundary Element Method (BEM) to efficiently compute the RCS values of different objects at any point of the coordinate system in a short period of time, without need of any experiment. Multiple RCS values in the presence of noise are used for the training and the evaluation of two ATR systems, based on the nearest neighbor classification rule or a multilayer Neural Network.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic detection of abnormal tissue in mammography",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958634/",
            "Abstract": "A novel method for accurate detection of regions of interest (ROIs) that contain circumscribed lesions in mammograms is presented. The mammograms are segmented using a statistical threshold and a number of candidate regions are extracted. Then a set of qualification criteria is employed to filter these regions retaining the most suspicious for which a radial-basis function neural network makes the final decision marking them as ROIs that contain abnormal tissue. The proposed method detects the exact location of the circumscribed lesions with an accuracy of 90.9%, and a very low number of false positive regions per image (2.1 ROIs per image) in the MIAS database.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Speaker tracking for hands-free continuous speech recognition in noise based on a spectrum-entropy beamforming method",
            "Publication year": 2003,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e86-d_4_755",
            "Abstract": "In this paper, we present a novel beam-former capable of tracking a rapidly moving speaker in a very noisy environment. The localization algorithm extracts a set of candidate direction-of-arrival (DOA) for the signal sources using array signal processing methods in the frequency domain. A minimum variance (MV) beam-former identifies the speech signal DOA in the direction where the signal's spectrum entropy is minimized. A fine tuning process detects the MV direction which is closest to the initial estimation using a smaller analysis window. Extended experiments, carried out in the range of 20-0 dB SNR, show significant improvement in the recognition rate of a moving speaker especially in very low SNRs (from 11.11% to 43.79% at 0 dB SNR in anechoic environment and from 9.9% to 30.51% in reverberant environment).",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:YOwf2qJgpHMC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Automating Medical Diagnosis in Renal Scintigrams using RBF Networks",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/7557741/AUTOMATING%20MEDICAL%20DIAGNOSIS%20IN%20RENAL%20SCINTIGRAMS%20USING%20RBF%20NETWORKS.pdf",
            "Abstract": "In thi paper we present a novel method for automatic detection of the Renals ROI, automat c detection of the dynamic Renograms excluding the pelv area, and the pathological Renograms are detected using RBF neural networks. The proposed diagnost c system was evaluated using 485 scin graphic files. The experimen al results g ve classification error less than 4.2%, with 96.9% sensitivity and 95.5% specificity rates. s i is i ti t i",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy segmentation for finger vessel pattern extraction of infrared images",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-014-0413-7",
            "Abstract": "In this paper, an algorithm for robust finger vessel pattern extraction from infrared images is presented based on image processing, edge suppression, fuzzy enhancement, and fuzzy clustering. Initially, the brightness variations of the images are eliminated using histogram normalization and the vessel patterns are enhanced, to facilitate the separation process from other tissue parts through fuzzy clustering. Several vessel measurements and processes are applied, including the second-order local statistical information contained in the Hessian matrix and the matched filter applied in the direction of the largest curvature. Edge suppression reduces sharp brightness changes at finger borders and image contrast is non-linearly increased through fuzzy enhancement. A novel probabilistic fuzzy C-means clustering algorithm is used to derive vessels from the surrounding tissue regions using spatial information in …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Neural networks: a comprehensive foundation Neural networks: a comprehensive foundation, 1994",
            "Publication year": 2009,
            "Publication url": "https://ci.nii.ac.jp/naid/10025362895/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文を\nさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて \n本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ \n出版者 参考文献 出版年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 <no \ntitle> HAYKIN S 被引用文献: 1件 著者 HAYKIN S 収録刊行物 Neural networks : a \ncomprehensive foundation Neural networks : a comprehensive foundation, 1994 IEEE \nPress 被引用文献: 1件中 1-1件を 表示 1 Neural localization of acoustic emission sources in \nship hulls KAPPATOS Vassilios , DERMATAS Evangelos Journal of marine science and \ntechnology 14(2), 248-255, 2009-06-01 参考文献12件 Tweet 各種コード NII論文ID(NAID) \n10025362895 資料種別 図書全体 データ提供元 CJP引用 書き出し RefWorksに書き出し \nEndNoteに書き出し Mendeleyに書き出し Refer/| …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Microarray image denoising using spatial filtering and wavelet transformation",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-92841-6_146",
            "Abstract": "As the aim of using microarray technology is to try to understand fundamental aspects of growth and development as well as to explore the underlying genetic causes of many human diseases, the restoration of the ideal microarray image’s properties in a noisy image, is an urgent priority of the image processing procedure. The scope of this work is to describe and evaluate different methodologies for noise reduction in microarray images. In this paper, two basic approaches to microarray image denoising: spatial filtering methods and transform domain filtering methods are presented. The image denoising, with spatial filtering techniques as well as hard and soft thresholding of wavelet coefficients have been tested in microarray images of gene expression profiles of human sarcoma using the Stanford MicroArray Database.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Removing non uniform illumination effects in infrared images",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814322034_0016",
            "Abstract": "In this paper a novel brightness normalization method is used to eliminate the non-uniform illumination effects in infrared images. The algorithm is based on a fuzzy c-means algorithm (FCM), where the objective function is modified to take into account local information of each pixel related both on multiplicative and additive shading effects. At each iteration, the modified FCM algorithm re-estimates the cluster centroids and the membership weights by processing the adopted shading features. Brightness correction is performed by the inverse of the image formation model after FCM convergence.Experiments were conducted in a database of 10 artificial and 5 real infrared images. The real data consist of images of a human finger acquired by a low-cost CCD camera when the finger is illuminated with an array of five leds in the near-infrared spectrum. The experimental results show that the proposed method …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Traffic Lights Detection in Adverse Conditions using Color, Symmetry and Spatiotemporal Information.",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/Papers/2012/38558/38558.pdf",
            "Abstract": "This paper proposes the use of a monocular video camera for traffic lights detection, in a variety of conditions, including adverse weather and illumination. The system incorporates a color pre-processing module to enhance the discrimination of red and green regions in the image and handle the “blooming effect” that is often observed in such scenes. The fast radial symmetry transform is utilized for the detection of traffic light candidates and finally false positive results are minimized using spatiotemporal persistency verification. The system is qualitatively assessed in various conditions, including driving in the rain, at night and in city roads with dense traffic, as well as their synergy. It is also quantitatively assessed on a publicly available manually annotated database, scoring high detection rates.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fast detection of masses in computer-aided mammography",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/814646/",
            "Abstract": "We present a complete method for fast detection of circumscribed mass in mammograms employing a radial basis function neural network (RBFNN). This method can distinguish between tumorous and healthy tissue among various parenchyma tissue patterns, making a decision whether a mammogram is normal or not, and then detecting the masses' position by performing sub-image windowing analysis. In the latter case, with the implementation of a set of criteria, square regions containing the masses are marked as regions of suspicion (ROS). Fast feature extraction significantly reduces the overall processing time, allowing implementation of the method on low-cost PCs. A detailed description of the proposed method is given. The computational efficiency of the feature extraction module and the neural classifier is derived, followed by an analysis of the effects of various factors such as the size of the window …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Selecting and constructing features using grammatical evolution",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865508000664",
            "Abstract": "A novel method for feature selection and construction is introduced. The method improves the classification accuracy, utilizing the well-established technique of grammatical evolution by creating non-linear mappings of the original features to artificial ones in order to improve the effectiveness of artificial intelligence tools such as multi-layer perceptron (MLP), Radial-basis-function (RBF) neural networks and nearest neighbor (KNN) classifier. The proposed method has been applied on a series of classification and regression problems and an experimental comparison is carried out against the accuracy obtained on the original features as well as on features created by the PCA method.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:8k81kl-MbHgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Automatic classification of seam pucker images based on ordinal quality grades",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-011-0241-y",
            "Abstract": "Seam pucker evaluation is based on the annotation of seam specimens into discrete grades of quality presenting an ordinal arrangement. Therefore, an ordinal logistic regression (OLR) model is highly qualified to fit the features extracted by such specimens into the assigned quality grades. This work focuses on building an automatic system for seam pucker evaluation based on an OLR model and comparing its performance with a similar system that employs an ordinary least squares (OLS) regression model. In this direction, three separate types of features have been extracted by a dataset of 325 seam images. The OLR model outperformed OLS for all feature types showing that its theoretical advantage applies also in practice. The best OLR model produced a correct classification rate of 81.2%, matching up to the performance of human experts.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:blknAaTinKkC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Feature extraction in digital mammography: An independent component analysis approach",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45723-2_96",
            "Abstract": "In this paper we present a new feature extraction technique for digital mammograms. Our approach uses Independent Component Analysis to find the source regions that generate the observed regions of suspicion in mammograms. The linear transformation coefficients, which result from the source regions, are used as features that describe the observed regions in an effective way. A Principal Component Analysis preprocessing step is used to reduce dramatically the features vector dimensionality and improve the classification accuracy of a Radial Basis Function neural classifier. Extensive experiments in the MIAS database using a very small dimensioned feature vector gave a recognition accuracy of 88.23% when detecting all kinds of abnormalities which outperforms significantly the accuracy of the commonly used statistical texture descriptors.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Two-stage phone duration modelling with feature construction and feature vector extension for the needs of speech synthesis",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0885230812000137",
            "Abstract": "We propose a two-stage phone duration modelling scheme, which can be applied for the improvement of prosody modelling in speech synthesis systems. This scheme builds on a number of independent feature constructors (FCs) employed in the first stage, and a phone duration model (PDM) which operates on an extended feature vector in the second stage. The feature vector, which acts as input to the first stage, consists of numerical and non-numerical linguistic features extracted from text. The extended feature vector is obtained by appending the phone duration predictions estimated by the FCs to the initial feature vector. Experiments on the American-English KED TIMIT and on the Modern Greek WCL-1 databases validated the advantage of the proposed two-stage scheme, improving prediction accuracy over the best individual predictor, and over a two-stage scheme which just fuses the first-stage outputs …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Automatic extraction of information from molecular biology scientific abstracts",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.104.7239",
            "Abstract": "In bioinformatics there is a strong demand for automatic knowledge acquisition from journal papers. This paper presents a novel molecular-biology name detection system for gene, protein and cell-type. The system consists of sequentially connected modules, a tokenizer: the text is split into tokens, a preprocessor: a set of token transformation rules is applied in a specific order, and a gene/protein/cell type dictionary-based recognizer: a dictionary of 217125 genes/proteins names is used to identify and classify each token taking into account the presence of prefixes and suffixes and synonyms. The proposed method has been evaluated in 300 manually annotated MEDLINE abstracts related to the K-Ras gene, giving 0.968 precision, and 0.975 recall rates. The standard measure for named entity recognition F-score was 0.9515.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Traffic Lights Detection in adverse conditions using Convolutional Neural Networks",
            "Publication year": 2018,
            "Publication url": "https://knowledgecenter.ubt-uni.net/conference/2018/all-events/75/",
            "Abstract": "In modern cars, many sensors are install onboard such as lidar, radar, cameras, and sonars as parts of driver-assistance systems (DAS). Several challenging image processing and recognition problems are met in DAS; the detection of the traffic lights is among the most difficult tasks. Around the word, manufactures produce different traffic lights in shape, size, and layout. Even worse, traffic lights are install in different positions and typically are operating continously, introducing a variety of adverse environmental conditions ie partial occlusion, detection at night, in low vision conditions, etc. Although traffic lights have been design to be highly visible, the outdoor nature of the detection problem greatly increases the illumination and the image backgound variations. In this paper, a method for detecting the position of the traffic lights in video sequencies is presented and evaluated using a well-known video database. Our implementation include a sequence of digital image processing elements and a convolutional neural network classifier:",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "COMPARISON OF ACOUSTIC EMISSION SOURCE LOCATION METHODS",
            "Publication year": 2004,
            "Publication url": "https://www.libertos.net/papers/Comparison%20of%20Acoustic%20Emission%20Source%20Location%20Methods.pdf",
            "Abstract": "1FORTH-ICE/HT Institute of Chemical Engineering & High Temperature Chemical Processes, 26500 Patras, Hellas, libertos@ ee. upatras. gr 2Department of Electrical & Computer Engineering, University of Patras, 26500 Patras, Hellas,{kappatos, dermatas}@ george. wcl2. ee. upatras. gr",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer aided classification of mammographic tissue using shapelets and support vector machines",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07064-3_44",
            "Abstract": "In this paper a robust regions-of-suspicion (ROS) diagnosis system on mammograms, recognizing all types of abnormalities is presented and evaluated. A new type of descriptors, based on Shapelet decomposition, derive the source images that generate the observed ROS in mammograms. The Shapelet decomposition coefficients can be used efficiently to detect ROS areas using Support-Vector-Machines (SVMs) with radial basis function kernels. Extensive experiments using the Mammographic Image Analysis Society (MIAS) database have shown high recognition accuracy above 86% for all kinds of breast abnormalities that exceeds the performance of similar decomposition methods based on Zernike moments presented in the literature by more than 8%.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:ye4kPcJQO24C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Multi-scale retinal vessel segmentation using line tracking",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895611109001177",
            "Abstract": "In this paper an algorithm for vessel segmentation and network extraction in retinal images is proposed. A new multi-scale line-tracking procedure is starting from a small group of pixels, derived from a brightness selection rule, and terminates when a cross-sectional profile condition becomes invalid. The multi-scale image map is derived after combining the individual image maps along scales, containing the pixels confidence to belong in a vessel. The initial vessel network is derived after map quantization of the multi-scale confidence matrix. Median filtering is applied in the initial vessel network, restoring disconnected vessel lines and eliminating noisy lines. Finally, post-processing removes erroneous areas using directional attributes of vessels and morphological reconstruction.The experimental evaluation in the publicly available DRIVE database shows accurate extraction of vessels network. The average …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:ufrVoPGSRksC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Acoustic emission Acoustic emission, 1980",
            "Publication year": 2009,
            "Publication url": "https://ci.nii.ac.jp/naid/10025362887/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 \n出版年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 <no title> WILLIAMS R \n被引用文献: 1件 著者 WILLIAMS R 収録刊行物 Acoustic emission Acoustic emission, 1980 A. \nHilger 被引用文献: 1件中 1-1件を 表示 1 Neural localization of acoustic emission sources in \nship hulls KAPPATOS Vassilios , DERMATAS Evangelos Journal of marine science and \ntechnology 14(2), 248-255, 2009-06-01 参考文献12件 Tweet 各種コード NII論文ID(NAID) \n10025362887 資料種別 図書全体 データ提供元 CJP引用 書き出し RefWorksに書き出し EndNoteに\n書き出し Mendeleyに書き出し Refer/BiblXで表示 RISで表示 BibTeXで表示 TSVで表示 問題の(…",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Illumination invariant seam line detection in real garments",
            "Publication year": 2009,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/09556220910983786/full/html",
            "Abstract": "The purpose of this paper is to provide a robust method for automatic detection of seam lines based only on digital images of the garments.A local standard deviation pre‐processing filter is applied to enhance the contrast between the seam line and the texture and the Prewitt operator extracts the edges of the enhanced image. The seam line is detected by a maximum at the Radon transform. The proposed method is invariant to the illumination intensity and it has been also tested with moving average and fast Fourier transform low‐pass filters used in the pre‐processing module. Extensive experiments are carried out in the presence of additive Gaussian and uniform noise.The proposed method detects 109 out of 118 seams when the local standard deviation is used at the pre‐processing stage, giving a mean distance error between the real and the estimated …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:qUcmZB5y_30C",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Department of Electrical Engineering & Computer Technology",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=TqnFCgAAQBAJ&oi=fnd&pg=PA345&dq=info:K-oZtQZBRrMJ:scholar.google.com&ots=eKVSWTSl5j&sig=WgiUMkTdKfWgfG9rk0kS9p-o6Y4",
            "Abstract": "The problem of finger vein extraction arises mainly for biometrics purposes but it is also very important in the biomedical research community, ie for diagnosing in vascular pathology. The inspection of angiogenesis in the human body can be used for early diagnosis of several diseases, both in healthy tissue for healing wounds and for restoring blood flow to tissues after injury or insult. Also, inspection of the retinal vasculature may reveal hypertension, diabetes, arteriosclerosis, cardiovascular disease and stroke. In the problem of finger vessel pattern extraction from infrared images, the veins appear darker than the surrounding tissue, due to strong absorption of light from the hemoglobin molecules, and they have a concave shape cross sectional profile. This property can be used to facilitate the segmentation process and several researchers use the concave shape of the vessel to achieve better segmentation accuracy [6-7, 8, 12]. Primitive segmentation methods, based on simple global thresholding",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:Mojj43d5GZwC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Random-walker monocular road detection in adverse conditions using automated spatiotemporal seed selection",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6338335/",
            "Abstract": "A key module of modern advanced driver-assistance systems (ADASs) is the road detector, which has to be robust, even under adverse conditions. The ultimate goal of such a system, which uses only visual information acquired from a color video camera, is to classify each frame pixel as belonging to the road or not. In this direction, this paper proposes a new fully automatic algorithm that combines both time and spatial information using the efficient random-walker algorithm (RWA) as a segmentation tool. A novel technique for automatic seed selection is proposed, utilizing features derived from a shadow-resistant optical flow estimator using the  c 1  channel of the  c 1 c 2 c 3  color space, along with a priori information and previous frame segmentation results. The proposed system is qualitatively assessed using video sequences in both typical and adverse conditions, including heavy traffic, shadows, tunnels, rain …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind speech separation of moving speakers in real reverberant environments",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/859164/",
            "Abstract": "In this paper we present a new on-line blind signal separation method capable to separate convolutive speech signals of moving speakers in highly reverberant rooms. The separation network used is a recurrent network which performs separation of convolutive speech mixtures in the time domain, without any prior knowledge of the propagation media, based on the maximum likelihood estimation (MLE) principle. The proposed method proved to be able to improve significantly (more than 10% in all adverse mixing situations) the performance of a continuous phoneme-based speech recognition system and therefore can be used as a front-end to separate simultaneous speech of speakers who are moving in arbitrary directions in reverberant rooms.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robot-handling fabrics with curved edges based on visual servoing and polygonal approximation",
            "Publication year": 2008,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1243/09544054JEM999",
            "Abstract": "The main scope of this work is the development of a robot controller for the manipulation of fabrics lying on a work table towards the sewing process. A fuzzy visual servoing manipulator controller is developed to guide the fabric along the sewing line. The paper focuses on handling fabrics with curved edges by locally approximating the curve section with straight-line segments. An innovative algorithm based on the dominant point detection method and the genetic-based method is incorporated in the robot visual servoing system to achieve sewing of the curved edges. Simulation and experimental tests are conducted to evaluate the performance of the proposed algorithm. The results demonstrate that this approach is efficient and effective for the polygonal approximation, and the proposed robotic system is proved to be robust and efficient, achieving acceptable seam accuracy in the minimum time.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:HDshCWvjkbEC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Blind speech separation of moving speakers using hybrid neural networks",
            "Publication year": 2001,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/eurospeech_2001/e01_0997.pdf",
            "Abstract": "In this paper we present a novel method for Blind Speech Separation of convolutive speech signals of moving speakers in highly reverberant rooms. The separation network used is a hybrid neural network, which performs separation of convolutive speech mixtures in the time domain, without any prior knowledge of the propagation media, based on the Maximum Likelihood Estimation (MLE) principle. The proposed method improves significantly (more than 13% in all adverse mixing situations) the performance of a phonemebased continuous speech recognition system and therefore can be used as a front-end to separate simultaneous speech of speakers who are moving in reverberant rooms.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Team FLY",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.375.9185&rep=rep1&type=pdf#page=284",
            "Abstract": "A novel method for accurate detection of regions of interest (ROIs) that contain circumscribed lesions in X-rays mammograms based on bilateral subtraction is presented. Implementing this method requires left and right breast images alignment using a cross-correlation criterion followed by a windowing analysis in mammogram pairs. Furthermore, a set of qualification criteria is employed to filter these regions, retaining the most suspicious for which a Radial-Basis Function Neural Network makes the final decision marking them as ROIs that contain abnormal tissue. Extensive experiments have shown that the proposed method detects the location of the circumscribed lesions with accuracy of 95.8% in the MIAS database.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new method for breast cancer identification using multi-modal features in quaternionic form",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8081168/",
            "Abstract": "Mammography is still the most effective procedure for early diagnosis of the breast cancer. Computer-aided Diagnosis (CAD) systems can be very helpful in this direction for radiologists to recognize abnormal and normal regions of interest in digital mammograms faster than traditional screening program. In this work, we propose a new method for breast cancer identification of all types of lesions in digital mammograms using multimodal features in a quaternionic representation. The proposed method consists of two steps: First, a novel feature extraction module utilizes two dimensional discrete transforms based on ART, Shapelets, Zernike moments and Gabor filters to decompose Regions of Suspicion (ROS) into a set of localized basis functions with different shapes. The extracted features are then fused and presented in quaternionic representation to the classification module in the second step. For the …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:HE397vMXCloC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A segmentation method using multiscale and multidirectional matched filters based on dyadic wavelet transform for finger vein pattern extraction",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/48229623/EER008_1_1_1_9.pdf",
            "Abstract": "In this paper an efficient automatic method for robust segmentation of finger vessel-network and vein pattern extraction from infrared images acquired by a low-cost monochrome or multichannel camera, is proposed. After brightness normalization, the fingerprint lines are eliminated using the 2D dimensional discrete wavelet transformation. A set of twelve directional kernels is constructed, based on a dyadic wavelet transform, for each scale and is used to enhance the directional properties of veins. From maximum filters’ response along scale and direction, a neighborhood thresholding derives a binary segmented image to produce reliable patterns of finger veins. A post-processing module is used in case where low-quality images are to be segmented. Preliminary evaluation experiments of the proposed method demonstrate a number of advantages, compared to recently published methods.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:eflP2zaiRacC",
            "Publisher": "Science and Engineering Publishing Company"
        },
        {
            "Title": "Blind retrospective shading correction using a multi-objective minimization criterion",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895611112000742",
            "Abstract": "In this paper, a fully automatic blind retrospective shading correction method based mainly on a minimization of a multi-objective criterion is presented. The proposed method assumes that the acquired image has distorted from a multiplicative and an additive shading component and thus can be adequately described by the linear image formation model. The estimation of the shading-free image is based on parametric estimation of the multiplicative and the additive shading component and the consequent application of the inverse image formation model. First of all, an initial estimation of the shading-free image is performed by the minimization of the multi-objective function of an appropriate image criterion. Secondly, the multiplicative and the additive shading components are estimated, based on assumptions about their frequency content and then, they median filtered. Finally, an estimation of a shading-free image …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Acoustic-emission source location in typical structures using genetic algorithms",
            "Publication year": 2003,
            "Publication url": "https://libertos.net/content/site/Acoustic-emission%20source%20location%20in%20typical%20structures%20using%20genetic%20algorithms.pdf",
            "Abstract": "In this paper a novel method for Acoustic Emission (AE) source location based on Genetic algorithms (GA) is presented and evaluated in plate and cylindrical surfaces, assuming lack of knowledge for the material properties using two and three ultrasonic sensors. The experimental results are shown that the proposed method is robust even in case the structure permits multi-path wave propagation from source to sensors (eg cylindrical, spherical tanks) or the AE waves are propagated in the presence of additive white-Gaussian noise. The distance between the AE source and receiver, the material properties, and the time where the AE take place can be estimated using a signal model for AE phenomena and a Genetic Algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fatigue database development and analysis Fatigue database development and analysis, 1992",
            "Publication year": 2009,
            "Publication url": "https://ci.nii.ac.jp/naid/10025362888/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 \n出版年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 <no title> STRATHAUS \nR 被引用文献: 1件 著者 STRATHAUS R 収録刊行物 Fatigue database development and \nanalysis Fatigue database development and analysis, 1992 Department of Naval Architecture \nand Offshore Engineering, University of California at Berkeley 被引用文献: 1件中 1-1件を 表示 \n1 Neural localization of acoustic emission sources in ship hulls KAPPATOS Vassilios , \nDERMATAS Evangelos Journal of marine science and technology 14(2), 248-255, 2009-06-01 \n参考文献12件 Tweet 各種コード NII論文ID(NAID) 10025362888 資料種別 図書全体 データに…",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-uniform illumination correction in infrared images based on a modified fuzzy c-means algorithm",
            "Publication year": 2013,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.983.7757&rep=rep1&type=pdf",
            "Abstract": "The correction of non-uniform illumination and the elimination of shading artifacts is an important preprocessing task used in a great number of image processing applications such as segmentation, registration or quantitative analysis. Although, a careful and accurate set up of the image acquisition system may degrade the importance of a brightness normalization algorithm, non-uniform illumination appears due to the interaction of objects and light on the scene requires retrospective shading correction. The image formation process and the corresponding shading effects are described by a linear image formation model, which consists of a multiplicative and an additive shading component.In this paper a novel brightness normalization method is proposed to eliminate the non-uniform illumination effects. The method is based on the application of a fuzzy c-means algorithm (FCM) only on the background part of the acquired image, where the objective function is modified to take into account local information of each pixel in the estimation of the multiplicative and the additive shading components. The modified FCM algorithm is iterative, as the standard FCM, and at each iteration the multiplicative and the additive shading components are re-estimated based on the cluster centers and the membership of each pixel in a specific cluster. Brightness correction is performed by the inverse of the image formation model after FCM convergence.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Sciedu Press"
        },
        {
            "Title": "Automated assessment of textile seam quality based on surface roughness estimation",
            "Publication year": 2010,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00405000902732883",
            "Abstract": "In this paper the issue of automated seam quality control is addressed, focusing especially on seam pucker evaluation. Currently this task is accomplished by human experts considering five grades of quality. The proposed method estimates surface roughness of seam specimens producing robust and efficient novel features highly correlated to quality grades (QGs). At the initial stage, oblique illumination is applied and two-dimensional images of the specimens are acquired. The images are automatically rotated and centered in respect to the seam line and segmented into four regions. Each region produces an intensity curve through averaging, and roughness estimation is performed based on intensity mean deviation. Finally, a QG is assigned to each specimen using a k-nearest neighbor classifier (kNNc). A data set containing 211 seam specimens, created by two different kinds of fabric, has been used for testing …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:TQgYirikUcIC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Wavelet usage for feature extraction for crack localization",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5164766/",
            "Abstract": "In this research work we investigate the analysis of Acoustic Emission (AE) signals using wavelet decomposition to locate a single event (crack), which usually takes place in three typical areas in a ship hull. The problem is a typical classification problem relying on the use of novel features extracted from the AE time series. As in most classification problems the extraction and selection of the most appropriate set of features plays a major role in the overall performance of the method and it is by no means a trivial task. Once a suitable set of features is extracted even ldquosimplerdquo classification models can perform adequately whereas a non-informative set of features even combined with sophisticated classifiers can lead to disappointing results. Here, we exploit the multi-resolution capabilities of wavelet decomposition, so that a set of features is extracted which it is then combined with a simple classifier. The …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "WALKS SPOT DETECTION IN MICROARRY IMAGES",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=TqnFCgAAQBAJ&oi=fnd&pg=PA143&dq=info:FpuZpi-Bg7QJ:scholar.google.com&ots=eKVSWTSl6a&sig=5n7jtT3ExtrWRywrC2O4OgyEAzw",
            "Abstract": "In this paper, a novel method for noise reduction and spot detection in microarray images, based on mathematical morphology and Random-Walks model is presented and evaluated. Initially, an automatic method detects the subarrays and a morphological denoising method is used to reduce artifacts at each individual subarray. In the enhanced images, a novel segmentation algorithm based on Random-Walker algorithm (RWA) derives the spot positions. The proposed method is validated in two different databases of real distorted microarray images, giving quite satisfying results both in noise elimination and spot detection accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:1qzjygNMrQYC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Rear lights vehicle detection for collision avoidance",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6208089/",
            "Abstract": "Vehicle detection based on on-board mounted cameras is an integral component of many driver assistance systems aiming at alerting the driver about impending collisions. In this paper an automated algorithm for detection of preceding vehicles is proposed, based on the detection of rear vehicle lights. Unlike many systems which make use of static threshold boundaries for the red color segmentation of rear lights, our method combines color and radial symmetry cues while the threshold is dynamically adapted. The extracted candidate rear lights are morphologically paired in order to define possible areas where vehicles are present. The verification of vehicle presence is then carried out through axial symmetry check. Experimental results that demonstrate the system's high detection rates and robustness even in adverse illumination and weather conditions are finally presented.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vessel network extraction in retinal images using iterative line tracking",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812814852_0040",
            "Abstract": "In this paper an algorithm for vessel network extraction in retinal images by applying a new iterative line tracking procedure is proposed. The tracking process is repeated for a predefined number of times, improving the vessels detection accuracy. The intermediate image map contains an estimation of each pixel confidence to belong in a vessel. The desired vessel network is derived after map quantization. Although the produced network in most cases is acceptable, a novel postprocessing method removes erroneous areas using directional attributes of vessels and morphological reconstruction. The experimental evaluation of the proposed method in the public available DRIVE database shows robust extraction of vessels network.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finger vein segmentation in infrared images using supervised and unsupervised clustering algorithms",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1134/S1054661813020168",
            "Abstract": "In this paper, two new methods to segment infrared images of finger in order to perform the finger vein pattern extraction task are presented. In the first, the widespread known and used K nearest neighbor (KNN) classifier, which is a very effective supervised method for clustering data sets, is used. In the second, a novel clustering algorithm named nearest neighbor clustering algorithm (NNCA), which is unsupervised and has been recently proposed for retinal vessel segmentation, is used. As feature vectors for the classification process in both cases two features are used: the multidirectional response of a matched filter and the minimum eigenvalue of the Hessian matrix. The response of the multidirectional filter is essential for robust classification because offers a distinction between vein-like and edge-like structures while Hessian based approaches cannot offer this. The two algorithms, as the experimental …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Nauka/Interperiodica"
        },
        {
            "Title": "Blind separation of speakers in noisy reverberant environments: A neural network approach",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/36807874/koutras_60_full.pdf",
            "Abstract": "In this paper we present neural network solutions to the Blind Signal Separation problem of simultaneous speech signals in reverberant noisy rooms. The separation networks that are used, are feedforward and recurrent neural networks, along with a proposed hybrid network. These networks perform separation of convolutive speech mixtures in the time domain, without any prior knowledge of the propagation media, based on the Maximum Likelihood Estimation (MLE) criterion. The proposed separation networks improve more than 30dB the Signal to Interference ratio in a two simultaneous speaker environment, even under the presence of a noise source (more than 15dB improvement in a 0 dB SNR noisy environment). In addition, the recognition accuracy of a continuous phoneme-based speech recognition system was improved more than 20% in all adverse mixing situations with high interference from competing speakers and noise. Therefore, the proposed separation networks can be used as a front-end processor for continuous speech recognition of simultaneous speakers in real reverberant rooms.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:WF5omc3nYNoC",
            "Publisher": "THE IDG COMPANY, CZECHOSLOVAKIA"
        },
        {
            "Title": "Breast tissue classification in mammograms using ICA mixture models",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44668-0_78",
            "Abstract": "In this paper we present a novel method for recognizing all kinds of abnormalities in digital mammograms using Independent Component Analysis mixture models and two sets of statistical features based on texture analysis.Our approach is concentrated on finding the ICA mixture model parameters that describe in an exclusive and effective way the abnormal and the normal tissue, and with the aid of a supervised probabilistic classifier we are able to successfully recognize suspicious regions in mammograms. Extensive experiments using the MIAS database have shown great accuracy of 98.33% in classifying an unknown regions of suspicion as abnormal and 62.71% as healthy tissue.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Neural network based blind source separation of non-linear mixtures",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44668-0_79",
            "Abstract": "In this paper we present a novel neural network topology capable of separating simultaneous signals transferred through a memoryless non-linear path. The employed neural network is a two-layer perceptron that uses parametric non-linearities in the hidden neurons. The non-linearities are formed using a mixture of sigmoidal non-linear functions and present greater adaptation towards separating complex non-linear mixed signals. Simulation results using complex forms of non-linear mixing functions prove the efficacy of the proposed algorithm when compared to similar networks that use standard non-linearities, achieving excellent separation performance and faster convergence behavior.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Structural health monitoring of ship and other offshore structures using acoustic emission testing",
            "Publication year": 2012,
            "Publication url": "https://portal.findresearcher.sdu.dk/en/publications/structural-health-monitoring-of-ship-and-other-offshore-structure",
            "Abstract": "One of the most important, complex and large offshore structures is the ship hull, of which structural members must properly monitoring and rectified in order to avoid the catastrophic failure with many losses of human lives and unanticipated out-of-service time. A typical hull inspection requires dry-docking processes, which is sensitive to human errors, costly and the ship should be out-of-order for many days. In case of transport oil ships, the environmental consequences of a ship accident are incalculable, as huge mass of oil spillage into the sea wasted the ecological system and harmed the Flora and Fauna of the sea and coasts for many years. Recently, Acoustic Emission (AE) method has been used to inspect large offshore structures using a relatively small number of sensors. In this chapter, a short review in structural health monitoring of offshore structures using AE testing is provided.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Nova Science Publishers"
        },
        {
            "Title": "Design of wireless network of sensors for continuous monitoring of vital biosignals",
            "Publication year": 2003,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/ic_20030151",
            "Abstract": "The concept of a wireless integrated network of sensors, already applied in several sectors of our everyday life, such as security, transportation and environment monitoring, can provide an advanced monitor and control medium for healthcare services. By networking medical sensors wirelessly, we create the appropriate infrastructure for continuous and real-time monitoring of the patient without discomfort. Moreover, the utilization of existing mobile communications networks in such an application releases patient's telemonitoring services from almost any spatial constraint. In this paper we describe the architecture of a modular and ambulatory telemedicine system used for continuous monitoring of vital biosignals. We focus on the design of the wireless network of medical sensors, attached to the patient's body, with emphasis being given to the software and hardware infrastructure that supports the communication …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:Se3iqnhoufwC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Computer aided diagnosis of mammographic tissue using shapelets in quaternionic representation",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-32703-7_45",
            "Abstract": "In this paper a robust regions-of-suspicion (ROS) diagnosis system on mammograms, recognizing all types of abnormalities is presented and evaluated. A new type of descriptors, based on Shapelet decomposition, estimate the source images that generate the observed ROS in mammograms. The Shapelet decomposition coefficients can be used to efficiently detect ROS areas using a new classifier base on quaternionic representation. Extensive experiments using the Mammographic Image Analysis Society (MIAS) database have shown high recognition accuracy over 86% for all kinds of breast, with less computational cost.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:N5tVd3kTz84C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Recognition and identification of red blood cell size using angular radial transform and neural networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13039-7_178",
            "Abstract": "In this paper, a novel method for the estimation of the human Red Blood Cell (RBC) size using light scattering images is presented. The information retrieval process includes, image normalization and features extraction using the Angular Radial Transform (ART). A Radial Basis Neural Network (RBF-NN) estimates the RBC geometrical properties. The proposed method is evaluated in both regression and identification tasks when three important geometrical properties of the human RBC are estimated using a database of 1575 simulated images generated with the boundary element method. The experimental setup consists of a light beam at 632.8 nm and moving RBCs in a thin glass and additive noise distortion is simulated using white Gaussian noise from 60 to 10 dB SNR. The regression and identification accuracy of actual RBC sizes is estimated using three feature sets, giving a mean error rate less …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Acoustic emission-techniques and applications Acoustic emission-techniques and applications, 1974",
            "Publication year": 2009,
            "Publication url": "https://ci.nii.ac.jp/naid/10025362886/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 \n出版年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 <no title> SPANNER J \n被引用文献: 1件 著者 SPANNER J 収録刊行物 Acoustic emission-techniques and applications \nAcoustic emission-techniques and applications, 1974 Intex Publication Co 被引用文献: 1件中 \n1-1件を 表示 1 Neural localization of acoustic emission sources in ship hulls KAPPATOS \nVassilios , DERMATAS Evangelos Journal of marine science and technology 14(2), 248-255, \n2009-06-01 参考文献12件 Tweet 各種コード NII論文ID(NAID) 10025362886 資料種別 図書\n全体 データ提供元 CJP引用 書き出し RefWorksに書き出し EndNoteに書き出し Mendeleyに/| …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Region Growing Method Based on Statistical Attributes of Infrared Images for Finger Vein Pattern Extraction",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=17091514194650631293&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust non-invasive estimation of oxygen saturation in human tissue",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812814852_0024",
            "Abstract": "In this paper a pulse oximeter instrument based on a novel design and implementation, including multiple-LEDs and multiple-phododiodes, is presented and evaluated. Several novel solutions are presented: the light-absorption in tissue is measured in multiple wavelengths (more than two), analog and digital adaptive filtering methods minimize the influence of noise in the final measurement, and strong artifact events are automatically detected. The experimental results show that the acquired signals approximate the corresponding theoretical signals, and the estimated oxygen saturation is almost identical to commercially available instruments. Moreover, the pulse-oximeter is implemented by using the ultra-low power capabilities of the low-cost MSP430F169 microcontroller.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Blind speech separation using wavelet decomposition",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Athanasios-Koutras/publication/272886759_BLIND_SPEECH_SEPARATION_USING_WAVELET_DECOMPOSITION/links/54f237910cf2b36214af9866/BLIND-SPEECH-SEPARATION-USING-WAVELET-DECOMPOSITION.pdf",
            "Abstract": "In this paper we propose a new Blind Separation method for speech signals in the wavelet domain. Our approach consists in transforming the basic speech separation problem into the wavelet domain by decomposing the signal space in two orthogonal subspaces, where successful separation is achieved by combining information from both subspaces. Extensive experiments involving speech recognition of two simultaneous speakers in an anechoic room environment showed very high separation performance with a phoneme recognition improvement reaching a mean value of 18% and a Signal to Interference ratio (SIR) improvement of 55dB for both separated speech signals, in comparison to the corresponding mixed signals acquired by the microphones. These results were achieved in the most difficult mixing situations with high interference.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simultaneous speech recognition in noisy reverberant environments",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Athanasios-Koutras/publication/2632923_Simultaneous_Speech_Recognition_in_Noisy_Reverberant_Environments/links/0fcfd509989c266e6f000000/Simultaneous-Speech-Recognition-in-Noisy-Reverberant-Environments.pdf",
            "Abstract": "In this paper, we examine the robustness of a Blind Signal Separation (BSS) technique in the time domain, based on a recurrent neural network, for separating multiple competing speakers in real reverberant environments. The separation network’s learning rule is based on the Maximum Likelihood Estimation criterion and was tested in real room situations in a noise-free and a noisy reverberant environment. The Signal to Interference Ratio improvement (SIR) in a two-simultaneous speaker environment was 30 dB for both speakers, even under the presence of a noise source (improvement more than 20 dB). Furthermore, the proposed method can significantly improve the accuracy of an automatic phoneme decoder, more than 20% in all adverse environments. Therefore, it can be used as a front-end processor for separating multiple speakers in real room situations with possible existence of noise sources towards solving the cocktail party problem.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supervised and unsupervised finger vein segmentation in infrared images using KNN and NNCA clustering algorithms",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13039-7_187",
            "Abstract": "In this paper, two new methods to segment infrared images of finger in order to perform the finger vein pattern extraction task are presented. In the first, the widespread known and used K nearest neighbor (KNN) classifier, which is a very effective supervised method for clustering data sets, is used. In the second, a novel clustering algorithm named nearest neighbor clustering algorithm (NNCA), which is unsupervised and has been recently proposed for retinal vessel segmentation, is used. As feature vectors for the classification process in both cases two features are used: the multidirectional response of a matched filter and the minimum eigenvalue of the Hessian matrix. The response of the multidirectional filter is essential for robust classification because offers a distinction between vein-like and edgelike structures while Hessian based approaches cannot offer this. The two algorithms, as the experimental …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Recognition and identification of red blood cell size using zernike moments and multicolor scattering images",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6079035/",
            "Abstract": "In this paper, a new apparatus device and a novel method for the estimation of the human Red Blood Cells' (RBC) size and shape in the blood, using color scattering images presented. The information retrieval process includes, image normalization, features extraction using the Zernike moments and features dimension reduction using both Independent Component Analysis (ICA) and Principal Component Analysis (PCA). A Radial Basis Neural Network (RBF-NN) estimates the RBC geometrical properties. The proposed method was evaluated in both regression and identification tasks by processing images of simulated device used to acquire scattering phenomena of moving RBCs. The experimental setup consists of a multicolor polarized light source at 570, 587 and 628 nm and moving RBCs in a thin glass. The evaluation database includes 1575 simulated scattering images of 50 × 50 pixels each obtained by a …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Polynomial extension of the generalized radial-basis function networks in density estimation and classification problems",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=14085868390124982747&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:mB3voiENLucC",
            "Publisher": "THE IDG COMPANY, CZECHOSLOVAKIA"
        },
        {
            "Title": "ROBUST ESTIMATION OF OXYGEN SATURATION IN HUMAN TISSUE",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=IEZkDQAAQBAJ&oi=fnd&pg=PA218&dq=info:oVonAllN_MAJ:scholar.google.com&ots=ZTVyBmeN__&sig=NGXPZPZ_1nvtFyw6SCsGluC_XlA",
            "Abstract": "In this paper a pulse oximeter instrument based on a novel design and implementation, including multiple-LEDs and multiple-phododiodes, is presented and evaluated. Several novel solutions are presented: the light-absorption in tissue is measured in multiple wavelengths (more than two), analog and digital adaptive filtering methods minimize the influence of noise in the final measurement, and strong artifact events are automatically detected. The experimental results show that the acquired signals approximate the corresponding theoretical signals, and the estimated oxygen saturation is almost identical to commercially available instruments. Moreover, the pulse-oximeter is implemented using the ultra-low power capabilities of the low-cost microcontroller.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:M05iB0D1s5AC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Neural classification of breast tissue in mammograms: linear analysis in texture feature space",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/36807979/NNSMED_Christoyianni.pdf",
            "Abstract": "Dimensionality reduction of the feature vector is one of the most important preprocessing techniques in visual recognition which reduces significantly the computational load and improves the performance of the learning algorithms. In this paper, we investigate the efficiency of two linear feature reduction methods, based on Principal Component Analysis (PCA) and Independent Component Analysis (ICA), for classification of breast tissue in mammograms using neural networks. The Radial-Basis-Function network is employed to classify suspicious regions for all kinds of abnormalities, using the projected texture features which result from the Spatial Gray Level Dependence Matrix. Extensive tests using the MIAS database, gave a recognition accuracy of 84.87% for the PCA and 77.31% for the ICA, using only seven components.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Feature selection for robust localization of acoustic emission sources in ship-hull structures",
            "Publication year": 2010,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09349841003693098",
            "Abstract": "In this article, a novel feature selection method based on the Fisher ratio (F-ratio) and k-means clustering algorithm is presented and evaluated for nondestructive monitoring of acoustic mission (AE) sources in ship-hull structures. Avoiding complex and time-consuming implementations, the proposed approach use the advantages of the discrimination measure of the F-ratio and the fast convergence rate of a k-means algorithm in the feature selection problem. An extremely efficient set of only four features per sensor is selected for AE sources localization using a radial basis function (RBF) neural network (NN) giving error-free localization accuracy.In the presence of additive white Gaussian noise, different type of information has been selected from the original set of 90 features. Extensive experiments show that even in the very noisy environment of 0 dB SNR, a small set of four features can be used for robust …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Maximum likelihood adaptation for distant speech recognition of stationary and moving speakers in reverberant environments.",
            "Publication year": 2001,
            "Publication url": "https://www.isca-speech.org/archive_v0/eurospeech_2001/e01_2631.html",
            "Abstract": "In this paper, a feature transformation method is presented for distant speech recognition in reverberant and noisy environments. In the Maximum Likelihood framework the optimum bias parameters are obtained on-line, using a small number of successive speech frames. The stochastic matching is achieved by assuming a mixture of Gaussians pdf for the clean speech features. The proposed method was evaluated on the Mel-scaled Frequency Cepstral Coefficient (MFCC) features as well as on MFCC after cepstral mean subtraction and after RASTA filtering. The experiments, carried out in several adverse conditions including room acoustics and additive factory noise for stationary and moving speakers, have shown significant improvement of the recognition accuracy for isolated word speech recognition. In the experiments, the proposed method improves the recognition score of a standing speaker by more than …",
            "Abstract entirety": 0,
            "Author pub id": "ireNT3QAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Direct estimation of polynomial densities in generalized RBF networks using moments",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44668-0_17",
            "Abstract": "We present a direct estimation method of the output layer weights in a polynomial extension of the generalized radial-basis-function networks when used in pattern classification problems. The estimation is based on the L2-distance minimization of the density and the population moments. Each synaptic weight in the output layer is derived as a nonlinear function of the training data moments. The experimental results, using one- and two-dimensional simulated data and different polynomial orders, show that the classification rate of the polynomial densities is very close to the optimum rate.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computer aided diagnosis of breast cancer in digitized mammograms",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895611102000319",
            "Abstract": "A computer aided neural network classification of regions of suspicion (ROS) on digitized mammograms is presented in this paper which employs features extracted by a new technique based on independent component analysis. Our approach is concentrated in finding a set of independent source regions that generate the observed mammograms. The coefficients of the linear transformation of the source regions are used as features that describe effectively any normal and abnormal region in digital mammograms as well as benign and malignant ROS in the latter case. Extensive experiments in the MIAS Database have shown a recognition accuracy of 88.23% in the detection of all kinds of abnormalities and 79.31% in the task of distinguishing between benign and malignant regions, outperforming in both cases standard textural features, widely used for cancer detection in mammograms.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Robust speech recognition in a high interference real room environment using blind speech extraction",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1027867/",
            "Abstract": "We present a novel blind signal extraction (BSE) method for robust speech recognition in a real room environment under the coexistence of simultaneous interfering non-speech sources. The proposed method is capable of extracting the target speaker's voice based on a maximum kurtosis criterion. Extensive phoneme recognition experiments have proved the proposed network's efficacy when used in a real-life situation of a talking speaker with the coexistence of various non-speech sources (e.g. music and noise), achieving a phoneme recognition improvement of about 23%, especially under high interference. Furthermore, comparison of the proposed network to known blind source separation networks, commonly used in similar situations, showed lower computational complexity and better recognition accuracy of the BSE network, making it ideal to be used as a front-end to existing ASR systems.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computer aided classification of mammographic tissue using independent component analysis",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1027865/",
            "Abstract": "A computer-aided method for the classification of regions of suspicion on digitized mammograms is presented. The method employs features extracted by a novel technique based on independent component analysis. We concentrate our approach on finding a set of independent source regions that generate the observed regions. The coefficients of the linear transformation of the source regions are used as features that describe effectively benign and malignant regions of suspicion. Extensive experiments in the WAS Database have shown a recognition accuracy of 79.31% in the task of distinguishing between benign and malignant regions, outperforming standard textural features that are widely used for cancer detection in mammograms.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind speech separation of nonlinear convolutive mixtures for robust speech recognition",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Athanasios-Koutras/publication/272886815_Blind_speech_separation_of_nonlinear_convolutive_mixtures_for_robust_speech_recognition/links/54f2349c0cf24eb87945e7b1/Blind-speech-separation-of-nonlinear-convolutive-mixtures-for-robust-speech-recognition.pdf",
            "Abstract": "In this paper we present a novel solution to the convolutive and post non-linear Blind Speech Separation (NLBSS) problem. The non-linear separating functions are chosen to be a mixture of parametric sigmoid functions and higher order odd polynomial functions. The estimation of the separating filter coefficients and the parameters of the separating non-linear functions is derived using the Maximum Likelihood Estimation principle. Extensive experiments including different types of complex non-linear mixing functions and real room impulse responses were carried out to simulate a mixing scenario of two speakers that are talking simultaneously in a real room environment under the effect of high non-linear distortions. Our proposed method succeeded in separating the non-linear mixture signals and improved the phoneme recognition accuracy of an automatic speech recognition system by more than 20% in comparison to the accuracy measured with the non-linear mixture signals. Furthermore, this method was found to outperform standard linear Blind Speech Separation methods by 20%, justifying the necessity for non-linear separating functions integration in speech recognition systems in a non-linear and multi-simultaneous speaker environment.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Anaheim, CA; Calgary: ACTA Press, 1998-"
        },
        {
            "Title": "Blind speech separation for solving the cocktail party problem in real room environments problem",
            "Publication year": 2002,
            "Publication url": "http://scindeks.ceon.rs/article.aspx?artid=1451-43970202029K",
            "Abstract": "In this paper, we examine the robustness of Blind Signal Separation (BSS) in the time as well as the frequency domain, for separating competing speakers in real reverberant environments. The separation network’s learning rule is based on the Maximum Likelihood Estimation criterion and was tested in real room situations in a noise-free reverberant environment. The Signal to Interference Ratio improvement (SIR) in a two-simultaneous speaker environment was 30 dB for both speakers. Furthermore, both separation methods can significantly improve the accuracy of an automatic phoneme decoder, more than 20% especially in highly adverse environments. Therefore, it can be used as a front-end processor for separating multiple speakers in real room situations towards solving the cocktail party problem.",
            "Abstract entirety": 1,
            "Author pub id": "ireNT3QAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        }
    ]
}]