[{
    "name": "Ευστράτιος Γαλλόπουλος",
    "romanize name": "Efstratios Gallopoulos",
    "School-Department": "Μηχανικών Η/Υ & Πληροφορικής",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 1041,
    "Scholar name": "Efstratios Gallopoulos",
    "Scholar id": "WhMzaJwAAAAJ",
    "Affiliation": "Computer Engineering and Informatics Department (CEID), University of Patras, Greece",
    "Citedby": 3951,
    "Interests": [
        "Scientific Computing",
        "Parallel Processing",
        "Information Retrieval",
        "Problem Solving Environments",
        "Numerical Linear Algebra"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=WhMzaJwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Topic 10: Parallel Numerical Algorithms",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11823285_70",
            "Abstract": "Since the early days of supercomputing, numerical routines have caused the highest demand for computing power anywhere, making their efficient parallelization one of the core methodical tasks in high-performance computing. And still, many of today’s fastest computers in the world are mostly used for the solution of huge systems of equations as they arise in the simulation of complex large scale problems in engineering and science.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A general tridiagonal solver for coprocessors: Adapting g-Spike for the Intel Xeon Phi",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=PKotDAAAQBAJ&oi=fnd&pg=PA371&dq=info:28WC2eKP1yYJ:scholar.google.com&ots=RerW0KhU8t&sig=7Dklybv_aE823pgacBbAAT1wpTs",
            "Abstract": "Manycores like the Intel Xeon Phi and graphics processing units like the NVIDIA Tesla series are prime examples of systems for accelerating applications that run on current CPU multicores. It is therefore of interest to build fast, reliable linear system solvers targeting these architectures. Moreover, it is of interest to conduct cross comparisons between algorithmic implementations in order to organize the types of optimizations and transformations that are necessary when porting in order to succeed in obtaining performance portability. In this work we aim to present a detailed study of the adaptation and implementation of g-Spike for the Xeon Phi. g-Spike was originally developed to solve general tridiagonal systems on GPUs, on which it returns high performance while also solving systems for which other state-of-the-art general tridiagonal GPU solvers do not succeed. The solver is based on the Spike framework, using QR factorization without pivoting implemented via Givens rotations. We show the necessary adaptations on the Xeon Phi because of the significant differences in the programming models and the underlying architectures as well as the relative performance differences for data access and processing operations.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:pXiCqeVOhFwC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "General Linear Systems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_4",
            "Abstract": "One of the most fundamental problems in matrix computations is solving linear systems of the form.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:DCYT7yIMjgYC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Asynchronous iterative computations with Web information retrieval structures: The PageRank case",
            "Publication year": 2006,
            "Publication url": "https://arxiv.org/abs/cs/0606047",
            "Abstract": "There are several ideas being used today for Web information retrieval, and specifically in Web search engines. The PageRank algorithm is one of those that introduce a content-neutral ranking function over Web pages. This ranking is applied to the set of pages returned by the Google search engine in response to posting a search query. PageRank is based in part on two simple common sense concepts: (i)A page is important if many important pages include links to it. (ii)A page containing many links has reduced impact on the importance of the pages it links to. In this paper we focus on asynchronous iterative schemes to compute PageRank over large sets of Web pages. The elimination of the synchronizing phases is expected to be advantageous on heterogeneous platforms. The motivation for a possible move to such large scale distributed platforms lies in the size of matrices representing Web structure. In orders of magnitude:  pages with  nonzero elements and  bytes just to store a small percentage of the Web (the already crawled); distributed memory machines are necessary for such computations. The present research is part of our general objective, to explore the potential of asynchronous computational models as an underlying framework for very large scale computations over the Grid. The area of ``internet algorithmics'' appears to offer many occasions for computations of unprecedent dimensionality that would be good candidates for this framework.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards the effective parallel computation of matrix pseudospectra",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/377792.377847",
            "Abstract": "Given a matrix A, the computation of its pseudospectrum A∈(A) is a far more expensive task than the computation of characteristics such as the condition number and the matrix spectrum. As research of the last 15 years has shown, however, the matrix pseudospectrum provides valuable information that is not included in other indicators. So, we ask how to compute it efficiently and build a tool that would facilitate engineers and scientists to make such analyses? In this paper we focus on parallel algorithms for computing pseudospectra. The most widely used algorithm for computing pseudospectra is embarassingly parallel; nevertheless, it is extremely costly and one cannot hope achieve absolute high performance with it. We describe algorithms that have drastically improved performance while maintaining a high degree of large grain parallelism. We evaluate the effectiveness of these methods in the context of a …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guest editorial: Parallel Matrix Algorithms and Applications (PMAA'04)",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.parco.2005.10.001",
            "Abstract": "Guest editorial: Parallel Matrix Algorithms and Applications (PMAA'04): Parallel Computing: \nVol 32, No 2 ACM Digital Library home ACM home Google, Inc. (search) Advanced Search \nBrowse About Sign in Register Advanced Search Journals Magazines Proceedings Books \nSIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search \nParallel Computing Periodical Home Latest Issue Archive Authors Affiliations Award Winners \nMore HomeBrowse by TitlePeriodicalsParallel ComputingVol. , No. Guest editorial: Parallel \nMatrix Algorithms and Applications (PMAA'04) article Guest editorial: Parallel Matrix Algorithms \nand Applications (PMAA'04) Share on Authors: Maurice Clint profile image Maurice Clint \nComputer Science, Queen's University, Belfast BT7 1NN, United Kingdom Computer Science, \nQueen's University, Belfast BT7 1NN, United Kingdom View Profile , Efstratios Gallopoulos of :…",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:f2IySw72cVMC",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "PDDP (l): towards a flexible principal direction divisive partitioning clustering algorithm",
            "Publication year": 2003,
            "Publication url": "http://scgroup.hpclab.ceid.upatras.gr/~dsz/downloads/IEEE_pddpFinal.ps",
            "Abstract": "In this “work-in-progress” we consider the problem of clustering large document collections into clusters in the context of the vector space model. We consider the Principal Direction Divisive Partitioning (PDDP) algorithm and evaluate its performance relative to k-means type algorithms. We introduce and outline PDDP (l), a generalization of PDDP and explore its effectiveness showing by means of numerical experiments on standard datasets that it frequently improves the overall performance of PDDP and that it could provide an interesting alternative to LSI.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Jylab: A System for Portable Scientific Computing over Distributed Platforms",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4031070/",
            "Abstract": "Jylab is a portable and flexible scientific computing system favoring extensibility. It provides users with a scripting language and a core set of libraries implementing numerical linear algebra routines, communication models, interactive visualization and computer algebra system capabilities. It thus enables the development of scientific applications involving numerics, graphics and symbolics over distributed computing platforms. It is enhanced with a collection of extension packages that support Grid computing and implement Web search engine and Web graph analysis frameworks. Building a multithreaded Internet algorithmics application in Jylab is fully presented.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Topic 10: Parallel numerical algorithms",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-32820-6_54",
            "Abstract": "The solution of large-scale problems in Computational Science and Engineering relies on the availability of accurate, robust and efficient numerical algorithms and software that are able to exploit the power offered by modern computer architectures. Such algorithms and software provide building blocks for prototyping and developing novel applications, and for improving existing ones, by relieving the developers from details concerning numerical methods as well as their implementation in new computing environments.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Preface Special issue",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.apnum.2016.02.005",
            "Abstract": "Preface Special issue | Applied Numerical Mathematics ACM Digital Library home ACM home \nGoogle, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search \nJournals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital \nLibrary SearchSearch Advanced Search Applied Numerical Mathematics Periodical Home Latest \nIssue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsApplied \nNumerical MathematicsVol. , No. CPreface Special issue research-article Preface Special \nissue Share on Authors: Georgios D Akrivis profile image Georgios D. Akrivis View Profile , \nVassilios A Dougalis profile image Vassilios A. Dougalis View Profile , Efstratios Gallopoulos \nprofile image Efstratios Gallopoulos View Profile , Apostolos Hadjidimos profile image \nApostolos Hadjidimos View Profile , Ilias S Kotsireas profile image Ilias S. Kotsireas View , , . …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:P7PM_jyRRcwC",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "Multidamping simulation framework for link-based ranking",
            "Publication year": 2007,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2007/1060/",
            "Abstract": "We review methods for the approximate computation of PageRank. Standard methods are based on the eigenvector and linear system characterizations. Our starting point are recent methods based on series representation whose coefficients are damping functions, for example Linear Rank, HyperRank and TotalRank, etc. We propose a multidamping framework for interpreting PageRank and these methods. Multidamping is based on some new useful properties of Google type matrices. The approach can be generalized and could help in the exploration of new approximations for list-based ranking. This is joint work with Georgios Kollias and is supported by a Pythagoras-EPEAEK-II grant.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:RGFaLdJalmkC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "The design of a distributed MATLAB-based environment for computing pseudospectra",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X03002929",
            "Abstract": "It has been documented in the literature that the pseudospectrum of a matrix is a powerful concept that broadens our understanding of phenomena based on matrix computations. When the matrix A is non-normal, however, the computation of the pseudospectrum becomes a very expensive computational task. Thus, the use of high performance computing resources becomes key to obtaining useful answers in acceptable amounts of time. In this work we describe the design and implementation of an environment that integrates a suite of state-of-the-art algorithms running on a cluster of workstations to enable the matrix pseudospectrum become a practical tool for scientists and engineers. The user interacts with the environment via the graphical user interface PPsGUI. The environment is constructed on top of CMTM, an existing environment that enables distributed computation via an MPI API for MATLAB.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:IWHjjKOFINEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Estimating leverage scores via rank revealing methods and randomization",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.11004",
            "Abstract": "We study algorithms for estimating the statistical leverage scores of rectangular dense or sparse matrices of arbitrary rank. Our approach is based on combining rank revealing methods with compositions of dense and sparse randomized dimensionality reduction transforms. We first develop a set of fast novel algorithms for rank estimation, column subset selection and least squares preconditioning. We then describe the design and implementation of leverage score estimators based on these primitives. These estimators are also effective for rank deficient input, which is frequently the case in data analytics applications. We provide detailed complexity analyses for all algorithms as well as meaningful approximation bounds and comparisons with the state-of-the-art. We conduct extensive numerical experiments to evaluate our algorithms and to illustrate their properties and performance using synthetic and real world data sets.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:wdLM4YbmhYkC",
            "Publisher": "SIAM"
        },
        {
            "Title": "Parallel computation of pseudospectra by fast descent",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167819101001375",
            "Abstract": "The pseudospectrum descent method (PsDM) is proposed, a new parallel method for the computation of pseudospectra. The idea behind the method is to use points from an already existing pseudospectrum level curve ∂Λϵ to generate in parallel the points of a new level curve ∂Λδ such that δ<ϵ. This process can be continued for several steps to approximate several pseudospectrum level curves lying inside the original curve. It is showed via theoretical analysis and experimental evidence that PsDM is embarrassingly parallel, like GRID, and that it adjusts to the geometric characteristics of the pseudospectrum; in particular it captures disconnected components. Results obtained on a parallel system using MPI validate the theoretical analysis and demonstrate interesting load-balancing issues.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:dhFuZR0502QC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "RandNLA: Randomization in Numerical Linear Algebra",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=15367969379649123989&hl=en&oi=scholarr",
            "Abstract": "The goal of RandNLA is to design novel algorithms for numerical linear algebra problems by using randomization, eg, random sampling and random projections. It is a topic that has received a great deal of interdisciplinary interest in recent years, with contributions coming from numerical linear algebra, theoretical computer science, scientific computing, statistics, optimization, data analysis, and machine learning, as well as application areas such as genetics, physics, astronomy, and internet modeling.The summer school is designed to bring graduate students up to date on the state of the art in the theory, numerical aspects, and data analysis applications of RandNLA. Since RandNLA is quite interdisciplinary, students will be selected from a wide range of backgrounds. Thus the courses are designed to provide students with an overview of RandNLA and also an understanding of the complementary strengths and …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:hbz17DqrwuEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Principal Direction Divisive Partitioning with Kernels and k-Means Steering",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84800-046-9_3",
            "Abstract": "Clustering is a fundamental task in data mining. We propose, implement, and evaluate several schemes that combine partitioning and hierarchical algorithms, specifically k-means and principal direction divisive partitioning (PDDP). Using available theory regarding the solution of the clustering indicator vector problem, we use 2-means to induce partitionings around fixed or varying cut-points. 2-means is applied either on the data or over its projection on a one-dimensional subspace. These techniques are also extended to the case of PDDP(l), a multiway clustering algorithm generalizing PDDP. To handle data that do not lend themselves to linear separability, the algebraic framework is established for a kernel variant, KPDDP. Extensive experiments demonstrate the performance of the above methods and suggest that it is advantageous to steer PDDP using k-means. It is also shown that KPDDP can provide results …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Special Linear Systems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_6",
            "Abstract": "One key idea when attempting to build algorithms for large scale matrix problems is to detect if the matrix has special properties, possibly due to the characteristics of the application, that could be taken into account in order to design faster solution methods.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:yCEqH1SBpFUC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Orthogonal Factorization and Linear Least Squares Problems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_7",
            "Abstract": "Orthogonal factorization (or      QR factorization) of a dense matrix is an essential tool in several matrix algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:cDbf6tmpeSoC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Towards the Effective Parallel Computation of Matrix Pseudospectra",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=408151040460911156&hl=en&oi=scholarr",
            "Abstract": "Given a matrix A, the computation of its pseudospectrum A «(A) is a far more expensive task than the computation of characteristics such as the condition number and the matrix spectrum. As research of the last 15 years has shown, however, the matrix pseudospectrum provides valuable information that is not included in other indicators. So, we ask how to compute it efficiently and build a tool that would facilitate engineers and scientists to make such analyses? In this paper we focus on parallel algorithms for computing pseudospectra. The most widely used algorithm for computing pseudospectra is embarassingly parallel; nevertheless, it is extremely costly and one cannot hope to achieve absolute high performance with it. We describe algorithms that have drastically improved performance while maintaining a high degree of large grain parallelism. We evaluate the effectiveness of these methods in the context of a MATLAB-based environment for parallel programming using MPI on small, off-the-shelf parallel systems.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:qzuIxkxWBNsC",
            "Publisher": "Association for Computing Machinery"
        },
        {
            "Title": "EigenRec: generalizing PureSVD for effective and efficient top-N recommendations",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-018-1197-7",
            "Abstract": "We introduce EigenRec, a versatile and efficient latent factor framework for top-N recommendations that includes the well-known PureSVD algorithm as a special case. EigenRec builds a low-dimensional model of an inter-item proximity matrix that combines a similarity component, with a scaling operator, designed to control the influence of the prior item popularity on the final model. Seeing PureSVD within our framework provides intuition about its inner workings, exposes its inherent limitations, and also, paves the path toward painlessly improving its recommendation performance. A comprehensive set of experiments on the MovieLens and the Yahoo datasets based on widely applied performance metrics, indicate that EigenRec outperforms several state-of-the-art algorithms, in terms of Standard and Long-Tail recommendation accuracy, exhibiting low susceptibility to sparsity, even in its most extreme …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:AeQkyvggb0MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A scalable iterative dense linear system solver for multiple right-hand sides in data analytics",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167819117302119",
            "Abstract": "We describe Parallel-Projection Block Conjugate Gradient (pp-bcg), a distributed iterative solver for the solution of dense and symmetric positive definite linear systems with multiple right-hand sides. In particular, we focus on linear systems appearing in the context of stochastic estimation of the diagonal of the matrix inverse in Uncertainty Quantification. pp-bcg is based on the block Conjugate Gradient algorithm combined with Galerkin projections to accelerate the convergence rate of the solution process of the linear systems. Numerical experiments on massively parallel architectures illustrate the performance of the proposed scheme in terms of efficiency and convergence rate, as well as its effectiveness relative to the (block) Conjugate Gradient and the Cholesky-based ScaLAPACK solver. In particular, on a 4 rack BG/Q with up to 65,536 processor cores using dense matrices of order as high as 524,288 and 800 …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:IuzW4o0J_HAC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Machine learning and robust data mining",
            "Publication year": 2007,
            "Publication url": "https://ideas.repec.org/a/eee/csdana/v52y2007i1p151-154.html",
            "Abstract": "Machine Learning and Robust Data Mining IDEAS home Advanced search Economic literature: \npapers, articles, software, chapters, books. Authors Institutions Rankings Help/FAQ MyIDEAS More \noptions at page bottom Economic literature Authors Institutions Rankings Help/FAQ MyIDEAS (now \nwith weekly email digests) Advanced (and improved) search Browse Econ Literature Working papers \nJournals Software components Books Book chapters JEL classification More features Subscribe to \nnew research RePEc Biblio Author registration Economics Virtual Seminar Calendar NEW! FRED \ndata IDEAS home Printed from https://ideas.repec.org/a/eee/csdana/v52y2007i1p151-154.html \nMy bibliography Save this article Machine Learning and Robust Data Mining \nAuthor & abstract Download 3 Citations Related works & more Corrections Author \nListed: Croux, Christophe Gallopoulos, Efstratios Van Aelst, Stefan Zha, : No . …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:J4wmHkHhN-kC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "High-performance scientific computing: algorithms and applications",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=yVpYDkV-Zz4C&oi=fnd&pg=PR4&dq=info:YxVCiU9wv0sJ:scholar.google.com&ots=j_j2jaCs75&sig=5IjhSRBSfITWOABaTD3BiAYIQZ4",
            "Abstract": "Advances in the development of parallel algorithms and system software now enable the ever-increasing power of scalable high-performance computers to be harnessed for scientific computing applications at fidelities that rival–and in many cases exceed–experimental methodologies. This comprehensive text/reference, inspired by the visionary work of Prof. Ahmed H. Sameh, represents the state of the art in parallel numerical algorithms, applications, architectures, and system software. Articles in this collection address various challenges arising from concurrency, scale, energy efficiency, and programmability, and associated solutions that have shaped the current high-performance computing landscape. These solutions are discussed in the context of diverse applications, ranging from scientific simulations to large-scale data analysis and mining. Topics and features: includes contributions from an international selection of world-class authorities, inspired by the work of Prof. Ahmed H. Sameh and his involvement in parallel numerical algorithm design since Illiac IV and the University of Illinois Cedar multiprocessor; examines various aspects of parallel algorithm-architecture interaction through articles on computational capacity-based codesign and automatic restructuring of programs using compilation techniques; reviews emerging applications of numerical methods in information retrieval and data mining; discusses the latest issues in dense and sparse matrix computations for modern high-performance systems, multicores, manycores and GPUs, and several perspectives on the Spike family of algorithms for solving linear systems; presents …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:u9iWguZQMMsC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Factored proximity models for top-n recommendations",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8023398/",
            "Abstract": "In this paper, we propose EIGENREC; a simple and versatile Latent Factor framework for Top-N Recommendations, which includes the well-known PureSVD algorithm as a special case. EIGENREC builds a low dimensional model of an inter-item proximity matrix that combines a traditional similarity component, with a scaling operator, designed to regulate the effects of the prior item popularity on the final recommendation list. A comprehensive set of experiments on the MovieLens and the Yahoo datasets, based on widely applied performance metrics suggest that EIGENREC outperforms several state of-the-art algorithms, in terms of Standard and Long-Tail recommendation accuracy, while exhibiting low susceptibility to the problems caused by Sparsity, even its most extreme manifestations - the Cold-start problems.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:FnaCo-ypupUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Onomatology and content analysis of ergodic literature",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2462216.2462221",
            "Abstract": "We first establish a connection between the concept of ergodicity in mathematics and\" ergodic literature\" of the Choose-your-own-Adventure (CYOA) type that serves to answer some existing objections regarding the use of the term in the latter context. We then consider some steps towards the construction of concept maps for CYOA-type ergodic literature. Our analysis is based on modeling ergodic literature using digraphs and matrices. Promising preliminary results are obtained using content to refine link-based ranking.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A versatile system for asynchronous iterations: From multithreaded simulations to Grid experiments",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=DqX-aWwIEJsC&oi=fnd&pg=PA238&dq=info:a8ryXkF54zYJ:scholar.google.com&ots=a6o9OmE_cy&sig=v3tiiyEKd0jFWp4nbELZGXpyfaA",
            "Abstract": "We present a system for asynchronous iterations, integrated in a portable environment for interactive computations. This system facilitates both the simulation of asynchronous computations in a multithreading context and their execution within a relatively complex platform such as the Grid. Numerical experiments with the PageRank algorithm are also given to demonstrate the practicality of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Functional Rankings with Multidamping: Generalizing PageRank with Inhomogeneous Matrix Products",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=17364845573489787843&hl=en&oi=scholarr",
            "Abstract": "An approach is described for re-interpreting methods for ranking web pages based on matrix power series representations for PageRank and its variants, such as LinearRank, General Hyperbolic Rank and TotalRank. This is based on novel properties of Google type matrices. It is shown that matrix polynomials having as argument a normalized stochastic matrix can be expressed as products of Google matrices. Algorithms for computing the damping factors are proposed and those corresponding to existing functional rankings are derived analytically and numerically otherwise. The spectral properties of general inhomogeneous products of Google matrices are obtained and their convergence is investigated. Multidamping is useful because it allows the intepretation of existing functional rankings, it can be used to construct new link-based rankings based on inhomogeneous products of Google matrices, and it …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Tech. Rep. TR HPCLAB-SCG 01/09-11, University of Patras, Greece"
        },
        {
            "Title": "Enabling Technologies for Computational Science: Frameworks, Middleware and Environments",
            "Publication year": 2001,
            "Publication url": "https://www.jstor.org/stable/3649817",
            "Abstract": "whether time is continuous or discrete. In one case A is a Metzler matrix, while in the other it is a positive matrix. Some of the definitions are not quite the standard ones, at least as far as I know. For example, the concept of irreducibility of the system is usually phrased in terms of properties of A but is here defined in terms of the free evolution of the state variables. There are lots of things to like about this book. In particular, I liked the appendix on elements of linear systems theory. It is concise and clear without much excessive verbiage, but covers most of the important topics. It could, with the addition of some proofs by the instructor, serve as the basis of an undergraduate course on the subject. Also, there are many examples, some of which, such as the approach to queuing systems, are interesting and not found in the standard texts. Then there is the clear enthusiasm of the authors for the subject (which I share), which …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:07QC26MHY14C",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Matrix Functions and the Determinant",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_12",
            "Abstract": "Many applications require the numerical evaluation of matrix functions, such as polynomials and rational or transcendental functions with matrix arguments (e.g. the exponential, the logarithm or trigonometric), or scalar functions of the matrix elements, such as the determinant.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:7gse_HdimRUC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "RandNLA, Pythons, and the CUR for Your Data Problems",
            "Publication year": 2016,
            "Publication url": "https://www.stat.berkeley.edu/~mmahoney/pubs/siam-news-2105g2s3.pdf",
            "Abstract": "The theme of this year’s school, Randomized Numerical Linear Algebra (RandNLA), is an interdisciplinary research area that exploits randomness as an algorithmic resource for the development of improved matrix algorithms for ubiquitous problems in largescale data analysis. It utilizes ideas from theoretical computer science, numerical linear algebra, highperformance computing, and machine learning and statistics to develop, analyze, implement, and apply novel matrix algorithms. These algorithms can then facilitate the manipulation and analysis of socalled big data in numerous areas. Many popular machine learning and data analysis computations can be formulated as problems in linear algebra, but the questions of interest in machine learning and data analysis applications are very different from those historically considered in numerical linear algebra.For instance, NPhard problems have made their way into numerical linear algebra, a significant paradigm shift for numerical analysts who have traditionally formulated their problems to be solvable in polynomial time. As an example, most formulations of the Column Subset Selection problem are intractable, as are most formulations of the so called Nonnegative Matrix Factorization (NMF) problem. Alternatively, matrix factorizations—if",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:Y0agIcFmOsQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multivariable inversion using exhaustive grid search and high-performance GPU processing: a new perspective",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/gji/article-abstract/221/2/905/5714755",
            "Abstract": "Exhaustive searches in regular grids is a traditional and effective method for inversion, that is numerical solution of systems of non-linear equations which cannot be solved using formal algebraic techniques. However, this technique is effective for very few (3–4) variables and is slow. Recently, the first limitation was to a major degree overpassed with the new TOPological INVersion (TOPINV) algorithm which was used for inversion of systems with up to 18, or even more unknown variables. The novelty of this algorithm is that it is not based on the principle of the mean minimum misfit (cost function) between observations and model predictions, used by most inversion techniques. The new algorithm investigates for each gridpoint whether misfits of each observation are within specified uncertainty intervals, and stores clusters of ‘successful’ gridpoints in matrix form. These clusters (ensembles, sets) of gridpoints are …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:RSvx26AYfG8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Exploring term-document matrices from matrix models in text mining",
            "Publication year": 2006,
            "Publication url": "https://arxiv.org/abs/cs/0602076",
            "Abstract": "We explore a matrix-space model, that is a natural extension to the vector space model for Information Retrieval. Each document can be represented by a matrix that is based on document extracts (e.g. sentences, paragraphs, sections). We focus on the performance of this model for the specific case in which documents are originally represented as term-by-sentence matrices. We use the singular value decomposition to approximate the term-by-sentence matrices and assemble these results to form the pseudo-``term-document'' matrix that forms the basis of a text mining method alternative to traditional VSM and LSI. We investigate the singular values of this matrix and provide experimental evidence suggesting that the method can be particularly effective in terms of accuracy for text collections with multi-topic documents, such as web pages with news.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guest editorial: parallel matrix algorithms and applications (PMAA'02)",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/S0167-8191%2803%2900094-2",
            "Abstract": "Guest editorial: parallel matrix algorithms and applications (PMAA'02): Parallel Computing: Vol \n29, No 9 ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse \nAbout Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs \nConferences People More Search ACM Digital Library SearchSearch Advanced Search \nParallel Computing Periodical Home Latest Issue Archive Authors Affiliations Award Winners \nMore HomeBrowse by TitlePeriodicalsParallel ComputingVol. , No. Guest editorial: parallel \nmatrix algorithms and applications (PMAA'02) article Guest editorial: parallel matrix algorithms \nand applications (PMAA'02) Share on Authors: Peter Arbenz profile image Peter Arbenz Institute \nof Computational Science, Swiss Federal Institute of Technology, ETH Zentrum HRS G27, \n8092 Zurich, Switzerland Institute of Computational Science, Swiss Federal Institute of , G27…",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "Computing smallest singular triplets with implicitly restarted Lanczos bidiagonalization",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168927403001946",
            "Abstract": "A matrix-free algorithm, IRLANB, for the efficient computation of the smallest singular triplets of large and possibly sparse matrices is described. Key characteristics of the approach are its use of Lanczos bidiagonalization, implicit restarting, and harmonic Ritz values. The algorithm also uses a deflation strategy that can be applied directly on Lanczos bidiagonalization. A refinement postprocessing phase is applied to the converged singular vectors. The computational costs of the above techniques are kept small as they make direct use of the bidiagonal form obtained in the course of the Lanczos factorization. Several numerical experiments with the method are presented that illustrate its effectiveness and indicate that it performs well compared to existing codes.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:YsMSGLbcyi4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "PALSIR: A new approach to nonnegative tensor factorization",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Christos-Boutsidis/publication/240164620_PALSIR_A_new_approach_to_Nonnegative_Tensor_Factorization/links/02e7e52aea2e7cbb74000000/PALSIR-A-new-approach-to-Nonnegative-Tensor-Factorization.pdf",
            "Abstract": "• PALSIR (Projected Alternating Least Squares with Initialization and Regularization) is designed to decompose a nonnegative tensor T∈ Rd1× D2× D3+ into a sum of k nonnegative rank-1 tensors Ti∈ Rd1× D2× D3+ each of which can be written as the outer product of three nonnegative vectors xi∈ Rd1+, yi∈ Rd2+ and zi∈ Rd3+, i= 1: k.• PALSIR consists of the following phases: i) initialization of 2 out of the 3 vector groups xi’s, yi’s, zi’s; ii) an iterative tri-alternating procedure where, at each stage, two of the three groups of vectors remain fixed and a nonnegative solution is computed with respect to the third group. Each of these stages requires solving {D1, D2 or D3} nonnegativity constrained least squares (LS) problems.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Asynchronous PageRank computation in an interactive multithreading environment",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.87.507&rep=rep1&type=pdf",
            "Abstract": "Multiple-core processors set the new hardware standard for typical scientific computing platforms thus driving the need for algorithms making extensive use of Thread Level Parallelism (TLP). On the other spectrum end of concurrent platforms, large-scale distributed systems dictate the design of novel algorithms with minimum synchronization constraints and maximum self-adaptation to inevitable dynamic changes in their execution environment. We advocate the asynchronous computation model [1] as a suitable framework for building such algorithms and propose Jylab [2] as an interactive multithreading workbench for comfortably exploring their behaviour. We demonstrate the flexibility of this environment in the asynchronous computation of PageRank and comment on some interesting properties of the computation itself. In this context a multicore machine naturally boosts the performance of an application consisting of asynchronously computing threads and Jylab facilitates such multithreaded designs. Ultimately concurrency at CPU level can drive decisions for alternative ways of organizing concurrency at Internet level but can also serve as the final execution platform. 3 4",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Grid-enabling a problem solving environment: Implementation and everyday use",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-78448-9_10",
            "Abstract": "We describe a simple, yet powerful API for accessing and using Grid resources from within Jylab, a novel, extensible scientific computing workbench consisting of a suite of open-source Java libraries scriptable through a Jython interpreter. The API provides a Java-based, Python-scriptable interactive environment and aims to simplify Grid application development and use. We demonstrate the utilization of the API in the context of an application from Internet algorithmics, specifically creating an index of crawled Web pages and using it for link-based ranking calculations (PageRank) and search queries.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Banded Linear Systems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_5",
            "Abstract": "We encounter banded linear systems in many areas of computational science and engineering, including computational mechanics and nanoelectronics, to name but a few.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:KR6TXPE-FHQC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Design of a MATLAB toolbox for term-document matrix generation",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.144.80&rep=rep1&type=pdf",
            "Abstract": "Data clustering and many other fundamental operations in data mining and information retrieval are built using computational kernels from numerical linear algebra and operate on very large, sparse term-document matrices. To facilitate these tasks, we have built TMG, a toolbox for the generation and incremental modification of term-document matrices from text collections. The toolbox is written entirely in MATLAB, a powerful and popular problem solving environment for linear algebra. It can be used in research and education contexts to streamline document preprocessing and prototyping of algorithms for information retrieval. We outline the design and use of TMG and present results, from standard and readily available datasets of moderate size, concerning the effect of stemming and term weighting on clustering algorithms based on the vector space model.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel programming paradigms",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_1",
            "Abstract": "In this chapter, we briefly present the main concepts in parallel computing. This is an attempt to make more precise some definitions that will be used throughout this book rather than a survey on the topic. Interested readers are referred to one of the many books available on the subject, e.g. Arbenz and Petersen, Introduction to Parallel Computing, (2004), Bertsekas and Tsitsiklis, Parallel and Distributed Computation, (1989), Culler et al. Parallel Computer Architecture: A Hardware/Software Approach, (1998), Kumar et al. Introduction to Parallel Computing: Design and Analysis of Algorithms, 2nd edn., (2003), Casanova et al. Parallel Algorithms, (2008), Hennessy and Patterson, Computer Architecture: A Quantitative Approach, (2011), Hockney and Jesshope, Parallel Computers 2: Architecture, Programming and Algorithms, 2nd edn., (1988), Tchuente, Parallel Computation on Regular Arrays. Algorithms …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:Qovp55VTycgC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Revisiting the Spike-based framework for GPU banded solvers: A Givens rotation approach for tridiagonal systems in CUDA",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/36429775/PMAA14.pdf",
            "Abstract": "Solving banded linear systems is an important computational kernel in many applications. Over the years, a variety of algorithms and modules in numerical libraries for this task have been proposed that are suitable for computer systems ranging from uniprocessors to multicores and high performance coprocessors. In this presentation we focus on tridiagonal systems as these are very common and are also encountered as kernels in several linear algebra computations. Interesting recent efforts focus on GPU implementations. Algorithms based on cyclic reduction, parallel cyclic reduction and recursive doubling and hybrids were studied in [4]; these depend on symmetric positive definiteness or diagonal dominance to proceed without breakdown. For very large tridiagonal and narrow banded matrices, a well known approach for obtaining parallelism and high performance is to use partitioning. As shown recently by Chang et al., the Spike partitioning framework ([2, 3]) combined with a special pivoting algorithm for the resulting subsystems can lead to a scalable, highly performing tridiagonal solver [1]. In this presentation we revisit a Spike approach combined with Givens rotations to solve the subsystems, as first proposed in [3], present its CUDA implementation and evaluate its performance and stability.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:eCFM_hdDfssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel computation of pseudospectra using transfer functions on a MATLAB-MPI cluster platform",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45825-5_35",
            "Abstract": "One of the most computationally expensive problems in numerical linear algebra is the computation of the ε-pseudospectrum of matrices, that is, the locus of eigenvalues of all matrices of the form A + E, where ‖_E ‖ ≤ є. Several research efforts have been attempting to make the problem tractable by means of better algorithms and utilization of all possible computational resources. One common goal is to bring to users the power to extract pseudospectrum information from their applications, on the computational environments they generally use, at a cost that is sufficiently low to render these computations routine. To this end, we investigate a scheme based on i) iterative methods for computing pseudospectra via approximations of the resolvent norm, with ii) a computational platform based on a cluster of PCs and iii) a programming environment based on MATLAB enhanced with MPI functionality and show …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "ICALP 2019–First Call for Papers",
            "Publication year": 2018,
            "Publication url": "http://150.140.5.98/index.php/beatcs/article/view/561",
            "Abstract": "The 46th International Colloquium on Automata, Languages, and Programming (ICALP) will take place in Patras, Greece, on 8-12 July 2019. ICALP is the main conference and annual meeting of the European Association for Theoretical Computer Science (EATCS). As usual, ICALP will be preceded by a series of workshops, which will take place on 8 July 2019.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:2Iopv88g0QUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Text to matrix generator user’s guide",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/30722980/tmg_manual.pdf",
            "Abstract": "Text to Matrix Generator (TMG) is a MATLAB Toolbox that can be used for various Data Mining (DM) and Information Retrieval (IR) tasks. TMG uses the sparse matrix infrastracture of MATLAB that is especially suited for Text Miinng (TM) applications where data are extremely sparse. Initially built as a preprocessing tool, TMG offers now a wide range of DM tools. In particular, TMG is composed of six Graphical User Interface (GUI) modules, presented in Figure 1 (arrows show modules dependencies).",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A direct tridiagonal solver based on Givens rotations for GPU architectures",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167819115000605",
            "Abstract": "g-Spike, a parallel algorithm for solving general nonsymmetric tridiagonal systems for the GPU, and its CUDA implementation are described. The solver is based on the Spike framework, applying Givens rotations and QR factorization without pivoting. It also implements a low-rank modification strategy to compute the Spike DS decomposition even when the partitioning defines singular submatrices along the diagonal. The method is also used to solve the reduced system resulting from the Spike partitioning. Numerical experiments with problems of high order indicate that g-Spike is competitive in runtime with existing GPU methods, and can provide acceptable results when other methods cannot be applied or fail.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:dhZ1Wuf5EGsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Fundamental Kernels",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_2",
            "Abstract": "In this chapter we discuss the fundamental operations, that are the building blocks of dense and                                                                       sparse matrix computations. They are termed kernels because in most cases they account for most of the computational effort. Because of this, their implementation directly impacts the overall efficiency of the computation. They occur often at the lowest level where parallelism is expressed.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:JG67p0iyyesC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Rapid Elliptic Solvers.",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=12898371397233529630&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High performance GPU processing for inversion using uniform grid searches",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Vasso-Saltogianni/publication/316034180_High_performance_GPU_processing_for_inversion_using_uniform_grid_searches/links/5a0b0004458515e48274419c/High-performance-GPU-processing-for-inversion-using-uniform-grid-searches.pdf",
            "Abstract": "The search can be either selective, based on Monte Carlo sampling and genetic algorithms, focusing on the most promising parts of the search space (+ high speed,-trapped in local minima), or exhaustive, where a uniform grid is tested entirely (-slow speed,+ not trapped in local minima) A new method, the TOPological INVersion (TOPINV) algorithm, was recently introduced. TOPINV is based on repeated exhaustive grid searches and its merit is to identify n-D clusters of points that satisfy the observation system, taking into consideration the errors of the observations. Still, the main limitation is the excessive computational load for common CPU computers. Here we present results of the implementation of TOPINV in a GPU high performance platform in order to speed up calculations.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:vM5yiaU9oLoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TMG-BoBI: Generating Back-of-the-Book Indexes with the Text-to-Matrix-Generator",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8900745/",
            "Abstract": "A common editorial task when preparing scientific monographs, books, even long articles such as surveys, is to prepare a Back-of-the-Book index (BoBI). In this paper we study the automation of this task and propose a system for facilitating authors. We leverage text mining techniques and specifically Automated Keyword Extraction (AKE), the Text to Matrix Generator (TMG) which is a MATLAB toolbox for text mining, and the indexing tools of J4T_{E}X. From our experiments using publicly available datasets, our system appears to be capable of generating satisfactory indexes that can be used after only little user intervention.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:coeFWI40FR8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pseudospectra computation of large matrices",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/30722946/transfer_sisc.pdf",
            "Abstract": "Transfer functions have been shown to provide monotonic approximations to the resolvent 2-norm of A, R (z)=(A− zI)− 1, when associated with a sequence of nested spaces. This paper addresses the open question of the effectiveness of the transfer function scheme for the computation of the pseudospectrum of large matrices. It is shown that the scheme can be combined with certain Krylov type linear solvers, such as restarted fom, for the efficient solution of shifted linear systems of the form (A− zkI)− 1b, for a large number of shifts zk. Extensive numerical experiments illustrate the performance of the methods developed in this paper. Tools for the effective combination of the transfer function framework with path following methods are developed. A hybrid method is proposed that combines transfer functions with iterative solvers and path following and is shown to be a powerful and cost effective scheme for computing pseudospectra of very large matrices.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enabling Technologies for Computational Science: Frameworks, Middleware and Environments",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=_TYzFa7pkhQC&oi=fnd&pg=PR13&dq=info:ngV9xmpaWuIJ:scholar.google.com&ots=CWN0RhlNXQ&sig=XOlcclGf6YF6dGtXpvY_UDBl7Co",
            "Abstract": "Enabling Technologies for Computational Science assesses future application computing needs, identifies research directions in problem-solving environments (PSEs), addresses multi-disciplinary environments operating on the Web, proposes methodologies and software architectures for building adaptive and human-centered PSEs, and describes the role of symbolic computing in scientific and engineering PSEs. The book also includes an extensive bibliography of over 400 references. Enabling Technologies for Computational Science illustrates the extremely broad and interdisciplinary nature of the creation and application of PSEs. Authors represent academia, government laboratories and industry, and come from eight distinct disciplines (chemical engineering, computer science, ecology, electrical engineering, mathematics, mechanical engineering, psychology and wood sciences). This breadth and diversity extends into the computer science aspects of PSEs. These papers deal with topics such as artificial intelligence, computer-human interaction, control, data mining, graphics, language design and implementation, networking, numerical analysis, performance evaluation, and symbolic computing. Enabling Technologies for Computational Science provides an assessment of the state of the art and a road map to the future in the area of problem-solving environments for scientific computing. This book is suitable as a reference for scientists from a variety of disciplines interested in using PSEs for their research.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:hEp1lTclR2YC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Hermitian methods for computing eigenvalues",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TMG: A MATLAB Toolbox for Generating Term-Document Matrices from Text Collections",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-28349-8_7",
            "Abstract": "A wide range of computational kernels in data mining and information retrieval from text collections involve techniques from linear algebra. These kernels typically operate on data that are presented in the form of large sparse term-document matrices (tdm). We present TMG, a research and teaching toolbox for the generation of sparse tdms from text collections and for the incremental modification of these tdms by means of additions or deletions. The toolbox is written entirely in MATLAB, a popular problem-solving environment that is powerful in computational linear algebra, in order to streamline document preprocessing and prototyping of algorithms for information retrieval. Several design issues that concern the use of MATLAB sparse infrastructure and data structures are addressed. We illustrate the use of the tool in numerical explorations of the effect of stemming and different term-weighting policies on the …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Jylab meets Eclipse: Integrating PSEs with multicomponent platforms",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4736892/",
            "Abstract": "Jylab is a PSE architecture emphasizing portable computing over distributed platforms. It captures the idea of reusing some of the best open source software projects' functionality within the context of a single, net-aware, interactive environment. The original implementation of this idea resulted in a system built around a portable interpreter supported by a carefully selected suite of libraries spanning a comprehensive set of applications including scripting, numerical linear algebra, distributed/grid computing and Internet algorithmics. Because Jylab is a multicomponent PSE system, it is quite natural to base its implementation on a robust platform automating the management of complex stacks of software components, i.e. self-describing objects. The Eclipse platform meets this basic prerequisite, additionally providing many other interesting integration facilities, an extensive set of ready-to-use plug-ins and is also …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Graph and matrix metrics to analyze ergodic literature for children",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2309996.2310018",
            "Abstract": "What can graph and matrix based mathematical models tell us about ergodic literature? A digraph of storylets connected by links and the corresponding adjacency matrix encoding is used to formulate some queries regarding hypertexts of this type. It is reasoned that the Google random surfer provides a useful model for the behavior of the reader of such fiction. This motivates the use of graph and Web based metrics for ranking storylets and some other tasks. A dataset, termed childif, based on printed books from three series popular with children and young adults and its characteristics are described. Two link-based metrics, SMrank and versions of PageRank, are described and applied on childif to rank storylets. It is shown that several characteristics of these stories can be expressed as and computed with matrix operations. An interpretation of the ranking results is provided. Results on some acyclic digraphs …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Symmetric Eigenvalue and Singular-Value Problems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_8",
            "Abstract": "Eigenvalue problems form the second most important class of problems in numerical linear algebra.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:yymuTJNBJz4C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Problem Solving Environments",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44681-8_127",
            "Abstract": "The aim of this workshop was to address multiple aspects of research on problem solving environments (PSEs), including design and implementation issues, exploitation of enabling technologies, applications, and education issues. A PSE is a complete, integrated computing environment for composing, compiling, and running applications in a specific area. A PSE may also incorporate many features of an expert system and can assist users in formulating problems, running the problem on an appropriate platform, and viewing and analyzing results. In addition, a PSE may have access to virtual libraries, knowledge repositories, sophisticated execution control systems, and visualization environments. The uses of PSEs include modeling and simulation, decision support, design optimization, and industrial process management.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Proceedings of NUMAN 2007 Conference: Recent Approaches to Numerical Analysis: Theory, Methods and Applications Preface",
            "Publication year": 2009,
            "Publication url": "https://ir.lib.uth.gr/xmlui/handle/11615/27634",
            "Abstract": "Special Issue: Proceedings of NUMAN 2007 Conference: Recent Approaches to Numerical \nAnalysis: Theory, Methods and Applications Preface Toggle navigation English Ελληνικά \nDeutsch français italiano español Ελληνικά English Ελληνικά Deutsch français italiano español \nΣύνδεση Toggle navigation Προβολή τεκμηρίου Ιδρυματικό Αποθετήριο Πανεπιστημίου \nΘεσσαλίας Επιστημονικές Δημοσιεύσεις Μελών ΠΘ (ΕΔΠΘ) Δημοσιεύσεις σε περιοδικά, συνέδρια, \nκεφάλαια βιβλίων κλπ. Προβολή τεκμηρίου Ιδρυματικό Αποθετήριο Πανεπιστημίου Θεσσαλίας \nΕπιστημονικές Δημοσιεύσεις Μελών ΠΘ (ΕΔΠΘ) Δημοσιεύσεις σε περιοδικά, συνέδρια, κεφάλαια \nβιβλίων κλπ. Προβολή τεκμηρίου Όλο το DSpace Κοινότητες & Συλλογές Ανά ημερομηνία \nδημοσίευσης Συγγραφείς Τίτλοι Λέξεις κλειδιά Special Issue: Proceedings of NUMAN 2007 \nConference: Recent Approaches to Numerical Analysis: Theory, Methods and Applications , E.…",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:3oYmN_DgFiMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Implicitly Restarted Lanczos Bidiagonalization Method for Computing Smallest Singular Triplets",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.210.3386&rep=rep1&type=pdf",
            "Abstract": "We describe the development of a method for the efficient computation of the smallest singular values and corresponding vectors for large sparse matrices [4]. The method combines state-of-the-art techniques that make it a useful computational tool appropriate for large scale computations. The method relies upon Lanczos bidiagonalization (LBD) with partial reorthogonalization [6], enhanced with implicit restarts and harmonic Ritz values. We note that although LBD has been successfully used for the approximation of largest singular values [5], our target in this paper is the computation of the smallest singular values. Thus, in order to design a matrix free method by avoiding shift-and-invert techniques we rely on harmonic Ritz values.Using LBD for the approximation of the smallest singular values often causes the lengths of the Lanczos bases to become quite large in order to obtain accurate approximations. For that reason, we embed an implicit restarting mechanism in LBD [12], which maintains memory requirements constant at each restart. In order to avoid the explicit inversion of A, we employ a harmonic Ritz value shift strategy [10, 9]. Harmonic Ritz values and vectors have been reported (see eg [8]) to be",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CLSI: A flexible approximation scheme from clustered term-document matrices",
            "Publication year": 2005,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611972757.75",
            "Abstract": "We investigate a methodology for matrix approximation and IR. A central feature of these techniques is an initial clustering phase on the columns of the term-document matrix, followed by partial svd on the columns constituting each cluster. The extracted information is used to build effective low rank approximations to the original matrix as well as for IR. The algorithms can be expressed by means of rank reduction formulas. Experiments indicate that these methods can achieve good overall performance for matrix approximation and IR and compete well with existing schemes.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallelism in Matrix Computations",
            "Publication year": 2016,
            "Publication url": "https://hal.inria.fr/hal-01257695/",
            "Abstract": "Parallelism in Matrix Computations - Inria Accéder directement au contenu Accéder directement \nà la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails \nAURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation \nSciencesconf.org Support HAL-Inria Les publications, logiciels... des scientifiques Inria \nAccueil Déposer Consulter tout HAL par date de publication/rédaction par domaine par type \nde publication par collection arXiv les derniers dépôts Publications Inria Recherche Services \nHalTools : créer sa page web Haltools : export RAWEB X2Hal : import par lot Consulter les \nstructures de recherche connues de HAL Documentation Aide en ligne de HAL V3 Dernières \névolutions de HAL V3 Documentation API HAL Ajouter des vignettes Aide en ligne Haltools \nAide en ligne de X2hal OpenAccess Inria soutient la science ouverte hal-01257695, version …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:P5iVsrg4GywC",
            "Publisher": "Springer"
        },
        {
            "Title": "Tensor Based Text Representation: A new Dimension in IR",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/41738130/MMDS2006-poster.pdf",
            "Abstract": "We investigate the basics of and experiment with a tensor based document representation in Information Retrieval. Most documents have an inherent hierarchical structure that renders desirable the use of flexible multidimensional representations such as those offered by tensor objects. We focus on the performance of special instances of a Tensor Model, in which documents are represented using second-order (matrices) and third-order tensors. We exploit the local-structure encapsulated by the proposed representation to approximate these tensors using high order singular value and nonnegative tensor decompositions and assemble the results to form the final term-document matrix. We analyze the spectral properties of this matrix and observe that topic identification is enhanced by deploying k-plane clustering. Our results provide evidence that tensor based models can be particularly effective for IR, offering an excellent alternative to traditional VSM and LSI especially for text collections of multi-topic documents.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:NaGl4SEjCO4C",
            "Publisher": "MMDS"
        },
        {
            "Title": "Accelerating data uncertainty quantification by solving linear systems with multiple right-hand sides",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11075-012-9687-2.pdf",
            "Abstract": "The subject of this work is accelerating data uncertainty quantification. In particular, we are interested in expediting the stochastic estimation of the diagonal of the inverse covariance (precision) matrix that holds a wealth of information concerning the quality of data collections, especially when the matrices are symmetric positive definite and dense. Schemes built on direct methods incur a prohibitive cubic cost. Recently proposed iterative methods can remedy this but the overall cost is raised again as the convergence of stochastic estimators can be slow. The motivation behind our approach stems from the fact that the computational bottleneck in stochastic estimation is the application of the precision matrix on a set of appropriately selected vectors. The proposed method combines block conjugate gradient with a block-seed approach for multiple right-hand sides, taking advantage of the nature of the right …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:eflP2zaiRacC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Computing the Matrix Pseudospectrum",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_13",
            "Abstract": "The -pseudospectrum, , of a square matrix (pseudospectrum for short) is the locus of eigenvalues of  for all possible E such that.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:Oi-j_DTgP3cC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Large Symmetric Eigenvalue Problems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_11",
            "Abstract": "In this chapter we consider the following problems.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:zuN7wi50mysC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Agrawal, G., see Ferreira, R. 725",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/48611307/A_component-based_approach_to_build_a_po20160906-13076-1q3hfxr.pdf",
            "Abstract": "Chen, W.-Y., see Lee, P.-Z. 1329 Chervenak, AL, see Allcock, B. 749 Chiu, G.-M., see Chang, H.-H. 133 Choi, H.-I., see Tarkov, MS 1239 Choi, J., see Tarkov, MS 1239 Christiaens, M., M. Ronsse and K. De Bosschere, Bounding the number of segment histories during data race detection 1221",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Asynchronous computation of PageRank computation in an interactive multithreading environment",
            "Publication year": 2007,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2007/1065/",
            "Abstract": "Numerical Linear Algebra has become almost indispensable in Web Information Retrieval. In this presentation we suggest that the asynchronous computation model is an attractive paradigm for organizing concurrent computations spanning data on Web scale. This suggestion is supported by experiments which highlight some interesting characteristics of this model as applied to'page ranking'methods. After an introduction on asynchronous computing in general and'page ranking'in particular, we present results from the asynchronous compution of PageRank using typical combinations of execution units (processes, threads) and communication mechanisms (message passing, shared memory). Sound convergence properties predicted by theory are numerically verified and interesting patterns of behavior are unveiled. Our experiments were performed on Jylab, an evolving environment enabling interactive multithreading and multiprocessing computations. This work is supported by a Pythagoras-EPEAEK-II grant and is conducted in collaboration with Daniel Szyld.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "NUMAN 2008 Preface",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=15127273642649957563&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:tai-Ft5GzhwC",
            "Publisher": "ELSEVIER SCIENCE BV"
        },
        {
            "Title": "A PSE Bibliography",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-4541-5_29",
            "Abstract": "As the reader would have discovered by now, the field of PSEs is sufficiently wide and open to make it impractical to compile and print a comprehensive bibliography that would be restricted to any reasonable page limits. Paraphrasing Jonathon Green4, the nature of bibliography compilation, whether in fonn or content, brings with it decisions, and with decisions, however disinterested, comes choice. In this choice, it is hard to avoid bringing in our own biases but we hope that they had only minimal effect on this compilation.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Oriented k-windows: A PCA driven clustering method",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-33880-2_32",
            "Abstract": "In this paper we present the application of Principal Component Analysis (PCA) on subsets of the dataset to better approximate clusters. We focus on a specific density-based clustering algorithm, k-Windows, that holds particular promise for problems of moderate dimensionality. We show that the resulting algorithm, we call Oriented k-Windows (OkW), is able to steer the clustering procedure by effectively capturing several coexisting clusters of different orientation. OkW combines techniques from computational geometry and numerical linear algebra and appears to be particularly effective when applied on difficult datasets of moderate dimensionality.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Parallel numerical computing from Illiac IV to exascale—The contributions of Ahmed H. Sameh",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4471-2437-5_1",
            "Abstract": "As exascale computing is looming on the horizon while multicore and GPU’s are routinely used, we survey the achievements of Ahmed H. Sameh, a pioneer in parallel matrix algorithms. Studying his contributions since the days of Illiac IV as well as the work that he directed and inspired in the building of the Cedar multiprocessor and his recent research unfolds a useful historical perspective in the field of parallel scientific computing.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "On a block approach for approximating selected elements of the matrix inverse",
            "Publication year": 2018,
            "Publication url": "http://nasca18.math.uoa.gr/fileadmin/nasca18.math.uoa.gr/uploads/talks/talk_Vasileios_Georgiou.pdf",
            "Abstract": "A block approach for approximating selected elements of the matrix inverse Page 1 A block \napproach for approximating selected elements of the matrix inverse Vasilis Georgiou, Efstratios \nGallopoulos Computer Engineering and Informatics Departement University of Patras July 3, \n2018 V. Georgiou, E. Gallopoulos (Computer Engineering and Informatics Departement \nUniversity of Patras) A block approach for approximating selected elements of the matrix inverse \nJuly 3, 2018 1 / 34 Page 2 1 Introduction 2 Extracting diagonal elements 3 Approximating \ndiagonal blocks 4 Numerical experiments 5 Conclusions V. Georgiou, E. Gallopoulos \n(Computer Engineering and Informatics Departement University of Patras) A block approach for \napproximating selected elements of the matrix inverse July 3, 2018 2 / 34 Page 3 1 Introduction \n2 Extracting diagonal elements 3 Approximating diagonal blocks 4 Numerical experiments 5 . …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:LHtfzE5_5AIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallelism in matrix computations",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-94-017-7188-7.pdf",
            "Abstract": "Computing instruments were developed to facilitate fast calculations, especially in computational science and engineering applications. The fact that this is not just a matter of building a hardware device and its system software, was already hinted to by Charles Babbage, when he wrote in the mid-nineteenth century, As soon as an",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:MDBbo4b0KHEC",
            "Publisher": "Springer"
        },
        {
            "Title": "Towards the implementation of wind turbine simulations on many-core systems",
            "Publication year": 2015,
            "Publication url": "https://arc.aiaa.org/doi/pdf/10.2514/6.2015-0050",
            "Abstract": "We are concerned with alternative approaches to accelerate the matrix construction step that is a computationally intensive portion of the Finite Element Method (FEM) framework. Our target application is part of a wind turbine simulation tool-chain modeled using the Navier-Stokes equations for incompressible flow and discretized with the discontinuous Galerkin (DG) finite element method and implicit time-stepping. The Poisson pressure correction equation and the structural part of the fluid-structure interaction are formulated and solved numerically in the continuous Galerkin framework. The construction of the required matrix is performed by exploiting multiple Graphics Processing Units of a cluster, using the CUDA programming model. The performance results indicate that our approach scales well as more nodes of the cluster, as well as more GPUs within each node are exploited.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:SQZOXlr1FBsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cobra: Parallel path following for computing the matrix pseudospectrum",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167819101001211",
            "Abstract": "The construction of an accurate approximation of the ϵ-pseudospectrum of a matrix by means of the standard grid method is a very demanding computational task. In this paper, we describe Cobra, a domain-based method for the computation of pseudospectra that combines predictor corrector path following with a one-dimensional grid. The algorithm offers large and medium grain parallelism and becomes particularly attractive when we seek fine resolution of the pseudospectrum boundary. We implement Cobra using standard LAPACK components and show that it is more robust than the existing path following technique and faster than it and the traditional grid method. Cobra is also combined with a partial SVD algorithm to produce an effective parallel method for computing the matrix pseudospectrum.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:ufrVoPGSRksC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Jylab Meets Eclipse: Integrating PSEs with Multicomponent Platforms",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=14207814182561333364&hl=en&oi=scholarr",
            "Abstract": "Jylab is a recent PSE architecture emphasizing portable computing over distributed platforms. It captures the idea of reusing some of the best open source software projects' functionality within the context of a single, net-aware, interactive environment. The original implementation of this idea resulted in a system built around a portable interpreter supported by a carefully selected suite of libraries spanning a comprehensive set of applications including scripting, numerical linear algebra, distributed/Grid computing and Internet algorithmics. Because Jylab is a multicomponent PSE system, it is quite natural to base its implementation on a robust platform automating the management of complex stacks of software components, ie self-describing objects. The Eclipse Platform meets this basic prerequisite, additionally providing many other interesting integration facilities, an extensive set of ready-to-use plug-ins and is also …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:YvgfBAebZEkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SVD based initialization: A head start for nonnegative matrix factorization",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320307004359",
            "Abstract": "We describe Nonnegative Double Singular Value Decomposition (NNDSVD), a new method designed to enhance the initialization stage of nonnegative matrix factorization (NMF). NNDSVD can readily be combined with existing NMF algorithms. The basic algorithm contains no randomization and is based on two SVD processes, one approximating the data matrix, the other approximating positive sections of the resulting partial SVD factors utilizing an algebraic property of unit rank matrices. Simple practical variants for NMF with dense factors are described. NNDSVD is also well suited to initialize NMF algorithms with sparse factors. Many numerical examples suggest that NNDSVD leads to rapid reduction of the approximation error of many NMF algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Computing symmetric nonnegative rank factorizations",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0024379511002199",
            "Abstract": "An algorithm is described for the nonnegative rank factorization (NRF) of some completely positive (CP) matrices whose rank is equal to their CP-rank. The algorithm can compute the symmetric NRF of any nonnegative symmetric rank-r matrix that contains a diagonal principal submatrix of that rank and size with leading cost O (rm 2) operations in the dense case. The algorithm is based on geometric considerations and is easy to implement. The implications for matrix graphs are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:EUQCXRtRnyEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Preconditioners",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_10",
            "Abstract": "In order to make iterative methods effective or even convergent it is frequently necessary to combine them with an appropriate preconditioning scheme; cf. [1–5].",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:Rj7SuZOA3CsC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Iterative Schemes for Large Linear Systems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_9",
            "Abstract": "Sparse linear systems occur in a multitude of applications in computational science and engineering. While the need for solving such linear systems is most prevalent in numerical simulations using mathematical models based on differential equations, it also arises in other areas. For example, the PageRank vector that was used by Google to order the nodes of a network based on its link structure can be interpreted as the solution of a linear system of order equal to the number of nodes (Brin and Page, The anatomy of a large-scale hypertextual web search engine. In: Proceedings of 7th Intnational Conference World Wide Web, (1998), Langville and Meyer, Google’s PageRank and Beyond: The Science of Search Engine Rankings, (2006) [1, 2]). The system can be very large and sparse so that parallel iterative methods become necessary; see e.g. (Gleich et al. Fast parallel pagerank: a linear system …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:4DpXlaHga4wC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Surfing the network for ranking by multidamping",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6412669/",
            "Abstract": "PageRank is one of the most commonly used techniques for ranking nodes in a network. It is a special case of a family of link-based rankings, commonly referred to as functional rankings. Functional rankings are computed as power series of a stochastic matrix derived from the adjacency matrix of the graph. This general formulation of functional rankings enables their use in diverse applications, ranging from traditional search applications to identification of spam and outliers in networks. This paper presents a novel algorithmic (re)formulation of commonly used functional rankings, such as LinearRank, TotalRank and Generalized Hyperbolic Rank. These rankings can be approximated by finite series representations. We prove that polynomials of stochastic matrices can be expressed as products of Google matrices (matrices having the form used in Google's original PageRank formulation). Individual matrices in …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recurrences and Triangular Systems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-7188-7_3",
            "Abstract": "A recurrence relation is a rule that defines each element of a sequence in terms of the preceding elements; it forms one of the most basic tools in discrete and computational mathematics with myriad applications in scientific computing, ranging from numerical linear algebra, the numerical solution of ordinary and partial differential equations and orthogonal polynomials, to dependence analysis in restructuring compilers and logic design. In fact, almost every computational task relies on recursive techniques and hence involves recurrence relations. Therefore, recurrence solvers are computational kernels and need to be implemented as efficient primitives on various architectures. Throughout this book we will encounter many linear and nonlinear recurrences that can be solved using techniques from this chapter. Linear recurrences can usually be expressed in the form of mostly banded lower triangular linear …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:lAfYOIClFDQC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Design Issues in a Matlab-Based Environment for Numerical Program Development",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-4541-5_25",
            "Abstract": "We describe some design considerations related to the development of environments to support scientific computing. The context is FALCON, an environment based on MATLAB and supporting an algebraic language combined with a compiler and transformation system to provide the developer the freedom of algorithm representation and reduced development time. The system includes both traditional compiler techniques and other transformations that utilize algebraic information about the operations performed and target libraries in which they are implemented.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Estimating the trace of the matrix inverse by interpolating from the diagonal of an approximate inverse",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0021999116304120",
            "Abstract": "A number of applications require the computation of the trace of a matrix that is implicitly available through a function. A common example of a function is the inverse of a large, sparse matrix, which is the focus of this paper. When the evaluation of the function is expensive, the task is computationally challenging because the standard approach is based on a Monte Carlo method which converges slowly. We present a different approach that exploits the pattern correlation, if present, between the diagonal of the inverse of the matrix and the diagonal of some approximate inverse that can be computed inexpensively. We leverage various sampling and fitting techniques to fit the diagonal of the approximation to the diagonal of the inverse. Depending on the quality of the approximate inverse, our method may serve as a standalone kernel for providing a fast trace estimate with a small number of samples. Furthermore, the …",
            "Abstract entirety": 0,
            "Author pub id": "WhMzaJwAAAAJ:7N_8t4gx0K8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Linear and non-linear dimensional reduction via class representatives for text classification",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4053174/",
            "Abstract": "We address the problem of building fast and effective text classification tools. We describe a \"representatives methodology\" related to feature extraction and illustrate its performance using as vehicles a centroid based method and a method based on clustered LSI that were recently proposed as useful tools for low rank matrix approximation and cost effective alternatives to LSI. The methodology is very flexible, providing the means for accelerating existing algorithms. It is also combined with kernel techniques to enable the analysis of data for which linear techniques are insufficient. Numerous classification examples indicate that the proposed technique is effective and efficient with an overall performance superior than existing linear and nonlinear LSI-based approaches.",
            "Abstract entirety": 1,
            "Author pub id": "WhMzaJwAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        }
    ]
}]