[{
    "name": "Ευαγγελία Πιτουρά",
    "romanize name": "Evangelia Pitoura",
    "School-Department": "Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής",
    "University": "uoi",
    "Rank": "Καθηγητής",
    "Apella_id": 4652,
    "Scholar name": "Evaggelia Pitoura",
    "Scholar id": "3r_xVvkAAAAJ",
    "Affiliation": "University of Ioannina, Greece",
    "Citedby": 7559,
    "Interests": [
        "Data management"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=3r_xVvkAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "ReDRIVE: result-driven database exploration through recommendations",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2063576.2063798",
            "Abstract": "Typically, users interact with database systems by formulating queries. However, many times users do not have a clear understanding of their information needs or the exact content of the database, thus, their queries are of an exploratory nature. In this paper, we propose assisting users in database exploration by recommending to them additional items that are highly related with the items in the result of their original query. Such items are computed based on the most interesting sets of attribute values (or faSets) that appear in the result of the original user query. The interestingness of a faSet is defined based on its frequency both in the query result and in the database instance. Database frequency estimations rely on a novel approach that employs an e-tolerance closed rare faSets representation. We report evaluation results of the efficiency and effectiveness of our approach on both real and synthetic datasets.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data lockers: Mobile-agent based middleware for the security and availability of roaming users data",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/10722620_26",
            "Abstract": "Accessing remote data anywhere and at anytime constitutes an important advantage in many business environments. However, when working with mobile devices, users face many problems related to: (1) device restrictions: mobile devices are resource-constrained, more vulnerable and fragile than stationary devices (devise exposure problems) and, (2) the communication media: wireless communications are often unstable, asymmetric and expensive (media problems). To alleviate these problems, we present a service, the Lockers Rent Service, for keeping the data of mobile users in a secure and safe space in a proxy at the fixed network, thus providing a solution to the device exposure problems. Data stored in data lockers are available even when the mobile device is disconnected. Furthermore, specific tasks are carried out at the fixed network on behalf of the mobile user, in this way relieving the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Query Processing.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=4829798898934017233&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A scalable mobile agent location mechanism",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.81.3364&rep=rep1&type=pdf",
            "Abstract": "In this paper, we propose a novel mobile agent tracking mechanism based on hashing. To allow our system to adapt to variable workloads, dynamic rehashing is supported. The proposed mechanism scales well with both the number of agents and the number of moving and querying operations. We also report on its implementation in the Aglets platform and present performance results.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fairness-aware Methods in Rankings and Recommenders",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9474897/",
            "Abstract": "We increasingly depend on a variety of data-driven algorithmic systems to assist us in many aspects of life. Search engines and recommender systems amongst others are used as sources of information and to help us in making all sort of decisions from selecting restaurants and books, to choosing friends and careers. This has given rise to important concerns regarding the fairness of such systems. In this tutorial, we aim at presenting a toolkit of methods used for ensuring fairness in rankings and recommendations. Our objectives are two-fold: (a) to present related methods of this novel, quickly evolving and impactful domain, and put them into perspective, and (b) to highlight open challenges and research paths for future work.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:j7_hQOaDUrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Overlay Networks and Query Processing: A Survey",
            "Publication year": 2006,
            "Publication url": "http://eprints.lib.uom.gr/226/",
            "Abstract": "In a peer-to-peer system, a lar g e number of no d es share d ata w ith each other. The participation of no d es is hi g hly d ynamic, no d es may enter an d leave the system at w ill. Since, it is not possible to maintain lin k s w ith all no d es, for performance as w ell as for privacy an d anonymity reasons, each no d e maintains lin k s w ith a selecte d subset of other no d es, thus formin g an overlay network. A messa g e bet w een any t w o no d es in the p2p system is route d throu g h the overlay net w or k. The overlay net w or k is built on top of the physical one. Thus, t w o no d es that are nei g hbors in the overlay net w or k may be many lin k s apart in the physical net w or k.The overlay net w or k is built to facilitate the operation of a p2p system. In d ata sharin g p2p systems, a basic functionality is d iscoverin g the d ata of interest. A loo k-up q uery for d ata items may be pose d at any no d e in the overlay. The q uery is then route d throu g h the overlay to e ffi ciently d iscover the no d es in the p2p system that hol d the d ata items re q ueste d. Such q uery routin g must be achieve d by contactin g as\" small\" a number of no d es in the overlay as possible an d by maintainin g as\" little\" state information at each overlay no d e as possible.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Technical Report TR2006-08, Computer Science Department, University of Ioannina"
        },
        {
            "Title": "Selecting shortcuts for a smaller world",
            "Publication year": 2015,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611974010.4",
            "Abstract": "The small world phenomenon is a desirable property of social networks, since it guarantees short paths between the nodes of the social graph and thus efficient information spread on the network. It is thus in the benefit of both network users and network owners to enforce and maintain this property. In this work, we study the problem of finding a subset of k edges from a set of candidate edges whose addition to a network leads to the greatest reduction in its average shortest path length. We formulate the problem as a combinatorial optimization problem, and show that it is NP-hard and that known approximation techniques are not applicable. We describe an efficient method for computing the exact effect of a single edge insertion on the average shortest path length, as well as several heuristics for efficiently estimating this effect. We perform experiments on real data to study the performance of our algorithms in practice.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Recall-based cluster reformulation by selfish peers",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4498317/",
            "Abstract": "Recently, clustered overlays in which peers are grouped based on the similarity of their content or interests have been proposed to improve performance in peer-to-peer systems. Since such systems are highly dynamic, the overlay network needs to be updated frequently to cope with changes. In this paper, we introduce an approach for updating a clustered overlay based on local decisions made by individual peers. We model the cluster-reformulation problem as a game where peers determine their cluster membership based on potential gains in the recall of their queries. We also define global criteria for the overall quality of the system and propose strategies for peer relocation that consider different behavioral patterns for the peers. Our preliminary experimental evaluation shows that our strategies cope well with changes in the overlay network.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fairness-Aware PageRank",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3442381.3450065",
            "Abstract": "Algorithmic fairness has attracted significant attention in the past years. In this paper, we consider fairness for link analysis and in particular for the celebrated Pagerank algorithm. Given that the nodes in a network belong to groups (for example, based on demographic or other characteristics), we provide a parity-based definition of fairness that imposes constraints on the proportion of Pagerank allocated to the members of each group. We propose two families of fair Pagerank algorithms: the first (Fairness-Sensitive Pagerank) modifies the jump vector of the Pagerank algorithm to enforce fairness; the second (Locally Fair Pagerank) imposes a fair behavior per node. We then define a stronger fairness requirement, termed universal personalized fairness, that asks that the derived personalized pageranks of all nodes are fair. We prove that the locally fair algorithms achieve also universal personalized fairness, and …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:MpfHP-DdYjUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pervasive computing and communications",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=2123525237833039339&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:KUbvn5osdkgC",
            "Publisher": "KLUWER ACADEMIC PUBL"
        },
        {
            "Title": "Intersocialdb: An infrastructure for managing social data",
            "Publication year": 2012,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.463.7778&rep=rep1&type=pdf",
            "Abstract": "Social Data is not in any unified structured format▪ Tweets are augmented with links, hashtags etc▪ Facebook pages contain images, videos etc▪ Foursquare stores check-ins of venues",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "04441 Abstracts Collection--Mobile Information Management",
            "Publication year": 2005,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2005/258/",
            "Abstract": "From 24.10. 04 to 29.10. 04, the Dagstuhl Seminar 04441``Mobile Information Management''was held in the International Conference and Research Center (IBFI), Schloss Dagstuhl. During the seminar, several participants presented their current research, and ongoing work and open problems were discussed. Abstracts of the presentations given during the seminar as well as abstracts of seminar results and ideas are put together in this paper. The first section describes the seminar topics and goals in general. Links to extended abstracts or full papers are provided, if available.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "16. MDM 2015: Pittsburgh, PA, USA-Volume 2",
            "Publication year": 2015,
            "Publication url": "https://vbn.aau.dk/en/publications/16-mdm-2015-pittsburgh-pa-usa-volume-2",
            "Abstract": "16. MDM 2015: Pittsburgh, PA, USA - Volume 2 — Aalborg University's Research Portal Skip \nto main navigation Skip to search Skip to main content Aalborg University's Research Portal \nLogo Dansk English Home Profiles Projects Publications Activities Research Units Facilities \nPress / Media Prizes Datasets Impacts Search by keywords, name or affiliation 16. MDM \n2015: Pittsburgh, PA, USA - Volume 2 Christian Søndergaard Jensen (Editor), Xing Xie \n(Editor), Vladimir Zadorozhny (Editor), Sanjay Madria (Editor), Evaggelia Pitoura (Editor), \nBaihua Zheng (Editor), Chi-Yin Chow (Editor) Department of Computer Science CITS Daisy - \nCenter for Data-intensive Systems Research output: Contribution to book/anthology/report/conference \nproceeding › Conference abstract in proceeding › Research › peer-review Overview Original \nlanguage English Title of host publication 16. MDM 2015: Pittsburgh, PA, USA - Volume 2 2 () /…",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:zCSUwVk65WsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context in Databases",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=8374778178853138561&hl=en&oi=scholarr",
            "Abstract": "A context-aware system is a system that uses context to provide relevant information or services to its users. While, there has been a variety of context middleware infrastructures and context-aware applications, little work has been done in integrating context into database management systems. In this paper, we first exploit the various parameters of context and provide a characterization of context quality. Then, we present a classification of context-aware applications and their characteristics. Finally, we propose various ways of integrating context into a database system.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Query workload-aware overlay construction using histograms",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1099554.1099717",
            "Abstract": "Peer-to-peer (p2p) systems over an efficient means of data sharing among a dynamically changing set of a large number of a tonomous nodes. Each node in a p2p system is connected with a small number of other nodes thus creating an overlay network of nodes. A query posed at a node is routed through the overlay network towards nodes hosting data items that satisfy it. In this paper, we consider building overlays that exploit the query workload so that nodes are clustered based on their results to a given query workload. The motivation is to create overlays where nodes that match a large number of similar queries are a fewlinks apart. Query frequency is also taken into account so that popular queries have a greater effect on the formation of the overlay than unpopular ones. We focus on range selection queries and se histograms to estimate the query results of each node. Then, nodes are clustered based on the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Diversity in big data: A review",
            "Publication year": 2017,
            "Publication url": "https://www.liebertpub.com/doi/abs/10.1089/big.2016.0054",
            "Abstract": "Big data technology offers unprecedented opportunities to society as a whole and also to its individual members. At the same time, this technology poses significant risks to those it overlooks. In this article, we give an overview of recent technical work on diversity, particularly in selection tasks, discuss connections between diversity and fairness, and identify promising directions for future work that will position diversity as an important component of a data-responsible society. We argue that diversity should come to the forefront of our discourse, for reasons that are both ethical—to mitigate the risks of exclusion—and utilitarian, to enable more powerful, accurate, and engaging data analysis and use.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:Ehil0879vHcC",
            "Publisher": "Mary Ann Liebert, Inc."
        },
        {
            "Title": "Distributed Approximate XPath Processing",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=10578285716180889780&hl=en&oi=scholarr",
            "Abstract": "Supporting top-fe queries over distributed collections of schemaless XML data poses two challenges. While XML supports expressive query languages such as XPath and XQuery, these languages require the user to know the schema of the data so as to write an appropriate query which may not be feasible in distributed systems with autonomous and dynamic sources. Thus, there is a need for supporting approximate query processing. Furthermore, retrieving the top-fe most relevant results in a distributed system incurs large communication and processing cost, since partial result lists from a number of different sites need to be combined and ranked to assembly the top-fc answers. To address both of these issues, we present an approach for approximate XPath processing over distributed collections of XML documents that relies on the use of a clustered path index, where documents are grouped based on structural …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:2osOgNQ5qMEC",
            "Publisher": "DCS"
        },
        {
            "Title": "Finding lasting dense subgraphs",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s10618-018-0602-x",
            "Abstract": "Graphs form a natural model for relationships and interactions between entities, for example, between people in social and cooperation networks, servers in computer networks, or tags and words in documents and tweets. But, which of these relationships or interactions are the most lasting ones? In this paper, we study the following problem: given a set of graph snapshots, which may correspond to the state of an evolving graph at different time instances, identify the set of nodes that are the most densely connected in all snapshots. We call this problem the Best Friends Forever () problem. We provide definitions for density over multiple graph snapshots, that capture different semantics of connectedness over time, and we study the corresponding variants of the  problem. We then look at the On–Off () problem that relaxes the requirement of nodes being connected in all snapshots, and asks for the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:yMeIxYmEMEAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "You May Also Like Results in Relational Databases",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.444.7518&rep=rep1&type=pdf",
            "Abstract": "In this position paper, we consider extending relational database systems with a recommendation functionality. In particular, we propose that, along with the results of each query, the user gets additional recommended results that we call “You May Also Like” or Ymal results. We discuss a suite of different approaches to computing Ymal results and exploit one that uses only the database content and the query results. Some preliminary evaluation results are also provided.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Partial view selection for evolving social graphs",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2484425.2484434",
            "Abstract": "In this paper, we deal with the problem of historical query evaluation over evolving social graphs. Historical queries are queries about the social graph in the past. The straightforward way of executing such a query is by first reconstructing the whole social graph at the given time instance or interval, and then, evaluating the query on the reconstructed graph. Since social graphs are large, the cost of a complete graph snapshot reconstruction would dominate the cost of historical query execution. Given that many queries are user-centric, ie, node-centric queries that require access only of a targeted subgraph, we propose deploying partial view instead of full snapshot construction and define conditions that determine when a partial view can be used to evaluate a query. We also propose using a cache of partial views to further reduce the query evaluation cost, and show how partial views can be extended to new views …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiversion data broadcast",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1039848/",
            "Abstract": "Recently, broadcasting has attracted considerable attention as a means of disseminating information to large client populations in both wired and wireless settings. In this paper, we consider broadcasting multiple versions of data items to increase the concurrency of client transactions in the presence of updates. We introduce various techniques for organizing multiple versions on the broadcast channel. Performance results show that the overhead of supporting multiple versions can be kept low while providing a considerable increase in concurrency. Besides increasing the concurrency of client transactions, multiversion broadcast provides clients with the possibility of accessing multiple server states in a single broadcast cycle. Furthermore, multiversioning increases the tolerance of client transactions of disconnections from the broadcast channel.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Time Traveling in Graphs using a Graph Database.",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Semertzidis/publication/303764139_Time_Traveling_in_Graphs_using_a_Graph_Database/links/57513cc808ae6807faf95164/Time-Traveling-in-Graphs-using-a-Graph-Database.pdf",
            "Abstract": "Most graph structured data, such as data created from the web, social, citation and computer networks, evolve over time. In this paper, we assume that we are given the history of a graph in the form of a sequence of graph snapshots. Our goal is to define the different types of queries that one can ask regarding the graph history and present an initial approach to storing graph snapshots and processing historical queries in a native graph database. We define three general types of historical queries, namely, historical graph queries, historical time queries and historical top-k queries. We present two representations of graph snapshots that use either a single or a multi-edge approach. We evaluate the two approaches experimentally for various types of historical reachability queries.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:9c2xU6iGI7YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Query Rewriting.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=9573883214871165528&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Mobile-Agent Based Infrastructure for eWork and eBussiness Applications",
            "Publication year": 2000,
            "Publication url": "http://cs.uoi.gr/~pitoura/distribution/ec.doc",
            "Abstract": "Mobile agents have emerged as a very promising approach for eWork and eBussiness. We have developed an extensive mobile agent infrastructure that supports diverse applications in these fields. Our infrastructure is built around two basic components: a mobile-agent based framework for distributed database access and the PaCMAn (Parallel Computing with Java Mobile Agents) metacomputer. The major functionality of our database framework includes (a) the ability to dynamically create personalized views for the mobile client,(b) dynamic creation and configuration of Web-based warehouses and (c) dynamic support of mobile transactions. PaCMAn offers the necessary tools for Web-based distributed High Performance Computing (HPC) and distributed data mining. Our infrastructure provides the basis for developing eWork applications in many fields. We have utilized it for applications, both wireless and wireline, such as: Electronic commerce, Health Telematics, Teleworking, Distributed Data-mining and Web-based supercomputing.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A game-theoretic approach to the formation of clustered overlay networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5871593/",
            "Abstract": "In many large-scale content sharing applications, participants or nodes are connected with each other based on their content or interests, thus forming clusters. In this paper, we model the formation of such clustered overlays as a strategic game, where nodes determine their cluster membership with the goal of improving the recall of their queries. We study the evolution of such overlays both theoretically and experimentally in terms of stability, optimality, load balance, and the required overhead. We show that, in general, decisions made independently by each node using only local information lead to overall cost-effective cluster configurations that are also dynamically adaptable to system updates such as churn and query or content changes.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile and External Storage Space Using Agents for Users of Mobile Devices",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=10920547365313838554&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The PaCMAn Metacomputer: parallel computing with Java mobile agents",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X00000984",
            "Abstract": "The PaCMAn (parallel computing with Java mobile agents) Metacomputer launches multiple Java mobile agents that communicate and cooperate to solve problems in parallel. Each mobile agent can travel anywhere in the Web to perform its tasks. A number of brokers/load forecasters keep track of the available resources and provide load forecast to the clients. The clients select the servers that they will utilize based on the specific resource requirements and the load forecast. The PaCMAn mobile agents are modular; the mobile shell is separated from the specific task code of the target application. To this end, we introduce the concept of TaskHandlers which are Java objects capable of implementing a particular task of the target application. TaskHandlers are dynamically assigned to PaCMAn’s mobile agents. We have developed and tested a prototype system with several applications such as parallel Web …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:xtRiw3GOFMkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "CoWSAMI: Interface-aware context gathering in ambient intelligence environments",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1574119207000740",
            "Abstract": "In this paper we present CoWSAMI, a middleware infrastructure that enables context awareness in open ambient intelligence environments, consisting of mobile users and context sources that become dynamically available as the users move from one location to another. A central requirement in such dynamic scenarios is to be able to integrate new context sources and users at run-time. CoWSAMI exploits a novel approach towards this goal. The proposed approach is based on utilizing Web services as interfaces to context sources and dynamically updatable relational views for storing, aggregating and interpreting context. Context rules are employed to provide mappings that specify how to populate context relations, with respect to the different context sources that become dynamically available. An underlying context sources discovery mechanism is utilized to maintain context information up to date as context …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Workload-aware clustering of xml peers",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.217.582&rep=rep1&type=pdf",
            "Abstract": "Peer-to-peer (p2p) systems are attracting increasing attention as an efficient means of sharing data among large, diverse and dynamic sets of users. Clustering in p2p systems aims at improving query processing performance by reducing communication costs, through placing similar data at neighboring peers. In this paper, we present a distributed procedure for p2p clustering in a system where peers share collections of XML documents. Peer clustering is based on the use of rules that associate the existence of path patterns in a peer’s data to its likelihood of belonging to a given cluster. The patterns that form the rules are selected both from the content of the peers and the query workload of the system according to their popularity. Furthermore, we describe how these rules adapt to reflect changes in the content of the peers and the local query workload of each cluster.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On Using Histograms as Routing Indexes in",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=13243707325514873762&hl=en&oi=scholarr",
            "Abstract": "Peer-to-peer systems offer an efficient means for sharing data among autonomous nodes. A central issue is locating the nodes with data matching a user query. A decentralized solution to this problem is based on using routing indexes which are data structures that describe the content of neighboring nodes. Each node uses its routing index to route a query towards those of its neighbors that provide the largest number of results. We consider using histograms as routing indexes. We describe a decentralized procedure for clustering similar nodes based on histograms. Similarity between nodes is defined based on the set of queries they match and related with the distance between their histograms. Our experimen-tal results show that using histograms to cluster similar nodes and to route queries increases the number of results returned for a given number of nodes visited.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:U4n9YNQMCAIC",
            "Publisher": "Springer"
        },
        {
            "Title": "Content-based overlay networks for XML peers based on multi-level bloom filters",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24629-9_17",
            "Abstract": "Peer-to-peer systems are gaining popularity as a means to effectively share huge, massively distributed data collections. In this paper, we consider XML peers, that is, peers that store XML documents. We show how an extension of traditional Bloom filters, called multi-level Bloom filters, can be used to route path queries in such a system. In addition, we propose building content-based overlay networks by linking together peers with similar content. The similarity of the content (i.e., the local documents) of two peers is defined based on the similarity of their filters. Our experimental results show that overlay networks built based on filter similarity are very effective in retrieving a large number of relevant documents, since peers with similar content tend to be clustered together.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Fair sequential group recommendations",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3341105.3375766",
            "Abstract": "Recommender systems have been incorporated in our everyday life; from music to health recommendations, recommender systems have enhanced the users' experience. At the same time, with the expansion of social media, it is now easier than ever to form groups of people. As such, group recommenders have become more popular. Often, we consider the interaction between a group and the recommender system as a stand-alone process; the group requests some suggestions from the system and the system answers without any considerations to past interactions. A more realistic scenario is for a system to require access to history logs, and take them into account when recommending items for a group of users. Not only what items the system previously had recommended, but also, how well were these items received by the members of the group. In this work, we propose a sequential group recommender …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:NyGDZy8z5eUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Clustered Index Approach to Distributed XPath Processing",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4497608/",
            "Abstract": "Supporting top-k queries over distributed collections of schemaless XML data poses two challenges. While XML supports expressive query languages such as XPath and XQuery, these languages require schema knowledge so as to write an appropriate query which may not be available in distributed systems with autonomous and dynamic sources. Thus, there is a need for approximate query processing. Furthermore, retrieving the top-k results incurs large communication and processing cost, since partial result lists from numerous sites need to be combined and ranked to assembly the top-k answers. To address both of these issues, we present an approach for approximate XPath processing over distributed collections of XML data based on a clustered path index, where data is grouped based on structural information. Our method gradually generalizes a query by applying a set of structural transformations to it …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fairness in Rankings and Recommendations: An Overview",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.05994",
            "Abstract": "We increasingly depend on a variety of data-driven algorithmic systems to assist us in many aspects of life. Search engines and recommender systems amongst others are used as sources of information and to help us in making all sort of decisions from selecting restaurants and books, to choosing friends and careers. This has given rise to important concerns regarding the fairness of such systems. In this work, we aim at presenting a toolkit of definitions, models and methods used for ensuring fairness in rankings and recommendations. Our objectives are three-fold: (a) to provide a solid framework on a novel, quickly evolving, and impactful domain, (b) to present related methods and put them into perspective, and (c) to highlight open challenges and research paths for future work.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:LdasjJ6CEcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ViSMA: extendible, mobile-agent based services for the materialization and maintenance of personalized and shareable Web views",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1232148/",
            "Abstract": "ViSMA (Views Supported by Mobile Agents) is a prototype set of extendible mobile-agent based services that allow the definition, materialization, maintenance and sharing of views created over remote Web-accessible databases. The system's primary goal is to support mobile clients carrying lightweight devices of various connectivity and resources such as portable computers and PDAs by being completely deployed over mobile agent technology. In this paper we propose a multi-tier architecture on which the system is built and we present the system's features, which include view mobility, shareable and personalized view creation and customizable, automated view monitoring and updating. The system has been fully implemented and tested using three alternative client types.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "04441 Executive Summary--Mobile Information Management",
            "Publication year": 2005,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2005/257/",
            "Abstract": "From October, 25th until 29th, 2004, a Dagstuhl seminar on mobile information management took place. The seminar was attended by 34 researchers from Europe and North America with backgrounds ranging from database systems, mobile information systems, geographic information systems and business informatics to wireless networks and security. The goal of the seminar was to bring together researchers, especially from the area of databases and information systems, to identify open problems and new challenges in data, service, and user management in mobile information processing environments. We are particulary interested to provide a forum for discussing the consequences of the mobility of users and devices on today's and future data management systems. The first aim of this discussions was to clearly identify these consequences. The second and more challenging aim was to determinate where existing solutions can be applied, where mobility raise truly new challenges, and which of these challenges are there to last.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "Efficient Multidimensional AkNN Query Processing in the Cloud",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-10073-9_41",
            "Abstract": "A k-nearest neighbor (kNN) query determines the k nearest points, using distance metrics, from a given location. An all k-nearest neighbor (AkNN) query constitutes a variation of a kNN query and retrieves the k nearest points for each point inside a database. Their main usage resonates in spatial databases and they consist the backbone of many location-based applications and not only. In this work, we propose a novel method for classifying multidimensional data using an AkNN algorithm in the MapReduce framework. Our approach exploits space decomposition techniques for processing the classification procedure in a parallel and distributed manner. To our knowledge, we are the first to study the kNN classification of multidimensional objects under this perspective. Through an extensive experimental evaluation we prove that our solution is efficient, robust and scalable in processing the given queries.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:rmuvC79q63oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Topic 7: Peer to Peer Computing",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-32820-6_36",
            "Abstract": "Peer-to-peer (P2P) systems enable computers to share information and other resources with their networked peers in large-scale distributed computing environments. The resulting overlay networks are inherently decentralized, selforganizing, and self-coordinating.Well-designed P2P systems should be adaptive to peer arrivals and departures, resilient to failures, tolerant to network performance variations, and scalable to huge numbers of peers (tens of thousands to millions). As P2P research becomes more mature, new challenges emerge to support complex and heterogeneous decentralized environments for sharing and managing data, resources, and knowledge with highly dynamic and unpredictable usage patterns. This topic provides a forum for researchers to present new contributions to P2P systems, technologies, middleware, and applications that address key research issues and challenges.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Diversity over continuous data",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.459.3475&rep=rep1&type=pdf",
            "Abstract": "Result diversification has recently attracted much attention as a means of increasing user satisfaction in recommendation systems and web search. In this work, we focus on achieving content diversity in the case of continuous data delivery, such as in the context of publish/subscribe systems. We define sliding-window diversity and present a suite of heuristics for its efficient computation along with some performance results.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On constructing small worlds in unstructured peer-to-peer systems",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30192-9_41",
            "Abstract": "Peer-to-peer systems have evolved as a means to share large amounts of data among autonomous nodes. A central issue in this context is locating nodes with data matching a user query. In this paper, we consider building peer-to-peer systems with small-world properties, that is, connecting the nodes to each other so that: (i) the distance between any two nodes is small and (ii) relevant nodes are connected to each other. Relevance between nodes is defined based on the probability that the two nodes match similar queries. We propose decentralized procedures for constructing small worlds based on routing indexes that describe the content of neighboring nodes. Our experimental results show that small-world peer-to-peer systems built with these procedures increase recall, that is, the percentage of relevant results returned.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:8AbLer7MMksC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "kdann+: A rapid aknn classifier for big data",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-49214-7_5",
            "Abstract": "A k-nearest neighbor (kNN) query determines the k nearest points, using distance metrics, from a given location. An all k-nearest neighbor (AkNN) query constitutes a variation of a kNN query and retrieves the k nearest points for each point inside a database. Their main usage resonates in spatial databases and they consist the backbone of many location-based applications and not only. In this work, we propose a novel method for classifying multidimensional data using an AkNN algorithm in the MapReduce framework. Our approach exploits space decomposition techniques for processing the classification procedure in a parallel and distributed manner. To our knowledge, we are the first to study the kNN classification of multidimensional objects under this perspective. Through an extensive experimental evaluation we prove that our solution is efficient, robust and scalable in processing the given queries.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Data Broadcasting, Caching, and Replication in Mobile Computing.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=14508744007659743114&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:LI9QrySNdTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fairness in package-to-group recommendations",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3038912.3052612",
            "Abstract": "Recommending packages of items to groups of users has several applications, including recommending vacation packages to groups of tourists, entertainment packages to groups of friends, or sets of courses to groups of students. In this paper, we focus on a novel aspect of package-to-group recommendations, that of fairness. Specifically, when we recommend a package to a group of people, we ask that this recommendation is fair in the sense that every group member is satisfied by a sufficient number of items in the package. We explore two definitions of fairness and show that for either definition the problem of finding the most fair package is NP-hard. We exploit the fact that our problem can be modeled as a coverage problem, and we propose greedy algorithms that find approximate solutions within reasonable time. In addition, we study two extensions of the problem, where we impose category or spatial …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:LhH-TYMQEocC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Metadata modeling in a global computing environment",
            "Publication year": 2002,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/585147.585162",
            "Abstract": "Emerging computational paradigms such as global and ubiquitous computing require some rethinking and innovative research ideas in many computer science areas. In this work, we aim at studying a mobile computing scenario from the database perspective. Given a global computing environment in which data is kept in a number of small-scale, data-charged, mobile devices that use, eg, wireless networks, for communication, we want to assess the overall data scenario. We use an example to abstract the requirements to such a computing environment and to outline the various existing types of data. Included here are some metadata proposals related to the actual data stored in the device (content data) as well as to the data necessary to the functioning of the device within the computing environment (profile data). The metadata proposals are based on well-known languages and tools such as XML, RDF, UML …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Diffusion maximization in evolving social networks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2817946.2817965",
            "Abstract": "Diffusion in social networks has been studied extensively in the past few years. Most previous work assumes that the underlying network is a static object that remains unchanged as the diffusion process progresses. However, there are several real-life networks that change dynamically over time. In this paper, we study diffusion on such evolving networks and extend the popular Independent Cascade and Linear Threshold models to account for network evolution. In particular, we introduce two natural variations, a persistent and a transient one, to capture diffusions of different types. We consider the problem of influence maximization where the goal is to select a few influential nodes to initiate a diffusion with maximum spread. We show that, surprisingly, when considering evolving networks the diffusion function is no longer submodular for the transient models, and not even monotone for the transient Independent …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:FAceZFleit8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiversion Broadcast",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=685734221397265076&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:PR6Y55bgFSsC",
            "Publisher": "extended version, Technical Report, TR-2002-11, Computer Science Dept, Univ. of Ioannina"
        },
        {
            "Title": "Identifying Bias in Name Matching Tasks.",
            "Publication year": 2019,
            "Publication url": "http://dit.unitn.it/~pavel/OM/articles/EDBT19_paper_213.pdf",
            "Abstract": "One of the applications of string similarity measures regards identifying the same entity within one or more corpora of data, also known as the problem of entity resolution. While a lot of methods have been introduced for assessing the similarity of two strings, there has not been yet a study to examine whether these methods are appropriate, in terms of effectiveness and fairness when applied to names of specific groups of individuals. In this paper, we provide extensive experimental results over a number of popular string measures which indicate that string comparison methods fall short when applied to specific groups, a fact leading to algorithmic bias against these groups. We also share some thoughts and guidelines on the way we envision, database practitioners should address such cases.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:6yz0xqPARnAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "YmalDB: a result-driven recommendation system for databases",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2452376.2452464",
            "Abstract": "To assist users in database exploration, we present the YmalDB system, a database system enhanced with a recommendation functionality. Along with the results of each user query, YmalDB computes and presents to the users additional results, called Ymal (ie,\" You May Also Like\") results, that are highly related with the results of their original query. Such results are computed using the most interesting sets of attribute values, called faSets, that appear either in the results of the original query or in the results of an appropriately expanded one. The interestingness of a faSet is based on its frequency both in the query result and in the database.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Approximate contextual preference scoring in digital libraries",
            "Publication year": 2007,
            "Publication url": "http://www.dblab.ntua.gr/persdl2007/papers/63.pdf",
            "Abstract": "The increasing availability of a wide variety of digital libraries provides a heterogeneous population of users with access to a heterogeneous collection of data. To help users find interesting items from this huge volume of available information, personalization systems allow users to directly or indirectly indicate preferences. Such preferences may depend on context, for instance, on the device used to access information. In this paper, we consider a preference model that allows users to assign interest scores to pieces of data based on context. We address the problem of locating interesting data items efficiently by exploiting some form of precomputation. To this end, instead of computing scores for all data items in all potential context states, we exploit the hierarchical nature of context attributes to identify representative context states and compute scores for them. This provides users with fast but potentially approximate results. We discuss this issue and report some preliminary results.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending the data services of mobile computers by external data lockers",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/875020/",
            "Abstract": "Although mobile computers are becoming more and more powerful, the intrinsic features of wireless communications: poor quality, limited bandwidth, continuous disconnections, expensive communications, still limit the performance delivered to mobile users. The authors present the Locker Rent Service that allows mobile users to rent a dedicated disk space, located in the fixed network, where they can store and access their data. Besides increasing the storage capacity of mobile devices, the Locker Rent Service offers to mobile users data protection, battery power savings and various communication optimizations. The service is supported by a middleware architecture that incorporates this and other services with the general goal of increasing mobile computer capabilities and performance. The architecture is based on mobile agents and offers flexibility and adaptability with a low overhead as shown by our …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Search result diversification",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1860702.1860709",
            "Abstract": "Result diversification has recently attracted much attention as a means of increasing user satisfaction in recommender systems and web search. Many different approaches have been proposed in the related literature for the diversification problem. In this paper, we survey, classify and comparatively study the various definitions, algorithms and metrics for result diversification.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:WA5NYHcadZ8C",
            "Publisher": "ACM"
        },
        {
            "Title": "Fast contextual preference scoring of database tuples",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1353343.1353387",
            "Abstract": "To provide users with only relevant data from the huge amount of available information, personalization systems utilize preferences to allow users to express their interest on specific pieces of data. Most often, user preferences vary depending on the circumstances. For instance, when with friends, users may like to watch thrillers, whereas, when with their kids, they may prefer to watch cartoons. Contextual preference systems address this challenge by supporting preferences that depend on the values of contextual attributes such as the surrounding environment, time or location. In this paper, we address the problem of finding interesting data items based on contextual preferences that assign interest scores to pieces of data based on context. To this end, we propose a number of pre-processing steps. Instead of pre-computing scores for all data items under all potential context states, we exploit the hierarchical nature …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Peer-to-peer management of XML data: issues and research challenges",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1083784.1083788",
            "Abstract": "Peer-to-peer (p2p) systems are attracting increasing attention as an efficient means of sharing data among large, diverse and dynamic sets of users. The widespread use of XML as a standard for representing and exchanging data in the Internet suggests using XML for describing data shared in a p2p system. However, sharing XML data imposes new challenges in p2p systems related to supporting advanced querying beyond simple keyword-based retrieval. In this paper, we focus on data management issues for processing XML data in a p2p setting, namely indexing, replication, clustering and query routing and processing. For each of these topics, we present the issues that arise, survey related research and highlight open research problems.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:HoB7MX3m0LUC",
            "Publisher": "ACM"
        },
        {
            "Title": "The SMart autonomous storage (SmAS) system",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/953583/",
            "Abstract": "The increasing demand for storage capacity and throughput has generated a need for storage architectures that scale their processing power with the growing size of datasets. In this paper, we give an overview of the SmAS system that employs network attached disks with processing capabilities. In the SmAS system, users can deploy and execute code at the disk. At-the-disk executed application code is written in a stream-based language that enforces code security and bounds the code's memory requirements. The SmAS disk's system software provides basic support for process scheduling and memory management. We present an initial implementation of the system and report performance results that validate our approach.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Locating Mobile Objects.",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=13536656391658746166&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:fFSKOagxvKUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A robust framework for protecting computation results of mobile agents",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=5733045321764473254&hl=en&oi=scholarr",
            "Abstract": "A data integrity solution for mobile agents is presented. The proposed scheme combines digital watermarking and digital signature to achieve the desired security requirements of strong forward integrity, truncation resilience and non-repudiation. The results computed at each hop are first watermarked and then digitally signed. When the agent returns to the home platform we verify the signature first and then extract watermark. Any tampering with the results can be determined in the verification process. We have implemented the proposed scheme with various hashing algorithms like SHA-1, SHA-256 and SHA-512 for a price comparison scenario. For digital signature we have used RSA based signature. We have applied t-test to check the significance of present results. Present experimental results suggest that it can be used in an e-commerce application.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:nVrZBo8bIpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cache updates in a peer-to-peer network of mobile agents",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1334926/",
            "Abstract": "In open multi-agent systems, agents need resources provided by other agents but they are not aware of which agents provide particular resources. We consider a peer-to-peer approach, in which each agent maintains a local cache with information about k resources, that is for each of the k resources, an agent that provides it. However, when an agent or a resource moves, cache entries become obsolete. We propose a suite of cache update policies that combine pull-based invalidation that is initiated by the agent that maintains the cache with push-based invalidation that is initiated by the agent that moves. We study and compare variations of oblivious flooding-based push/pull along with an informed push approach where each agent maintains a list of the agents that have it cached. Our experimental results indicate that a novel variation of flooding for push where a moving agent propagates its new location to …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fairness in rankings and recommenders",
            "Publication year": 2020,
            "Publication url": "https://trepo.tuni.fi/bitstream/handle/10024/130036/paper_T3_2.pdf?sequence=1",
            "Abstract": "With the growing complexity of the available online information, search engines via rankings and recommender systems come to the rescue, providing suggestions to users about items of potential interest, from movies and products to news articles and even potential friends. Such results and suggestions aim at covering the user information needs and play an important role in guiding users’ decisions and in forming their opinions. However, the same technology, if not used responsibly, may lead to discrimination, amplify potential biases in the original data, restrict transparency and strengthen unfairness. For example, consider scenarios in which models based on biased data produce results that abet violence, decrease diversity, or have an adverse impact on economic policies. While the potential benefits of rankings and recommenders are well-accepted and understood, the importance of using such systems in a fair manner has only recently attracted attention. In this tutorial, we cover recent advancements and highlight future research directions in this increasingly relevant research area.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:CaZNVDsoPx4C",
            "Publisher": "OpenProceedings. org"
        },
        {
            "Title": "Fairness in Rankings and Recommenders: Models, Methods and Research Directions",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9458629/",
            "Abstract": "We increasingly depend on a variety of data-driven algorithmic systems to assist us in many aspects of life. Search engines and recommendation systems amongst others are used as sources of information and to help us in making all sort of decisions from selecting restaurants and books, to choosing friends and careers. This has given rise to important concerns regarding the fairness of such systems. This tutorial aims at presenting a toolkit of definitions, models and methods used for ensuring fairness in rankings and recommendations. Our objectives are three-fold: (a) to provide a solid framework on a novel, quickly evolving, and impactful domain, (b) to present related methods and put them into perspective, and (c) to highlight challenges and research paths for researchers and practitioners that work in data management and applications.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:FiytvqdAVhgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Timely provisioning of mobile services in critical pervasive environments",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11575771_54",
            "Abstract": "Timeliness in conventional real-time systems is addressed by employing well-known scheduling techniques that guarantee the execution of a number of tasks within certain deadlines. However, these classical scheduling techniques do not take into account basic features that characterize today’s critical pervasive computing environments.In this paper, we revisit the issue of timeliness in the context of pervasive computing environments. We propose a middleware service that addresses the timely provisioning of services, while taking into account both the mobility of the entities that constitute pervasive computing environments and the existence of multiple alternative entities, providing semantically compatible services. Specifically, we model the overall behavior of mobile entities in terms of the entities’ lifetime. The lifetime of an entity is the duration for which the entity is present and available to …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:_Ybze24A_UAC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Broadcast data organizations and client side cache",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1203589/",
            "Abstract": "Broadcasting provides an efficient means for disseminating information in both wired and wireless setting. In this paper, we study different client side cache organizations for various types of multiversion data broadcast, i.e., data broadcast in which more than one value is broadcast per data item. Besides increasing the concurrency of client transactions, multiversion broadcast provides clients with the possibility of accessing multiple server states. For example, such a functionality is essential to support applications that require access to data sequences and have limited local memory to store the previous versions, such as in the case of sensor networks.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:N5tVd3kTz84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "04441 Working Group--Research Issues in Mobile Transactions",
            "Publication year": 2005,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2005/168/",
            "Abstract": "This document discusses three scenarios for databases with mobile clients, summarizes typical applications and requirements for each of the three scenarios, and outlines the open research issues which should be solved within each of the three scenarios. While the first scenario consists of mobile clients that are connect to a wired network, the second scenario consists of a network of mobile clients with a single-hop distance to each other but without a wired network, and the third scenario considers a network of mobile clients some of which are in multi-hop distance.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:TQgYirikUcIC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "Defining and predicting troll vulnerability in online social media",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s13278-017-0445-2",
            "Abstract": "Trolling describes a range of antisocial online behaviors that aim at disrupting the normal operation of online social networks and media. Existing approaches to combating trolling rely on human-based or automatic mechanisms for identifying trolls and troll posts. In this paper, we take a novel approach to the problem: our goal is to identify troll vulnerable posts, that is, posts that are potential targets of trolls, so as to prevent trolling before it happens. To this end, we define three natural axioms that a troll vulnerability metric must satisfy and introduce metrics that satisfy them. We then define the troll vulnerability prediction problem, where given a post we aim at predicting whether it is vulnerable to trolling. We construct models that use features from the content and the history of the post for the prediction. Our experiments with real data from Reddit demonstrate that our approach is successful in identifying a large …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:OP4eGU-M3BUC",
            "Publisher": "Springer Vienna"
        },
        {
            "Title": "Distributed Databases and Transaction Processing.",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/pdf/10.1002/9781118135617#page=227",
            "Abstract": "Mobile software agents have been used to provide an alternative way of implementing distributed applications. Mobile agents are programs that may be dispatched from a client computer and transported to a remote server computer for execution [1].Software systems built using mobile agents allow flexibility in designing applications and extensibility, since mobile agents can be launched without requiring any preinstallation besides the existence of an efficient execution platform to host agents. They support an asynchronous mode of operation, which can be useful with intermittent connectivity, as is often the case with mobile wireless computing. Mobile agents may also reduce the communication overhead by moving the computation closer to the data. Another major advantage of mobile agents is that agents can roam the network to collect information, thus offering an attractive way to discover data in unknown …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed in-memory processing of all k nearest neighbor queries",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7337428/",
            "Abstract": "A wide spectrum of Internet-scale mobile applications, ranging from social networking, gaming and entertainment to emergency response and crisis management, all require efficient and scalable All k Nearest Neighbor (AkNN) computations over millions of moving objects every few seconds to be operational. Most traditional techniques for computing AkNN queries are centralized, lacking both scalability and efficiency. Only recently, distributed techniques for shared-nothing cloud infrastructures have been proposed to achieve scalability for large datasets. These batch-oriented algorithms are sub-optimal due to inefficient data space partitioning and data replication among processing units. In this paper, we present Spitfire, a distributed algorithm that provides a scalable and high-performance AkNN processing framework. Our proposed algorithm deploys a fast load-balanced partitioning scheme along with an …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:8d8msizDQcsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rapid aknn query processing for fast classification of multidimensional data in the cloud",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1402.7063",
            "Abstract": "A -nearest neighbor (NN) query determines the  nearest points, using distance metrics, from a specific location. An all -nearest neighbor (ANN) query constitutes a variation of a NN query and retrieves the  nearest points for each point inside a database. Their main usage resonates in spatial databases and they consist the backbone of many location-based applications and not only (i.e. NN joins in databases, classification in data mining). So, it is very crucial to develop methods that answer them efficiently. In this work, we propose a novel method for classifying multidimensional data using an ANN algorithm in the MapReduce framework. Our approach exploits space decomposition techniques for processing the classification procedure in a parallel and distributed manner. To our knowledge, we are the first to study the classification of multidimensional objects under this perspective. Through an extensive experimental evaluation we prove that our solution is efficient and scalable in processing the given queries. We investigate many different perspectives that can affect the total computational cost, such as different dataset distributions, number of dimensions, growth of  value and granularity of space decomposition and prove that our system is efficient, robust and scalable.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:86PQX7AUzd4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pipelining.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=2195742012419206456&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:tuHXwOkdijsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Preference-aware publish/subscribe delivery with diversity",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1619258.1619267",
            "Abstract": "In publish/subscribe systems, users describe their interests via subscriptions and are notified whenever new interesting events become available. Typically, in such systems, all subscriptions are considered equally important. However, due to the abundance of information, users may receive overwhelming amounts of events. In this paper, we propose using a ranking mechanism based on user preferences, so that only top-ranked events are delivered to each user. Since many times top-ranked events are similar to each other, we also propose increasing the diversity of delivered events. Furthermore, we examine a number of different delivering policies for forwarding ranked events to users, namely a periodic, a sliding-window and a history-based one. We have fully implemented our approach in SIENA, a popular publish/subscribe middleware system, and report experimental results of its deployment.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On measuring bias in online information",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3186549.3186553",
            "Abstract": "Bias in online information has recently become a pressing issue, with search engines, social networks and recommendation services being accused of exhibiting some form of bias. In this vision paper, we make the case for a systematic approach towards measuring bias. To this end, we discuss formal measures for quantifying the various types of bias, we outline the system components necessary for realizing them, and we highlight the related research challenges and open problems.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:a3BOlSfXSfwC",
            "Publisher": "ACM"
        },
        {
            "Title": "Troll vulnerability in online social networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7752428/",
            "Abstract": "Trolling describes a range of antisocial online behaviors that aim at disrupting the normal operation of online social networks and media. Combating trolling is an important problem in the online world. Existing approaches rely on human-based or automatic mechanisms for identifying trolls and troll posts. In this paper we take a novel approach to the trolling problem: our goal is to identify the targets of the trolls, so as to prevent trolling before it happens. We thus define the troll vulnerability prediction problem, where given a post we aim at predicting whether it is vulnerable to trolling. Towards this end, we define a novel troll vulnerability metric of how likely a post is to be attacked by trolls, and we construct models for predicting troll-vulnerable posts, using features from the content and the history of the post. Our experiments with real data from Reddit demonstrate that our approach is successful in recalling a large …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:OR75R8vi5nAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Keep your data safe and available while roaming",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1015467429243",
            "Abstract": "The possibility of accessing and/or receiving local or remote data anywhere and at anytime constitutes an important advantage in many business environments. However, when working with mobile devices, users face many problems, such as: (1) devise exposure problems – mobile devices are more vulnerable and fragile than stationary devices, because they can be easily stolen, lost or damaged, (2) media problems – wireless communications are often unstable, asymmetric and expensive, and (3) availability problems – mobile devices stay disconnected for long periods of time. To alleviate these problems, we present a service, Data Lockers, which offers to its users first, the possibility of keeping their data in a secure and safe space in a proxy, thus alleviating the device exposure problem. Next, data stored in a data locker are available even when the mobile device is disconnected, thus providing a …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Mobile and wireless database access for pervasive computing",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Panos-Chrysanthis/publication/3845957_Tutorial_2_Mobile_and_Wireless_Database_Access_for_Pervasive_Computing/links/564b94cd08aeab8ed5e7709e/Tutorial-2-Mobile-and-Wireless-Database-Access-for-Pervasive-Computing.pdf",
            "Abstract": "Issues in Information Provision□ tariff□ scalability: massive# users accessing read-only data□ security (of data and user profiles/location)▪ impersonation, theft, trust▪ consuming resources in a foreign environment▪ damage to fixed hosts?□ approximate answers□ consistency, autonomy, recovery▪ PDAs are unreliable□ prioritization of actions upon reconnection□ providing uniform access in a heterogeneous environment□ design of human-computer interfaces (pen-based computing)",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PerK: personalized keyword search in relational databases through preferences",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1739041.1739111",
            "Abstract": "Keyword-based search in relational databases allows users to discover relevant information without knowing the database schema or using complicated queries. However, such searches may return an overwhelming number of results, often loosely related to the user intent. In this paper, we propose personalizing keyword database search by utilizing user preferences. Query results are ranked based on both their relevance to the query and their preference degree for the user. To further increase the quality of results, we consider two new metrics that evaluate the goodness of the result as a set, namely coverage of many user interests and content diversity. We present an algorithm for processing preference queries that uses the preferential order between keywords to direct the joining of relevant tuples from multiple relations. We then show how to reduce the complexity of this algorithm by sharing computational …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:BrmTIyaxlBUC",
            "Publisher": "ACM"
        },
        {
            "Title": "An access control mechanism for large scale data dissemination systems",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/916490/",
            "Abstract": "Automatic data dissemination systems are becoming increasingly relevant in Internet-based information systems. In such systems, users subscribe to the dissemination service by providing interest profiles. These profiles are then used to determine which information should be delivered to which users, whenever new information is entered into the system. A main shortcoming of existing dissemination systems is the lack of any access control mechanisms, enabling selective information dissemination based for example on security or other regulatory policies. We present an access control model suitable for dissemination systems. The model is based on user profiles containing both user interests and user credentials (i.e., a set of attributes characterizing users for access control purposes). Information is then filtered before being delivered to users on the basis of both the user interests and credentials. To make …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cooperative xpath caching",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1376616.1376652",
            "Abstract": "Motivated by the fact that XML is increasingly being used in distributed applications, we propose building a cooperative caching scheme for XML documents. Our scheme allows sharing cache content among a number of peers. To facilitate sharing, a distributed prefix-based index is built based on the queries whose results are cached. In the loosely-coupled sharing approach, each peer stores in its local cache results of its own queries and just publishes the associated queries to the index. In the tightly-coupled approach, each peer is assigned a specific part of the query space and stores in its local cache the results of the corresponding queries. Both approaches result in a dynamic organization of content that evolves over time based on the query load, the number of peers and the overall storage available. We present a number of associated design choices such as using a DHT for distributing the prefix-based …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Deployment of Web Service Workflows",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4401012/",
            "Abstract": "The appropriate deployment of Web service operations at the service provider site plays a critical role in the efficient provision of services to clients. In this paper, we assume that a service provider has several servers over which web service operations can be deployed. Then, given a workflow of Web services and the topology of the servers, the most efficient mopping of operations to servers must be discovered. Efficiency is measured in terms of two cost functions that concern the execution lime of the workflow and the fairness of the load distribution among the servers. We study different topologies for the workflow structure and the server connectivity and propose a suite of greedy algorithms for each combination.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bloom-Based Filters for Hierarchical Data. Univ",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=15336812068386416488&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:hkOj_22Ku90C",
            "Publisher": "of Ioannina, Computer Science Dept, Technical report, TR-2002-29"
        },
        {
            "Title": "A Clustered Index Approach to Distributed XPath",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.216.8624&rep=rep1&type=pdf",
            "Abstract": "Supporting top-k queries over distributed collections of schemaless XML data poses two challenges. While XML supports expressive query languages such as XPath and XQuery, these languages require schema knowledge so as to write an appropriate query which may not be available in distributed systems with autonomous and dynamic sources. Thus, there is a need for approximate query processing. Furthermore, retrieving the top-k results incurs large communication and processing cost, since partial result lists from numerous sites need to be combined and ranked to assembly the top-k answers. To address both of these issues, we present an approach for approximate XPath processing over distributed collections of XML data based on a clustered path index, where data is grouped based on structural information. Our method gradually generalizes a query by applying a set of structural transformations to it and the retrieved results are ranked based on the edit distance between two path expressions. A compact indexing data structure is used to reduce the index construction cost. Our experimental results show that our approach significantly reduces the communication cost for retrieving the top-k results, while maintaining a low construction cost for the clustered index.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:nZcligLrVowC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Peer-to-Peer Computing and Databases (P2PDB)-",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=18132223866718503700&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Preference-based query personalization",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-28323-9_4",
            "Abstract": "In the context of database queries, computational methods for handling preferences can be broadly divided into two categories. Query personalization methods consider that user preferences are provided as a user profile separately from the query and dynamically determine how this profile will affect the query results. On the other hand, preferential query answering methods consider that preferences are explicitly expressed within queries. The focus of this chapter is on query personalization methods. We will first describe how preferences can be represented and stored in user profiles. Then, we will discuss how preferences are selected from a user profile and applied to a query.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Filters for XML-based service discovery in pervasive computing",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8129954/",
            "Abstract": "Pervasive computing refers to an emerging trend towards numerous casually accessible devices connected to an increasingly ubiquitous network infrastructure. An important challenge in this context is discovering the appropriate data and services. In this paper, we assume that services and data are described using hierarchically structured metadata. There is no centralized index for the services; instead, appropriately distributed filters are used to route queries to the appropriate nodes. We propose two new types of filter that extend Bloom filters for hierarchical documents. Two alternative ways are considered for building overlay networks of nodes: one based on network proximity and one based on content similarity. Content similarity is derived from the similarity among filters. Our experimental results show that networks based on content similarity outperform those formed based on network proximity for finding all …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:eJXPG6dFmWUC",
            "Publisher": "OUP"
        },
        {
            "Title": "ETL queues for active data warehousing",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1077501.1077509",
            "Abstract": "Traditionally, the refreshment of data warehouses has been performed in an off-line fashion. Active Data Warehousing refers to a new trend where data warehouses are updated as frequently as possible, to accommodate the high demands of users for fresh data. In this paper, we propose a framework for the implementation of active data warehousing, with the following goals:(a) minimal changes in the software configuration of the source,(b) minimal overhead for the source due to the active nature of data propagation,(c) the possibility of smoothly regulating the overall configuration of the environment in a principled way. In our framework, we have implemented ETL activities over queue networks and employ queue theory for the prediction of the performance and the tuning of the operation of the overall refreshment process. Due to the performance overheads incurred, we explore different architectural choices for …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Flow Computation in Temporal Interaction Networks",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9458820/",
            "Abstract": "Temporal interaction networks capture the history of activities between entities along a timeline. At each interaction, some quantity of data (money, information, traffic) flows from one vertex of the network to another. Flow-based analysis can reveal important information, such as unusually large money transfers in a part of a financial transaction network. In this paper, we introduce the flow computation problem between two vertrices in an interaction network. We propose and study two models of flow computation, one based on a greedy flow transfer assumption and one that finds the maximum possible flow. We show that the greedy flow computation problem can be easily solved by a single scan of the interactions in time order. For the harder maximum flow problem, we propose precomputation and simplification approaches that can greatly reduce its complexity in practice. We also approach the problem of flow …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:otzGkya1bYkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Historical traversals in native graph databases",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-66917-5_12",
            "Abstract": "Since most graph data, such as data from social, citation and computer networks evolve over time, it is useful to be able to query their history. In this paper, we focus on supporting traversals of such graphs using a native graph database. We assume that we are given the history of an evolving graph as a sequence of graph snapshots representing the state of the graph at different time instances. We introduce models for storing such snapshots in the graph database and we propose algorithms for supporting various types of historical reachability and shortest path queries. Finally, we experimentally evaluate and compare the various models and algorithms using both real and synthetic datasets.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:GFxP56DSvIMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Social-minded Measures of Data Quality: Fairness, Diversity, and Lack of Bias",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3404193",
            "Abstract": "For decades, research in data-driven algorithmic systems has focused on improving efficiency (making data access faster and lighter) and effectiveness (providing relevant results to users). As data-driven decision making becomes prevalent, there is an increasing need for new measures for evaluating the quality of data systems. In this article, we make the case for social-minded measures, that is, measures that evaluate the effect of a system in society. We focus on three such measures, namely diversity (ensuring that all relevant aspects are represented), lack of bias (processing data without unjustifiable concentration on a particular side), and fairness (non discriminating treatment of data and people).",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:ALROH1vI_8AC",
            "Publisher": "ACM"
        },
        {
            "Title": "The DisC Diversity Model.",
            "Publication year": 2014,
            "Publication url": "http://users.cs.uoi.gr/~mdrosou/docs/exploreDB.pdf",
            "Abstract": "In this paper, we summarize our work on diversification based on dissimilarity and coverage (DisC diversity) by presenting our main theoretical results and contributions.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:_axFR9aDTf0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile computing",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24742-5_10",
            "Abstract": "Mobile computing has emerged as a convergence of wireless communications and computer technologies. Mobile computing systems can be viewed as a specialized class of distributed systems where some nodes may disengage from joint distributed operations, move freely in the physical space and re-connect to a possibly different segment of a computer network at a later stage in order to resume suspended activities. Migrating applications, mobile distributed objects and agents are also frequently associated with mobile computing. Mobile computing platforms offer new opportunities at the system software and application levels and pose many research challenges. This chapter addresses data management issues in mobile computing environments. It analyzes the past and present of mobile computing, wireless networks, mobile computing devices, architectures for mobile computing, and advanced …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Distributed Objects and Applications (DOA) 2005 International Conference-Mobility-Timely Provisioning of Mobile Services in Critical Pervasive Environments",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=10592178997610001169&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:mB3voiENLucC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Message from the ICDE 2012 program chairs and the general chair",
            "Publication year": 2012,
            "Publication url": "https://scholarbank.nus.edu.sg/handle/10635/41946",
            "Abstract": "Since 1984, ICDE has established itself as a premier forum in the area of data management, providing a unique opportunity for database researchers, users, practitioners, and developers to exchange new ideas. The 28th IEEE International Conference on Data Engineering takes place in the city of Washington, United States, from April 1 to 5, 2012. We are proud to present its program in these proceedings. Each of the main days of the conference starts out with a keynote by a distinguished scientist: Serge Abiteboul from INRIA in France on April 2; Surajit Chaudhuri from Microsoft Research in the United States on April 3; and Peter Druschel from the Max- Planck Institute for Software Systems in Germany on April 4. We thank all the authors who submitted their work to ICDE for making the conference happen. We received 413 paper submissions for the research track, 22 submissions for the industrial track, and 68 demo proposals. The program committee was organized into fifteen topic-based tracks. Each track was headed by a vice-chair who formed a committee to evaluate the papers assigned to that track. This resulted in a research program committee consisting of 188 members for the research tracks, 12 members for the industrial track, and 30 members for the demo track. The evaluation process consisted of three distinct phases: initial reviews of the papers by PC members, some initial discussions, author responses to these reviews, and then further discussion by the PC and fine-tuning of the reviews. The research program features 100 papers, the industrial program 9 papers, and the demonstration program 28 demos. The conference …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:vDZJ-YLwNdEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiple radii disc diversity: Result diversification based on dissimilarity and coverage",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2699499",
            "Abstract": "Recently, result diversification has attracted a lot of attention as a means to improve the quality of results retrieved by user queries. In this article, we introduce a novel definition of diversity called DisC diversity. Given a tuning parameter r, which we call radius, we consider two items to be similar if their distance is smaller than or equal to r. A DisC diverse subset of a result contains items such that each item in the result is represented by a similar item in the diverse subset and the items in the diverse subset are dissimilar to each other. We show that locating a minimum DisC diverse subset is an NP-hard problem and provide algorithms for its approximation. We extend our definition to the multiple radii case, where each item is associated with a different radius based on its importance, relevance, or other factors. We also propose adapting DisC diverse subsets to a different degree of diversification by adjusting r, that is …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:GtLg2Ama23sC",
            "Publisher": "ACM"
        },
        {
            "Title": "A recall-based cluster formation game in peer-to-peer systems (extended version)",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.216.7563&rep=rep1&type=pdf",
            "Abstract": "In many large-scale content sharing applications, participants or peers are grouped together forming clusters based on their content or interests. In this paper, we deal with the maintenance of such clusters in the presence of updates. We model the evolution of the system as a game, where peers determine their cluster membership based on a utility function of the query recall. Peers are guided either by selfish or altruistic motives: selfish peers aim at improving the recall of their own queries, whereas altruistic peers aim at improving the recall of the queries of other peers. We study the evolution of such clusters both theoretically and experimentally under a variety of conditions. We show that, in general, local decisions made independently by each peer enable the system to adapt to changes and maintain the overall recall of the query workload.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:ufrVoPGSRksC",
            "Publisher": "Technical Report TR 3-2009, Computer Science Department, University of Ioannina"
        },
        {
            "Title": "On accessing GSM-enabled mobile sensors",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1595583/",
            "Abstract": "In this paper, we propose a middleware framework that unifies access to GSM-enabled sensor devices in a global computing environment. Typically, communication with mobile sensors relies on proprietary protocols, involving the exchange of SMS and MMS messages. In the proposed framework, we use XML-based control descriptions that abstractly specify these protocols to generate proxies and corresponding WEB-based (HTML, WAP and WEB services) interfaces that realize them. Thus, we provide access transparency over different kinds of mobile sensors. Besides the overall architecture of the proposed framework, we discuss a particular instance where a GSM-enabled camera with temperature, and motion detection sensors is incorporated into our global computing environment. Finally, we assess the performance of the proposed framework by presenting experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comparing diversity heuristics",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Marina-Drosou/publication/228420422_Comparing_diversity_heuristics/links/0912f51119893a2d4f000000/Comparing-diversity-heuristics.pdf",
            "Abstract": "Result diversification has recently attracted much attention as a means of increasing user satisfaction in recommender systems and web search. Selecting diverse items, however, has been proven to be an NP-hard problem. In this paper, we focus of a common interpretation of diversity, namely content diversity, and present a number of heuristics that have been proposed in the literature for tackling this problem. We also provide a comprehensive experimental evaluation of their performance.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "BITPEER: Continuous subspace skyline computation with distributed bitmap indexes",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1379350.1379356",
            "Abstract": "In this paper, we propose a bitmap approach for efficient subspace skyline computation in a distributed setting. Our approach computes extended skylines which have been shown to include all points necessary for computing the skyline at any subspace. We present an algorithm for computing extended skylines using a bitmap representation along with a storage efficient bucket-based variation of this representation. We provide a caching scheme so that subspace skyline queries can re-use the results of previously computed similar queries. We also introduce a method for grouping continuous subspace queries for supporting their efficient computation. Finally, we present preliminary experimental results of the performance of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:08ZZubdj9fEC",
            "Publisher": "ACM"
        },
        {
            "Title": "An evaluation of the Java-based approaches to Web database access",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/10722620_9",
            "Abstract": "Given the undeniable popularity of the Web, providing efficient and secure access to remote databases using a Web browser is crucial for the emerging cooperative information systems and applications. In this paper, we evaluate all currently available Java-based approaches that support persistent connections between Web clients and database servers. These approaches include Java applets, Java Sockets, Servlets, Remote Method Invocation, CORBA, and mobile agents technology. Our comparison is along the dimensions of performance and programmability.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:5awf1xo2G04C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Boosting nodes for improving the spread of influence",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1609.03478",
            "Abstract": "Information diffusion in networks has received a lot of recent attention. Most previous work addresses the influence maximization problem of selecting an appropriate set of seed nodes to initiate the diffusion process so that the largest number of nodes is reached. Since the seed selection problem is NP hard, most solutions are sub-optimal. Furthermore, there may be settings in which the seed nodes are predetermined. Thus, a natural question that arise is: given a set of seed nodes, can we select a small set of nodes such that if we improve their reaction to the diffusion process, the largest increase in diffusion spread is achieved? We call this problem, the boost set selection problem. In this paper, we formalize this problem, study its complexity and propose appropriate algorithms. We also evaluate the effect of boosting in a number of real networks and report the increase of influence spread achieved for different seed sets, time limits in the diffusion process and other diffusion parameters.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:3htObqc8RwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characterizing the temporal and semantic coherency of broadcast-based data dissemination",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36285-1_27",
            "Abstract": "In this paper, we develop a general theory of temporal and semantic coherency for an extended client/server architecture in which the server broadcasts items of interest to a large number of clients without a specific client request. Such architectures are part of an increasing number of emerging applications in wireless mobile computing systems; they also provide a scalable means to deliver information in web-based applications, for example in publish-subscribe systems. We introduce various forms of temporal and semantic coherency applicable to such architectures and present a framework to precisely de.ne protocols for enforcing them.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "On novelty in publish/subscribe delivery",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5452770/",
            "Abstract": "In publish/subscribe systems, users express their interests in specific items of information and get notified when relevant data items are produced. Such systems allow users to stay informed without the need of going through huge amounts of data. However, as the volume of data being created increases, some form of ranking of matched events is needed to avoid overwhelming the users. In this work-in-progress paper, we explore novelty as a ranking criterion. An event is considered novel, if it matches a subscription that has rarely been matched in the past.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bias disparity in recommendation systems",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1811.01461",
            "Abstract": "Recommender systems have been applied successfully in a number of different domains, such as, entertainment, commerce, and employment. Their success lies in their ability to exploit the collective behavior of users in order to deliver highly targeted, personalized recommendations. Given that recommenders learn from user preferences, they incorporate different biases that users exhibit in the input data. More importantly, there are cases where recommenders may amplify such biases, leading to the phenomenon of bias disparity. In this short paper, we present a preliminary experimental study on synthetic data, where we investigate different conditions under which a recommender exhibits bias disparity, and the long-term effect of recommendations on data bias. We also consider a simple re-ranking algorithm for reducing bias disparity, and present some observations for data disparity on real data.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:Bg7qf7VwUHIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive multiversion data broadcast organizations",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437903001066",
            "Abstract": "Broadcasting provides an efficient means for disseminating information in both wired and wireless setting. In this paper, we propose a suite of broadcast organization schemes for multiversion data broadcast, i.e., data broadcast in which more than one value is broadcast per data item. Besides increasing the concurrency of client transactions, multiversion broadcast provides clients with the possibility of accessing multiple server states. For example, such a functionality is essential to support applications that require access to data sequences and have limited local memory to store the previous versions, such as in the case of sensor networks. We identify two basic multiversion organizations, namely vertical and horizontal broadcasts and propose an efficient compression scheme applicable to both. We also consider a multiversion client data cache and introduce appropriate cache replacement techniques. Finally, we …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:bnK-pcrLprsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "On using histograms as routing indexes in peer-to-peer systems",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-31838-5_2",
            "Abstract": "Peer-to-peer systems offer an efficient means for sharing data among autonomous nodes. A central issue is locating the nodes with data matching a user query. A decentralized solution to this problem is based on using routing indexes which are data structures that describe the content of neighboring nodes. Each node uses its routing index to route a query towards those of its neighbors that provide the largest number of results. We consider using histograms as routing indexes. We describe a decentralized procedure for clustering similar nodes based on histograms. Similarity between nodes is defined based on the set of queries they match and related with the distance between their histograms. Our experimental results show that using histograms to cluster similar nodes and to route queries increases the number of results returned for a given number of nodes visited.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "DBGlobe: a service-oriented P2P system for global computing",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/945721.945737",
            "Abstract": "The challenge of peer-to-peer computing goes beyond simple file sharing. In the DBGlobe project, we view the multitude of peers carrying data and services as a superdatabase. Our goal is to develop a data management system for modeling, indexing and querying data hosted by such massively distributed, autonomous and possibly mobile peers. We employ a service-oriented approach, in that data are encapsulated in services. Direct querying of data is also supported by an XML-based query language. In this paper, we present our research results along the following topics: (a) infrastructure support, including mobile peers and the creation of context-dependent communities, (b) metadata management for services and peers, including location-dependent data, (c) filters for efficiently routing path queries on hierarchical data, and (d) querying using the AXML language that incorporates service calls inside XML …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:3s1wT3WcHBgC",
            "Publisher": "ACM"
        },
        {
            "Title": "A context aware preference database system",
            "Publication year": 2007,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/10963",
            "Abstract": "Repository of UOI \"Olympias\": A context aware preference database system Skip navigation \nHome Browse Communities & Collections Browse Items by: Issue Date Author Title Subject \nItem Type Advanced Search Help About DSpace Sign on to: My DSpace Receive email \nupdates Edit Profile Saved Searches Favorites Repository of UOI \"Olympias\" 1.Repository \nof OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Θετικών Επιστημών 4.Τμήμα Μηχανικών \nΗλεκτρονικών Υπολογιστών και Πληροφορικής 5.Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) \nΕλληνικά English Please use this identifier to cite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/10963 \nInstitution and School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Θετικών \nΕπιστημών. Τμήμα Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/10963 \nPublisher: Emerald Group in …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:cWzG1nlazyYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Dynamic View System (DVS): Mobile Agents to Support Web Views",
            "Publication year": 2001,
            "Publication url": "http://users.cs.uoi.gr/~pitoura/distribution/icde01-demo.doc",
            "Abstract": "The Dynamic View System (DVS) is an experimental mobile agent based infrastructure that provides the necessary components for the definition, materialization, storage, maintenance and re-use of views over remote web databases. Through the system, clients identify web databases of interest, access their metadata and create personalized views that can be shared by other clients. Creating personalized views provides a more efficient way of data processing than directly issuing complex queries to the data sources especially in the case of light-weight and wireless clients that suffer from scarce local resources, limited bandwidth and high communication costs. DVS’s multi-tier architecture implemented using mobile Java agents allows automatic code deployment as well as dynamic relocation of views.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context aware query processing in Ad-Hoc environments of peers",
            "Publication year": 2008,
            "Publication url": "https://olympias.lib.uoi.gr/jspui/bitstream/123456789/10996/1/Vassiliadis-2008-Context-Aware%20Query%20Processing%20in%20Ad-Hoc%20Environments%20of.pdf",
            "Abstract": "In this paper, we deal with context-aware query processing in ad-hoc peer-to-peer networks. Each peer in such an environment has a database over which users want to execute queries. This database involves (a) relations which are locally stored and (b) relations which are virtual or hybrid. In the case of virtual relations, all the tuples of the relation are collected from peers that are present in the network at the time when the query is posed. Hybrid relations involve both locally stored tuples and tuples collected from the network. The collaboration among peers is performed through web services. The integration of the external data, before they are locally collected to a peer's database is performed through a workflow of web service invocations. Summarizing the problem, due to the transitive nature of the extent of virtual relations, we cannot perform query processing in the traditional way, but rather, we have to involve contextaware query processing techniques that exploit the neighborhood of each peer and the web service infrastructure that deals with the heterogeneity of peers. To deal with the aforementioned problem we provide the following contributions. First, we formally define the system model. Next, we define SQLP, an extension of traditional SQL on the basis of contextual environment requirements that concern the termination of queries, the failure of individual peers and the semantic characteristics of the peers of the network. In addition, we precisely define the semantics of SQLP. We discuss issues of data integration, performed through workflows of web services. Moreover, we present a query execution algorithm as well as the formal …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:mNrWkgRL2YcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Angry Birds Flock Together: Aggression Propagation on Social Media",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2002.10131",
            "Abstract": "Cyberaggression has been found in various contexts and online social platforms, and modeled on different data using state-of-the-art machine and deep learning algorithms to enable automatic detection and blocking of this behavior. Users can be influenced to act aggressively or even bully others because of elevated toxicity and aggression in their own (online) social circle. In effect, this behavior can propagate from one user and neighborhood to another, and therefore, spread in the network. Interestingly, to our knowledge, no work has modeled the network dynamics of aggressive behavior. In this paper, we take a first step towards this direction, by studying propagation of aggression on social media. We look into various opinion dynamics models widely used to model how opinions propagate through a network. We propose ways to enhance these classical models to accommodate how aggression may propagate from one user to another, depending on how each user is connected to other aggressive or regular users. Through extensive simulations on Twitter data, we study how aggressive behavior could propagate in the network. We validate the models with ground truth crawled and annotated data, reaching up to 80% AUC. We discuss the results and implications of our work.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:buQ7SEKw-1sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agent-Based and Mobile, External Storage for Users of Mobile Devices",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.2.3386&rep=rep1&type=pdf",
            "Abstract": "У д в и в з йж в з зд з ж а джг а б гж б вн йз жз г бг а к з йз и гз к з ж бгж кйав ж а в ж а и в и зи и гв жн гв зК Ьг згак и и джг а б б вн гбб ж а джг й из ж дд жЙ в и и гЋ ж зигж зд в и Сви жв иК Св и з д д жИ л дж з ви в л згайи гв иг и б ви гв джг а бИ з гв и йз г и ви и вгаг нИ аа и Фг ж Ъ ви а Ы жк и и г з зи д йжи ж л и ж зд и иг м зи в гв зК Чйж з жк джгк з илг зд Ќ к ви з йигвгбн в бг а инК Св и жбз г йигвгбнИ и в и аг жз ж б вЙ н виз лгж в гв а г и йз жзИ ж дж з ви в и б в и в илгж к в л а и йз жз ж ий аан зЙ гвв и К Ь з виз и ж г г и в в ж ей зи и И гди б о в и ж гжб и в и ж иж взб зз гвИ и Й в виг гйви и гббйв и гв ж згйж з к а а И и йз ж дж ж в з в и зд Ќ бг а к ж згйж з в ж и ж зи зК Я и ж зд и иг бг а инИ аг жз в гаагл и йз жз в и ж бгк б виз иг ж б в агз иг и йз жзГ ий а д нз а аг и гвК",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FairER: Entity Resolution With Fairness Constraints",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3459637.3482105",
            "Abstract": "There is an urgent call to detect and prevent\" biased data\" at the earliest possible stage of the data pipelines used to build automated decision-making systems. In this paper, we are focusing on controlling the data bias in entity resolution (ER) tasks aiming to discover and unify records/descriptions from different data sources that refer to the same real-world entity. We formally define the ER problem with fairness constraints ensuring that all groups of entities have similar chances to be resolved. Then, we introduce FairER, a greedy algorithm for solving this problem for fairness criteria based on equal matching decisions. Our experiments show that FairER achieves similar or higher accuracy against two baseline methods over 7 datasets, while guaranteeing minimal bias.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:7wO8s98CvbsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Locating Mobile Objects",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=5152945698815186270&hl=en&oi=scholarr",
            "Abstract": "In distributed computing, the notion of mobility is emerging in many forms and applications. Increasingly, many users are not tied to a fixed access point but instead use mobile hardware such as cellular phones or personal digital assistants. Small devices (eg, sensors) are mounted on moving objects such as vehicles or airplanes. Furthermore, mobile software (ie, code or data that move among network locations) offers a new form of building distributed network-centric applications. In the presence of mobility, the cost of communicating with a mobile object or invoking it is augmented by the cost of locating it (ie, identifying its current location). Often, mobility is related to wireless mobile computing [9, 14, 32], because wireless communications allow the free movement of users. Future personal communication systems (PCSs) will support a huge object population and offer numerous customer services. In such systems, the signaling and directory traffic for locating mobile users is expected to increase dramatically [45]. Thus, deriving efficient strategies for locating mobile users (ie, identifying their current location) is an issue central to wireless mobile computing research.Besides mobility tied to wireless hardware, data, or code may be relocated among different network sites for reasons of performance or availability. Mobile software agents [1, 44] are a popular form of mobile software. Mobile agents are processes that may be dispatched from a source computer and be transported to remote servers for execution. Mobile agents can be launched into an unstructured network and roam around to accomplish their task [2], thus providing an efficient …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:4TOpqqG69KYC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Message from the general chair and program chairs",
            "Publication year": 2012,
            "Publication url": "https://scholarbank.nus.edu.sg/handle/10635/42289",
            "Abstract": "Message from the general chair and program chairs | ScholarBank@NUS Skip navigation NUS \nIVLE Email Library Map Calendar NUS Home Research Outputs View research outputs Deposit \npublication / dataset Researchers Help FAQs Contact us Guidelines Log in \n1.ScholarBank@NUS 2.. Staff 3.Staff Publications Please use this identifier to cite or link to this \nitem: https://doi.org/10.1109/ICDEW.2012.3 Title: Message from the general chair and program \nchairs Authors: Wang, XS Gehrke, J. Ooi, BC Pitoura, E. Issue Date: 2012 Citation: Wang, \nXS,Gehrke, J.,Ooi, BC,Pitoura, E. (2012). Message from the general chair and program chairs. \nProceedings - 2012 IEEE 28th International Conference on Data Engineering Workshops, \nICDEW 2012 : xi-xii. ScholarBank@NUS Repository. https://doi.org/10.1109/ICDEW.Source Title: \nProceedings - 2012 IEEE 28th International Conference on Data Engineering Workshops, 2012 …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:tH6gc1N1XXoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Poikilo: a tool for evaluating the results of diversification models and algorithms",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.14778/2536274.2536287",
            "Abstract": "Search result diversification has attracted considerable attention as a means of improving the quality of results retrieved by user queries. In this demonstration, we present Poikilo, a tool to assist users in locating and evaluating diverse results. We provide implementations of a wide suite of models and algorithms to compute and compare diverse results. Users can tune various diversification parameters, combine diversity with relevance and also see how diverse results change over time in the case of streaming data.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Distributed structural relaxation of XPath queries",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4812432/",
            "Abstract": "Due to the structural heterogeneity of XML, queries are often interpreted approximately. This is achieved by relaxing the query and ranking the results based on their relevance to the original query. Query relaxation over distributed XML repositories may incur large communication costs, since partial result lists from different sites need to be gathered and ranked to assembly the overall top-k results. To process such queries efficiently, we propose using a distributed clustered index to group documents based on their structural similarity. The clustered index proves to be very effective in reducing the sizes of the partial lists that need to be combined. Furthermore, it can be used as the basis of a pay-as-you-go approach, where clusters of documents are accessed gradually providing the user with increasingly improving results. To reduce the cost of constructing and maintaining the clustered index, we use a compact data …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest Editorial: Special Section on the International Conference on Data Engineering",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6824893/",
            "Abstract": "The ten papers included in this special section were presented at the 28th International Conference on Data Engineering was held in Washington, DC, on April 1-5, 2012. All papers were revised and substantially extended, over their conference versions and went through a rigorous review process to ensure the high quality standards of the IEEE Transactions on Knowledge and Data Engineering. They cover a broad range of topics highlighting the liveliness of the data engineering field.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:Ri6SYOTghG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Message from the conference program co-chairs: MDM 2009",
            "Publication year": 2009,
            "Publication url": "https://pennstate.pure.elsevier.com/en/publications/message-from-the-conference-program-co-chairs-mdm-2009",
            "Abstract": "Message from the conference program co-chairs: MDM 2009 — Penn State Skip to main \nnavigation Skip to search Skip to main content Penn State Logo Help & FAQ Home Researchers \nResearch Output Research Units Core Facilities Grants & Projects Prizes Activities Message \nfrom the conference program co-chairs: MDM 2009 Wang-chien Lee, Chung Ta King, Evaggelia \nPitoura School of Electrical Engineering and Computer Science Research output: Contribution \nto journal › Editorial Overview Fingerprint Original language English (US) Article number \n5088906 Journal Proceedings - IEEE International Conference on Mobile Data Management \nDOIs https://doi.org/10.1109/MDM.State Published - Oct 5 2009 Event 2009 10th International \nConference on Mobile Data Management: Systems, Services and Middleware, MDM 2009 \n- Taipei, Taiwan, Province of China Duration: May 18 2009 → May 20 2009 All Science (/…",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:artPoR2Yc-kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A context-aware preference database system",
            "Publication year": 2008,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/17427370710863158/full/html",
            "Abstract": "A context‐aware system is a system that uses context to provide relevant information or services to its users. While there has been a variety of context middleware infrastructures and context‐aware applications, little work has been done on integrating context into database management systems. The purpose of this paper is to consider a preference database system that supports context‐aware queries, that is, queries whose results depend on the context at the time of their submission.The paper proposes using data cubes to store the dependencies between context‐dependent preferences and database relations and on‐line analytical processing techniques for processing context‐aware queries. This allows for the manipulation of the captured context data at various levels of abstraction, for instance, in the case of a context parameter representing location, preferences …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "HiNode: an asymptotically space-optimal storage model for historical queries on graphs",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10619-017-7207-z",
            "Abstract": "Most modern networks are perpetually evolving and can be modeled by graph data structures. By collecting and indexing the state of a graph at various time instances we are able to perform queries on its entire history and thus gain insight into its fundamental features and attributes. This calls for advanced solutions for graph history storing and indexing that are capable of supporting application queries efficiently while coping with the aggravated space requirements. To this end, we advocate a purely vertex-centric storage model that is asymptotically space-optimal and more space efficient than any other proposal to date. In addition to space efficiency, the model’s purely vertex-centric approach shows great promise with respect to the efficiency and functionality of update and query operations. Furthermore, we make a qualitative comparison with other general methods for graph history storage identifying the pros …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:_OXeSy2IsFwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Sentiment-based topic suggestion for micro-reviews",
            "Publication year": 2016,
            "Publication url": "https://www.aaai.org/ocs/index.php/ICWSM/ICWSM16/paper/viewPaper/13074",
            "Abstract": "Location-based social sites, such as Foursquare or Yelp, are gaining increasing popularity. These sites allow users to check in at venues and leave a short commentary in the form of a micro-review. Micro-reviews are rich in content as they offer a distilled and concise account of user experience. In this paper we consider the problem of predicting the topic of a micro-review by a user who visits a new venue. Such a prediction can help users make informed decisions, and also help venue owners personalize users’ experiences. However, topic modeling for micro-reviews is particularly difficult, due to their short and fragmented nature. We address this issue using pooling strategies, which aggregate micro-reviews at the venue or user level, and we propose novel probabilistic models based on Latent Dirichlet Allocation (LDA) for extracting the topics related to a user-venue pair. Our best topic model integrates influences from both venue inherent properties and user preferences, considering at the same the sentiment orientation of the users. Experimental results on real datasets demonstrate the superiority of this model compared to simpler models and previous work; they also show that venue-inherent properties have higher influences on the topics of micro-reviews.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:4vMrXwiscB8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On deploying and executing data-intensive code on smart autonomous storage (SmAS) disks",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44472-6_26",
            "Abstract": "There is an increasing demand for storage capacity and storage throughput, driven largely by new data types such as video data and satellite images as well as by the growing use of the Internet and the web that generate and transmit rapidly evolving datasets. Thus, there is a need for storage architectures that scale the processing power with the growing size of the datasets. In this paper, we present the SMAS system that employs network attached disks with processing capabilities. In the SMAS system, users can deploy and execute code at the disk. Application code is written in a stream-based language that enforces code security and bounds the codeś memory requirements. The SMAS operating system at the disk provides basic support for process scheduling and memory management. We present an initial implementation of the system and report performance results that validate our approach for data …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "WORKSHOP ORGANIZATION",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=13153720834364192549&hl=en&oi=scholarr",
            "Abstract": "All e-government plans have the main goal to simplify interaction among citizens and the Public Administration by means of the development of interorganizational network services where all involved Public Administrations cooperate to initiate, synchronize and monitor all processes needed for a given service, and to guarantee the global coherency of data related to a given service in several Public Administrations. There is now a big general effort to define common standards and protocols to represent and communicate structured information and services (XML, UDDI, SOAP) that simplify the definition of integrated network services. It is important however to observe that the problem to define inter-organizational services is primarily an organizational one, that is, even a complete solution to the problem of accessing services and exchanging information would not help the deployment of inter-organizational services unless we also consider problems like how such services are currently handled by the organizations, how the responsibilities for the services are assigned, how the organizations keeps track of the status of the services.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Topic Detection Using a Critical Term Graph on News-Related Tweets.",
            "Publication year": 2015,
            "Publication url": "http://ceur-ws.org/Vol-1330/paper-29.pdf",
            "Abstract": "Social media and online social networks are playing an increasingly important role in our lives, as they attract millions of users around the world. Twitter, one of the most popular micro-blogging services, holds a special position among them, since information shared through this service spreads faster than it would have been possible with traditional sources. There are many interesting works analyzing the information that flows through Twitter. Most of such research focuses on trending topic detection, ie what are the people talking about right now. We propose a new method to detect topics using a graph, where nodes correspond to terms and edges correspond to co-occurrence of the two terms in the tweet stream. Dense subgraphs, of this graph, pose special interest, as the nodes that are highly connected share a special relation. Thus, the corresponding terms potentially share a relation too. To explore this fact, we apply a community detection algorithm on the graph. The resulting communities correspond to topics related to various real world events. Experimental evaluation of the results of this technique is also provided on both synthetic and real data.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:9pM33mqn1YgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile web services for context-aware pervasive environments",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Valerie-Issarny/publication/265022761_Mobile_Web_Services_for_Context-Aware_Pervasive_Environments/links/544e68010cf2bca5ce90b268/Mobile-Web-Services-for-Context-Aware-Pervasive-Environments.pdf",
            "Abstract": "In this paper we propose CoWSAMI, a service-oriented middleware that aims at supporting context-awareness in pervasive computing environments. To this end, we rely on the standard Web services architectural style to handle the architectural heterogeneity of available context sources. CoWSAMI balances the trend between the resource limitations of available context sources and the resource requirements introduced by the aforementioned standard, by employing WSAMI, a lightweight middleware infrastructure for the development of mobile Web services. CoWSAMI provides a dynamic and highly scalable service discovery mechanism that deals with the increased behavioral mobility of available context sources. CoWSAMI further handles the behavioral heterogeneity of available context sources through a mechanism that gathers contextual information while adapting its proper behavior to the interfaces of context sources. Finally, CoWSAMI allows querying for contextual information with respect to the aforementioned organization, though a classical SQL-based interface.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tracker: A universal location management system for mobile agents",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/George-Samaras-2/publication/228971271_Tracker_A_universal_location_management_system_for_mobile_agents/links/0deec537f33c8e07a8000000/Tracker-A-universal-location-management-system-for-mobile-agents.pdf",
            "Abstract": "This paper presents TRAcKER,* a distributed “location management” middleware which has the ability to manage the location of mobile agents that travel independently the Internet in search of useful information. A major goal for this middleware is to be flexible and effective, to respond to the demands posed by the environment it aims to assist: an environment that deals with users that are accessing the Internet via static or mobile units of limited resources (eg, palmtops, handheld devices, WAP-phones) and utilizing mobile agents that are moving “autonomously” and asynchronously around the Internet with small, medium and in many cases high moving frequency. The mechanism we propose is modular, simple, of low overhead and able to serve all the Java based mobile agent platforms. In addition, is quite generic able to dynamically incorporate various location mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Concept-based discovery of mobile services",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1071246.1071287",
            "Abstract": "In this paper, we consider semantic service discovery in a global computing environment. We propose creating a dynamic overlay network by grouping together semantically related services. Each such group of services is termed a community. Communities are organized in a global taxonomy whose nodes are related contextually. The taxonomy can be seen as an expandable distributed semantic index over the system services, which aims at improving service discovery. Our performance results indicate that in certain cases, our service discovery mechanism outperforms even the case in which service indexes are fully replicated at all system sites.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Top-Durable Graph Pattern Queries on Temporal Graphs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8332489/",
            "Abstract": "Graphs offer a natural model for the relationships and interactions among entities, such as those occurring among users in social and cooperation networks, and proteins in biological networks. Since most such networks are dynamic, to capture their evolution over time, we assume a sequence of graph snapshots where each graph snapshot represents the state of the network at a different time instance. Given this sequence, we seek to find the top-  most durable matches  of an input graph pattern query, that is, the matches that exist for the longest period of time. The straightforward way to address this problem is to apply a state-of-the-art graph pattern matching algorithm at each snapshot and then aggregate the results. However, for large networks and long sequences, this approach is computationally expensive, since all matches have to be generated at each snapshot, including those appearing only once. We …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:fbc8zXXH2BUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile agent-based services for view materialization",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1031483.1031489",
            "Abstract": "Mobile agents are ideal for mobile computing environments because of their ability to support asynchronous communication and disconnected data processing. In this paper, we present a prototype set of extensible mobile-agent based services that allow the definition, materialization, maintenance and sharing of views created over remote web-accessible datasources, called ViSMA (Views Supported by Mobile Agents). ViSMA's primary goal is to support the customization and personalization of views by mobile users carrying lightweight devices of various connectivity and resources such as portable computers and PDAs. It achieves efficient view customization by localizing the materialization of view fragments of a complex view within different mobile agents which monitor each other's movement in order to minimize communication costs. ViSMA has been fully implemented over a mobile agent platform and tested …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:1qzjygNMrQYC",
            "Publisher": "ACM"
        },
        {
            "Title": "A peer-to-peer approach to resource discovery in multi-agent systems",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45217-1_5",
            "Abstract": "A multi-agent system is a network of software agents that cooperate to solve problems. In open multi-agent systems, the agents that need resources provided by other agents are not aware of which agents provide the particular resources. We propose a fully distributed approach to this resource discovery problem. Each agent A maintains a limited size local cache in which it keeps information about k different resources, that is, for each of the k resources, it stores the contact information of one agent that provides it. The agents in the cache of agent A are called A’s neighbors. An agent searching for a resource contacts its local cache and if there is no information for the resource, it contacts its neighbors, which in turn contact their neighbors and so on until the resource is found in some cache. We consider variations of this flooding-based search and develop and verify by simulation analytical models of their …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:u9iWguZQMMsC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Lca-based selection for xml document collections",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1772690.1772743",
            "Abstract": "In this paper, we address the problem of database selection for XML document collections, that is, given a set of collections and a user query, how to rank the collections based on their goodness to the query. Goodness is determined by the relevance of the documents in the collection to the query. We consider keyword queries and support Lowest Common Ancestor (LCA) semantics for defining query results, where the relevance of each document to a query is determined by properties of the LCA of those nodes in the XML document that contain the query keywords. To avoid evaluating queries against each document in a collection, we propose maintaining in a preprocessing phase, information about the LCAs of all pairs of keywords in a document and use it to approximate the properties of the LCA-based results of a query. To improve storage and processing efficiency, we use appropriate summaries of the LCA …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey on representation, composition and application of preferences in database systems",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2000824.2000829",
            "Abstract": "Preferences have been traditionally studied in philosophy, psychology, and economics and applied to decision making problems. Recently, they have attracted the attention of researchers in other fields, such as databases where they capture soft criteria for queries. Databases bring a whole fresh perspective to the study of preferences, both computational and representational. From a representational perspective, the central question is how we can effectively represent preferences and incorporate them in database querying. From a computational perspective, we can look at how we can efficiently process preferences in the context of database queries. Several approaches have been proposed but a systematic study of these works is missing. The purpose of this survey is to provide a framework for placing existing works in perspective and highlight critical open challenges to serve as a springboard for researchers …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "04441 Working Group-Some Open Aspects of Mobile Ad-hoc NETwork, Peer-to-Peer, and Self-organizing Systems",
            "Publication year": 2005,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2005/217/",
            "Abstract": "This document summarizes the results of the working group discussion on Mobile Ad-hoc NETworks (MANETs), peer-to-peer (p2p) and self-organizing systems held at the workshop on Mobile Information Management in October 2",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:Zph67rFs4hoC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "Adding context to preferences",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4221733/",
            "Abstract": "To handle the overwhelming amount of information currently available, personalization systems allow users to specify the information that interests them through preferences. Most often, users have different preferences depending on context. In this paper, we introduce a model for expressing such contextual preferences. Context is modeled as a set of multidimensional attributes. We formulate the context resolution problem as the problem of (a) identifying those preferences that qualify to encompass the context state of a query and (b) selecting the most appropriate among them. We also propose an algorithm for context resolution that uses a data structure, called the profile tree, that indexes preferences based on their associated context. Finally, we evaluate our approach from two perspectives: usability and performance.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Developing mobile commerce applications",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/article/developing-mobile-commerce-applications/3506",
            "Abstract": "In this article, we deal with context-aware query processing in ad-hoc peer-to-peer networks. Each peer in such an environment has a database over which users execute queries. This database involves (a) relations which are locally stored and (b) virtual relations, all the tuples of which are collected from peers that are present in the network at the time when a query is posed. The objective of our work is to perform query processing in such an environment and, to this end, we start with a formal definition of the system model. Next, we formally define SQLP, an extension of SQL that covers the termination of queries, the failure of individual peers and the semantic characteristics of the peers of such a network. Moreover, we present a query execution algorithm as well as the formal definition of all the operators that take place in a query execution plan.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Should I Stay or Should I Go: Predicting Changes in Cluster Membership",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2107.07362",
            "Abstract": "Most research on predicting community evolution focuses on changes in the states of communities. Instead, we focus on individual nodes and define the novel problem of predicting whether a specific node stays in the same cluster, moves to another cluster or drops out of the network. We explore variations of the problem and propose appropriate classification features based on local and global node measures. Motivated by the prevalence of machine learning approaches based on embeddings, we also introduce efficiently computed distance-based features using appropriate node embeddings. In addition, we consider chains of features to capture the history of the nodes. Our experimental results depict the complexity of the different formulations of the problem and the suitability of the selected features and chain lengths.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:kw52XkFRtyQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finding teams of maximum mutual respect",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9338260/",
            "Abstract": "Teams that bring together experts with different expertise are important for solving complex problems. However, research shows that teaming up people simply based on their ability is not enough. Team members need to have clear roles, and they should mutually endorse and respect their teammates for the role they assume on the team. In this paper, we define the MaxMutualRespect problem, a novel team-formation problem that asks for a set of experts, each assigned to a distinct role, such that the total respect that the individuals receive by the rest of the team members for their assigned role is maximized. We show that the problem is NP-complete and we consider approximation and heuristic algorithms. Experiments with real datasets demonstrate that our problem definitions and algorithms work well in practice and yield intuitive results.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:ubry08Y2EpUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ymaldb: exploring relational databases via result-driven recommendations",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00778-013-0311-4",
            "Abstract": "The typical user interaction with a database system is through queries. However, many times users do not have a clear understanding of their information needs or the exact content of the database. In this paper, we propose assisting users in database exploration by recommending to them additional items, called Ymal (“You May Also Like”) results, that, although not part of the result of their original query, appear to be highly related to it. Such items are computed based on the most interesting sets of attribute values, called faSets, that appear in the result of the original query. The interestingness of a faSet is defined based on its frequency in the query result and in the database. Database frequency estimations rely on a novel approach of maintaining a set of representative rare faSets. We have implemented our approach and report results regarding both its performance and its usefulness.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:g3aElNc5_aQC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Finding the right set of users: generalized constraints for group recommendations",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1302.6580",
            "Abstract": "Recently, group recommendations have attracted considerable attention. Rather than recommending items to individual users, group recommenders recommend items to groups of users. In this position paper, we introduce the problem of forming an appropriate group of users to recommend an item when constraints apply to the members of the group. We present a formal model of the problem and an algorithm for its solution. Finally, we identify several directions for future work.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An evaluation of the java-based approaches to web database access",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218843001000424",
            "Abstract": "Given the undeniable popularity of the Web, providing efficient and secure access to remote databases using a Web browser is crucial for the emerging cooperative information systems and applications. In this paper, we evaluate all currently available Java-based approaches that support persistent connections between Web clients and database servers. These approaches include Java applets, Java Sockets, Servlets, Remote Method Invocation, CORBA, and mobile agents technology. Our comparison is along the dimensions of performance and programmability. Our findings point out that best performance is not always achievable with high programmability and low resource requirements. Moreover, the mobile agent technology needs to improve its programmability while giving particular emphasis on its infrastructure.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "06431 Abstracts Collection--Scalable Data Management in Evolving Networks",
            "Publication year": 2007,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2007/955/",
            "Abstract": "From 22.10. 06 to 27.10. 06, the Dagstuhl Seminar 06431``Scalable Data Management in Evolving Networks''was held in the International Conference and Research Center (IBFI), Schloss Dagstuhl. During the seminar, several participants presented their current research, and ongoing work and open problems were discussed. Abstracts of the presentations given during the seminar as well as abstracts of seminar results and ideas are put together in this paper. The first section describes the seminar topics and goals in general. Links to extended abstracts or full papers are provided, if available.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:DUooU5lO8OsC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "Message from the MDDS Workshop Chairs",
            "Publication year": 2002,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/dexa/2002/16680687/12OmNx8OurD",
            "Abstract": "Amdahl's second law has been seen as a useful guideline for designing and evaluating balanced computer systems for decades. This law has been mainly used for hardware systems and peak capacities. This paper utilizes Amdahl's second law from a new angle, ie, Evaluating the influence on systems performance and balance of the application framework software, a key component of big data systems. We compare two big data application framework software systems, Apache Hadoop and Data MPI, with three representative application benchmarks and various data sizes. System monitors and hardware performance counters are used to record the resource utilization, characteristics of instructions execution, memory accesses, and I/O rates. These numbers are used to reveal the three runtime metrics of Amdahl's second law: CPU speed (GIPS), memory capacity (GB), and I/O rate (Gbps). The experiment and …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "A Peer-to-Реег Aproach to Resource Discovery in Mulit-Agent Systems (extended version)",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=7875960313224469701&hl=en&oi=scholarr",
            "Abstract": "In open multi-agent systems, agents need resources provided by other agents, but they are not aware of which agents provide the particular resources. Most solutions to this problem are based on a central directory that maintains a mapping between agents and resources-However, such solutions do not scale well, since the central directory becomes a bottleneck in terms of both performance and reliability. In this paper, we introduce a different approach: each agent m aiutai us a limited size local cache in which it keeps information about к different resources, that isT for each of к resources^ it stores the contact information of one agent that provides it. This creates a directed network of caches. We address the following fundamental problem: how can an agent that needs a particular resource, find an agent that provides it by navigating tlirough this network of caches. We propose and analytically compare the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Message from the conference chairs: MDM 2009",
            "Publication year": 2009,
            "Publication url": "https://pennstate.pure.elsevier.com/en/publications/message-from-the-conference-chairs-mdm-2009",
            "Abstract": "Message from the conference chairs: MDM 2009 — Penn State Skip to main navigation Skip to \nsearch Skip to main content Penn State Logo Help & FAQ Home Researchers Research Output \nResearch Units Core Facilities Grants & Projects Prizes Activities Message from the conference \nchairs: MDM 2009 Yu Chee Tseng, Peter Scheuermann, Ralf Hartmut Güting, Wang Chien Lee, \nChung Ta King, Evaggelia Pitoura School of Electrical Engineering and Computer Science \nResearch output: Contribution to journal › Editorial Overview Fingerprint Original language \nEnglish (US) Article number 5088905 Pages (from-to) xiv Journal Proceedings - IEEE \nInternational Conference on Mobile Data Management DOIs https://doi.org/10.1109/MDM.State \nPublished - Oct 5 2009 Event 2009 10th International Conference on Mobile Data Management: \nSystems, Services and Middleware, MDM 2009 - Taipei, Taiwan, Province of : 18 ('…",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:ZzlSgRqYykMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identifying Converging Pairs of Nodes on a Budget.",
            "Publication year": 2015,
            "Publication url": "http://repository.edulll.gr/edulll/retrieve/9789/3392_02_D3.2.Appendix.pdf",
            "Abstract": "In this paper, we consider large graphs that evolve over time, such as graphs that model social networks. Given two instances of the graph at two points in time, we ask to identify the top pairs of nodes whose shortest path distance has decreased the most. We call these pairs converging. The straightforward way to address this problem is by computing the shortest path distances of all pairs at both instances and keeping the ones with the largest differences. Since for large networks this is computationally infeasible, we consider a budgeted version of the problem, where given a fixed budget of single-source shortest path computations, we seek to identify nodes that participate in as many converging pairs as possible. We evaluate a number of different approaches for our problem, that employ centrality-based, dispersion-based, and landmark-based distance estimation metrics. We also consider a classification-based approach that builds a classifier that combines the above features for predicting whether a node participates in one of the top converging pairs. We present experimental results using realworld datasets that show that we are able to identify the large majority of the top converging pairs on a very small budget.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:kh2fBNsKQNwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context-aware query processing in ad-hoc environments of peers",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/context-aware-query-processing-hoc/8008",
            "Abstract": "In this article, we deal with context-aware query processing in ad-hoc peer-to-peer networks. Each peer in such an environment has a database over which users execute queries. This database involves (a) relations which are locally stored and (b) virtual relations, all the tuples of which are collected from peers that are present in the network at the time when a query is posed. The objective of our work is to perform query processing in such an environment and, to this end, we start with a formal definition of the system model. Next, we formally define SQLP, an extension of SQL that covers the termination of queries, the failure of individual peers and the semantic characteristics of the peers of such a network. Moreover, we present a query execution algorithm as well as the formal definition of all the operators that take place in a query execution plan.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Historical graphs: models, storage, processing",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-96655-7_4",
            "Abstract": "Historical graphs capture the evolution of graphs through time. A historical graph can be modeled as a sequence of graph snapshots, where each snapshot corresponds to the state of the graph at the corresponding time instant. There is rich information in the history of the graph not present in just the current snapshot of the graph. In this chapter, we present logical and physical models, query types, systems and algorithms for managing historical graphs. We also highlight promising directions for future work.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:5icHVeHT4IsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Seamless Consistency",
            "Publication year": 2016,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420013153-34/seamless-consistency-evaggelia-pitoura-george-samaras-t%C3%BCrker",
            "Abstract": "Mobile devices such as laptops, palmtops, and smart phones have nowadays become more widespread than desktop computers. The possibilities that they offer for accessing and processing information on the move, everywhere and at any time, account for their broad acceptance. The need for information access and processing in mobile computing environments presents great challenges to database researchers. Apart from advances in wireless communications and device technology, special data management techniques are necessary to provide a transparent interaction between fixed and mobile devices in global information systems.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:dBIO0h50nwkC",
            "Publisher": "Auerbach Publications"
        },
        {
            "Title": "DBGlobe: A data-centric approach to global computing",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1030855/",
            "Abstract": "In the near future, there will be increasingly powerful computers in smart cards, telephones, and other information appliances. This will create a massive infrastructure composed of highly diverse interconnected mobile entities. In this paper, we present a data-centric approach to storage and querying in such environments. At a first level, we view each entity as a miniature database; at a second level we maintain databases of metadata and services. We describe how information delivery and querying are performed in such architectures.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Query management over ad-hoc communities of web services",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1506419/",
            "Abstract": "In this paper, we present CONSERV - a middleware infrastructure for the development of virtual databases in pervasive computing environments. CONSERV provides an SQL front-end for posing and processing queries on information provided by ad-hoc communities of Web services hosted by peers that arbitrarily join and leave the system. The cornerstone of the proposed infrastructure is the fact that we replace the traditional treatment of databases as persistent collections of records by the assumption that a database relation is a collection of records dynamically compiled from such ad-hoc sets of peers. Each peer offers data to the relations through a workflow of Web services. Another aspect of our approach is that we confine query processing over specific sets of peers that we call communities. Communities are defined based on the current context of the peer initiating each query. Since our infrastructure …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "G. samaras. Locating objects in mobile computing",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=2640527352293221447&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bloom-based filters for hierarchical data",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.75.6224&rep=rep1&type=pdf",
            "Abstract": "In this paper, we present two novel hash-based indexing structures, based on Bloom filters, called breadth and depth Bloom filters, which in contrast to traditional hash based indexes, are able to represent hierarchical data and support path expression queries. We describe how these structures can be used for resource discovery in peer-to-peer networks. We have implemented both structures and our experiments show that they both outperform the traditional Bloom filters in discovering the appropriate resources.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On Supporting Context-Aware Preferences in Relational Database Systems.",
            "Publication year": 2005,
            "Publication url": "http://cs.uoi.gr/~pvassil/publications/2005_MCMP/MCMP_2005.pdf",
            "Abstract": "A context-aware system is a system that uses context to provide relevant information or services to its users. While there has been a variety of context middleware infrastructures and context-aware applications, little work has been done in integrating context into database management systems. In this paper, we consider a preference system that facilitates context-aware OLAP queries, that is OLAP queries whose result depends on the context at the time of their submission. We propose using data cubes to store the dependencies between context and database relations and OLAP techniques for the manipulation of context-aware queries.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Flow motifs in interaction networks",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1810.08408",
            "Abstract": "Many real-world phenomena are best represented as interaction networks with dynamic structures (e.g., transaction networks, social networks, traffic networks). Interaction networks capture flow of data which is transferred between their vertices along a timeline. Analyzing such networks is crucial toward comprehend- ing processes in them. A typical analysis task is the finding of motifs, which are small subgraph patterns that repeat themselves in the network. In this paper, we introduce network flow motifs, a novel type of motifs that model significant flow transfer among a set of vertices within a constrained time window. We design an algorithm for identifying flow motif instances in a large graph. Our algorithm can be easily adapted to find the top-k instances of maximal flow. In addition, we design a dynamic programming module that finds the instance with the maximum flow. We evaluate the performance of the algorithm on three real datasets and identify flow motifs which are significant for these graphs. Our results show that our algorithm is scalable and that the real networks indeed include interesting motifs, which appear much more frequently than in randomly generated networks having similar characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:BJbdYPG6LGMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Representation, composition and application of preferences in databases",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5447717/",
            "Abstract": "This tutorial provides an overview of the key research results in the area of user preferences from a database perspective. The objective is to survey in a systematic and holistic way a number of approaches for preference representation and composition, querying with preferences and preference learning. Open research problems are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Content-based routing of path queries in peer-to-peer systems",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24741-8_4",
            "Abstract": "Peer-to-peer (P2P) systems are gaining increasing popularity as a scalable means to share data among a large number of autonomous nodes. In this paper, we consider the case in which the nodes in a P2P system store XML documents. We propose a fully decentralized approach to the problem of routing path queries among the nodes of a P2P system based on maintaining specialized data structures, called filters that efficiently summarize the content, i.e., the documents, of one or more node. Our proposed filters, called multi-level Bloom filters, are based on extending Bloom filters so that they maintain information about the structure of the documents. In addition, we advocate building a hierarchical organization of nodes by clustering together nodes with similar content. Similarity between nodes is related to the similarity between the corresponding filters. We also present an efficient method for update …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Caching and replication in mobile data management",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.101.1595&rep=rep1&type=pdf",
            "Abstract": "Mobile data management has been an active area of research for the past fifteen years. Besides dealing with mobility itself, issues central in data management for mobile computing include low bandwidth, intermittent network connectivity and scarcity of resources with emphasis on power management. In this article, we focus on how caching and replication in mobile data management address these challenges. We consider two antagonistic criteria, that of ensuring quality of data in terms of consistency and coherency and that of achieving quality of service in terms of response time and availability.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy efficient access in multiversion broadcast environment",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1263058/",
            "Abstract": "Broadcasting provides an efficient means for disseminating information in both wired and wireless settings, especially for popular data items. Multiversion (MV) data broadcast, i.e., data broadcast in which more than one value is broadcast per data item, has the advantage of allowing more client transactions to read consistent data and complete their operation successfully. Naturally, the MV broadcast can satisfy both historical queries in which a client accesses many versions of the same data item and snapshot queries in which a client accesses different data items of the same version. Furthermore, multiple versions increase clients' tolerance to network disconnections that are common in wireless communications. In this paper, we expand our previous work on MV broadcasts to support efficient selective tuning. Selective tuning is important for energy constraint mobile devices since it enables the client to be active …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On graph deltas for historical queries",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1302.5549",
            "Abstract": "In this paper, we address the problem of evaluating historical queries on graphs. To this end, we investigate the use of graph deltas, i.e., a log of time-annotated graph operations. Our storage model maintains the current graph snapshot and the delta. We reconstruct past snapshots by applying appropriate parts of the graph delta on the current snapshot. Query evaluation proceeds on the reconstructed snapshots but we also propose algorithms based mostly on deltas for efficiency. We introduce various techniques for improving performance, including materializing intermediate snapshots, partial reconstruction and indexing deltas.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "W18-PDMST'07 & GRep'07: 4th international workshop on P2P Data Management, Security, and Trust: 3rd international workshop on Data management in Global data Repositories",
            "Publication year": 2007,
            "Publication url": "https://www.scholars.northwestern.edu/en/publications/w18-pdmst-07-amp-grep-07-4th-international-workshop-on-p2p-data-m",
            "Abstract": "W18 - PDMST '07 & GRep '07: 4th international workshop on P2P Data Management, Security, \nand Trust: 3rd international workshop on Data management in Global data Repositories — \nNorthwestern Scholars Skip to main navigation Skip to search Skip to main content Northwestern \nScholars Logo Help & FAQ Home Experts Organizations Research Output Grants Core Facilities \nSearch by expertise, name or affiliation W18 - PDMST '07 & GRep '07: 4th international \nworkshop on P2P Data Management, Security, and Trust: 3rd international workshop on Data \nmanagement in Global data Repositories Sanjay Kumar Madria, Anirban Mondal, Mukesh K. \nMohania, Bharat Bhargava, Stephane Bressan, Mizuho Iwaihara, Abdelkader Hameurlain, \nTakahiro Hara, Leszek Lilien, SK Gupta, Sourav S. Bhowmick, Somchai Chatvichienchai, \nCui Bin, Ladjel Bellatreche, Ismail Khalil Ibrahim, Kenji Saito, Gao Cong, Jialie Shen, , 13 -…",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:35r97b3x0nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Access Control Mechanism for Large Scale Data Dissemination Systems",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=13074749811671479396&hl=en&oi=scholarr",
            "Abstract": "Automatic data dissemination systems are becoming increasingly relevant in internet-based information systems. In such systems, users subscribe to the dissemination ser-vice by providing interest profiles. These profiles are then used to determine which information should be delivered to which users, whenever new information is entered into the system. A main shortcoming of existing dissemination systems is the lack of any access control mechanisms, en-abling selective information dissemination based for example on security or other regulatory policies. In this paper, we present an access control model suitable for dissemi-nation systems. The model is based on user profiles containing both user interests and user credentials (ie, a set of attributes characterizing users for access control purposes). Information is then filtered before being delivered to users on the basis of both the user interests and creden-tials. To make authorization manageable when dealing with very large information systems, our model supports autho-rization domains, that allow one to group together information objects to which the same access control policies apply.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:BzfGm06jWhQC",
            "Publisher": "IEEE Computer Society Press"
        },
        {
            "Title": "Preferential publish/subscribe",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1015.7157&rep=rep1&type=pdf",
            "Abstract": "In publish/subscribe systems, subscribers express their interests in specific events and get notified about all published events that match their interests. As the amount of information generated increases rapidly, to control the amount of data delivered to users, we propose enhancing publish/subscribe systems with a ranking mechanism, so that only the top-ranked matching events are delivered. Ranking is based on letting users express their preferences on events by ordering the associated subscriptions. To avoid the blocking of new notifications by top-ranked old ones, we associate with each notification an expiration time. We have fully implemented our approach in SIENA, a popular publish/subscribe middleware system.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Managing contextual preferences",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437911000834",
            "Abstract": "To handle the overwhelming amount of information currently available, personalization systems allow users to specify through preferences which pieces of data interest them. Most often, users have different preferences depending on context. In this paper, we introduce a model for expressing such contextual preferences. Context is modeled using a set of hierarchical attributes, thus allowing context specification at various levels of detail. We formulate the context resolution problem as the problem of selecting appropriate preferences based on context for personalizing a query. We also propose algorithms for context resolution based on data structures that index preferences by exploiting the hierarchical nature of the context attributes. Finally, we evaluate our approach from two perspectives: usability and performance. Usability evaluates the overheads imposed on users for specifying context-dependent preferences …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:IWHjjKOFINEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Sequential group recommendations based on satisfaction and disagreement scores",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10844-021-00652-x",
            "Abstract": "Recently, group recommendations have gained much attention. Nevertheless, most approaches consider only one round of recommendations. However, in a real-life scenario, it is expected that the history of previous recommendations is exploited to tailor the recommendations towards meeting the needs of the group members. Such history should include not only which items the system suggested, but also the reaction of the members to these items. This work introduces the problem of sequential group recommendations, by exploiting the concept of satisfaction and disagreement. Satisfaction describes how well the group received the suggested items. Disagreement describes the satisfaction bias among the group members. We utilize these concepts in three new aggregation methods, SDAA, SIAA and Average+, designed to address the specific challenges introduced by sequential group …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:nRpfm8aw39MC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Business models and transactions in mobile electronic commerce: requirements and properties",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138912860100216X",
            "Abstract": "Advances in wireless network technology and the continuously increasing number of users of hand-held terminals make the latter a possible channel for offering personalized services to mobile users and give pace to the rapid development of mobile electronic commerce (MEC). MEC operates partially in a different environment than Internet e-commerce due to the special characteristics and constraints of mobile terminals and wireless networks and the context, situations and circumstances in which people use their hand-held terminals. In this paper, we discuss the business models in MEC and transaction modeling issues pertinent for the business models and the environment.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:35N4QoGY0k4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Forming compatible teams in signed networks",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2001.03128",
            "Abstract": "The problem of team formation in a social network asks for a set of individuals who not only have the required skills to perform a task but who can also communicate effectively with each other. Existing work assumes that all links in a social network are positive, that is, they indicate friendship or collaboration between individuals. However, it is often the case that the network is signed, that is, it contains both positive and negative links, corresponding to friend and foe relationships. Building on the concept of structural balance, we provide definitions of compatibility between pairs of users in a signed network, and algorithms for computing it. We then define the team formation problem in signed networks, where we ask for a compatible team of individuals that can perform a task with small communication cost. We show that the problem is NP-hard even when there are no communication cost constraints, and we provide heuristic algorithms for solving it. We present experimental results with real data to investigate the properties of the different compatibility definitions, and the effectiveness of our algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:uDGL6kOW6j0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access Path.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=12186497093306504468&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:F1b5ZUV5XREC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data engineering for mobile and wireless access",
            "Publication year": 2003,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/icde/2003/20710805/12OmNyuy9T4",
            "Abstract": "Together with wireless communication technologies, portable computers and hand-held devices provide a pervasive base for mobile computing. Mobile computing involves mobility of users, hardware, software and data. In addition to advances in communications and hardware, mobile and wireless access requires innovative theories and paradigms in data management and new data engineering techniques in order to cope with the inherent limitations of the mobile environment while satisfying the users’ new expectations and needs. This seminar aims at covering such data engineering aspects along two dimensions:(a) the wireless network perspective, and (b) the information processing perspective. Thus, this seminar provides a good overview of current methods and practices in building mobile information systems, examine mobile and wireless infrastructures and discuss challenging research problems in all …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Proceedings of the 19th International Conference on Extending Database Technology, EDBT",
            "Publication year": 2016,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01285191/",
            "Abstract": "Archive ouverte HAL - Proceedings of the 19th International Conference on Extending \nDatabase Technology, EDBT Accéder directement au contenu Accéder directement à la \nnavigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails \nAURéHAL API Data Documentation Episciences.org Episciences.org Revues \nDocumentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers \ndépôts Par type de publication Par discipline Par année de publication Par structure de \nrecherche Les portails de l'archive Recherche Documentation hal-01285191, version 1 \nDirection d'ouvrage, Proceedings, Dossier Proceedings of the 19th International \nConference on Extending Database Technology, EDBT Evaggelia Pitoura 1 Sofian \nMaabout 2 Georgia Koutrika 3 Amélie Marian 4 Letizia Tanca 5 Ioana Manolescu 6 Kostas \nStefanidis 7 Détails 1 Department of Computer Science [Ioannina-…",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:QYdC8u9Cj1oC",
            "Publisher": "OpenProceedings. org"
        },
        {
            "Title": "Research issues in mobile transactions",
            "Publication year": 2005,
            "Publication url": "https://scholar.archive.org/work/fp4nrjsvxfbktdc623o2jkbrru/access/wayback/http://drops.dagstuhl.de/opus/volltexte/2005/168/pdf/04441.SWM5.Paper.168.pdf",
            "Abstract": "This document focuses on transaction processing on mobile clients accessing a common set of data. The key requirement is to maintain all transaction properties as far as possible. We discuss three scenarios for databases on mobile clients, summarize typical applications and requirements for each of the three scenarios, and outline open research issues within each of the three scenarios. While the first scenario consists of mobile clients that are connected to a wired network, the second scenario consists of a network of mobile clients with a single-hop distance to each other but without a wired network, and the third scenario considers a network of mobile clients some of which are in multi-hop distance. The focus of our contribution is on distinguishing open problems from known solutions for each of the three scenarios. As the scenarios are increasingly challenging, we have identified additional requirements that occur within each new scenario compared to the previously discussed scenario.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data management for mobile computing",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=90EGCAAAQBAJ&oi=fnd&pg=PR7&dq=info:csIFTynaOEcJ:scholar.google.com&ots=qxyHP4STb5&sig=SgIvERc2EnBZaVXFP0LJ8VNHtJA",
            "Abstract": "Earth date, August 11, 1997\" Beam me up Scottie!\"\" We cannot do it! This is not Star Trek's Enterprise. This is early years Earth.\" True, this is not yet the era of Star Trek, we cannot beam captain James T. Kirk or captain Jean Luc Pickard or an apple or anything else anywhere. What we can do though is beam information about Kirk or Pickard or an apple or an insurance agent. We can beam a record of a patient, the status of an engine, a weather report. We can beam this information anywhere, to mobile workers, to field engineers, to a track loading apples, to ships crossing the Oceans, to web surfers. We have reached a point where the promise of information access anywhere and anytime is close to realization. The enabling technology, wireless networks, exists; what remains to be achieved is providing the infrastructure and the software to support the promise. Universal access and management of information has been one of the driving forces in the evolution of computer technology. Central computing gave the ability to perform large and complex computations and advanced information manipulation. Advances in networking connected computers together and led to distributed computing. Web technology and the Internet went even further to provide hyper-linked information access and global computing. However, restricting access stations to physical location limits the boundary of the vision.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Speeding-up cache lookups in wireless ad-hoc routing using bloom filters",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1651679/",
            "Abstract": "On demand routing protocols that exploit local caches have received a lot of attention lately in wireless ad-hoc networking. In this paper, we specifically address cache management, an issue that has been a main source of criticism for the applicability of such protocols. In particular, we tackle the problem of accessing the cache content efficiently. To this end, we propose summarizing the cache content so that we achieve efficient lookups. This not only saves both the restrictive resources of the wireless devices such as computational power and energy but also improves the overall protocol performance. We use Bloom filters as summaries. Our experimental results using the ns simulator show that both resource savings and performance improvements are attained when such filters are integrated within the DSR protocol which is one the most widely used instance of an on demand protocol",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Transaction management for cloud-based graph databases",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-29919-8_8",
            "Abstract": "Many graph databases, both open and proprietary, have been recently developed to efficiently store and manage graph structured data. As the volume of such data grows, graph databases most often offer distributed solutions implemented in a cloud infrastructure. In this paper, we focus on transaction management for such cloud-based graph databases. In particular, we use various graph databases as case studies to survey the different levels of transaction support and concurrency control protocols offered. We also study data distribution issues and replication protocols. Finally, we highlight open issues that need to be addressed in the future.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:IUKN3-7HHlwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Multiversion data broadcast organizations",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45710-0_12",
            "Abstract": "In recent years broadcasting attracted considerable attention as a promising technique of disseminating information to large number of clients in wireless environment as well as in the web. In this paper, we study different schemes of multiversion broadcast and show that the way broadcast is organized has an impact on performance, as different kind of clients needs different types of data. We identify two basic multiversion organizations, namely Vertical and Horizontal broadcasts, and propose an efficient compression scheme applicable to both. The compression can significantly reduce the size of the broadcast and consequently, the average access time, while it does not require costly decompression. Both organizations and the compression scheme were evaluated using simulation.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Accelerating Web service workflow execution via intelligent allocation of services to servers",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/article/journal-database-management-jdm/47420",
            "Abstract": "The appropriate deployment of web service operations at the service provider site plays a critical role in the efficient provision of services to clients. In this paper, the authors assume that a service provider has several servers over which web service operations can be deployed. Given a workflow of web services and the topology of the servers, the most efficient mapping of operations to servers must then be discovered. Efficiency is measured in terms of two cost functions that concern the execution time of the workflow and the fairness of the load distribution among the servers. The authors study different topologies for the workflow structure and the server connectivity and propose a suite of greedy algorithms for each combination.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Durable graph pattern queries on historical graphs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7498269/",
            "Abstract": "In this paper, we focus on labeled graphs that evolve over time. Given a sequence of graph snapshots representing the state of the graph at different time instants, we seek to find the most durable matches of an input graph pattern query, that is, the matches that exist for the longest period of time. The straightforward way to address this problem is by running a state-of-the-art graph pattern algorithm at each snapshot and aggregating the results. However, for large networks this approach is computationally expensive, since all matches have to be generated at each snapshot, including those appearing only once. We propose a new approach that uses a compact representation of the sequence of graph snapshots, appropriate time indexes to prune the search space and a threshold on the duration of the pattern to determine the search order. We also present experimental results using real datasets that illustrate the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:OTTXONDVkokC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tutorial 2: Mobile and Wireless Database Access for Pervasive Computing",
            "Publication year": 2000,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/icde/2000/05060694/12OmNzTYBVx",
            "Abstract": "We are in the midst of a wireless and mobile revolution. In the near future, a typical computing environment-business, personal, scientific or educational-will provide wireless network connectivity between powerful data servers and mobile, sometimes disconnected, computers and devices. This has created exciting opportunities for developing a wide range of innovative database applications and systems. However, an open question remains: What kind of system will be capable of offering scalable data services and exhibit scalable performance? Besides advances in communications and hardware, does achieving pervasive mobile computing require innovative theories and paradigms in data management or new data engineering techniques? The objective of this tutorial is to provide an answer to the above questions by presenting the current state-of-the-research and contrasting it with the state-of-the-practice …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:QD3KBmkZPeQC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Performance analysis of distributed search in open agent systems",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1213097/",
            "Abstract": "In open multi-agent systems agents need resources provided by other agents but they are not aware of which agents provide the particular resources. Most solutions to this problem are based on a central directory that maintains a mapping between agents and resources. However, such solutions do not scale well since the central directory becomes a bottleneck in terms of both performance and reliability. In this paper, we introduce a different approach: each agent maintains a limited size local cache in which it keeps information about k different resources, that is, for each of k resources, it stores the contact information of one agent that provides it. This creates a directed network of caches. We address the following fundamental problem: how can an agent that needs a particular resource find an agent that provides it by navigating through this network of caches? We propose and analytically compare the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A recall-based cluster formation game in peer-to-peer systems",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.14778/1687627.1687679",
            "Abstract": "In many large-scale content sharing applications, participants or peers are grouped together forming clusters based on their content or interests. In this paper, we deal with the maintenance of such clusters in the presence of updates. We model the evolution of the system as a strategic game, where peers determine their cluster membership based on a utility function of the query recall. Peers are guided either by selfish or altruistic motives: selfish peers aim at improving the recall of their own queries, whereas altruistic peers aim at improving the recall of the queries of other peers. We study the evolution of such clusters both theoretically and experimentally under a variety of conditions. We show that, in general, local decisions made independently by each peer enable the system to adapt to changes and maintain the overall recall of the query workload.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:JQOojiI6XY0C",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Recommending packages with validity constraints to groups of users",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-017-1082-9",
            "Abstract": "The success of recommender systems has made them the focus of a massive research effort in both industry and academia. Recent work has generalized recommendations to suggest packages of items to single users, or single items to groups of users. However, to the best of our knowledge, the interesting problem of recommending a package to a group of users (P2G) has not been studied to date. This is a problem with several practical applications, such as recommending vacation packages to tourist groups, entertainment packages to groups of friends or sets of courses to groups of students. In this paper, we formulate the P2G problem, and we propose probabilistic models that capture the preference of a group toward a package, incorporating factors such as user impact and package viability. We also investigate the issue of recommendation fairness. This is a novel consideration that arises in our …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:8xutWZnSdmoC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Communities: Concept-based querying for mobile services",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-31794-4_4",
            "Abstract": "In this paper, we consider semantic service discovery in a global computing environment. We propose creating a dynamic overlay network by grouping together semantically related services. Each such group is termed a community. Communities are organized in a global taxonomy whose nodes are related contextually. The taxonomy can be seen as an expandable, flexible and distributed semantic index over the system, which aims at improving service discovery. We present a distributed service discovery mechanism that utilizes communities for context-based service discovery. To demonstrate the viability of our approach, we have implemented an infrastructure for supporting communities as well as a prototype application that utilizes communities.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Diverse set selection over dynamic data",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6477041/",
            "Abstract": "Result diversification has recently attracted considerable attention as a means of increasing user satisfaction in recommender systems, as well as in web and database search. In this paper, we focus on the problem of selecting the k-most diverse items from a result set. Whereas previous research has mainly considered the static version of the problem, in this paper, we exploit the dynamic case in which the result set changes over time, as for example, in the case of notification services. We define the CONTINUOUS k-DIVERSITY PROBLEM along with appropriate constraints that enforce continuity requirements on the diversified results. Our proposed approach is based on cover trees and supports dynamic item insertion and deletion. The diversification problem is in general NP-hard; we provide theoretical bounds that characterize the quality of our cover tree solution with respect to the optimal one. Since results are …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:BwyfMAYsbu0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Locating objects in mobile computing",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/940733/",
            "Abstract": "In current distributed systems, the notion of mobility is emerging in many forms and applications. Mobility arises naturally in wireless computing since the location of users changes as they move. Besides mobility in wireless computing, software mobile agents are another popular form of moving objects. Locating objects, i.e., identifying their current location, is central to mobile computing. We present a comprehensive survey of the various approaches to the problem of storing, querying, and updating the location of objects in mobile computing. The fundamental techniques underlying the proposed approaches are identified, analyzed, and classified along various dimensions.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Routing Path Queries in Peer-to-Peer Systems",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.64.5500&rep=rep1&type=pdf",
            "Abstract": "Peer-to-peer systems are gaining popularity as a means to effectively share huge, massively distributed data collections. An important challenge in this context is discovering the appropriate data and services. In this paper, we consider peers that store XML documents. We show how an extension of traditional Bloom filters, called multi-level Bloom filters, can be used to route path queries in such a system. Two alternative ways are considered for building overlay networks of peers: one based on network proximity and one based on content similarity. Content similarity is derived from the similarity among filters. Our experimental results show that networks based on content similarity outperform those formed based on network proximity for finding all matching documents.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Contextual Database Preferences.",
            "Publication year": 2011,
            "Publication url": "http://cs.uoi.gr/~pvassil/publications/2011_DEB/DEB_2011.pdf",
            "Abstract": "As both the volume of data and the diversity of users accessing them increase, user preferences offer a useful means towards improving the relevance of the query results to the information needs of the specific user posing the query. In this article, we focus on enhancing preferences with context. Context may express conditions on situations external to the database or related to the data stored in the database. We outline models for expressing both types of preferences. Then, given a user query and its surrounding context, we consider the problem of selecting related preferences to personalize the query.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On relaxing contextual preference queries",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4417168/",
            "Abstract": "Personalization systems exploit preferences for providing users with only relevant data from the huge volume of information that is currently available. We consider preferences that dependent on context, such as the location of the user. We model context as a set of attributes, each taking values from hierarchical domains. Often, the context of the query may be too specific to match any of the given preferences. In this paper, we consider possible expansions of the query context produced by relaxing one or more of its context attributes. A hierarchical attribute may be relaxed upwards by replacing its value by a more general one, downwards by replacing its value by a set of more specific values or sideways by replacing its value by sibling values in the hierarchy. We present an algorithm based on a prefix-based representation of context for identifying the preferences whose context matches the relaxed context of the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the performance of flooding-based resource discovery",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1705462/",
            "Abstract": "We consider flooding-based resource discovery in distributed systems. With flooding, a node searching for a resource contacts its neighbors in the network, which in turn contact their own neighbors and so on until a node possessing the requested resource is located. Flooding assumes no knowledge about the network topology or the resource distribution thus offering an attractive means for resource discovery in dynamically evolving networks such as peer-to-peer systems. We provide analytical results for the performance of a number of flooding-based approaches that differ in the set of neighbors contacted at each step. The performance metrics we are interested in are the probability of locating a resource and the average number of steps and messages for doing so. We study both uniformly random resource requests and requests in the presence of popular (hot) resources. Our analysis is also extended to take …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bias in Knowledge Graph Embeddings",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9381459/",
            "Abstract": "In this paper, we study bias in knowledge graph embeddings. We focus on gender bias in occupations, but our approach is applicable to other types of bias. We start by proposing measures for identifying bias in the dataset (i.e., in the KG) and then present two methods for testing whether any bias in the dataset is amplified by the embeddings. First, we look for gender-specific occupation analogies in the embeddings. Second, we test whether link prediction (i.e., occupation prediction in our case) aggregates gender bias by proposing gender-dominated occupations to people of the corresponding gender more often than expected. Then, we use a debiasing approach based on projections on the gender subspace. We present experimental results using the Wikidata dataset and pretrained TransE embeddings. Our results show that there exists gender bias in the dataset and that such bias is amplified by the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:jgBuDB5drN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile agents for wireless computing: the convergence of wireless computational models with mobile-agent technologies",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:MONE.0000034705.10830.b7",
            "Abstract": "Wireless mobile computing breaks the stationary barrier and allows users to compute and access information from anywhere and at anytime. However, this new freedom of movement does not come without new challenges. The mobile computing environment is constrained in many ways. Mobile elements are resource-poor and unreliable. Their network connectivity is often achieved through low-bandwidth wireless links. Furthermore, connectivity is frequently lost for variant periods of time. The difficulties raised by these constraints are compounded by mobility that induces variability in the availability of both communication and computational resources. These severe restrictions have a great impact on the design and structure of mobile computing applications and motivate the development of new software models. To this end, a number of extensions to the traditional distributed system architectures have …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Iterator.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=18258205454492055813&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:PVjk1bu6vJQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Disc diversity: result diversification based on dissimilarity and coverage",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1208.3533",
            "Abstract": "Recently, result diversification has attracted a lot of attention as a means to improve the quality of results retrieved by user queries. In this paper, we propose a new, intuitive definition of diversity called DisC diversity. A DisC diverse subset of a query result contains objects such that each object in the result is represented by a similar object in the diverse subset and the objects in the diverse subset are dissimilar to each other. We show that locating a minimum DisC diverse subset is an NP-hard problem and provide heuristics for its approximation. We also propose adapting DisC diverse subsets to a different degree of diversification. We call this operation zooming. We present efficient implementations of our algorithms based on the M-tree, a spatial index structure, and experimentally evaluate their performance.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling aggression propagation on social media",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2468696421000215",
            "Abstract": "Cyberaggression has been studied in various contexts and online social platforms, and modeled on different data using state-of-the-art machine and deep learning algorithms to enable automatic detection and blocking of this behavior. Users can be influenced to act aggressively or even bully others because of elevated toxicity and aggression in their own (online) social circle. In effect, this behavior can propagate from one user and neighborhood to another, and therefore, spread in the network. Interestingly, to our knowledge, no work has modeled the network dynamics of aggressive behavior. In this paper, we take a first step towards this direction by studying propagation of aggression on social media using opinion dynamics. We propose ways to model how aggression may propagate from one user to another, depending on how each user is connected to other aggressive or regular users. Through extensive …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:PaBasH6fAo0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Mobile agents for World Wide Web distributed database access",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/877509/",
            "Abstract": "The popularity of the Web as a universal access mechanism for network information has created the need for developing Web-based DBMS client/server applications. However, the current commercial applet-based approaches for accessing database systems offer limited flexibility, scalability, and robustness. We propose a new framework for Web-based distributed access to database systems based on Java-based mobile agents. The framework supports lightweight, portable, and autonomous clients as well as operation on slow or expensive networks. The implementation of the framework using the aglet workbench shows that its performance is comparable to, and in some case outperforms, the current approach. In fact, in wireless and dial-up environments and for average size transactions, a client/agent/server adaptation of the framework provides a performance improvement of approximately a factor of ten. For …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Topic 14 mobile and ubiquitous computing",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11549468_115",
            "Abstract": "Wireless communications along with portable computers, digital assistants and sensor devices provide a pervasive base for mobile computing. However realizing truly ubiquitous mobile computing requires innovative theories, paradigms and applications in various research areas including algorithms, networking, software architectures and data management. Topic 14 covers all such aspects. This topic attracted 33 submissions showing the increasing interest in the field. From the submitted papers, 8 were accepted as full papers (24% acceptance rate). The selected papers cover various aspects of mobile and ubiquitous computing highlighting the diversity of the field and thus making up an interesting and stimulating track.Paper presentations are divided into three sessions. Two papers in the first session address consistency issues. In “Efficient and Fault-Tolerant Update Commitment for Weakly …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Advances in database technology-EDBT 2016: 19th International Conference on Extending Database Technology, Bordeaux, France, March 15-18, 2016: proceedings",
            "Publication year": 2016,
            "Publication url": "https://www.db-thueringen.de/receive/dbt_mods_30711",
            "Abstract": "Advances in database technology - EDBT 2016 – Digitale Bibliothek Thüringen Toggle \nnavigation Suche einfacherweitert Blättern EinrichtungenDokumenttypenSachgruppenPersonen \nSemesterapparate Aktuelle Liste Publizieren Dokumente einreichenLeitlinienVertragsbedingungen \nFAQ 0 Auf ihrer Merkliste befinden sich keine Dokumente. Merkliste öffnen 0 Auf ihrer Merkliste \nbefinden sich keine Dokumente. Merkliste öffnen FAQ Anmelden 1.Start Sammelwerk \nAdvances in database technology - EDBT 2016 Tagungsband 2016 CC BY-NC-ND 4.0 \nVeröffentlicht Advances in database technology - EDBT 2016 : 19th International Conference \non Extending Database Technology, Bordeaux, France, March 15-18, 2016 : proceedings \nPitoura, Evaggelia (Hrsg.); Maabout, Sofian (Hrsg.); Koutrika, Georgia (Hrsg.); Marian, Amelie \n(Hrsg.); Tanca, Letizia GND (Hrsg.); Manolescu, Ioana GND (Hrsg.); Stefanidis, Kostas (Hrsg.. …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:0CzhzZyukY4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "MDM 2015: 2015 IEEE 16th International Conference on Mobile Data Management: Proceedings",
            "Publication year": 2015,
            "Publication url": "https://scholars.cityu.edu.hk/en/publications/mdm-2015(b718db41-77e2-4956-8325-e0281aa1159c).html",
            "Abstract": "Full text of this publication does not contain sufficient affiliation information. With consent from the author (s) concerned, the Research Unit (s) information for this record is based on the existing academic department affiliation of the author (s).",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:7Hz3ACDFbsoC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Selectivity Estimation.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=9602033762904049090&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:ruyezt5ZtCIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "View Generator (VG): a mobile agent based system for the creation and maintenance of Web views",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1021759/",
            "Abstract": "The View Generator (VG) is a system that provides the necessary components for the definition, materialization, storage, maintenance and re-use of views over remote Web-accessible databases. Through the system, clients identify Web databases of interest, access their metadata and create personalized views that can be shared by other clients. Creating personalized views provides a more efficient way of data processing than directly issuing complex queries to the data sources especially in the case of lightweight and wireless clients that suffer from scarce local resources, limited bandwidth and high communication costs. VG's multi-tier architecture implemented using mobile Java agents allows automatic code deployment as well as dynamic relocation of views.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:ye4kPcJQO24C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Centrality-aware link recommendations",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2835776.2835818",
            "Abstract": "Link recommendations are critical for both improving the utility and expediting the growth of social networks. Most previous approaches focus on suggesting links that are highly likely to be adopted. In this paper, we add a different perspective to the problem by aiming at recommending links that also improve specific properties of the network. In particular, our goal is to recommend to users links that if adopted would improve their centrality in the network. Specifically, we introduce the centrality-aware link recommendation problem as the problem of recommending to a user u, k links from a pool of recommended links so as to maximize the expected decrease of the sum of the shortest path distances of  to all other nodes in the network. We show that the problem is NP-hard, but our optimization function is monotone and sub-modular which guarantees a constant approximation ratio for the greedy algorithm. We present …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:IRz6iEL74y4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data replication in p2p systems",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/data-replication-p2p-systems/40819",
            "Abstract": "Maintaining multiple copies of data items is a commonly used mechanism for improving the performance and fault-tolerance of any distributed system. By placing copies of data items closer to their requesters, the response time of queries can be improved. An additional reason for replication is load balancing. For instance, by allocating many copies to popular data items, the query load can be evenly distributed among the servers that hold these copies. Similarly, by eliminating hotspots, replication can lead to a better distribution of the communication load over the network links. Besides performance-related reasons, replication improves system availability, since the larger the number of copies of an item, the more site failures can be tolerated. In this chapter we survey replication methods applicable to p2p systems. Although there exist some general techniques, methodologies are distinguished according to the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Data Lockers: Mobile-Agent Based Middleware for the Security and Availability of Roaming",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=13670178862404589944&hl=en&oi=scholarr",
            "Abstract": "Accessing remote data anywhere and at anytime constitutes an important advantage in many business environments. However, when working with mobile devices, users face many problems related to:(1) device restrictions: mobile devices are resource-constrained, more vulnerable and fragile than stationary devices (dcvi. ir. exposure problems) and,(2) the communication media: wireless communications arc often unstable, asymmetric and expensive (media problems). To alleviate these problems, we present a service, the Lockers Rent Service, for keeping the data of mobile users in a secure and safe space in a proxy at the fixed network, thus providing a solution to the device exposure problems. Data stored in data lockers are available even when the mobile device is disconnected. Furthermore, specific tasks arc carried out at the fixed network on behalf of the mobile user, in this way relieving the media problems. The architecture of the Lor. ker Rent Service is based on mobile agents.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:v1_lew4L6wgC",
            "Publisher": "Springer Verlag"
        },
        {
            "Title": "A scalable hash-based mobile agent location mechanism",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1203597/",
            "Abstract": "In this paper, we propose a novel mobile agent tracking mechanism based on hashing. To allow our system to adapt to variable workloads, dynamic rehashing is supported The proposed mechanism scales well with both the number of agents and the number of moving and querying operations. We also report on its implementation in the Aglets platform and present performance results.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:eflP2zaiRacC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Related Work on Context-Aware Systems",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/39570712/Related_Work_on_Context-Aware_Systems20151031-21097-1ggkq28.pdf",
            "Abstract": "Schilit [1] notes that three important aspects of context are: where you are, who you are with, and what resources are nearby. Context encompasses more than just the user’s location, because other things of interest are also mobile and changing. Context includes lighting, noise level, network connectivity, communication costs, communication bandwidth, and even the social situation; eg, whether you are with your manager or with a co-worker.Context has been tied to ubiquitous computing, although the term has had several meanings that differ subtly. One challenge of mobile distributed computing is to exploit the changing environment with a new class of applications that are aware of the context in which they are run. Such context-aware software adapts according to the location of use, the collection of nearby people, hosts, and accessible devices, as well as to changes to such things over time. A system with these capabilities can examine the computing environment and react to changes to the environment.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Internal Report, Distributed Management of Data Laboratory, Computer Science Department, Univ. of Ioannina, Internal Report"
        },
        {
            "Title": "Distributed location databases for tracking highly mobile objects",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8140356/",
            "Abstract": "In current distributed systems, the notion of mobility is emerging in many forms and applications. Increasingly many users are not tied to a fixed access point but instead use wireless communications or dial-up services to access data independent of their physical location. Furthermore, mobile software, a popular example being mobile agents, is frequently used as a new form of building distributed network-centric applications. Tracking mobile objects, i.e. identifying their current location, is central to such settings. In this paper, we exploit the use of hierarchical distributed location databases, where each database site covers a specific geographical region and contains location information about all objects residing in it. For highly mobile objects, a scheme based on forwarding pointers enhanced with auxiliary caching techniques is presented, to reduce the cost of the overall network and database traffic generated by …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:f2IySw72cVMC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Query Plan.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=455314689337279958&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:hCrLmN-GePgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Query Optimization.",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=13607935160686567297&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:hMsQuOkrut0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "How people describe themselves on Twitter",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2484702.2484708",
            "Abstract": "Twitter, being both a micro-blogging service and a social network, has become one of the primary means of communicating and disseminating information online. As such, significant amount of research has been devoted to analyzing the Twitter graph, the tweets, and the behavior of its users. In this work, we undertake a study of the user profile bios on Twitter. The goal of our study is two-fold: first, to understand what Twitter users choose to expose about themselves in their profile bio, and second, to investigate if it is possible to exploit the information in the user bio for tasks such as predicting connections between Twitter users.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:MLfJN-KU85MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Replication routing indexes for xml documents",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.101.7639&rep=rep1&type=pdf",
            "Abstract": "Peer-to-peer systems have attracted considerable attention as a means of sharing content among large and dynamic communities of nodes. In this paper, we consider sharing of XML documents. We propose a simple yet efficient replication method that is based on replication routing indexes. A replication routing index for a node is a path-based XML index that summarizes access information for each of the links of the node. The replication routing indexes are used for determining both the granularity of the XML fragments to be replicated as well as the appropriate sites for placing the fragments. We also present experimental results of the deployment of our indexes in a dynamic unstructured peer-to-peer system.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic diversification of continuous data",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2247596.2247623",
            "Abstract": "Result diversification has recently attracted considerable attention as a means of increasing user satisfaction in recommender systems, as well as in web and database search. In this paper, we focus on the problem of selecting the k-most diverse items from a result set. Whereas previous research has mainly considered the static version of the problem, in this paper, we exploit the dynamic case in which the result set changes over time, as for example, in the case of notification services. We define the Continuous k-Diversity Problem along with appropriate constraints that enforce continuity requirements on the diversified results. Our proposed approach is based on cover trees and supports dynamic item insertion and deletion. The diversification problem is in general NP-complete; we provide theoretical bounds that characterize the quality of our solution based on cover trees with respect to the optimal solution …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Creating and maintaining replicas in unstructured peer-to-peer systems",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11823285_107",
            "Abstract": "In peer-to-peer systems, replication is an important issue as it improves search performance and data availability. It has been shown that optimal replication is attained when the number of replicas per item is proportional to the square root of their popularity. In this paper, we focus on updates in the case of optimal replication. In particular, we propose a new practical strategy for achieving square root replication called pull-then-push replication (PtP). With PtP, after a successful search, the requesting node enters a replicate-push phase where it transmits copies of the item to its neighbors. We show that updating the replicas can be significantly improved through an update-push phase where the node that created the copies propagates any updates it has received using similar parameters as in replicate-push. Our experimental results show that replicate-push coupled with an update-push strategy achieves …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "One is enough: distributed filtering for duplicate elimination",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2063576.2063643",
            "Abstract": "The growth of online services has created the need for duplicate elimination in high-volume streams of events. The sheer volume of data in applications such as pay-per-click clickstream processing, RSS feed syndication and notification services in social sites such Twitter and Facebook makes traditional centralized solutions hard to scale. In this paper, we propose an approach based on distributed filtering. To this end, we introduce a suite of distributed Bloom filters that exploit different ways of partitioning the event space. To address the continuous nature of event delivery, the filters are extended to support sliding window semantics. Moreover, we examine locality-related tradeoffs and propose a tree-based architecture to allow for duplicate elimination across geographic locations. We cast the design space and present experimental results that demonstrate the pros and cons of our various solutions in different …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Hybrid Approach to Temporal Pattern Matching",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9381453/",
            "Abstract": "Temporal graphs represent relationships and interactions among entities over time, such as those occurring among users in social, transaction, and telecommunication networks. The analysis of their temporal structure help us understand, and predict the behavior of their entities. A typical analysis task in graph networks is the finding of all appearances of an input graph pattern query. Such appearances are called matches. In this paper, we are interested in finding all matches of an interaction pattern query within temporal graphs. To this end, we propose a hybrid approach that achieves effective filtering of potential matches based both on structure and time. Our approach exploits a graph representation where edges are ordered by time. We present experiments with real datasets that illustrate the efficiency of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:PVgj2kMGcgYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TimeReach: Historical Reachability Queries on Evolving Graphs.",
            "Publication year": 2015,
            "Publication url": "http://repository.edulll.gr/edulll/retrieve/9786/3390_02_D3.1.Appendix.pdf",
            "Abstract": "Since most graphs evolve over time, it is useful to be able to query their history. We consider historical reachability queries that ask for the existence of a path in some time interval in the past, either in the whole duration of the interval (conjunctive queries), or in at least one time instant in the interval (disjunctive queries). We study both alternatives of storing the full transitive closure of the evolving graph and of performing an online traversal. Then, we propose an appropriate reachability index, termed TimeReach index, that exploits the fact that most real-world graphs contain large strongly connected components. Finally, we present an experimental evaluation of all approaches, for different graph sizes, historical query types and time granularities.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Challenges in mobile electronic commerce",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Jari-Veijalainen/publication/2431451_Challenges_in_Mobile_Electronic_Commerce/links/0c960519de24820d06000000/Challenges-in-Mobile-Electronic-Commerce.pdf",
            "Abstract": "Advances in wireless network technology and the continuously increasing number of users of hand held terminals make the latter an ideal channel for offering personalized services to mobile users and give pace to the rapid development of Mobile Electronic Commerce (MEC). MEC operates partially in a different environment than Internet E-Commerce due to the special characteristics and constraints of mobile terminals and wireless networks and the context, situations and circumstances that people use their hand-held terminals. In this paper, we discuss challenges in electronic commerce transactions including designing new business models, applications and services.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "JoDS volume 2-Guest editorial",
            "Publication year": 2005,
            "Publication url": "https://experts.umn.edu/en/publications/jods-volume-2-guest-editorial",
            "Abstract": "JoDS volume 2 - Guest editorial — Experts@Minnesota Skip to main navigation Skip to search \nSkip to main content Experts@Minnesota Logo Home Profiles Research Units University \nAssets Projects and Grants Research Output Press / Media Datasets Activities Fellowships, \nHonors, and Prizes Search by expertise, name or affiliation JoDS volume 2 - Guest editorial \nRoger King, Maria Orlowska, Elisa Bertino, Dennis McLeod, Sushil Jajodia, Leon Strous, Dave \nAbel, Karl Aberer, John Carlis, Tiziana Catarci, Brian Cooper, Guido Governatori, Michael \nKifer, Dik Lee, Li Qing, Leo Mark, Ravi Mukkamala, Erich Neuhold, Brajendra Panda, Evagelia \nPitoura Show 29 others Show less Amit Sheth, Antonio Si, Steffen Staab, Sean Wang, Yao \nChao, Roger Zimmermann, Cario Batini, Lois Delcambre, David W. Embley, Jérôme Euzenat, \nDieter Fensel, Nicola Guarino, Jean Luc Hainaut, Ian Horrocks, Larry Kerschberg, Maurizio , , …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:sNmaIFBj_lkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recommending packages to groups",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7837869/",
            "Abstract": "The success of recommender systems has made them the focus of a massive research effort in both industry and academia. Recent work has generalized recommendations to suggest packages of items to single users, or single items to groups of users. However, to the best of our knowledge, the interesting problem of recommending a package to a group of users (P2G) has not been studied to date. This is a problem with several practical applications, such as recommending vacation packages to tourist groups, entertainment packages to groups of friends, or sets of courses to groups of students. In this paper, we formulate the P2G problem, and we propose probabilistic models that capture the preference of a group towards a package, incorporating factors such as user impact and package viability. We also investigate the issue of recommendation fairness. This is a novel consideration that arises in our setting …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:KbBQZpvPDL4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Geometric-similarity retrieval in large image bases",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/994757/",
            "Abstract": "We propose a novel approach to shape-based image retrieval that builds upon a similarity criterion which is based on the average point set distance. Compared to traditional techniques, such as dimensionality reduction, our method exhibits better behavior in that it maintains the average topology of shapes independently of the number of points used to represent them and is more resilient to noise. An efficient algorithm is presented based on an incremental \"fattening,\" of the query shape until the best match is discovered. The algorithm uses simplex range search techniques and fractional cascading to provide an average polylogarithmic time complexity on the total number of shape vertices. The algorithm is extended to perform additional fast approximate matching, when there is no image sufficiently similar to the query image. We present techniques for the efficient external storage of the shape base and of the …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data organization issues for location-dependent queries in mobile computing",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44472-6_12",
            "Abstract": "We consider queries which originate from a mobile unit and whose result depends on the location of the user who initiates the query. Example of such a query is How many people are living in the region I am currently in?” We execute such queries based on location-dependent data involved in their processing. We build concept hierarchies based on the location data. These hierarchies define mapping among different granularities of locations. One such hierarchy is to generate domain knowledge about the cities that belong to a state. The hierarchies are used as distributed directories to assist in finding the database or relation that contains the values of the location-dependent attribute in a particular location. We extend concept hierarchies to include spatial indexes on the location-dependent attributes. Finally, we discuss how to partition and replicate relations based on the location to process the queries …",
            "Abstract entirety": 0,
            "Author pub id": "3r_xVvkAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Modeling and storing context-aware preferences",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11827252_12",
            "Abstract": "Today, the overwhelming volume of information that is available to an increasingly wider spectrum of users creates the need for personalization. In this paper, we consider a database system that supports context-aware preference queries, that is, preference queries whose result depends on the context at the time of their submission. We use data cubes to store the associations between context-dependent preferences and database relations and OLAP techniques for processing context-aware queries, thus allowing the manipulation of the captured context data at different levels of abstractions. To improve query performance, we use an auxiliary data structure, called context tree, which indexes the results of previously computed preference-aware queries based on their associated context. We show how these cached results can be used to process both exact and approximate context-aware preference queries.",
            "Abstract entirety": 1,
            "Author pub id": "3r_xVvkAAAAJ:P5F9QuxV20EC",
            "Publisher": "Springer Berlin/Heidelberg"
        }
    ]
}]