[{
    "name": "Ευθαλία Δημαρά",
    "romanize name": "Efthalia Dimara",
    "School-Department": "Οικονομικών Επιστημών",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 8393,
    "Scholar name": "Efthalia Dimara",
    "Scholar id": "4F-8cl4AAAAJ",
    "Affiliation": "Professor, University of Patras",
    "Citedby": 2169,
    "Interests": [
        "Applied Statistics",
        "Data Analysis"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=4F-8cl4AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "The day after grant-aid: business development schemes for small rural firms in lagging areas of Greece",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1008163517068",
            "Abstract": "This paper investigates the need for providing follow up business development instruments to small rural businesses that have benefited from grant aid assistance schemes. A sample of 76 small rural businesses in lagging areas of insular Greece is included in the present survey, and ranks thirteen possible business growth instruments. It is found that business development instruments are ranked according to each firm's economic and human capital characteristics. Furthermore, most firms need the concurrent provision of more than one instrument. Likewise, a mixture of business specific schemes, regulatory interventions and infrastructure projects, better serves their business development needs. Results from the present survey indicate that an integrated business development strategy in lagging areas of Greece should be supported by modern, flexibly tailored combinations of assistance, using complex …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:ufrVoPGSRksC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Strategic orientation and financial performance of firms implementing ISO 9000",
            "Publication year": 2004,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/02656710410511704/full/html?fullSc=1",
            "Abstract": "The ISO 9000 scheme has been reproved for being a paper driven process with little if no impact on firm performance. As international scientific literature indicates a wide range of factors leading to the adoption of the ISO 9000 schemes, the impact of this adoption should be viewed and examined in a framework of the firms’ strategic orientation. A sample of Greek businesses that adopted the ISO 9000 scheme in the early 1990s is classified into three categories of strategic orientation, namely cost leadership, market differentiation and focus strategy. If all the firms are pooled together, there is no significant difference in their financial performance indicators after a period of six years following the adoption of ISO 9000. However, if the firms are examined separately and according to their strategic orientation, those firms pursuing a cost leadership strategy present statistically significant growth of financial profitability …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:9yKSN-GCB0IC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "BUSINESS NETWORKS AND INNOVATION THEMATIC STUDY",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=5034141783414696277&hl=en&oi=scholarr",
            "Abstract": "This thematic paper is based on a survey of 600 businesses in twelve case study areas located in six member states of the European Union. The business survey was complemented by a survey of institutions that have in various ways involved with business networks. The overall aim of this thematic study was to examine the impact of business networking and innovation on the operation of businesses and to the development of the regions in which they operate. Business networks and innovation are thought of as factors assisting businesses to overcome regional (locational) disadvantages and operate independently (aspatially) of location. Thus, the major research question dealt with location. Why certain remote areas (areas of type A) present higher economic dynamism from certain less remote areas (areas of type B)? Can these differences in economic development be attributed to factors that act independently …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Consumer's appreciation of regional image and the perceived quality of rural tourism",
            "Publication year": 2002,
            "Publication url": "https://www.econstor.eu/handle/10419/115740",
            "Abstract": "Tourists' perception of regional image is critical as regards the degree of satisfaction obtained from the overall tourism experience. The present paper analyses the ways in which a region's image is incorporated into the tourist products and the overall tourism experience. Regional image is acknowledged to entail elements of the socio-cultural, environmental and historical heritage of a region. The latter affect the quality of the tourist product as perceived by the tourists. Consequently, they also affect the tourist's subjective judgement of satisfaction based on the quality of the tourism experience they have 'consumed'. The present paper utilizes data drawn from an EU Research Project (SPRITE QLK5-CT-2000-01211) survey conducted in two regional sites of rural tourism in Greece. Analysis and results focus especially on comparisons between the two study regions. Further, policy implications as regards the development of the rural tourism product, are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:kNdYIx-mwKoC",
            "Publisher": "Louvain-la-Neuve: European Regional Science Association (ERSA)"
        },
        {
            "Title": "Refers_To_DOI NOT FOUND IN META-DATA. TXT, please check and proceed",
            "Publication year": 2017,
            "Publication url": "https://cyberleninka.org/article/n/102971.pdf",
            "Abstract": "This data article provides a data description on all subsamples related to the research article entitled “Don’t change my towels please: Factors influencing participation in towel reuse programs”(E. Dimara, E. Manganari, D. Skuras, 2017)[1]. The dataset was compiled from a field questionnaire survey of 1304 tourists in Greece that captured key demographic, behavioral and psychographic characteristics. The dataset is split into distinct sub-samples that differ depending on whether tourists chose to respond to certain parts of the questionnaire or not. We provide descriptive statistics for the entire sample and all sub-samples as well the questionnaire's version in English and the econometric procedures to analyze this complex dataset. This dataset will allow researchers to",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Productive efficiency and firm exit in the food sector",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306919207000504",
            "Abstract": "This work examines the effects of productive efficiency on the survival of firms in the Greek food sector. Technical and scale efficiency scores are computed within a data envelopment analysis (DEA) framework and are used as explanatory variables in a parametric (Weibull) survival model. High technical efficiency increases the median survival time and lowers the hazard rate of exit. As the scale efficiency of a firm operating either at increasing or decreasing returns to scale approaches one (1), its theoretically maximum value, the expected median survival time, is maximized for all types of exits. Developments in biotechnology, the evolution of alternative food supply networks, innovations in the food sector and competition policy are likely to affect technical and scale efficiency of food manufacturing firms. Results unraveling the effects of technical and scale efficiency on the survival of firms in the food sector are of …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:roLk4NBRz8UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The Adoption of Information and Communication Technologies among",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=12910563449438544505&hl=en&oi=scholarr",
            "Abstract": "Information and communication technologies (ICTS) have now become strategic technologies that permit transactions almost globally and among all sectors of the economy. Major policies relating to their diffusion have been planned and launched by the EU and by national states in the last two decades. Such policies aim at accessing new, distant markets and increasing competitiveness. Regionally implemented policies have focused both on creating infrastructure and networks and on assisting innovative actions towards developing technology applications",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Consumers’ willingness to pay premium for green hotels: Fact or Fad",
            "Publication year": 2015,
            "Publication url": "http://archives.marketing-trends-congress.com/2015/pages/PDF/151.pdf",
            "Abstract": "In the early 2000’the focal question regarding green lodging was whether it had a chance in aligning green value with corporate performance (Kirstges, 2002). Nowadays the lodging industry still produces considerable carbon dioxide emissions and consumes large quantities of water, energy and non-renewable resources, while academic insights support that an environmentally friendly corporate strategy positively affects hotels’ performance (Leonidou, Leonidou, Fotiadis, and Zeriti, 2013;",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Business Networks and Performance: a spatial approach",
            "Publication year": 2003,
            "Publication url": "https://www.econstor.eu/handle/10419/116097",
            "Abstract": "Business networks are associated to increased business performance and are regarded as a major factor influencing the development of rural and lagging areas. It is assumed that businesses access many networks in order to pursue their short and long term entrepreneurial objectives. The most important spatial features of this business-network relationship are firstly the spatial coverage of the network and secondly the location of the business in relation to its markets. As concerns the spatial coverage of the networks we distinguish between vertical and horizontal business networks. Vertical networks allow local enterprises to forge alliances with externally located consumers, suppliers, distributors, retailers and institutions, while horizontal networks provide relationships with locally based producers, institutions, and consumers. As concerns the location of the business in relation to its markets we distinguish between firms located in accessible locations and firms located in less accessible and peripheral locations in relation to their output markets. A survey of 160 businesses in the manufacturing and services sectors in two areas of Greece (one remote and one more accessible) is used to test empirically the effects of the spatial features of the business-network relationship on firm performance. Business performance is approximated through a series of measures capturing conventional firm growth and other less conventional managerial objectives. The analysis demonstrates that a significantly high proportion of successful businesses located in the remote area simultaneously access vertical and horizontal networks while in the less remote area …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:KlAtU1dfN6UC",
            "Publisher": "Louvain-la-Neuve: European Regional Science Association (ERSA)"
        },
        {
            "Title": "Back to basics: The Comanor–Wilson MES index revisited",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11187-007-9081-y.pdf",
            "Abstract": "The present article attempts to investigate the validity of the Comanor–Wilson Minimum Efficient Size (MES) measure. The basic assumption is that firms that have exhausted scale economies are in non-increasing returns to scale. The same firms are also assumed to have a size greater than MES estimated on sales (total turnover), employment or fixed assets. Data Envelopment Analysis (DEA) is used, on a sample of firms in three Greek manufacturing industries, to classify firms in operation according to increasing or non-increasing returns to scale. On the basis of the results of the DEA input oriented model, the MES measure correctly predicts over 85% of the cases. A probit model is applied to those cases that are not identically predicted by MES concerning returns to scale. Results indicate that technical efficiency, size and age are the factors that compel MES to yield the same prediction as the DEA …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A review of online crowdsourcing platforms",
            "Publication year": 2016,
            "Publication url": "https://ojs.lib.uom.gr/index.php/seeje/article/view/9045",
            "Abstract": "Over the years a great number of different websites have emerged that offer crowd sourcing services, which aim at taking advantage of the vast number of anonymous workers globally available to complete tasks. In this paper we review and analyze existing websites providing crowdsourcing services in an attempt to establish a framework that will allow systematic discussion, comparison and assessment of existing crowdsourcing platforms.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Firm efficiency and survival",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=14783649149342576966&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effects of ISO 9001 on firms' productive efficiency",
            "Publication year": 2006,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/01443570610691111/full/html",
            "Abstract": "This work sets out to explore the effects of ISO 9001 on productive efficiency of firms.A sample of 1,572 firms from three Greek manufacturing industries is used for empirical work. The firms are from the food and beverages industries, the machineries industries as well as from the electrical and electronics appliances manufacturing industries and include both adopters and non‐adopters of ISO 9001. A stochastic frontier methodological approach is adopted and the effects of ISO 9001 can be modeled in four ways: as a managerial input alongside the conventional inputs of capital and labor, as a factor affecting technical inefficiency, as an input and a factor affecting technical inefficiency and as having no effect at all.ISO 9001 operates as a factor affecting technical inefficiency with non‐neutral effects on capital and labor. The combined effect of ISO 9001 with …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:UeHWp8X0CEIC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Quality, imagery and marketing: producer perspectives on quality products and services in the lagging rural regions of the European Union",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.0435-3684.2001.00088.x",
            "Abstract": "A range of factors, including consumer concerns about food safety, the growing popularity of rural tourism and policy initiatives to promote endogenous rural development, is converging to promote a relocalization of food production and service provision, especially in those regions marginalized by the globalization of the food supply system. The recent outbreak of foot and mouth disease in the UK has starkly illustrated the fragility of localized systems which depend heavily on consumers travelling to them. Within such a context, the importance of successful marketing strategies has become even more apparent. This paper reports on a questionnaire survey which investigated promotional and marketing strategies among a diverse range of producers and service providers in marginal agricultural areas of the EU. The findings suggest that many producers are situated towards the “formal” end of a marketing continuum …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:_FxGoFyzp5QC",
            "Publisher": "Blackwell Publishers Ltd."
        },
        {
            "Title": "Consumer preferences for extrinsic versus intrinsic quality cues for image products: the case of Greek quality wine",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810892_0006",
            "Abstract": "The extrinsic quality cues of certification and packaging (bottling) and the intrinsic quality cues of aroma and taste are assumed to influence consumer preferences and the decision to purchase the product. Prior research suggests that, for most utilitarian products, intrinsic cues are more important than extrinsic cues. However, evidence suggests that this hypothesis might not be valid for image products. Quality wine, which is an image product, to a great extent, is used for examining consumer preferences towards these two sets of cues. A sample of 744 Greek wine consumers is used to assess the factors influencing consumer attitudes towards these quality cues. An ordered probit model with sample selectivity reveals that these quality cues are valued by consumers and are perceived to be highly important. Furthermore, they possess different socioeconomic and demographic characteristics. Results support the …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adoption of agricultural innovations as a two‐stage partial observability process",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1574-0862.2003.tb00137.x",
            "Abstract": "In this paper, we reconsider the appropriateness of certain statistical analyses in innovation adoption studies and suggest that partial observability models may sometimes be more useful. The proposed models allow for a flexible specification of the process of adoption from one stage to two stages, facilitate the modelling of non‐adopters and remedy the violation of the assumption of full information. An application to the adoption of organic cultivation in Greece demonstrates the relative merits of the proposed analysis.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Consumer demand for informative labeling of quality food and drink products: a European Union case study",
            "Publication year": 2005,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/07363760510589253/full/html",
            "Abstract": "The purpose of this work is to examine the range of information consumers seek on labels of quality products and construct an indicative check‐list of various types of informational labeling as well as to examine whether quality of information demanded segregates the market‐creating segments to be targeted by firms.An extensive interdisciplinary literature review based on findings in marketing, economics, geography and sociology reveals the often neglected range of factors forcing consumers to place importance on regionally denominated food and drink. The European Union (EU) has responded to growing consumer trends towards regional and traditional food and established special schemes regulating the production of such food and drink. A survey of 640 consumers of quality wine carried out within the framework of an EU‐funded program provides the empirical …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:u-x6o8ySG0sC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Survey data on factors influencing participation in towel reuse programs",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2352340916307284",
            "Abstract": "This data article provides a data description on all subsamples related to the research article entitled “Don’t change my towels please: Factors influencing participation in towel reuse programs” (E. Dimara, E. Manganari, D. Skuras, 2017) [1]. The dataset was compiled from a field questionnaire survey of 1304 tourists in Greece that captured key demographic, behavioral and psychographic characteristics. The dataset is split into distinct sub-samples that differ depending on whether tourists chose to respond to certain parts of the questionnaire or not. We provide descriptive statistics for the entire sample and all sub-samples as well the questionnaire׳s version in English and the econometric procedures to analyze this complex dataset. This dataset will allow researchers to include the study׳s results in future elaborated meta-analyses and/or gain a better insight to the study׳s major conclusions.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:TQgYirikUcIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Consumer evaluations of product certification, geographic association and traceability in Greece",
            "Publication year": 2003,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/03090560310465099/full/html",
            "Abstract": "Certification, geographic association and traceability of food and drink products are quality cues that have not been extensively researched by the current academic literature. These quality cues are highly valued by consumers possessing certain socio‐economic and demographic characteristics that form distinct and clearly‐defined market segments. A sample of 744 Greek wine consumers is used to assess the factors influencing consumer evaluations towards quality cues. An ordered probit model with sample selectivity reveals that these attributes are valued as highly important by consumers possessing certain socioeconomic and demographic characteristics. The type and source of information received by consumers, their place of origin, income, age, sex, education and marital status all exert an independent effect on the evaluation process. The use of such quality cues may be potentially useful in creating …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:2osOgNQ5qMEC",
            "Publisher": "MCB UP Ltd"
        },
        {
            "Title": "Greek Agriculture in a changing international environment",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=OvmADwAAQBAJ&oi=fnd&pg=PT6&dq=info:CwTvoA5gTZEJ:scholar.google.com&ots=yd2ODrRouY&sig=WneXVuIRWM9JxApjiQUjNdFEd_g",
            "Abstract": "Published in 1998, the aim of this text is to promote awareness of the evolution of Greek agriculture, as well as of the development of national strategies, in conformity with the Common Agricultural Policy provision-which is important for a successful confrontation of modern and prospective international challenges. It offers a case study developing integrated policies for unemployment, for prevention of diversification of rural areas and for provision of solutions to the problem of increasing competition, while enhancing environmental quality and making rational use of productive resources.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Rural tourism and visitors' expenditures for local food products",
            "Publication year": 2006,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00343400600660771",
            "Abstract": "S kuras D., D imara E. and P etrou A (2006) Rural tourism and visitors' expenditures for local food products, Regional Studies 40, 769–779. European rural development policy has supported the production of local and regionally denominated food as a means to differentiate agricultural production, and rural tourism as a means to diversify rural employment. The aim of the present work is to address tourists' decision to buy local food products while visiting lagging rural areas and the amount of money spent over these products. The findings should be of particular interest to practitioners of rural development as they point out to possible market segmentation and communication potentials, and reflect on differences between accessible and less accessible rural areas.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Routledge"
        },
        {
            "Title": "Don't change my towels please: Factors influencing participation in towel reuse programs",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0261517716301637",
            "Abstract": "Towel reuse is the flagship of hotel environmental practices. This paper examines the effects of consumer demographic, psychographic and behavioral characteristics influencing a two-stage decision making process including participation and support to a towel reuse program. A meta-analysis shows that 53% of customers are willing to financially support green hotels. A survey of 1304 Greek and foreign hotel customers in tourism hot spots in Greece reveals that 72% of hotel customers would adopt a towel reuse program while 44.1% are willing to pay extra an average of 2.15 euros per day to support it. Younger customers and customers that book high-priced hotels or with higher length of stay exhibit higher willingness to pay extra for towel reuse programs. As rising water and energy shortages in specific tourism hotspots bring hotels' environmental integration under increased scrutiny, the focal findings hold …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:HDshCWvjkbEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Agricultural policy for quality and producers’ evaluations of quality marketing indicators: a Greek case study",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306919204000405",
            "Abstract": "The European Union’s (EU’s) ‘quality’ policy for agriculture offers producers a scheme for the certification of regional speciality food. Certification conveys a wide range of signals to both consumers and producers. For producers in particular, certification may be viewed either as a protection or as a promotion mechanism, or both. Evidence shows that, despite the active support offered to the policy, producers have not been convinced that certification is an important quality indicator bearing marketing advantages. Furthermore, producers valuing certification as an important quality indicator form a clear segment in the population of producers. Policy should attempt to raise awareness of the promotion advantages of quality certification among producers, and employ a mechanism that will reduce the free-riders issue by involving the producers in the certification acquisition process.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:LkGwnXOMwfcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Capital subsidies and job creation in rural areas: A Greek case study",
            "Publication year": 2003,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/01437720310507947/full/html",
            "Abstract": "Assesses the job creation effects of capital subsidies provided to small and medium enterprises in rural and lagging areas. The proposed methodology takes account of extensive censoring of job creation among assisted rural firms, endogeneity of the capital stock change resultant from capital subsidies, and the extensive part‐time and seasonal job requirements in rural areas. Capital stock change, as a result of grant aid is negatively related to the decision to create new jobs and to the extent of job creation given that some employment is created. Evidence of this work provides the ground for discussing the effectiveness and implications of using capital subsidies as a job creation instrument within rural development policies.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:hqOjcs7Dif8C",
            "Publisher": "MCB UP Ltd"
        },
        {
            "Title": "Beyond the Lexical Sense of Online Reviews: The Role of Emoticons and Consumer Experience",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/iwc/article-abstract/32/5-6/475/6168219",
            "Abstract": "The present study focuses on the effect of emoticon use in online consumer reviews (OCRs) on consumers’ booking intention and the moderating effect of consumer personal characteristics. Consumers’ prior experience and their reliance on OCRs are embedded in the research model. A 2 × 2 (review valence * emoticon use) experimental study is designed, and an econometric model is used. Results show that the interaction between review valence and emoticons affect booking intention. Consumers with no prior experience are mainly affected by the cognitive aspects of their experience (i.e. review credibility and attitude toward the review) while experienced consumers are affected by the experiential aspects of booking process (i.e. entertainment, satisfaction and social influence). Consumers that rely on OCRs are affected by emoticons while consumers without review reliance are affected by emoticons only …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Regional Development Incentives and Firm Survival: A Case Study of the Greek Food Sector",
            "Publication year": 2000,
            "Publication url": "https://www.econstor.eu/bitstream/10419/114840/1/ERSA2000_209.pdf",
            "Abstract": "Greek regional development policy has a long history in the provision of financial incentives to firms. In 1982 the Greek law 1262/82 provided a coherent framework for the financial support of firms comprised of a combination of grant-aid incentives and interest rate subsidization or tax allowances and increased depreciation rates. In 1990, Greek law 1982/90 replaced the previous regional development framework by completing and amending the provided incentives. Thus, the operation of financial incentives to firms may be regarded as almost smoothly continuous up to date. Research on the impacts of financial aid provision to firm survival is not well developed in the regional economics literature. However, it is ascertained that financial aid may have significant impacts on firm survival per se, as well as on quantitative and qualitative attributes of firm death such as the time length to failure, and the type of failure. Firm failure to survive in its current form and structure may be due to three",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Louvain-la-Neuve: European Regional Science Association (ERSA)"
        },
        {
            "Title": "Adoption of a quality assurance scheme and its effect on firm performance: a study of Greek firms implementing ISO 9000",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/0954412022000010163",
            "Abstract": "An analysis of 143 firms in the Greek manufacturing and service sectors reveals that adopters of ISO 9000 quality assurance schemes are larger companies producing intermediate goods, but less profitable and with higher leverage than their non-adopter counterparts. The effects of adopting an ISO 9000 scheme on firm performance and especially on certain dimensions of profitability are not significant in a period of 5-6 years after adoption. Evidence suggests that the adoption of an ISO 9000 quality assurance scheme, being a continuous process of improvement, is beneficial in the long term and does not necessarily improve financial ratios in the short term. Active support policies for the promotion and dissemination of quality standards in the manufacturing and service sectors of Greece can be reconsidered and a more targeted policy should be implemented. Future research may be designed and …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:u5HHmVD_uO8C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Resources and activities complementarities: the role of business networks in the provision of integrated rural tourism",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/14616680701647634",
            "Abstract": "This paper focuses on the role of business networks, and especially on the ways in which formal and informal interactions among economic agents shape the tourist product. Local businesses are considered as agents who realize and/or create economic opportunities and develop new goals and strategies. Businesses are not viewed as independent entities, but as actors whose actions are embedded in structures of ongoing relations. As such, similar resources and activities based in rural tourism destinations do not necessarily have the same consequences at different times and places. Business networking is a crucial factor in organizing activities and resources at the local level, leading to spatially different levels of integration. Such differences are focused on here, using illustrative examples and findings from the case-study regions in the UK, Spain and Greece.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:W7OEmFMy1HYC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Greening the lodging industry: Current status, trends and perspectives for green value",
            "Publication year": 2016,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13683500.2015.1021668",
            "Abstract": "The purpose of this paper is to provide a critical review of extant knowledge on green lodging integration and a compilation of empirical studies that examine the greening of the lodging industry, published between 2003 and 2014. Empirical academic studies are grouped in three pillars: (a) studies that focus on corporate perspective, (b) studies that examine the role of governmental and trade organizations and (c) studies that focus on consumers’ perceptions in regard to hotels’ green integration. Accumulated knowledge is further presented in a structured way, through a Summary Table. Finally, the paper aims at setting the future research agenda in the area of green lodging by highlighting areas where results are equivocal, areas with evolving research attention and research issues that would enhance our understanding towards a greener lodging industry.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:ZeXyd9-uunAC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Business Networks and Performance: a spatial approach",
            "Publication year": 2003,
            "Publication url": "https://www.econstor.eu/handle/10419/116097",
            "Abstract": "Business networks are associated to increased business performance and are regarded as a major factor influencing the development of rural and lagging areas. It is assumed that businesses access many networks in order to pursue their short and long term entrepreneurial objectives. The most important spatial features of this business-network relationship are firstly the spatial coverage of the network and secondly the location of the business in relation to its markets. As concerns the spatial coverage of the networks we distinguish between vertical and horizontal business networks. Vertical networks allow local enterprises to forge alliances with externally located consumers, suppliers, distributors, retailers and institutions, while horizontal networks provide relationships with locally based producers, institutions, and consumers. As concerns the location of the business in relation to its markets we distinguish between firms located in accessible locations and firms located in less accessible and peripheral locations in relation to their output markets. A survey of 160 businesses in the manufacturing and services sectors in two areas of Greece (one remote and one more accessible) is used to test empirically the effects of the spatial features of the business-network relationship on firm performance. Business performance is approximated through a series of measures capturing conventional firm growth and other less conventional managerial objectives. The analysis demonstrates that a significantly high proportion of successful businesses located in the remote area simultaneously access vertical and horizontal networks while in the less remote area …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:UebtZRa9Y70C",
            "Publisher": "Louvain-la-Neuve: European Regional Science Association (ERSA)"
        },
        {
            "Title": "Enhancing the impact of online hotel reviews through the use of emoticons",
            "Publication year": 2017,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/0144929X.2016.1275807",
            "Abstract": "Online consumer reviews (OCRs) have received increasing scrutiny in recent years. The present study focuses on the effect of OCRs on consumers’ perceptions and attitudes, when pictorial representation of consumer emotions is used in online hotel reviews. A 2 × 2 experimental study is designed to examine the effect of two independent variables: review valence (positive vs. negative) and emoticons use (no emoticons vs. emoticons). Research findings show that positive OCRs result in more positive attitude and higher booking intention. Interestingly, the presence of emoticons in negative reviews strengthens the review credibility and usefulness, but attenuates consumers’ attitude towards the hotel and their booking intention. Managerial implications and research opportunities are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Deciphering the effects of agglomeration economies on firms' productive efficiency",
            "Publication year": 2011,
            "Publication url": "https://www.econstor.eu/handle/10419/120065",
            "Abstract": "The present work assess the effects of MAR and Jacob's type agglomeration economies on a sample of firms in the machineries and textiles industries in Greece for the periods 1989-91 and 1999-01. The analysis employs a stochastic production frontier function and allows agglomeration economies to enter as inputs and/or as factors reducing inefficiency. Results re-confirm that the effects of agglomeration economies are industry specific. In our study, the machineries industry benefits from MAR type agglomeration economies and the textiles industry benefits from Jacob's type agglomeration economies. Agglomeration economies may exercise a twin effect on firms' productive efficiency. First, as in the case of the machineries industry in our study, MAR agglomeration economies may act as a new input and affect the kernel of the production frontier. Second, agglomeration economies may act as a factor reducing technical inefficiency with non-neutral effects with labour and capital as in the case of both the machineries and the textiles industries in our study. Finally, it is indicated that agglomeration economies establish a type of \"path dependence\" for firms. Firms that make significant use of agglomeration economies survive to the next period at higher percentages in comparison to other firms in the same industry. At the same time, entrants are favoured by MAR type agglomeration economies while incumbents are favoured by Jacob's type agglomeration economies.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Louvain-la-Neuve: European Regional Science Association (ERSA)"
        },
        {
            "Title": "Factors Influencing the Integration of Alternative Farm Enterprises Into the Agro‐Food System",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1549-0831.2001.tb00071.x",
            "Abstract": " Financial stress and general crisis in European agriculture recently have generated a widespread interest in alternative paths of farm business development and structural adjustment. One of the options suggested by policy makers and adopted by farmers was the development of alternative farm enterprises (AFEs), in which farmers recombine resources on the farm and produce a new mix of products and services in order to supplement their incomes. In the present paper we examine the factors influencing the development of AFEs. According to empirical evidence from Etolia‐Akarnania, a prefecture in western Greece that merits “less favored area” status, AFE adoption is influenced by the amount of family labor, the ratio of hired to family labor, the presence of tobacco as a main enterprise, the proximity of the farm to grade A roads, and the farmers' age. Education, management experience demonstrated by the …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "The impacts of regulated notions of quality on farm efficiency: A DEA application",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377221703006349",
            "Abstract": "Recent European Union policy has attempted to regulate agricultural quality production through schemes that either place emphasis on the physical properties and the geographical zone of production of denominated products or on methods and processes of production of organic products. This paper attempts to examine the effects of these two distinct regulated notions of quality on farm efficiency, by estimating efficiency scores using data envelopment analysis (DEA) on a sample of Greek black currant producers who either employ conventional methods of production or organic methods, and who are located either inside or outside a denominated zone of quality production. Findings indicate that the location of the farm significantly affects the technical and scale efficiency scores in the sample of conventional producers, while it does not have any statistically significant effect in the sample of organic farmers. Thus …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:WF5omc3nYNoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "The effects of regional capital subsidies on productivity growth: A case study of the Greek food and beverage manufacturing industry",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.0022-4146.2006.00445.x",
            "Abstract": " Capital subsidies form a major instrument of industrial and regional policy for economically developed countries all over the world, including many European Union and Organisation for Economic Cooperation and Development countries. Research findings have challenged the effectiveness of capital subsidies in assisting productivity growth. This paper treats capital subsidies as a new input and estimates a stochastic production frontier that is not bound by the restrictions imposed by approaches used in previous research works. It is shown that capital subsidies affect total factor productivity growth through technical change and not through scale efficiency, while the disadvantaged location of firms affects technical efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:Y0pCki6q_DkC",
            "Publisher": "Blackwell Publishing Ltd/Inc."
        },
        {
            "Title": "Regional image and the consumption of regionally denominated products",
            "Publication year": 2004,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1080/0042098042000194115",
            "Abstract": "A number of quality products and services, often catering for niche markets, have become associated with certain regions. This geographical association has proved important in influencing the mentality of urban consumers, their behaviour and, consequently, the demand for such products. This work identifies three sets of elements of the regional resource base that contribute towards consumer-constructed regional images-namely, factors related to nature and the environment; factors related to history, tradition and heritage; and amenity experiential factors. The relation between consumer-constructed regional images and a variety of consumer needs is discussed. Data from a wide survey of Greek wine consumers are utilised and a microeconometric approach is employed to test the effects of consumer-constructed regional images on consumer expenditure on regional wines.",
            "Abstract entirety": 1,
            "Author pub id": "4F-8cl4AAAAJ:qjMakFHDy7sC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "The socio‐economics of niche market creation: A social ecology paradigm for the adoption of organic cultivation in Greece",
            "Publication year": 2003,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/03068290310460134/full/html",
            "Abstract": "Farmers’ decision to adopt organic cultivation and create niche markets is their response to the changing notions of quality and the gradual abandonment of the productivist logic in agriculture. This decision is analyzed within a multi‐level social ecological context designed to account simultaneously for all facets/parts of the farmer's decision‐making process. Social ecology provides a contextual platform conceptualizing global‐regional‐local relationships within which niche markets for food products are created. Emphasis is placed on farmers’ perception of the “environment” within which they have to decide on their participation in a policy scheme. Elements of the macro (global), meso (national/regional) and micro (farm household) “environmental” levels, affect the farmer's decision to adopt organic cultivation. Accordingly, a decision‐making tree reflecting how farmers perceive that environment and form their …",
            "Abstract entirety": 0,
            "Author pub id": "4F-8cl4AAAAJ:Se3iqnhoufwC",
            "Publisher": "MCB UP Ltd"
        }
    ]
}]