[{
    "name": "Ευριπίδης Χατζηκρανιώτης",
    "romanize name": "Evripidis Chatzikraniotis",
    "School-Department": "Φυσικής",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 9997,
    "Scholar name": "E Hatzikraniotis",
    "Scholar id": "K5h2ihoAAAAJ",
    "Affiliation": "Unknown affiliation",
    "Citedby": 1610,
    "Scholar url": "https://scholar.google.com/citations?user=K5h2ihoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A non-ideal memristor device",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7378393/",
            "Abstract": "In this brief, the memristive behavior of a very simple device, that of a tungsten filament bulb, is reported. In specific, this kind of element operates as a non-ideal memristor, thus demonstrating a Type-II non-crossing, pinched hysteretic loop. A brief description of this experimental behavior from the perspective of memristive properties, is apposed.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Characterization and in vitro bioactivity study of ternary glass-ceramic coatings",
            "Publication year": 2007,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/characterization-and-in-vitro-bioactivity-study-of-ternary-glassceramic-coatings/CAD1E7C14511A0AED6E6FDE788A14DAF",
            "Abstract": "The aim of the present study was to test the in vitro bioactive behavior of two new ternary mixtures consisting of a glass-ceramic porcelain, a bioactive glass and alumina (PBA) as coatings on dental glass ceramic substrates. They consisted of bioactive glass- in the system SiO2-Na2O-CaO-P2O5−, powder from a leucite-fluorapatite glass ceramic and γ-Al2O3 in 50-42.5-7.5 wt % respectively, while coatings with the same two components in 50-50 wt % ratio, without Al2O3, served as control. The characterization of the coatings was performed by Scanning Microscopy (SEM-EDS), Fourier Transform Infrared Spectroscopy (FTIR) and X-Ray Diffraction (XRD). The in vitro bioactivity was tested in Simulated Body Fluid (SBF) and the surfaces of reacted specimens were examined by SEM and FTIR. All coatings presented rough surface, while FTIR spectra revealed the characteristic peaks of the crystallized phases in the …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:lSLTfruPkqcC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Effect of antimony-doping and germanium on the highly efficient thermoelectric Si-rich-Mg2 (Si, Sn, Ge) materials",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925838817314779",
            "Abstract": "Two series of materials (a) Mg2Si0.55-ySn0.4Ge0.05Sby, 0 ≤ y ≤ 0.0175 and (b) Mg2Si0.5875-xSn0.4GexSb0.0125, 0 ≤ x ≤ 0.20 have been developed and studied in terms of structural features and thermoelectric properties/performance. The materials were prepared by a combination of low temperature reaction, ball milling process and hot pressing consolidation. Structure and composition across all relevant length scales was monitored by using XRD, SEM, TEM and HRTEM analysis and the influence of Sb-doping and Ge-addition on the phase structure and thermoelectric transport properties is presented. All different existing phases (Si-rich, Sn-rich and Ge-rich regions) contribute to the overall thermoelectric performance, having varying compositions in terms of the Bi dopant. Moreover, the coexistence of microstructural constituents and nanostructures formed in these materials is discussed explaining the …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The experimental model of a non-ideal memristor",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495165/",
            "Abstract": "In this paper, the experimental study and the related evaluation of the memristive behavior demonstrated by a simple device, a tungsten filament bulb, is presented. It was found that this device operates as a non-ideal memristor, demonstrating a Type-II non-crossing, pinched hysteretic loop, while the evaluation of experimental results clearly hints to assorting the type of this device as an extended memristor.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "What does “Nanoscience–Nanotechnology” mean to primary school teachers?",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10763-021-10199-6",
            "Abstract": "Nanoscience and nanotechnology (NST) focus on the creation and the exploration of materials’ properties at the nanoscale. The estimations about the impact of the field on our daily life, the industrial demands for ensuring skilled workforce, and the need to form a nano-literate citizenry have triggered the incorporation of aspects of this cutting-edge field into school curricula on behalf of education researchers. Teachers play a vital role in the success of this endeavor. However, only a few studies up to date examine teachers’ ideas of this field. In addition, there is not any analysis tool that would provide insights about how teachers’ ideas are related to the key concepts and principles of NST. Concerning this gap, we describe in detail a deductive content analysis method, having been conducted to examine the meanings that 419 Greek primary school teachers give to NST. Results reveal the insufficient content …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:HeT0ZceujKMC",
            "Publisher": "Springer Singapore"
        },
        {
            "Title": "Effect of sintering in ball-milled K2Bi8Se13 thermoelectric nano-composites",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022459612003015",
            "Abstract": "K2Bi8Se13 has many attractive features for thermoelectric applications. Recently, K2Bi8Se13-based nanocomposite materials, consisting of nano-crystalline, micro-crystalline and amorphous phases, have been fabricated based on powder technology techniques. The Seebeck coefficient has been enhanced while the thermal conductivity has been decreased presenting, thus, interesting behavior. The behavior of the materials under heat treatment conditions is now of interest, as the application of sintering process is necessary for the development of thermoelectric modules. In this work, the crystallization of the K2Bi8Se13-based nano-composites is studied using Differential Scanning Calorimetry. The results show that crystallization follows a multiple-step process with different activation energies. The thermoelectric properties are also discussed in the range that crystallization occurs.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A study on science teachers´ use of design features of a simulated visual laboratory to develop active involvement of students in the teaching of thermodynamics at senior high school",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64597",
            "Abstract": "In this paper we describe a small-scale exploratory study on how in-service science teachers of Greek senior high schools can take advantage of facilities included in a simulated visual Lab to create innovative open activities for teaching Thermodynamics. The visual laboratory used, is part of ‘SEP’, a micro-world for the teaching of thermal phenomena that is designed as an open environment with a high degree of user interaction and direct manipulation of virtual objects, multiple real time graphs and high consistency with scientific content. The sample of the study consists of experienced high school teachers. Teachers were asked to propose ways they envision to use the open environment facilities of SEP to improve students’ involvement and make up for some difficulties in specific chapters of Thermodynamics. The results show that the teachers managed to compose ways of didactic exploitation in the form of worksheets for their students. They suggested specific well-articulated ways to explore the open nature of the micro-world within its specification, while, at the same time, they revealed a positive disposition concerning its possible use.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:bnK-pcrLprsC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Power and Efficiency calculation and evaluation of material properties in Thermoelectric Power Generators",
            "Publication year": 2007,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/power-and-efficiency-calculation-and-evaluation-of-material-properties-in-thermoelectric-power-generators/A74153B468936E70125716ECE43F54E7",
            "Abstract": "Thermoelectric elements convert a part of thermal power into electrical, developing the Seebeck effect. A number of thermoelectric elements can be connected electrically in parallel and/or in series shaping a thermoelectric generator (TEG) device. The generator efficiency, η, is determined by comparing the amount of electricity produced (PTEG) to the total amount of heat induced (QH). The possible use of such a device for the recovery of wasted heat can considerably help the world effort for energy savings and the reduction of greenhouse gases. A measuring system and a modeling approach which takes into account the thermal contact resistances have been developed, allowing the characterization of TEG devices under various loads and temperature gradients and thus, the evaluation of material properties. The model was applied on investigating the expected gained power and efficiency, at different places of …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:roLk4NBRz8UC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Structural Characterization of Nano-crystalline Mg2Si Prepared by Ball Milling",
            "Publication year": 2010,
            "Publication url": "https://www.scientific.net/AST.74.48",
            "Abstract": "In this work, nano-crystalline Mg2Si powder was prepared by ball milling and structural studies vs ball milling time are presented. The identification of the phases of the materials and the evaluation of their purity were performed using Powder X-ray diffraction (PXRD). Crystallite size evolution during ball milling was followed by PXRD and single line analysis, based on Scherrer equation. Transmission Electron microscopy (TEM) observations and IR Reflectivity measurements were used for the investigation of nano-features and confirmation of the PXRD results.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "On the optical properties of thermoelectric alkali metal chalcogenide compounds",
            "Publication year": 2005,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/on-the-optical-properties-of-thermoelectric-alkali-metal-chalcogenide-compounds/4C76A8DBEDC8FAF0D6F214E4A0FF3657",
            "Abstract": "Solid solutions of K2Bi8−XSbXSe13 is an interesting series of complex bismuth-chalcogenide compounds, which are attractive for thermoelectric investigations. The highly anisotropic structure in these compounds results in needle-like morphology along the b- crystallographic axis, leaving structural tunnels where K+ ions reside. The complex electronic structure that arises from a large and low symmetry unit cell and the weakly bound K+ ions, lead to high Seebeck coefficient, highly anisotropic electrical properties and very low thermal conductivity. Reflectivity spectra in the FIR region are presented for several members in the Sb-rich (x≥6) side. Optical investigations are carried out on crystalline and pelletized samples. The received spectra are analyzed, examined comparatively and discussed. Results indicate that upon Bi/Sb substitution in the Sb-rich region, phonons develop a mixed-mode behavior in the FIR …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:olpn-zPbct0C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Web-based Virtual Labs",
            "Publication year": 2015,
            "Publication url": "https://www.academia.edu/download/59043481/15._Molohides_et_al.Lisbon.CSEDU_2015_15320190426-52909-1d8eds7.pdf",
            "Abstract": "1Physics Department, Αristotle University of Thessaloniki, Thessaloniki, Greece 2Elementary Education, 8th Elementary School of Kalamaria, Thessaloniki, Greece 3Secondary Education, Nea Zichni Lyceum, Thessaloniki, Greece 4Department of Primary Education, Αristotle University of Thessaloniki, Thessaloniki, Greece",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:kh2fBNsKQNwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Long-term performance of a commercial thermoelectric power generator",
            "Publication year": 2009,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/longterm-performance-of-a-commercial-thermoelectric-power-generator/375EDB9434D9F60B2EF268F121D13D97",
            "Abstract": "In this work, thermoelectric device was made, using a commercially available ThermoElectric Generator (TEG), in order to measure the gained power and efficiency for long-term performance. The module was subjected to sequential hot side heating at 200°C (392 0F), and cooling for 6000 cycles, in order to measure the TEG's power and EMF change. A 14% increase in the TEG’s material resistance was found, as well as a 5% reduction in the Seebeck coefficient. After the experiment, the module was disassembled and thermoelectric p- and n- legs were examined using IR spectroscopy.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Analysis of phase separation in high performance PbTe–PbS thermoelectric materials",
            "Publication year": 2013,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.201201944",
            "Abstract": "Phase immiscibility in PbTe–based thermoelectric materials is an effective means of top‐down synthesis of nanostructured composites exhibiting low lattice thermal conductivities. PbTe1‐x Sx thermoelectric materials can be synthesized as metastable solid solution alloys through rapid quenching. Subsequent post‐annealing induces phase separation at the nanometer scale, producing nanostructures that increase phonon scattering and reduce lattice thermal conductivity. However, there has yet to be any study investigating in detail the local chemical structure of both the solid solution and nanostructured variants of this material system. Herein, quenched and annealed (i.e., solid solution and phase‐separated) samples of PbTe–PbS are analyzed by in situ high‐resolution synchrotron powder X‐ray diffraction, solid‐state 125Te nuclear magnetic resonance (NMR), and infrared (IR) spectroscopy analysis. For high …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:TQgYirikUcIC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Fostering students’ understanding with web-based simulations in an inquiry continuum framework",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-34127-9_8",
            "Abstract": "The purpose of this project was to study the use of network simulations and alternative after-class teaching methods in educational process, as well as studying the effects on learning ability and understanding. Inquiry continuum was used as a framework for the design of the simulations. The Illustrations–Explorations–Problems approach was used for the introduction of the topic to students through simulations. Students worked with worksheets, developed on the Predict–Observe–Explain strategy, with varying guidance according to inquiry continuum. The research was conducted with 63 high school students. A total of 343 worksheets were collected and analyzed. Results showed an increased performance for all students, regardless their previous knowledge and an increased certainty about the given answers. Students were able to develop new skills in handling technological tools and critical thinking, as …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Formation of Mg2Si thick films on Si substrates using pack cementation process",
            "Publication year": 2012,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4731532",
            "Abstract": "Magnesium silicide (Mg2Si) is a prospective narrow gap semiconductor for thermoelectric energy conversion at high temperatures. In this work, chemical vapour deposition by pack cementation process was used, for the first time, for the formation of Mg2Si compound. A series of experiments were carried out at temperatures 450°C to 650°C with deposition times at 15 to 180min. As a result thick films have been prepared, depending on growth temperature and deposition time. Mg2Si was formed as a result of the Mg diffusion into the Si matrix. The film thickness increased with the deposition time, and temperature. The identification of these films, with different methods, revealed that they contained only pure Mg2Si phase without any MgO phase.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:M3ejUd6NZC8C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "n-to-p Transition on K2Bi8-xSbxSe13 Series",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4133362/",
            "Abstract": "beta-K 2 Bi 8 Se 13  and its solid solutions have been found to be interesting for thermoelectric investigations mainly due to their low thermal conductivity and highly anisotropic electrical properties. Solid solution series of the type K  2 Bi 8-x Sb x Se 13 , K 2-x  Rb x Bi 8 Se 13  as well as K 2  Bi 8 Se 13-x S x  has been studied. Interestingly, K 2 Bi 8-x Sb x Se 13  presents both n- and p-type of character depending on the Sb concentration in the lattice. In this work, the n-to-p transition with Sb concentration is presented. The Seebeck coefficient is discussed as a function of x and the transition at room temperature appears at the stoichiometric region of x ~ 6. The transition temperature for the members of the series increases with Sb incorporation in the lattice and this can be attributed to the band gap increase",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High-temperature charge and thermal transport properties of the n-type thermoelectric material PbSe",
            "Publication year": 2011,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.84.155207",
            "Abstract": "We present a detailed study of the charge transport, infrared optical reflectivity, and thermal transport properties of n-type PbSe crystals. A strong scattering, mobility-limiting mechanism was revealed to be at play at temperatures above 500 K. The mechanism is indicative of complex electron-phonon interactions that cannot be explained by conventional acoustic phonon scattering alone. We applied the first-order nonparabolicity approximation to extract the density-of-states effective mass as a function of doping both at room temperature and at 700 K. The results are compared to those of a parabolic band model and in light of doping-dependent studies of the infrared optical reflectivity. The thermal conductivity behavior as a function of temperature shows a strong deviation from the expected Debye-Peierls high-temperature behavior (umklapp dominated) indicating an additional heat-carrying channel, which we …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:LkGwnXOMwfcC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Educational software for improving learning aspects of Newton’s Third Law for student teachers",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-009-9087-y",
            "Abstract": "In this paper, we present the design, development, implementation and evaluation of educational software “Newton-3”, aiming at the learning of Newton’s Third Law by student-teachers who are not Physics majors. We describe the theoretical issues of our teaching approach and the various software tasks that we designed in order to promote students’ understanding. Specifically, the software is designed for the teaching of gravitational and electrostatic interactions between two distant bodies at rest. It is a web-based application and runs on a simple web browser with Macromedia Flash plug-in installed. The development of software and its integration into teaching–learning sequence is based on three main characteristics: the range of contexts in which the concept of force interaction applies, in the specification of the concept, and in an appropriate teaching learning environment (IDRF). We trialled the …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:D03iK_w7-QYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Modeling of thermal conductivity in high performing thermoelectric materials",
            "Publication year": 2017,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/785/1/012004/meta",
            "Abstract": "The enhanced TE-performance in Mg2Si-Mg2Sn based pseudo-binaries is presented, which is attributed to low thermal conductivity. Sn-Si alloying, reduces the lattice thermal conductivity due to mass fluctuation. Furthermore, miscibility gap in the Sn-Si substitution causes the formation of composites, with Si-rich and Sn-rich phases, which span from mm to nm scale, and these nano-inclusions reduce further lattice thermal conductivity.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:Ri6SYOTghG4C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Investigation of the valence band structure of PbSe by optical and transport measurement",
            "Publication year": 2013,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/investigation-of-the-valence-band-structure-of-pbse-by-optical-and-transport-measurement/F12983A337DCCDD86FD9140171641399",
            "Abstract": "We investigated the valence band structure of PbSe by a combined study of the optical and transport properties of p-type Pb1-xNaxSe, with Na concentrations ranging from 0 – 4%, yielding carrier densities in a wide range of 1018 – 1020 cm−3. Room temperature infrared reflectivity studies showed that the susceptibility (or conductivity) effective mass m* increases from ∼ 0.06m o to ∼ 0.5m o on increasing Na content from 0.08% to 3%. The Seebeck coefficient scales with doping in the whole temperature range, yielding lower values for higher Na contents, while the Hall coefficient increases on heating from room temperature showing a peak close to 650 K. The room temperature Pisarenko plot is well described by the simple parabolic band model up to ∼ 1·1020 cm−3. In order to describe the behaviour in the whole concentration range, the application of the two band model, i.e. light hole and heavy hole, was …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:35N4QoGY0k4C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Application of the Thermal Quadrupole Method in the Characterization of Thermoelectric Modules",
            "Publication year": 2007,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/application-of-the-thermal-quadrupole-method-in-the-characterization-of-thermoelectric-modules/6B4ABB2467E0693DF2D725C808BAB206",
            "Abstract": "Measurements of assembled thermoelectric (TE) modules commonly include investigations of the module output power versus load resistance. Using an AC electrical measurement for TE modules, a model of equivalent passive RC circuit has been developed and tested for both the thermal and electrical characteristics of the module. In this work we present and analyze data of a commercially available module, using equivalent passive RC circuit, to examine, explain and model the electro-thermal activity in the module. In addition data we analyzed by thermal quadrupole theory. Measurements were taken over the frequency range of 0,5mHz to 50 Hz and the device performance (ZT) was evaluated from measured data.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Layer by layer deposition of alternate carbon nanotubes and Ni films for efficient multilayer thin film temperature gauges",
            "Publication year": 2019,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6463/aaf692/meta",
            "Abstract": "This study reports a novel approach for growing multilayer thin films consisting of alternate layers of carbon nanotubes (CNT) and nickel on Si (1 0 0) substrates and justifies their use in thin film temperature sensors. A low pressure chemical vapor deposition system was employed for synthesizing CNT films, while Ni films were deposited by electrodeposition. Porous-Si was used as substrate to increase adhesion between the layers of the multilayer structure. The structure of the multilayer films and the quality of the CNT grown were analyzed using several characterization methods, including scanning electron microscopy, x-ray photoelectron spectroscopy, x-ray auger electron spectroscopy and Raman spectroscopy. The electrical characteristics were investigated using a van der Pauw setup and the effect of the increasing number of CNT layers in the multilayer structure was studied. The sensitivity of the multilayer …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:8d8msizDQcsC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Back Matter for Volume 1449",
            "Publication year": 2012,
            "Publication url": "https://aip.scitation.org/doi/pdf/10.1063/v1449.backmatter",
            "Abstract": "Back Matter for Volume 1449 Page 1 AUTHOR INDEX A Abad, B. 354 Agresti, F. 191, 211 \nAguirre, Myriam H. 421 Aleksandrova, E. 467 Aleksic, OS 143 Alleno, E. 271 Almarza, A. 354 \nAmantia, D. 354 Anatychuk, L. 5 Anatychuk, LI 373, 509, 516, 536 Andersson, Ronnie 497 \nAndroulakis, J. 155 Anno, Hiroaki 259 Arai, Koya 463 Ares, JR 183, 450 Athanasopoulos, GI \n323 B Bakkali, A. El 475 Ballikaya, Cedat 235 Barison, S. 191, 211 Barry, Matthew 69 Bastian, \nGeorg 431 Battiston, S. 191, 211 Bayer, B. 61 Bédécarrats, JP 520 Becker, M. 389 Beneš, L. \n267 Bensch, W. 163 Bérardan, D. 319 Bernik, Slavko 331 Bilewska, Katarzyna 247, 397 Blank, \nV. 283 Blaschkewitz, P. 365 Bøjesen, Espen Drath 335 Bodiul, Pavel P. 295 Boikov, Yuri A. \n107 Boldrini, S. 191, 211 Bondarenko, Alexander 123 Bos, J. -WG 83 Botnari, Oxana V. 291 \nBöttner, H. 163 Bougrioua, Zahia 435 Brignone, Mauro 493 Briones, F. 354 Brisset, F. 319 , . '…",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:JoZmwDi-zQgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Students’ design of experiments: an inquiry module on the conduction of heat",
            "Publication year": 2010,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0031-9120/45/4/002/meta",
            "Abstract": "This article examines secondary students' design of experiments after engagement in an innovative and inquiry-oriented module on heat transfer. The module consists of an integration of hands-on experiments, simulated experiments and microscopic model simulations, includes a structured series of guided investigative tasks and was implemented for a sample of 24 lower secondary (compulsory education) school students in Greece. A post-instructional assessment comprising written tests and interviews of the sample of students was employed. The findings revealed that after implementation of the module, a respectable number of the students showed ability in experiment design skills such as forming hypotheses and successfully describing experimental procedure.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Modeling the dynamical behavior of memristive {NiTi} alloy at constant stress for time-varying electric current input signals",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2107.11060",
            "Abstract": "The dynamical electric behavior of a NiTi smart alloy thin filament when driven by time varying current pulses is studied by a structure-based phenomenological model that includes rate-based effects. The simulation model relates the alloy's electrical resistivity to the relative proportions of the three main structural phases namely Martensite, Austenite and R-phase, experimentally known to exist in NiTi alloy lattice structure. The relative proportions of the phases depend on temperature and applied stress. Temperature varies due to the self-heating of the filament by the Joule effect when a current pulse passes and also due to convective/radiative interchange with the ambient. The temperature variation with time causes structural phase transitions, which result in abrupt changes in the sample resistivity as the proportions of each lattice phase vary. The model is described by a system of four 1st-order nonlinear differential-algebraic equations yielding the temporal evolution of resistivity and output voltage across the filament for any given time-varying input current pulse. The model corresponds to a 4th-order extended memristor, described by four state variables, which are the proportions of each of the three NiTi lattice phases and temperature. Simulations are experimentally verified by comparing to measurements obtained for samples self-heated by triangular current input waveforms as well as for passively samples with no current input. Numerical results reproduce very well measurements of resistance vs. temperature at equilibrium as well as the full dynamics of experimentally observed I-V characteristic curves and resistance vs. driving current for …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:yMeIxYmEMEAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effect of Bi-doping and Mg-excess on the thermoelectric properties of Mg2Si materials",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022369714000936",
            "Abstract": "In this work, Bi-doped magnesium silicide compounds were prepared by applying a combination of both, short-time ball milling and heating treatment. The effect of Mg excess was also studied, aiming towards further improvement in thermoelectric properties. The structural modifications of all materials were followed by Powder X-ray diffraction and Scanning Electron Microscopy. Highly dense pellets of Mg2Si1−xBix (0≤x≤0.035) and Mg2+δSi0.975Bi0.025 (δ=0.04, 0.06 and 0.12) were fabricated via hot pressing and studied in terms of Seebeck coefficient, electrical and thermal conductivities and free carrier concentration. Their thermoelectric performance, at high temperature range, is presented and the maximum value of the dimensionless-figure-of-merit (ZT) is found to be 0.68 at 810 K, for Mg2Si0.97Bi0.03.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Mechanical Alloying Synthesis of K 2 Bi 8 Se 13–type Solid Solutions",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1557/PROC-1044-U03-07",
            "Abstract": "Solid solutions of β-K2Bi8-xSbxSe13 are an interesting series of materials for thermoelectric investigations due to their very low thermal conductivity and highly anisotropic electrical properties. In this work, we aimed to synthesize solid solutions of β-K2Bi8-xSbxSe13 type materials using powder techniques. The synthesis was based on mechanical alloying as well as sintering procedures. The products were studied in terms of structural features, composition and purity with powder x-ray diffraction, scanning electron microscopy and energy dispersive spectroscopy. Preliminary results on thermoelectric properties as well as IR reflectivity measurements are presented.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Preface: 9th European Conference on Thermoelectrics",
            "Publication year": 2012,
            "Publication url": "https://aip.scitation.org/doi/pdf/10.1063/1.4731483",
            "Abstract": "This volume contains selected papers presented in the 9 th European Conference on Thermoelectrics,(ECT2011) which was held in Thessaloniki, Greece, on September 28-30, 2011. European Conferences on Thermoelectrics (ECT) are promoted by the European Thermoelectric Society for favouring the dissemination of the scientific and technical progress in the field of thermoelectrics.ECT2011 aimed to enhance communication between research institutions and industries for the promotion of ΤΕ applications and to provide a forum for exchange of information and achievements. The scope of ECT2011 covers a wide range of scientific research that bridges the gap between basic science and applications on thermoelectrics. The conference topics were: Theory, such as theoretical studies of bulk materials, nanoscale and low-dimensional induced effects, novel concepts and related physical phenomena …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "The Iterative Evolution of a Teaching-Learning Sequence on the Thermal Conductivity of Materials",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-7808-5_11",
            "Abstract": "An innovative inquiry-oriented teaching-learning sequence (TLS) has been developed aiming at introducing secondary education students in Greece to inquiry as well as to a comprehensive treatment of thermal conductivity in materials. The focus of the paper is the iterative evolution of this TLS following cycles of iterative evolution from an initial TLS1 towards TLS2 and subsequently to TLS3. The social and educational reasons for selecting conductivity as a content and introducing inquiry as pedagogical strategy to a traditional context are discussed. Design principles, content, and selection of a strategy for gradual implementation of an integrative inquiry in the TLSs are outlined. Multiple sources of data from students and teachers were used for evidence-based modifications of the content and activities of these TLS. Their selective presentation is based on a reflective ex post facto approach focusing on the …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Synthesis and Thermoelectric Properties of low-x Bi {sub 2} Se {sub 3-x} S {sub 3} Series",
            "Publication year": 2010,
            "Publication url": "https://www.osti.gov/biblio/21371503",
            "Abstract": "Bi{sub 2}Se{sub 3}-xS{sub x} solid solutions, with low x values, were synthesized from melt. The solid solutions were studied in terms of phase purity using powder X-ray diffraction (PXRD) in order to find the maximum x value for the preservation of the single Bi2Se3-type phase. The lattice parameters were estimated and showed the reduced unit cell with the S incorporation in the lattice. SEM images confirmed the plate-like morphology of the Bi{sub 2}Se{sub 3}-xS{sub x} single-phase members. The thermoelectric properties (Seebeck coefficient and electrical conductivity) as well as IR reflectivity were also studied on members with x<0.4 that were found to form single phase Bi{sub 2}Se{sub 3}-xS{sub x} solid solutions.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICT-enhanced teaching of electrical circuits",
            "Publication year": 2015,
            "Publication url": "http://mocast.physics.auth.gr/images/Papers/PAPER_41F.pdf",
            "Abstract": "Electricity-related concepts, such as electric current, voltage and resistance, are important concepts taught at all levels of education. However, teaching electric circuits poses many challenges for both the teacher and the students, mainly due to poor students’ ability to visualize the basic concepts. In this work, we address this problem through an overview of ICT available aids and software for teaching electrical circuits.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrating ICT tools in a laboratory teaching sequence of thermal phenomena",
            "Publication year": 2005,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64659",
            "Abstract": "This work refers to aspects of the development and implementation of a sequence of ICT based laboratories and their integration in high school physics in the area of heat. The objective of extensive use of ICT based tools in the labs was to facilitate the enhancement of students’ understanding of the main concepts of heat as well as the development of their graphing and experimental skills. The ICT tools used in this sequence are the “Coach II” - MBL platform and the visual laboratory “Thermolab”. MBL provides a strong link between real-life phenomena and their graphic representation while “Thermolab” provides an open environment in which students can quickly and easily change or structure experimental set ups to conduct parametric investigations of the phenomena. The main lab sequence consists of 4 modules: thermal equilibrium, calorimetry, phase transitions and heat radiation. Emphasis was put on enhancing students understanding of temperature equilibrium following research on students’ conceptions. The implementation of the sequence took place in a class of lower high school (age 13-14 yrs.). Preliminary analysis of results suggest an understanding of several aspects of thermal equilibrium and use of the “caloric” model by the students, and the development of their graphing skills.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "University of Zilina"
        },
        {
            "Title": "Study of Thermoelectric Power Generators and Application in a Small Sized Car",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.544.4154&rep=rep1&type=pdf",
            "Abstract": "Waste heat recovery from car’s exhaust gases provides an opportunity to significantly improve the overall car engine efficiency. One approach for recovering energy from the exhaust gases is to generate electrical power through thermoelectric (TE) conversion. The economic competitiveness of this technology is determined by the capital investment (cost per watt) and reliability of the thermoelectric elements. A thermoelectric device, using a commercially available thermoelectric generator module (TEG) was made, in order to measure the gained power and efficiency at different places of the exhaust pipe of a small size car (Toyota Starlet, 1300cc), for various engine loads. With the use of a modeling approach, we evaluated the thermal contact resistances and their influence on the final device efficiency. The methodology used can also be applied to thermoelectric elements with better\" figure of merit\" ZT and respectively higher power output. Furthermore, the repercussion on fuel consumption was examined and the principles and ways of implementation were discussed.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Proccedings of the 6th European Conference on Thermoelectrics, Paris, France, p. P2-18-1"
        },
        {
            "Title": "Structure, morphology and electrical properties of Mg2Si layers deposited by pack cementation",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169433213015614",
            "Abstract": "Magnesium silicide (Mg2Si) is a promising narrow gap semiconductor which can be used as a thermoelectric material. Chemical vapor deposition by pack cementation, which is a simple and low cost technique, was used for the first time in this work for the formation of Mg2Si compound. A series of experiments were carried out at temperatures 500–650 °C with different deposition times ranging between 15 and 180 min. As a result single phase thick layers have been prepared, depending on growth temperature and deposition time. Mg2Si was formed as a result of the Mg diffusion into the Si matrix while the film thickness increased with the deposition time, and temperature. Electrical and optical properties of the grown layers have been investigated. The examination of the as formed material was completed by performing thermal stability tests, for the determination of the safe service temperature range of the …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:dfsIfKJdRG4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Experimental and thermodynamic considerations of Mg2Si coatings deposited by pack cementation process",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0749603616306504",
            "Abstract": "Magnesium disilicide is a narrow gap semiconductor which can be used in several applications such as thermoelectric materials, optoelectronic devices and batteries. It has attracted special attraction because of its low cost and non-toxicity. In the herein examination the formation of this compound is investigated by a simple, one-stage process which is pack cementation. Particularly, the effect of deposition time, activator and donor material concentration was examined. Mg2Si was formed in every case without the presence of other compounds as referred to be present when formed with other coating procedures which have higher cost and are very sophisticated. The examined parameters were found to have effect only on the coating thickness up to a certain value. Moreover, the experimental results confirmed the theoretical thermodynamic calculations performed for this case.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Newton-3: A Software For Teaching Dynamic Interactions.",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Petros-Kariotoglou/publication/265152208_Newton-3_A_Software_For_Teaching_Dynamic_Interactions/links/547490250cf245eb436de65a/Newton-3-A-Software-For-Teaching-Dynamic-Interactions.pdf",
            "Abstract": "The educational software presented in this work, is a web-based application, designed for the topic of 3rd Law of Newton. The software covers a series of several cases from gravitational interaction to electrostatic. The software sets a series of 11 “Lab” activities, and in each Lab, students are given a problem of interaction and are asked to place the forces. The software is structured on an interactive dialog-basis, where a pictorial “expert” changes faces and makes comments upon students’ response. Cases examined in the “Labs” and expert’s comments are selected on the basis of students’ conceptions. Each “Lab” consists of subsequent steps, where students are gradually introduced from the concept of “one body exerts force to the other” to the concept of “mutual action”. In this work we present the design of the educational software developed. Some preliminary results on the logging capabilities of the software are also presented and discussed in brief.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "FTIR Reflectivity spectra of Thermoelectric K2Sb8Se13 crystals",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4133358/",
            "Abstract": "Investigations of ternary and quaternary compounds, Bi and Sb chalcogenides, have shown that several multinary compounds containing alkali metals present promising thermoelectric properties. In this work, the FTIR reflectivity spectra of K 2 Sb 8 Se 13   crystals are reported and analyzed for the first time. Optical investigations are conducted with or without polarization, in two directions, parallel and perpendicular to the needles. The observed distinct optical anisotropy investigated by means of polarization dependent reflectivity measurements is discussed with respect to the strong structural anisotropy",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Teaching electric circuits by guided inquiry in virtual and real laboratory environments",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-1083-6_16",
            "Abstract": "For years, several researchers and teachers support that involving students in laboratory-based activities in science contributes not only to the construction of conceptual knowledge but also to the development of a scientific way of thinking. However, research studies suggest that during experimentation based on hands-on experiments, students are frequently preoccupied with handling equipment setups and taking measurements, which questions the effectiveness of laboratory based on hands-on experiments as only one of its kind environment for promoting scientific understanding (Psillos and Niedderer 2002; Niedderer et al. 2003). With the advance of ICT technology, virtual laboratories have emerged as powerful environments as well. Virtual laboratories simulate real science laboratories on a computer screen, in a visual and functional manner, by exploiting modern multimedia technology and …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Seebeck and thermal conductivity analysis in amorphous/crystalline β-K2Bi8Se13 nanocomposite materials",
            "Publication year": 2011,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3610393",
            "Abstract": "In this work, ball milling is applied on β-K2Bi8Se13 compounds in order to explore the potential of the process for the fabrication of nano-based material. Polycrystalline β-K2Bi8Se13, synthesized from melt, was ball milled under inert atmosphere. Powder x-ray diffraction showed a significantly increased disorder with ball milling time. TEM studies confirmed the presence of nanocrystalline material in an amorphous matrix, suggesting the development of crystalline/amorphous β-K2Bi8Se13 nanocomposite material via ball milling process. Seebeck coefficient and thermal conductivity were analyzed based on the effective medium theory and show a significant contribution of a nanocrystalline phase.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:YsMSGLbcyi4C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "NiTi memristive behavior",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931719301832",
            "Abstract": "In this paper, the experimental study and confirmation of the memristive behavior demonstrated by nanowires made of a smart alloy, namely NiTi, are presented. Further contribution to the characterization of the proposed novel NiTi memristor, included measurements in the ac domain, confirming the memristive nature of these NiTi wires/devices. These measurements included the device's response to triangular current excitation, as well as to pulse driving. In all cases, a study of the noise registered has taken place. According to the theory, since NiTi's memristive behavior is depended on its temperature, it is classified as an extended memristor.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:sNmaIFBj_lkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Design and development of a microscopic model for polarization",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0031-9120/44/6/003/meta",
            "Abstract": "As research shows that the knowledge and use of models and modelling by teachers is limited, particularly for predicting phenomena, we developed and applied a sequence of three representations of a simulated model focusing on polarization and specifically showing the behaviour of an atom, and forces exerted on a dipole and an insulator, when a charged particle is placed anywhere near them. The sequence was tested with beginning student teachers. They worked with specially developed worksheets in which the simulated model was treated, before carrying out hands-on experiments embedded in a model-based instructional unit which aimed to help the student teachers understand polarization and become familiar with the predictive use of models. Selected pre-study tests, post-study tests and group interview results are presented, showing the participants' ability to use the model to predict the attraction …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Ball Milling-Induced Nanocrystallization and Amorphization",
            "Publication year": 2017,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781315364452-14/ball-milling-induced-nanocrystallization-amorphization-eyripides-hatzikraniotis-theodora-kyratsi-konstantinos-paraskevopoulos",
            "Abstract": "This chapter outlines the use of ball milling technique for amorphization and nanocrystallization. Nanostructuring is one of the efficient ways to reduce thermal conductivity, without much affecting the electrical properties, and is especially applied in thermoelectric materials. Ball milling is a way of producing amorphous alloys as well as nanostructured materials. It is a powder metallurgy processing technique involving cold welding, fracturing, and rewelding of powder particles in ball mill and has now become an established commercial technique to produce oxide dispersion strengthened nickeland iron-based materials. Amorphous materials can be prepared by the ball milling process starting from elements, alloys and/or compounds, and mixture of compounds and/or elements, all in powder form. The ball-milled material shows electron micrographs and diffraction images (ED) patterns with rings of very thin discrete …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:9pM33mqn1YgC",
            "Publisher": "Jenny Stanford Publishing"
        },
        {
            "Title": "Structural features and dopant gradients in Mg2SnXSi1-X ternary compounds",
            "Publication year": 2014,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/structural-features-and-dopant-gradients-in-mg2snxsi1x-ternary-compounds/8E80003524CCABEF35E49F2D3D231B46",
            "Abstract": "In the present work, a comparative study is attempted, dealing with the influence of the grain size distribution on the microstructure and the free carrier concentration in Mg2SnXSi1-X (x=0.2) ternary compounds doped with Sb. Structural in-homogeneities were monitored by using Transmission Electron Microscopy (TEM), Scanning Electron Microscopy (SEM) as well as Fourier transform infrared spectroscopy (FTIR) in the reflectivity mode.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:u9iWguZQMMsC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Formation of the thermoelectric candidate chromium silicide by use of a pack-cementation process",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11664-014-3100-y",
            "Abstract": "Transition-metal silicides are reported to be good candidates for thermoelectric applications because of their thermal and structural stability, high electrical conductivity, and generation of thermoelectric power at elevated temperatures. Chromium disilicide (CrSi2) is a narrow-gap semiconductor and a potential p-type thermoelectric material up to 973 K with a band gap of 0.30 eV. In this work, CrSi2 was formed from Si wafers by use of a two-step, pack-cementation, chemical diffusion method. Several deposition conditions were used to investigate the effect of temperature and donor concentration on the structure of the final products. Scanning electron microscopy and x-ray diffraction analysis were performed for phase identification, and thermal stability was evaluated by means of thermogravimetric measurements. The results showed that after the first step, chromizing, the structure of the products was a …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:SP6oXDckpogC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Frequency dependent electron damping in n-type PbSe",
            "Publication year": 2012,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4731520",
            "Abstract": "In this work we study the infrared (IR) optical properties of n-type PbSe samples doped with Cl exhibiting an electron carrier density in the range 0.75×1019 cm−3 −3.8×1019 cm−3. The IR reflectivity spectra are dominated by free carriers giving rise to blue-shifted reflectivity minimum in the region > 700cm−1. The analysis of the experimental reflectivity spectra showed that the conventional Drude model with a constant carrier relaxation time failed to describe the behaviour in the whole frequency range. It was found that the lineshape of the reflectivity spectra can be better described by a frequency dependent electron damping parameter with resonant-like behaviour similar to the one observed in the case of resonant electron scattering off potential wells. The density of states effective mass was found to increase with increasing carrier concentration supporting the non-parabolicity of the band model for PbSe.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:JV2RwH3_ST0C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Highly efficient Mg2Si-based thermoelectric materials: A review on the micro-and nanostructure properties and the role of alloying",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128185353000153",
            "Abstract": "This chapter aims to present an overview of the recent progress in high-performance bulk Mg2(Si/Sn/Ge) thermoelectric materials defining the key approaches for boosting the thermoelectric performance. These include alloying, doping, nanostructuring, band converging, and intentional or spontaneous hierarchical Sn-rich and Si-rich phases’ architecture.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:yFnVuubrUp4C",
            "Publisher": "Woodhead Publishing"
        },
        {
            "Title": "Painted Decoration Studies in a Fourth Century BC Vergina Tomb",
            "Publication year": 2007,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/painted-decoration-studies-in-a-fourth-century-bc-vergina-tomb/051F4CD8D5A4CDE6DDA054FEC0369119",
            "Abstract": "Aegae, the first capital of the Macedonians, in Northern Greece, is being excavated since 1938. The most impressive finds come from the unlooted tombs of the Great Tumulus, where the grave of Philip II, father of Alexander the Great, was discovered. Not far from the Great Tumulus, in the “Tumuli cemetery”, the most ancient part of the graveyard (1000-700 B.C.), recent excavations brought to light three looted graves dated in the mid-fourth century B.C., with very interesting finds such as weapons, gilded wreaths, pieces of jewelry, remains of decoration of wooden furniture, ceramic vases broken in small pieces and wall paintings. This paper describes studies carried out on the binding and the painting materials used for the decoration of the above wall paintings and ceramic vases. The characterization was performed through Optical Microscopy, Fourier Transform Infrared Spectroscopy (FTIR) and Scanning …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "High ZT in p-Type (PbTe)1–2x(PbSe)x(PbS)x Thermoelectric Materials",
            "Publication year": 2014,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/ja4121583",
            "Abstract": "Lead chalcogenide thermoelectric systems have been shown to reach record high figure of merit values via modification of the band structure to increase the power factor or via nanostructuring to reduce the thermal conductivity. Recently, (PbTe)1–x(PbSe)x was reported to reach high power factors via a delayed onset of interband crossing. Conversely, the (PbTe)1–x(PbS)x was reported to achieve low thermal conductivities arising from extensive nanostructuring. Here we report the thermoelectric properties of the pseudoternary 2% Na-doped (PbTe)1–2x(PbSe)x(PbS)x system. The (PbTe)1–2x(PbSe)x(PbS)x system is an excellent platform to study phase competition between entropically driven atomic mixing (solid solution behavior) and enthalpy-driven phase separation. We observe that the thermoelectric properties of the PbTe–PbSe–PbS 2% Na doped are superior to those of 2% Na-doped PbTe–PbSe and …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:dshw04ExmUIC",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Study of Painting Materials and Techniques in the 18th Century St. Athanasius Church in Moschopolis, Albania",
            "Publication year": 2007,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/study-of-painting-materials-and-techniques-in-the-18th-century-stathanasius-church-in-moschopolis-albania/3B575CA7A2177E43DF02B3C8BB1AE5DB",
            "Abstract": "In this paper are presented the studies of the paint materials and the technique used in 18th century wall paintings, originated from the orthodox church of St Athanasius, in the city of Maschopolis, a flourishing economical and cultural center, in Albania. The church was painted in 1745 by Konstantinos and Athanasios Zografi, and during the last years, restoration activities are being performed at the church. Samples that included plasters and pigments of different colors were collected from important points of the wall paintings. Additionally, as some parts of the wall-paintings were over-painted, the analysis was extended to the compositional characterization of these areas. The identification of the used materials was done by using complementary analytical methods such as Optical Microscopy, Fourier Transform Infrared spectroscopy (FTIR), Scanning Electron Microscopy (SEM-EDS) and X-ray fluorescence (TXRF …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "SEM-EDS and micro-Raman investigations in coated CoSb3 skutterudite",
            "Publication year": 2013,
            "Publication url": "https://biblio.ugent.be/publication/8548123",
            "Abstract": "SEM-EDS and micro-Raman investigations in coated CoSb3 skutterudite Universiteit Gent Add \npublications Lists Sign in Academic Bibliography Search 200 years of publications by Ghent \nUniversity researchers. Search publications Advanced search Add to list 1.Search results \n2.SEM-EDS and micro-Raman investigation... SEM-EDS and micro-Raman investigations in \ncoated CoSb3 skutterudite Anastasia Rousaki (UGent) , Evripidis Hatzikraniotis, Kinga Zawadzka, \nElzbieta Godlewska, Krzysztof Mars, Dimitrios Lampakis and Konstantinos M Paraskevopoulos \n(2013) Solid State Physics and Materials Science, 29th Panhellenic conference, Abstracts. \nAuthor Anastasia Rousaki (UGent) , Evripidis Hatzikraniotis, Kinga Zawadzka, Elzbieta \nGodlewska, Krzysztof Mars, Dimitrios Lampakis and Konstantinos M Paraskevopoulos \nOrganization Department of Analytical chemistry (ceased 1-1-2018) Citation Cite this BibTeX this …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:0izLItjtcgwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Science education research in the knowledge-based society",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=VE7qCAAAQBAJ&oi=fnd&pg=PR9&dq=info:nlM-dbaRC9sJ:scholar.google.com&ots=zsR0sEoJfr&sig=rv7-ojyeyIEIdiz1EUzpB1VX90Y",
            "Abstract": "We are pleased to present the ESERA 2001 Conference book, which is based on contributions submitted and presented to the Third International Conference\" Science Education Research in the Knowledge Based Society\" that was organised by the Department of Primary Education of the Aristotle University of Thessaloniki and held in Thessaloniki from August 21 to August 26, 2001. The focus of the Conference was to discuss the scope, methods, outcomes and perspectives of research in science education in the context of the rapidly developing knowledge-based society. Some 450 researchers, teachers, and postgraduate students attended the conference. They came mainly from European countries, with a substantial proportion-some 20-from countries outside Europe. While ESERA conferences reflect research carried out in Europe, they are increasingly becoming international events attracting researchers from all over the world. A total of 220 works were presented in guest lectures, symposia, poster workshops, individual papers and poster sessions that took place during the conference along with alternative activities and informal meetings. All these of the Conference (edited by works are already published in the Proceedings D. Psillos, P. Kariotoglou, V. Tselfes, G. Bisdikian, G. Fassoulopoulos, E. Hatzikraniotis, M. Kallery).",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:geHnlv5EZngC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Thermal, electron transport and far infrared properties of PbTe single crystals doped with Br",
            "Publication year": 2012,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4731517",
            "Abstract": "Understanding the properties of PbTe remains in focus as enhancement of thermoelectric efficiency of this material is studied extensively. In this work single crystals of PbTe, doped with less than 2 at % Br, were synthesized using the Bridgmann technique and their thermal, electron transport and far infrared properties were studied. Thermal diffusivity was determined using the photoacoustic method with a transmission detection configuration. Electron transport was determined by Seebeck coefficient measurements. IR reflectivity measurements showed that reflectivity in the region of plasma resonance was low. Measured reflectivity diagrams were numerically analyzed-enabling calculation of the carrier concentration and mobility-and compared with the values obtained by Hall measurements.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:4TOpqqG69KYC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "On the optical properties of thermoelectric alkali metal chalcogenide compounds",
            "Publication year": 2006,
            "Publication url": "https://www.scholars.northwestern.edu/en/publications/on-the-optical-properties-of-thermoelectric-alkali-metal-chalcoge",
            "Abstract": "Solid solutions of K 2 Bi 8-x Sb x Se 13 is an interesting series of complex bismuth-chalcogenide compounds, which are attractive for thermoelectric investigations. The highly anisotropic structure in these compounds results in needle-like morphology along the b-crystallographic axis, leaving structural tunnels where K+ ions reside. The complex electronic structure that arises from a large and low symmetry unit cell and the weakly bound K+ ions, lead to high Seebeck coefficient, highly anisotropic electrical properties and very low thermal conductivity. Reflectivity spectra in the FIR region are presented for several members in the Sb-rich (x≥ 6) side. Optical investigations are carried out on crystalline and pelletized samples. The received spectra are analyzed, examined comparatively and discussed. Results indicate that upon Bi/Sb substitution in the Sb-rich region, phonons develop a mixed-mode behavior in the FIR spectral region.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:3htObqc8RwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Microscopic Models in the Teaching of Physics: The Case of Polarization and of Thermal Conductivity",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3322382",
            "Abstract": "In the present paper we examine some aspects of using of microscopic models‐simulations in the teaching of Physics. Specifically, the aim is to investigate the effect of the microscopic model of thermal conduction in explaining a thermal phenomenon and to investigate the effect of the microscopic model of polarization in predicting an electrostatic phenomenon. Twenty‐five lower secondary students in compulsory education and 12 university pre‐service primary education student‐teachers, in Thessaloniki, Greece participated in the model‐based units of thermal conduction and electric polarization respectively. In both cases students were involved in model exploration rather than in model construction, however in electric polarization the “predictive” use of models has been adopted while in the case of thermal conductivity the approach emphasized explanation. Results showed that students, to a certain extend …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:ZHo1McVdvXMC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Designing experiments on thermal interactions by secondary-school students in a simulated laboratory environment",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/02635143.2010.533266",
            "Abstract": "The aim of this study was to explore the effect of investigative activities with manipulations in a virtual laboratory on students’ ability to design experiments. Sample Fourteen students in a lower secondary school in Greece attended a teaching sequence on thermal phenomena based on the use of information and communication technology, and specifically of the simulated virtual laboratory ‘ThermoLab’. Design and methods A pre–post comparison was applied. Students’ design of experiments was rated in eight dimensions; namely, hypothesis forming and verification, selection of variables, initial conditions, device settings, materials and devices used, process and phenomena description. A three-level ranking scheme was employed for the evaluation of students’ answers in each dimension. Results A Wilcoxon signed-rank test revealed a statistically significant difference between the …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:rO6llkc54NcC",
            "Publisher": "Routledge"
        },
        {
            "Title": "An open learning environment for thermal phenomena",
            "Publication year": 2001,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64399",
            "Abstract": "In this work we present an open learning environment, suitable for teaching Heat and Thermodynamics. The software consists of two independent visual laboratories (one for Heat and the other for Thermodynamics) and a series of relevant multimedia themes on technology and everyday life. The package has an open and dynamic structure, that allows the teacher to compose virtual experiments and re-organise the available multimedia themes, according to the needs of his class. And a pilot evaluation based on the attitudes of experiences physics teachers is also presented.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Pedagogical Faculty of University of Ostrava"
        },
        {
            "Title": "Materials Science: Trends, material properties and educational perspectives",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-7808-5_5",
            "Abstract": "Materials Science is an interdisciplinary field involving the properties of matter and its applications to various areas of science and engineering. Materials Science investigates the relationships between the structure of materials at atomic or molecular scales as well as their microstructure and their macroscopic properties. It includes elements of applied physics and chemistry, as well as chemical, mechanical, civil, and electrical engineering. The aim of this paper is to give a brief, yet comprehensive overview on the current challenges and advances in Materials Science as well as to outline attempts made world-wide to introduce Materials Science in secondary school curricula. As the title suggests the paper consists of two parts. In the first part, a short history of materials and an introductory review on material properties are presented. In the second part, educational perspectives and issues such as the …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:LPZeul_q3PIC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Mechanical alloying synthesis of K {sub 2} Bi {sub 8} Se {sub 13}-type solid solutions.",
            "Publication year": 2008,
            "Publication url": "https://www.osti.gov/biblio/986747",
            "Abstract": "Solid solutions of K {sub 2} Bi {sub 8-x} Sb {sub x} Se {sub 13} are an interesting series of materials for thermoelectric investigations due to their very low thermal conductivity and highly anisotropic electrical properties. In this work, we aimed to synthesize solid solutions of OK {sub 2} Bi {sub 8-x} Sb {sub x} Se {sub 13} type materials using powder techniques. The synthesis was based on mechanical alloying as well as sintering procedures. The products were studied in terms of structural features, composition and purity with powder x-ray diffraction, scanning electron microscopy and energy dispersive spectroscopy. Preliminary results on thermoelectric properties as well as IR reflectivity measurements are presented.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Argonne National Lab.(ANL), Argonne, IL (United States)"
        },
        {
            "Title": "Lattice thermal conductivity of  solid solutions",
            "Publication year": 2004,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1682674",
            "Abstract": "The family of solid solutions of the type β-K2(Bi1−zSbz)8Se13 (0<z⩽1) was studied with respect to thermal conductivity as a function of temperature and stoichiometry. At low temperature, the variation of lattice thermal conductivity with composition shows a transition from a typical crystalline to glasslike behavior. Analysis of the high-temperature data shows a contribution due to the mixed occupation of Bi/Sb crystallographic sites as well as an additional contribution due to point defects.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:RYcK_YlVTxYC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Fabrication of nanocrystalline Mg2Si via ball milling process: Structural studies",
            "Publication year": 2012,
            "Publication url": "https://www.cheric.org/research/tech/periodicals/view.php?seq=1265990",
            "Abstract": "In this work, nanocrystalline Mg2Si material was fabricated via wet ball milling process using n-hexane as process control agent. Milling parameters, with emphasis on milling time and ball size, and conditions were studied in order to understand the process and investigate its effect on the structural features of the material. Crystallite size evolution during ball milling was followed by powder X-ray diffraction measurements as well as Transmission Electron Microscopy studies. Scanning Electron Microscopy images showed the agglomeration of the crystallites and the formation of particles with minimum mean size of similar to 1.6 mu m. The simultaneous formation of MgO in the material is shown through powder X-ray diffraction and electron diffraction TEM studies. The broadened PXRD peaks were analyzed and crystalline size was estimated based on Scherrer equation. The crystallite size distributions were studied based on the analysis of Dark Field images and were well described based on a Log-Normal equation. The effect of the size of the balls during milling was clear and leads to bi-modal and uni-modal distributions when large and small balls were used, respectively. IR reflectivity spectra showed blue-shifting and broadening of the modes on increasing milling time that may also be assigned to decreasing grain size and particle shape effects.(C) 2011 Elsevier BV All rights reserved.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:HIFyuExEbWQC",
            "Publisher": "Elsevier Science SA, Lausanne, Switzerland"
        },
        {
            "Title": "Experimental and modeling evidence for the reduction of thermal conductivity in Mg2Si by fine tuning the nano & micro-structural features",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2214785317320114",
            "Abstract": "In this paper, experimental and modeling evidence for reduced thermal conductivity in Bi-doped Mg2Si is presented. Upon doping, lattice thermal conductivity was reduced monotonically and, at the same time, MgO content was increased while grain size was decreased. A model has been developed, which takes into account various phonon-scattering mechanisms, the 3-phonon (Umklapp) process, electron-phonon interaction and phonon-scattering by the grain-boundaries or nano-scale MgO inclusions. The model was successfully applied and excellently describes the temperature dependence of lattice thermal conductivity as well as its evolution vs. doping. Application of the model suggests that lattice thermal conductivity is mainly affected by both nano-MgO precipitates and Umklapp processes. Exploring the effect of the grain size and nano-precipitates, our model predicts that the two phonon-scattering …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "n–p transformation in TlBi (1− x) SbxTe2 system",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925838807023110",
            "Abstract": "TlBi(1−x)SbxTe2 quaternary crystals that crystallize in a rhombohedral structure and according to their properties are classified between semimetals and narrow energy gap semiconductors, are studied. The study of their optical and electrical behavior reveal that they are quite sensitive to the Sb content x, and it is found that the substitution of Bi- with Sb-atoms in TlBiTe2 crystals leads initially to a decrease in the plasma frequency. However, for higher Sb contents, the plasma frequency increases. At room temperature, samples with x < 0.8 are n-type semiconductors, becoming p-type ones for x > 0.8.A model suggesting a suppression of the free electron concentration induced by the incorporation of Sb atoms into the crystal lattice of TlBiTe2 is used to explain this transition in the conductivity type.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Application of the Thermal Quadropole Method in the characterization of thermoelectric materials",
            "Publication year": 2007,
            "Publication url": "http://ikee.lib.auth.gr/record/247011?ln=en",
            "Abstract": "Measurements of assembled thermoelectric (TE) modules commonly include investigations of the module output power versus load resistance. Using an AC electrical measurement for TE modules, a model of equivalent passive RC circuit has been developed and tested for both the thermal and electrical characteristics of the module. In this work we present and analyze data of a commercially available module, using equivalent passive RC circuit, to examine, explain and model the electro-thermal activity in the module. In addition data we analyzed by thermal quadrupole theory. Measurements were taken over the frequency range of 0, 5mHz to 50 Hz and the device performance (ZT) was evaluated from measured data.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:cWzG1nlazyYC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Structure inhomogeneities, shallow defects, and charge transport in the series of thermoelectric materials ",
            "Publication year": 2006,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2365718",
            "Abstract": "The charge transport properties of the low-dimensional thermoelectric materials K2Bi8−xSbxSe13 (0<x⩽8) were studied as a function of temperature and composition. The Seebeck coefficient shows an evolution from n- to p-type character with increasing incorporation of Sb, and at the same time the temperature dependence of the electrical conductivity changes from that of a degenerate semiconductor to that of an intrinsic or compensated semiconductor. These changes, however, are not monotonic with composition due to the nonuniform substitution of Sb atoms at the Bi sites of the structure. Three separate composition regions can be assigned depending on x each with different charge transport characters. Electronic transport in K2Bi8−xSbxSe13 was analyzed on the basis of the classical semiconductor theory and discussed in the context of recent band calculations. The results suggest that the K2Bi8 …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Content transformation for experimental teaching nanoscale science and engineering to primary teachers",
            "Publication year": 2018,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/1076/1/012006/meta",
            "Abstract": "This study is a response to the need to examine the educational perspective of the Nanoscale Science and Engineering field (NSE) in all grades of education. Specifically, we address to educate primary teachers about essential concepts, applications and phenomena of the NSE discipline. In order to do so, we first seek to establish, the salient concepts, principles and phenomena that should be introduced to primary teachers, as a result of the transformation of the content, to content appropriate for the target population. In addition, to address the challenges of making the formatted content structure accessible to primary teachers, a variety of experimental activities were designed, which we present in detail.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:FAceZFleit8C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Τhe Effect of Ge on Mg 2 Si 0.6− x Sn 0.4 Ge x Materials",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11664-014-3235-x",
            "Abstract": "In this work, we investigate the influence of the introduction of Ge on the thermoelectric properties of Bi-doped quaternary Mg2Si0.6−x Sn0.4Ge x  alloys. Mg2Si0.58−x Sn0.4Bi0.02Ge x  materials were fabricated by a low temperature reaction method, followed by hot pressing. Structure and phase composition of the obtained hot-pressed pellets were observed by x-ray diffraction. Morphology and chemical composition were monitored by scanning electron microscopy equipped with energy-dispersive x-ray spectroscopy. The results indicate a natural tendency of the material to phase separate into Si-rich, Sn-rich, and Ge-rich regions, which seem to become finer in size with Ge concentration. The compounds have been characterized by electrical conductivity, Seebeck coefficient, and thermal conductivity measurements in the temperature range of 300–823 K …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:XiSMed-E-HIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A study on the exploratory use of microscopic models as investigative tools: The case of electrostatic polarization",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-5914-5_9",
            "Abstract": "The present chapter focuses on the use of a submicroscopic model as an investigative tool by students in their study of electrostatic polarization. The aim of the research was to investigate whether students are able to use the model in order to predict electrical interactions between charged and uncharged objects, whether students gain awareness of the use of the model as an investigative tool, and which features of the model helped them to predict the phenomenon. Simulated models showed multiple representations of the structural and behavioral aspects of atoms. The teaching unit was used with one group of lower secondary students (ages 12–15) and one group of student teachers. In the teaching unit, students, initially, were asked to predict the phenomenon, and then they were introduced to the model, they were asked to predict again the same phenomenon, and afterward they observed the real …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "A European Project on Materials Science: The Case of Thermal Conductivity Teaching—Learning Sequence",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3322377",
            "Abstract": "In the context of the European Project on Material Science we have developed a Teaching Learning Sequence (TLS), which is composed by units for teaching thermal conductivity in depth to students. The scientific content has been adapted to students’ conceptions taking into account research results. Units follow the Predict‐Observe‐Explain strategy and students conduct guided investigations using an enriched learning environment, which consists of extensive use of ICT based tools. Didactically transformed microscopic models depict thermal interactions in iconic, graphic and symbolic forms. Students working in groups, solve problems, explore models and are engaged in classroom discussion on the problem under study, constructing links between evidence and explanations. In this paper the structure of such innovative units is presented and results showing students’ development in scientific understanding …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:M05iB0D1s5AC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Growth and Characterization of Thermoelectric Mg2Si Thin Films",
            "Publication year": 2011,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/growth-and-characterization-of-thermoelectric-mg2si-thin-films/84E80A4EEE1E3364DCA767270CC453B2",
            "Abstract": "In this work, room temperature co-deposition of Mg and Si was used to successfully fabricate Mg2Si thin films on Si substrate by dual cathode magnetron sputtering (DCMS). Films were annealed at 380°C. Various Mg/Si sputtering power ratios have been examined. XRD, SEM and IR reflectivity measurements on grown and annealed films, reveal that annealing is enhancing the formation of crystalline Mg2Si.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Macro and Micro-Scale Features of Thermoelectric PbTe (Br, Na) Systems: Micro-FTIR Spectroscopy, Micro-Seebeck Measurements, and SEM/EDX Observations",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11664-014-3163-9",
            "Abstract": "In this work, n-type and p-type PbTe doped with Br and Na, respectively, were thoroughly examined to determine the effect of the dopant on microstructure. Macro and micro homogeneity of the samples were studied by means of micro-Fourier-transform infrared (micro-FTIR) spectroscopy, micro-Seebeck measurements, and scanning electron microscopy with energy-dispersive x-ray analysis (SEM/EDX). SEM/EDX observations showed the samples were not single-phase materials—second phases were created by inclusions that disturbed the coherence of the matrix and, subsequently, drastically affected the Seebeck coefficient. In a micro-scale study, local variations of sodium content were detected in Na-doped samples; in Br-doped samples a second, PbBr2, phase was observed in the PbTe matrix. A direct effect of matrix dopant on Seebeck coefficient and plasmon frequency for the Br-doped and Na …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Sintering process in ball-milled K2Bi8Se13 nano-composites",
            "Publication year": 2012,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4731558",
            "Abstract": "K2Bi8Se13 material has many attractive features for thermoelectric applications. Recently, K2Bi8Se13 based nanocomposite materials, consisting of nano-crystalline, micro-crystalline and amorphous phases, have been fabricated based on powder technology techniques. The Seebeck coefficient has been enhanced and the thermal conductivity has been decreased, thus presenting interesting behavior. The study of the behavior of materials under different heat treatment conditions is of interest in terms of reversibility and stability of the structural features, as the application of sintering process is necessary for the development of thermoelectric modules. In this work, structural features, thermal and thermoelectric properties have been studied under heat treatment applied into K2Bi8Se13 nano-composites.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:hC7cP41nSMkC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Vibrational properties of silver‐doped arsenic chalcogenide bulk glasses",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3322451",
            "Abstract": "Silver‐doped As33S>67 and As33S33Se33 bulk glasses studied by means of Scanning Electron Microscopy (SEM) and infrared reflectivity, exhibit two‐phase glasses, for a wide range of Ag concentration. Using the Effective Medium Approximation we show that the structure is actually a proper average of two components, a Ag‐poor and a Ag‐rich glass phase. The dominant structural unit in both phases is the pyramidal units AsX3/2 units. The latter are arranged in different medium‐range order motifs. A detailed analysis of the reflectivity and absorption coefficient spectra made it possible to elucidate the short— and medium—range structural order for the Ag‐poor and Ag‐rich phases.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:dhFuZR0502QC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Power and efficiency calculation in commercial TEG and application in wasted heat recovery in automobile",
            "Publication year": 2007,
            "Publication url": "http://ect2007.thermion-company.com/ect2007.its.org/system/files/u1/pdf/30.pdf",
            "Abstract": "Thermoelectric generators (TEG) make use of the Seebeck effect in semiconductors for the direct conversion of heat into electrical energy, which is of particular interest for high reliability systems or for waste heat recovery. The generator efficiency, η, is determined by comparing the amount of electricity produced (Pout) to the total amount of heat induced (Qin). A measuring system and a modeling approach which takes into account the thermal contact resistances have been developed, allowing the characterization of TEG devices under various loads and temperature gradients and thus, to evaluate material properties. These results were used to identify the appropriate positions at the exhaust pipe of a midsize vehicle for the optimum recovery of the wasted heat using a commercial TEG and to establish a set of requirements for an automotive TE waste heat recovery subsystem. Results are presented and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "9TH EUROPEAN CONFERENCE ON THERMOELECTRICS: ECT2011",
            "Publication year": 2012,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2012AIPC.1449.....P/abstract",
            "Abstract": "9TH EUROPEAN CONFERENCE ON THERMOELECTRICS: ECT2011 - NASA/ADS Now on \nhome page ads icon ads Enable full ADS view NASA/ADS 9TH EUROPEAN CONFERENCE \nON THERMOELECTRICS: ECT2011 Paraskevopoulos, KM ; Hatzikraniotis, E. Abstract \nPublication: American Institute of Physics Conference Series Pub Date: June 2012 Bibcode: \n2012AIPC......P No Sources Found © The SAO/NASA Astrophysics Data System \nadshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian Astrophysical \nObservatory under NASA Cooperative Agreement NNX16AC86A NASA logo Smithsonian \nlogo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs ADS Blog \nProject Switch to full ADS Is ADS down? (or is it just me...) Smithsonian Institution Smithsonian \nPrivacy Notice Smithsonian Terms of Use Smithsonian Astrophysical Observatory NASA …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Structure inhomogeneities, shallow defects, and charge transport in the series of thermoelectric materials K2Bi8− xSbxSe13",
            "Publication year": 2006,
            "Publication url": "http://collected.jcu.edu/cgi/viewcontent.cgi?article=1003&context=phys-facpub",
            "Abstract": "The charge transport properties of the low-dimensional thermoelectric materials K 2 Bi 8-x Sb x Se 13 (02 Bi 8-x Sb x Se 13 was analyzed on the basis of the classical semiconductor theory and discussed in the context of recent band calculations. The results suggest that the K 2 Bi 8-x Sb x Se 13 materials possess coexisting domains with semimetallic and semiconducting characters whose ratio is influenced by the value of x and by local defects. The extent and relative distribution of these domains control the charge transport properties. Electron diffraction experiments performed on samples of K 2 Bi 8-x Sb x Se 13 with x= 1.6 show evidence for such domains by indicating regions with long range ordering of K+/Bi 3+ atoms and regions with increased disorder. The semiconducting behavior is enhanced with increasing x (ie, Sb/Bi ratio) in the composition through a decrease of the semimetallic fraction.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Lattice thermal conductivity of K2 (Bi1− zSbz) 8Se13K2 (Bi1− zSbz) 8Se13 solid solutions",
            "Publication year": 2004,
            "Publication url": "https://deepblue.lib.umich.edu/handle/2027.42/70317",
            "Abstract": "The family of solid solutions of the type β-K2(Bi1−zSbz)8Se13 (0<z⩽1)β-K2(Bi1−zSbz)8Se13 (0<z⩽1) was studied with respect to thermal conductivity as a function of temperature and stoichiometry. At low temperature, the variation of lattice thermal conductivity with composition shows a transition from a typical crystalline to glasslike behavior. Analysis of the high-temperature data shows a contribution due to the mixed occupation of Bi/Sb crystallographic sites as well as an additional contribution due to point defects. © 2004 American Institute of Physics.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:XvxMoLDsR5gC",
            "Publisher": "The American Institute of Physics"
        },
        {
            "Title": "Optimizing carbon/LiMn2O4 rechargeable Li-ion cells: the effect of electrode fabrication and mass balance on cell performance",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167273800004513",
            "Abstract": "In this work we present first cycle charge/discharge performance of synthetic graphite and petroleum coke and the influence of the binder used for the preparation of the electrodes on the irreversible capacity losses and an investigation of LiMn2O4/graphite and LiMn2O4/petroleum coke cells in respect to the cathode to anode electrode mass balance using three-electrode cells. The irreversible capacity of synthetic graphite electrodes varies from about 85 to 215 mAh/g depending on the binder material. Li-ion cells assembled after the optimization of the cathode/anode material mass ratio r showed first discharge capacities of about 100 and 102 mAh/g, for LiMn2O4/graphite and LiMn2O4/petroleum coke respectively.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the study of PbTe-based nanocomposite thermoelectric materials",
            "Publication year": 2012,
            "Publication url": "https://www.scientific.net/jnanor.17.165",
            "Abstract": "We Report on the Structural and Vibrational Properties of the X= 0.11 and X= 0.33 Compositions of a New Class of Nanostructured Thermoelectric System (PbTe) 1-X (PbSnS2) x by Means of X-Ray Diffraction, Scanning and Transmission Electron Microscopy and Infrared Reflectivity. both Compositions Are Phase Separated, where Pbsns2 Self-Segregates from Pbte to Form Features with Dimensions Ranging from Tens of Micrometers to Tens of Nanometers. Effective Medium Approximation Was Used in Order to Determine the Volume Fraction and the Dielectric Function of the Nanoscale Pbsns2 Embedded in Pbte. by Comparing the Phonon Parameters of the Nanoscale Pbsns2 and Bulk Pbsns2 Single Crystals, we Concluded that Phonon Confinement Effects and Bilayer Thickness Anisotropy within the Pbsns2 Nanostructures Embedded within Pbte Are Responsible for the Observed Variations in the …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:UebtZRa9Y70C",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Nanostructure and doping stimulated phase separation in high-ZT Mg2Si0. 55Sn0. 4Ge0. 05 compounds",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359645414007113",
            "Abstract": "A study was attempted on the structural properties across all relevant length-scales for Mg2(Si,Sn,Ge)-type solid solutions of the formula Mg2Si0.55−ySn0.40Ge0.05(Bi,Sb)y. The study focuses on three families of samples, namely one undoped compound, as well as two families of doped samples, one at Bi (y = 0.02) and one doped at Sb (y = 0.0125); the latter two materials were chosen because they yielded the highest ZT values. The results of the present study strongly suggest that, besides the main matrix and the MgO, there are three groups of secondary phases extending with uniform composition from nano-scale to macro-scale, as observed by high-resolution transmission electron microscopy (atomic scale), transmission electron microscopy (nano-scale), scanning electron microscopy coupled with energy-dispersive X-ray analysis (micro-scale) and X-ray diffraction (macro-scale): all these length-scale …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:738O_yMBCRsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Synthetic conditions and their doping effect on β-K2Bi8Se13",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925838808010578",
            "Abstract": "In this work the synthetic conditions for K2Bi8Se13 and their effect on its thermoelectric properties were investigated. K2Bi8Se13 was prepared as a single phase using K2Se and Bi2Se3 as starting materials in a furnace or via a reaction using direct flame, followed by remelting or annealing. Seebeck coefficient measurements showed that the doping level in the material is sensitive to the synthetic conditions. Higher synthesis temperatures as well as the flame reaction technique followed by annealing gave more homogenous samples with higher Seebeck coefficient. IR optical spectroscopic measurements showed a wide range of doping level achieved among the different synthetic conditions. These findings suggest that synthetic conditions can act as a useful tool for the optimization of the thermoelectric properties of these materials.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Enhancing students’ ability to “variable control” through inquiry-based simulations",
            "Publication year": 2017,
            "Publication url": "http://lib.uib.kz/edulearn17/proceedings/papers/646.pdf",
            "Abstract": "Our research focuses on simulations designed to test students’ ability of controlling the variables in a phenomenon. For this purpose, we created simulations to promote inquiry-based activities, following a four-level inquiry continuum, namely: closed, structured, guided and open level. Digital worksheets are included within the simulations and interact with the simulations, altering the simulations’ settings, depending on the users’ preferences. All the actions (clicks, changing the parameters, etc.) that students perform in the simulations are recorded into log files.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:r_AWSJRzSzQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Synthesis of higher manganese silicides by pack cementation",
            "Publication year": 2019,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5091328",
            "Abstract": "Higher Manganese Silicides (HMS), commonly referred to as MnSi1.7, have currently attracted great attention due to their potential use in high temperature thermoelectric applications. These compounds demonstrate attractive thermoelectric properties –with a maximum value of figure of merit ZT at least 0.7 for the undoped material –good thermal and chemical stability at high temperatures, low cost of the raw materials and environmental friendliness. A wide variety of techniques has been applied for the fabrication of MnSi1.7, however, many of these are facing problems. The current study focuses on the synthesis of MnSi1.7 powder via an innovative way, using the pack cementation process which is economical, simple and ecological. The effect of main experimental parameters –e.g. synthesis temperature, composition of the initial pack powder mixture –on the formation and properties of the silicide powder were …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:umqufdRvDiIC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Structure inhomogeneities, shallow defects, and charge transport in the series of thermoelectric materials K2Bi8− xSbxSe13K2Bi8− xSbxSe13",
            "Publication year": 2006,
            "Publication url": "https://deepblue.lib.umich.edu/handle/2027.42/87710",
            "Abstract": "The charge transport properties of the low-dimensional thermoelectric materials K2Bi8−xSbxSe13K2Bi8−xSbxSe13 (0<x ⩽ 8)(0<x⩽8) were studied as a function of temperature and composition. The Seebeck coefficient shows an evolution from nn- to pp-type character with increasing incorporation of Sb, and at the same time the temperature dependence of the electrical conductivity changes from that of a degenerate semiconductor to that of an intrinsic or compensated semiconductor. These changes, however, are not monotonic with composition due to the nonuniform substitution of Sb atoms at the Bi sites of the structure. Three separate composition regions can be assigned depending on xx each with different charge transport characters. Electronic transport in K2Bi8−xSbxSe13K2Bi8−xSbxSe13 was analyzed on the basis of the classical semiconductor theory and discussed in the context of recent band calculations. The results suggest that the K2Bi8−xSbxSe13K2Bi8−xSbxSe13 materials possess coexisting domains with semimetallic and semiconducting characters whose ratio is influenced by the value of xx and by local defects. The extent and relative distribution of these domains control the charge transport properties. Electron diffraction experiments performed on samples of K2Bi8−xSbxSe13K2Bi8−xSbxSe13 with x = 1.6x=1.6 show evidence for such domains by indicating regions with long range ordering of K+/Bi3+K+∕Bi3+ atoms and regions with increased disorder. The semiconducting behavior is enhanced with increasing xx (i.e., Sb/BiSb∕Bi ratio) in the composition through a decrease of the semimetallic fraction.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:4hFrxpcac9AC",
            "Publisher": "The American Institute of Physics"
        },
        {
            "Title": "Design and implementation of integrated Laboratory activities with measurements, Data analysis and modelling",
            "Publication year": 2007,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64681",
            "Abstract": "The Lab-based course, that is described in the present work, is offered to first year university students of Physics, mainly aiming to introduce students to the basic concepts and familiarize them with the use of Computers in Physics and with efficient Lab-reporting. It consists of a series of lab sessions, structured in a coherent way, where students perform activities that gradually guide them from taking data measurements and graphing them to advanced data analysis tasks and to mathematical modeling. The in-Lab sessions consist of measurements using the VideoJavaLab, a web-based software for the study and measurements of video based phenomena. Students, take measurements of various types of motions, and subsequently analyze them either by performing a curveanalysis or by mathematical modeling.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:kRWSkSYxWN8C",
            "Publisher": "University of Cyprus"
        },
        {
            "Title": "NANOSTRUCTURED SEMICONDUCTORS: AMORPHIZATION AND THERMAL PROPERTIES",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=7048881121070171918&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:mNrWkgRL2YcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Thermoelectric properties of Mg2Si coatings deposited by pack cementation assisted process on heavily doped Si substrates",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssa.201300140",
            "Abstract": "This work presents a study of structural and thermoelectric properties of Mg2Si coatings deposited on heavily doped p‐ and n‐type Si substrates, at 650 °C. The as‐grown layers were smooth and uniform in thickness without any texture, voids, or large density of cracks. The sign of Seebeck coefficient in deposited layers follows the one of the corresponding substrate, indicating effective doping of the grown layers with the dopant already present in Si substrate (B for p‐type and As for n‐type). Doping levels of ∼9 × 1018 cm−3 for p‐type and ∼5 × 1018 cm−3 for n‐type, were obtained. IR reflectivity analysis revealed a strong mode at 272 cm−1 and a shoulder at 316 cm−1. Thermoelectric properties were successfully modeled by a multiple‐band model, with optical phonon scattering. Temperature dependence of electrical conductivity for the deposition layers. The lines represent the theoretical fitting.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tracing students’ actions in inquiry-based simulations",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-95059-4_18",
            "Abstract": "Our research focuses on inquiry-based simulations that promote scientific process skills. An inquiry continuum was constructed, regarding the number of available variables (complexity of the problem). Students’ actions when using the simulations are recorded in log files. Clicks are divided into four categories, namely, settings, handling, phenomenon, and plot. Log files are analyzed in order to find out which are the factors that affect these actions (clicks), whether the actions contribute to the solution of the problem, and if students do gain scientific process skills through the activity. The results showed that the total number and the number of each type of actions are relevant to the complexity of the problem and the guidance provided by the worksheets. This kind of activities helped our students to gain procedural skills, leading them to adopt scientific strategies for solving the problems. Also, in the log files, there …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:GtLg2Ama23sC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Τhe Effect of Ge on MgSiSnGe Materials.",
            "Publication year": 2014,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=03615235&AN=97984113&h=uo0zsN62xjUlOYzEItNLGOO9dfeGY0oEvnZknsiZL00GpBGGhgivQ4vQmpAB2RrHl1ZhtfofGNMZoLSZQD8ucQ%3D%3D&crl=c",
            "Abstract": "In this work, we investigate the influence of the introduction of Ge on the thermoelectric properties of Bi-doped quaternary MgSiSnGe alloys. MgSiSnBiGe materials were fabricated by a low temperature reaction method, followed by hot pressing. Structure and phase composition of the obtained hot-pressed pellets were observed by x-ray diffraction. Morphology and chemical composition were monitored by scanning electron microscopy equipped with energy-dispersive x-ray spectroscopy. The results indicate a natural tendency of the material to phase separate into Si-rich, Sn-rich, and Ge-rich regions, which seem to become finer in size with Ge concentration. The compounds have been characterized by electrical conductivity, Seebeck coefficient, and thermal conductivity measurements in the temperature range of 300-823 K. The effect of Ge in the lattice thermal conductivity is discussed in terms of solid solution …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Carrier mapping in thermoelectric materials",
            "Publication year": 2013,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/carrier-mapping-in-thermoelectric-materials/A900BC2D616651FDBD23986D32FCEF33",
            "Abstract": "The application of micro-fourier transform infrared (FTIR) mapping analysis to thermoelectric materials towards identification of doping inhomogeneities is described. Micro-FTIR, in conjunction with fitting, is used as analytical tool for probing carrier content gradients. The plasmon frequency ω P 2 was studied as potential effective probe for carrier inhomogeneity and consequently doping differentiation based on its dependence of the carrier concentration. The method was applied to PbTe-, PbSe- and Mg2Si- based thermoelectric materials.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Influence of film thickness and annealing temperature in growth of Mg2Si thin films",
            "Publication year": 2012,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4731535",
            "Abstract": "In this work we examine the influence of film thickness and annealing temperature in the growth of Mg2Si thin films. Films were grown by dual cathode magnetron sputtering (DCMS) at room temperature. Two series of films were grown, one with thickness about 0.96μm (films-A) and another with (1.99μm) (films-B). Sputtered films were subsequently annealed in Ar gas atmosphere at temperatures 250°C, 300°C (films-B) and 380°C, 500°C (films-A). Results indicate that growth in films-A proceeds with the formation of two phases, a cubic (Fm-3m) and a strained (compressed) cubic with smaller lattice constant. When film thickness is doubled (films-B) material transforms into unstrained cubic phase. Annealing films-B at 300°C transforms them into the same compressed cubic phase that was observed in films-A. Further annealing of films-A causes a strain relief and at 500°C films are single phase.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:L8Ckcad2t8MC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Talking physics in inquiry based virtual laboratory activities",
            "Publication year": 2010,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64752",
            "Abstract": "This study refers to secondary students working in a simulated virtual open laboratory environment using “Thermolab”, following an innovative course on thermal phenomena, being engaged in a variety of activities, ranging from “structure lab” with a teacher-defined setup, to “student directed inquiry” with investigation characteristics. Students were working in pairs and data were collected by video and audio recording. The research question under investigation is: “how is the density of verbalization of students’ knowledge affected by the type of activity they are engaged in an open virtual laboratory?” Analysis of students’ actions and conversations, concerning five different laboratory sessions, is based on a method called CBAV (Category Based Analysis of Videotapes) according to which, the density of students’ knowledge verbalization is related to specific lab-work contexts and can be used as a measure of the linking between theory and practice during lab-work. Our findings reveal that while experimenting in a virtual laboratory environment, our students create links between theory and practice, but these are more likely to occur while working in investigative type activities, rather than working with a teacher-defined setup.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:ODE9OILHJdcC",
            "Publisher": "University of Cyprus"
        },
        {
            "Title": "Structural features of ball-milled nanostructured K2Bi8Se13 thermoelectric material",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510711002029",
            "Abstract": "In this work, K2Bi8Se13 material was ball-milled in order to develop nanostructures through the modification of structural features. Structural changes during ball-milling were followed by powder X-ray diffraction measurements, Scanning Electron Microscope images and High Resolution and conventional Transmission Electron Microscopy studies. Powder X-ray diffraction patterns presented a significant broadening in the peak patterns with the increase of the ball-milling time that was attributed to the formation of nanocrystalline as well as amorphous material. TEM studies showed the formation of K2Bi8Se13 nanostructured material consisting of nanocrystals that were surrounded by an amorphous matrix. Preliminary measurements of thermoelectric properties have shown that Seebeck coefficient is increased in ball-milled samples where as thermal conductivity is decreased. Sintering process that was applied on …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optilab: Design and development of an integrated virtual laboratory for teaching optics",
            "Publication year": 2007,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64725",
            "Abstract": "The international research and experience have proved that the approach of studying subjects with the help of computer and multimedia applications can exceed, to one degree, technical and instructive restrictions of classic school Science laboratories. The \"virtual laboratories\" which simulate, by means of visual and functional entities, physical phenomena or experiments in the screen of computer, develop the dynamics that provide the modern multimedia technology. Basic characteristic is the technique of interaction, the direct manipulation of objects and parameters and the ability of presenting interconnected multiple representations of the phenomena under study. As result, beyond the support of classic laboratorial approaches, new possibilities and prospects are introduced that extend the limits of methods of classic laboratory and create a technologically enriched environment in which the active and exploratory learning is facilitated. In this work, we present the design and development of a Visual Lab in the field of Optics. The laboratory is developed in Java3D and covers the fields of Geometric and Wave Optics. A unique feature of the lab is the co-existence of a “model space” which runs along with the actual “lab-space” (the “Cosmos”) and which presents a model of the experimental setup in real time.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "University of Cyprus"
        },
        {
            "Title": "Synthesis, crystal structure and thermoelectric properties of β-K2Bi8Se13 solid solutions",
            "Publication year": 2003,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/synthesis-crystal-structure-and-thermoelectric-properties-of-k2bi8se13-solid-solutions/33FC0297389EB823494BC3E9D9E1BC26",
            "Abstract": "Solid solution series of the type K2Bi8-xSb x Se13, K2-xRb x Bi8Se13 as well as K2Bi8Se13-xS x were prepared and the distribution of the atoms (Bi/Sb, K/Rb and Se/S) on different crystallographic sites, the band gaps and their thermoelectric properties were studied. The distribution Se/S appears to be more uniform than the distribution of the Sb and Rb atoms in the β-K2Bi8Se13 structure that shows preference in specific sites in the lattice. Band gap is mainly affected by Sb and S substitution. Seebeck coefficient measurements showed n-type character for of all Se/S members. In the Bi/Sb series an enhancement of p-type character was observed. The thermoelectric performance as well as preliminary high temperature measurements suggest the potential of these materials for high temperature applications.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:HE397vMXCloC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "PbTe–PbSnS 2 thermoelectric composites: low lattice thermal conductivity from large microstructures",
            "Publication year": 2012,
            "Publication url": "https://pubs.rsc.org/en/content/articlehtml/2012/ee/c2ee22495j",
            "Abstract": "Recent advances in the field of thermoelectrics have shown embedding appropriate nanostructures can significantly suppress the lattice thermal conductivity and therefore enhance ZT. Here we report a new class of thermoelectric composites of PbTe–PbSnS2. PbSnS2 is a naturally layered material (space group Pnma) comprised of Sn–Pb bilayers approximately 0.6 nm in thickness. High resolution transmission electron microscopy reveals the PbSnS2 segregates into coherent lamellar structures 50–100 nm in thickness that extend 100 nm to 15 μm in length. Despite the relatively large size of the PbSnS2 precipitates, we find that incorporation of PbSnS2 in PbTe results in significant reduction in lattice thermal conductivity to 0.4–0.65 W m−1 K−1 over the temperature range 300–700 K, a reduction of 50–70% over bulk PbTe. As a result, a maximum ZT of 1.1 is obtained for ingot samples of the PbTe–PbSnS2 6 …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:HDshCWvjkbEC",
            "Publisher": "Royal Society of Chemistry"
        },
        {
            "Title": "Investigating the use of simulated laboratory for teaching aspects of calorimetry to secondary education students",
            "Publication year": 2005,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64632",
            "Abstract": "Content analysis of textbooks and of research - based innovative approaches suggests that there is not a widely accepted negotiation of the order in which factors that are expressed in relation Q = m  c   should be examined. The treatment of heating time and final temperature is also important variables that deserve investigation. In this context, we designed visual experiments engaging students in investigating the change of temperature (), mass (m), and material (c) together with using bodies acquiring the same final temperature after heating. The simulated visual laboratory used in the present study is a micro-world for the teaching of thermal phenomena. The analysis of the data provided encouraging outcomes. It appears that the use of a dynamic system where the different phases of the experiment evolution can be paused and restarted offered opportunities for innovative negotiation of the relation of calorimetry. Moreover, the facility for changing parameters and seeing the readouts quickly permitted students to experiment with different initial temperatures and promoted a holistic approach to the experimental process, facilitating the linking of theory with experimental results by the students.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:wbdj-CoPYUoC",
            "Publisher": "University of Zilina"
        },
        {
            "Title": "Understanding the role and interplay of heavy-hole and light-hole valence bands in the thermoelectric properties of PbSe",
            "Publication year": 2015,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.91.085207",
            "Abstract": "The thermoelectric properties of PbSe have significantly improved in recent years reaching figures of merit Z T∼ 1.6. The transport properties of the hole-doped high temperature thermoelectric material PbSe are particularly interesting and play a key role in this. Here, they were analyzed over wide temperature and hole concentration ranges. The special features observed in the variation of the experimental Seebeck coefficient and Hall coefficient can be accounted for within the framework of a two-band model. Two valence bands separated by a temperature dependent energy offset are considered. The extremum of the light-hole band has a density of states mass∼ 0.27 m o at room temperature. It is nonparabolic and anisotropic and can be described by the Kane model. The extremum of the heavy-hole band is isotropic and parabolic with a much larger density of states mass∼ 2.5 m o. We find that for heavily …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:vRqMK49ujn8C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "On the use of thermoelectric (TE) applications based on commercial modules: The case of TE generator and TE cooler",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3322326",
            "Abstract": "In recent years, thermoelectricity sees rapidly increasing usages in applications like portable refrigerators, beverage coolers, electronic component coolers etc. when used as Thermoelectric Cooler (TEC), and Thermoelectric Generators (TEG) which make use of the Seebeck effect in semiconductors for the direct conversion of heat into electrical energy and is of particular interest for systems of highest reliability or for waste heat recovery. In this work, we examine the performance of commercially available TEC and TEG. A prototype TEC‐refrigerator has been designed, modeled and constructed for in‐car applications. Additionally, a TEG was made, in order to measure the gained power and efficiency. Furthermore, a TEG module was tested on a small size car (Toyota Starlet, 1300 cc), in order to measure the gained power and efficiency for various engine loads. With the use of a modeling approach, we evaluated …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:BqipwSGYUEgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "IR reflectivity studies of mechanically alloyed PbTe nanocrystals",
            "Publication year": 2009,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/ir-reflectivity-studies-of-mechanically-alloyed-pbte-nanocrystals/D28780E091372D604BDB9B2E43B15B20",
            "Abstract": "Nano-crystalline lead telluride powder was synthesized by mechanical alloying using a high-energy planetary ball mill. The broadening of the X-ray diffraction peaks vs ball milling time, indicates small crystalline size of the order of 30nm. IR spectroscopy results are discussed and compared to the material prepared from melt.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Fabrication of nanocrystalline Mg2Si via ball milling process",
            "Publication year": 2012,
            "Publication url": "http://ikee.lib.auth.gr/record/248182",
            "Abstract": "In this work, nanocrystalline Mg2Si material was fabricated via wet ball milling process using n-hexane as process control agent. Milling parameters, with emphasis on milling time and ball size, and conditions were studied in order to understand the process and investigate its effect on the structural features of the material. Crystallite size evolution during ball milling was followed by powder X-ray diffraction measurements as well as Transmission Electron Microscopy studies. Scanning Electron Microscopy images showed the agglomeration of the crystallites and the formation of particles with minimum mean size of similar to 1.6 mu m. The simultaneous formation of MgO in the material is shown through powder X-ray diffraction and electron diffraction TEM studies. The broadened PXRD peaks were analyzed and crystalline size was estimated based on Scherrer equation. The crystallite size distributions were studied …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:DJbcl8HfkQkC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Differential Capacity Analysis, A tool to examine the performance of graphites for Li-ion cells",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-011-4333-2_35",
            "Abstract": "Li-ion battery technology has emerged over the past few years as the prime candidate for meeting the requirements of portable, high energy density and specific capacity power sources [1–3]. Among the materials considered for the anode electrode, carbon is an attractive candidate because of its low cost, chemical stability and excellent reversibility for Li intercalation. Although the equation that describes the formation of LiC6 is fairly simple, the real reaction is much more complex [4]. Side reactions are responsible for a “charge loss” or “irreversible specific charge” (Cirr), and is accompanied by irreversible consumption of material (lithium and electrolyte). There are several effects that is beleived to contribute to Cirr, namely the SEI formation [5], solvated Li co-intercalation, reduction of surface impurities or surface complexes, etc. The formation of the SEI pasivating layer is thought to be the major contribution …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Models for the Analysis of IR Reflectivity in TlBiTe2 with Different Size of Twins",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Evripidis-Hatzikraniotis/publication/289111600_Models_for_the_Analysis_of_IR_Reflectivity_in_TlBiTe_2_with_Different_Size_of_Twins/links/5768042b08ae1658e2f8c1f1/Models-for-the-Analysis-of-IR-Reflectivity-in-TlBiTe-2-with-Different-Size-of-Twins.pdf",
            "Abstract": "TlBiTe2 is a narrow gap semiconductor, which belongs to the family of pseudo IV–VI semiconductors. Since the 1970s, it has been proposed as a candidate material for thermoelectric applications [1] and more recently as a topological insulator [2]. A topological insulator is a band insulator which is characterized by a topological number and which has gapless excitations at its boundaries [3]. The mechanism for the topological insulating behavior in these 3D materials is the band inversion at the Γ point caused by large spin–orbit coupling. The most striking property of this new class of topological insulators is the superconductivity observed in p-doped TlBiTe2 [4]. TlBiTe2 exhibits a phase transformation from the rhombohedral (D3d, low temperature phase) to the cubic (Oh, high temperature phase) symmetry [5], it has been studied by differential scanning calorimetry [6]. As is known [5], rowing the crystal from the melt (the Bridgman method), a cubic phase of a NaCl-type structure is firstly formed. This means that Tl and Bi atoms occupy arbitrarily the one (of the two) fcc lattice sites. During cooling the material is transformed to a rhombohedral lattice that is achieved by an elongation of the [111] direction of cubic lattice. The strain during the transformation from the high temperature cubic phase to the low temperature rhombohedral phase is relieved by the formation of lenticular dislocations and low angle boundaries. As the starting points of the transformation, within the cubic lattice, are more than one (cubic lattice has four equivalent [111] directions), the orientation relationships under which the transformed crystallites can meet each other are three …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparing Doping Methodologies in Mg 2 Si/AgMg System",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11664-014-3356-2",
            "Abstract": "Morphological and optical characterizations for the Mg2Si samples doped with Ag are presented. Two different doping methodologies with silver, namely in situ and ex situ doping, were studied for the case of Mg2Si of self-propagating high-temperature synthesis. Electron microscopy measurements in both scanning and transmission configurations verified the presence of AgMg precipitates embedded in the Mg2Si matrix and similar results were also yielded by FTIR spectroscopy. Finally, the dependence of silver content in both forms of dopant and inter-metallic constituent is studied upon doping technology.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Thermal stability study from room temperature to 1273 K (1000° C) in magnesium silicide",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s11661-016-3682-5",
            "Abstract": "Doped magnesium silicide has been identified as a promising and environmentally friendly advanced thermoelectric material in the temperature range between 500 K and 800 K (227 °C and 527 °C). Besides the plethora of magnesium silicide thermoelectric advantages, it is well known for its high sensitivity to oxidation. Oxidation is one of the primary instability mechanisms of degradation of high-temperature Mg2Si thermoelectric devices, as in the presence of O2, Mg2Si decomposes to form MgO and Si. In this work, commercial magnesium silicide in bulk form was used for thermal stability study from room temperature to 1273 K (1000 °C). Various techniques such as DTA-TG, PXRD, and FTIR have been applied. Moreover, the application of thermoluminescence (TL) as an effective and alternative probe for the study of oxidation and decomposition has been exploited. The latter provides qualitative but …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:Mojj43d5GZwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Thermoelectric properties of highly efficient Bi-doped Mg {sub 2} Si {sub 1− x− y} Sn {sub x} Ge {sub y} materials",
            "Publication year": 2014,
            "Publication url": "https://www.osti.gov/etdeweb/biblio/22411302",
            "Abstract": "In this work, Bi-doped Mg{sub 2}Si{sub 1−x−y}Sn{sub x}Ge{sub y} (x = 0.4 and y = 0.05) solid solutions with the nominal Bi content of 0 ⩽ z ⩽ 0.035 were synthesized by solid state synthesis and sintering via hot pressing, and were studied in terms of structural, electronic transport and thermoelectric properties. These materials exhibit a high thermoelectric figure of merit, reaching a maximum of 1.4, which is the best among all reported Mg{sub 2}Si{sub 1−x}Sn{sub x} compounds on the Si-rich side. Within this range of Bi concentrations, X-ray diffraction, scanning electron microscopy and transmission electron microscopy characterization provided strong evidence for the presence of a number of secondary phases with different stoichiometries, including Si-rich, Sn-rich and Ge-rich phases. Moreover, the existence of micro- and nanofeatures is evident and their correlation with the thermoelectric properties and the high figure of merit is discussed. The influence of the amount of Bi doping on the thermoelectric properties of the specific compounds was investigated. A single effective mass was not proven efficient to fit the Seebeck coefficient and carrier concentration data, especially for carrier densities larger than 10{sup 20} cm{sup −3}. The adopted synthesis process also yielded very good repeatability and regularity in obtaining enhanced thermoelectric properties.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:KbBQZpvPDL4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Introducing Preservice Science Teachers in the Development of Inquiry-Based Activities",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-96184-2_11",
            "Abstract": "The aim of this paper is on how to prepare undergraduate science students to be able to develop inquiry-based activities. A course was designed where the development of inquiry based activities following the Hegarty-Hazel inquiry continuum model was used to design inquiry based experiments. A virtual (simulated) lab was opted as the appropriate “vehicle” since it provides unlimited access to laboratory settings, even from home where students rethink and refine their design. The course follows the design, development, practice, reflection and discussion of experimental activities. Different kinds of results are discussed to find out how the undergraduate science students evaluate the “vehicle” they have and how they perceive the inquiry continuum model.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Fabrication of nanocrystalline Mg2Si via ball milling process: Structural studies",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0032591011006346",
            "Abstract": "In this work, nanocrystalline Mg2Si material was fabricated via wet ball milling process using n-hexane as process control agent. Milling parameters, with emphasis on milling time and ball size, and conditions were studied in order to understand the process and investigate its effect on the structural features of the material. Crystallite size evolution during ball milling was followed by powder X-ray diffraction measurements as well as Transmission Electron Microscopy studies. Scanning Electron Microscopy images showed the agglomeration of the crystallites and the formation of particles with minimum mean size of ~ 1.6 μm. The simultaneous formation of MgO in the material is shown through powder X-ray diffraction and electron diffraction TEM studies. The broadened PXRD peaks were analyzed and crystalline size was estimated based on Scherrer equation. The crystallite size distributions were studied based on …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:Zph67rFs4hoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Synthesis and Thermoelectric Properties of low‐x  Series",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3322598",
            "Abstract": "Bi2Se3−xSx solid solutions, with low x values, were synthesized from melt. The solid solutions were studied in terms of phase purity using powder X‐ray diffraction (PXRD) in order to find the maximum x value for the preservation of the single Bi2Se3‐type phase. The lattice parameters were estimated and showed the reduced unit cell with the S incorporation in the lattice. SEM images confirmed the plate‐like morphology of the Bi2Se3−xSx single‐phase members. The thermoelectric properties (Seebeck coefficient and electrical conductivity) as well as IR reflectivity were also studied on members with x<0.4 that were found to form single phase Bi2Se3−xSx solid solutions.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:R3hNpaxXUhUC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Inhomogeneities and Effective Mass in Doped Mg2Si",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11664-015-4277-4.pdf",
            "Abstract": "Magnesium silicide (Mg2Si)-based materials are promising candidates as thermoelectric components for mid-temperature range (500–900 K) energy conversion. Many different approaches for determining the parabolicity of the conduction band have been suggested in the literature, while the values of the effective mass m* dL  reported, lie between 0.46 and 1.1 m0. The aim of this work is to contribute in elucidating the discrepancy observed in the effective mass values of the lower conduction band of highly doped Mg2Si and examine whether this discrepancy could be attributed to the method of determination or to the sample’s characteristics. We present the results of effective mass calculations at room temperature (RT) by applying different experimental methods and models (parabolic and non-parabolic) in two different groups of samples; one yielding profound inhomogeneities (Sb …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Formation of Mg2Si/MgO Nano-composites Prepared by Dual Cathode Magnetron Sputtering",
            "Publication year": 2012,
            "Publication url": "https://www.scientific.net/JNanoR.17.175",
            "Abstract": "In this Work, Mg2si/MgO Nano-Composites Were Prepared by Co-Sputtering of Mg and Si Targets on Si {100} Substrates Using Dual Cathode Magnetron Sputtering. Films Were, Subsequently, Annealed at 380 C and 500 C for 4 Hours in Ar Gas Atmosphere. Various Mg/Si Sputtering Power Ratios Have Been Examined. Grown Films Were Characterized by XRD, SEM/EDS, and IR Reflectivity Measurements.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:mB3voiENLucC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "STUDENTS’MOTIVATION ON LEARNING MATERIAL SCIENCE TEACHING MODULES IN FIVE COUNTRIES",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Pnevmatikos/publication/251416199_Strand_1_LEARNING_SCIENCE_Students_Motivation_on_Learning_Material_Science_Teaching_Modules_in_Five_Countries/links/0deec51f00628a5cce000000/Strand-1-LEARNING-SCIENCE-Students-Motivation-on-Learning-Material-Science-Teaching-Modules-in-Five-Countries.pdf",
            "Abstract": "Teaching modules for comprehensive schools in specific domains related to materials science were designed and developed in five countries participating in the EU’s 6th framework project MaterialsScience (MS). The motivational properties of the designed modules were analysed through content analysis in the framework of Self-Determination Theory (SDT). Teaching experiments, including science inquiry activities, were organised in each participating country with at least 30 students taking part. Motivational features of the science activities in general and MS module activities were evaluated by the students with an Evaluation of Science Inquiry Activities–Questionnaire (ESIAQ). The ESIAQ is a multidimensional measurement device, developed in the framework of SDT. The motivational features of the MS module activities and science activities, in general, were evaluated very similarly in each country by students with ESIAQ. The most motivating feature of the MS module’s activities in all countries was the support for student interest and the least motivating feature was the support for the feeling of student autonomy.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solid-state synthesis and thermoelectric properties of Sb-doped Mg 2 Si materials",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s11664-012-2442-6",
            "Abstract": "Sb-doped magnesium silicide compounds have been prepared through ball milling and solid-state reaction. Materials produced were near-stoichiometric. The structural modifications have been studied with powder x-ray diffraction. Highly dense pellets of Mg2Si1−x Sb x  (0 ≤ x ≤ 0.04) were fabricated via hot pressing and studied in terms of Seebeck coefficient, electrical and thermal conductivity, and free carrier concentration as a function of Sb concentration. Their thermoelectric performance in the high temperature range is presented, and the maximum value of the dimensionless figure of merit was found to be 0.46 at 810 K, for the Mg2Si0.915Sb0.015 member.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "On the recovery of wasted heat using a commercial thermoelectric device",
            "Publication year": 2012,
            "Publication url": "http://przyrbwn.icm.edu.pl/APP/PDF/121/a121z1p89.pdf",
            "Abstract": "The emerging global need for energy production, conservation, and management has intensified interest in more effective means of power generation. Enhancements to the existing energy supply must come from a variety of renewable sources including solar, wind, biomass, and others. Another potential source of power is electricity from heat sources through the use of thermoelectric (TE) materials. The heat can come from the combustion of fossil fuels, from sunlight, or as a byproduct of various processes (eg combustion, chemical reactions, nuclear decay). Therefore, thermoelectric materials can play a role in both primary power generation and energy conservation (ie waste-heat harvesting).Thermoelectric (TE) generators make use of the Seebeck effect in semiconductors for the direct conversion of heat into electrical energy, which is of particular interest for waste heat recovery [1]. A thermoelectric generator (TEG) usually consists of several pairs of alternating p-and n-type semiconductor blocks, which are arranged thermally in parallel and connected electrically in a series circuit. Heating one side of the arrangement while the opposite side is cooled induces the heat flow, which is partly converted into electrical power.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing virtual experiments in electric circuits by high school students",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=11453111100164243246&hl=en&oi=scholarr",
            "Abstract": "The purpose of this study is to evaluate the effect of investigative activities in virtual laboratory environments to the ability of students to design and perform experiments in the field of electric circuits. An inquiry-based teaching intervention with a degree of guidance from cookbook lab to challenge lab was applied to 14-15 years old high school students. A post-instructional assessment scheme with two extra tasks was used to evaluate the students’ experiment design and execution skills. The students’ skills were rated in ten dimensions and scored according to a 3-level ranking scheme. Results show that after instruction most students demonstrate a moderate ability in designing and performing simple experiments in the field of electric circuits.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ENHANCING STUDENTS’ABILITIES TO DESIGN EXPERIMENTS OF THERMAL INTERACTIONS BY VIRTUAL INVESTIGATIONS IN A SIMULATED LABORATORY",
            "Publication year": 2009,
            "Publication url": "https://www.pegem.net/dosyalar/dokuman/29122018131257contemporary%20science%20education%20research%20-%20teaching.pdf#page=427",
            "Abstract": "The aim of this study is to explore the effect of investigative activities with virtual manipulations in a simulated Physics laboratory, in students’ ability to design experiments, while trying to answer everyday life problems in the area of thermal phenomena. A pre-post comparison methodology was applied concerning written tests and personal interviews of 14 students in a lower secondary compulsory school in Greece, attending an innovative teaching sequence in thermal phenomena as part of their typical physics course. The teaching sequence had two main characteristics: the active engagement of students in laboratory activities, and the use of ICT, mostly involving investigations and virtual object manipulations using “Thermolab”-an Open Learning Environment suitable for the study of thermal phenomena. For the evaluation of students’ designs, their answers were rated in various dimensions. Our findings support the statement that there was improvement observed in our students’ skills to design experiments. Students after the course mostly use scientific criteria to articulate their hypotheses, make better choices about the variables involved and the settings, can more clearly describe the process and phenomena involved, and decide the criteria of their hypothesis verification more successfully. This is a new interesting aspect of the educational value of simulations, among the others reported, but not very widely investigated.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Infrared Studies of the (1-x) PbTe–(x) PbSnS2 System",
            "Publication year": 2011,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/infrared-studies-of-the-1x-pbte-x-pbsns2-system/430A83E7EEABBC282CDED9AA2447B2AC",
            "Abstract": "In this work we report on the infrared properties of the thermoelectric (1-x)PbTe-xPbSnS2 system with x=0.03, 0.06, 0.11 and 0.33. The results obtained by the analysis of the reflectivity spectra are discussed together with the structural and morphological characteristics obtained by XRD and SEM-EDS measurements. The system was found macroscopically homogeneous for x=0.03 and x=0.06 and phase separated for x=0.11 and x=0.33. The analyzed ~150cm-1 PbS impurity mode demonstrated a composition close to the PbTe0.98S0.02 for the major phase. The incorporation of PbSnS2 causes a reduction in plasma frequency (decrease in carrier frequency concentration) and an increase in carrier mobility.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "2 Department of Mechanical and Manufacturing Engineering, University of Cyprus, Nicosia, Cyprus",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=13884187276440244613&hl=en&oi=scholarr",
            "Abstract": "In this work, thermoelectric device was made, using a commercially available ThermoElectric Generator (TEG), in order to measure the gained power and efficiency for longterm performance. The module was subjected to sequential hot side heating at 200 C (392 F), and cooling for 6000 cycles, in order to measure the TEG, s power and EMF change. A 14% increase in the TEG, s material resistance was found, as well as a 5% reduction in the Seebeck coefficient. After the experiment, the module was disassembled and thermoelectric p-and nlegs were examined using IR spectroscopy.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:sSrBHYA8nusC",
            "Publisher": "Materials Research Society"
        },
        {
            "Title": "Efficiency study of a commercial thermoelectric power generator (TEG) under thermal cycling",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11664-009-0988-8",
            "Abstract": "Thermoelectric generators (TEGs) make use of the Seebeck effect in semiconductors for the direct conversion of heat to electrical energy. The possible use of a device consisting of numerous TEG modules for waste heat recovery from an internal combustion (IC) engine could considerably help worldwide efforts towards energy saving. However, commercially available TEGs operate at temperatures much lower than the actual operating temperature range in the exhaust pipe of an automobile, which could cause structural failure of the thermoelectric elements. Furthermore, continuous thermal cycling could lead to reduced efficiency and lifetime of the TEG. In this work we investigate the long-term performance and stability of a commercially available TEG under temperature and power cycling. The module was subjected to sequential hot-side heating (at 200°C) and cooling for long times (3000 h) in order to …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Synthetic conditions and their doping effect on {Beta}-K {sub 2} Bi {sub 8} Se {sub 13}.",
            "Publication year": 2009,
            "Publication url": "https://www.osti.gov/biblio/1008306",
            "Abstract": "In this work the synthetic conditions for K {sub 2} Bi {sub 8} Se {sub 13} and their effect on its thermoelectric properties were investigated. K {sub 2} Bi {sub 8} Se {sub 13} was prepared as a single phase using K {sub 2} Se and Bi {sub 2} Se {sub 3} as starting materials in a furnace or via a reaction using direct flame, followed by remelting or annealing. Seebeck coefficient measurements showed that the doping level in the material is sensitive to the synthetic conditions. Higher synthesis temperatures as well as the flame reaction technique followed by annealing gave more homogenous samples with higher Seebeck coefficient. IR optical spectroscopic measurements showed a wide range of doping level achieved among the different synthetic conditions. These findings suggest that synthetic conditions can act as a useful tool for the optimization of the thermoelectric properties of these materials.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Argonne National Lab.(ANL), Argonne, IL (United States)"
        },
        {
            "Title": "Thermoelectric properties of highly efficient Bi-doped Mg2Si1− x− ySnxGey materials",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359645414003115",
            "Abstract": "In this work, Bi-doped Mg2Si1−x−ySnxGey (x = 0.4 and y = 0.05) solid solutions with the nominal Bi content of 0 ⩽ z ⩽ 0.035 were synthesized by solid state synthesis and sintering via hot pressing, and were studied in terms of structural, electronic transport and thermoelectric properties. These materials exhibit a high thermoelectric figure of merit, reaching a maximum of 1.4, which is the best among all reported Mg2Si1−xSnx compounds on the Si-rich side. Within this range of Bi concentrations, X-ray diffraction, scanning electron microscopy and transmission electron microscopy characterization provided strong evidence for the presence of a number of secondary phases with different stoichiometries, including Si-rich, Sn-rich and Ge-rich phases. Moreover, the existence of micro- and nanofeatures is evident and their correlation with the thermoelectric properties and the high figure of merit is discussed. The …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "“Pec task explorer”: a tool for Ict supported learning in science",
            "Publication year": 2010,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64757",
            "Abstract": "In modern science teaching the role of ICT in supporting learning cannot be underestimated, let alone be ignored. Especially for the Predict-Observe-Explain strategy (POE), multimedia-supported POE tasks may be used as a diagnostic, pre-instructional assessment tool or a summative assessment tool. In recent years a handful of such tools have been developed, both through a generalised learning management system (such as LAMS) and as independent applications (Learning Designs). The tool we have developed is an advanced tool of the later type.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:eJXPG6dFmWUC",
            "Publisher": "University of Cyprus"
        },
        {
            "Title": "np transformation in TlBi {sub (1-x)} Sb {sub x} Te {sub 2} system",
            "Publication year": 2009,
            "Publication url": "https://www.osti.gov/etdeweb/biblio/21174700",
            "Abstract": "TlBi{sub (1-x)}Sb{sub x}Te{sub 2} quaternary crystals that crystallize in a rhombohedral structure and according to their properties are classified between semimetals and narrow energy gap semiconductors, are studied. The study of their optical and electrical behavior reveal that they are quite sensitive to the Sb content x, and it is found that the substitution of Bi- with Sb-atoms in TlBiTe{sub 2} crystals leads initially to a decrease in the plasma frequency. However, for higher Sb contents, the plasma frequency increases. At room temperature, samples with x < 0.8 are n-type semiconductors, becoming p-type ones for x > 0.8. A model suggesting a suppression of the free electron concentration induced by the incorporation of Sb atoms into the crystal lattice of TlBiTe{sub 2} is used to explain this transition in the conductivity type.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:bKqednn6t2AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Thermoelectric properties of nanocrystalline PbTe synthesized by mechanical alloying",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11664-010-1234-0",
            "Abstract": "In this work, nanocrystalline lead telluride powder was synthesized from high-purity elements by mechanical alloying by means of a planetary ball-milling procedure. The milling medium was tungsten carbide, and the diameter of the balls was varied in order to investigate the effect on the structural features of the material. Phase transformations and crystallite evolution during ball-milling were followed by powder x-ray diffraction (PXRD). The broadened PXRD peaks were analyzed with Voigt functions, revealing small crystalline size and stress introduced during the mechanical alloying process. Transmission electron microscopy (TEM) studies confirmed the material’s nanostructure, as well as the effect of ball diameter on the size of the crystals. Thermoelectric properties are discussed in terms of the Seebeck coefficient and the nominal carrier concentration, as determined by Hall-effect measurements. The …",
            "Abstract entirety": 0,
            "Author pub id": "K5h2ihoAAAAJ:Se3iqnhoufwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "NP Transformation In TlBi (1-x) SbxTe2 System",
            "Publication year": 2009,
            "Publication url": "http://acikerisim.iku.edu.tr/handle/11413/1269",
            "Abstract": "TlBi(1-x)SbxTe2 quaternary crystals that crystallize in a rhombohedral structure and according to their properties are classified between semimetals and narrow energy gap semiconductors, are studied. The study of their optical and electrical behavior reveal that they are quite sensitive to the Sb content x, and it is found that the substitution of Bi- with Sb-atoms in TlBiTe2 crystals leads initially to a decrease in the plasma frequency. However, for higher Sb contents, the plasma frequency increases. At room temperature, samples with x < 0.8 are n-type semiconductors, becoming p-type ones for x > 0.8.   A model suggesting a suppression of the free electron concentration induced by the incorporation of Sb atoms into the crystal lattice of TlBiTe2 is used to explain this transition in the conductivity type. (c) 2007 Elsevier B.V. All rights reserved.",
            "Abstract entirety": 1,
            "Author pub id": "K5h2ihoAAAAJ:XiVPGOgt02cC",
            "Publisher": "Elsevier Science Sa, Po Box 564, 1001 Lausanne, Swıtzerland"
        }
    ]
}]