[{
    "name": "Ευάγγελος Παπαπέτρου",
    "romanize name": "Evangelos Papapetrou",
    "School-Department": "Μηχανικών Η/Υ & Πληροφορικής",
    "University": "uoi",
    "Rank": "Επίκουρος Καθηγητής (Μόνιμος)",
    "Apella_id": 5478,
    "Scholar name": "Evangelos Papapetrou",
    "Scholar id": "R6Ldg5UAAAAJ",
    "Affiliation": "Assistant Professor, Dept. of Computer Science and Engineering, University of Ioannina",
    "Citedby": 705,
    "Interests": [
        "Computer Networks",
        "Telecommunications",
        "Wireless and Mobile Networks",
        "Satellite Communications"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=R6Ldg5UAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Disjoint routes for on demand routing protocols in ad hoc networks",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/965941/",
            "Abstract": "Wireless mobile networks are characterized by stochastic topology variations. Sudden movements of mobile hosts in and out of each other's range impose limitations on the system performance. Routing protocols have been proposed for producing stable routes. All these protocols address the issue of route stability rather than connection stability. This paper proposes a new protocol for enhancing stability of connections rather than routes, without increasing the related overhead. The new protocol is based on the employment of a number of disjoint paths in each route discovery phase. Its performance is evaluated by simulations in the Java programming language that present adaptability to increased mobility.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Privacy-preserving Routing in Delay Tolerant Networks based on Bloom Filters",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7158148/",
            "Abstract": "Privacy preservation in opportunistic networks, such as disruption and delay tolerant networks, constitutes a very challenging area of research. The wireless channel is vulnerable to malicious nodes that can eavesdrop data exchanges. Moreover, all nodes in an opportunistic network can act as routers and thus, gain access to sensitive information while forwarding data. Node anonymity and data protection can be achieved using encryption. However, cryptography-based mechanisms are complex to handle and computationally expensive for the participating (mobile) nodes. We propose SimBet-BF, a privacy-preserving routing algorithm for opportunistic networks. The proposed algorithm builds atop the SimBet algorithm and uses Bloom filters so as to represent routing as well as other sensitive information included in data packets. SimBet-BF provides anonymous communication and avoids expensive cryptographic …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A replication strategy for mobile opportunistic networks based on utility clustering",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870521002237",
            "Abstract": "Dynamic replication is a wide-spread multi-copy routing approach for efficiently coping with the intermittent connectivity in mobile opportunistic networks. According to it, a node forwards a message replica to an encountered node based on a utility value that captures the latter’s fitness for delivering the message to the destination. The popularity of the approach stems from its flexibility to effectively operate in networks with diverse characteristics without requiring special customization. Nonetheless, its drawback is the tendency to produce a high number of replicas that consume limited resources such as energy and storage. To tackle the problem we make the observation that network nodes can be grouped, based on their utility values, into clusters that portray different delivery capabilities. We exploit this finding to transform the basic forwarding strategy, which is to move a packet using nodes of increasing utility, and …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Adyton: A Network Simulator for Opportunistic Networks",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=4513794843369186015&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cross-layer routing for peer database querying over mobile ad hoc networks",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128611003707",
            "Abstract": "The widespread of mobile ad hoc networking calls for a careful design of network functions in order to meet the application requirements and economize on the limited resources. In this paper we address the problem of distributing query messages among peers in mobile ad hoc networks. We assume that peers are organized in classes. Each peer possesses a local database and can answer queries posed by other peers. Each peer can also pose queries to all the peers belonging to a certain class or classes. Contrary to traditional p2p lookup queries, we are interested in collecting answers from as many peers as possible. We propose a query routing protocol, called CL-QF, which is based on a novel cross-layer design. The purpose of this design is to incorporate application layer specifics (e.g., class information) into the network layer in order to reduce transmissions therefore economize on resources. CL-QF …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A novel approach to source routing for multi-hop ad hoc networks",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1237340/",
            "Abstract": "The popularity of wireless ad hoc networks has significantly increased over the past years. As a result, a great scientific effort has been made to develop and implement efficient routing protocols, able to cope with the stochastically varying topology of such networks. We present an efficient routing protocol that combines source routing, caching of routes, and the use of sequence numbers to alleviate the routing load and at the same time increase the successful delivery of data packets.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Satellite Handover Techniques in LEO Systems for Multimedia Services",
            "Publication year": 2004,
            "Publication url": "http://www.cs.uoi.gr/~epap/papers/ijsc_2004.pdf",
            "Abstract": "Satellite handover procedures are proposed for investigating the satellite diversity (namely, the existing common coverage area between contiguous satellites) of some satellite constellations in order to provide an efficient handover strategy and QoS in multimedia applications. Based always on a tradeoff of the blocking and forced termination probabilities three different handover criteria are examined for the appropriate selection of the servicing satellite. Each criterion can be applied either to new or handover calls, therefore we investigate nine different service schemes. Extended simulation results provide a deep insight on the system operation and lead to a beneficiary system architecture.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiservice on-demand routing in LEO satellite networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4786489/",
            "Abstract": "In this paper, a distributed on-demand routing protocol for Low Earth Orbit (LEO) satellite systems, named multiservice on-demand routing (MOR), is proposed and evaluated. The proposed protocol adjusts the routing procedure to the QoS requirements of different traffic classes. The performance of the MOR protocol is compared to the unique proposal for traffic class dependent routing in the literature and the good characteristics of the proposed scheme are corroborated by ample simulation experiments, where significant gains in performance are witnessed.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed load-aware routing in LEO satellite networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4698340/",
            "Abstract": "In this paper, we propose a lightweight distributed routing algorithm, called Distributed Load-Aware Routing (DLAR). The proposed protocol adopts a distributed approach to handle the complexity of the satellite system and at the same time provides a hop-by-hop mechanism for splitting traffic load in order to alleviate the problem of congestion that occurs near polar regions. The performance of DLAR is assessed through extensive simulations and compared to the performance of centralized routing schemes proposed so far in the literature. Simulation results document and confirm the positive characteristics of the proposed protocol.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handover policies in LEO systems with satellite diversity",
            "Publication year": 2003,
            "Publication url": "https://users.auth.gr/niovi/papers/C046.pdf",
            "Abstract": "In this paper satellite handover procedures are proposed for investigating the satellite diversity (namely, the existing common coverage area between contiguous satellites) of some satellite constellations in order to provide an efficient handover strategy. Based always on a tradeoff of the blocking and forced termination probabilities three different handover criteria are examined for the appropriate selection of the servicing satellite. Each criterion can be applied either to new or handover calls, therefore we investigate nine different service schemes. Extended simulation results provide a deep insight on the system operation and lead to a beneficiary system architecture.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework for the evaluation of routing protocols in opportunistic networks",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366418306625",
            "Abstract": "The evaluation of routing protocols for opportunistic networks can be seen as a multidimensional problem because it involves several performance aspects. To capture these aspects various evaluation metrics are used, such as the number of delivered packets, the delivery delay and the number of transmissions. Unfortunately, in the context of opportunistic networks, these metrics are often highly correlated and usually conflicting. To make things worse, the characteristics of the network affect the importance of each metric as well as the levels of its correlation with other metrics. In this work, we first propose a set of performance evaluation metrics that are normalized with respect to the optimal performance. This approach tackles several of the above-mentioned shortcomings of traditional evaluation metrics. We then formulate the evaluation of routing protocols as a Multiple-Criteria Decision-Making (MCDM) problem …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Revisiting XOR-based Network Coding for Energy Efficient Broadcasting in Mobile Ad Hoc Networks",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366416302857",
            "Abstract": "Network coding is commonly used to improve the energy efficiency of network-wide broadcasting in wireless multi-hop networks. In this work, we focus on XOR-based broadcasting in mobile ad hoc networks with multiple sources. We make the observation that the common approach, which is to benefit from the synergy of XOR network coding with a CDS-based broadcast algorithm, suffers performance breakdowns. After delving into the details of this synergy, we attribute this behavior to an important mechanism of the underlying broadcast algorithm, known as the “termination criterion”. To tackle the problem, we propose a termination criterion that is fully compatible with XOR coding. In addition to that, we revisit the internals of XOR coding. We first enhance the synergy of XOR coding with the underlying broadcast algorithm by allowing each mechanism to benefit from information available by the other. In this way …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:-f6ydRqryjwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On-demand routing in LEO satellite systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4288685/",
            "Abstract": "In this paper, a location-assisted on-demand routing (LAOR) protocol for low earth orbit (LEO) satellite systems is proposed and evaluated. This protocol can be viewed as a variant of the well-known ad-hoc on-demand distance vector (AODV) routing protocol, tailored to the requirements imposed by the characteristics of LEO satellite systems' topology. The LAOR protocol is assessed for different link-cost metrics and compared to centralized routing protocols proposed in the literature thus far. Simulation studies further document and confirm the positive characteristics of the proposed protocol.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting social preferences for congestion control in opportunistic networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6962204/",
            "Abstract": "It has been observed that opportunistic networks exhibit a highly unbalanced traffic load distribution, mainly because of the heterogeneity in mobility and the greedy routing decisions, leading to packet drops due to storage constraints. The existing strategies rely either on fairness techniques or on diverting traffic to alternative routes in order to control congestion. The result is a dilemma between performance and fairness. In this work, we introduce a congestion control mechanism that provides a tunable trade-off between efficiency and fairness. We rely on the social preferences of the nodes for dynamically tuning the aforementioned trade-off. Our simulations show that the proposed algorithm achieves high delivery ratio, combined with low end-to-end delay and routing cost, without sacrificing fairness under high traffic load.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-layer networking for peer databases over wireless ad-hoc communities",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4289241/",
            "Abstract": "In this paper we address the problem of efficiently distributing query messages among peers in a wireless ad hoc network. We assume that peers are organized in classes. Each peer possesses a local database and can answer queries posed by other peers. Each peer can also pose queries to all the peers belonging to a certain class and/or within a certain range of distance in the network. Contrary to traditional p2p lookup queries, we are interested in collecting answers from as many peers as possible. To efficiently serve this purpose, we take advantage of routing and application layer specifics (e.g., class information, network distance) to avoid flooding and at the same time preserve compatibility with traditional routing and transport mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic Characterization, Routing and Security Issues in High Speed Networks Interconnected Through LEO Constellations",
            "Publication year": 2002,
            "Publication url": "http://www.cse.uoi.gr/~epap/papers/1999_c01_cost.pdf",
            "Abstract": "The COST Action 253 is aiming to study high speed terrestrial (based on ATM technology) networks interconnected by non-GEO satellite constellations. The performance of these networks depends very much on the successful characterization and estimation of offered services and traffic loading, as well as on efficient management techniques for the integrated, terrestrial and space system.In the context of COST253, WG1 (Traffic Characterization), WG5 (Network Security Issues) and part of WG4 (Networking) cover mainly these issues as it is seen in ANNEX I, where is also given the manpower involved in these topics. In the following sections we shall cover in brief the research carried out and the results obtained so far in the Action during the last two years of operation.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance study of adaptive routing algorithms for LEO satellite constellations under Self‐Similar and Poisson traffic",
            "Publication year": 2000,
            "Publication url": "https://content.iospress.com/articles/space-communications/sc209",
            "Abstract": "A comparative study of routing techniques is carried out for LEO constellations interconnecting high speed terrestrial networks, assuming Poisson and Self‐Similar input traffic. Shortest path routing as well as optimal routing (flow deviation) methods are applied for balanced and unbalanced traffic load and for uniform and non uniform distribution of the earth stations. The performance of flow deviation method is shown to be very successful even for the LEO complicated networks, for both Poisson or Self‐Similar input. A modification of the classic flow deviation algorithm regarding the number of paths we work with is proposed. Indeed, it is proved that ak‐paths flow deviation method is always easy to obtain and gives robust results for any traffic pattern at a very affordable algorithmic complexity.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A Low Complexity Network-Coded ARQ protocol for Ultra-Reliable Low Latency Communication",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9469482/",
            "Abstract": "Random Linear Network Coding (RLNC) schemes that use a sliding window, also known as Sliding Window RLNC schemes, have proved to be efficient for reliable data transmission over an unreliable link. They combine the concept of the sliding window from (Automatic Repeat reQuest) ARQ protocols with RLNC in order to maximize the data flow and quickly recover from losses through redundant coded packets. We make the observation that, in these protocols, optimizing the data flow rate and the coding operation are two distinct objectives that cannot be met only by fine-tuning the sliding window size. To tackle the problem, we propose rapidARQ, a sliding window RLNC scheme with feedback that uses two distinct windows; the sliding window, which is used to optimize the data flow based on the link’s bandwidth-delay product, and the coding window, which is used exclusively in the coding process. We …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient broadcasting using packet history in mobile ad hoc networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/document/6069642/",
            "Abstract": "Broadcasting is a key component of several networking mechanisms in mobile  ad hoc  networks. However, its traditional implementation suffers from resource consumption caused by message redundancy. Several efficient algorithms have been proposed to tackle this problem. Among them, the class of algorithms that construct on-demand a connected dominating set, known as dominant pruning, yields an improved performance. Dominant pruning algorithms capitalise on neighbourhood information and the previous hop of the broadcast message in order to minimise the set of nodes that forward a message. The proposed algorithm makes the observation that all the nodes, visited by a broadcast message, may be exploited in order to minimise the cost of broadcasting. The analysis of the proposed algorithm as well as extensive simulation results confirm the rationale behind the proposed approach and prove the …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IET"
        },
        {
            "Title": "Various Routing Techniques for non-GEO Satellite Constellations",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.149.2910&rep=rep1&type=pdf",
            "Abstract": "Two different routing algorithm categories are studied in this paper for a typical LEO satellite constellation. Shortest path algorithms and optimal routing. Their performance is investigated through extended real time simulations.In the context of satellite constellations the basic parameters for a typical network such as delay, throughput, link utilization must be supplemented by new factors imposed by the nature of satellite operation, like the handover procedures, the non-uniformity of load distribution in the space segment and the continuous topology variation. The pros and cons of the techniques are illustrated and helpful conclusions for the network design are provided.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network-wide md and network coding for heterogeneous video multicast",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6666770/",
            "Abstract": "Multiple Description coding (MD) has been proved to be very efficient for video multicast over random networks when combined with network coding. However, in the case where heterogeneous receivers are present in the network, the impact of the method is bounded by the fact that the solution to the inherent rate allocation problem is based on a compromise between low and high bandwidth receivers. To tackle this problem, we propose a novel video multicast scheme that enhances the combination of MD and network coding with a mechanism that allows all intermediate nodes to actively participate in MD coding by adjusting the size of the video descriptions. In this way, it is possible to tune the rate of the transmitted video stream in order to meet the needs of each receiver. The proposed method significantly improves the quality of the video delivered to all the receivers in the network, regardless of their …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sequence number aided source routing for ad-hoc networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-005-8728-8",
            "Abstract": "Wireless multihop mobile networks, also known as ad hoc networks, are characterized by stochastic topology variations. Random movements of mobile hosts in and out of each other's range encumber smooth system operation and impose limitations on the network performance. Various routing protocols suitable for such networks have been proposed however implementation and performance issues are still considered top research priorities. This paper proposes a new reactive protocol that introduces the use of sequence numbers for evaluating validity of cached routing information when source routing and route caching are used. The new protocol reduces the possibility of using and spreading across the network stale routing information therefore reduces the overhead involved in finding a route. To demonstrate the performance of the proposed protocol we compare it, through a detailed simulation …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Deterministic broadcasting and random linear network coding in mobile ad hoc networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7822968/",
            "Abstract": "Network coding has been successfully used in the past for efficient broadcasting in wireless multi-hop networks. Two coding approaches are suitable for mobile networks; random linear network coding (RLNC) and XOR-based coding. In this paper, we focus on the problem of multiple source broadcasting in mobile ad hoc networks. We make the observation that RLNC provides increased resilience to packet losses compared with XOR-based coding. We develop an analytical model that justifies our intuition. However, the model also reveals that combining RLNC with probabilistic forwarding, which is the approach taken in the literature, may significantly impact RLNC's performance. Therefore, we take the novel approach to combine RLNC with a deterministic broadcasting algorithm in order to prune transmissions. More specifically, we propose a connected dominating set-based algorithm that works in synergy with …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive handover management for multiservice NGSO satellite systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394756/",
            "Abstract": "In this paper we propose a handover method for multiservice non-geo satellite systems. The proposed algorithm can be used for satellite handover as well as for cell handover when a fixed amount of resources is allocated to each cell. Specifically, we consider the case in which the satellite system provides services to users of different QoS requirements. The first type of users require the minimization and, if possible, the elimination of the probability of forcing a connection in progress to termination during a handover. On the other hand, the users of the second category do not have any specific handover requirements. The new method is evaluated through extensive simulations and is proved to meet the requirements of the first type of users while at the same time maximizes the system utilization for both types of users.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analytic study of Doppler-based handover management in LEO satellite systems",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541433/",
            "Abstract": "The problem of dynamic handover management in low Earth orbit (LEO) satellite systems is addressed. Particularly, an analytical study of a newly proposed method for handover management, called dynamic Doppler-based handover prioritization scheme (DDBHP), is presented. DDBHP utilizes Doppler shift monitoring of each communicating user terminal onboard the satellite and geometric characteristics to accurately predict the handover load. As a result, handover requests are more effectively managed, resulting in an improved performance in terms of blocking and forced termination probabilities. Moreover, by supporting guaranteed handovers, DDBHP can be used to provide QoS to users of future broadband satellite networks. An extensive mathematical model that justifies Doppler shift monitoring is presented along with a detailed queueing model used not only to evaluate DDBHP performance but also to …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power-aware QoS enhancement in multihop DS-CDMA visual sensor networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6622748/",
            "Abstract": "We propose a quality-driven method for network resource allocation with transmission power control in a multihop Direct Sequence Code Division Multiple Access (DS-CDMA) Wireless Visual Sensor Network (WVSN). A multihop WVSN typically consists of source nodes that monitor different areas and relay nodes that retransmit recorded scenes. In order to achieve the best possible video quality at the receiver while consuming the least possible transmission power, we propose a joint optimization scheme that allocates the available resources among the nodes with respect to the imposed constraints. Moreover, we formulate a weighted bi-objective optimization problem and study the tradeoff between video quality and consumed transmission power. The simulation demonstrate that excessive transmission power is used when power control is omitted for a rather small quality gain for certain nodes.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Coordinating replication decisions in multi-copy routing for opportunistic networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6962142/",
            "Abstract": "One of the dominant approaches in coping with the intermittent connectivity of opportunistic networks is packet replication. However, the need for a distributed operation forces the nodes carrying a message copy to make replication decisions without taking into account the replication state of other nodes. This strategy can lead to the creation of an excessive number of replicas thus exhausting the limited node resources such as energy and storage capacity. In this paper, we propose a simple yet efficient method which, without incurring any additional cost, allows nodes to share information about the replication process in order to avoid unnecessary replication. Our approach significantly reduces the routing cost without sacrificing delivery rate. Furthermore, it is generic in the sense that it can be implemented regardless of the utility metric used for making the replication decision. We validate the performance gains of …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Context-Aware Query Processing in Ad-Hoc Environments of Peers",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/context-aware-query-processing-hoc/8008",
            "Abstract": "In this article, we deal with context-aware query processing in ad-hoc peer-to-peer networks. Each peer in such an environment has a database over which users execute queries. This database involves (a) relations which are locally stored and (b) virtual relations, all the tuples of which are collected from peers that are present in the network at the time when a query is posed. The objective of our work is to perform query processing in such an environment and, to this end, we start with a formal definition of the system model. Next, we formally define SQLP, an extension of SQL that covers the termination of queries, the failure of individual peers and the semantic characteristics of the peers of such a network. Moreover, we present a query execution algorithm as well as the formal definition of all the operators that take place in a query execution plan.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analyzing the Synergy between Broadcast Polling and Piggybacking in WiMAX Networks",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1612.03042",
            "Abstract": "In this work we present a model for analyzing the combined use of broadcast polling and piggybacking in Worldwide Interoperability for Microwave Access (WiMAX) networks. For an accurate analysis of piggybacking, the model focuses on the realistic case of limited up-link bandwidth and non-trivial queueing capability at the subscriber stations. We first model the activity of a subscriber station using a Markov chain and its queue as an M/G/1 system with vacations in order to facilitate the analysis of the piggyback mechanism. We then derive a set of fixed point equations that describe not only the contention process at the network level but also bandwidth allocation to contending and piggybacked requests. Our model uses a minimal set of assumptions and is generic in the sense that it is customizable through a set of parameters. It can also reproduce the system performance in both saturated and non-saturated conditions. After validating our analysis through extensive simulations, we shed light on the aspects of the synergy between broadcast polling and piggybacking and unveil the pros and cons of using the latter.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid satellite/terrestrial networks: State of the art and future perspectives",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1577776.1577777",
            "Abstract": "In this paper, the main role of satellite systems in hybrid satellite/terrestrial networks will be highlighted, as well as the main functions which should be performed to optimize the performance of these hybrid networks. Then, some typical services believed to occupy a great portion of the future telecommunication service market and benefiting from these hybrid architectures will be presented.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A proposal of optimal routing techniques for non-GEO satellite systems",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1011345218833",
            "Abstract": "The continuously increasing number of mobile subscribers has generated a strong interest in expanding terrestrial wireless networks and supporting real-time communications regardless of the user location. These targets require a cautious management of available resources since the development of global systems implies a quite high cost. Routing is an important network function and must be very carefully considered. This paper proposes the implementation of optimal routing techniques for connection oriented mode and variable network topology, as non-GEO satellite systems require. In particular a well known optimal routing technique, named Flow Deviation, is modified by adding new procedures that render its applicability to a handover environment feasible and effective. Its performance is investigated through extended real time simulations in terms of delay, throughput, link utilization and also in …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Cluster-based Replication: A forwarding strategy for mobile opportunistic networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8449818/",
            "Abstract": "Mutli-copy routing is an efficient and wide-spread approach for coping with the intermittent connectivity of mobile opportunistic networks. One popular multi-copy approach is known as “dynamic” replication; each node creates replicas on a contact basis using a utility that determines a node's fitness for delivering a message to its destination. This scheme is highly flexible, configurable with different utility functions and able to operate efficiently in networks with diverse characteristics. Nonetheless, its drawback is the tendency to produce a high number of replicas that consume limited resources such as energy and storage. Our approach to tackle this problem relies on the observation that, based on their utility values, the network nodes can be grouped into clusters that portray different delivery capabilities. Then, to avoid unnecessary replication, we exploit this finding to replicate a packet to nodes that belong to …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed on-demand routing for LEO satellite systems",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128607001582",
            "Abstract": "Notwithstanding the limited commercial success of the first narrowband low earth orbit (LEO) satellite systems, the interest of the scientific community in this type of systems has been revived on the basis of the current trend toward the migration to all IP-based services. LEO systems can play a pivotal role in providing services to areas where there is no substantial terrestrial infrastructure. Above all, LEO satellite systems can be used as backbone networks to interconnect autonomous systems worldwide. Such an approach provides flexibility in managing the resulting integrated network infrastructure and supporting innovative applications. In this context, routing data from the source all the way to the destination constitutes a daunting challenge. In this paper, a location-assisted on-demand routing (LAOR) protocol is proposed and evaluated. The proposed protocol introduces for the first time in satellite systems the …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "QoS handover management in LEO/MEO satellite systems",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1022569901936",
            "Abstract": "Low Earth Orbit (LEO) satellite networks are foreseen to complement terrestrial networks in future global mobile networks. Although space segment topology of a LEO network is characterized by periodic variations, connections of mobile stations (MSs) to the satellite backbone network alter stochastically. As a result the quality of service delivered to users may degrade. Different procedures have been proposed either as part of a resource allocation mechanism or as part of an end-to-end routing protocol to manage transitions of MSs from one satellite to another (handover). All of these techniques are based on the prioritization of requested handovers to ease network operation and therefore enhance provision of service. This paper proposes a new handover procedure that exploits all geometric characteristics of a satellite-to-MS connection to provide an equable handover in systems incorporating onboard …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Supporting QoS over handovers in LEO satellite systems",
            "Publication year": 2002,
            "Publication url": "https://www.cs.uoi.gr/~epap/papers/2002_c01_ist.pdf",
            "Abstract": "Low Earth Orbit (LEO) satellite networks are characterized by topology variations. Although space segment topology varies periodically, connections of mobile stations (MS’s) to the satellite network alter stochastically. As a result the quality of service delivered to users may degrade. Different procedures have been proposed either as part of a resource allocation mechanism or as part of an end-to-end routing protocol to manage transitions of MS’s from one satellite to another (handover). All of these procedures are based on predictions of the requested handovers to facilitate network operation and therefore enhance quality of service. This paper proposes a new handover procedure that exploits all geometric characteristics of a satelliteto-MS connection to provide an equable handover.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A satellite-based architecture for internet P2P applications",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1577776.1577781",
            "Abstract": "This paper proposes an architecture for unstructured p2p Internet applications. The paper focuses on applications that use superpeers. The proposed architecture utilizes satellites for building a backbone network for connecting superpeers. This network provides fully meshed connectivity to superpeers, in order to minimize the complexity of the p2p overlay network and at the same time preserves the flexibility in developing new applications. Technical aspects related to the implementation of the proposed architecture are discussed and useful conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the set cover problem for broadcasting in wireless ad hoc networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6612768/",
            "Abstract": "The set cover problem has been extensively used in broadcast algorithms to model the process of selecting the nodes that should forward a message. Surprisingly, none of the research efforts focuses on solving the set cover problem. Instead, virtually every broadcast scheme uses the well known and generic purpose Greedy Set Cover (GSC) algorithm to tackle the problem. We focus on solving the set cover problem in the context of wireless ad hoc networks and show that providing an efficient solution has a significant performance impact on broadcast algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Immersive interconnected virtual and augmented reality: A 5g and iot perspective",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10922-020-09545-w",
            "Abstract": "Despite remarkable advances, current augmented and virtual reality (AR/VR) applications are a largely individual and local experience. Interconnected AR/VR, where participants can virtually interact across vast distances, remains a distant dream. The great barrier that stands between current technology and such applications is the stringent end-to-end latency requirement, which should not exceed 20 ms in order to avoid motion sickness and other discomforts. Bringing AR/VR to the next level to enable immersive interconnected AR/VR will require significant advances towards 5G ultra-reliable low-latency communication (URLLC) and a Tactile Internet of Things (IoT). In this article, we articulate the technical challenges to enable a future AR/VR end-to-end architecture, that combines 5G URLLC and Tactile IoT technology to support this next generation of interconnected AR/VR applications. Through the use of IoT …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Priority-based cross-layer optimization for multihop DS-CDMA visual sensor networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6467056/",
            "Abstract": "We propose a novel priority-based approach that enables the optimal control of the transmission power and the use of the available network resources of a multihop Direct Sequence Code Division Multiple Access (DS-CDMA) Wireless Visual Sensor Network (WVSN). TheWVSN nodes can either monitor different scenes (source nodes) or retransmit videos of other nodes (relay nodes). Moreover, in real environments the source nodes monitor different scenes that may be of dissimilar importance. Hence a higher end-to-end quality is demanded for those nodes that are assigned a higher priority. Overall, each node has different power and resource requirements, and therefore a global optimization approach is required. For the purpose of enhancing the delivered video quality of the source nodes with respect to their priorities, we define and suggest the use of priority-based optimization criteria. Experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint quality enhancement and power control for wireless visual sensor networks based on the nash bargaining solution",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1051200416000038",
            "Abstract": "We propose a cooperative method for resource allocation with power control in a multihop Direct Sequence Code Division Multiple Access Wireless Visual Sensor Network (WVSN). Typical multihop WVSNs consist of visual sensors that record different scenes and relay nodes that retransmit video data until the base station is reached. The error prone wireless environment contributes to the end-to-end video quality degradation. Moreover, the limited battery life span of the network nodes poses challenges on the management of power consumption. The different resource requirements of the WVSN nodes necessitate a quality-driven and power-aware resource allocation mechanism. We formulate the joint Quality Enhancement and Power Control problem based on a utility function that reflects both the benefit in terms of video quality and the cost in terms of transmission power. This function is employed by the Nash …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Dominant pruning based query routing in peer databases over MANETs",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5700106/",
            "Abstract": "In this paper we address the problem of efficiently routing queries among peers in a mobile ad-hoc network. Peers possess a local database and can pose queries to other peers, forming a distributed peer database application. In contrast to traditional networking, routing a query involves its delivery to as many as possible peers that are relevant to the query while at the same time minimizing the number of non-relevant peers involved in the process, therefore economizing on the limited network resources. To tackle this problem, we propose two novel protocols, namely TDP-ECT and CTPD-ECT. The new protocols utilize dominant pruning to distribute queries while at the same time incorporate application layer specifics in order to minimize the cost of routing. The proposed protocols are evaluated through extensive simulations and are proved suitable for wireless mobile environments.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance of shortest path routing under various link cost metrics for non-geo satellite systems",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/881556/",
            "Abstract": "This paper deals with the performance evaluation of various path selection strategies that are suitable for non-GEO satellite systems. The modified Dijkstra (1959) algorithm is used for different link cost functions. These various cost functions result to different performance in terms of system utilization, rerouting failure probability and delay parameters. In particular four metrics have been examined for the establishment of paths. The first two are based on the propagation delay and the traffic at the network whereas the other two are based on new, special factors that characterize the operation of inter-satellite links (ISLs). The scenarios are tested through extended real-time simulations and fruitful conclusions are derived at the end of the study.",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distortion-aware joint scheduling and resource allocation for wireless video transmission",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6811478/",
            "Abstract": "The performance of Direct Sequence Code Division Multiple Access (DS-CDMA) based systems highly depends on the interference caused by multiple transmissions. Interference reduction may result by using time scheduling of the transmitting nodes and by allocating accordingly the power level, and the source and channel coding rate for each node. In this work, we study the joint intra-cell scheduling and resource allocation for wireless video transmission in a hybrid DS-CDMA over Time Division Multiple Access (TDMA) network. We examine the case according to which a subset of the network nodes are able to simultaneously transmit (at the same time slot). The key issue is to jointly select the subset of the nodes for transmission per time slot and to allocate the available resources so that a function of the end-to-end video distortion of each node over a time frame is minimized. The experimental results show that …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Satellite handover techniques for LEO networks",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sat.783",
            "Abstract": "Low earth orbit satellite constellations could play an important role in future mobile communication networks due to their characteristics, such as global coverage and low propagation delays. However, because of the non‐stationarity of the satellites, a call may be subjected to handovers, which can be cell or satellite handovers. Quite many techniques have been proposed in the literature dealing with the cell handover issue. In this paper, a satellite handover procedure is proposed, that investigates and exploits the partial satellite diversity (namely, the existing common coverage area between contiguous satellites) in order to provide an efficient handover strategy, based always on a tradeoff of blocking and forced termination probabilities for a fair treatment of new and handover calls. Three different criteria were examined for the selection of a satellite. Each one of them could be applied either to new or handover …",
            "Abstract entirety": 0,
            "Author pub id": "R6Ldg5UAAAAJ:d1gkVwhDpl0C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Speeding-up cache lookups in wireless ad-hoc routing using bloom filters",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1651679/",
            "Abstract": "On demand routing protocols that exploit local caches have received a lot of attention lately in wireless ad-hoc networking. In this paper, we specifically address cache management, an issue that has been a main source of criticism for the applicability of such protocols. In particular, we tackle the problem of accessing the cache content efficiently. To this end, we propose summarizing the cache content so that we achieve efficient lookups. This not only saves both the restrictive resources of the wireless devices such as computational power and energy but also improves the overall protocol performance. We use Bloom filters as summaries. Our experimental results using the ns simulator show that both resource savings and performance improvements are attained when such filters are integrated within the DSR protocol which is one the most widely used instance of an on demand protocol",
            "Abstract entirety": 1,
            "Author pub id": "R6Ldg5UAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        }
    ]
}]