[{
    "name": "Ηλίας Μανωλάκος",
    "romanize name": "Ilias Manolakos",
    "School-Department": "Πληροφορικής & Τηλεπικοινωνιών",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 17276,
    "Scholar name": "Elias S. Manolakos",
    "Scholar id": "fO1mhBoAAAAJ",
    "Affiliation": "National and Kapodistrian University of Athens and Northeastern University",
    "Citedby": 2265,
    "Scholar url": "https://scholar.google.com/citations?user=fO1mhBoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Embedded web server for the AVR butterfly enabling immediate access to wireless sensor node readings",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11870-8_10",
            "Abstract": "The “AVR Butterfly” (BF) is not just a microcontroller, but rather an autonomous embedded system kit including several sensors. Our main objective was first to provide Internet connectivity to the BF and then to evaluate its further capabilities as a sensor network node. To this end, we equipped the BF with a TCP/IP stack and a Zigbee transceiver. As a case study, we constructed a node and a gateway based on the BF and formed a simple wireless sensor network (WSN). In order to enable remote users to access, on demand, sensor node readings through their web browsers, an HTML Server application was developed for the BF-gateway. We demonstrate that despite the scarcity of the available resources, if we enhance the BF with a popular Ethernet chip and the optimal TCP/IP stack for 8-bit microcontrollers, we can obtain a powerful, yet simple and inexpensive, monitoring device with Internet connectivity …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Predictive Tracking of Continuous Object Boundaries Using Sparse Local Estimates",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9171824/",
            "Abstract": "Environmental hazards (wildfires, floods, oil spills) are often modeled as “continuous objects” which evolve in space and time taking irregular shapes. Tracking their boundaries and accurately predicting their spatiotemporal spreading patterns is of paramount importance to combat their often catastrophic consequences. Wireless Sensor Networks (WSN) have been very instrumental for this purpose. However, current WSN-based methods require a prohibitively large density of deployed sensors to achieve a reasonable boundary reconstruction accuracy because they are based on the explicit identification of nodes close to the boundary. We present a novel approach that can track and predict the global boundary using only a relatively small number of distributed local front estimates. Our approach first filters and fuses the available sparse set of local front estimates (e.g. vectors of local orientation, direction and speed …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:URolC5Kub84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrating Java and Matlab components into the same parallel and distributed application using JavaPorts",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1302918/",
            "Abstract": "Summary form only given. As clusters of workstations become increasingly popular the need for component frameworks that facilitate the high level modeling and rapid prototyping of parallel and distributed applications on such systems is becoming pressing. Many scientists and engineers have image and signal processing applications that could benefit from cluster computing. However, these applications often exist as legacy code, such as serial Matlab functions, which are not easily parallelizable. The goal of the JavaPorts project is to provide a framework and a set of tools that make it easy to develop component-based parallel and distributed applications for networks of heterogeneous computing nodes. The latest version of the package supports the integration of Java and Matlab components into the same application and provides a mechanism for incorporating legacy Matlab functions into parallel processing …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instream and offstream environmental conditions and stream biotic integrity: importance of scale and site similarities for learning and prediction",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304380009003901",
            "Abstract": "Two different methods to predict biotic integrity were tested and compared in the present paper. The first one tries to predict the fish indices of biotic integrity (IBI) at the state or regional scale based on the most similar observations to a specific target site of interest using the simple to implement k-nearest neighbors (or kNN) method. Two different distance functions were considered to find the k-nearest neighbors: the Euclidean and the Mahalanobis. The second method was applied on the same datasets and consisted of a step-wise multiple regression. The two modeling approaches yielded similar results but kNN proved to be more time-efficient and very fast computationally for the given dataset sizes, which allowed applying a leave-one-out cross validation.In an attempt to reveal the importance of scale in the prediction of IBI, regression models were constructed at the state (or regional) scale and at the more refined …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "In silico modeling of alpha-synuclein oligomerization effects on neuronal homeostasis",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Eleftherios-Ouzounoglou/publication/235991506_In_silico_Modeling_of_Alpha-synuclein_Oligomerization_Effects_on_Neuronal_Homeostasis_ISCB_Poster/links/00463515473c516084000000/In-silico-Modeling-of-Alpha-synuclein-Oligomerization-Effects-on-Neuronal-Homeostasis-ISCB-Poster.pdf",
            "Abstract": "2. The overexpression of even the Wild Type (WT) of ASYN leads to cell death and accumulation of ASYN oligomers but not fibrilar species [2]. The death is correlated with the disruption of proteolytic machineries, prominently the CMA lysosomal pathway, caused by ASYN and the accumulation of ASYN oligomeric species [3].",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accurate estimation of the signal baseline in DNA chromatograms",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1030015/",
            "Abstract": "Estimating accurately the varying baseline level in different parts of a DNA chromatogram is a challenging and important problem for accurate base-calling. We are formulating the problem in a statistical learning framework and propose an Expectation-Maximization algorithm for its solution. In addition we also present a faster, iterative histogram based method for estimating the background of the signal in small size windows. The two methods can be combined with regression techniques to correct the baseline in all regions of the chromatogram and are shown to work well even in areas of low SNR. By improving the separation of clusters, baseline correction actions reduce the classification errors when using the BEM base-caller developed in our group.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DG2VHDL: A tool to facilitate the high level synthesis of parallel processing array architectures",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1008122812813",
            "Abstract": "We present DG2VHDL, a design tool which can automatically translate abstract algorithmic descriptions, known as Dependence Graphs, to synthesizable VHDL models and testbenches representative of distributed memory and control processor arrays, known as Signal Flow Graphs. This translation facilitates the rapid exploration of the large space of available parallel architectures for a given problem and frees the designer from having to code and test separately, using a Hardware Description Language, every candidate architecture under consideration. It is shown that the quality and scalability of the automatically generated VHDL models is near optimal, in the sense that the time required to synthesize them as well as the area of the resulting hardware grows at the lowest possible rate with the problem size. This makes possible the high level synthesis of processor arrays for large size real world …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:ufrVoPGSRksC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A Novel Microphysiological Colon Platform to Decipher Mechanisms Driving Human Intestinal Permeability",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2352345X21001454",
            "Abstract": "The limited availability of organoid systems that mimic the molecular signatures and architecture of human intestinal epithelium has been an impediment to allowing them to be harnessed for the development of therapeutics as well as physiological insights. We developed a microphysiological Organ-on-Chip (Emulate, Inc, Boston, MA) platform designed to mimic properties of human intestinal epithelium leading to insights into barrier integrity.We combined the human biopsy-derived leucine-rich repeat-containing G-protein–coupled receptor 5–positive organoids and Organ-on-Chip technologies to establish a micro-engineered human Colon Intestine-Chip (Emulate, Inc, Boston, MA). We characterized the proximity of the model to human tissue and organoids maintained in suspension by RNA sequencing analysis, and their differentiation to intestinal epithelial cells on the Colon Intestine …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Learning human reach-to-grasp strategies: Towards EMG-based control of robotic arm-hand systems",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6225047/",
            "Abstract": "Reaching and grasping of objects in an everyday-life environment seems so simple for humans, though so complicated from an engineering point of view. Humans use a variety of strategies for reaching and grasping anything from the simplest to the most complicated objects, achieving high dexterity and efficiency. This seemingly simple process of reach-to-grasp relies on the complex coordination of the musculoskeletal system of the upper limbs. In this paper, we study the muscular co-activation patterns during a variety of reach-to-grasp motions, and we introduce a learning scheme that can discriminate between different strategies. This scheme can then classify reach-to-grasp strategies based on the muscular co-activations. We consider the arm and hand as a whole system, therefore we use surface ElectroMyoGraphic (sEMG) recordings from muscles of both the upper arm and the forearm. The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monitoring individual cell death using time-lapse microscopy: Application to stochastic modeling of microbial inactivation",
            "Publication year": 2016,
            "Publication url": "http://repository.edulll.gr/edulll/bitstream/10795/2617/2/2617_Deliverable%20(%CE%A024_b%20-%CE%9451)%20THALIS%20Biofilm%20MIS-380229%20Aspridou%20etal%20FoodMicro14.pdf",
            "Abstract": "Traditionally, microbial inactivation studies are conducted with large microbial populations, without considering the individual cells. Although recent studies have reported the importance of individual cell variability in microbial growth, very limited information is available regarding individual cell heterogeneity in microbial inactivation. In the present work, single cell inactivation of Salmonella enterica ser. Agona was studied using an inverted confocal laser scanning microscope. Direct monitoring of cell death was achieved with the time-lapse method and the use of Propidium Iodide (PI), a fluorescent nucleic acid dye that is permeant only in cells with damaged membrane thus, enabling the discrimination between dead and alive cells. The cells of the pathogen were surface plated on solid laboratory medium, where micro-colonies were formed, and then covered with the inactivation solution containing PI. A sequence …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient multicriteria protein structure comparison on modern processor architectures",
            "Publication year": 2015,
            "Publication url": "https://www.hindawi.com/journals/bmri/2015/563674/",
            "Abstract": "Fast increasing computational demand for all-to-all protein structures comparison (PSC) is a result of three confounding factors: rapidly expanding structural proteomics databases, high computational complexity of pairwise protein comparison algorithms, and the trend in the domain towards using multiple criteria for protein structures comparison (MCPSC) and combining results. We have developed a software framework that exploits many-core and multicore CPUs to implement efficient parallel MCPSC in modern processors based on three popular PSC methods, namely, TMalign, CE, and USM. We evaluate and compare the performance and efficiency of the two parallel MCPSC implementations using Intel’s experimental many-core Single-Chip Cloud Computer (SCC) as well as Intel’s Core i7 multicore processor. We show that the 48-core SCC is more efficient than the latest generation Core i7, achieving a speedup factor of 42 (efficiency of 0.9), making many-core processors an exciting emerging technology for large-scale structural proteomics. We compare and contrast the performance of the two processors on several datasets and also show that MCPSC outperforms its component methods in grouping related domains, achieving a high -measure of 0.91 on the benchmark CK34 dataset. The software implementation for protein structure comparison using the three methods and combined MCPSC, along with the developed underlying rckskel algorithmic skeletons library, is available via GitHub.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Run-time execution of reconfigurable hardware in a Java environment",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/955055/",
            "Abstract": "We present tools that support the run-time execution of applications that mix software running on networks of workstations and reconfigurable hardware. We use JHDL to describe the reconfigurable hardware, and JavaPorts to handle the communications between nodes in the network. The heterogeneous resources are handled by interposing a communication layer between the application and the hardware. The communication layer provides (i) the ability to modify the target hardware without modifying the application, (ii) co-design of the application and hardware, (iii) simulation of the entire system before the hardware design is complete, and (iv) remote execution so the application can reside on a different host from the hardware. We demonstrate the feasibility of this approach with a Java-based system which has a communication layer called the packet exchange platform (PEP). We present the system, describe …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Collaborative Sensor Network algorithm for predicting the spatiotemporal evolution of hazardous phenomena",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6084201/",
            "Abstract": "We present a novel decentralized Wireless Sensor Network (WSN) algorithm which can estimate both the speed and direction of an evolving diffusive hazardous phenomenon (e.g. a wildfire, oil spill, etc.). In the proposed scheme we approximate a progressing hazard's front as a set of line segments. The spatiotemporal evolution of each line segment is modeled by a modified 2D Gaussian function. As the phenomenon evolves, the parameters of this model are updated based on the analytical solution of a Kullback - Leibler (KL) divergence minimization problem. This leads to an efficient WSN distributed parameters estimation algorithm that can be implemented by dynamically formed clusters (triplets) of collaborating sensor nodes. Computer simulations show that our approach is able to track the evolving phenomenon with reasonable accuracy even if a percentage of sensors fails due to the hazard and/or the …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An embedded dynamically self-reconfigurable master-slaves mpsoc architecture",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4629976/",
            "Abstract": "A dynamically self-reconfigurable master-slaves MPSoC architecture framework is introduced which can be fully embedded into a single FPGA device. The master core can request a configuration manager module to add, or remove, a slave core at runtime. If the request can be satisfied, self-reconfiguration commences, implemented by a pipeline of light-weight specialized blocks. The M-S architecture utilizes a simple and general token-based bus control mechanism that is reconfiguration aware. All system modules have been described in synthesizable VHDL. A first system prototype has been built and validated using the affordable XUP XC2VP30 board. Even when using CRC check of bitstreams dynamic reconfiguration can proceed at the maximum speed that can be supported by the ICAP Xilinx interface. The reconfiguration support logic consumes as little as 1012 slices on the Virtex II Pro FPGA.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special issue on signal processing and neural networks for bioinformatics-Introduction",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=6479702102337969519&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:j8SEvjWlNXcC",
            "Publisher": "KLUWER ACADEMIC PUBL"
        },
        {
            "Title": "Characterization of biological responses under different environmental conditions: A hierarchical modeling approach",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S030438001000548X",
            "Abstract": "A natural river system is organized as a nested hierarchy of interconnected habitats with specific environmental conditions to which the biological community has adapted. Due to this hierarchical structure, identifying the role of different stressors on the biological community is a formidable task. Efforts trying to link stressors to biological integrity have always been bound to the geographic scale of the selected study area, leading to scale-specific results. In this research, an attempt is made to lift this limitation and develop a hierarchical, scale-sensitive methodology that can identify the significant environmental stressors to the biological community at different scales. Sites with similar background environmental conditions are clustered using self-organizing maps (SOM). This is used to identify stressors which affect the biological community throughout the area of study – called environmental gradients or large-scale …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Reconstructing the forest of lineage trees of diverse bacterial communities using bio-inspired image analysis",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8081537/",
            "Abstract": "Cell segmentation and tracking allow us to extract a plethora of cell attributes from bacterial time-lapse cell movies, thus promoting computational modeling and simulation of biological processes down to the single-cell level. However, to analyze successfully complex cell movies, imaging multiple interacting bacterial clones as they grow and merge to generate overcrowded bacterial communities with thousands of cells in the field of view, segmentation results should be near perfect to warrant good tracking results. We introduce here a fully automated closed-loop bio-inspired computational strategy that exploits prior knowledge about the expected structure of a colony's lineage tree to locate and correct segmentation errors in analyzed movie frames. We show that this correction strategy is effective, resulting in improved cell tracking and consequently trustworthy deep colony lineage trees. Our image analysis …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:NJ774b8OgUMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Developing Risk Propagation Model for Estimating Ecological Responses of Streams to Anthropogenic Watershed Stresses and Stream Modifications",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Richard-Shaker/publication/278678617_Developing_Risk_Propagation_Model_for_Estimating_Ecological_Responses_of_Streams_to_Anthropogenic_Watershed_Stresses_and_Stream_Modifications/links/5583249908aefa35fe30b67d/Developing-Risk-Propagation-Model-for-Estimating-Ecological-Responses-of-Streams-to-Anthropogenic-Watershed-Stresses-and-Stream-Modifications.pdf",
            "Abstract": "Date of Report: August 20, 2007 EPA Agreement Number: R83-0885-010 Title: Developing of Risk Propagation Model for Estimating Ecological Responses of Streams to Anthropogenic Watershed Stresses and Stream Modifications",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:_kc_bZDykSQC",
            "Publisher": "Center for Urban Environmental Studies, Northeastern University"
        },
        {
            "Title": "Multi-criteria protein structure comparison and structural similarities analysis using pyMCPSC",
            "Publication year": 2018,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0204587",
            "Abstract": "Protein Structure Comparison (PSC) is a well developed field of computational proteomics with active interest from the research community, since it is widely used in structural biology and drug discovery. With new PSC methods continuously emerging and no clear method of choice, Multi-Criteria Protein Structure Comparison (MCPSC) is commonly employed to combine methods and generate consensus structural similarity scores. We present pyMCPSC, a Python based utility we developed to allow users to perform MCPSC efficiently, by exploiting the parallelism afforded by the multi-core CPUs of today’s desktop computers. We show how pyMCPSC facilitates the analysis of similarities in protein domain datasets and how it can be extended to incorporate new PSC methods as they are becoming available. We exemplify the power of pyMCPSC using a case study based on the Proteus_300 dataset. Results generated using pyMCPSC show that MCPSC scores form a reliable basis for identifying the true classification of a domain, as evidenced both by the ROC analysis as well as the Nearest-Neighbor analysis. Structure similarity based “Phylogenetic Trees” representation generated by pyMCPSC provide insight into functional grouping within the dataset of domains. Furthermore, scatter plots generated by pyMCPSC show the existence of strong correlation between protein domains belonging to SCOP Class C and loose correlation between those of SCOP Class D. Such analyses and corresponding visualizations help users quickly gain insights about their datasets. The source code of pyMCPSC is available under the GPLv3.0 license through a …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:VLnqNzywnoUC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Temperature field modeling and simulation of wireless sensor network behavior during a spreading wildfire",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080326/",
            "Abstract": "We present the development of a simulator that approximates the behaviour of a wireless network of temperature sensors deployed in the area affected by a wildfire. It is based on a novel signal processing approach in which the temperature experienced at a sensor due to a spreading fire front is modelled as the mixture of two-dimensional Gaussian distributions. We present the justification, development and validation of the proposed model. Our work enables the in-silico generation of synthetic, yet realistic, sensor temperature data sets. Due to the lack of real data, such data sets can be useful in deriving optimal sensor network deployment strategies for fire detection and progress monitoring in a specific area, under different scenarios for the expected wind conditions, and for calibrating fire spread prediction models.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Erratum to: An information-theoretic approach for measuring the distance of organ tissue samples using their transcriptomic signatures",
            "Publication year": 2021,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8388017/",
            "Abstract": "Erratum to: An information-theoretic approach for measuring the distance of organ tissue \nsamples using their transcriptomic signatures NCBI NCBI Logo Skip to main content Skip to \nnavigation Resources How To About NCBI Accesskeys Sign in to NCBI PMC US National \nLibrary of Medicine National Institutes of Health Search database Search term Search \nAdvanced Journal list Help Try out PMC Labs and tell us what you think. Learn More. \nJournal List Bioinformatics PMC8388017 Logo of bioinfo Bioinformatics. 2021 Aug 15; 37(16): \n2512. Published online 2021 Aug 11. doi: 10.1093/bioinformatics/btab483 PMCID: \nPMC8388017 PMID: 34378020 Erratum to: An information-theoretic approach for \nmeasuring the distance of organ tissue samples using their transcriptomic signatures \nDimitris V Manatakis, Aaron VanDevender, and Elias S Manolakos Copyright and License \ninformation Disclaimer This corrects the article \"-…",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:hMsQuOkrut0C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Linking indices of biotic integrity to environmental and land use variables: multimetric clustering and predictive models",
            "Publication year": 2009,
            "Publication url": "https://iwaponline.com/wst/article-abstract/59/1/1/15525",
            "Abstract": "Advanced computerized methods and models of retrieving knowledge from large multiparameter data bases were used to analyze data on fish and macroinvertebrate composition (metrics), habitat, land use and water quality. The research focused on the north central and northeastern United States and involved thousands of sites monitored by the state agencies. The techniques and methodologies included supervised and unsupervised Artificial Neural Networks (ANN) modeling, Principal Component Analysis, Canonical Component Analysis (both linear and nonlinear), Multiple Regression Analyses, and analyses of variance by ANOVA. The research resulted in defining a concept of clusters of sites based on their biotic (fish) community composition, identified cluster dominating factors, and developed meaningful models for predicting fish composition based on environmental and in—stream habitat stresses.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IWA Publishing"
        },
        {
            "Title": "Feature extraction for DNA base-calling using NNLS",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1628816/",
            "Abstract": "We present new algorithms that can be used to extract features from a DNA chromatogram prior to base-calling. The algorithms assume that the inter-base distance has already been equalized using methods such as those presented in L. Andrade-Cetto and E. Manolakos (2005). We show first how a good estimate of the peak diffusion (spread) can be calculated from the raw trace and without having to known the underlying base sequence. Using the estimated inter-peak distance and peak spread parameters a non-negative least squares problem can be formulated in order to find the weight factors of the multiple shapes immersed in broad peaks, typically found towards the end of the chromatogram. The two algorithms combined provide peak hypotheses that are tested by the subsequent base decisions and scoring stage of the base-caller using probabilistic methods",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A learning scheme for reach to grasp movements: On EMG-based interfaces using task specific motion decoding models",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6507235/",
            "Abstract": "A learning scheme based on random forests is used to discriminate between different reach to grasp movements in 3-D space, based on the myoelectric activity of human muscles of the upper-arm and the forearm. Task specificity for motion decoding is introduced in two different levels: Subspace to move toward and object to be grasped. The discrimination between the different reach to grasp strategies is accomplished with machine learning techniques for classification. The classification decision is then used in order to trigger an EMG-based task-specific motion decoding model. Task specific models manage to outperform “general” models providing better estimation accuracy. Thus, the proposed scheme takes advantage of a framework incorporating both a classifier and a regressor that cooperate advantageously in order to split the task space. The proposed learning scheme can be easily used to a series of …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimating the spatiotemporal evolution characteristics of diffusive hazards using wireless sensor networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6895267/",
            "Abstract": "There is a fast growing interest in exploiting wireless sensor networks (WSNs) for tracking the boundaries and predicting the evolution properties of diffusive hazardous phenomena (e.g. wildfires, oil slicks etc.) often modeled as “continuous objects”. We present a novel distributed algorithm for estimating and tracking the local evolution characteristics of continuous objects. The hazard's front line is approximated as a set of line segments, and the spatiotemporal evolution of each segment is modeled by a small number of parameters (orientation, direction and speed of motion). As the hazard approaches, these parameters are re-estimated using ad-hoc clusters (triplets) of collaborating sensor nodes. Parameters updating is based on algebraic closed-form expressions resulting from the analytical solution of a Bayesian estimation problem. Therefore, it can be implemented by microprocessors of the WSN nodes, while …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Heterogeneity of single cell inactivation: Assessment of the individual cell time to death and implications in population behavior",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0740002018307421",
            "Abstract": "A direct microscopic time-lapse method, using appropriate staining for cell viability in a confocal scanning laser microscope, was used for the direct assessment of Salmonella Agona individual cell inactivation in small two-dimensional colonies exposed to osmotic stress. Individual cell inactivation times were fitted to a variety of continuous distributions using @Risk software. The best fitted distribution (LogLogistic) was further used to predict the inactivation of Salmonella populations of various initial levels using Monte Carlo simulation. The simulation results showed that the variability in inactivation kinetics is negligible for concentrations down to 100 cells and the population behavior can be described with a deterministic model. As the concentration decreases below 100 cells, however, the variability increases significantly indicating that the traditional D-value used in deterministic first order kinetic models is not …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Signal background estimation and baseline correction algorithms for accurate DNA sequencing",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/B:VLSI.0000003022.86639.1f",
            "Abstract": "Accurate identification of a DNA sequence depends on the ability to precisely track the time varying signal baseline in all parts of the electrophoretic trace. We propose a statistical learning formulation of the signal background estimation problem that can be solved using an Expectation-Maximization type algorithm. We also present an alternative method for estimating the background level of a signal in small size windows based on a recursive histogram computation. Both background estimation algorithms introduced here can be combined with regression methods in order to track slow and fast baseline changes occurring in different regions of a DNA chromatogram. Accurate baseline tracking improves cluster separation and thus contributes to the reduction in classification errors when the Bayesian EM (BEM) base-calling system, developed in our group (Pereira et al., Discrete Applied Mathematics, 2000 …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Sensor and Computing Infrastructure for Environmental Risks: The SCIER System",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/advanced-icts-disaster-management-threat/44855",
            "Abstract": "The SCIER platform is an integrated system of networked sensors and distributed computing facilities, aiming to detect and monitor a hazard, predict its evolution and assist the authorities in crisis management for hazards occurring at Wildlife Urban Interface (WUI) areas. The goal of SCIER is to make the vulnerable WUI zone safer for the citizens and protect their lives and property from environmental risks. To achieve its objective, SCIER integrates technologies such as:(1) wireless sensor networks for the detection and monitoring of disastrous natural hazards,(2) advanced sensor data fusion and management for accurately monitoring the dynamics of multiple interrelated risks,(3) environmental risk models for simulating and predicting the evolution of hazardous phenomena using Grid-computing. In this chapter we present the key software components of the SCIER system architecture, namely the sensor data …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:maZDTaKrznsC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "PeerAssist: A p2p platform supporting virtual communities to assist independent living of senior citizens",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35395-6_4",
            "Abstract": "This paper describes the system architecture and status of PeerAssist, an Ambient Assisted Living (AAL) project that aims at designing, implementing, and demonstrating a flexible Peer-to Peer (P2P) platform, which will allow elderly people (not necessarily familiar with information technology) to build virtual communities dynamically based on interests and needs they share. The PeerAssist technology platform will facilitate establishing on demand ad-hoc communities with friends, family, neighbors, caregivers, etc. The community building and P2P interaction is achieved using information extracted from peer roles and profiles, context that describes the overall user environment, and the specific request initiated or service provided by a peer, all of which are represented semantically in a machine understandable form. An end-user request (query) is first represented semantically and then routed through the …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "IP-cores design for the kNN classifier",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5537602/",
            "Abstract": "We present the systematic design of two linear array IP cores for the k-nearest neighbor (k-NN) benchmark classifier. The need for real-time classification of data vectors with possibly thousands of features (dimensions) motivates the implementation of this widely used algorithm in hardware in order to achieve very high performance by exploiting block pipelining and parallel processing. The two linear array architectures that we designed have been described as soft IP cores in fully parameterizable VHDL that can be used to synthesize effortlessly different k-NN parallel architectures for any desirable combination of the problem size parameters. They have been evaluated for a large variety of parameter combinations and Xilinx FPGAs. It is shown that they can be used to solve efficiently very large size k-NN classification problems, even with thousands of training vectors or vector dimensions, using a single, moderate …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Systematic synthesis of parallel architectures for the computation of higher order cumulants",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167819199001258",
            "Abstract": "Fine granularity parallel architectures for the efficient estimation of higher order statistics (HOS) are systematically derived in this paper. A unified methodology for constructing locally recursive algorithms and space–time linear mapping operators that lead to highly pipelined architectures consisting of multiple, tightly coupled array stages is discussed first. Then a farm of processors is synthesized that consumes second and fourth order moment estimates to produce the fourth order cumulants. The unified array synthesis methodology allows for the characterization of all valid solutions and the derivation of closed-form expressions for the permissible linear scheduling functions thus facilitating the search for a design instance meeting the architect's specified objectives. Achieving minimum latency and an optimal space–time matching between the farm and the moments generator architecture (derived in [E.S. Manolakos …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Improving 2‐DE gel image denoising using contourlets",
            "Publication year": 2009,
            "Publication url": "https://analyticalsciencejournals.onlinelibrary.wiley.com/doi/abs/10.1002/pmic.200701027",
            "Abstract": "One of the most commonly used methods for protein separation is 2‐DE. After 2‐DE gel scanning, images with a plethora of spot features emerge that are usually contaminated by inherent noise. The objective of the denoising process is to remove noise to the extent that the true spots are recovered correctly and accurately i.e. without introducing distortions leading to the detection of false‐spot features. In this paper we propose and justify the use of the contourlet transform as a tool for 2‐DE gel images denoising. We compare its effectiveness with state‐of‐the‐art methods such as wavelets‐based multiresolution image analysis and spatial filtering. We show that contourlets not only achieve better average S/N performance than wavelets and spatial filters, but also preserve better spot boundaries and faint spots and alter less the intensities of informative spot features, leading to more accurate spot volume estimation …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:0EnyYjriUFMC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Many-core CPUs can deliver scalable performance to stochastic simulations of large-scale biochemical reaction networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7237084/",
            "Abstract": "Stochastic simulation of large-scale biochemical reaction networks is becoming essential for Systems Biology. It enables the in-silico investigation of complex biological system dynamics under different conditions and intervention strategies, while also taking into account the inherent “biological noise” especially present in the low species count regime. It is however a great computational challenge since in practice we need to execute many repetitions of a complex simulation model to assess the average and extreme cases behavior of the dynamical system it represents. The problem's work scales quickly, with the number of repetitions required and the number of reactions in the bio-model. The worst case scenario s when there is a need to run thousands of repetitions of a complex model with thousands of reactions. We have developed a stochastic simulation software framework for many- and multi-core CPUs. It is …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable FRM-SSA SoC design for the simulation of networks with thousands of biochemical reactions in real time",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6044863/",
            "Abstract": "Simulation of biomolecular networks with thousands of reactions is becoming essential for systems biology. We are presenting the design of a scalable System on Chip parallel architecture that implements Gillespie's First Reaction Method in reconfigurable FPGA hardware. Our SoC architecture can deliver performance (Mega-Reactions/sec) and throughput (M-Reaction cycles/sec) that is increasing linearly with the number of processors when simulating large biomolecular networks with up to m = 4096 reactions using a moderate size FPGA. We have synthesized and verified various SoC instances with up to N=8 Processing Elements for Xilinx Virtex 5 and Altera Cyclone III FPGAs, reaching clock frequencies up to 180 MHz and delivering simulation performance that is more than 2 order of magnitude higher than that of Intel Core 2 and i7 CPUs running at frequencies above 2GHz.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Machine learning methods to reverse engineer dynamic gene regulatory networks governing cell state transitions",
            "Publication year": 2018,
            "Publication url": "https://www.biorxiv.org/content/10.1101/264671v1.abstract",
            "Abstract": "Deciphering the dynamic gene regulatory mechanisms driving cells to make fate decisions remains elusive. We present a novel unsupervised machine learning methodology that can be used to analyze a dataset of heterogeneous single-cell gene expressions profiles, determine the most probable number of states (major cellular phenotypes) represented and extract the corresponding cell sub-populations. Most importantly, for any transition of interest from a source to a destination state, our methodology can zoom in, identify the cells most specific for studying the dynamics of this transition, order them along a trajectory of biological progression in posterior probabilities space, determine the \"key-player\" genes governing the transition dynamics, partition the trajectory into consecutive phases (transition \"micro-states\"), and finally reconstruct causal gene regulatory networks for each phase. Application of the end-to-end methodology provides new insights on key-player genes and their dynamic interactions during the important HSC-to-LMPP cell state transition involved in hematopoiesis. Moreover, it allows us to reconstruct a probabilistic representation of the “epigenetic landscape” of transitions and identify correctly the major ones in the hematopoiesis hierarchy of states.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "Ecological Clustering of Integrity and Nonlinear Impact of Environmental Variables on Cyanobacteria",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Elias-Manolakos/publication/268274158_Ecological_Clustering_of_Integrity_and_Nonlinear_Impact_of_Environmental_Variables_on_Cyanobacteria/links/54bd34280cf27c8f2814b251/Ecological-Clustering-of-Integrity-and-Nonlinear-Impact-of-Environmental-Variables-on-Cyanobacteria.pdf",
            "Abstract": "Ecological Clustering of Integrity and Nonlinear Impact of Environmental Variables on \nCyanobacteria Page 1 Northeastern University Center for Urban Environmental Studies \nPresentations Center for Urban Environmental Studies August 01, 2006 Ecological Clustering of \nIntegrity and Nonlinear Impact of Environmental Variables on Cyanobacteria Vladimir Novotny \nNortheastern University Elias Manolakos Northeastern University Ferdi Hellweger Northeastern \nUniversity This work is available open access, hosted by Northeastern University. Recommended \nCitation Novotny, Vladimir; Manolakos, Elias; and Hellweger, Ferdi, \"Ecological Clustering of \nIntegrity and Nonlinear Impact of Environmental Variables on Cyanobacteria\" (2006). Center \nfor Urban Environmental Studies Presentations. Paper 1. Page 2 Ecological Clustering of \nIntegrity and Nonlinear Impact of Environmental Variables on Cyanobacteria Vladimir , at i…",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:u_35RYKgDlwC",
            "Publisher": "Northeastern University"
        },
        {
            "Title": "Analytics and visualization tools to characterize single-cell stochasticity using bacterial single-cell movie cytometry data",
            "Publication year": 2021,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/s12859-021-04409-9",
            "Abstract": "Time-lapse microscopy live-cell imaging is essential for studying the evolution of bacterial communities at single-cell resolution. It allows capturing detailed information about the morphology, gene expression, and spatial characteristics of individual cells at every time instance of the imaging experiment. The image analysis of bacterial \"single-cell movies\" (videos) generates big data in the form of multidimensional time series of measured bacterial attributes. If properly analyzed, these datasets can help us decipher the bacterial communities' growth dynamics and identify the sources and potential functional role of intra- and inter-subpopulation heterogeneity. Recent research has highlighted the importance of investigating the role of biological \"noise\" in gene regulation, cell growth, cell division, etc. Single-cell analytics of complex single-cell movie datasets, capturing the interaction of multiple micro-colonies with thousands of cells, can shed light on essential phenomena for human health, such as the competition of pathogens and benign microbiome cells, the emergence of dormant cells (“persisters”), the formation of biofilms under different stress conditions, etc. However, highly accurate and automated bacterial bioimage analysis and single-cell analytics methods remain elusive, even though they are required before we can routinely exploit the plethora of data that single-cell movies generate. We present visualization and single-cell analytics using R (ViSCAR), a set of methods and corresponding functions, to visually explore and correlate single-cell attributes generated from the image processing of complex bacterial single-cell movies. They can …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:KUbvn5osdkgC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "An analytical solution to the mobility shifts corrections problem for DNA chromatograms",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.13.1316",
            "Abstract": "Mobility shifts introduce considerable variability in the expected distance between consecutive peaks in DNA chromatograms and can severely affect base-calling accuracy. Compensating for mobility shifts is formulated here as an optimization problem. We seek to maximize the uniformity of inter-base distances by minimizing their variance. The problem can be solved analytically, in contrast to other methods which rely on computationally expensive exhaustive search. By applying the proposed method to consecutive data windows we show that it is possible to correct base order reversals. 1.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ProtCV: A Tool for Extracting, Visualizing and Validating Protein Clusters Using Mass Spectra Peak-Lists",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4561991/",
            "Abstract": "We present ProtCV (protein clustering and visualization) a new software tool for grouping samples (mass spectra peak-lists) emanating from a high throughput proteomics analysis based on their spectral similarities, and summarizing effectively for the user the clustering results using advanced visualization methods. A unique feature of ProtCV is that it can compare clustering methods applied to the same data set based on several validity in dices to assist the user identify groupings that seem to capture best the underlying structure of the data set. Moreover, ProtCV can assist in formulating hypotheses about the potential role of unidentified proteins in a cluster, identify sets of proteins which act jointly at a specific biological state etc. All these data set mining and exploration operations are very useful for interpreting the results of high throughput MS based proteomics analyses that are commonly used for biomarkers …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Prediction of biological integrity based on environmental similarity-Revealing the scale-dependant link between study area and top environmental predictors",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0043135411000224",
            "Abstract": "Indices of Biological integrity (IBI) are considered valid indicators of the overall health of a water body because the biological community is an endpoint within natural systems. However, prediction of biological integrity using information from multi-parameter environmental observations is a challenging problem due to the hierarchical organization of the natural environment, the existence of nonlinear inter-dependencies among variables as well as natural stochasticity and measurement noise. We present a method for predicting the Fish Index of Biological Integrity (IBI) using multiple environmental observations at the state-scale in Ohio. Instream (chemical and physical quality) and offstream parameters (regional and local upstream land uses, stream fragmentation, and point source density and intensity) are used for this purpose. The IBI predictions are obtained using the environmental site-similarity concept and …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Image Analysis on Bacteria Time-Lapse Movies",
            "Publication year": 2016,
            "Publication url": "https://repository-edulll.ekt.gr/edulll/handle/10795/2614",
            "Abstract": "This study has been developed a methodology for identifying accurately the boundaries of individual bacterial cells and tracking them from frame to frame so as to construct the cells’ genealogy (bacterial cell segmentation and lineage tree construction) even in large-size microbial communities where there is great difficulty in identifying the individual cell boundaries.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Runtime QoS service for application-driven adaptation in network computing",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1907.12986",
            "Abstract": "A distributed application executing on a Network of Workstations (NOW) needs to be resource state aware to possibly adapt itself accordingly in order to keep satisfying the desired Quality of Service (QoS) demands throughout its lifespan. We implemented a QoS service to enable application-driven adaptation for performance and fault tolerance at runtime. The service is associated with lightweight middleware that monitors the state and load of all application entities (e.g., machines, tasks, and logical network links). Moreover, it makes its services available to an application task via an anonymous and simple to use QoS API. We present a Manager-Worker application that uses our fault tolerance QoS API to adapt for Worker faults in order to avoid application deadlock at runtime. Moreover, we show how a dynamic application-level scheduler can easily utilize the QoS API to find efficient schedules. Furthermore, we quantified the overhead of the QoS middleware in various scenarios to demonstrate that it has minor impact on the performance of the application it is servicing.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "StochSoCs: High performance biocomputing simulations for large scale Systems Biology",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8035187/",
            "Abstract": "The stochastic simulation of large-scale biochemical reaction networks is of great importance for systems biology since it enables the study of inherently stochastic biological mechanisms at the whole cell scale. Stochastic Simulation Algorithms (SSA) allow us to simulate the dynamic behavior of complex kinetic models, but their high computational cost makes them very slow for many realistic size problems. We present a pilot service, named WebStoch, developed in the context of our StochSoCs research project, allowing life scientists with no high-performance computing expertise to perform over the internet stochastic simulations of large-scale biological network models described in the SBML standard format. Biomodels submitted to the service are parsed automatically and then placed for parallel execution on distributed worker nodes. The workers are implemented using multi-core and many-core processors, or …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:7T2F9Uy0os0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Neural Networks and Applications to Communications",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/0471219282.eot355",
            "Abstract": "Neural Networks are highly interconnected distributed information processing architectures that are built by connecting together many simple processing elements. They come in many different flavors but all share the ability to learn i.e. to adapt their structure to capture the process that generates information in their environment, and utilize the internally formed representation of that process to predict, or generalize, when presented with unseen novel patterns. In this article we first introduce the basics of neural networks by describing the structure of commonly used neuron processors, some popular network architectures and learning rules. Then we explain why neural network methods have been utilized so extensively in the field of communications by presenting typical snapshots of their use in a representative subset of communication applications. Our intention is to introduce the interested non‐expert reader to …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:08ZZubdj9fEC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Python to accelerate embedded SoC design: a case study for systems biology",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2560032",
            "Abstract": "We present SysPy (System Python) a tool which exploits the strengths of the popular Python scripting language to boost design productivity of embedded System on Chips for FPGAs. SysPy acts as a “glue” software between mature HDLs, ready-to-use VHDL components and programmable processor soft IP cores. SysPy can be used to: (i) automatically translate hardware components described in Python into synthesizable VHDL, (ii) capture top-level structural descriptions of processor-centric SoCs in Python, (iii) implement all the steps necessary to compile the user's C code for an instruction set processor core and generate processor specific Tcl scripts that import to the design project all the necessary HDL files of the processor's description and instantiate/connect the core to other blocks in a synthesizable top-level Python description. Moreover, we have developed a Hardware Abstraction Layer (HAL) in Python …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "ACM"
        },
        {
            "Title": "Component-based peer-to-peer distributed processing in heterogeneous networks using JavaPorts",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/962538/",
            "Abstract": "One of the main advantages of the Java programming language is that the source code can be executed in any type of machine or embedded system that implements a Java Virtual Machine (JVM). The JavaPorts (JP)framework adds another level of portability by extending this capability to multi-threaded distributed applications consisting of many concurrent and interacting components. In this paper we primarily, discuss the aspects of the JavaPorts framework that pertain to the generation and reuse of components. We discuss how a distributed JP application is defined, using a Task Graph abstraction, and then captured and represented internally as an AMTP tree data structure. We present a suite of tools designed to help in simplifying the application development process. We explain how the JP graphical user interface can be used to assemble distributed applications by combining new and existing reusable …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Modular VLSI Architecture for the Real-Time Estimation of Higher Order Moments and Cumulants",
            "Publication year": 2005,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420028683-19/modular-vlsi-architecture-real-time-estimation-higher-order-moments-cumulants-elias-manolakos",
            "Abstract": "Higher order statistics (HOS), such as the higher order moments (HOM) and cumulants, have been recognized as important tools in modern signal processing and data analysis, because they overcome well-known limitations of the autocorrelation/power spectrum based second-order methods. We present here the systematic synthesis of a modular VLSI processor array architecture that can compute in real-time HOM and cumulants up to any specified maximal order. We describe first the steps of a novel design methodology that can be followed to explore the large space of available solutions to identify and characterize those architectures that meet certain designer-imposed constraints. Then we use it to (i) systematically formulate locally recursive algorithms (LRA) and linear space–time operators that can transform them into planar parallel array architectures with optimal characteristics for the real-time estimation …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Chapman and Hall/CRC"
        },
        {
            "Title": "Parallel architectures for the kNN classifier--design of soft IP cores and FPGA implementations",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2514641.2514649",
            "Abstract": "We designed a variety of k-nearest-neighbor parallel architectures for FPGAs in the form of parameterizable soft IP cores. We show that they can be used to solve large classification problems with thousands of training vectors, or thousands of vector dimensions using a single FPGA, and achieve very high throughput. They can be used to flexibly synthesize architectures that also cover: 1NN classification (vector quantization), multishot queries (with different k), LOOCV cross-validation, and compare favorably to GPU implementations. To the best of our knowledge this is the first attempt to design flexible IP cores for the popular kNN classifier.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "ACM"
        },
        {
            "Title": "Modeling Alpha-Synuclein Pathology in a Human Brain-Chip to Assess Blood-Brain Barrier Disruption in Parkinson’s Disease",
            "Publication year": 2020,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2020.07.22.207340v3.abstract",
            "Abstract": "Parkinson9s disease and related synucleinopathies are characterized by the abnormal accumulation of alpha-synuclein aggregates, loss of dopaminergic neurons, and gliosis in the substantia nigra. Although clinical evidence and in vitro studies indicate disruption of the Blood-Brain Barrier in Parkinson9s disease, the mechanisms mediating the endothelial dysfunction remain elusive. Lack of relevant models able to recapitulate the order of events driving the development of the disease in humans has been a significant bottleneck in the identification of specific successful druggable targets. Here we leveraged the Organs-on-Chips technology to engineer a human Brain-Chip representative of the substantia nigra area of the brain containing dopaminergic neurons, astrocytes, microglia, pericytes, and microvascular brain endothelial cells, cultured under fluid flow. Our αSyn fibril-induced model was capable of reproducing several key aspects of Parkinson9s disease, including accumulation of phosphorylated αSyn (pSer129-αSyn), mitochondrial impairment, neuroinflammation, and compromised barrier function. This model is poised to enable research into the dynamics of cell-cell interactions in human synucleinopathies and to serve as testing platform for novel therapeutic interventions, including target identification and target validation.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:uWiczbcajpAC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "A P2P SOA enabling group collaboration through service composition",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1387269.1387289",
            "Abstract": "The Service-Oriented Architecture (SOA) paradigm was introduced for exposing business processes as services and enabling their interaction and composition over the Internet. The same computing model can potentially be extended to services of personal devices. As personal devices become network-aware their services can be made available (by their owners) to members of trusted peer groups, thus allowing them to compose new distributed collaborative applications. However, dealing with firewall traversals, NATs, mobility and issues of service-level naming and addressing stand in the way of this vision. In this paper we introduce a P2P SOA middleware architecture that addresses such problems of pervasive connectivity without requiring any intermediaries or changes to the service implementations. We present the basic elements of the architecture and the design of a specific instance of it, which enables …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance engineering of coarse grain network computing applications based on task level behavioral modeling",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Feras-Al-Hawari/publication/268404619_Performance_engineering_of_coarse_grain_network_computing_applications_based_on_task_level_behavioral_modeling/links/6078aaad8ea909241e020dd1/Performance-engineering-of-coarse-grain-network-computing-applications-based-on-task-level-behavioral-modeling.pdf",
            "Abstract": "We developed an interactive framework that automates the mapping of application tasks to Net-works of Workstations (NOWs) and facilitates application adaptation at runtime. Part of this framework is a new tool used to construct graphically behavioral models for the application tasks and connect them structurally to build complete, two-level, hierarchical network computing application models. These models can be used for performance engineering and rapid prototyping of network computing applications before any code is developed. We also introduce a performance estimation scheme that uses hierarchical application models and static/dynamic resource state related data to predict accurately the expected total running time of a given distributed and multi-tasked application configuration. We conducted several experiments that demonstrate the accuracy of the obtained performance predictions in different kinds of scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:EYYDruWGBe4C",
            "Publisher": "Technical Report, ECE Department, Northeastern University"
        },
        {
            "Title": "Automatic estimation of mobility shift coefficients in DNA chromatograms",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1318007/",
            "Abstract": "A physical understanding of mobility pattern differences among DNA fragments of different length drives the formulation of a complete statistical model for mobility shifts correction (MSC). Algorithms are then developed that compute mobility shifts and correct the raw trace, leaving significant peaks aligned i.e. in correct order and centered with respect to their neighbors. The fully automated MSC method we develop is shown to improve substantially base-calling performance in the first 100-200 bp of DNA sequencing reads while it does not require any dye chemistry specific calibration procedure. This is very encouraging since it is known that lack of adequate MSC is the main source of base-calling errors in the early part of a DNA sequencing read.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SysPy: using Python for processor-centric SoC design",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5724624/",
            "Abstract": "Although software engineers have high performance algorithms that could be implemented power-efficiently as embedded Systems on Chip (SoC) with modern FPGAs, there is still no easy path for them to a hardware realization, mainly due to the lack of appropriate design tools. We present an overview of a tool we have developed to boost the productivity of processor-centric SoC designs for FPGAs. Our tool called SysPy (System Python) exploits the strengths of the popular Python scripting language and acts as a “glue software” between mature HDLs, ready-to-use VHDL components and programmable processor soft IP cores. SysPy can be used to: (i) describe hardware components in Python that the tool will automatically translate to correct high quality VHDL, (ii) build top-level structural descriptions of SoCs based on components that are defined in Python, VHDL or pre-synthesized netlist files, (iii) implement …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traceability from “farm to fork” using RFID technology",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5724672/",
            "Abstract": "Rapid increasing breeds of livestock and growing automation of the livestock industry has brought a pressing need for more reliable identification of livestock. Electronic animal identification is now fast becoming more and more important in the new economic global environment to control livestock on the outbreak and eradication of diseases, limiting economic losses and control of residues in slaughtered animals. Animal diseases, outbreak of “Mad Cow scare”, “Nipah virus”, “Birds flu”, etc. have greatly intensified the evaluation of the various electronic RFID systems for an effective lifetime identification of livestock for food safety, health, breeding and diseases control and management. Legislation and regulations all over the world require only minimal information to be kept for traceability and each nation has its own traceability system which is incompatible with the others. In this paper we focus on the design and …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:dQ2og3OwTAUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Visualizing meta-features in proteomic maps",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2105-12-308",
            "Abstract": "The steps of a high-throughput proteomics experiment include the separation, differential expression and mass spectrometry-based identification of proteins. However, the last and more challenging step is inferring the biological role of the identified proteins through their association with interaction networks, biological pathways, analysis of the effect of post-translational modifications, and other protein-related information. In this paper, we present an integrative visualization methodology that allows combining experimentally produced proteomic features with protein meta-features, typically coming from meta-analysis tools and databases, in synthetic Proteomic Feature Maps. Using three proteomics analysis scenarios, we show that the proposed visualization approach is effective in filtering, navigating and interacting with the proteomics data in order to address visually challenging biological questions. The novelty of …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:BqipwSGYUEgC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "A soft IP core generating SoCs for the efficient stochastic simulation of large Biomolecular Networks using FPGAs",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6463795/",
            "Abstract": "A soft IP core, expressed in parametric VHDL, has been developed and used to synthesize different multiprocessor Systems on Chip (SoCs) for the stochastic simulation of large-size biochemical reaction networks based on Gillespie's First Reaction Method (FRM). The SoCs can be configured to have up to N=8 Processing Elements and simulate efficiently in hardware biomolecular networks with up to m=16K reactions. The FPGA implementations of the SoCs are communicating with a host PC via the serial and Ethernet ports for control and data transmission respectively. When mapped to a Virtex-5 Xilinx FPGA the FRM SoCs can deliver simulation performance (in Mega-Reactions/sec) that may exceed by up to two orders of magnitude the performance of well known software simulators running on fast PCs.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Minimal complexity hierarchical loop representations of SFG processors for optimal high level synthesis",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/862381/",
            "Abstract": "In order to rapidly produce, using high level synthesis, quality silicon implementations of Signal Flow Graphs (SFGs) for large size, real-world signal/image processing problems, the Hardware Description Language (HDL) representations of SFG nodes should possess certain desirable characteristics. We have embedded in DG2VHDL, a design tool developed by the authors which translates automatically an algorithm's Dependence Graph into synthesizable VHDL models for SFG arrays, an algorithm that formulates the minimal design complexity nested loop structure (to be defined herein) for each SFG processor. This representation will, in all but some pathological cases, produce post-synthesis hardware whose area scales near optimally with increasing problem size. Furthermore, the time and memory required for the synthesis of such models does not increase with the problem size. A polynomial time heuristic …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Self Organizing Feature Maps Combined with Ecological Ordination Techniques for Effective Watershed Management",
            "Publication year": 2005,
            "Publication url": "https://repository.library.northeastern.edu/files/neu:329758/fulltext.pdf",
            "Abstract": "In recent years there has been an increasing recognition for the application of integrated watershed management to the management of land and water resources, aimed at minimizing degradation and maintaining the overall quality of the surrounding environment. An efficient data summarization and visualization tool, besides aiding the watershed manager in formulating vital decisions, also helps to communicate and disseminate to a wider audience the physical conditions and possible approaches for watershed restoration. The aim of this work is to provide such an efficient data analysis and visualization tool in order to help understanding the effects of anthropogenic stress on the fish population through the fish Index of Biotic Integrity (IBI). Kohonen’s Self Organizing Map (SOM), an unsupervised neural network, is employed to pattern the sampling sites based on similar fish metrics (attributes of the fish IBI) characteristics. The clustering of the SOM neurons allows us to summarize the conclusions obtained in the analysis at the state level. Different visualizations are realized to explore the interrelationships between the environmental variables, the fish metrics and the fish IBI. Finally, Correspondence Analysis and Canonical Correspondence Analysis help us in drawing conclusions about specific fish species and the role of the environmental variables in maintaining the perfect abode for fishes.The methodology was applied to two large size datasets from Maryland and Ohio comprising of variables related to water chemistry, physical habitat and land uses, in addition to the biological data. Visualizing the fish IBI on the SOM clearly separated the …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Center for Urban Environmental Studies, Northeastern University"
        },
        {
            "Title": "Wireless sensor network application for fire hazard detection and monitoring",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11870-8_1",
            "Abstract": "Hazard detection systems are sophisticated tools that can help us detect and prevent environmental disasters. The role of a well designed environmental hazard detection system based on a Wireless Sensor Network (WSN) is to continuously monitor and report the environment’s status by sampling relevant physical parameters (e.g. temperature), but at a rate that can be adapted dynamically to the criticality of the current situation, so that precious energy is conserved as much as possible and communication bandwidth is not wasted, both preconditions that need to be met for a scalable WSN application. We have designed and built a small-scale prototype of such a WSN system for fire detection and monitoring based on inexpensive in-house developed wireless sensor nodes. These nodes combine an AVR Butterfly microcontroller demonstration kit with an Xbee wireless Zigbee transceiver. The emphasis of …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "VIP: Visualization of integrated proteomics data",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4696670/",
            "Abstract": "The post-genomic era is characterized by the rapid data accumulation leading to unwieldy and large volumes of biological data. The proteomics results (large sets of identified proteins or peptides) that originate from several workflow steps, play an important role in the analysis of a proteomics experiment. As a result, the area of high-through-put proteomics created new visualization challenges in interpreting large-scale datasets. We present VIP, an interactive visualization tool for proteomics data, which integrates protein or peptide features emanating at every step of the proteomics analysis and combines them visually in synthetic maps. Our novel tool offers the flexibility to choose any desired features according to the analysis objectives, examine simultaneously more than one maps and interact with the visualization by querying and filtering the results. The synthetic maps visualization aims not only at summarizing …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable FPGA accelerator of the NRM algorithm for efficient stochastic simulation of large-scale biochemical reaction networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7302331/",
            "Abstract": "Stochastic simulation of large-scale biochemical reaction networks, with thousands of reactions, is important for systems biology and medicine since it will enable the insilico experimentation with genome-scale reconstructed networks. FPGA based stochastic simulation accelerators can exploit parallelism, but have been limited on the size of biomodels they can handle. We present a high performance scalable System on Chip architecture for implementing Gibson and Bruck's Next Reaction Method efficiently in reconfigurable hardware. Our MPSoC uses aggressive pipelining at the core level and also combines many cores into a Network on Chip to also execute in parallel stochastic repetitions of complex biomodels, each one with up to 4K reactions. The performance of our NRM core depends only on the average outdegree of the biomodel's Dependencies Graph (DG) and not on the number of DG nodes (reactions …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bacterial Image Analysis and Single-Cell Analytics to Decipher the Behavior of Large Microbial Communities",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8451137/",
            "Abstract": "Time-lapse microscopy provides 4D imaging data for monitoring and studying down to single-cell, the stochastic processes involved as bacterial colonies grow and interact under different stress conditions. Two main factors prevent high throughput analysis: a) cell segmentation and tracking are very time-consuming and error-prone and b) analytics tools are lacking to interpret the plethora of features extracted from a complex “cell-movie.” To address both limitations, we have recently developed a multi-resolution Bio-image Analysis & Single-Cell Analytics framework, called BaSCA. Our end-to-end pipeline segments accurately single-cells and tracks them across frames, identifying cell divisions and constructing each cell colony's lineage and division tree. Here we present the capabilities of an R- package, which enables users to correlate and visually explore the spatiotemporal trends of single-cell attributes …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed Matlab based signal and image processing using JavaPorts",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1327086/",
            "Abstract": "Many scientists and engineers have signal and image processing applications that involve large data sets and could benefit from parallel processing on readily-available clusters of workstations (COWs). Unfortunately these applications often exist as legacy code, such as Matlab functions, which are not easily parallelizable. The goal of the JavaPorts project is to provide a framework for flexible development of parallel and distributed component-based applications for heterogeneous COWs. The latest version of the package supports the integration of Java and Matlab components into the same application. The main features of the JavaPorts framework and its tools are discussed and application examples are presented which highlight its ability to support the rapid prototyping of parallel and distributed computing strategies with communicating Java and Matlab components.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Clustering methods for accurate DNA base-calling",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1197197/",
            "Abstract": "Routinely extending the useful read-lengths of DNA chromatograms beyond 1 kps by employing intelligent base-calling algorithms will be extremely useful to genomics research because in many cases the entire coding region of a gene could fit into a single long read. By segmenting the chromatograms into base-call \"events\" to be labeled in terms of the number of bases they represent, base-calling as a pattern classification problem is formulated. An overview of two unsupervised clustering methods that could be used for its solution is presented.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An information-theoretic approach for measuring the distance of organ tissue samples using their transcriptomic signatures",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/36/21/5194/5873594",
            "Abstract": "Recapitulating aspects of human organ functions using in vitro (e.g. plates, transwells, etc.), in vivo (e.g. mouse, rat, etc.), or ex vivo (e.g. organ chips, 3D systems, etc.) organ models is of paramount importance for drug discovery and precision medicine. It will allow us to identify potential side effects and test the effectiveness of new therapeutic approaches early in their design phase, and will inform the development of better disease models. Developing mathematical methods to reliably compare the ‘distance/similarity’ of organ models from/to the real human organ they represent is an understudied problem with important applications in biomedicine and tissue engineering.We introduce the Transcriptomic Signature Distance (TSD), an information-theoretic distance for assessing the transcriptomic similarity of two tissue samples, or two groups of tissue samples …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Simulation-driven emulation of collaborative algorithms to assess their requirements for a large-scale WSN implementation",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6855232/",
            "Abstract": "Assessing how the performance of a decentralized wireless sensor network (WSN) algorithm's implementation scales, in terms of communication and energy costs, as the network size increases is an essential requirement before its field deployment. Simulations are commonly used for this purpose, especially for large-scale environmental monitoring applications. However, it is difficult to evaluate energy consumption, processing and memory requirements before the algorithm is really ported to a real WSN platform. We propose a method for emulating the operation of collaborative algorithms in large-scale WSNs by re-using a small number of available real sensor nodes. We demonstrate the potential of the proposed simulation-driven WSN emulation approach by using it to estimate how communication and energy costs scale with the network's size when implementing a collaborative algorithm we developed in [12 …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling alpha-synuclein pathology in a human brain-chip to assess blood-brain barrier disruption",
            "Publication year": 2021,
            "Publication url": "https://www.nature.com/articles/s41467-021-26066-5",
            "Abstract": "Parkinson’s disease and related synucleinopathies are characterized by the abnormal accumulation of alpha-synuclein aggregates, loss of dopaminergic neurons, and gliosis of the substantia nigra. Although clinical evidence and in vitro studies indicate disruption of the Blood-Brain Barrier in Parkinson’s disease, the mechanisms mediating the endothelial dysfunction is not well understood. Here we leveraged the Organs-on-Chips technology to develop a human Brain-Chip representative of the substantia nigra area of the brain containing dopaminergic neurons, astrocytes, microglia, pericytes, and microvascular brain endothelial cells, cultured under fluid flow. Our αSyn fibril-induced model was capable of reproducing several key aspects of Parkinson’s disease, including accumulation of phosphorylated αSyn (pSer129-αSyn), mitochondrial impairment, neuroinflammation, and compromised barrier function. This …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:g3aElNc5_aQC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Rapid prototyping of component-based distributed image processing applications using javaports",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=3033635095701277929&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crowd-sourced wildfire spread prediction with remote georeferencing using smartphones",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8777073/",
            "Abstract": "Wildfires are natural hazards with severe consequences worryingly worsening for many climate-change affected regions of our planet. Unfortunately, technologies that can provide real-time fire-line information, such as satellites, in-field sensors, and social media texts, exhibit low spatial/temporal resolution or cannot be deployed cost-effectively in widespread geographical areas. We present the design, development, and implementation of a novel software service, called CITISENS, which by exploiting commodity smartphone sensors allows ordinary citizens to easily georeference a fire-line in real-time and report its coordinates as they are photographing a wildfire. The location/orientation sensors and the camera are used to compute the view-ray of the smartphone, and a digital elevation model is employed to estimate the ray's intersection with the topography. We have tested the georeferencing accuracy obtained …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:yB1At4FlUx8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hypothalamus proteomics from mouse models with obesity and anorexia reveals therapeutic targets of appetite regulation",
            "Publication year": 2016,
            "Publication url": "https://www.nature.com/articles/nutd201610",
            "Abstract": "Objective:This study examined the proteomic profile of the hypothalamus in mice exposed to a high-fat diet (HFD) or with the anorexia of acute illness. This comparison could provide insight on the effects of these two opposite states of energy balance on appetite regulation.Methods:Four to six-week-old male C56BL/6J mice were fed a normal (control 1 group; n= 7) or a HFD (HFD group; n= 10) for 8 weeks. The control 2 (n= 7) and lipopolysaccharide (LPS) groups (n= 10) were fed a normal diet for 8 weeks before receiving an injection of saline and LPS, respectively. Hypothalamic regions were analysed using a quantitative proteomics method based on a combination of techniques including iTRAQ stable isotope labeling, orthogonal two-dimensional liquid chromatography hyphenated with nanospray ionization and high-resolution mass spectrometry. Key proteins were validated with quantitative PCR.Results …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:N5tVd3kTz84C",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Predictive modeling of the spatiotemporal evolution of an environmental hazard and its sensor network implementation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5946729/",
            "Abstract": "Predicting accurately the spatiotemporal evolution of a diffusive environmental hazard is of paramount importance for its effective containment. We approximate the front line of a hazard with a set of line segments (local front models). We model the progression characteristics of these front segments by appropriately modified 2D Gaussian functions. The modified Gaussian model parameters are adjusted based on the solution of a Kullback-Leibler (KL) divergence minimization problem. The whole scheme can be realized by a wireless sensor network by forming dynamically triplets of cooperating sensor nodes along the path of the hazard. It is shown that the algorithm can track effectively the front characteristics (in terms of direction and speed) even in the presence of faulty sensor nodes.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tracking single-cells in overcrowded bacterial colonies",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7319875/",
            "Abstract": "Cell tracking enables data extraction from timelapse “cell movies” and promotes modeling biological processes at the single-cell level. We introduce a new fully automated computational strategy to track accurately cells across frames in time-lapse movies. Our method is based on a dynamic neighborhoods formation and matching approach, inspired by motion estimation algorithms for video compression. Moreover, it exploits “divide and conquer” opportunities to solve effectively the challenging cells tracking problem in overcrowded bacterial colonies. Using cell movies generated by different labs we demonstrate that the accuracy of the proposed method remains very high (exceeds 97%) even when analyzing large overcrowded microbial colonies.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:9vf0nzSNQJEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A QoS management system and an efficient scheduling heuristic for network computing applications",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.454.4313&rep=rep1&type=pdf",
            "Abstract": "The dynamic state conditions of the Network of Workstations (NOW) resources should be used to find the best acceptable tasks-to-machines allocation strategy before a network computing (NC) application is launched. We developed an interactive QoS management system that automatically finds the most efficient tasks-to-machines mapping at startup time, and in addition facilitates application adaptation at runtime. The system is self contained and relies on its own middleware layer to do the resource monitoring and servicing behind the scenes, at the application-level. It groups the available machines into clusters to scale down the number of required QoS measurements and to facilitate the mapping process. A scheduler considers user requirements and constraints and uses an efficient mapping heuristic to find an acceptable assignment. The performance estimator predicts the overall running time of a given mapping based on application and network models as well as resource state information. The estimated time is used to decide whether the mapping satisfies the QoS targets set by the user. Furthermore, we conducted many simulations that demonstrate the accuracy of the application and network models as well as the quality of the obtained mappings in different kinds of scenarios and using different types of applications.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:PELIpwtuRlgC",
            "Publisher": "Technical Report, ECE Department, Northeastern University"
        },
        {
            "Title": "Flexible IP cores for the k-NN classification problem and their FPGA implementation",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5470733/",
            "Abstract": "The k-nearest neighbor (k-NN) is a popular non-parametric benchmark classification algorithm to which new classifiers are usually compared. It is used in numerous applications, some of which may involve thousands of data vectors in a possibly very high dimensional feature space. For real-time classification a hardware implementation of the algorithm can deliver high performance gains by exploiting parallel processing and block pipelining. We present two different linear array architectures that have been described as soft parameterized IP cores in VHDL. The IP cores are used to synthesize and evaluate a variety of array architectures for a different k-NN problem instances and Xilinx FPGAs. It is shown that we can solve efficiently, using a medium size FPGA device, very large size classification problems, with thousands of reference data vectors or vector dimensions, while achieving very high throughput. To the …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A tool for simulation and geo-animation of wildfires with fuel editing and hotspot monitoring capabilities",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1364815213000728",
            "Abstract": "FLogA (Fire Logic Animation) is a set of methods and an interactive, Web-based, user-friendly software tool which allows the user to draw a forest area on the map anywhere in Europe, insert fire ignition points, generate on the fly all input data layers required for a wildfire simulation, and then simulate and animate the behavior of the evolving fireline under different weather conditions. FLogA utilizes only publicly available non-proprietary data, software libraries and Web services. It adopts a distributed, open, service oriented architecture that is easy to maintain and extend. Wind, as the most dynamic parameter affecting a wildfire's behavior, can be sampled around a reference direction and speed value reported by the closest METAR station, to generate multiple simulation scenarios. FLogA generates informative interactive geo-animations of simulation results with color representing a fire property of interest, such as …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:vRqMK49ujn8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Service-oriented architectures for pervasive computing",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-p2p-grid-systems/40801",
            "Abstract": "The vision of pervasive computing is to create and manage computational spaces where large numbers of heterogeneous devices collaborate transparently to serve the user tasks all the time, anywhere. The original utility of a computer is now changing from a stand-alone tool that runs software applications to an environment-aware, context-aware tool that can enhance the user experience by executing services and carrying out his/her tasks in an efficient manner. However, the heterogeneity of devices and the user’s mobility are among the many issues that make developing pervasive computing applications a very challenging task. A solution to the programmability of pervasive spaces is adopting the service-oriented architecture (SOA) paradigm. In the SOA model, device capabilities are exposed as software services thus providing the programmer with a convenient abstraction level that can help to deal with the …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Distributed memory parallel architecture based on modular linear arrays for 2-D separable transforms computation",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1011113507906",
            "Abstract": "A framework for mapping systematically 2-dimensional (2-D) separable transforms into a parallel architecture consisting of fully pipelined linear array stages is presented. The resulting model architecture is characterized by its generality, high degree of modularity, high throughput, and the exclusive use of distributed memory and control. There is no central shared memory block to facilitate the transposition of intermediate results, as it is commonly the case in row-column image processing architectures. Avoiding shared central memory has positive implications for speed, area, power dissipation and scalability of the architecture. The architecture presented here may be used to realize any separable 2-D transform by only changing the coefficients stored in the processing elements. Pipelined linear arrays for computing the 2-D Discrete Fourier Transform and 2-D separable convolution are presented as …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:a0OBvERweLwC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Active contours based segmentation of 2DGE proteomics images",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080479/",
            "Abstract": "The detection of protein spots in 2DGE images is one of the most important tasks in a proteomics data analysis workflow. All subsequent steps of differential expression analysis for biomarkers discovery depend on its effectiveness. In this study, we introduce the use of Active Contours without Edges coupled with Contourlet Transform - based image enhancement for extracting accurately the gel image foreground (regions with spots) from the background. We demonstrate, using both synthetic and real gel images, that the proposed approach extracts tight spot regions which do not include background areas but include almost all spots detected by PDQuest a popular commercial 2DGE image analysis package. Furthermore, our method does not require manual calibration for every new image in order to detect weak but often important “faint” spots. The method can be used as a first segmentation stage and/or to …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proteomic feature maps: a new visualization approach in proteomics analysis",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1532046409000021",
            "Abstract": "The different steps of a proteomics analysis workflow generate a plethora of features for each extracted proteomic object (a protein spot in 2D gel electrophoresis (2-DE), or a peptide peak in liquid chromatography–mass spectrometry (LC–MS) analysis). Yet, the joint visualization of multiple object features on 2D gel-like maps is rather limited in currently available proteomics software packages. We introduce a new, simple, and intuitive visualization method that utilizes spheres to represent proteomic objects on proteomic feature maps, and exploits the spheres size and color to provide simultaneous visualization of user-selected feature pairs. Our contribution, a unified and flexible visualization mechanism that can be easily applied at any stage of a 2-DE or a LC–MS based differential proteomics study, is demonstrated and discussed using five representative scenarios. The joint visualization of proteomic object …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Rapid prototyping of parallel architectures using DG2VHDL: recent advancements",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/886763/",
            "Abstract": "DG2VHDL is a tool suite which translates automatically Dependence Graphs (DGs) to high quality, ready to synthesize VHDL models for distributed memory and control processor arrays. In this paper we introduce the Optimizer, a tool recently added to the family for searching efficiently the large space of feasible solutions for optimal linear space and time mapping operators. These operators minimize a cost function provided by the designer while also meeting specified architectural constraints. All permissible linear mappings may be considered including multi-projections. Moreover, we present several added features that enhance the usefulness and flexibility of DG2VHDL. These include: (i) parameterized DG descriptions which allow multi-dimensional DGs of varying size to be explored quickly, (i) arbitrary convex polytope DG shapes that can be described with a single command line, (iii) the ability to define …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Protein spot detection and quantification in 2‐DE gel images using machine‐learning methods",
            "Publication year": 2011,
            "Publication url": "https://analyticalsciencejournals.onlinelibrary.wiley.com/doi/abs/10.1002/pmic.201000601",
            "Abstract": "Two‐dimensional gel electrophoresis (2‐DE) is the most established protein separation method used in expression proteomics. Despite the existence of sophisticated software tools, 2‐DE gel image analysis still remains a serious bottleneck. The low accuracies of commercial software packages and the extensive manual calibration that they often require for acceptable results show that we are far from achieving the goal of a fully automated and reliable, high‐throughput gel processing system. We present a novel spot detection and quantification methodology which draws heavily from unsupervised machine‐learning methods. Using the proposed hierarchical machine learning‐based segmentation methodology reduces both the number of faint spots missed (improves sensitivity) and the number of extraneous spots introduced (improves precision). The detection and quantification performance has been thoroughly …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:HDshCWvjkbEC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "A fully automated 2-DE gel image analysis pipeline for high throughput proteomics",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5946476/",
            "Abstract": "Image analysis is still considered as the bottleneck in 2D-gel based expression proteomics analysis for biomarkers discovery. We are presenting a new end-to-end image analysis pipeline of operations that can be fully automated. The pipeline includes image denoising and enhancement based on contourlets, image segmentation into Regions of Interest (ROIs) based on active contours, followed by the analysis of the extracted ROIs for spot detection and quantification using mixture modeling, model selection and unsupervised machine learning methods. The proposed system is shown to match the sensitivity and exceed the precision of commercial spot detection software when analyzing real 2D gel images. It is suitable for high throughput proteomics analysis of image stacks since, unlike commercial software, it does not require any manual re-calibration of parameters every time a new image is to be processed.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Extracting knowledge on the links between the water body stressors and biotic integrity",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0043135407002977",
            "Abstract": "Multi-metric indices of biological integrity (IBIs) are most frequently created by examining single biological metrics along gradients of environmental degradation, and then combining multiple metrics using “best professional judgment” to characterize and calibrate stressor–response relationships. We aim to provide an efficient data analysis and visualization tool to assess the simultaneous effects of anthropogenic stressors on the fish population through the fish metrics and the associated Index of Biotic Integrity (IBI). Kohonen's self-organizing feature maps (SOM), unsupervised neural networks, are employed to pattern the sampling sites in the state of Ohio based on similar metrics characteristics. Canonical correspondence analysis (CCA) allows us then to draw conclusions about the role of the environmental variables in maintaining the perfect abode for fishes. Different visualizations superimposed with SOM …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A Micro-engineered Human Colon Intestine-Chip Platform to Study Leaky Barrier",
            "Publication year": 2020,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2020.08.28.271759v1.abstract",
            "Abstract": "The intestinal epithelial barrier supports the symbiotic relationship between the microbiota colonizing the intestinal epithelium and the host immune system to maintain homeostasis. Leaky barrier is increasingly recognized as part of the pathogenesis of a number of chronic conditions in addition to inflammatory and infectious diseases. As our understanding on the regulation of the barrier remains limited, effective therapeutic targeting for the compromised barrier is still an unmet need. Here we combined advancements on the organoids and Organ-on-Chip technologies to establish a micro-engineered Colon Intestine-Chip for studying development and regulation of the human intestinal barrier. Our data demonstrate the significance of the endothelium in co-culture with the epithelial cells within a tissue-relevant microenvironment for the establishment of a tight epithelial barrier of polarized cells. Pathway analysis of the RNA sequencing (RNA-Seq), revealed significant upregulation of mechanisms relevant to the maturation of the intestinal epithelium in organoid-derived epithelial cells in co-culture with endothelium as compared to organoids maintained in suspension. We provide evidence that the Colon Intestine-Chip platform responds to interferon gamma (IFNγ), a prototype cytokine utilized to model inflammation-induced barrier disruption, by induction of apoptosis and reorganization of the apical junctional complexes as shown with other systems. We also describe the mechanism of action of interleukin 22 (IL-22) on mature, organoid-derived intestinal epithelial cells that is consistent with barrier disruption. Overall we propose the Colon Intestine …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "A graphical model formulation of the DNA base-calling problem",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1532931/",
            "Abstract": "A first order variable dependence (FOVD) probabilistic graphical model is introduced to capture the complex inter-event dependencies that are present in DNA sequencing data. In this framework, DNA base-calling is addressed as a parameter estimation problem using maximum likelihood methods. The FOVD model accounts for dependencies between neighboring alleles and statistically characterizes the size of signal peaks. Our experimental results suggest that the resulting unsupervised classification base-calling algorithms (i) achieve accuracy that exceeds on average that of the-state-of-the art base-callers, (ii) work well for a variety of data set types without requiring costly recalibration",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SWeFS: sensor Web Fire Shield for forest fire detection and monitoring",
            "Publication year": 2014,
            "Publication url": "https://digitalis-dsp.uc.pt/handle/10316.2/34198",
            "Abstract": "UCDigitalis: SWeFS: sensor Web Fire Shield for forest fire detection and monitoring Futuros \nEstudantes Estudantes Antigos Estudantes Colaboradores Empresas In cio Search DSpace \nAdvanced Search Home Browse Communities & Collections Issue Date Author Title Subject Sign \non to: My DSpace authorized users Edit Profile Receive email updates UCDigitalis > POMBALINA \n> Partes e Capítulos > Please use this identifier to cite or link to this item: \nhttp://hdl.handle.net/10316.2/34198 Title: SWeFS: sensor Web Fire Shield for forest fire detection \nand monitoring Authors: Bismpikis, George Papataxiarhis, Vassilis Bogdos, Nikos Manolakos, \nElias S. Hadjiefthymiades, Stathes Issue Date: 2014 Publisher: Imprensa da Universidade de \nCoimbra location : Local:Coimbra URI: URI:http://hdl.handle.net/10316.2/34198 ISBN: \nISBN:978-989-26-0884-6 (PDF) Appears in Collections: Partes e Capítulos Files in This Item: File --…",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Imprensa da Universidade de Coimbra"
        },
        {
            "Title": "In silico modeling of the effects of alpha-synuclein oligomerization on dopaminergic neuronal homeostasis",
            "Publication year": 2014,
            "Publication url": "https://bmcsystbiol.biomedcentral.com/articles/10.1186/1752-0509-8-54",
            "Abstract": "Alpha-synuclein (ASYN) is central in Parkinson’s disease (PD) pathogenesis. Converging pieces of evidence suggest that the levels of ASYN expression play a critical role in both familial and sporadic Parkinson’s disease. ASYN fibrils are the main component of inclusions called Lewy Bodies (LBs) which are found mainly in the surviving neurons of the substantia nigra. Despite the accumulated knowledge regarding the involvement of ASYN in molecular mechanisms underlying the development of PD, there is much information missing which prevents understanding the causes of the disease and how to stop its progression. Using a Systems Biology approach, we develop a biomolecular reactions model that describes the intracellular ASYN dynamics in relation to overexpression, post-translational modification, oligomerization and degradation of the protein. Especially for the proteolysis of ASYN, the model takes into account the biological knowledge regarding the contribution of Chaperone Mediated Autophagy (CMA), macro-autophagic and proteasome pathways in the protein’s degradation. Importantly, inhibitory phenomena, caused by ASYN, concerning CMA (more specifically the lysosomal-associated membrane protein 2a, abbreviated as Lamp2a receptor, which is the rate limiting step of CMA) and the proteasome are carefully modeled. The model is validated by simulation studies of known experimental overexpression data from SH-SY5Y cells and the unknown model parameters are estimated either computationally or by experimental fitting. The calibrated model is then tested under three hypothetical intervention scenarios and in all …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:kRWSkSYxWN8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Skyline Normalization of DNA chromatograms by regression",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=16748752738882322452&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rapid prototyping of Matlab/Java Distributed Applications using the JavaPorts components framework",
            "Publication year": 2002,
            "Publication url": "https://archive.ll.mit.edu/HPEC/agendas/proc02/abstracts/manolakos.pdf",
            "Abstract": "Although PC clusters have become a commodity, there is still a lack of software technologies for the rapid prototyping and evaluation of end-to-end distributed computation strategies for heterogeneous clusters. Such applications may involve a large number of tasks (depicted as small circles in the task graph of Figure 1) which interact while running in the different nodes of a heterogeneous network, that possibly includes smart sensors, embedded controllers, various types of PCs, compute/data servers etc.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image analysis driven single-cell analytics for systems microbiology",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1186/s12918-017-0399-z",
            "Abstract": "Time-lapse microscopy is an essential tool for capturing and correlating bacterial morphology and gene expression dynamics at single-cell resolution. However state-of-the-art computational methods are limited in terms of the complexity of cell movies that they can analyze and lack of automation. The proposed Bacterial image analysis driven Single Cell Analytics (BaSCA) computational pipeline addresses these limitations thus enabling high throughput systems microbiology. BaSCA can segment and track multiple bacterial colonies and single-cells, as they grow and divide over time (cell segmentation and lineage tree construction) to give rise to dense communities with thousands of interacting cells in the field of view. It combines advanced image processing and machine learning methods to deliver very accurate bacterial cell segmentation and tracking (F-measure over 95%) even when processing images of …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:Fu2w8maKXqMC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Python facilitates the rapid prototyping and HW/SW verification of processor centric SoCs for FPGAs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7527465/",
            "Abstract": "System Python (SysPy) is a public domain design tool using Python to facilitate all prototyping phases of processor-centric SoCs for FPGAs. In previous work we used Python as a high-level description mechanism to design hardware modules and connect them to embedded processors. In this paper we show how SysPy can also facilitate high-level functional verification of a SoC when used as an Architectural Description Language (ADL), helping a designer make decisions about key architectural features early in the design phase. To the best of our knowledge our tool is unique in supporting algorithmic joint modeling of hardware and software elements of a SoC (processing and control logic) using popular Python libraries such as SciPy and NumPy following a Matlab-like syntax. The tool also supports C software development and hw/sw co-verification as it automatically compiles and executes the user's C …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sensor and Computing Infrastructure for Environmental Risks",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=16934951543139686105&hl=en&oi=scholarr",
            "Abstract": "The SCIER platform is an integrated system of networked sensors and distributed computing facilities, aiming to detect and monitor a hazard, predict its evolution and assist the authorities in crisis management for hazards occurring at Wildlife Urban Interface (WUI) areas. The goal of SCIER is to make the vulnerable WUI zone safer for the citizens and protect their lives and property from environmental risks. To achieve its objective, SCIER integrates technologies such as:(1) wireless sensor networks for the detection and monitoring of disastrous natural hazards,(2) advanced sensor data fusion and management for accurately monitoring the dynamics of multiple interrelated risks,(3) environmental risk models for simulating and predicting the evolution of hazardous phenomena using Grid-computing. In this chapter we present the key software components of the SCIER system architecture, namely the sensor data fusion component and the predictive modeling and simulation component.",
            "Abstract entirety": 1,
            "Author pub id": "fO1mhBoAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust normalization of DNA chromatograms by regression for improved base-calling",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0016003203000942",
            "Abstract": "The accuracy of base-calling software depends critically on the data normalization method it is using. A new regression-based method for normalizing electrophoretic DNA traces is presented. It is based on a channel-coupled exponential decay model that can track accurately the trend of dropping peak heights (the so-called signal “skyline”) even in the low SNR region of the trace. We provide the justification and formulation of the regression model as well as the analytical estimation of its parameters. The proposed skyline-based normalization scheme is not affected by the presence of artifacts, compressions, false peaks, etc. and does not depend on the dye chemistry used. We demonstrate that it can improve the interpretation of chromatograms and therefore increase base-calling accuracy when employed in the pre-processing stage of either a pattern classification type base-caller (such as the BEM presented in …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:TQgYirikUcIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Statistical learning formulation of the DNA base-calling problem and its solution in a Bayesian EM framework",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0166218X0000192X",
            "Abstract": "A novel formulation of the important DNA sequence base-calling problem as well as algorithms for its solution are introduced. The proposed approach is to bring DNA base-calling within the framework of a powerful statistical learning paradigm, which allows the incorporation of prior knowledge about the structure of the problem directly into the base-calling algorithms, without resorting to heuristics. Use of prior knowledge provides constraints which help disambiguate the different possible interpretations that the data may have at regions of low SNR, and is shown to lead to a substantial increase of the number of DNA bases that can be accurately called in such regions. Our experimental results suggest that the proposed algorithms, without being optimized, can achieve base-calling performance that matches, and often exceeds, that of commercially available software. Furthermore, due to their statistical basis, they …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Accelerating all-to-all protein structures comparison with TMalign using a NoC many-cores processor architecture",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6650926/",
            "Abstract": "Computational challenges for the one-to-many and many-to-many protein structure comparison (PSC) problem are a result of several factors: constantly expanding large-size structural proteomics databases, high computational complexity of pair wise protein comparison algorithms, and the multitude of pair wise comparison approaches used in the field. Advances in processor architectures, such as manyc-ore CPUs, have enabled them to support parallelism making them of interest in speeding up PSC techniques. We presentrckAlign, an implementation of the popularly used TM-alignPSC algorithm, designed for the Single-Chip Cloud Computer(SCC), an experimental processor created by Intel Labs. We developed a skeleton library, rckskel, and implemented amaster-slaves variant of TM-align to exploit the parallelism offered by the SCC. We evaluated rckAlign on the SCC and compared it with existing TM-align …",
            "Abstract entirety": 0,
            "Author pub id": "fO1mhBoAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        }
    ]
}]