[{
    "name": "Ηρακλής Βαρλάμης",
    "romanize name": "Iraklis Varlamis",
    "School-Department": "Πληροφορικής &Τηλεματικής",
    "University": "hua",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 21827,
    "Scholar name": "Iraklis Varlamis",
    "Scholar id": "SUyTkTAAAAAJ",
    "Affiliation": "Associate Professor, Department of Informatics and Telematics, Harokopio University of Athens",
    "Citedby": 3030,
    "Interests": [
        "data mining",
        "text mining",
        "graph mining",
        "machine learning",
        "recommender systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=SUyTkTAAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Organising web documents into thematic subsets using an ontology (THESUS)",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=4340600817075915284&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effect of global and local influence models on the quality of recommendations",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8823538/",
            "Abstract": "The quality of recommendations on social networks is a combination of the richness of the available information and the ability of algorithms and architectures to take advantage of this information in favor of the users. Recommendation algorithms have to address several problems, such as information sparsity, scalability of algorithms, concept drift etc. ln this dynamic and complex environment, it is important to provide solutions that enrich information when it is necessary to fill the gaps and at the same time to scale solutions so that they can handle the ever increasing data sizes and flows. ln this work, we extend our previous work on recommender systems for social networks that studied global influence and trust metrics and their applications. More specifically, we introduce a local influence model, which is relied on the formation of local user networks based on common interests and study the performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A model for predicting room occupancy based on motion sensor data",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9089624/",
            "Abstract": "When designing a large scale IoT ecosystem, it is important to provide economical solutions at all levels, from sensors and actuators to the software used for analytics and orchestration. It is of equal importance to provide non-intrusive solutions that do not violate users' privacy, but above all, it is important to guarantee the accuracy and integrity of the provided solution. In this work, we present a research prototype solution that has been developed as part of an ongoing project called (EM)3. The project involves IoT sensors and actuators, realtime data analytics modules and cutting edge recommendation algorithms in an ecosystem that improves energy efficiency in office buildings. The main concept of the (EM) 3  is to recommend energy saving actions at the right moment to the right user. At the core of the (EM) 3  vision is to detect when is the right moment for an energy saving action and sensors play a vital role in …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:L7CI7m0gUJcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smart fusion of sensor data and human feedback for personalized energy-saving recommendations",
            "Publication year": 2022,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306261921011120",
            "Abstract": "Despite the variety of sensors that can be used in a smart home or office setup, for monitoring energy consumption and assisting users to save energy, their usefulness is limited when they are not properly integrated into the daily activities of humans. Energy-saving applications in such environments can benefit from the use of sensors and actuators when data are properly fused with previous knowledge about user habits and feedback about current user preferences. In this article, we present an online recommender system implemented in the EM3 platform, a platform for Consumer Engagement Toward Energy-Saving Behavior. The recommender system uniquely fuses sensors’ data with user habits and user feedback and provides personalized recommendations for energy efficiency at the right moment. The user response to the recommendations directly triggers actuators that perform energy-saving actions and is …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:IUKN3-7HHlwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Mining Habitual User Choices from Google Maps History Logs",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-33698-1_9",
            "Abstract": "Nowadays, many people use their smart-phones for voice guided navigation. Such smart-phone applications provide up-to-date information about traffic and congestion and assist driving by giving route alternatives and estimations on the arrival time. In the same time, they record users’ position information and extract simple rules for them, such as the time they commute or return home. In this work, we extend this simple analysis in order to identify more habitual behaviors, based on the analysis of user’s location data. More specifically, we analyze user’s GPS logs provided through his Google location history, and find locations that user usually spends more time, and types of places that the user visits in a regular base (such as cinemas, restaurants, gyms, bars etc). In addition to this, we analyze the most frequent user routes (e.g. from home to work and back) and employing a trajectory partitioning methodology, we …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Uncovering hidden concepts from AIS data: A network abstraction of maritime traffic for anomaly detection",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-38081-6_2",
            "Abstract": " The compulsory use of Automatic Identification System (AIS) for many vessel types, which has been enforced by naval regulations, has opened new opportunities for maritime surveillance. AIS transponders are rich sources of information that everyone can collect using an RF receiver and provide real-time information about vessels’ position. Properly taking advantage of AIS data, can uncover potential illegal behavior, offer real-time alerts and notify the authorities for any kind of anomalous vessel behavior. In this article, we extend an existing network abstraction of maritime traffic, that is based on nodes (called way-points) that correspond to naval areas of long stays or major turns for vessels (e.g. ports, capes, offshore platforms etc.) and edges (called traversals) that correspond to the routes followed by vessels between two consecutive way-points. The current work, focuses on the connections of this network …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evolutionary data sampling for user movement classification",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7256963/",
            "Abstract": "Smartphones are nowadays used for recognizing people's daily activities and habits, by collecting and analysing user activity information in real-time. In order to demonstrate this methodology, we have developed GPSTracker 1  a prototype application for Android phones, which collects position, speed, altitude and time information and performs real-time classification of user's movement. The GPSTracker application also uses geo-location information abouts Points Of Interest (POIs) such as bus or metro routes, parks and stadiums in order to improve the set of features used for the classification of a type of movement. In this work, we use evolutionary algorithms, in order to reduce the number of samples required for training our classifier, without loosing in classification accuracy. The resulting model, a) is able to provide personalized solutions, tuned to each individual users movement abilities, b) better adapts to …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PONTE: A Context-Aware Approach for Automated Clinical Trial Protocol Design",
            "Publication year": 2012,
            "Publication url": "https://galaxy.hua.gr/~varlamis/Varlamis-papers/C59.pdf",
            "Abstract": "The rapidly increasing volume of published clinical and nonclinical data at a variety of sources and the resulting great effort required for researchers to access them and mine information of interest lead to clinical trials that are based on only a limited set of knowledge in the domain they cover. This restricted view of the clinical trials’ context is quite often the reason behind unsuccessful trials and/or successful ones which, however, underestimate drugs’ unwanted effects and thus their results are of low external validity in the much more complicated environment of clinical healthcare. In this paper, we present a context-aware approach, which has been developed in the PONTE project, for effectively guiding medical researchers during clinical trial protocol design and allowing for more efficient and effective access to scientific literature. The suggested approach incorporates intelligent services and advanced text mining mechanisms for scientific literature querying and mining during protocol design, taking into account the study context (ie active substance, target and disease) and the domain context in literature.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How to become a group leader? or modeling author types based on graph mining",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-24469-8_4",
            "Abstract": "Bibliographic databases are a prosperous field for data mining research and social network analysis. The representation and visualization of bibliographic databases as graphs and the application of data mining techniques can help us uncover interesting knowledge regarding how the publication records of authors evolve over time. In this paper we propose a novel methodology to model bibliographical databases as Power Graphs, and mine them in an unsupervised manner, in order to learn basic author types and their properties through clustering. The methodology takes into account the evolution of the co-authorship information, the volume of published papers over time, as well as the impact factors of the venues hosting the respective publications. As a proof of concept of the applicability and scalability of our approach, we present experimental results in the DBLP data.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Providing shortcuts to the learning process",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Iraklis-Varlamis/publication/334004965_Providing_Shortcuts_to_the_Learning_Process/links/5e8b4731299bf1307983c23e/Providing-Shortcuts-to-the-Learning-Process.pdf",
            "Abstract": "The aim and scope of traditional education differs significantly from these of life long learning.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Brill Academic Publishers"
        },
        {
            "Title": "Developing a Civic Journalism Social Medium on the Web: Technological Methods and Constraints",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30179115/c40.pdf",
            "Abstract": "Several social media web sites and applications have appeared the last few years and attracted the attention of people world-wide. Online social media changed the news publishing paradigm: they facilitated web users in reporting events, enforced collaboration and content quality assessment and introduced a flexible crowd-sourcing model. In this work, we present a new web based social medium targeted to the Greek online media market. We focus on the technological methods employed in order to promote citizens journalism and in the same time control the published content and examine the contribution of citizens to the new medium under the prism of local or international events in different disciplines. We present the people-based mechanism for content quality assessment, compare it to text based techniques for filtering offensive content and suggest a combined approach. Finally, we present a trust and profile aware mechanism that will be incorporated to the content recommendation service which is under development.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Social media in health care: Exploring its use by health-care professionals in Greece",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17538157.2021.1906256",
            "Abstract": "The lockdown restrictions that have emerged during the COVID-19 pandemic have reshaped the way people live, work, and interact with each other. At the same time, it changed the way health-care professionals and national health-care systems around the world are fighting in this battle for public health. Social media (SoMe) have played their informational role in this fight with almost one-third of the world’s population being active users of social media platforms. Contemporary health-care systems have tried to find ways to engage more actively with SoMe as Internet users are increasingly searching for health information on social media platforms. As a result, new demand-side levers arise in the health-care sector along with new opportunities and risks for the stakeholders. Our study looked into the responses of 173 health-care professionals in Greece. SoMe are here to stay and the majority of health-care …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:8d8msizDQcsC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "PaloAnalytics: project concept, scope and early results from the system implementation",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8900696/",
            "Abstract": "This paper describes the national funded project entitled PaloAnalytics, which develops an innovative platform that enables organizations, which operate in many countries, to monitor and analyze, in depth, the markets' interest to their products and successfully manage their marketing and communication plans, with data and insights collected from the local media. The project scope is to explore, design and develop a range of algorithms and tools in order to collect and manage big data from heterogeneous online news sources, social networks and open sources; to extract knowledge from textual references in a multilingual environment, and to interconnect information together by making user-friendly visualisations. In this paper, we specifically focus on the architecture of the system that performs trending topics extraction from the Twitter platform, presenting some early results from its implementation.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:yB1At4FlUx8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "THESUS, a closer view on web content management enhanced with link semantics",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1294890/",
            "Abstract": "With the unstoppable growth of the world wide Web, the great success of Web search engines, such as Google and AltaVista, users now turn to the Web whenever looking for information. However, many users are neophytes when it comes to computer science, yet they are often specialists of a certain domain. These users would like to add more semantics to guide their search through world wide Web material, whereas currently most search features are based on raw lexical content. We show how the use of the incoming links of a page can be used efficiently to classify a page in a concise manner. This enhances the browsing and querying of Web pages. We focus on the tools needed in order to manage the links and their semantics. We further process these links using a hierarchy of concepts, akin to an ontology, and a thesaurus. This work is demonstrated by an prototype system, called THESUS, that organizes …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Endorsing domestic energy saving behavior using micro-moment classification",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S030626191930950X",
            "Abstract": "With the ever-growing rise of energy consumption and its devastating financial and environmental repercussions, it is of utmost significance to moderate energy usage with proper energy efficiency tools. This is particularly applicable to domestic energy end-users, where an accurate profile is a prerequisite for motivating energy saving behavior. This article presents an innovative method for accurately understanding domestic energy usage patterns through a classification system. It capitalizes on the emerging concept of micro-moments, short energy-related events, and builds a comprehensive profile of end-user’s energy activities with unprecedented accuracy. Micro-moments are classified based on a set of criteria per the given appliance. Five classifiers with different parameter settings were trained and tested on 10-fold cross-validated simulated data, with ensemble bagged trees topping with an accuracy of 88.0 …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The Evolution of Healthcare Applications in the Web 2.0 Era",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-14464-6_14",
            "Abstract": "Healthcare refers to the diagnosis, treatment and management of illness, as well as to the preservation of health through specialized services. Healthcare services are offered by medical practitioners and organizations and directed to individuals or to populations. The advent of the Web increased the pervasiveness of healthcare services and attracted the interest of both practitioners and patients. In its turn, Web 2.0 brought people together in a more dynamic and interactive space. With new services, applications and devices, it promises to enrich our web experience, and to establish an environment where virtual medical communities may flourish away from private interests and financial expectations. This article performs a bird’s eye view of Web 2.0 novelties, portrays the structure of a community for healthcare and describes how medical information can be exploited in favor of the community. It discusses …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Challenges from implementing Blended Learning in a 3D Multiuser Virtual Environment",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/42693394/Challenges_from_implementing_Blended_Lea20160215-982-fo0dsu.pdf",
            "Abstract": "With their ability to simulate real life and allow users to interact with the virtual environment, Multiuser Virtual Environments (MUVEs) are very useful platforms for education and training. A survey of the related literature shows that MUVEs in education are mainly used only as a supplement of the traditional lesson in the classroom, which is mainly the idea of blended learning. In this work, we go one step beyond and examine whether this blended learning model can be fully implemented online, with MUVEs replacing the face to face interaction. This is ideal for open learning communities, whose members are able to meet only online, and can hardly meet in the same classroom. For an open learning community, we investigate whether the existence of a MUVE can be combined smoothly and productively with the already established tools for online learning communities support and the first user experiences are positive: users prefer to use LMS because of its simplicity and are attracted from the 3D virtual environment and the interactivity it offers.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:NhqRSupF_l8C",
            "Publisher": "Open Education Europa"
        },
        {
            "Title": "Word sense disambiguation with semantic networks",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87391-4_29",
            "Abstract": "Word sense disambiguation (WSD) methods evolve towards exploring all of the available semantic information that word thesauri provide. In this scope, the use of semantic graphs and new measures of semantic relatedness may offer better WSD solutions. In this paper we propose a new measure of semantic relatedness between any pair of terms for the English language, using WordNet as our knowledge base. Furthermore, we introduce a new WSD method based on the proposed measure. Experimental evaluation of the proposed method in benchmark data shows that our method matches or surpasses state of the art results. Moreover, we evaluate the proposed measure of semantic relatedness in pairs of terms ranked by human subjects. Results reveal that our measure of semantic relatedness produces a ranking that is more similar to the human generated one, compared to rankings generated by …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Application of Affinity Analysis Techniques on Diagnosis and Prescription Data",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8104227/",
            "Abstract": "This study performs an Affinity Analysis on diagnosis and prescription data in order to discover cooccurrence relationships among diagnosis and pharmaceutical active ingredients prescribed to different patient groups. The analysis data collected during consecutive visits of 4,473 patients in a 3 years period, focused on patients suffering by hypertension and/or hypercholesterolemia and applied association rule and sequential rule mining techniques. The findings have been validated in the specific dataset using statistical analysis methods. Association rule mining shows an association between gastrooesophageal reflux and the medicines prescribed for hypertension and heart diseases, which agrees with findings in the related literature. Another interesting finding, not yet been reported in related studies is the association between heart diseases, gastroesophageal reflux and insulin-dependent diabetes mellitus for …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Clustering Web documents using an ontology",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=14142440682956452734&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:-FonjvnnhkoC",
            "Publisher": "Technical Report Verso"
        },
        {
            "Title": "Feeds as Methodological Tools for Web Research",
            "Publication year": 2008,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mining frequent generalized patterns for web personalization in the presence of taxonomies",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/article/mining-frequent-generalized-patterns-web/38954",
            "Abstract": "The Web is a continuously evolving environment, since its content is updated on a regular basis. As a result, the traditional usage-based approach to generate recommendations that takes as input the navigation paths recorded on the Web page level, is not as effective. Moreover, most of the content available online is either explicitly or implicitly characterized by a set of categories organized in a taxonomy, allowing the page-level navigation patterns to be generalized to a higher, aggregate level. In this direction, the authors present the Frequent Generalized Pattern (FGP) algorithm. FGP takes as input the transaction data and a hierarchy of categories and produces generalized association rules that contain transaction items and/or item categories. The results can be used to generate association rules and subsequently recommendations for the users. The algorithm can be applied to the log files of a typical Web site …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:4TOpqqG69KYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Towards domestic energy efficiency: using micro-moments for personalized behavior change recommendations",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=13117881484645580596&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Biosensors and Internet of Things in smart healthcare applications: challenges and opportunities",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128153697000021",
            "Abstract": "The use of health and well-being monitoring technologies has been steadily increasing and such systems can now be found in smart homes, age-friendly workplaces, public spaces, and elsewhere. These monitoring technologies employ a wide variety of off-the-shelf smart sensors and medical devices to support functional, physiological, and behavioral monitoring and to address social interaction aspects of daily life. These systems focus either on specific health-related conditions or on supporting the more general aims of comfort, well-being, and quality of life. However, there remain several technological (interoperability, expandability, etc.) and societal (cost, privacy, etc.) challenges to be addressed before smart biosensor systems are widely adopted.Motivated by the above, this chapter highlights the challenges and opportunities surrounding the application of smart biosensors in healthcare and presents three …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:z_wVstp3MssC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Application of data mining techniques and data analysis methods to measure cancer morbidity and mortality data in a regional cancer registry: The case of the island of Crete, Greece",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169260716309208",
            "Abstract": "Micro or macro-level mapping of cancer statistics is a challenging task that requires long-term planning, prospective studies and continuous monitoring of all cancer cases. The objective of the current study is to present how cancer registry data could be processed using data mining techniques in order to improve the statistical analysis outcomes.Data were collected from the Cancer Registry of Crete in Greece (counties of Rethymno and Lasithi) for the period 1998–2004. Data collection was performed on paper forms and manually transcribed to a single data file, thus introducing errors and noise (e.g. missing and erroneous values, duplicate entries etc.). Data were pre-processed and prepared for analysis using data mining tools and algorithms. Feature selection was applied to evaluate the contribution of each collected feature in predicting patients’ survival. Several classifiers …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Hospital information systems replacement and healthcare quality",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/article/content/68836",
            "Abstract": "The aim of this paper is to develop a methodology for deciding when a Hospital Information System (HIS) must be replaced and in addition to discuss how the decision for system replacement affects the quality of healthcare services. In the hypothesis, the Hospital IS has been in operation for a period of time and the Hospital managers have to choose between the replacement with a new Information System (IS) and the continuation of its use. Leaving aside the economic factors concerning the return of a possible investment, the decision is still difficult and will be based on scientific and technological factors. The proposed methodology employs confidential information from the Hospital, which relates to the system operation and usability, the satisfaction of doctors and patients, etc. It also examines the entire working environment and common factors that affect the choice of Hospital managers (eg, financial constraints).",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:35N4QoGY0k4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "The impact of information technologies within an art educational organization",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:DUooU5lO8OsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Affinity analysis for studying physicians’ prescription behavior.",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10618-021-00758-4",
            "Abstract": "The current study refers to the affinity analysis of a prescription and diagnosis dataset and focuses on how prescription behavior changes after the detection of a disorder. Using a subset of patients that have been diagnosed, at least once, with hypertension and hyperlipidemia, examines the prescription behavior of the doctor after the detection of gastroesophageal reflux (K21), or insulin-dependent diabetes mellitus (E10). Diagnosis and prescription data were collected during consecutive visits of 4473 patients in a 3 years period. The analysis of the prescription data before and after the diagnosis of K21 and E10 reveals the popular substances for each disorder, such as Metformin for E10, or Omeprazole for K21 and substances that are discontinued including the same popular substances as well. It also reveals that substances that treat the main disorders of the group, such as Simvastatin and Hydrochlorothiazide …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Marketability of building energy efficiency systems based on behavioral change: A case study of a novel micro-moments based solution",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2105.10460",
            "Abstract": "In spite of the substantial advance in developing energy-efficient buildings, power demand in the building sector is still remarkably growing due to teleworking and e-learning triggered by the COVID-19 movement restrictions. This is highlighted by the inefficiency of energy saving measures that have recently been set owing to the the marketability failure and unsuccessful design integration of existing ICT based solutions. Specifically, the factors that affect energy efficiency comprise natural and socio-economic restrictions, technological advances, and last but not least the human behavior. Energy efficiency based on behavioral change has attracted an increasing interest in the recent years, unfortunately, solutions in this area suffer from the lack of marketability because of the absence of both prospective studies and consumer awareness. This work, focuses on a key cost-effective technology for monitoring power consumption and for contributing to the behavioral change through smart, personalized, and on the moment, action recommendations. In order to examine the marketability of the proposed solution, we begin with a market and research analysis of the domain of energy efficiency systems in the building sector that target behavioral change. Moving forward, various factors that affect the commercialization of the final product are considered before proceeding with recommended actions to ensure its successful marketability via conducting a Go/No-Go analysis. Finally, based on the comprehensive commercialization study, a GO decision is concluded for the subject technology.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual learning communities in Health Care Services",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=11600302708164110984&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:LI9QrySNdTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Strengthening Privacy in Healthcare Social Networks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23633-9_23",
            "Abstract": "The purpose of this chapter is to present a comprehensive approach to the problem of privacy protection in healthcare social networks, to summarize threats and suggest emerging technological solutions to protect users. For this purpose we start with a definition of the term “privacy” and how it evolved through time. We continue within the context of social networks and highlight the main privacy issues and threats for network members. In addition, we analyze the Common Criteria for IT security evaluation that apply to privacy, under the prism of Healthcare Social Networks (HSNs) and present tools and methods that may enhance privacy in such networks. Finally, we provide examples of popular HSNs, categorized according to the purpose they serve and discuss the privacy challenges for them.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:dshw04ExmUIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "THESUS, a closer view on web content management enhanced with link semantics",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1294890/",
            "Abstract": "With the unstoppable growth of the world wide Web, the great success of Web search engines, such as Google and AltaVista, users now turn to the Web whenever looking for information. However, many users are neophytes when it comes to computer science, yet they are often specialists of a certain domain. These users would like to add more semantics to guide their search through world wide Web material, whereas currently most search features are based on raw lexical content. We show how the use of the incoming links of a page can be used efficiently to classify a page in a concise manner. This enhances the browsing and querying of Web pages. We focus on the tools needed in order to manage the links and their semantics. We further process these links using a hierarchy of concepts, akin to an ontology, and a thesaurus. This work is demonstrated by an prototype system, called THESUS, that organizes …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Text Classification using the N-gram graph Representation model over high frequency data streams",
            "Publication year": 2018,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fams.2018.00041/full",
            "Abstract": "A prominent challenge in our information age is the classification over high frequency data streams. In this research, we propose an innovative and high-accurate text stream classification model that is designed in an elastic distributed way and is capable to service text load with fluctuated frequency. In this classification model, text is represented as N-Gram Graphs and the classification process takes place using text preprocessing, graph similarity and feature classification techniques following the supervised machine learning approach. The work involves the analysis of many variations of the proposed model and its parameters, such as various representations of text as N-Gram Graphs, graph comparisons metrics and classification methods in order to conclude to the most accurate setup. To deal with the scalability, the availability and the timely response in case of high frequency text we employ the Beam programming model. Using the Beam programming model the classification process occurs as a sequence of distinct tasks and facilitates the distributed implementation of the most computational demanding tasks of the inference stage. The proposed model and the various parameters that constitute it are evaluated experimentally and the high frequency stream emulated using two public datasets (20NewsGroup and Reuters-21578) that are commonly used in the literature for text classification",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:SdhP9T11ey4C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Non Governmental Organizations in Greece gone virtual",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fake news detection: A hybrid CNN-RNN based deep learning approach",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2667096820300070",
            "Abstract": "The explosion of social media allowed individuals to spread information without cost, with little investigation and fewer filters than before. This amplified the old problem of fake news, which became a major concern nowadays due to the negative impact it brings to the communities. In order to tackle the rise and spreading of fake news, automatic detection techniques have been researched building on artificial intelligence and machine learning. The recent achievements of deep learning techniques in complex natural language processing tasks, make them a promising solution for fake news detection too. This work proposes a novel hybrid deep learning model that combines convolutional and recurrent neural networks for fake news classification. The model was successfully validated on two fake news datasets (ISO and FA-KES), achieving detection results that are significantly better than other non-hybrid baseline …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:86PQX7AUzd4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A knowledge-based semantic kernel for text classification",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-24583-1_25",
            "Abstract": "Typically, in textual document classification the documents are represented in the vector space using the “Bag of Words” (BOW) approach. Despite its ease of use, BOW representation cannot handle word synonymy and polysemy problems and does not consider semantic relatedness between words. In this paper, we overcome the shortages of the BOW approach by embedding a known WordNet-based semantic relatedness measure for pairs of words, namely Omiotis, into a semantic kernel. The suggested measure incorporates the TF-IDF weighting scheme, thus creating a semantic kernel which combines both semantic and statistical information from text. Empirical evaluation with real data sets demonstrates that our approach successfully achieves improved classification accuracy with respect to the standard BOW representation, when Omiotis is embedded in four different classifiers.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A data mining approach for predicting main-engine rotational speed from vessel-data measurements",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3331076.3331123",
            "Abstract": "In this work we face the challenge of estimating a ship's main-engine rotational speed from vessel data series, in the context of sea vessel route optimization. To this end, we study the value of different vessel data types as predictors of the engine rotational speed. As a result, we utilize speed data under a time-series view and examine how extracting locally-aware prediction models affects the learning performance. We apply two different approaches: the first utilizes clustering as a pre-processing step to the creation of many local models; the second builds upon splines to predict the target value. Given the above, we show that clustering can improve performance and demonstrate how the number of clusters affects the outcome. We also show that splines perform in a promising manner, but do not clearly outperform other methods. On the other hand, we show that spline regression combined with a Delaunay …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tele-pediatric education over a decentralized telemedicine network",
            "Publication year": 2008,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stop-and-move sequence expressions over semantic trajectories",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13658816.2020.1793157",
            "Abstract": "Stop-and-move semantic trajectories are segmented trajectories where the stops and moves are semantically enriched with additional data. A query language for semantic trajectory datasets has to include selectors for stops or moves based on their enrichments and sequence expressions that define how to match the results of selectors with the sequence the semantic trajectory defines. This article addresses the problem of searching semantic trajectories, using stop-and-move sequence expressions. The article first proposes a formal framework to define semantic trajectories and introduces stop-and-move sequence expressions, with well-defined syntax and semantics, which act as an expressive query language for semantic trajectories. Then, it describes a concrete semantic trajectory model in RDF, defines SPARQL stop-and-move sequence expressions and discusses strategies to compile such expressions into …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:HbR8gkJAVGIC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Semantic smoothing for text clustering",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0950705113002906",
            "Abstract": "In this paper we present a new semantic smoothing vector space kernel (S-VSM) for text documents clustering. In the suggested approach semantic relatedness between words is used to smooth the similarity and the representation of text documents. The basic hypothesis examined is that considering semantic relatedness between two text documents may improve the performance of the text document clustering task. For our experimental evaluation we analyze the performance of several semantic relatedness measures when embedded in the proposed (S-VSM) and present results with respect to different experimental conditions, such as: (i) the datasets used, (ii) the underlying knowledge sources of the utilized measures, and (iii) the clustering algorithms employed. To the best of our knowledge, the current study is the first to systematically compare, analyze and evaluate the impact of semantic smoothing in text …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:yD5IFk8b50cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A knowledge-based semantic framework for query expansion",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S030645731830339X",
            "Abstract": "Searching for relevant material that satisfies the information need of a user, within a large document collection is a critical activity for web search engines. Query Expansion techniques are widely used by search engines for the disambiguation of user’s information need and for improving the information retrieval (IR) performance. Knowledge-based, corpus-based and relevance feedback, are the main QE techniques, that employ different approaches for expanding the user query with synonyms of the search terms (word synonymy) in order to bring more relevant documents and for filtering documents that contain search terms but with a different meaning (also known as word polysemy problem) than the user intended. This work, surveys existing query expansion techniques, highlights their strengths and limitations and introduces a new method that combines the power of knowledge-based or corpus-based …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:tKAzc9rXhukC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Omiotis: A thesaurus-based measure of text relatedness",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04174-7_54",
            "Abstract": "In this paper we present a new approach for measuring the relatedness between text segments, based on implicit semantic links between their words, as offered by a word thesaurus, namely WordNet. The approach does not require any type of training, since it exploits only WordNet to devise the implicit semantic links between text words. The paper presents a prototype on-line demo of the measure, that can provide word-to-word relatedness values, even for words of different part of speech. In addition the demo allows for the computation of relatedness between text segments.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A virtual community for the Deaf and the Hearing",
            "Publication year": 2007,
            "Publication url": "https://dit.hua.gr/~varlamis/Varlamis-papers/C23.pdf",
            "Abstract": "With this paper we introduce the idea of a virtual community that brings deaf and hearing people together, respecting the difference of the Deaf and addressing their needs. We show that Deaf constitute a community, one that is being approached by Greek Sign Language students and one that could use the opportunities of the web to communicate without barriers, once their standards are met. We capitalize on the idea of a virtual community, which is primarily designed to facilitate the deaf and hearing impaired, but which is also open to everyone who wants to participate, communicate, and learn about deaf culture.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Medical informatics in the Web 2.0 era",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-68127-4_53",
            "Abstract": "The main role of medical and healthcare informatics is the manipulation of medical information and the dissemination of knowledge. The advent of the Web increased the pervasiveness of medical information and attracted the interest of both practitioners and patients. Web 2.0 in its turn brings people together in a more dynamic, interactive space. With new services, applications and devices, it promises to enrich our web experience, and to establish an environment where virtual medical communities may flourish away from private interests and financial expectations. This article performs a bird’s eye view of Web 2.0 novelties, portrays the structure of a medical community and describes how medical information can be exploited in favor of the community. It discusses the merits and necessities emanating from various approaches and tools and gives emphasis on the intelligent information management inside …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A framework for the quality assurance of blended e-learning communities",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15393-8_4",
            "Abstract": "E-learning enables learners to decide what to learn, when, how and how fast. In the blended e-learning paradigm, knowledge is delivered using a combination of online and traditional distant education practices. The purpose of this paper is to propose a set of criteria for the evaluation of the educational process in blended e-learning communities. The systematic surveying and evaluation of the various parameters that affect the educational outcome is the primary aim of the quality assurance process. Existing evaluation methods provide general guidelines, which fail to cover the traditional distant education procedures (e.g. educational material, sporadic face-to-face meetings) that accompany e-learning activities. The key reason for the success of a blended e-learning approach is the balance between computer based and face-to-face interactions and the harmonic merge of the two. First, we review the …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Parallelization of large-scale Drug-Protein binding experiments",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8035078/",
            "Abstract": "Drug polypharmacology or “drug promiscuity” refers to the ability of a drug to bind multiple proteins. Such studies have huge impact to the pharmaceutical industry, but in the same time require large investments on wet-lab experiments. The respective in-silico experiments have a significantly smaller cost and minimize the expenses for the subsequent lab experiments. However, the process of finding similar protein targets for an existing drug, passes through protein structural similarity and is a highly demanding in computational resources task. In this work, we propose several algorithms that port the protein similarity task to a parallel high-performance computing environment. The differences in size and complexity of the examined protein structures raise several issues in a naive parallelization process that significantly affect the overall time and required memory. We describe several optimizations for better memory …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bridging XML-schema and relational databases: a system for generating and manipulating relational databases using valid XML documents",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/502187.502203",
            "Abstract": "Many organizations and enterprises establish distributed working environments, where different users need to exchange information based on a common model. XML is widely used to facilitate this information exchange. The extensibility of XML allows the creation of generic models that integrate data from different sources. For these tasks, several applications are used to import and export information in XML format from the data repositories. In order to support this process for relational repositories we developed the X-Database system. The base of this system is an XML-Schema file that describes the logical model of interchanged information. Initially, the system analyses the syntax of the XML-Schema file and generates the relational database. Then it handles the decomposition of valid XML files according to that Schema and the composition of XML documents from the information in the database. Finally the …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:u5HHmVD_uO8C",
            "Publisher": "ACM"
        },
        {
            "Title": "Word sense disambiguation as an integer linear programming problem",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30448-4_5",
            "Abstract": "We present an integer linear programming model of word sense disambiguation. Given a sentence, an inventory of possible senses per word, and a sense relatedness measure, the model assigns to the sentence’s word occurrences the senses that maximize the total pairwise sense relatedness. Experimental results show that our model, with two unsupervised sense relatedness measures, compares well against two other prominent unsupervised word sense disambiguation methods.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Scaling collaborative filtering to large–scale bipartite rating graphs using lenskit and spark",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7944922/",
            "Abstract": "Popular social networking applications such as Facebook, Twitter, Friendster, etc. generate very large graphs with different characteristics. These social networks are huge, comprising millions of nodes and edges that push existing graph mining algorithms and architectures to their limits. In product-rating graphs, users connect with each other and rate items in tandem. In such bipartite graphs users and items are the nodes and ratings are the edges and collaborative filtering algorithms use the edge information (i.e. user ratings for items) in order to suggest items of potential interest to users. Existing algorithms can hardly scale up to the size of the entire graph and require unlimited resources to finish. This work employs a machine learning method for predicting the performance of Collaborative Filtering algorithms using the structural features of the bipartite graphs. Using a fast graph partitioning algorithm and …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the applicability of 2d local binary patterns for identifying electrical appliances in non-intrusive load monitoring",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-55190-2_15",
            "Abstract": "In recent years, the automatic identification of electrical devices through their power consumption signals finds a variety of applications in smart home monitoring and non-intrusive load monitoring (NILM). This work proposes a novel appliance identification scheme and introduces a new feature extraction method that represents power signals in a 2D space, similar to images and then extracts their properties. In this context, the local binary pattern (LBP) and other variants are investigated on their ability to extract histograms of 2D binary patterns of power signals. Specifically, by moving to a 2D representation space, each power sample is surrounded by eight neighbors at least. This can help extracting pertinent characteristics and providing more possibilities to encode power signals robustly. Moreover, the proposed identification technique has the main advantage of accurately recognizing the electrical devices …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:q3CdL3IzO_QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Framework for Building Virtual Communities for Education. in proceedings of the First European Conference on Technology Enhanced Learning",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=2637962313535668054&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:gsN89kCJA0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Online federated learning with imbalanced class distribution",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3437120.3437282",
            "Abstract": "The federated learning paradigm can be a viable solution for handling huge datasets, and for taking advantage of powerful processing nodes on the edge. The process of online federated learning can be employed in order to maximise the potential of federated learning by re-training a shared model on the edge nodes and merging the updated models centrally. This approach allows edge nodes to exchange knowledge without exchanging their own training data, thus preserving their privacy. In this work, we examine the online federated learning approach in an extreme case of imbalanced class distribution between the central and the edge nodes. We examine the effects of different parameters of the online federated learning process and propose a technique that boosts the classification performance above that of the baseline centralised learning approach.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:GtLg2Ama23sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed virtual reality authoring interfaces for the www: The vr-shop case",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:MTAP.0000008657.07799.b0",
            "Abstract": "Electronic commerce is emerging as an important domain of integration and enhancement of more specific technologies and research efforts. It is clear that the role of WWW in this context is a cornerstone as the medium of information dissemination. A trend in e-commerce is to provide to the potential customers the ability to view and “try” the products in a persuasive 3D representation. We have designed and implemented a system for WWW enabled interactive design & visualization of a room, definition of pieces of furniture and placement of domestic appliances. The system conveys a generic approach for distributed creation and update of virtual worlds as means of interaction and information dissemination in an e-commerce context.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A framework for the detection of search and rescue patterns using shapelet classification",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/528262",
            "Abstract": "The problem of unmanned supervision of maritime areas has attracted the interest of researchers for the last few years, mainly thanks to the advances in vessel monitoring that the Automatic Identification System (AIS) has brought. Several frameworks and algorithms have been proposed for the management of vessel trajectory data, which focus on data compression, data clustering, classification and visualization, offering a wide variety of solutions from vessel monitoring to automatic detection of complex events. This work builds on our previous work in the topic of automatic detection of Search and Rescue (SAR) missions, by developing and evaluating a methodology for classifying the trajectories of vessels that possibly participate in such missions. The proposed solution takes advantage of a synthetic trajectory generator and a classifier that combines a genetic algorithm (GENDIS) for the extraction of informative shapelets from training data and a transformation to the shapelets’ feature space. Using the generator and several SAR patterns that are formally described in naval operations bibliography, it generates a synthetic dataset that is used to train the classifier. Evaluation on both synthetic and real data has very promising results and helped us to identify vessel SAR maneuvers without putting any effort into manual annotation. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Social recommendations for personalized fitness assistance",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s00779-017-1039-8",
            "Abstract": "Wearable technology allows users to monitor their activity and pursue a healthy lifestyle through the use of embedded sensors. Such wearables usually connect to a mobile application that allows them to set their profile and keep track of their goals. However, due to the relatively “high maintenance” of such applications, where a significant amount of user feedback is expected, users who are very busy, or not as self-motivated, stop using them after a while. It has been shown that accountability improves commitment to an exercise routine. In this work, we present the PRO-Fit framework, a personalized fitness assistant aiming at engaging users in fitness activities, incorporating a social element. The PRO-Fit architecture collects information from activity tracking devices and automatically classifies their activity type. Moreover, the framework incorporates a social recommender system. Using collaborative filtering …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:8AbLer7MMksC",
            "Publisher": "Springer London"
        },
        {
            "Title": "A Trust-Aware System for Personalized User Recommendations in Social Networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6549154/",
            "Abstract": "Social network analysis has recently gained a lot of interest because of the advent and the increasing popularity of social media, such as blogs, social networking applications, microblogging, or customer review sites. In this environment, trust is becoming an essential quality among user interactions and the recommendation for useful content and trustful users is crucial for all the members of the network. In this paper, we introduce a framework for handling trust in social networks, which is based on a reputation mechanism that captures the implicit and explicit connections between the network members, analyzes the semantics and dynamics of these connections, and provides personalized user recommendations to the network members.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using 3D worlds in an educational network",
            "Publication year": 2009,
            "Publication url": "http://users.ionio.gr/~agiannak/papers/giannakoulopoulos_0004_2009.pdf",
            "Abstract": "Based on their ability to represent reality in micro or macro scale, 3D representations have been extensively used as main or supporting educational tools. Researchers, educational institutes and organizations confirmed the usefulness of virtual environments as educational tools, either by developing 3D environments tailored to their needs, or by exploiting existing infrastructure and platforms. This paper presents how a general purpose 3D virtual environment can assist as an educational tool. More specifically, we describe the deployment of a course in a 3D virtual environment focusing on the technical aspects and on the required preparations. The outcomes of this work can be employed by researchers and educators, who plan to deliver their courses in a 3D virtual environment. Finally, this work can be scaled up to a virtual educational environment for the Greek University or School Networks.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel similarity measure for multiple aspect trajectory clustering",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3412841.3441935",
            "Abstract": "Multiple aspect trajectories (MATs) is an emerging concept in the domain of Geographical Information Systems, where the basic view of semantic trajectories is enhanced with the notion of multiple heterogeneous aspects, characterizing different semantic dimensions related to the pure movement data. Many applications benefit from the analysis of multiple aspects trajectories, ranging from the analysis of people trajectories and the extraction of daily habits to the monitoring of vessel trajectories and the detection of outlying behaviors. This work proposes a novel MAT similarity measure as the core component in a hierarchical clustering algorithm. Despite the many clustering methods in the literature and the recent works on MAT similarity, there are still no works that dig deeper into the MAT clustering task. The current article copes with this issue by introducing TraFoS, a new similarity measure that defines a novel …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:anf4URPfarAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality Assurance in Evidence-Based Medicine",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/health-systems-quality-reliability/46524",
            "Abstract": "Evidence-based medicine (EBM) refers to the careful examination of all the available evidence when making decisions about the care of the individual patient. It assumes that well known medical practices and solutions are combined with the patient’s preferences and necessities in order to provide the most appropriate solution per case. The abundance of medical information in the web, the expansion of Semantic Web and the evolution of search services allowed the easier retrieval of scientific articles. Although the available infrastructure exists and continuously improves in performance, EBM still remains a complicated and sensitive process of high importance and has a need for Quality Assurance (QA). The purpose of this chapter is twofold: first, to provide an introduction on the concepts of Evidence-based Medicine, and second, to stress the necessity for structured methodologies that will assure the quality of the …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:k_IJM867U9cC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "On the Effectiveness of Ancient Memory Techniques & Gaming in Virtual Learning Environments",
            "Publication year": 2021,
            "Publication url": "http://conference-eutic.org/wp-content/uploads/2021/10/Actes-2019-Eutic-A1-A3.pdf#page=276",
            "Abstract": "This paper focuses on the use of a combination of 3d virtual worlds as a learning tool and the effectiveness of classical memory techniques implemented in the virtual environment. The whole learning activity targets a biology topic from the official curriculum of Greek public secondary school. Unlike the physical environment, virtual worlds can provide equal learning opportunities for all participants. The use of spatial mnemonic techniques, such as the loci method, in an artificial environment creates equal conditions for memorization, as all participants navigate the same space. In order to achieve a better learning outcome, gamified learning activities were combined with memorization technique of loci. The evaluation showed that virtual classroom students outperformed the conventional classroom by 16%.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:dBIO0h50nwkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of social network metrics to a trust-aware collaborative model for generating personalized user recommendations",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-7091-1346-2_3",
            "Abstract": "Social network analysis has emerged as a key technique in modern sociology, but has recently gained a lot of interest in Web mining research, because of the advent and the increasing popularity of social media, such as blogs, social networks, micro-blogging, customer review sites etc. Such media often serve as platforms for information dissemination and product placement or promotion. One way to improve the quality of recommendations provided to the members of social networks is to use trustworthy resources. In this environment, community-based reputation can help estimating the trustworthiness of individual users. Consequently, influence and trust are becoming essential qualities among user interactions. In this work, we perform an extensive study of various metrics related to the aforementioned elements, and of their effect in the process of information propagation in social networks. In order to …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Springer"
        },
        {
            "Title": "Blending Distance Learning Platforms and 3D Virtual Learning Environments",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "\"I Want to ... Change\": Micro-moment based Recommendations can Change Users' Energy Habits",
            "Publication year": 2019,
            "Publication url": "https://www.scitepress.org/Papers/2019/76736/76736.pdf",
            "Abstract": "Since electricity consumption of households in developing countries is dramatically increasing every year, it is now more prudent than ever to utilize technology-based solutions that assist energy end-users to improve energy efficiency without affecting quality of life. User behavior is the most important factor that influences household energy consumption and recommender systems can be the technology enabler for shaping the users’ behavior towards energy efficiency. The current literature mostly focuses on energy usage monitoring and home automation and fails to engage and motivate users, who are not as committed and self-motivated. In this work, we present a context-aware recommender system that analyses user activities and understands their habits. Based on the output of this analysis, the system synchronizes with the user activities and presents personalized energy efficiency recommendations at the right moment and place. The recommendation algorithm considers user preferences, energy goals, and availability in order to maximize the acceptance of a recommended action and increase the efficiency of the recommender system. The results from the evaluation on a publicly available dataset comprising energy consumption data from multiple devices shows that micromoments repeatedly occur within user’s timeline (covering more than 35% of user future activities) and can be learned from user logs.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality of content in web 2.0 applications",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15393-8_5",
            "Abstract": "Nowadays, web users are facing a novel and dynamically changing environment, which promotes collaboration in content creation. In the web era, people usually neglected the quality of content, and had minimum authority on reporting good or bad content, whereas, in Web 2.0, content is becoming a priority and people become more critical when they assess its quality. In the former case, each web site had an identity, a single editor or a closed group of editors, who were responsible for content quality management and the stylistic design was the main quality standard for visitors. In the latter case, several applications and a new way of thinking have changed the workplace and created a new approach to quality management. Specifically, the team of editors is open to every web user, content is a collaborative product and the “embedded object” or “inline linking” model is gaining in popularity against …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The emergence of explainability of intelligent systems: Delivering explainable and personalized recommendations for energy efficiency",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/int.22314",
            "Abstract": "The recent advances in artificial intelligence namely in machine learning and deep learning, have boosted the performance of intelligent systems in several ways. This gave rise to human expectations, but also created the need for a deeper understanding of how intelligent systems think and decide. The concept of explainability appeared, in the extent of explaining the internal system mechanics in human terms. Recommendation systems are intelligent systems that support human decision making, and as such, they have to be explainable to increase user trust and improve the acceptance of recommendations. In this study, we focus on a context‐aware recommendation system for energy efficiency and develop a mechanism for explainable and persuasive recommendations, which are personalized to user preferences and habits. The persuasive facts either emphasize on the economical saving prospects (Econ) or …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wordrank: A method for ranking web pages based on content similarity",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4269822/",
            "Abstract": "This paper presents WordRank, a new page ranking system, which exploits similarity between interconnected pages. WordRank introduces the model of the 'biased surfer' which is based on the following assumption: \"the visitor of a Web page tends to visit Web pages with similar content rather than content irrelevant pages\". The algorithm modifies the random surfer model by biasing the probability of a user to follow a link in favor of links to pages with similar content. It is our intuition that WordRank is most appropriate in topic based searches, since it prioritizes strongly interconnected pages, and in the same time is more robust to the multitude of topics and to the noise produced by navigation links. This paper presents preliminary experimental evidence from a search engine we developed for the Greek fragment of the World Wide Web. For evaluation purposes, we introduce a new metric (SI score) which is based on …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A virtual tour in Ancient Worlds",
            "Publication year": 2019,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "https://avarts.ionio.gr/dcac/2019/gr/schedule/"
        },
        {
            "Title": "Mining potential research synergies from co-authorship graphs using power graph analysis",
            "Publication year": 2012,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWET.2012.048520",
            "Abstract": "Bibliographic databases are a prosperous field for data mining research and social network analysis. They contain rich information, which can be analysed across different dimensions (e.g., author, year, venue, and topic) and can be exploited in multiple ways. The representation and visualisation of bibliographic databases as graphs and the application of data mining techniques can help us uncover interesting knowledge concerning potential synergies between researchers, possible matchings between researchers and venues, candidate reviewers for a paper or even the ideal venue for presenting a research work. In this paper, we propose a novel representation model for bibliographic data, which combines co-authorship and content similarity information, and allows for the formation of scientific networks. Using a graph visualisation tool from the biological domain, we are able to provide comprehensive …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:70eg2SAEIzsC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Λειτουργικές και τεχνικές προσεγγίσεις για την ανάπτυξη Περιφερειακών Κέντρων Τηλεϊατρικής",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=1625215160311619675&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data analytics, automations, and micro-moment based recommendations for energy efficiency",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9179537/",
            "Abstract": "Energy conservation is a critical task for domestic households and office buildings, mainly because of the shortage of energy resources and the uprising contemporary environmental issues. The development of an IoT ecosystem that monitors energy consumption habits and timely recommends actions to promote energy efficiency can be beneficial for the mainstream. In this work, we present the EM3 project, which combines data collection, information abstraction, timed recommendations for saving actions and automations that promote energy saving in a household or office setup. The article focuses on the data and information processing aspects of the EM3 solution, which efficiently handles thousands of sensor events on a daily basis and provides useful analytics and recommendations to the end user to support habit change.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:ruyezt5ZtCIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Decentralization of the Greek National Telemedicine System",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/healthcare-information-systems-informatics/22128",
            "Abstract": "The demographic and geographic dispersion of Greece necessitates the adoption of telemedicine solutions in order to reduce patient transportation and waiting time. A centralized Telemedicine model proves insufficient to support the multitude of islands and other isolated areas of Greek mainland. This work records and analyzes the shortcomings and difficulties of the existing Greek Telemedicine system and suggests a more flexible, decentralized model, which upgrades the Regional Telemedicine Centers into mid-range providers of Telemedicine services. This reduces the burden of the central telemedicine unit, reduces reaction time in the offering of primary care without loosing in efficiency in more serious incidents. In this context, we list the necessary actions at technical, operational and organizational level for the smooth transition to a new system, as well as the advantages of this new structure. The binding …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Joseph Tan"
        },
        {
            "Title": "Web document searching using enhanced hyperlink semantics based on XML",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/938069/",
            "Abstract": "We present a system that aims at increasing the flexibility and accuracy of information retrieval tasks in the World Wide Web. The system offers extended searching capabilities by enriching information related to hyperlinks between documents. It offers to document authors the ability to attach additional information to hyperlinks and also provides suggestions on the information to be attached. In an effort to increase the integrity of hyperlink information, a conversion module extracts, from the pages, metadata concerning the linked documents as well as the link itself. The hyperlink metadata is appended to the original document metadata and an XML document is created. Another module allows the end users to query the XML-document base, taking advantage of the enhanced hyperlink information. We present an overview of the system and the solutions it provides in problems found to similar approaches.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Πληροφοριακά Συστήµατα Υγείας, 3η έκδοση",
            "Publication year": 2016,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:LO7wyVUgiFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Detecting Aggressive Behavior in Discussion Threads Using Text Mining",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-77116-8_31",
            "Abstract": "The detection of aggressive behavior in online discussion communities is of great interest, due to the large number of users, especially of young age, who are frequently exposed to such behaviors in social networks. Research on cyberbullying prevention focuses on the detection of potentially harmful messages and the development of intelligent systems for the identification of verbal aggressiveness expressed with insults and threats. Text mining techniques are among the most promising tools used so far in the field of aggressive sentiments detection in short texts, such as comments, reviews, tweets etc. This article presents a novel approach which employs sentiment analysis at message level, but considers the whole communication thread (i.e., users discussions) as the context of the aggressive behavior. The suggested approach is able to detect aggressive, inappropriate or antisocial behavior, under …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Simulating appliance-based power consumption records for energy efficiency awareness",
            "Publication year": 2019,
            "Publication url": "http://www.energy-proceedings.org/wp-content/uploads/2020/03/1021_Paper_0705045412.pdf",
            "Abstract": "The collection and analysis of big data has become a ubiquitous process in numerous fields, including energy efficiency. The combination of smart meters that provide high-frequency readings of consumption and enhanced data analytics have enabled studies to uncover energy usage patterns of households. However, an accurate understanding of consumer behavior requires a more comprehensive approach. Henceforth, we present a novel data simulator that generates appliance-based datasets based on real data. By proper fusion of real smart meter data and periodic energy consumption habits, which are represented by micro-moments, we were able to simulate realistic domestic energy consumption scenarios. Pre-processing the aggregated readings and the application of a k-means clustering algorithm, user actions were detected (switch on/off) per appliance. Based on these records and using a apriori itemset extraction algorithm we obtained appliance usage patterns. A minute-averaged dataset was simulated for three rooms and nine appliances, monitored for a 47-month period. We managed to extract frequent usage patterns at appliance-level, taking into account contextual parameters such as room occupancy. Moreover, the simulated datasets can be expanded to any size to a variety of energy saving applications such as micro-moment classification and goal-based recommender systems for energy saving.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantically driven snippet selection for supporting focused web searches",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X08001365",
            "Abstract": "Millions of people access the plentiful web content to locate information that is of interest to them. Searching is the primary web access method for many users. During search, the users visit a web search engine and use an interface to specify a query (typically comprising a few keywords) that best describes their information need. Upon query issuing, the engine’s retrieval modules identify a set of potentially relevant pages in the engine’s index, and return them to the users, ordered in a way that reflects the pages’ relevance to the query keywords. Currently, all major search engines display search results as a ranked list of URLs (pointing to the relevant pages’ physical location on the web) accompanied by the returned pages’ titles and small text fragments that summarize the context of search keywords. Such text fragments are widely known as snippets and they serve towards offering a glimpse to the returned pages …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:_FxGoFyzp5QC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Ποιότητα στην ανταλλαγή δεδομένων μεταξύ πληροφοριακών συστημάτων στην υγεία",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=13320184704413893951&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Work-related musculoskeletal disorders among greek hospital nursing professionals: A cross-sectional observational study",
            "Publication year": 2018,
            "Publication url": "https://content.iospress.com/articles/work/wor182812",
            "Abstract": "BACKGROUND:The serious shortages of nurses are related to increased risk for musculoskeletal disorders during work. The complexity of patient care places nurses at high-risk for injury and high in the list of occupations with risk for work-related musculoskeletal disorders (WMSD).OBJECTIVE:The current study evaluated the association of personal, professional and health factors with the development of WMSD in the nursing staff of hospitals in the capital of Greece.METHODS:The study was conducted online with 394 nurses (age: 37.85±7.48 years (mean±SD), 19.54% male and 80.46% female) using a questionnaire based on the Nordic Musculoskeletal Questionnaire, and comparatively examined WMSD across nurses.RESULTS:The prevalence of musculoskeletal disorders in general was 98%, with symptoms reported for the waist (85.3%), neck (71.2%) and back (70.7%). The risk for WMSD was higher for …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:N5tVd3kTz84C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "SEWeP: using site semantics and a taxonomy to enhance the Web personalization process",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/956750.956765",
            "Abstract": "Web personalization is the process of customizing a Web site to the needs of each specific user or set of users, taking advantage of the knowledge acquired through the analysis of the user's navigational behavior. Integrating usage data with content, structure or user profile data enhances the results of the personalization process. In this paper, we present SEWeP, a system that makes use of both the usage logs and the semantics of a Web site's content in order to personalize it. Web content is semantically annotated using a conceptual hierarchy (taxonomy). We introduce C-logs, an extended form of Web usage logs that encapsulates knowledge derived from the link semantics. C-logs are used as input to the Web usage mining process, resulting in a broader yet semantically focused set of recommendations.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Classification of movement data concerning user's activity recognition via mobile phones",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2611040.2611062",
            "Abstract": "Smartphones are becoming a powerful platform for event recognition due to the number of sensors they are equipped with. This provides an opportunity to apply data mining techniques on movement data in order to recognize people's daily activities without changing their routine. In this paper, we present a methodology for collecting and analysing user activity information with a smartphone application. This information can be further exploited in various applications ranging from m-health (eg fitness application) and transportation (eg user driving habits detection) to m-commerce (eg shopping recommendations). In order to demonstrate this methodology, we have developed GPSTracker a prototype application for Android phones, which collects position, speed, altitude and time information and performs real-time classification of user's movement. The processed information is collected in a private user folder, on a …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Binary Classification Techniques: An Application on Simulated and Real Bio‐medical Data",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781119721871.ch8",
            "Abstract": "This chapter investigates the performance of classification techniques for discrete variables associated with binomial outcomes. It presents various classification techniques based on multivariate indices and on machine learning methods, and evaluates their distinctive ability by using simulated data as well as real Greek medical data. The chapter assesses classification techniques by using criteria such as the area under the receiver operating characteristic curve, sensitivity and specificity. It evaluates the classification techniques’ predictability as well as their results’ statistical significance by using Monte Carlo cross‐validation. Conclusively, the chapter proposes methods for the selection of an effective diagnostic method by using suitable classification methods or weighted indices in relation to the health data nature such as those derived from psychological diseases, nutritional adequacy and so on.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:p__nRnzSRKYC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Temporal classifiers for predicting the expansion of medical subject headings",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-37247-6_9",
            "Abstract": "Ontologies such as the Medical Subject Headings (MeSH) and the Gene Ontology (GO) play a major role in biology and medicine since they facilitate data integration and the consistent exchange of information between different entities. They can also be used to index and annotate data and literature, thus enabling efficient search and analysis. Unfortunately, maintaining the ontologies manually is a complex, error-prone, and time and personnel-consuming effort. One major problem is the continuous growth of the biomedical literature, which expands by almost 1 million new scientific papers per year, indexed by Medline. The enormous annual increase of scientific publications constitutes the task of monitoring and following the changes and trends in the biomedical domain extremely difficult. For this purpose, approaches that try to learn and maintain ontologies automatically from text and data have been …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "SAT-290-Association of liver inflammation and fibrosis score with noninvasive biomarkers in non-alcoholic fatty liver disease: Preliminary results from the MAST4HEALTH study",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=2396950214197255860&hl=en&oi=scholarr",
            "Abstract": "oncology, Milan, Italy; 10Institute of Clinical Physiology National Research Council, Pisa and Milan, Italy; 11 EU Horizon 2020, Brussels, Belgium Email:[email protected] Background and aims: LiverMultiScan is a non-invasive diagnostic tool which uses multiparametric Magnetic Resonance Imaging to characterize liver tissue. It provides accurate measurements of% Proton Density Fat Fraction (PDFF) and tissue T1-relaxation time, corrected for liver iron (cT1), standardized as the Liver Inflammation and Fibrosis score (LIF). The aim herein was to elucidate the relationship between LiverMultiScan parameters and biochemical and anthropometric markers in a European NAFLD cohort recruited for the MAST4HEALTH study (http://www. mast4health. eu/en/). Method: We recruited 110 overweight/obese patients (69% males) from three independent cohorts (Greece, Italy, Serbia). Serum lipids, liver enzymes, glucose …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Detection of physical strain and fatigue in industrial environments using visual and non-visual sensors",
            "Publication year": 2021,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Papoutsakis/publication/351838538_Detection_of_physical_strain_and_fatigue_in_industrial_environments_using_visual_and_non-visual_sensors/links/60acb20092851ca9dce23226/Detection-of-physical-strain-and-fatigue-in-industrial-environments-using-visual-and-non-visual-sensors.pdf",
            "Abstract": "sustAGE is an ongoing project, developing an Internet of Things ecosystem, including smartphones, smartwatches, environmental sensors and cameras to support elderly workers in industrial environments, such a car manufacturing factory. In this context, we briefly describe non-obtrusive method for assessing the physical strain of workers using visual data and a method for detecting worker fatigue using heart rate data. The results of both methods are utilized by the recommendation system developed in sustAGE to support preventive actions towards work-related musculo-skeletal dis-orders and mental fatigue and to promote occupational safety.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Survey of UAS Technologies to Enable Beyond Visual Line Of Sight (BVLOS) Operations.",
            "Publication year": 2021,
            "Publication url": "https://www.scitepress.org/Papers/2021/104469/104469.pdf",
            "Abstract": "Latest trends, societal needs and technological advances have led to an unparalleled expansion in the use of Unmanned Aerial Systems (UAS) for versatile civilian and military applications, ranging from simple everyday operations, to the supervision in construction sites, even logistics, among others. Unmanned Aerial Vehicles (UAVs), widely known as drones, are the main components of UAS, and are becoming increasingly popular in such operations, since they reduce costs, they facilitate activities and can increase the granularity of surveillance or delivery. Furthermore, they can pave new ways for the implementation of smart-sensing and navigation functionalities, support automation, safety of operations, prognostics and even forensic analyses. Being an emerging technology, several challenges still need to be tackled in order to make UAS suitable for real-world applications, which impose strict performance, dependability and privacy requirements. In the light of the above, this paper provides an in depth survey of current UAS technologies for Beyond the Visual Line of Sight (BVLOS) UAS operations and highlight the main technological challenges and requirements that arise. We also focus on the emerging and future BVLOS UAS features and the technological advances that render their expansion in various industrial sectors promising.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey of recommender systems for energy efficiency in buildings: Principles, challenges and prospects",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1566253521000178",
            "Abstract": "Recommender systems have significantly developed in recent years in parallel with the witnessed advancements in both internet of things (IoT) and artificial intelligence (AI) technologies. Accordingly, as a consequence of IoT and AI, multiple forms of data are incorporated in these systems, e.g. social, implicit, local and personal information, which can help in improving recommender systems’ performance and widen their applicability to traverse different disciplines. On the other side, energy efficiency in the building sector is becoming a hot research topic, in which recommender systems play a major role by promoting energy saving behavior and reducing carbon emissions. However, the deployment of the recommendation frameworks in buildings still needs more investigations to identify the current challenges and issues, where their solutions are the keys to enable the pervasiveness of research findings, and …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:kh2fBNsKQNwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Visualizing bibliographic databases as graphs and mining potential research synergies",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5992585/",
            "Abstract": "Bibliographic databases are a prosperous field for data mining research and social network analysis. They contain rich information, which can be analyzed across different dimensions(e.g., author, year, venue, topic) and can be exploited in multiple ways. The representation and visualization of bibliographic databases as graphs and the application of data mining techniques can help us uncover interesting knowledge concerning potential synergies between researchers, possible matchings between researchers and venues, or even the ideal venue for presenting a research work. In this paper, we propose a novel representation model for bibliographic data, which combines co-authorship and content similarity information, and allows for the formation of scientific networks. Using a graph visualization tool from the biological domain, we are able to provide comprehensive visualizations that help us uncover hidden …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Text relatedness based on a word thesaurus",
            "Publication year": 2010,
            "Publication url": "https://www.jair.org/index.php/jair/article/view/10636",
            "Abstract": "The computation of relatedness between two fragments of text in an automated manner requires taking into account a wide range of factors pertaining to the meaning the two fragments convey, and the pairwise relations between their words. Without doubt, a measure of relatedness between text segments must take into account both the lexical and the semantic relatedness between words. Such a measure that captures well both aspects of text relatedness may help in many tasks, such as text retrieval, classification and clustering. In this paper we present a new approach for measuring the semantic relatedness between words based on their implicit semantic links. The approach exploits only a word thesaurus in order to devise implicit semantic links between words. Based on this approach, we introduce Omiotis, a new measure of semantic relatedness between texts which capitalizes on the word-to-word semantic relatedness measure (SR) and extends it to measure the relatedness between texts. We gradually validate our method: we first evaluate the performance of the semantic relatedness measure between individual words, covering word-to-word similarity and relatedness, synonym identification and word analogy; then, we proceed with evaluating the performance of our method in measuring text-to-text semantic relatedness in two tasks, namely sentence-to-sentence similarity and paraphrase recognition. Experimental evaluation shows that the proposed method outperforms every lexicon-based method of semantic relatedness in the selected tasks and the used data sets, and competes well against corpus-based and hybrid approaches.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Certification and security in health-related web applications",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/48592851/Certification_and_security_in_health-rel20160905-17050-1sev17o.pdf",
            "Abstract": "Healthcare web applications bring together medical experts and patients in a digital space where patients share their personal data and doctors provide consultation and diagnosis. A critical requirement for the success of a web application for healthcare is to be trusted from all participants. In order to build trust, the application should guarantee security, confidentiality, and reliability for people, data and processes. The medical profile of patients must be protected from unauthorized access and the medical advice should come from experts only. Information exchanged between any two parties should be transferred securely, should be preserved for future use and processed in accordance to predefined procedures that take into account all ethical and legal restrictions. All the above state the need for a strict policy-based mechanism, which defines roles, access rights and limitations on information access and a flexible identification mechanism, which allows anonymity of patients, and guarantees the truthfulness of doctors' identity and expertise. This work presents a holistic approach on certification and security in health related web-applications with emphasis on standards, protocols and procedures.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Blog rating as an iterative collaborative process",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11684-1_11",
            "Abstract": "The blogosphere is a part of the World Wide Web, enhanced with several characteristics that differentiate blogs from traditional websites. The number of different authors, the multitude of user-provided tags, the inherent connectivity between blogs and bloggers, the high update rate, and the time information attached to each post are some of the features that can be exploited in various information retrieval tasks in the blogosphere. Traditional search engines perform poorly on blogs since they do not cover these aspects. In an attempt to exploit these features and assist any specialized blog search engine to provide a better ranking of blogs, we propose a rating mechanism, which capitalizes on the hyperlinks between blogs. The model assumes that the intention of a blog owner who creates a link to another blog is to provide a recommendation to the blog readers, and quantifies this intention in a score …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Smart energy usage and visualization based on micro-moments",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-29513-4_41",
            "Abstract": "Due to global energy demands and overwhelming environmental dilemmas, exorbitant domestic energy usage is a colossal barrier towards energy efficiency. Tremendous research efforts have been poured into a plethora of methods for behavioral change. However, there is an expanse of opportunity to capitalize on evidence-based, technology-enabled energy efficiency solutions. Therefore, we present a novel application that effectively visualizes domestic energy data, presents meaningful and simplified benchmarks pertaining the efficiency of the end-user’s usage, and contextually presents micro-moment based recommendations for better energy efficiency. The solution is part of a larger Consumer Engagement Towards Energy Saving Behavior by means of Exploiting Micro Moments and Mobile Recommendation Systems (EM)3 platform. Simulated and real energy data tests signifies the premise of the …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:fEOibwPWpKIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A security model for virtual healthcare communities",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-3634-8_5",
            "Abstract": "Virtual healthcare communities aim in bringing together healthcare professionals and patients in order to further improve the quality of healthcare services and assist healthcare professionals and researchers in their everyday activities. Patient monitoring and medical consultation – the two most popular activities inside virtual healthcare communities – require members’ collaboration in a secure and reliable environment. In this environment, patients share their medical data with doctors, expect confidentiality, and demand reliable medical consultation. Apart from a concrete policy framework, several ethical, legal, and technical issues must be considered in order to build a trustful community. This work presents the architecture of a virtual healthcare community portal, giving emphasis on the security issues that arise when attempting to manage risk inside such a community. Following a standardized risk …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Evaluation of virtual learning communities for supporting e-learning in the healthcare domain",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/48592853/Evaluation_of_Virtual_Learning_Communiti20160905-17050-87woo6.pdf",
            "Abstract": "E-learning enables the learner to decide what to learn, when, how and how fast. In a learning community, due to interaction the output knowledge is bigger than the sum of knowledge of its participants. Virtual Learning Communities (VLCs), combining the benefits of e-learning and collaborative learning, provide flexible and promising ways of education, training and collaboration among people working in healthcare and others involved in it. A key factor for the success of a VLC is not only the skills of its members but the whole learning process. Consequently an evaluation of this process is needed in order to have successful VLCs. Influenced by the e-Learning Maturity Model, this paper attempts to introduce a framework for the evaluation of VLCs. The framework consists of 4 categories with a total of 18 individual criteria which can be objectively assessed using a Likert scale. Formal evaluation of the framework in practice is necessary to determine its merits and any drawbacks.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The future of intelligent transport systems",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=0WPRDwAAQBAJ&oi=fnd&pg=PR1&dq=info:OF8quOKcMFYJ:scholar.google.com&ots=g8xvLNKeMQ&sig=P9lux6t88U39qOhaiFVOC1ojV80",
            "Abstract": "The Future of Intelligent Transport Systems considers ITS from three perspectives: users, business models and regulation/policy. Topics cover in-vehicle applications, such as autonomous driving, vehicle-to-vehicle/vehicle-to-infrastructure communication, and related applications, such as personalized mobility. The book also examines ITS technology enablers, such as sensing technologies, wireless communication, computational technology, user behavior as part of the transportation chain, financial models that influence ITS, regulations, policies and standards affecting ITS, and the future of ITS applications. Users will find a holistic approach to the most recent technological advances and the future spectrum of mobility. Systematically presents the whole spectrum of next generation Intelligent Transport Systems (ITS) technologies Integrates coverage of personalized mobility and digital assistants, big data analytics and autonomous driving Includes end-of-chapter, open-ended questions that trigger thinking on the technological, managerial and regulatory aspects of ITS",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Blogrank: ranking weblogs based on connectivity and similarity features",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1190183.1190193",
            "Abstract": "A large part of the hidden web resides in weblog servers; traditional search engines perform poorly on blogs. We present a method for ranking weblogs utilizing both link graph and similarity, and based on an enhanced and weighted graph of weblogs capturing crucial weblog features. Rankings are then assigned using our algorithm, BlogRank, which is a modified version of PageRank. To validate our method we ran experiments on a weblog dataset, processed and adapted to our search engine: http://spiderwave. aueb. gr/BlogwaveOur experiments suggest that our algorithm enhances the quality of returned results.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Large scale opinion mining for social, news and blog data",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121216300814",
            "Abstract": "Companies that collect and analyze data from social media, news and other data streams are faced with several challenges that concern storage and processing of huge amounts of data. When they want to serve the processed information to their customers and moreover, when they want to cover different information needs for each customer, they need solutions that process data in near real time in order to gain insights on the data in motion. The volume and volatility of opinionated data that is published in social media, in combination with the variety of data sources has created a demanding ecosystem for stream processing. Although, there are several solutions that can handle information of static nature and small volume quite efficiently, they usually do not scale up properly because of their high complexity. Moreover, such solutions have been designed to run once or to run in a fixed dataset and they are not …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:u9iWguZQMMsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Success Index: Measuring the efficiency of search engines using implicit user feedback",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/31054483/79e415075429a96cd9.pdf",
            "Abstract": "The problem of characterizing web content and evaluating search engine results in terms of relevance to the user’s intention has been an important issue in web research. Despite the large number of manually categorized web query datasets, which can be used for testing and tuning ranking algorithms, the evaluation problem remains unsolved because of the size of the web, the diversity of the query space, and the subjective nature of user satisfaction. In this paper we study Success Index (SI), a method for evaluating the quality of ranking algorithms. Success Index takes into account a user’s clickthrough data, and provides an evaluation of ranking. Through extensive user blind tests we show that the results of Success Index compare favorably to those of an explicit evaluation. We also review other existing implicit evaluation techniques and summarize the features that can be exploited for evaluating ranking.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An intelligent system for retrieval and mining of audiovisual material based on the MPEG-7 description schemes",
            "Publication year": 2001,
            "Publication url": "http://www.image.ntua.gr/iva/files/An%20Intelligent%20System%20for%20Retrieval%20and%20Mining%20of%20Audiovisual%20Material%20Based%20on%20the%20MPEG-7%20Description%20Schemes%20-%20G.%20Akrivas2001.pdf",
            "Abstract": "A system for digitization, storage and retrieval of audiovisual information and its associated data (metainfo) is presented. The principles of the evolving MPEG-7 standard have been adopted for the creation of the data model used by the system, permitting efficient separation of database des ign, content description, business logic and presentation of query results. XML Schema is used in defining the data model and XML in describing audiovisual content. Issues regarding problems that emerged during system design and their solutions are discussed, such as customization, deviations from the standard MPEG-7 DSs or even the design of entirely custom DSs. Although the system includes modules for digitization, annotation, archiving and intelligent data mining, the paper mainly focuses on the use of MPEG-7 as the information model.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring the Dominance of the English Language on the Websites of EU Countries",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/698026",
            "Abstract": "The English language is the most dominant language in the Western world and its influence can be noticed in every aspect of human communication. It’s increasing diffusion, especially since the turn of the century, is hard to measure with conventional means. The present research studies the use of language in websites of European Union (EU) member states, in order to collect data about the prevalence of the English language in the different countries and regions of the European Union. To achieve a realistic representation of today’s landscape of the European Web, this study uses a vast population of websites and a representative sampling size and methodology. By analyzing and processing the findings from over 100,000 websites from every country in the EU, a solid foundation is set that is used to explore the dominance of the English language in the European World Wide Web in general. This is the first study that examines the presence of English content in the websites of all EU member countries and provides statistical evidence regarding the ratio of English content availability for each country. Conclusively, the results of the research demonstrate that the English language is available on more than one quarter of all websites of non-English speaking EU member states. Moreover, it is available in the vast majority of multilingual and bilingual websites, while at the same time being the only language that is available in a number of monolingual websites. In addition, it is shown preference over the national language in a significant number of cases. A moderate negative correlation is found between a member state’s population and the …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:vbGhcppDl1QC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Security and trust in virtual healthcare communities",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1579114.1579186",
            "Abstract": "The main purpose of a virtual healthcare community is to enforce members' collaboration and allow them collectively conduct health care activities. Patient monitoring and medical consultation and support are the most popular activities inside health care communities. They bring together medical experts and patients and require confidentiality, reliability and trust in order to be successful. An examination of existing virtual communities for healthcare leads to the conclusion that many of them fail to meet requirements for building trust. Several ethical, legal and technical issues must be considered in order to build a trustful community. This work presents the architecture of a virtual healthcare community portal with emphasis on the issues that help building trust inside the community. With a set of hypothetical usage scenarios that challenge trust in the community we uncover healthcare community's pitfalls and illustrate …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Strand: scalable trilateration with Node. js",
            "Publication year": 2019,
            "Publication url": "https://journalofcloudcomputing.springeropen.com/articles/10.1186/s13677-019-0142-y",
            "Abstract": "This work reports on the development details and results of an experimental setup for the localization of the attendants of a music festival. The application had to be reporting in real-time the asymmetric crowd density based on the Received Signal Strength Indicator (RSSI) between the attendants’ smartphones and an experimental installation of 24 WiFi access points. The impermanent nature of the application led to the implementation of a cloud-based solution, called “STRAND”. STRAND is based on Node.js components, which communicate through websockets, collect, process and exchange data and continuously report the produced information to the end-user. To cope with the near real-time requirements, and the volatility of the crowd concentration density, STRAND horizontally scales the trilateration component, i.e. the component that estimates the user location based on distance measurements. STRAND was tested during the festival days in July 2018 and the results show a system that copes with very high loads and achieves the temporal and accuracy requirements the were set.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:9Nmd_mFXekcC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "PaloPro: a platform for knowledge extraction from big social data and the news",
            "Publication year": 2017,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJBDI.2017.081185",
            "Abstract": "PaloPro is a platform that aggregates textual content from social media and news sites in different languages, analyses them using a series of text mining algorithms and provides advanced analytics to journalists and social media marketers. The platform capitalises on the abundance of social media sources and the information they provide for persons, products and events. In order to handle huge amounts of multilingual data that are collected continuously, we have adopted language independent techniques at all levels and from an engineering point of view, we have designed a system that takes advantage of parallel distributed computing technologies and cloud infrastructure. Different systems handle data aggregation, data processing and knowledge extraction and others deal with the integration and visualisation of knowledge. In this paper, we focus on two important text mining tasks, named entity recognition …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:08ZZubdj9fEC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "THESUS: Organizing Web document collections based on link semantics",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1007/s00778-003-0100-6",
            "Abstract": "The requirements for effective search and management of the WWW are stronger than ever. Currently Web documents are classified based on their content not taking into account the fact that these documents are connected to each other by links. We claim that a page’s classification is enriched by the detection of its incoming links’ semantics. This would enable effective browsing and enhance the validity of search results in the WWW context. Another aspect that is underaddressed and strictly related to the tasks of browsing and searching is the similarity of documents at the semantic level. The above observations lead us to the adoption of a hierarchy of concepts (ontology) and a thesaurus to exploit links and provide a better characterization of Web documents. The enhancement of document characterization makes operations such as clustering and labeling very interesting. To this end, we devised a …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A Framework for Monitoring the Unsupervised Educational Process and Adapting the Content and Activities to Students' Needs",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11581116_13",
            "Abstract": "The growth of internet and the evolution of supporting infrastructures motivated universities and other educational institutions to adopt new teaching methods. These unsupervised methods are focused on the dissemination of the educational material and the evaluation of the users through tests and activities. The user behavior is not monitored and the performance of users cannot be reasoned in most cases. We strongly believe that the monitoring and analysis of the users’ behavior in a distance course may help on improving the course plan and the quality of the reading material. In this direction we define the framework for an unsupervised educational process that combines reading material and examinations and monitors the user performance throughout the educational process. We detail on how this framework can be implemented using web technologies, thus creating a web-based educational …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Achieving domestic energy efficiency using micro-moments and intelligent recommendations",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8959214/",
            "Abstract": "Excessive domestic energy usage is an impediment towards energy efficiency. Developing countries are expected to witness an unprecedented rise in domestic electricity in the forthcoming decades. A large amount of research has been directed towards behavioral change for energy efficiency. Thus, it is prudent to develop an intelligent system that combines the proper use of technology with behavior change research in order to sustainably transform end-user behavior at a large scale. This paper presents an overview of our AI-based energy efficiency framework for domestic applications and explains how micro-moments can provide an accurate understanding of user behavior and lead to more effective recommendations. Micro-moments are short-term events at which an energy-saving recommendation is presented to the consumer. They are detected using a variety of sensing modules placed at prominent …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:epqYDVWIO7EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recommender systems for large-scale social networks: A review of challenges and solutions",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X17319684",
            "Abstract": "Social networks have become very important for networking, communications, and content sharing. Social networking applications generate a huge amount of data on a daily basis and social networks constitute a growing field of research, because of the heterogeneity of data and structures formed in them, and their size and dynamics. When this wealth of data is leveraged by recommender systems, the resulting coupling can help address interesting problems related to social engagement, member recruitment, and friend recommendations.In this work we review the various facets of large-scale social recommender systems, summarizing the challenges and interesting problems and discussing some of the solutions.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "SemanticRank: ranking keywords and sentences using semantic graphs",
            "Publication year": 2010,
            "Publication url": "https://www.aclweb.org/anthology/C10-1121.pdf",
            "Abstract": "The selection of the most descriptive terms or passages from text is crucial for several tasNs, such as feature extraction and summaY rization. In the majority of the cases, reY search worNs propose the ranNing of all canY didate Neywords or sentences and then seY lect the topYranNed items as features, or as a text summary respectively. RanNing is usuY ally performed using statistical information from text (ie, frequency of occurrence, inY verse document frequency, coYoccurrence inY formation). In this paper we present SemanticRank, a graphYbased ranNing algorithm for Neyword and sentence extraction from text. The algorithm constructs a semantic graph usY ing implicit linNs, which are based on semanY tic relatedness between text nodes and conY sequently ranNs nodes using different ranNing algorithms. Comparative evaluation against related state of the art methods for Neyword and sentence extraction shows that SemanticRank performs favorably in previously used data sets.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey on the scalability of recommender systems for social networks",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-90059-9_5",
            "Abstract": "It is typical among online social networks’ users to share their status, activity and other information with fellow users, to interact on the information shared by others and to express their trust or interest for each other. The result is a rich information repository which can be used to improve the user experience and increase their engagement if handled properly. In order to create a personalized user experience in social networks, we need data management solutions that scale well on the huge amounts of information generated on a daily basis. The social information of an online social network can be useful both for improving content personalization but also for allowing existing algorithms to scale to huge datasets. All current real-world large-scale recommender systems have invested on scalable distributed database systems for data storage and parallel and distributed algorithms for finding recommendations …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A distributed framework for extracting maritime traffic patterns",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13658816.2020.1792914",
            "Abstract": "All the modern surveillance systems take advantage of the Automatic Identification System (AIS), a compulsory tracking system for many types of vessels. Ships that carry AIS transponders on board transmit their position and status in order to alert nearby vessels and ground stations, but this information can well be used to identify events of interest and support decision making. The detection of anomalies (i.e. unexpected sailing behavior) in vessels’ trajectories is such an event, which is of utmost importance. Approaches for detecting such anomalies vary from extracting normality models to searching for individual cases, such as AIS switch-off or collision avoidance maneuvers. The current research work follows the former method; it employs sparse historic AIS data and polynomial interpolation in order to extract shipping lanes. It modifies the DB-Scan clustering algorithm in order to achieve more coherent trajectory …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:Dip1O2bNi0gC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "The iMPROVE Study; Design, Dietary Patterns, and Development of a Lifestyle Index in Overweight and Obese Greek Adults",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2072-6643/13/10/3495",
            "Abstract": "Background: Dietary and lifestyle habits constitute a significant contributing factor in the formation of anthropometric and biochemical characteristics of overweight and obese populations. The iMPROVE study recruited overweight and obese Greek adults and investigated the effect of gene–diet interactions on weight management when adhering to a six-month, randomized nutritional trial including two hypocaloric diets of different macronutrient content. The present paper displays the design of the intervention and the baseline findings of the participants’ dietary habits and their baseline anthropometric and biochemical characteristics. Methods: Baseline available data for 202 participants were analyzed and patterns were extracted via principal component analysis (PCA) on 69-item Food-Frequency Questionnaires (FFQ). Relationships with indices at baseline were investigated by multivariate linear regressions. A Lifestyle Index of five variables was further constructed. Results: PCA provided 5 dietary patterns. The “Mixed” pattern displayed positive associations with logBMI and logVisceral fat, whereas the “Traditional, vegetarian-alike” pattern was nominally, negatively associated with body and visceral fat, but positively associated with HDL levels. The Lifestyle Index displayed protective effects in the formation of logBMI and logGlucose levels. Conclusions: Dietary patterns and a Lifestyle Index in overweight and obese, Greek adults highlighted associations between diet, lifestyle, and anthropometric and biochemical indices.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:9c2xU6iGI7YC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Increased Content Accessibility For Wikis And Blogs.",
            "Publication year": 2009,
            "Publication url": "https://core.ac.uk/download/pdf/301352272.pdf",
            "Abstract": "This paper aims to introduce a useful approach on the combined use of template based publishing tools (ie for blogs and wikis) and content personalization services. The approach considers that the original developers of web content have limited awareness on accessibility issues, and they are facilitated and guided by the editing interface. The publishing mechanism is responsible for storing web content in a flexible representation, where structured content is separated from the formatting information. Intermediate brokering services (ie aggregators, mediators or simply the portal software) produce multiple versions of the same content in order to increase content accessibility. Finally, end-users are able to set their preferences on how the content will be presented and get a homogeneous representation of the community content. The different versions may comprise multiple languages, audio and text representations etc and be based on a single version of the original content. The structured nature of content produced by template based tools allows intermediate services to intervene and reproduce the original content in various formats and client tools to filter and present information according to user needs and capabilities. The paper presents the focal points of the suggested approach, details on the underlying architecture and presents the required supporting infrastructure.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Community Detection Using Power Graph Analysis",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2064730.2064738",
            "Abstract": "Understanding the structure of complex networks and uncovering the properties of their constituents has been for many decades at the center of study of several fundamental sciences, such as discrete mathematics and graph theory. Especially during the previous decade, we have witnessed an explosion in complex network data, with two cornerstone paradigms being the biological networks and the social networks. The large scale, but also the complexity, of these types of networks constitutes the need for efficient graph mining algorithms. In both examples, one of the most important tasks is to identify closely connected network components comprising nodes that share similar properties. In the case of biological networks, this could mean the identification of proteins that bind together to carry their biological function, while in the social networks, this can be seen as the identification of communities. Motivated by this …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:j3f4tGmQtD8C",
            "Publisher": "ACM New York, NY, USA"
        },
        {
            "Title": "A tool for the visualisation of public opinion",
            "Publication year": 2013,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJEG.2013.058404",
            "Abstract": "The rise in popularity of the web and social media has significantly changed the way voters communicate and form their opinions. National governments are also affected by the hype of social media, so they launch new debate tools and open social platforms where citizens are able to communicate, collaborate and exchange opinions. When the amount of opinions increases, then it becomes difficult to process and interpret them manually. In this case, opinion–mining techniques and information visualisation tools can be employed to depict the public opinion and give comprehensive visual summaries. In this work, we present an information visualisation tool for surveys, which allows users to select from a variety of graphs, drill down to selected periods or roll–up to a larger scale and supports input from both closed–end and open–end questions. In the latter case, the tool employs opinion–mining techniques to …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:a0OBvERweLwC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Academic Excellence, Website Quality, SEO Performance: Is there a Correlation?",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/576384",
            "Abstract": "The academic excellence of universities around the globe has always been a matter of extended study and so has the quality of an institution’s presence in the World Wide Web. The purpose of this research is to study the extent to which a university’s academic excellence is related to the quality of its web presence. In order to achieve this, a method was devised that quantified the website quality and search engine optimization (SEO) performance of the university websites of the top 100 universities in the Academic Ranking of World Universities (ARWU) Shanghai list. A variety of tools was employed to measure and test each website and produced a Web quality ranking, an SEO performance ranking, as well as a combined overall web ranking for each one. Comparing these rankings with the ARWU shows that academic excellence is moderately correlated with website quality, but SEO performance is not. Moreover, the overall web ranking also shows a moderate correlation with ARWU which seems to be positively influenced by website quality and negatively by SEO performance. Conclusively, the results of the research indicate that universities place particular emphasis on issues concerning website quality, while the utilization of SEO does not appear to be of equal importance, indicating possible room for improvement in this area. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Using Social Data for Personalizing Review Rankings",
            "Publication year": 2014,
            "Publication url": "https://dit.hua.gr/~varlamis/Varlamis-papers/C68.pdf",
            "Abstract": "Almost all users look at online ratings and reviews before buying a product, visiting a business, or using a service. These reviews are independent, authored by other users, and thus may convey useful information to the end user. Reviews usually have an overall rating, but most of the times there are sub-texts in the review body that describe certain features/aspects of the product. The majority of web sites rank these reviews either by date, or by overall “helpfulness”. However, different users look for different qualities in a product/business/service. In this work, we try to address this problem by proposing a system that creates personalized rankings of these reviews, tailored to each individual user. We discuss how social data, ratings, and reviews can be combined to create this personalized experience. We present our work-in-progress using the Yelp Challenge dataset and discuss some first findings regarding implementation and scalability.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self-supportive virtual communities",
            "Publication year": 2010,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWBC.2010.030016",
            "Abstract": "Web-based learning communities allow individuals to improve their skills and knowledge, while offering global distribution of participants and asynchronous participation. Although flexible and distributed, the learning process in such communities is still unidirectional from professors to students. In virtual communities that relate to healthcare, learning and personal improvement is a collaborative process and actions are patient-centric. This work introduces the notion of 'self-supportive virtual communities' – which combine the merits of 'communities of practice' and 'learning communities' and capitalise on the virtual community infrastructures in order to support collaboration of all healthcare participants (i.e., care providers, caregivers and care consumers). This paper discusses the dimensions of the self-supportive community, illustrates the main issues for the transition to the new type of community and summarises the …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:qUcmZB5y_30C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Photo Sharing and Privacy on Facebook",
            "Publication year": 2012,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time personalised energy saving recommendations",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9291639/",
            "Abstract": "The increased consumption of energy worldwide has boosted the interest of people for energy-efficient solutions at every level of daily life, from goods production and transportation to the use of household and office appliances. This gave rise to monitoring applications that monitor the daily user interaction with the electrical and electronic appliances, detect unnecessary or extensive usage and recommend corrective actions. In this direction, this work presents the anatomy of the Consumer Engagement Towards Energy Saving Behavior by means of Exploiting Micro Moments and Mobile Recommendation Systems (EM) 3  recommendation engine, which supports household and office users with real-time personalized recommendations for avoiding unnecessary energy consumption and reducing the overall household (or office) energy footprint. The recommendation engine is based on a set of sensors that monitor …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:PVjk1bu6vJQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A distributed architecture for large scale news and social media processing",
            "Publication year": 2020,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWET.2020.114029",
            "Abstract": "When designing a data processing and analytics pipeline for data streams, it is important to provide the data load and be able to successfully balance it over the available resources. This can be achieved more easily if small processing modules, which require limited resources, replace large monolithic processing software. In this work, we present the case of a social media and news analytics platform, called PaloAnalytics, which performs a series of content aggregation, information extraction (e.g., NER, sentiment tagging, etc.) and visualisation tasks in a large amount of data, on a daily basis. We demonstrate the architecture of the platform that relies on micro-modules and message-oriented middleware for delivering distributed content processing. Early results show that the proposed architecture can easily stand the increased content load that occasionally occurs in social media (e.g., when a major event takes …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:FAceZFleit8C",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "BLOGRANK: Ranking on the blogosphere.",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.475.1238&rep=rep1&type=pdf",
            "Abstract": "Although, the Blogosphere is part of the World Wide Web, weblogs present several features that differentiate them from traditional websites: the number of different editors, the multitude of topics, the connectivity among weblogs and bloggers, the update rate, and the importance of time in rating are some of them. Traditional search engines perform poorly on blogs since they do not cover these aspects. We propose an extension of Pagerank, which analyses and extends the link graph, in an attempt to exploit some of the weblog features. The analysis of the weblogs’ link graph is based on the assumption that the visitor of a weblog tends to visit relevant or affiliated weblogs. Our algorithm, BlogRank, models the similarity between weblogs by incorporating information on common users, links and topics and generates a global ranking for all weblogs in a set. To validate our method we ran experiments on a weblog dataset, processed and adapted to our search engine: http://spiderwave. aueb. gr/blogwave",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PRO-Fit: Exercise with friends",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7752437/",
            "Abstract": "The advancements in wearable technology, where embedded accelerometers, gyroscopes and other sensors enable the users to actively monitor their activity have made it easier for individuals to pursue a healthy lifestyle. However, most of the existing applications expect continuous commitment from the end users, who need to proactively interact with the application in order to connect with friends and attain their goals. These applications fail to engage and motivate users who have busy schedules, or are not as committed and self-motivated. In this work, we present PRO-Fit, a personalized fitness assistant application that employs machine learning and recommendation algorithms in order to smartly track and identify user's activity, synchronizes with the user's calendar, recommends personalized workout sessions based on the user's preferences, fitness goals, and availability. Moreover, PRO-Fit integrates with …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The use of 3D virtual learning environments in the learning process",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=16396103172976273290&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The present and future of standards for e-learning technologies",
            "Publication year": 2006,
            "Publication url": "https://www.learntechlib.org/p/44814/",
            "Abstract": "This paper studies the e-learning technologies from the standardization aspect with a glimpse on future changes. Our aim is to thoroughly review the existing standards, the e-Learning process workflow and the market needs and trends and indicate the best path for achieving a global standard for e-learning activities. The generic model of e-learning is presented without emphasis on specific software and hardware solutions. We focus on the major necessities like reusability or interoperability of content and technologies and revise the current standards regarding these two aspects. The most popular infrastructure models are presented in details and the related committees and organizations involved in the standardization process are referenced. As an epilogue to this presentation we provide our insights for a global standard, which will cover all aspects of e-learning and will be supported by all related organizations …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Informing Science Institute"
        },
        {
            "Title": "A Graph-based Text Similarity Measure That Employs Named Entity Information",
            "Publication year": 2017,
            "Publication url": "https://acl-bg.org/proceedings/2017/RANLP%202017/pdf/RANLP098.pdf",
            "Abstract": "Text comparison is an interesting though hard task, with many applications in Natural Language Processing. This work introduces a new text-similarity measure, which employs named-entities’ information extracted from the texts and the ngram graphs’ model for representing documents. Using OpenCalais as a namedentity recognition service and the JINSECT toolkit for constructing and managing n-gram graphs, the text similarity measure is embedded in a text clustering algorithm (k-Means). The evaluation of the produced clusters with various clustering validity metrics shows that the extraction of named entities at a first step can be profitable for the time-performance of similarity measures that are based on the n-gram graph representation without affecting the overall performance of the NLP task.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:bnK-pcrLprsC",
            "Publisher": "https://doi.org/10.26615/978-954-452-049-6_098"
        },
        {
            "Title": "MONITORING EVOLUTION IN HEALTHCARE DOMAIN",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/31054434/C11.pdf",
            "Abstract": "Healthcare is a highly evolving domain, which attracts the interest of both researchers and practitioners. In such an evolving area, new trends appear daily and older standards become out of fashion very fast. The paper presents a methodology for seizing knowledge from rich information sources of the healthcare domain and processing it in order to improve the domain understanding for organizations and individuals. To achieve that, we suggest the development of technologies for systematically & automatically updating, dynamic knowledge maps of healthcare domain. These maps will act as advanced business intelligence support for market, products & technology watch and will represent a novel knowledge management practice (technology evolution assessment). The methodology may lead to a knowledge management platform for the intelligent monitoring, planning, forecasting of technological evolution in highly dynamic domains. Doctors, researchers and healthcare organizations that utilise the platform will achieve state-of-the-art awareness in research and development and will increase competitiveness in their domain.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ηλεκτρονικές κοινότητες μάθησης",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=5630610393256079924&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:uWiczbcajpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Use of health-related indices and classification methods in medical data",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128180044000029",
            "Abstract": "Measurement in biological and medical scientific fields is a very important issue because a biomedical decision concerning the health status of a patient is based on a valid measurement. Health-related indices provide a reliable way of measuring a person’s behavioral or clinical health in an accurate and reliable way. From a mathematical perspective, health-related indices are quantitative variables composed by component variables, namely features that represent different aspects of a health status aiming to evaluate clinical behaviors or behavioral characteristics. A variety of statistical multidimensional techniques with sufficient performance can be used for the valid classification of individuals as healthy or nonhealthy, apart from using health-related indices. More specifically, several modified statistical classification methods, such as logistic regression, classification and regression tree, neural networks, and data …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Construction de classes de documents web",
            "Publication year": 2003,
            "Publication url": "https://abiteboul.com/gemoReports/GemoReport-304.pdf",
            "Abstract": "In this paper, we introduce a novel similarity measure between documents, such as web documents, that can be characterized by a small set of concepts, that each belong to a hierarchy (ontology). We use this measure with a slightly modified DB-SCAN clustering algorithm in order to construct clusters of semantically related documents. We also give experimental results that illustrate the quality of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "X-Database: A middleware for collaborative video annotation, storage and retrieval",
            "Publication year": 2001,
            "Publication url": "http://www.image.ece.ntua.gr/papers/181.pdf",
            "Abstract": "Organising audiovisual content is a hard task for companies that own huge amounts of video information, such as television stations, studios, advertisement companies etc. The retrieval and re-use of useful information become unfeasible when the size of video information increases on a daily basis. The Panorama platform has been developed to cover such needs for manipulating video information, by attaching meta-information for both audio and visual content of video sources. This paper presents this meta-information model and the database interface developed in terms of the Panorama platform. The model works as keystone in the creation of the database and the database interface implements a mechanism for converting XML documents to relational data.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building navigation networks from multi-vessel trajectory data",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10707-020-00421-y",
            "Abstract": "Building a rich and informative model from raw data is a hard but valuable process with many applications. Ship routing and scheduling are two essential operations in the maritime industry that can save a lot of resources if they are optimally designed, but still, need a lot of information to be successful. Past and recent works in the field assume the availability of information such as the birth time-windows, cargo volumes, and container handling productivity at ports and cruising speed. They employ navigation maps that contain information about the major sailing paths and have knowledge about bigger or smaller ports and offshore platforms. In this work, we present a methodology for extracting information about the navigation network for an area, using data from the trajectories of multiple vessels, which are collected using the Automatic Identification System (AIS). We introduce a method for identifying the …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:foquWX3nUaYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Rehab-c: Recommendations for energy habits change",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X19317327",
            "Abstract": "This paper introduces REHAB-C, a goal-based context-aware recommendation system that supports users in transforming their energy habits. A combination of smart sensors and actuators collects information about user actions and their context and evaluates the actions to be proposed. Based on user decisions, REHAB-C either triggers an energy saving action, postpones or cancels it and records user preferences. The recommendation system continuously evaluates the user context and action against a rule base along with user goals and prioritizes the recommended actions, also considering other user preferences. The prototype implementation of REHAB-C is evaluated on two real-world scenarios, in an office setup. The user actions and presence are recorded for four weeks, as well as the user behavior towards energy saving, and his preferences on the recommended actions. The analysis of recorded …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:hMsQuOkrut0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Dependable Integration Concepts for Human-Centric AI-Based Systems",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-83906-2_1",
            "Abstract": "The rising demand for adaptive, cloud-based and AI-based systems is calling for an upgrade of the associated dependability concepts. That demands instantiation of dependability-orientated processes and methods to cover the whole life cycle. However, a common solution is not in sight yet That is especially evident for continuously learning AI and/or dynamic runtime-based approaches. This work focuses on engineering methods and design patterns that support the development of dependable AI-based autonomous systems. The emphasis on the human-centric aspect leverages users’ physiological, emotional, and cognitive state for the adaptation and optimisation of autonomous applications. We present the related body of knowledge of the TEACHING project and several automotive domain regulation activities and industrial working groups. We also consider the dependable architectural concepts and …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:mlAyqtXpCwEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Use of social media by healthcare professionals in Greece: an exploratory study",
            "Publication year": 2012,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJEH.2012.049873",
            "Abstract": "The continuously and rapidly changing landscape in the fields of communications, Internet and social media make it imperative for professionals to better understand the role of Information and Communication Technologies and their impact on everyday activities. Several frameworks have been proposed in order to capture various dimensions of social media and measure their impact on people's social, professional and other activities. The effect of social media and Web 2.0 applications on the healthcare sector is also significant. This paper examines Greek healthcare professionals' attitudes towards internet, social media and mobile technologies, explores their familiarity with social networks and associates their answers with their professional profile. The results of this exploratory study are discussed within the context of the growing international relevant literature.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Detecting Search and Rescue missions from AIS data",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8402020/",
            "Abstract": "The crossing of the Mediterranean by refugees has turned to be an extremely perilous activity. Human operators that handle Search and Rescue (SAR) missions need all the help they can muster in order to timely discover and assist in the coordination of the operations. In this work we present a tool that automatically detects SAR missions in the sea, by employing Automatic Identification System (AIS) data streams. The approach defines three steps to be taken: a) trajectory compression for affordable real time analysis in the presence of big data; b) detection of sub-operations to which a SAR mission is actually decomposed, and; c) synthesis of multiple vessels' inferred behavior to determine an ongoing SAR mission and its details. The evaluation results are promising showing that AIS data carry highly valuable information even in the absence of any other type of data that could make the problem easier (e.g. coast …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An automatic wrapper generation process for large scale crawling of news websites",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2645791.2645824",
            "Abstract": "The creation and maintenance of a large-scale news content aggregator is a tedious task, which requires more than a simple RSS aggregator. Many news sites appear every day on the Internet, providing new content in different refresh rates; well established news sites restrict access to their content only to subscribers or online readers, without offering RSS feeds, whereas other sites update their CMS or website tem-plate and lead crawlers to fetch errors. The main problem that arises from this continuous generation and alteration of pages on the Internet is the automated discovery of the appropriate and useful content and the dynamic rules that crawlers need to apply in order not to become outdated. In this paper we present an innovative mechanism for extracting useful content (title, body and media) from news articles web pages, based on automatic extraction of patterns that form each domain. The system is …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ζητήματα λειτουργίας και διαχείρισης Δυνητικών Κοινοτήτων",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Kleidarithmos"
        },
        {
            "Title": "The effect of gamification in 3D virtual learning environments",
            "Publication year": 2012,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:5qfkUJPXOUwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A study on social network metrics and their application in trust networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5562776/",
            "Abstract": "Social network analysis has recently gained a lot of interest because of the advent and the increasing popularity of social media, such as blogs, social networks, micro logging, or customer review sites. Such media often serve as platforms for information dissemination and product placement or promotion. In this environment, influence and trust are becoming essential qualities among user interactions. In this work, we perform an extensive study of various metrics related to the aforementioned elements, and their effect in the process of information propagation in the virtual world. In order to better understand the properties of links and the dynamics of social networks, we distinguish between permanent and transient links and in the latter case, we consider the link freshness. Moreover, we distinguish between local and global influence and compare suggestions provided by locally or globally trusted users.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimizing parallel collaborative filtering approaches for improving recommendation systems performance",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/452524",
            "Abstract": "Recommender systems are one of the fields of information filtering systems that have attracted great research interest during the past several decades and have been utilized in a large variety of applications, from commercial e-shops to social networks and product review sites. Since the applicability of these applications is constantly increasing, the size of the graphs that represent their users and support their functionality increases too. Over the last several years, different approaches have been proposed to deal with the problem of scalability of recommender systems’ algorithms, especially of the group of Collaborative Filtering (CF) algorithms. This article studies the problem of CF algorithms’ parallelization under the prism of graph sparsity, and proposes solutions that may improve the prediction performance of parallel implementations without strongly affecting their time efficiency. We evaluated the proposed approach on a bipartite product-rating network using an implementation on Apache Spark. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Certification and Security in Health-Related Web Applications: Concepts and Solutions: Concepts and Solutions",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=0g5dqE8BfGUC&oi=fnd&pg=PR1&dq=info:goK33yZeLlMJ:scholar.google.com&ots=uHMbCLeL_t&sig=2YwQG6SdGlvGmqyt4OGAU4R6-D8",
            "Abstract": "Health-related Web applications have provided advanced services, such as telemedicine, to patients and doctors. However, with the creation of these applications has come the need to record, process and store medical information by following standard and lawful procedures, to protect medical data from unauthorized access, and to ensure continuity and constant availability of healthcare services. Certification and Security in Health-Related Web Applications: Concepts and Solutions aims to bridge the worlds of healthcare and information technology, increase the security awareness of professionals, students and users and highlight the recent advances in certification and security in health-related Web applications.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:XiVPGOgt02cC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Document clustering as a record linkage problem",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3209280.3229109",
            "Abstract": "This work examines document clustering as a record linkage problem, focusing on named-entities and frequent terms, using several vector and graph-based document representation methods and k-means clustering with different similarity measures. The JedAI Record Linkage toolkit is employed for most of the record linkage pipeline tasks (ie preprocessing, scalable feature representation, blocking and clustering) and the OpenCalais platform for entity extraction. The resulting clusters are evaluated with multiple clustering quality metrics. The experiments show very good clustering results and significant speedups in the clustering process, which indicates the suitability of both the record linkage formulation and the JedAI toolkit for improving the scalability for large-scale document clustering tasks.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A versatile package recommendation framework aiming at preference score maximization",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s12530-018-9231-2",
            "Abstract": "Package recommendation systems have gained in popularity especially in the tourism domain, where they propose combinations of different types of attractions that can be visited by someone during a city tour. These systems can also be applied in suggesting home entertainment, proper nutrition or academic courses. Such systems must optimize multiple user criteria in tandem, such as preference score, package cost or duration. This work proposes a flexible framework for recommending packages that best fit users’ preferences while satisfying several constraints on the set of the valid packages. This is achieved by modeling the relation between the items and the categories these items belong to, aiming at recommending to each user the top-k packages that cover their preferred categories and the restriction of a maximum package cost. Our contribution includes an optimal and a greedy algorithm, that both …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "The role of micro-moments: A survey of habitual behavior change and recommender systems for energy saving",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8673323/",
            "Abstract": "Among the large number of efforts that study the role of technology in energy saving, there exists, first, frameworks for monitoring and controlling energy consumption in households, second, systems that suggest best practices to users and energy providers, and third, findings that focus on the motivations that trigger a behavioral change toward energy efficiency. However, there is still no work that builds on the habitual behavior change of individuals and the use of technology for this purpose. In this paper, we survey the literature that aims at understanding the behavior of energy consumers and then changing it by recommending energy-saving activities. We build on the concept of “micro-moments” and the “habit loop” theory to explain how we can gradually change user routines by targeting those specific moments where the proper recommendation and a small but instant reward can be more effective in shaping a …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Utilising an Educational Framework for the Development of Edutainment Scenarios",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=pK8HBAAAQBAJ&oi=fnd&pg=PA145&dq=info:x7tcfa-6fpsJ:scholar.google.com&ots=117BDjk0R9&sig=TLk9dUO6pvEgD8nI4dd21S9jo2I",
            "Abstract": "Edutainment may be considered a developing contemporary research field particularly as new and open source game development environments are made available to the research community. Nevertheless, most edutainment scenarios are usually limited in terms of interactivity, design and aesthetics, a fact that may be attributed to the task complexity, which requires an integrated approach addressing all related fields. This work introduces a conceptual/operational framework for the development of edutainment scenarios, which is both game-based and rich-media oriented. The proposed framework, which for the main part must be considered an educational effort, combines theoretical background-within the fields of human-computer communication, interaction/educational design and entertainment studies-and practical solutions and techniques regarding software and digital games development, for the creation of custom edutainment scenarios. These abstract and more or less theoretical scenarios due to the seamless embodiment of technical practices may be easily developed as fully fledged products, be them games, applications or any kind of digital media that provide the unified service of education and entertainment. In such a case the end product (a digital system) permits the user to interact with the environment in a game-like manner, which enhances learnability and contributes to knowledge acquirement as the underlying objective. The framework, although not a rigid one but rather subjected to ad hoc adjustments, consists of well-defined stages, which include modern educational theories and state-ofthe-art development …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:RGFaLdJalmkC",
            "Publisher": "Academic Publishing International"
        },
        {
            "Title": "Towards a personalized blog site recommendation system: a collaborative rating approach",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5381709/",
            "Abstract": "The blogosphere is a part of the Web, enhanced with several characteristics that differentiate blogs from traditional websites. The number of different authors, the multitude of user-provided tags, the inherent connectivity between blogs and bloggers, the high update rate, and the time information attached to each post are some of the features that can be exploited in various information retrieval tasks. Traditional search engines perform poorly on blogs since they do not cover these aspects. In an attempt to exploit these features, this paper proposes a personalized recommendation model, which capitalizes on a collaborative rating mechanism that exploits the hyperlinks between blogs. The model assumes that the intention of a blog owner who creates a link to another blog is to provide a recommendation to the blog readers and quantifies this intention in a local score for the blog being pointed. A set of implicit and …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Use of virtual communities for the welfare of groups with particular needs",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Iraklis-Varlamis/publication/221905253_Use_of_virtual_communities_for_the_welfare_of_groups_with_particular_needs/links/09e41507542a6dc67d000000/Use-of-virtual-communities-for-the-welfare-of-groups-with-particular-needs.pdf",
            "Abstract": "The growth of scientific, technological and technical knowledge has enhanced the ability to provide fast, precise communication of information, and effective support for patients with complex or chronic medical problems. One technique by which this can be achieved is through the development of communities of practice. This concept was conceived over 15 years ago and refers to the process of social learning that occurs when people who have a common interest in some subject or problem collaborate over an extended period to share ideas, find solutions, and build innovations. Applied to healthcare this technique can be used to bring together patients, their families, doctors and nurses into self-supportive communities, where doctors disseminate their scientific knowledge, nurses provide practical advice and families exchange empirical knowledge. The approach exploits the merits of the internet and extends group-therapy in two ways:(i) universal (distant) membership,(ii) asynchronous consultations and support. In this paper we describe the structure, roles and services of self-supportive “web communities of patients”.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "City ‘R Us: A City Reporting application used for improving Urban Services",
            "Publication year": 2016,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:hCrLmN-GePgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self supportive virtual communities in the service of patients",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:mB3voiENLucC",
            "Publisher": "IADIS"
        },
        {
            "Title": "Mining frequent generalized patterns for Web personalization",
            "Publication year": 2008,
            "Publication url": "https://www.dit.hua.gr/~varlamis/Varlamis-papers/C30.pdf",
            "Abstract": "In this paper we present FGP, an algorithm that combines the powers of an association rule mining algorithm (FP-Growth) and a generalized pattern mining algorithm (GP-Close) in order to efficiently generate rules from transaction data. Our Frequent Generalized Pattern (FGP) algorithm considers that all items that appear in a set of transactions, belong to categories organized in a taxonomy. It takes as input the transaction database and the taxonomy of categories and produces generalized association rules that contain transaction items and/or item categories. This algorithm is particularly useful for personalizing web sites with continuously updated content, such as, blog aggregators, or news portals. In this context, the transaction database contains user click-stream information and the hierarchy of item types is a thematic taxonomy of web pages. The algorithm generates frequent itemsets comprising of both web pages and categories. The results are used to generate association rules and consequently recommendations for the users. We experimentally evaluate the proposed algorithm using web log data collected from a newspaper web site.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A package recommendation framework based on collaborative filtering and preference score maximization",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-65172-9_40",
            "Abstract": "The popularity of recommendation systems has made them a substantial component of many applications and projects. This work proposes a framework for package recommendations that try to meet users’ preferences as much as possible through the satisfaction of several criteria. This is achieved by modeling the relation between the items and the categories these items belong to aiming to recommend to each user the top-k packages which cover their preferred categories and the restriction of a maximum package cost. Our contribution includes an optimal and a greedy solution. The novelty of the optimal solution is that it combines the collaborative filtering predictions with a graph based model to produce recommendations. The problem is expressed through a minimum cost flow network and is solved by integer linear programming. The greedy solution performs with a low computational complexity and …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Thesus: Organising web document collections based on semantics and clustering",
            "Publication year": 2002,
            "Publication url": "https://abiteboul.com/gemoReports/GemoReport-230.ps",
            "Abstract": "The requirements for effective search and management of the WWW content are stronger than ever. Document retrieval in the WWW is problematic with regards to three aspects: i. Not taking adequately into account link semantics for characterizing documents ii. Basing document similarity on binary",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Technical Report"
        },
        {
            "Title": "An Intelligent System for Archiving and Retrieval of Audiovisual Material Based on the MPEG-7 Description Schemes",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/3246594/C4.pdf",
            "Abstract": "A system for digitization, storage and retrieval of audiovisual information and its associated data (metainfo) is presented. The principles of the evolving MPEG-7 standard have been adopted for the creation the data model used by the system, permitting efficient separation of database design, content description, business logic and presentation of query results. XML Schema is used in defining the data model, and XML in describing audiovisual content. Issues regarding problems that emerged during system design and their solutions are discussed, such as customization, deviations from the standard MPEG-7 DSs or even the design of entirely custom DSs. Although the system includes modules for digitization, annotation, archiving and intelligent data mining, the paper mainly focuses on the use of MPEG-7 as the information model.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effect of Mastiha Supplementation on NAFLD: The MAST4HEALTH Randomised, Controlled Trial",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mnfr.202001178",
            "Abstract": "Nonalcoholic fatty liver disease (NAFLD) is the most common liver disease with poor therapeutic strategies. Mastiha possesses antioxidant/anti‐inflammatory and lipid‐lowering properties. The authors investigate the effectiveness of Mastiha as a nonpharmacological intervention in NAFLD.Ninety‐eight patients with NAFLD in three countries (Greece, Italy, Serbia) are randomly allocated to either Mastiha or Placebo for 6 months, as part of a multicenter, randomized, double‐blind, placebo‐controlled, parallel‐group clinical trial. The authors assess NAFLD severity via magnetic resonance imaging (MRI) scanning and LiverMultiScan technique and evaluate the effectiveness of Mastiha through medical, anthropometric, biochemical, metabolomic, and microbiota assessment. Mastiha is not superior to Placebo on changes in iron‐corrected T1 (cT1) and Liver Inflammation Fibrosis score …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:9pM33mqn1YgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sustainable work through technology-assisted enhancement of cognitive abilities of older employees: the sustAGE approach.",
            "Publication year": 2021,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0041-1731984",
            "Abstract": "Purpose Cognitive ageing may impair the ability of older employees to remain in the workforce. The interdisciplinary EU-project sustAGE draws upon digital technology trends to support older workers by providing guidance for health-promoting activities in and outside the working context. One of sustAGE’s objectives is the enhancement of age-affected cognitive abilities through targeted training interventions. A combination of personalized recommendations and corresponding cognitive trainings in form of digital serious games serves this purpose. Three interlinked steps are necessary for implementing the sustAGE approach: base-line assessment of cognitive abilities of potential groups of users; derivation and implementation of user-specific recommendations; and development and evaluation of training. The first step within sustAGE development included an empirical assessment of cognitive abilities from a …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:OTTXONDVkokC",
            "Publisher": "Georg Thieme Verlag KG"
        },
        {
            "Title": "Querying and Updating XML with XML Schema constraints in an RDBMS",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Iraklis-Varlamis/publication/228722276_Querying_and_Updating_XML_with_XML_Schema_constraints_in_an_RDBMS/links/09e415075429ad26a9000000/Querying-and-Updating-XML-with-XML-Schema-constraints-in-an-RDBMS.pdf",
            "Abstract": "The increasing need of a variety of applications to store and process XML data has led to the development of systems and techniques for XML storage and querying. XML updating hasn’t received a corresponding amount of attention. We discuss XPURS, a system of processing XPath queries and updates on XML Schema-compliant XML data. XPURS updates respect XML ordering and XML Schema typing constraints, and especially type inheritance and polymorphism. XPURS employs an innovative shredding scheme for storing XML data into a relational database management system. We report on preliminary performance measurements using the XBench benchmark.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:maZDTaKrznsC",
            "Publisher": "τεχνική αναφορά (technical report)"
        },
        {
            "Title": "Extracting user habits from Google maps history logs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8508442/",
            "Abstract": "The exponential growth in the usage of smart devices, such as smartphones, interconnected wearables etc., creates a huge amount of information to manage and many research and business opportunities. Such smart devices become a useful tool for user movement recognition, since they are equipped with different types of sensors and processors that can process sensor data and extract useful knowledge. Taking advantage of the GPS sensor, they can collect the timestamped geographical coordinates of the user, which can then be used to extract the geographical location and movement of the user. Our work, takes this analysis one step ahead and attempts to identify the user's behavior and habits, based on the analysis of user's location data. This type of information can be valuable for many other domains such as Recommender Systems, targeted/personalized advertising etc. In this paper, we present a …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:ye4kPcJQO24C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Malnutrition in older adults: Correlations with social, diet-related, and neuropsychological factors",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0899900719302230",
            "Abstract": "The number of older adults is increasing rapidly. Malnutrition is a major problem in this age group, which may adversely affect health and quality of life. Several physiological, socioeconomic, and neuropsychological factors can lead to malnutrition.The aim of this study was to evaluate the nutritional status of community-dwelling older adults, and explore the associations of malnutrition risk with physiological, socioeconomic, and neuropsychological characteristics.This study is part of the Hellenic Longitudinal Investigation of Aging and Diet study, a cross-sectional observational study in Greece, and study participants were 1831 urban-dwelling elderly individuals (mean age: 73.1 ± 5.9 y; 40.8% men). Risk for malnutrition was assessed with the Determine Your Nutritional Health checklist. Data on age, sex, level of education, marital status, depression, cognitive performance, body mass …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:ipzZ9siozwsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "SemaFor: Semantic Document Indexing using Semantic Forests",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2396761.2398499",
            "Abstract": "Traditional document indexing techniques store documents using easily accessible representations, such as inverted indices, which can efficiently scale for large document sets. These structures offer scalable and efficient solutions in text document management tasks, though, they omit the cornerstone of the documents' purpose: meaning. They also neglect semantic relations that bind terms into coherent fragments of text that convey messages. When semantic representations are employed, the documents are mapped to the space of concepts and the similarity measures are adapted appropriately to better fit the retrieval tasks. However, these methods can be slow both at indexing and retrieval time. In this paper we propose SemaFor, an indexing algorithm for text documents, which uses semantic spanning forests constructed from lexical resources, like Wikipedia, and WordNet, and spectral graph theory in order to …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Graph matching on social networks without any side information",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9006158/",
            "Abstract": "Graph matching is an important yet difficult task with many applications in bioinformatics, where it uncovers hidden relationships between species, network security, where it can be used for network de-anonymization, and computer vision, where it solves correspondence problems. When no side information is available, any graph matching algorithm must rely only on the structural information of the two input graphs in order to compute a mapping between the two node sets. One of the most scalable approaches for graph matching uses ideas from percolation theory, where already matched pairs ”infect” other neighbouring pairs. In the absence of any side information, such algorithms expect from the user to provide an initial set of pairs, the seeds, from which the percolation can start. In this paper, we propose DiNoiSe, a new distributed percolation graph matching algorithm, which employs the structural information of …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating entity linking with Wikipedia",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=11484849239573587924&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:MLfJN-KU85MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reducing energy waste in households through real-time recommendations",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3383313.3412212",
            "Abstract": "The energy consumption of households has steadily increased over the last couple of decades. Research suggests that user behavior is the most influential factor in the energy waste of a household. Thus, there’sa need for helping consumers change their behavior to make it more energy efficient and environment friendly. In this work we propose a real-time recommender system that assists consumers in improving their household’s energy usage. By monitoring the power demand of each appliance in the household, the system detects the device status (on/off) at any moment, and using pattern mining creates a household profile comprising energy consumption patterns for different periods of the day. An intuitive UI allows users to set energy consumption goals and preferences on the appliances they’d like to save energy from. Based on the household profile, the user’s preferences and the actual power demand …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:XoXfffV-tXoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An experimental study on unsupervised graph-based word sense disambiguation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12116-6_16",
            "Abstract": "Recent research works on unsupervised word sense disambiguation report an increase in performance, which reduces their handicap from the respective supervised approaches for the same task. Among the latest state of the art methods, those that use semantic graphs reported the best results. Such methods create a graph comprising the words to be disambiguated and their corresponding candidate senses. The graph is expanded by adding semantic edges and nodes from a thesaurus. The selection of the most appropriate sense per word occurrence is then made through the use of graph processing algorithms that offer a degree of importance among the graph vertices. In this paper we experimentally investigate the performance of such methods. We additionally evaluate a new method, which is based on a recently introduced algorithm for computing similarity between graph vertices, P-Rank. We …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Pythia: Employing lexical and semantic features for sentiment analysis",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44845-8_32",
            "Abstract": "Sentiment analysis methods aim at identifying the polarity of a piece of text, e.g., passage, review, snippet, by analyzing lexical features at the level of the terms or the sentences. However, many of the previous works do not utilize features that can offer a deeper understanding of the text, e.g., negation phrases. In this work we demonstrate a novel piece of software, namely PYTHIA1, which combines semantic and lexical features at the term and sentence level and integrates them into machine learning models in order to predict the polarity of the input text. Experimental evaluation of PYTHIA in a benchmark movie reviews dataset shows that the suggested combination performs favorably against previous related methods. An online demo is publicly available at                                         http://omiotis.hua.gr/pythia                                                       .",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "TipMe: Personalized advertising and aspect-based opinion mining for users and businesses",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "To click or not to click? The role of contextualized and user-centric web snippets",
            "Publication year": 2009,
            "Publication url": "https://arxiv.org/abs/0903.2544",
            "Abstract": "When searching the web, it is often possible that there are too many results available for ambiguous queries. Text snippets, extracted from the retrieved pages, are an indicator of the pages' usefulness to the query intention and can be used to focus the scope of search results. In this paper, we propose a novel method for automatically extracting web page snippets that are highly relevant to the query intention and expressive of the pages' entire content. We show that the usage of semantics, as a basis for focused retrieval, produces high quality text snippet suggestions. The snippets delivered by our method are significantly better in terms of retrieval performance compared to those derived using the pages' statistical content. Furthermore, our study suggests that semantically-driven snippet generation can also be used to augment traditional passage retrieval algorithms based on word overlap or statistical weights, since they typically differ in coverage and produce different results. User clicks on the query relevant snippets can be used to refine the query results and promote the most comprehensive among the relevant documents.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Calculation Methods for Binary Classification based on Discrete Data. An Application on Synthetic and Real Data.",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Iraklis-Varlamis/publication/332845769_Calculation_Methods_for_Binary_Classification_based_on_Discrete_Data_An_Application_on_Synthetic_and_Real_Data/links/5ccc5d9b92851c4eab80f210/Calculation-Methods-for-Binary-Classification-based-on-Discrete-Data-An-Application-on-Synthetic-and-Real-Data.pdf",
            "Abstract": "Objective: This work explores the performance of popular classification methods and multivariate indices on binary classification tasks, for datasets that comprise discrete valued features. This is directly applicable in the evaluation of the diagnostic accuracy of composite health related indices or screening tests, which combine multiple discrete-valued attributes (variables), usually using a weighted sum. Methodology: Several classification methods (eg logistic regression, classification trees, neural networks, support vector machines, ensemble classifiers etc) and multivariate indices that combine feature weighting techniques, are evaluated in this study using both simulated and actual medical-dietary data collected from the “ATTICA study” in Greece. A variety of scenarios that modify the discrete values’ distribution parameters of the variables, and the number of variables as well as, are tested. All methods were assessed as to their classification performance by using a set of classification validity criteria such as: area under the ROC curve, true positive and true negative rates, positive and negative predictive value. The predictability of methods and the statistical significance of the results are evaluated using Monte-Carlo cross validation. Results: Results indicate that specific classification methods outperform all others in almost all the validity criteria and they also perform better than multivariate indices in certain cases, with regards to the data distribution, the number of features used and the number of their possible values. However, multivariate indices demonstrate a better performance when the number of features is small and the number of …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:NJ774b8OgUMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crossing the Ts and Closing the Tags: Improving Web-Standards Compliance in Open Source e-Learning Platforms",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:f2IySw72cVMC",
            "Publisher": "Academic Conferences Limited"
        },
        {
            "Title": "A framework for building virtual communities for education",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.220.9835&rep=rep1&type=pdf#page=176",
            "Abstract": "The aim of education is to provide the basis for life long learning and improvement. In this direction, schools and universities offer standard curricula aiming to cover the fundamental needs of their students in a few years scope. On the other side, institutes and companies offering life long education focus on improving specific skills and competencies of people in a short period of time. Obviously the aims, capabilities and availability of attendants vary significantly, since they usually have to cope with their morning work and their family duties. As a matter of fact, several issues, such as the limited duration of training programs, the loaded schedule of trainees, the inevitable absences due to other obligations, the multitude of topics to be covered, the variance of attendants’ interests and needs, have to be considered in order to create a competitive training program. In order to support attendance and inform people on the topics, requirements and aims of programs we need a flexible program structure and an infrastructure that delivers information, training material, and support on demand, in a daily basis. We believe that a single institute is not always capable in coordinating such a composite effort and we capitalize on the building of a virtual community for education. Community will comprise training institutes, educators and trainees who will interact and co-operate in order to achieve maximum gain and flexibility.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reshaping consumption habits by exploiting energy-related micro-moment recommendations: A case study",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-68028-2_4",
            "Abstract": "The environmental change and its effects, caused by human influences and natural ecological processes over the last decade, prove that it is now more prudent than ever to transition to more sustainable models of energy consumption behaviors. User energy consumption is inductively derived from the time-to-time standards of living that shape the users’ everyday consumption habits. This work builds on the detection of repeated usage consumption patterns from consumption logs. It presents the structure and operation of an energy consumption reduction system, which employs a set of sensors, smart-meters and actuators in an office environment and targets specific user habits. Using our previous research findings on the value of energy-related micro-moment recommendations, the implemented system is an integrated solution that avoids unnecessary energy consumption. With the use of a messaging …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:edDO8Oi4QzsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A flexible model for the delivery of multi-facet information in patient–centric Healthcare Information Systems",
            "Publication year": 2007,
            "Publication url": "https://galaxy.hua.gr/~varlamis/Varlamis-papers/J7.pdf",
            "Abstract": "This paper suggests a new approach for the development of healthcare information standards, which is based on widely used and open frameworks. The paper attempts a review of existing standards for healthcare information, analyses their deficiencies and focuses on the need for interoperability. Healthcare information, in order to be useful, has to be well formed, valid and flexible. Healthcare information standards are the pre-requisites for well-formed ness and validity of information. Flexibility expects “plug-and-play” information, which will be operable in any system, any time and any place. A standard that will be accepted world-wide and will cover all possible aspects of healthcare information needs sounds both infeasible and inconvenient due to its size and complexity. A more practicable solution is to provide an interconnection mechanism on top of all existing and future standards. This work specifies the two fundamental problems of information interoperability, which are structure and semantics, and suggests a mechanism that facilitates the integration of existing information, the mutation and transfer of information between healthcare information systems and eases interoperability.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A holistic perspective of security in health related virtual communities",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/holistic-perspective-security-health-related/48732",
            "Abstract": "A significant issue in health related applications is protecting a patient’s profile data from unauthorized access. In the case of telemedicine systems a patient’s medical profile and other medical information is transferred over the network from the examination lab to the doctor’s office in order for the doctor to be able to perform a diagnosis. The medical information transferred across the network should be encrypted, secured and protected until it reaches its final destination. Patients’ medical profiles should be accessible by their doctors in order to support diagnosis and care, but must also be protected from other patients, medical companies and others who are not certified by the patient to access his medical data. A very important element of virtual communities is trust. Trust should be built upon the same specifications for secure data transfer and leveled access with medical information. Furthermore, trust requires a …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A network abstraction of multi-vessel trajectory data for detecting anomalies",
            "Publication year": 2019,
            "Publication url": "http://www.master-project-h2020.eu/wp-content/uploads/2019/03/BMDApaper5.pdf",
            "Abstract": "The detection of anomalies in vessel trajectories is a problem of great interest for all maritime surveillance systems, since it may uncover strange, suspicious or di cult situations for vessels. All the existing works in the eld examine speci c aspects of the problem and propose case speci c tools that can hardly generalize or scale-up to a worldwide monitoring system. In this article, we present a methodology for creating a network abstraction of the trajectories of multiple vessels, which uses only the information collected from the vessels’ Automatic Identi cation System (AIS). The resulting network abstraction contains rich information about the vessel behavior in an area and can be processed with network analysis and other data mining techniques in order to uncover hidden outliers, even in an unsupervised manner. Experimental results on a real dataset demonstrate some of the capabilities of the proposed network model and indicate its extension to more complex automatic surveillance tasks.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Temporal Language Modelling of Biomedical Text: A Novel Text Mining Approach for Biomarkers Prediction",
            "Publication year": 2012,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:D03iK_w7-QYC",
            "Publisher": "Poster paper"
        },
        {
            "Title": "TEACHING-Trustworthy autonomous cyber-physical applications through human-centred intelligence",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9524099/",
            "Abstract": "This paper discusses the perspective of the H2020 TEACHING project on the next generation of autonomous applications running in a distributed and highly heterogeneous environment comprising both virtual and physical resources spanning the edge-cloud continuum. TEACHING puts forward a human-centred vision leveraging the physiological, emotional, and cognitive state of the users as a driver for the adaptation and optimization of the autonomous applications. It does so by building a distributed, embedded and federated learning system complemented by methods and tools to enforce its dependability, security and privacy preservation. The paper discusses the main concepts of the TEACHING approach and singles out the main AI-related research challenges associated with it. Further, we provide a discussion of the design choices for the TEACHING system to tackle the aforementioned challenges",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "X-Database",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=11576988094676355353&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effective thematic selection in the www based on link semantics",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=6464062652079583445&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Technical report"
        },
        {
            "Title": "Virtual learning communities",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=16053890879692169062&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:e_rmSamDkqQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finding influential sources and breaking news in news media using graph analysis techniques",
            "Publication year": 2017,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWET.2017.086449",
            "Abstract": "The popularity of social media has increased the interest for knowledge extraction from social networks and social media sites. The discovery of influential content or users and hidden social connections can be profitable for social media users and companies through personalisation and promotion respectively. Despite the abundance of works on social media and networks, there are no similar works in traditional (i.e., press, radio, TV) or online media (i.e., news sites). This work proposes a solution that solves the lack of influence or connection information by analysing news media content. Consequently, it detects the underlying influence among news media companies and provides knowledge about breaking news. Among the contributions of this work are: a new methodology for identifying and quantifying the implicit influence between news media, based on content similarity and a new method for the early …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "A Survey on Sentiment Analysis and Opinion Mining in Greek Social Media",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2078-2489/12/8/331",
            "Abstract": "As the amount of content that is created on social media is constantly increasing, more and more opinions and sentiments are expressed by people in various subjects. In this respect, sentiment analysis and opinion mining techniques can be valuable for the automatic analysis of huge textual corpora (comments, reviews, tweets etc.). Despite the advances in text mining algorithms, deep learning techniques, and text representation models, the results in such tasks are very good for only a few high-density languages (e.g., English) that possess large training corpora and rich linguistic resources; nevertheless, there is still room for improvement for the other lower-density languages as well. In this direction, the current work employs various language models for representing social media texts and text classifiers in the Greek language, for detecting the polarity of opinions expressed on social media. The experimental results on a related dataset collected by the authors of the current work are promising, since various classifiers based on the language models (naive bayesian, random forests, support vector machines, logistic regression, deep feed-forward neural networks) outperform those of word or sentence-based embeddings (word2vec, GloVe), achieving a classification accuracy of more than 80%. Additionally, a new language model for Greek social media has also been trained on the aforementioned dataset, proving that language models based on domain specific corpora can improve the performance of generic language models by a margin of 2%. Finally, the resulting models are made freely available to the research community.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:IRz6iEL74y4C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "THESUS, a Closer View on Web Content Management Enhanced with Link Semantics",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1294890/",
            "Abstract": "With the unstoppable growth of the world wide Web, the great success of Web search engines, such as Google and AltaVista, users now turn to the Web whenever looking for information. However, many users are neophytes when it comes to computer science, yet they are often specialists of a certain domain. These users would like to add more semantics to guide their search through world wide Web material, whereas currently most search features are based on raw lexical content. We show how the use of the incoming links of a page can be used efficiently to classify a page in a concise manner. This enhances the browsing and querying of Web pages. We focus on the tools needed in order to manage the links and their semantics. We further process these links using a hierarchy of concepts, akin to an ontology, and a thesaurus. This work is demonstrated by an prototype system, called THESUS, that organizes …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Technology and journalism: Conflict and convergence at the production level",
            "Publication year": 2012,
            "Publication url": "https://galaxy.hua.gr/~varlamis/Varlamis-papers/BC9.pdf",
            "Abstract": "At a time when new technologies are developing rapidly, the use of the term journalism has undergone various changes. The Internet allows information to “travel” in huge packs and the only restriction lies in the speed of electrons or electromagnetic waves (Osborn, 2001: 1). The Internet has transformed the journalistic profession but technology alone is not enough to further address the significance of these changes. The role of journalism in democracy, political participation, and social integration must be redefined within the framework of a society whose main feature tends to be individualization. Technology is the first step towards change. Traditional methods can now be combined to create new distribution channels. Despite the fact that similarities can be found between the alternative and dominant media, the extent of the phenomenon has taken on huge dimensions and cannot be ignored on this basis. The …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A micro-moment system for domestic energy efficiency analysis",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9112672/",
            "Abstract": "Domestic user behavior is a crucial factor guiding overall power consumption, necessitating the development of systems that analyze and help shape energy-efficient behavior. Therefore, the most important step in the process is the collection and understanding of highly detailed domestic consumption data. This article presents an appliance-based energy data collection and analysis system for energy efficiency applications. It leverages the concept of micro-moments, which are short-timed and energy-based events that form the overall energy behavior of the end user. The system comprises sensing modules for recording energy consumption, occupancy, temperature, humidity, and luminosity storing recordings on a database server. Sensing parameters were tested in terms of connection stability and measurement accuracy. A four-week contextual appliance-level dataset has been collected from research cubicles …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:tYavs44e6CUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Web-Based Communities for Lifelong Medical Learning",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-1274-9_11",
            "Abstract": "The exponential growth of medical information, the increased demands for expertise and the limited time that people have to spend for self-improvement create the need for delivering the appropriate knowledge to the appropriate people in the minimum of time. Traditional learning and training approaches are inadequate to fulfil the needs of doctors and medical practitioners, who need always to get informed on new technologies, devices and products and seek for solution in specific problems. Open educational programs and e-learning solutions usually fail to adapt to the emerging needs. The only viable solution seems to be education on demand and communities offer good ground for this. This work examines web-based medical communities as means for delivering education on demand whilst in the same time allowing participants to contribute their expertise. Successful community paradigms are …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:BqipwSGYUEgC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Parallelization of large-scale drug–protein binding experiments",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X1830058X",
            "Abstract": "The pharmaceutical industry invests billions of dollars on a yearly basis for new drug research. Part of this research is focused on the repositioning of established drugs to new disease indications and is based on “drug promiscuity”, or in plain words, on the ability of certain drugs to bind multiple proteins. The increased cost of wet-lab experiments makes the in-silico alternatives a promising solution. In order to find similar protein targets for an existing drug, it is necessary to analyse the protein and drug structures and find potential similarities. The latter is a highly demanding in computational resources task. However, algorithmic advances in conjunction with increased computational resources can leverage this task and increase the success rate of drug discovery with significantly smaller cost. The current work proposes several algorithms that implement the protein similarity task in a parallel high-performance …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:JQOojiI6XY0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A scalable solution for personalized recommendations in large-scale social networks",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2645791.2645801",
            "Abstract": "The modern trend in many Web 2.0 applications is that users can interact with the applications in terms of social activity, for example they can express their trust for another user or another user's review etc. Bearing that in mind, creating recommendations for users could go one step further by reclaiming the social network information they share into these applications. This information can be exploited for creating better recommendations but also for optimizing the execution of existing algorithms in large scale datasets. In this paper, we introduce a scalable model for generating personalized user recommendations, which first uses the social information and divides the social graph into subgraphs and then applies Collaborative Filtering on the preferences information related to each subgraph. The results of our experiments show that our proposed model can perform faster than the traditional techniques while …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic relatedness hits bibliographic data",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1651587.1651607",
            "Abstract": "In this paper we introduce a novel approach for the thematic organization of bibliographic records that builds upon a semantic relatedness measure we have implemented for this task. In particular, we introduce the Omiotis measure, which captures the semantic relatedness between text segments and enables the thematic organization of the bibliographic data stored in online databases. Experimental evaluation demonstrates that Omiotis can significantly improve the performance of several data mining tasks, such as publications' classification and clustering, compared to existing approaches; even when considering a limited amount of information, ie, the paper titles.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A platform for real-time opinion mining from social media and news streams",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7345500/",
            "Abstract": "Big data is a popular term used to describe the exponential growth and availability of data, both structured and unstructured. It can best be defined by thinking of three Vs: Big data is not just about Volume, but also about Velocity and Variety. The demand for stream processing is increasing a lot these days. The reason is that often processing big volumes of data is not enough. The increasing amount of opinionated data that is published in social media, in combination with the variety of data sources has created a demanding ecosystem for stream processing. The reason is that in order to deliver high quality knowledge extraction services, several tasks of high complexity must be accomplished and the existing solutions and architectures are not sufficient for processing huge volumes of streamed data. When opinion mining is applied in social media in order to cover the needs of businesses for brand monitoring …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monitoring the evolution of interests in the blogosphere",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4498371/",
            "Abstract": "We describe blogTrust, an innovative modular and extensible prototype application for monitoring changes in the interests of blogosphere participants. We also propose a new approach for the analysis of weblog contents that is supported by blogTrust and can yield new insights on the analysis of the blogosphere by monitoring the convergence or dispersion of blogosphere interests. The proposed process classifies weblog posts in predefined categories, generates a feature vector for each weblog from the post classification results, clusters together blogs with similar topics/interests, and, via visualization techniques, enables the detection of interest convergence or divergence among bloggers over different time periods. BlogTrust uses established, robust data mining techniques to support every step of the process. The motivation for the work is a hypothesized strong connection between important (global or \"local\" …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identifying free text plagiarism based on semantic similarity",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.301.9713&rep=rep1&type=pdf",
            "Abstract": "It is common knowledge that plagiarism in academia goes as back in time as research itself. However, in the last two decades this phenomenon of academic deception has turned into an academic plague. Undoubtedly, the rapid expansion of the Web and the vast amount of publicly available information and documents facilitate the unethical malpractice of computer-aided plagiarism, which in turn has inflated the problem. Anti-plagiarism techniques build upon technological solutions and especially the development of task-specific software. The role of anti-plagiarism software for text is to process a document and identify the pieces of text that have been reproduced from another source. This work presents a semantic-based approach to text-plagiarism detection which improves the efficiency of traditional keyword matching techniques. Our semantic matching technique is able to detect a larger variety of paraphrases, including the use of synonym terms, the repositioning of words in the sentences etc. We evaluate our methodology in a dataset comprising positive and negative plagiarism samples and present comparative results of both supervised and unsupervised methods.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Decentralization of the Greek National Telemedicine System through the upgrading of the Regional Telemedicine Centers",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=13892268464045383781&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:WZBGuue-350C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Models and Practices for the development of e-learning communities in healthcare",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Apostolakis/publication/250927156_Models_and_Practices_for_the_development_of_e-learning_communities_in_healthcare/links/0a85e53218fe5e07ee000000/Models-and-Practices-for-the-development-of-e-learning-communities-in-healthcare.pdf",
            "Abstract": "This paper presents how Virtual Learning Communities can be used for the Education and Training of executive personnel of Health Units. More specifically it gives an overview of the various e-learning methods and designates how they can be combined to support the learning process inside a Virtual Learning Community. The community approach provides flexible and promising ways of education, training, communication and collaboration among people working in health sector and other involved in this, independent from geographic and time restrictions imposed by their working conditions. After some virtual communities are presented, a sequence of steps for developing a VLC for the Greek health system is proposed, and the steps that should be followed are discussed. Afterwards two use cases for educational procedures are presented. Finally a critical discussion with the factors of success, the advantages and disadvantages of this undertaking takes place.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Boosting domestic energy efficiency through accurate consumption data collection",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9060272/",
            "Abstract": "Domestic user behavior shapes overall power consumption, necessitating the development of systems that analyze and help foster energy efficient behavior. The most important step in the process is the collection and management of comprehensive data on end-user power consumption behavior. This paper presents an appliance-based energy data collection system for domestic households. It revolves around the concept of micro-moments, which are short-timed and energy-based events that form the overall energy behavior of the end-user. The system comprises sensing modules for recording energy consumption, occupancy, temperature, humidity, and luminosity storing recordings on a database server. Sensing parameters were tested in terms of connection stability and measurement accuracy. High stability and accuracy benchmarks have been reached with future work focused on deploying the system for …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:BwyfMAYsbu0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Present and Future os Standars for E-Learning Tecnologies",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=17772717172011332596&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:rmuvC79q63oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Open Source Systems: Enterprise Software and Solutions",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-92375-8.pdf",
            "Abstract": "The 14 full and one short papers that were selected for presentation are organized thematically as follows:",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "A risk management model for securing virtual healthcare communities",
            "Publication year": 2011,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJEH.2011.044344",
            "Abstract": "Virtual healthcare communities aim to bring together healthcare professionals and patients, improve the quality of healthcare services and assist healthcare professionals and researchers in their everyday activities. In a secure and reliable environment, patients share their medical data with doctors, expect confidentiality and demand reliable medical consultation. Apart from a concrete policy framework, several ethical, legal and technical issues must be considered in order to build a trustful community. This research emphasises on security issues, which can arise inside a virtual healthcare community and relate to the communication and storage of data. It capitalises on a standardised risk management methodology and a prototype architecture for healthcare community portals and justifies a security model that allows the identification, estimation and evaluation of potential security risks for the community. A …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Using XML as a medium for describing, modifying and querying audiovisual content stored in relational database systems",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.197.2494&rep=rep1&type=pdf",
            "Abstract": "The digitisation and annotation of audiovisual programs results in a huge amount of information that becomes useful only if it is properly organized and if the appropriate query mechanisms exist. Usually audiovisual information and meta-information is stored in relational database schemata that consist of decades of tables, relationships and constraints that complicate the information querying tasks. The PANORAMA1 platform has been developed to cover needs for manipulating video information, by attaching meta-information for both audio and visual content of video sources. This paper presents this meta-information model and the database interface developed in terms of the PANORAMA platform. The model works as keystone in the creation of the database and the database interface implements a mechanism for converting XML documents to relational data. This mechanism allows information users to use a more understandable way to communicate with the database.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Benefits and Hurdles of AI In The Workplace–What Comes Next?",
            "Publication year": 2021,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:umqufdRvDiIC",
            "Publisher": "Computer Science Journals"
        },
        {
            "Title": "Distributing n-gram graphs for classification",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-67162-8_1",
            "Abstract": "N-gram models have been an established choice for language modeling in machine translation, summarization and other tasks. Recently n-gram graphs managed to capture significant language characteristics that go beyond mere vocabulary and grammar, for tasks such as text classification. This work proposes an efficient distributed implementation of the n-gram graph framework on Apache Spark, named ARGOT. The implementation performance is evaluated on a demanding text classification task, where the n-gram graphs are used for extracting features for a supervised classifier. A provided experimental study shows the scalability of the proposed implementation to large text corpora and its ability to take advantage of a varying number of processing cores.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Scalable semantic annotation of text using lexical and web resources",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_32",
            "Abstract": "In this paper we are dealing with the task of adding domain-specific semantic tags to a document, based solely on the domain ontology and generic lexical and Web resources. In this manner, we avoid the need for trained domain-specific lexical resources, which hinder the scalability of semantic annotation. More specifically, the proposed method maps the content of the document to concepts of the ontology, using the WordNet lexicon and Wikipedia. The method comprises a novel combination of measures of semantic relatedness and word sense disambiguation techniques to identify the most related ontology concepts for the document. We test the method on two case studies: (a) a set of summaries, accompanying environmental news videos, (b) a set of medical abstracts. The results in both cases show that the proposed method achieves reasonable performance, thus pointing to a promising path for …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Detecting rising stars in dynamic collaborative networks",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1751157716300645",
            "Abstract": "In today's complex academic environment the process of performance evaluation of scholars is becoming increasingly difficult. Evaluation committees often need to search in several repositories in order to deliver their evaluation summary report for an individual. However, it is extremely difficult to infer performance indicators that pertain to the evolution and the dynamics of a scholar. In this paper we propose a novel computational methodology based on unsupervised machine learning that can act as an important tool at the hands of evaluation committees of individual scholars. The suggested methodology compiles a list of several key performance indicators (features) for each scholar and monitors them over time. All these indicators are used in a clustering framework which groups the scholars into categories by automatically discovering the optimal number of clusters using clustering validity metrics. A profile of …",
            "Abstract entirety": 0,
            "Author pub id": "SUyTkTAAAAAJ:vRqMK49ujn8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The Educational Role of Communities of Practice in Biomedical Engineering'",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Apostolakis/publication/229037597_The_educational_role_of_Communities_of_Practice_in_Biomedical_Engineering/links/09e41506ad2095188c000000/The-educational-role-of-Communities-of-Practice-in-Biomedical-Engineering.pdf",
            "Abstract": "A vast amount of information is currently produced in Biomedical domain concerning methods, techniques and products. Institutes, companies and organizations work on the production and management of the accumulated knowledge in order to support individual researchers, practitioners and advance health and patient care.The need for expertise and knowledge in all biomedical applications demands from engineers to get informed on recent advances in their fields and continuously improve their knowledge and methods. Usually engineers have to compress training and education into their valuable working time. The delivering of the appropriate knowledge to the appropriate people in the minimum of time is the only way to balance this trade off between time for work and education. The results of this ‘on the spot’approach will be in favour of professionals and their clients.",
            "Abstract entirety": 1,
            "Author pub id": "SUyTkTAAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        }
    ]
}]