[{
    "name": "Θανάσης Χατζηλάκος",
    "romanize name": "Thanasis Chatzilakos",
    "School-Department": "Πληροφοριακά Συστήματα",
    "University": "ouc",
    "Rank": "Καθηγητής",
    "Apella_id": 1632,
    "Scholar name": "Thanasis Hadzilacos",
    "Scholar id": "01kuev4AAAAJ",
    "Affiliation": "Open University of Cyprus",
    "Citedby": 1281,
    "Interests": [
        "Educational Technology"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=01kuev4AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "An E-learning course on E-commerce: Designed, developed and delivered as a distance learning course for EU remote communities",
            "Publication year": 2011,
            "Publication url": "https://pure.unic.ac.cy/en/publications/an-e-learning-course-on-e-commerce-designed-developed-and-deliver",
            "Abstract": "This paper presents aspects of the design, development and implementation of an e-learning course on ecommerce. This course was delivered as distance learning to adults living in remote areas of EU. The course was developed as part of the REVIT project, which proved sustainable methods for offering courses by employing available ICT infrastructure in local schools, after hours, a synchronous e-learning platform for the weekly lectures and a variety of asynchronous tools for communication and support of the learners.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Orchestration graphs: Enabling rich social pedagogical scenarios in MOOCs",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3051457.3054000",
            "Abstract": "One of the initial promises of MOOCs was to enable participants from around the world to learn and build knowledge together, however existing MOOC platforms are very limited in their collaborative functionality. Using a recent educational modeling language which can express a broad diversity of educational scenarios, we present a technical infrastructure design and prototype which enables instructors to design and run pedagogically rich and therefore complex scenarios. We present this as a theoretical and technical contribution to support a broad program of research and innovation related to collaborative learning at scale.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D4. 1 The Open Discovery Space Educational Design",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=10153089082641988628&hl=en&oi=scholarr",
            "Abstract": "This deliverable describes the ODS Educational Design. Following a use case that exemplifies the educational design process of a future ODS teacher, the key elements of the ODS educational design are defined: the teachers’ competency levels, the tasks they want their students to engage in, and the context in which these activities will take place. These key elements are brought together in a so-called matching algorithm that aims to link the supply side (digital resources and applications accessible through the ODS portal) with the demand side (teachers searching the ODS portal).",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Demo of orchestration graph engine: enabling rich social pedagogical scenarios in MOOCs",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3051457.3053968",
            "Abstract": "This demo submission is associated with the Work-in-Progress submission\" Orchestration Graphs: enabling rich social pedagogical scenarios in MOOCs\". We present our implementation of a web application for designing, running and orchestrating social pedagogical scenarios. The application is based on Orchestration Graphs, an educational modeling language. We plan to demonstrate our technology by automatically simulating user activity, and offering visitors the opportunity to interact with the graph editor.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Language‐Independent Access to History Textbooks: Utilizing GIS Functionality with Spatiotemporal and Thematic Metadata",
            "Publication year": 2010,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1467-9671.2010.01233.x",
            "Abstract": "Integrating and accessing structured textual content obtained from different sources is a challenging task and becomes even more so when dealing with multiple languages. The objective of this article is to showcase the technological efforts towards the creation of a digital European history textbook repository that integrates respective textbooks from various countries and publishers. The content integration is achieved by introducing language independent metadata based on space (locations), time (dates), and thematic categories (history gazetteer). Providing adequate interfaces such metadata can be used to offer language‐independent access to Multilanguage history textbook content. The specific focus in this article will be on (1) presenting the metadata, (2) the data management approach including indexing the history textbook content and (3) the resulting textbook repository including its GIS‐based interface …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Developing constructive m-learning activities for k-12 education: data and architectural issues",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=5151387302079353162&hl=en&oi=scholarr",
            "Abstract": "A new class of educational ICT-based activities is introduced based on experience from several projects with mobile technologies and constructivist ICT (Information and Communications Technology) usage in k-12, called constructive mobile learning. It is a positive approach to combining learning with moving, field education with ICT, personalized and learner-enhanced learning material. Technically it is based on location dependency of educational content and method and de-segregates moving and information processing for a learner community. A comprehensive example for a 10th grade class studying history coupled with several interdisciplinary educational goals is given. Requirements for communication, hardware, applications, and usability are derived. Analysis and organization of information leads on the one hand to data categorization (into educational content, educational context and technical context …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teacher-led design of an adaptive learning environment",
            "Publication year": 2016,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10494820.2015.1073747",
            "Abstract": "This paper discusses a requirements engineering process that exemplifies teacher-led design in the case of an envisioned system for adaptive learning. Such a design poses various challenges and still remains an open research issue in the field of adaptive learning. Starting from a scenario-based elicitation method, the whole process was highly participatory, with requirements validation in iterative cycles. The contribution of the paper is twofold: (a) it exposes the design of an environment which addresses the related challenges mentioned by the participants and the literature and (b) it suggests a methodology of framing key requirements into a set of critical success factors for meeting the end-users’ expectations. The latter could be crucial in cases where the available resources are limited, but the quality of the product must not be sacrificed.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:M3NEmzRMIkIC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Learning needs analysis of collaborative e-classes in semi-formal settings: The REVIT example",
            "Publication year": 2013,
            "Publication url": "https://www.erudit.org/en/journals/irrodl/1900-v1-n1-irrodl05093/1066891ar/abstract/",
            "Abstract": "Analysis, the first phase of the typical instructional design process, is often downplayed. This paper focuses on the analysis concerning a series of e-courses for collaborative adult education in semi-formal settings by reporting and generalizing results from the REVIT project. REVIT, an EU-funded research project, offered custom e-courses to learners in several remote European areas and received a ‘best practice’ distinction in social inclusion. These e-courses were designed and developed for the purpose of providing training in aspects of the learners’ professional domains related to the utilization of information and communication technologies. The main challenge was to prove that it is possible and economically feasible to provide meaningful training opportunities via distance education, by utilizing existing infrastructure (“revitalizing schools”) and by making use of modern digital technology affordances coupled …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:qUcmZB5y_30C",
            "Publisher": "Athabasca University Press (AU Press)"
        },
        {
            "Title": "Foreign Language Learning Strategy Use & Gender: The Case of Birzeit University Students",
            "Publication year": 2019,
            "Publication url": "https://digitalcommons.aaru.edu.jo/jropenres/vol7/iss13/6/",
            "Abstract": "The current study aimed at investigating the use of foreign language learning strategies among 178 students at Birzeit University enrolled in the English Communication course of B2, 2203. Besides, the study examined the relationship between participants’ gender and their foreign language learning strategy use. Oxford’s taxonomy for language learning strategies (1990) was utilized. In this taxonomy, language learning strategies are classified into the following six main categories: cognitive, memory, metacognitive, compensation, social and affective-strategies. A questionnaire comprising Oxford's taxonomy for second language learning strategies (1990) was used as an instrument for surveying the language learning strategies. The overall strategy used by the whole sample was found to be located in the medium range of strategies used. While metacognitive the participants reported strategies as the most utilized strategies. Affective strategies registered the lowest use by them. The results of the t-test indicated no statistically significant difference in the participants’ use of different learning approaches with respect to the gender variable. Conclusions and pedagogical implications of the results were discussed.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Heuristic usability evaluation of user interfaces for a semi-autonomous vineyard robot sprayer",
            "Publication year": 2016,
            "Publication url": "https://www.academia.edu/download/45365334/adamides_icr2016_fullpaper-asSubmitted.pdf",
            "Abstract": "This article presents findings from three heuristic usability evaluation studies that were carried out on a human-robot interface for a semi-autonomous agricultural vineyard robot sprayer. The following research-based heuristics for the design of robot teleoperation were used: Platform architecture and scalability, Error prevention and recovery, Visual design, Information presentation, Robot state awareness, Interaction effectiveness and efficiency, Robot environment/surroundings awareness, and Cognitive factors. In each evaluation study, usability problems were identified, and specific suggestions were documented for HRI usability improvement. In each design iteration, a smaller number of usability issues were identified. Results of the final heuristic evaluation showed that the system is at a good level of usability and is expected to provide satisfactory services to its typical users.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning Design: the views of prospective computer professionals",
            "Publication year": 2007,
            "Publication url": "https://www.ceid.upatras.gr/webpages/faculty/kordaki/conf-eng/C32.pdf",
            "Abstract": "In this paper, we shall use the term ‘learning design’to indicate all the results of a design for learning activities eg a learning task, a set of questions, the group formation, the learning materials to be used by the students, etc.[1]. Learning design is crucial in all types of education, namely; face-to-face, distance (including internet-based) and blended education.Especially in e-learning, the concept of learning design is a relatively new area. Britain [2] identifies three general ideas that are central to this concept: a) people learn better when actively involved in doing something, b) learning activities may be sequenced or otherwise structured carefully and deliberately in a learning workflow to promote more effective learning and c) it would be useful to be able to record ‘learning designs’ for sharing and re-use in the future.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TECHNOLOGY PEDAGOGY AND CONTENT IN WEB-BASED LANGUAGE INSTRUCTION FOR SECONDARY VOCATIONAL STUDENTS",
            "Publication year": 2015,
            "Publication url": "https://www.ceeol.com/search/article-detail?id=856615",
            "Abstract": "Students in vocational schools in Greece are less motivated and have low performance in courses demanding academic skills, like language learning with reading and writing tasks (eg essay writing). If they were asked, they would say that they prefer to do things rather than study or get involved in traditional classroom language activities. School cannot provide them with language materials and methodology adjusted to their needs. Language teaching and learning is an academic task-oriented subject and teachers find it extremely difficult to arise their students' interest. So, from this point of view there is a gap between need and supply. How to overcome this obstacle? Is it possible that an educational e-Learning environment applying a purpose specific e-pedagogy, will do this? An experimental teaching intervention took place in a Greek Secondary Vocational Lyceum (1st EPA. L-Epagelmatiko Lykeio of Lamia …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:JV2RwH3_ST0C",
            "Publisher": "European Scientific Institute"
        },
        {
            "Title": "One Size does not fit all: A case study of combining networked learning methods and tools",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.574.6128&rep=rep1&type=pdf",
            "Abstract": "The combination of more than one pedagogical methods and tools in order to “fit” both with the learning objectives and constraints of the setting, seem to be a\" raising\" proposal, in contrary of stressing the pedagogical design, to fit with the available tools. This paper describes the work on the selection and integration of different pedagogical methods and tools in order to address specific needs of a given authentic educational setting. Asynchronous communication with LMS and synchronous communication with virtual classroom and collaborative networked activities are combined to support f2f traditional teaching of Algorithms to first year students of University of Macedonia, Thessaloniki, Greece. To support participants, we have designed well defined conceptual “spaces” to support them: a “virtual preparatory space” for the “class” work preparation (like a library), a “virtual classroom” for blended learning activities (like a class), a “private group space” for CSCL activities (like a desk), a “private room” for private discussion (like teacher’s desk),“small private rooms” for small groups activities (like a meeting table). Participants, instructors and students, had successfully switched among “spaces” and tools, students had participated actively, improved their performance and avoided typical mistakes in their exams.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the software and knowledge engineering aspects of the educational process",
            "Publication year": 2007,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218194007003434",
            "Abstract": "The Hellenic Open University has embarked on a large-scale effort to enhance its textbook-based material with content that demonstrably supports the basic tenets of distance learning. The challenge is to set up a framework that allows for the production-level creation, distribution and consumption of content, and at the same time, evaluate the effort in terms of technological, educational and organizational knowledge gained. This paper presents a model of the educational process that is used as a development backbone and argues about its conceptual and technical practicality at large.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:RGFaLdJalmkC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "On layer-based systems for undetermined boundaries",
            "Publication year": 2020,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781003062660-21/layer-based-systems-undetermined-boundaries-thanasis-hadzilacos",
            "Abstract": "Coming from the ‘rational world of exact objects’, there are two extremes on the spectrum of reactions to ‘entities with undetermined boundaries’. One is that in order to handle undetermined boundaries one need a totally different philosophical and cognitive approach and a correspondingly different mathematical and computational model. The other extreme reaction is to view them as a natural extension and try to accommodate them in the same models that are used for entities with exact boundaries. This chapter determines what extensions are needed in order for the models to deal with undetermined boundaries.‘Undetermined’boundaries are due to fuzziness or uncertainty. Fuzziness is usually a property of the geographic entity or phenomenon itself, while uncertainty is usually caused by limitations of the observation. Administrative boundaries, set for reasons of social necessity and often the subject of …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Learner’s version of a professional environment: Film subtitling as an ICTE tool for foreign language learning",
            "Publication year": 2004,
            "Publication url": "https://www.learntechlib.org/p/11399/",
            "Abstract": "Learning a new language can be tedious-except in the environment actually used, in which case it is most exciting. Active learning and engaging learning activities are prominent among the-often not realized in practice-promises of ICTE. Presenting learners with a special version of a professional environment, not for the purposes of training a professional but for the side benefits of fundamental skills associated is widely practiced in education. In this paper we present LvS (Learning via Subtitling), a special learning/exercising environment for foreign languages, mimicking a highly specialized professional activity: film/video subtitling. The learner combines listening (to speech, music and other sounds) with viewing (thus incorporating cultural aspects in her learning) in order to come to an understanding which she must then render by suitable translation into subtitles: they will appear as a subtitled film and be stored …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:dhFuZR0502QC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Broadening the use of e-learning standards for adaptive learning",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33642-3_23",
            "Abstract": "This paper presents two specific educational applications that make use of the IMS-Learning Design specification as the basis for adaptive web-based learning. Specifically, learner profiling and personalization is achieved in adaptive courseware compliant with the specification and including a diagnostic learning style test and an educational recommender system. These components make use of the learning style and prior knowledge respectively, in order to adapt the presentation of the learning material and the feedback given to the learner.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "THE PROCESSES",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=j5xLg-82DjcC&oi=fnd&pg=PA113&dq=info:6UyuGBeCsv4J:scholar.google.com&ots=0R7lAqbbB6&sig=exkFVBCiA74a-Hkw8xqbbauO5UI",
            "Abstract": "This study has been written bearing in mind those who accept that we are in a new stage of social development (whether they call it the “information society”, the “communication society” or something else); those who feel concerned that the opportunities for learning and teaching have been deeply affected and that needs are not being met; those who feel confused by the hype about the information-communication society, about computers and networks in education; and those who suspect that technology could be a valuable aid, but should not be taken on board too quickly and then only as a social benefit, and who seriously doubt whether quick fixes exist for complex psychological and social processes such as teaching and learning. In short, the intended audience of this study is the active citizen of modern European society.This study has been written from a critically optimistic point of view, which takes into account the needs for learning and teaching (which are mainly social) and the opportunity to meet them (which is mainly technological). The main point of the study is that ICTE, the use of information and communication technologies in education, has excellent potential both as a tool and environment for learning (and teaching) in our European society, but only under strict conditions. Its purpose should not be simply computer usability skills such as locating information or making presentations.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:u9iWguZQMMsC",
            "Publisher": "Council of Europe"
        },
        {
            "Title": "A Prototype for Educational Planning Using Course Constraints to Simulate Student Populations",
            "Publication year": 2009,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213009000317",
            "Abstract": "Distance learning universities usually afford their students the flexibility to advance their studies at their own pace. This can lead to a considerable fluctuation of student populations within a program's courses, possibly affecting the academic viability of a program as well as the related required resources. Providing a method that estimates this population could be of substantial help to university management and academic personnel. We describe how to use course precedence constraints to calculate alternative tuition paths and then use Markov models to estimate future populations. In doing so, we identify key issues of a large scale potential deployment.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:r0BpntZqJG4C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Hanging Pictures or Searching the Web",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-23513-0_11",
            "Abstract": "In this paper, we report work in designing a decision-making system that aims to support teachers in appropriating to their practice innovative scenarios that employ uses of information and communication technologies (ICT) in teaching and learning. To this end, we break down educational scenarios into micro-activities, and connect them to required and alternative infrastructure. We argue that micro-activities is a unit of analysis of educational scenarios that is compatible with the role of teachers as designers who select, decompose, combine, enact and revise different pieces of resources. This paper offers a reflective viewpoint on integrating ICT in existing scenarios and investigates how teaching objectives make use, or not, of the potential of digital technologies.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Tracking User Participation in a Large Scale Team Collaboration Environment",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.220.9835&rep=rep1&type=pdf#page=334",
            "Abstract": "All students of the Hellenic Open University (HOU) attend undergraduate and postgraduate courses at a distance. The lack of a live academic community is reported by many as a drawback in their studies. Systematic exploitation of new communication and collaboration technologies is desirable in the HOU but cannot be imposed universally as the average student’s IT competence level is relatively low. In this work we present the methodology for the development of an integrated communication environment in which collaboration spaces serving as open communities play a key role in user engagement in the whole communication environment. To track and evaluate user participation we propose analytic metrics which, when combined with our detailed knowledge of the internal workings of user groups, provide concrete evaluation of the community online activity.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A reality-based interaction interface for an agricultural teleoperated robot sprayer",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/33797388/60_RHEA-2014_final_asSubmitted.pdf",
            "Abstract": "Introducing semi-automatic teleoperation of an agricultural robotic system can enable improved performance, overcoming the complexity that current autonomous robots face due to the dynamic and unstructured agriculture environment. A teleoperated robot can both leverage the farmers’ knowledge and experience while keeping them safe and also help the robot manage the unpredictability of the environment in the field. In this paper we describe the construction of such a teleoperated agricultural robot sprayer that is controlled through a Reality-Based Interaction interface. Two different user interfaces for teleoperating a vineyard spraying robot were experimentally evaluated. In the first condition, participants were provided with a single view (one camera) for teleoperating the robot, whereas in the second condition they had additional views (multiple cameras) supporting peripheral vision and targeted spraying. Analysis of the collected data showed that users in the additional views condition sprayed significantly more grapes and teleoperated the robot with significantly less collisions with obstacles, compared to users who did not have these aids, but also required significantly more time. Participants’ perceived usability assessments were not affected by the availability of these additional views.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using Graphs in Developing Educational Material",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/web-based-learning-solutions-communities/36355",
            "Abstract": "Distance learning institutions need to find a way to transplant the benefits of conventional tutoring practices into the development of digital content that is conducive to students’ learning needs. Therein lie two great challenges: promote real distance learning effectively and, at the same time, try to accommodate the ability of students to learn via collaboration. The authors have proposed the development of learner’s open-and-distance-learning (ODL) courses as both a theoretical model and an applied methodology to be one of their key priorities and describe how this concept co-evolves with Web mining and institutional infrastructures to address the needs of emergent communities of practice within their university, primarily of students and secondarily of tutors.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:NaGl4SEjCO4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "An adaptive e-Learning strategy to overcome the inherent difficulties of the learning content",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-45153-4_40",
            "Abstract": " In this paper we propose a strategy of adaptive e-learning that aims to help students overcoming the inherent difficulties of STEM-related subject matters for which they have known misconceptions. The paper reports on empirical findings derived from classroom interventions which were undertaken to investigate the impact of the proposed strategy. For each intervention, an adaptive e-course was developed and tested with encouraging results. Since the proposed strategy is descriptive in nature the paper can be used as the basis for future studies that validate it with other subject matters than those mentioned herein.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Human-robot interaction in agriculture: Usability evaluation of three input devices for spraying grape clusters",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/39600981/Human-Robot_Interaction_in_Agriculture_U20151101-16172-8tyvr5.pdf",
            "Abstract": "This work focuses on the development of a user interface suitable for targeted spraying, using a robot that is teleoperated along the vineyard rows. A prototype of the spraying interface was developed and the usability of three different interaction modes was investigated. Fifty participants were asked to use the three devices to select grape clusters taken from a simulated robot moving along rows in a vineyard. Next, participants completed a questionnaire related to their user experience with the system. This paper presents the results of the statistical analysis of the log files and questionnaire responses to compare the three devices.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Let me do it: towards the implementation of instructional patterns of ICT usage in schools",
            "Publication year": 2016,
            "Publication url": "https://dl.gi.de/bitstream/handle/20.500.12116/558/305.pdf?sequence=1",
            "Abstract": "We present the design of an online environment that provides mechanisms for the exploitation of school ICT infrastructure by empowering teachers to discover and comment on educational activities that can be implemented in their schools.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Gesellschaft für Informatik eV"
        },
        {
            "Title": "Making the best of what we have: Lifelong distance e-learning revitalizing small remote schools",
            "Publication year": 2016,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/466",
            "Abstract": "This paper presents the design and initial implementation of an ICT-based distance learning framework that exploits current trends in distance learning, in particular e-learning tools and features that are collectively known as “Web 2.0 tools”(eg, blogs, wikis, social networks, podcasting). The project involves people who live in remote areas and aims for the mutual interaction, creation, share and reuse of information in order to provide useful lifelong education towards shaping the local mentality of the remote community from that of an overlooked inhabitant of a forgotten region to a European citizen, at the same time respecting linguistic and cultural diversities.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ομαδικές Συμβουλευτικές Τηλε-Συναντήσεις (ΟΣΤ): Εμπειρία και Συμπεράσματα από την εξ Αποστάσεως Υποστήριξη των φοιτητών του ΕΑΠ στα Μαθηματικά μέσω Εικονικών Τάξεων",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=3495252361334771111&hl=en&oi=scholarr",
            "Abstract": "Στο Ελληνικό Ανοικτό Πανεπιστήμιο (ΕΑΠ) η εξ αποστάσεως εκπαίδευση, οργανωμένη σε Θεματικές Ενότητες (καθεμιά είναι αντίστοιχη με τρία εξαμηνιαία μαθήματα) συμπληρώνεται με δια ζώσης επαφή ενός καθηγητή συμβούλου με τους 30 φοιτητές ενός τμήματος. Οι ομαδικές αυτές συμβουλευτικές συναντήσεις (ΟΣΣ) γίνονται 5 φορές το χρόνο και διαρκούν 4 ώρες. Από το 2002 σε ορισμένες ΘΕ του προπτυχιακού προγράμματος Πληροφορικής οργανώνονται επιπρόσθετα και «εξ αποστάσεως συναντήσεις» μέσω bιαδικτύου και προσωπικών υπολογιστών. Στο άρθρο αυτό παρουσιάζεται η αξιολογημένη (παιδαγωγική κυρίως και τεχνολογική) εμπειρία από την οργανωμένη και τακτική εφαρμογή τεχνολογιών τηλεσυνάντησης και την αξιοποίηση μεθόδων σύγχρονης τηλεκπαίδευσης. Η μελέτη της στάσης των φοιτητών, των προσδοκιών τους και της εκπαιδευτικής αποτελεσματικότητας αφορά 204 φοιτητές του ΕΑΠ στη …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DIAPLASIS: Development of Online School-Parent Collaboration Platform",
            "Publication year": 2011,
            "Publication url": "https://aisel.aisnet.org/mcis2011/118/",
            "Abstract": "Resent research, especially in the area of Cumputer Mediated Communication, has shown that many educational districts in Europe, USA, Canada, Australia and other countries, use various technological solutions for communication with parents. Most schools, even in Cyprus, have their own web site showing information, while other schools employ online student management (or information) systems with specific levels of access by teachers, students and parents. In many cases, schools (or even teachers) use blogs, Facebook and Twitter accounts or even forums and email to communicate with families. All these approaches, even though commendable and with good results (according to research), take into account that (a) all parents can purchase or have access to a computer (b) all parents have the basic skills required to navigate through student management systems, reply to emails, post to forums or even navigate basic web pages. This research project will create an integrated online platform providing cloud-based serivces including an operating system and an optimised Graphic User Interface that will enable people with little to no skills and experience in using a computer, to collaborate and communicate with school personnel and other experts (ie psychologists), as well as participate in events organized by the school or by the Parent Teachers Association, in case it is extremely difficult or even impossible to attend the actual at-school event.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Productionizing of Streaming Educational Material",
            "Publication year": 2004,
            "Publication url": "https://old.eurodl.org/?p=archives&year=2004&halfyear=1&article=104",
            "Abstract": "The Hellenic Open University (HOU) has embarked on a large-scale effort to enhance its textbook-based material with content that is conducive to mature students' learning needs and supports the basic tenets of distance learning. It has selected the development and deployment of streaming media based content as one of its key priorities and now faces the challenge of setting up a framework that allows for the production-level creation, distribution and consumption of content, as well as the issue of evaluating its effort in terms of technological, educational and organisational knowledge gained. To assist in the effort, our approach has also delivered a custom tool for the development of such content.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using Course Constraints in Simulating Student Populations",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/40258269/Using_Course_Constraints_in_Simulating_S20151122-6324-1erjmwk.pdf",
            "Abstract": "Distance learning universities usually afford their students the flexibility to advance their studies at their own pace. This can lead to a considerable fluctuation of student populations within a programme’s courses. The evolution of the student population may be an important factor in determining the academic viability of a programme as well as the resources that have to be budgeted and administered. Providing a method that estimates this population could be of substantial help to university management and academic personnel. We describe how course precedence constraints expressed in the Prolog language are used to calculate alternative tuition paths and we then use discrete Markov simulation with the Extend system to estimate future populations. In doing so, we identify key issues of the potential deployment of such a system at a large scale.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Work-in-Progress: GameLet: Readers’ Theater in Media-Based Gamification for Reading Skills",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_51",
            "Abstract": "Τhis article discusses how to promote learners’ oral reading fluency in primary and secondary schools using digital media-based gamification. It presents a study in progress carried out for the Erasmus+ project GameLet (Gamified, media-based training of reading fluency), in Germany, Cyprus, and Portugal. GameLet is based on the concept of the Multilingual Readers’ Theater (MELT), which extends the traditional Readers’ Theater (RT) by integrating foreign languages in school, including migrant student mother tongues. “Meaningful” digital media-based gamification mechanisms are applied to the development of learning scenarios and materials to increase pupil motivation in self-directed, individual and cooperative learning phases for reading fluency training. During 2019, usability testing trials were conducted in participating schools on the gameboard application and the didactic design of the scenario-based …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:UxriW0iASnsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Usability guidelines for the design of robot teleoperation: A taxonomy",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6977975/",
            "Abstract": "This paper presents a taxonomy of design guidelines for robot teleoperation developed from a focused literature review of robot teleoperation. A list of user interface design guidelines was assembled, open card sorting and a focus group were used to classify them, and closed card sorting was employed to validate and further refine the proposed taxonomy. The initially obtained set of 70 guidelines is grouped into eight categories: platform architecture and scalability, error prevention and recovery, visual design, information presentation, robot state awareness, interaction effectiveness and efficiency, robot environment/surroundings awareness, and cognitive factors. Agricultural robots were used as an application case study for implementation and field evaluation. The proposed guideline taxonomy was used heuristically to evaluate the usability of an existing user interface of a teleoperated agricultural robot.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Developing A System To Evaluate Text's Suitability For Use In Greek Language Teaching",
            "Publication year": 2017,
            "Publication url": "https://aisel.aisnet.org/cgi/viewcontent.cgi?article=1005&context=mcis2017",
            "Abstract": "Internet is a dynamic corpus, a huge digital library of authentic material which is of particular importance to language teaching. In the modern pedagogical framework, language teaching is based on the genre-based approach and on the teaching of language to its authentic use. Viewing the Web as a corpus for the purposes of language teaching and due to the difficulty on selecting suitable texts with specific grammatical information from the Web, this paper presents the development life cycle phases of the system diaKeimenou. The literature review showed the research gap in relation to the ways of searching and finding a suitable text for use in the language teaching according to specific linguistic characteristics associated with the teaching objectives. The computational tool by the name diaKeimenou which is presented in this paper aims to fill this gap and help the teacher to evaluate text’s suitability given the …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:a0OBvERweLwC",
            "Publisher": "Association For Information Systems"
        },
        {
            "Title": "On small data sets revealing big differences",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_57",
            "Abstract": "We use decision trees and genetic algorithms to analyze the academic performance of students throughout an academic year at a distance learning university. Based on the accuracy of the generated rules, and on cross-examinations of various groups of the same student population, we surprisingly observe that students’ performance is clustered around tutors.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Spatial Data Management Aspects in Archaeological Excavation Documentation1",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72385-1_17",
            "Abstract": "Archaeological excavation documentation poses several challenges to spatial data management. This work gives a data model, respective query functionality and the description of the resulting prototype system for recording and analyzing the data produced during the course of an excavation. Based on a requirements analysis, we develop a data model that not only captures geo-referenced finds (pottery sherds, bones, etc.) and their properties, but also excavation diaries and the particularities of the excavation space. Towards an effort of analyzing the collected data and constructing a virtual excavation space, we describe spatial query capabilities providing access to the data in two and three-dimensional space. The system also captures uncertainty with respect to position, which is quite common due to either missing information and/or approximate measurements. Finally, we will give a complete …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "UtilNets: a water mains rehabilitation decision-support system",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0198971599000587",
            "Abstract": "UtilNets is a decision-support system (DSS) for rehabilitation planning and optimisation of the maintenance of underground pipe networks of water utilities. The DSS performs reliability based life predictions of the pipes and determines the consequences of maintenance and neglect over time in order to optimise rehabilitation policy.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:GnPB-g6toBAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Technical report-Evaluation methodology in the REVIT project",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1304.6694",
            "Abstract": "The purpose of this technical report is to present a methodological approach for evaluating the REVIT (http://revit.cti.gr) educational venture as a whole and assessing the learning effectiveness of the resulting collaborative e-courses.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "One size does not fit all: no single optimal algorithm for mobile spatial pointing",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=8457787217120162805&hl=en&oi=scholarr",
            "Abstract": "The successful emulation of human pointing involves elements of spatial algorithms and databases, Location Based Services, mobile GIS and context awareness. We propose the term Mobile Spatial Pointing (MSP) as a special case of the Mobile Spatial Interaction (MSI) paradigm, where mobile users point at objects in their environment using multi-sensor enabled mobile devices. The goal of this article is to provide experimental evidence that different MSP algorithms are optimal in effectiveness and efficiency depending on context and user intention. A series of experiments with new algorithms were carried out. The experimental results demonstrate that spatial pointing efficacy is influenced by user, physical and computational context-aware aspects. We conclude that no algorithm is optimal for all application situations of digital pointing, whence MSP systems should be designed adaptively using context-aware …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FROG: rapid prototyping of collaborative learning scenarios",
            "Publication year": 2017,
            "Publication url": "https://infoscience.epfl.ch/record/230014/files/ECTEL%20FROG%20Demo.pdf",
            "Abstract": "We describe FROG, an integrated environment for authoring and running collaborative learning scenarios, called Orchestration Graphs. We describe the pedagogical background and the technical architecture, and present a case study of a teacher using FROG to experiment with a variation of a jigsaw script.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On Developing and Communicating User Models for Distance Learning Based on Assignment and Exam Data",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-77471-6_8",
            "Abstract": "Students who enrol in the undergraduate program on informatics at the Hellenic Open University (HOU) demonstrate significant difficulties in advancing beyond the introductory courses. We use decision trees and genetic algorithms to analyze their academic performance throughout an academic year. Based on the accuracy of the generated rules, we analyze the educational impact of specific tutoring practices. We examine the applicability of these techniques in a senior course and reflect on some software engineering issues involved in the development of organization-wide measurement systems. All results are based on data drawn from academic records.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Adapt and They Shall Come: Aspects of Online Teacher-Parent Collaboration in 6 Case Studies with At-Risk Students",
            "Publication year": 2019,
            "Publication url": "https://www.learntechlib.org/p/174854/",
            "Abstract": "This paper describes a collateral finding from an educational intervention with at-risk primary school pupils in which parents were called to leverage teacher's adaptive teaching efforts for their children. Efficient communication and effective collaboration are prerequisites, but not given; and establishing them unsurprisingly required flexibility on the part of the teacher, flexibility which, perhaps unexpectedly, turned out to be sufficient. A participatory action research was conducted with parents of six at-risk students of primary education in the Republic of Cyprus, attending the same class in the fifth grade. The children had been identified to be at-risk using the official assessment tool employed by the Ministry of Education and Culture in Cyprus. All children came from a small size school in an underprivileged urban area. Initially, a special-purpose online platform (specifically designed for this purpose) was used for …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:dshw04ExmUIC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Advances in Spatial and Temporal Databases",
            "Publication year": 2003,
            "Publication url": "https://agris.fao.org/agris-search/search.do?recordID=US201300093461",
            "Abstract": "Advances in spatial and temporal databases FAO_logo home-icon English Español Français \nالعربية 中文 Русский home-icon Translate with Google Access the full text Link Lookup at \nGoogle Scholar google-logo Bibliographic information Language : English Type : Bibliography \nIn AGRIS since : 2013 Start Page : : ill. ; 24 cm. Publisher : Springer ISBN : 3540405356 All \ntitles : \" 8th international symposium, SSTD 2003, Santorini Island, Greece, July 24-27, 2003 : \nproceedings \" \" SSTD 2003 \" \" Advances in spatial and temporal databases \" Save as: \nAGRIS_AP RIS EndNote(XML) Advances in spatial and temporal databases Loading... Paper \nWritten Paper Advances in spatial and temporal databases [2003] Hadzilacos, Thanasis 1953- \nAccess the full text Link Lookup at Google Scholar google-logo Access the full text Link Lookup \nat Google Scholar google-logo Loading... Bibliographic information Language : English : : -…",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:abG-DnoFyZgC",
            "Publisher": "Springer"
        },
        {
            "Title": "HRI usability evaluation of interaction modes for a teleoperated agricultural robotic sprayer",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0003687017300674",
            "Abstract": "Teleoperation of an agricultural robotic system requires effective and efficient human-robot interaction. This paper investigates the usability of different interaction modes for agricultural robot teleoperation. Specifically, we examined the overall influence of two types of output devices (PC screen, head mounted display), two types of peripheral vision support mechanisms (single view, multiple views), and two types of control input devices (PC keyboard, PS3 gamepad) on observed and perceived usability of a teleoperated agricultural sprayer. A modular user interface for teleoperating an agricultural robot sprayer was constructed and field-tested. Evaluation included eight interaction modes: the different combinations of the 3 factors. Thirty representative participants used each interaction mode to navigate the robot along a vineyard and spray grape clusters based on a 2 × 2 × 2 repeated measures experimental design …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:rO6llkc54NcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Constructive m-learning environments",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1508672/",
            "Abstract": "In this paper we deal with constructive mobile learning, i.e., a positive approach to combining learning with moving, field education with ICT, personalized and learner-enhanced learning material. Technically it is based on location dependency of educational content and method and desegregates moving and information processing for a learner community. A comprehensive example for a 101 grade class studying history coupled with several interdisciplinary educational goals is given. Analysis and organization of information leads to the specification of m-learning objects dynamically created based on learner's location, movement, learners' profile and curriculum.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Providing universal access to history textbooks: a modified GIS case",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-10601-9_7",
            "Abstract": "Integrating and accessing structured textual content from various sources is a challenging task and becomes even more so when dealing with multiple languages. The objective of this work is to showcase the technological efforts towards the creation of a digital European history textbook repository that integrates respective textbooks from various countries and publishers. The content integration is achieved by introducing language independent metadata based on space (locations), time (dates), and thematic categories (history gazetteer). Providing adequate interfaces such metadata can be used to provide language-independent access to Multilanguage history textbook content. The specific focus in this work will be on (i) presenting the metadata, (ii) the data management approach including indexing the history textbook content and (iii) the resulting textbook repository including its GIS-based interface …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Learning design for mobile and contextual learning",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/31619230/LD-CAMSOA-mlearn_camera_submitted.pdf",
            "Abstract": "The aim of this paper is to apply the pedagogically neutral language of Learning Design–LD (a defacto standard specification for online learning) in the process of modeling contextual information into mobile learning. This will allow mobile and contextual learning to benefit from the numerous available LD-compliant runtime environments and editors. Specifically, this paper proposes:(1) a conceptual extension of the IMS LD Information Model suitable for mobile and contextual learning,(2) the extended Information Model,(3) the resulting context aware model and (4) the ontology derived from this model.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integration of theory, ICT tooling and practical wisdom of teacher: a case of adaptive learning",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-09635-3_16",
            "Abstract": "Teachers adapt their lessons with or without the use of technology - but in a traditional class setting they target the imaginary “average student”. This paper discusses how the teacher’s “wisdom of practice” can intervene and inform the Technology Enhanced Learning process. Our methodology is developed and enacted upon two theories: a domain-specific learning design theory in mathematics and a generic model derived from curriculum studies. The products of the intervention are: an adaptive learning strategy and an adaptive e-course in the domain of mathematics. Also, a roadmap is proposed concerning the stakeholders’ involvement, especially the active role of the teacher in the design process. It is based on conceptual mappings between the design-based research steps and the theories used to orientate the research.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Implementation of adaptive learning designs",
            "Publication year": 2012,
            "Publication url": "http://mail.ace.ucv.ro/analele/2012_vol2/04_Mavroudi_Anna.pdf",
            "Abstract": "Designing adaptive learning activities, ie activities which provide learner-dependant variant learning experiences, is an inherently demanding pedagogical task. Designing adaptive elearning activities should not add disproportionate technical difficulties to the task. IMS-Learning Design purports to provide a pedagogically neutral and technically smooth environment for the design of educationally rich, including adaptive, learning scenarios. However, although IMS-Learning Design has been effectively used for adaptive, web-based learning, most teachers and instructional designers consider it to be technically out of their reach. Two examples of IMS-Learning Design compliant adaptive web-based learning activities are presented in this paper to show that this is not really the case. Learner profiling and personalization is achieved in adaptive courseware compliant with the IMS-Learning Design specification, including a diagnostic learning style test and an educational recommender system. These components make use of the learning style and prior knowledge respectively, in order to adapt the presentation of the learning material and the feedback given to the learner.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Let me do it: towards the implementation of sustainable instructional patterns",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7757011/",
            "Abstract": "We present the design of an online environment providing mechanisms for the exploitation of school ICT infrastructure by empowering teachers to discover and comment on educational activities (patterns, scenarios, experience reports) that can be implemented in their schools. To this end, our design approach will make explicit the linking between the patterns, the learning scenarios and other contextual information. The online environment will not only serve as a repository of educational activities but will help schools to analyze their infrastructure, to select proper scenarios that effectively exploit it and, potentially, to enrich these scenarios by commenting on them.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Group-Work in the Design of Complex Adaptive Learning Strategies.",
            "Publication year": 2013,
            "Publication url": "https://eric.ed.gov/?id=EJ1034707",
            "Abstract": "This paper presents a case study where twelve graduate students undertook the demanding role of the adaptive e-course developer and worked collaboratively on an authentic and complex design task in the context of open and distance tertiary education. The students had to work in groups in order to conceptualise and design a learning scenario for adaptive learning, develop learning materials and adaptive learning strategies, implement the respective adaptive e-course and finally, reflect on their experience. The primary goal of this intervention was to engage the students in the whole lifecycle of a Technology Enhanced Learning design artefact. In teaching highly complex skills for the ill-structured domain of Learning Design the four components instructional model (4C/ID) was exploited. Students were exposed to a wide range of interconnected issues and made design choices. Mixed research methods are used to conclude on the effectiveness of the intervention. Implications of this study include design guidelines towards an environment that implements complex adaptive behaviour in today's learner-generated digital world where Computer Supported Collaborative Learning often converges with Computer Supported Collaborative Design.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Institute of Educational Technology, The Open University. Walton Hall, Milton Keynes, MK7 6AA, UK"
        },
        {
            "Title": "Semantic abstractions in the multimedia domain",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1161587/",
            "Abstract": "Information searching by exactly matching content is traditionally a strong point of machine searching; this is not, however, how human memory works and is rarely satisfactory for advanced retrieval tasks in any domain-multimedia in particular, where the presentational aspects can be equally important to the semantic information content. A combined abstraction of the conceptual and presentational characteristics of multimedia applications, leading on the one hand to their conceptual structure (with classic semantics of the real-world modeled by entities, relationships, and attributes) and on the other to the presentational structure (including media type, logical structure, temporal synchronization, spatial (on the screen) \"synchronization\" and interactive behavior) is developed in this paper. Multimedia applications are construed as consisting of \"Presentational Units:\" elementary (a media object with play duration and …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Technical Problem Based E-Language Instruction for Vocational Students",
            "Publication year": 2016,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2691934",
            "Abstract": "We discuss an intervention in mother language instruction in a Greek Vocational Lyceum combining Web 2.0 tools with electronic writing pedagogy. During a full school year (2012-13), forty six 11th grade students with typically low literacy skills participated, randomly separated in control and experimental group. The latter systematically dealt with Technical Problem Solving and completed online (Edmodo) increasingly complex writing tasks. Encouraged to reflect on and solve technical problems, they activated language skills for communicating their solutions through the synthesis of technical text-genres. Meanwhile the control group followed the conventional teaching method using the usual literary texts. Pre and post-test measurements demonstrated that, while both groups improved, the experimental group made significantly more progress in their language efficiency and writing.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "User interface considerations for telerobotics: The case of an agricultural robot sprayer",
            "Publication year": 2014,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9229/92291W/User-interface-considerations-for-telerobotics--the-case-of-an/10.1117/12.2068318.short",
            "Abstract": "Agricultural robots can tackle harsh working conditions and hardness of work, as well as the shortage of laborers that is a bottleneck to agricultural production. Such robots exist, but they are not yet widespread. We believe that the limited usage of robotics in agriculture could be related to the fact that the mainstream direction for robotics in agriculture is full automation. The teleoperation of an agricultural robotic system can enable improved performance overcoming the complexity that current autonomous robots face due to the dynamic and unstructured agricultural environment. A field study was conducted to evaluate eight different user interfaces aiming to determine the factors that should be taken into consideration by designers while developing user interfaces for robot teleoperation in agriculture. Thirty participants, including farmers and agricultural engineers, were asked to use different teleoperation interaction …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:IWHjjKOFINEC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "On the Creation of Sustainable Design Patterns of ICT Integration in the Classroom",
            "Publication year": 2016,
            "Publication url": "https://aisel.aisnet.org/cgi/viewcontent.cgi?article=1059&context=mcis2016",
            "Abstract": "The paper focuses on the methodology of making observations that account for the actual use of ICT infrastructure and tools in the classroom. The observational study is part of a project that focuses on scenario feasibility as an enabler of ICT usage. In particular, the observations provide input on pattern mining with the aim to help teachers and other stakeholders in the decision-making process of selecting suitable ICT facilities.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:g5m5HwL7SMYC",
            "Publisher": "Association For Information Systems"
        },
        {
            "Title": "Online communities in mobile learning: a new learning paradigm",
            "Publication year": 2011,
            "Publication url": "https://aisel.aisnet.org/mcis2011/79/",
            "Abstract": "\"Online communities in mobile learning: a new learning paradigm\" by Anna Mavroudi, \nThanasis Hadzilacos et al. Home Search Browse All Content My Account About DC \nNetwork Digital Commons Network™ Skip to main content AIS Electronic Library (AISeL) \nAssociation for Information Systems eLibrary Login FAQ About Home Join AIS Home > \nAffiliated Conferences > MCIS Proceedings > MCIS2011 > 79 MCIS 2011 Proceedings \nOnline communities in mobile learning: a new learning paradigm Anna Mavroudi Thanasis \nHadzilacos Maria Fountana Abstract This paper has been withdrawn. Search Enter search \nterms: Advanced Search Notify me via email or RSS Links Join AIS MCIS 2011 Proceedings \nWebsite Browse All Content Authors Author Corner eLibrary FAQ Digital Commons Home | \nAbout | FAQ | Editor Login | Accessibility Statement Privacy Copyright …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Providing tools for the development of cognitive skills in the context of Learning Design-based e-learning environments",
            "Publication year": 2007,
            "Publication url": "https://www.learntechlib.org/p/26585/",
            "Abstract": "This paper focuses on the design of learning tools that appropriately support'Learning Design'(Koper and Tattersall, 2005). Specifically, these tools can be used in lesson planning to encourage the development of critical thinking in learners. In particular, a Cognitive Skill-based Question Wizard (CSQ-Wizard) is proposed as a supporting tool for teachers in their attempts to design appropriate lesson plans that can encourage the development of cognitive skills in learners. The design of this CSQ-Wizard is based on modern social and constructivist views of learning. The idea, the rationale, the architecture and the interface associated with the proposed CSQ-Wizard is presented through a specific example of possible implementation within LAMS; a web-based open source environment that supports Learning Design.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:aqlVkmm33-oC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "User interface design principles for robotics in agriculture: The case of telerobotic navigation and target selection for spraying",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/George-Adamides/publication/257660897_User_Interface_Design_Principles_for_Robotics_in_Agriculture_The_Case_of_Telerobotic_Navigation_and_Target_Selection_for_Spraying/links/02e7e525ba70c21a56000000/User-Interface-Design-Principles-for-Robotics-in-Agriculture-The-Case-of-Telerobotic-Navigation-and-Target-Selection-for-Spraying.pdf",
            "Abstract": "Introducing semi-automatic teleoperation of an agricultural robotic system can enable improved performance overcoming the complexity that current autonomous robots face due to the dynamic and unstructured agriculture environment. This requires design of a human-robot interface. A user interface for a vineyard robotic sprayer was implemented including functions. The user interface incorporates several functions; robot navigation, target selection and spraying. Following examination of the user interface several usability limitations were identified. Semi-automatic teleoperation implies that the user is not collocated with the robot, and therefore, when designing a user interface several principles must be considered aiming to improve the usability of user interface. In the case of an interface for semi-automatic teleoperation in agricultural robotics, such principles include: visibility, safety, simplicity, feedback, extensibility, and cognitive load reduction. The contribution of this paper is to specify the design guidelines of a user interface for a human-robot cooperative, agricultural robot, in the case of vineyard spraying. Future work will include other interaction styles such as post-WIMP interfaces, within the framework of the AgriRobot project. This research also proposes a methodology to evaluate the usability of the user interface and to examine the human factors (eg, user awareness, user centered design, interaction styles, learnability) and human-robot interaction parameters (eg, level of autonomy, interaction roles).",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Διεθνές Συνέδριο για την Ανοικτή & εξ Αποστάσεως Εκπαίδευση",
            "Publication year": 2009,
            "Publication url": "https://scholar.archive.org/work/ndnknrjv3fcefe6uxpv6zydsom/access/wayback/https://eproceedings.epublishing.ekt.gr/index.php/openedu/article/download/466/440",
            "Abstract": "This paper presents the design and initial implementation of an ICT-based distance learning framework that exploits current trends in distance learning, in particular elearning tools and features that are collectively known as “Web 2.0 tools”(eg, blogs, wikis, social networks, podcasting). The project involves people who live in remote areas and aims for the mutual interaction, creation, share and reuse of information in order to provide useful lifelong education towards shaping the local mentality of the remote community from that of an overlooked inhabitant of a forgotten region to a European citizen, at the same time respecting linguistic and cultural diversities.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A tool for assessing text suitability for Greek Language teaching",
            "Publication year": 2018,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0735633117731381",
            "Abstract": "Viewing its use in language teaching mainly as a text corpus, this article examines the problem of the assessment of suitability of this material for use in the Greek language course in Cyprus schooling. The suitability of texts for use in language teaching is defined by four parameters, which are described in detail in this article: text readability, content, genre, and grammatical information. The literature review shows the research gap as to the ways of finding on the Web a suitable text for use in language teaching according to specific characteristics. The tool diaKeimenou, which is presented in this article, aims to fill this gap and help the teacher choose the most suitable texts for teaching with reasonable effort and time. The results of the usability evaluation of diaKeimenou are also presented in this article.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:dfsIfKJdRG4C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Experiences from Virtual Classrooms in a Computer Science Course.(in Greek)",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=8048322889045713191&hl=en&oi=scholarr",
            "Abstract": "Αυτή η τεχνική αναφορά παρουσιάζει τη σχεδίαση και εφαρμογή των ιδεατών αιθουσών διδασκαλίας (virtual classrooms) στο τμήμα Α14 της ΘΕ ΠΛΗ-10 του ΠΣ Πληροφορικής του ΕΑΠ. Περιγράφει τη χρήση των virtual classrooms για τις ανάγκες 2 Ομαδικών Συμβουλευτικών Συναντήσεων (ΟΣΣ). Οι ΟΣΣ αυτές έγιναν με τη χρήση του εργαλείου Centra και αντιστοιχούσαν στη δεύτερη και τρίτη ΟΣΣ του τμήματος Α14. Ειδικότερα η 2η ΟΣΣ έγινε με τη φυσική παρουσία των φοιτητών στην Αθήνα, αλλά με τη χρήση υπολογιστών και με στόχο να υπάρξει εξοικείωση με το εργαλείο που θα χρησιμοποιούσαν οι φοιτητές στα πλαίσια του virtual classroom στην 3η ΟΣΣ. Η 3η ΟΣΣ έγινε από απόσταση και βασίστηκε στο virtual classroom. Η αναφορά αυτή επικεντρώνει στις εμπειρίες και τους προβληματισμούς στο Εργαστήριο Εκπαιδευτικού Υλικού & Μεθοδολογίας από τη χρήση αυτής της τεχνολογίας στο ΕΑΠ.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Historical overview of adaptive e-learning approaches focusing on the underlying pedagogy",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-287-868-7_13",
            "Abstract": "This paper attempts a historical overview of adaptive e-learning approaches through the lens of a well-known categorization, which distinguishes among the macro-adaptive approach, the aptitude–treatment interaction approach, the micro-adaptive approach, and the constructivist–collaborative approach. Early and more recent examples in each category are presented in order to conclude on similarities and differences among the approaches. The history of adaptive e-learning systems is discussed, and the main conclusion drawn is that, historically, the development of adaptive e-learning systems has followed the trends of education and cognitive science.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "WEB based technical problem solving for enhancing writing skills of secondary vocational students",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-016-9520-y",
            "Abstract": "We discuss some aspects of a pilot e-learning technical writing course addressed to 11th grade vocational high school students in Greece. The application of this alternative teaching intervention stemmed from the researcher- instructor's reflections relating to the integration of a problem based e-pedagogy that aims not just to familiarize students with some technical writing text-types, but to trigger a positive way of thinking and writing and thus enhance students' linguistic literacy. Can genuine interest to content learning (the school's vocational sectors and technical subjects) revert the negative attitude towards school writing activities? And what if the teachers, taking advantage of this interest, converted the conventional language lesson to a web mediated, e-learning problem based language course by engaging more energetic, student-centered teaching and learning approaches? The study showed that a …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The processes of learning and teaching in the communication society",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=9477175086776189654&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilnets: A water main rehabilitation decision-support system",
            "Publication year": 2000,
            "Publication url": "https://www.sid.ir/en/journal/ViewPaper.aspx?ID=329799",
            "Abstract": "SID.ir | UTILNETS: A WATER MAIN REHABILITATION DECISION-SUPPORT SYSTEM Click \nfor new scientific resources and news about Corona[COVID-19] Use Online Translation \nPowered By Click Here STRS STRS www.SID.ir Home Journals Authors ISI Iranian Journals \nUpdated Journals JCR About Us Contact Us Help Others Scientific Information Databases \nبانک نشریات فارسی ایران بانک همایش های علمی فارسی ایران بانک طرح های پژوهشی فارسی ایران \nمراکز علمی تخصصی ایران English Journals Database of Iran English Seminars Database of \nIran Today: 6/13/2021 Advanced Search Papers ... English فارسی Paper Information Journal: \nCOMPUTERS ENVIRONMENT AND URBAN SYSTEMS 2000 , Volume 24 , Number 3; \nPage(s) 1 To 18. Paper: UTILNETS: A WATER MAIN REHABILITATION DECISION-SUPPORT \nSYSTEM Author(s): HADZILACOS T., KALLES D., PRESTON N. * * There is no information …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:NMxIlDl6LWMC",
            "Publisher": "COMPUTERS ENVIRONMENT AND URBAN SYSTEMS"
        },
        {
            "Title": "OVERVIEW & CLASSIFICATION OF WEB-BASED EDUCATION (SYSTEMS, TOOLS & PRACTICES)",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.414.1552&rep=rep1&type=pdf",
            "Abstract": "We present a classification of web-based education systems, tools and practices, focusing on the learning process and in particular on what the learner does while learning. The classification is based on six basic functions during the learning process: information storing/retrieving; written expression; communication and publication; experimentation including programming, simulation and virtual reality; administration; and what is today ‘advanced usage’. The paper also presents a brief overview of systems, tools and practices currently used in web-based education, including examples of actual usage characterized according to these learning process functions. Plotting learning functionality requirements vs web-systems functionality provided we can clearly see the needs and opportunities ahead.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and development of a semi‐autonomous agricultural vineyard sprayer: Human–robot interaction aspects",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/rob.21721",
            "Abstract": "This article presents the design aspects and development processes to transform a general‐purpose mobile robotic platform into a semi‐autonomous agricultural robot sprayer focusing on user interfaces for teleoperation. The hardware and the software modules that must be installed onto the system are described, with particular emphasis on human–robot interaction. Details of the technology are given focusing on the user interface aspects. Two laboratory experiments and two studies in the field to evaluate the usability of the user interface provide evidence for the increased usability of a prototype robotic system. Specifically, the study aimed to empirically evaluate the type of target selection input device mouse and digital pen outperformed Wiimote in terms of usability. A field experiment evaluated the effect of three design factors: (a) type of screen output, (b) number of views, (c) type of robot control input device …",
            "Abstract entirety": 0,
            "Author pub id": "01kuev4AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using E-Learning to Address the Educational Digital Divide in Remote Communities in the EU: Best Practices and Lessons Learnt from the REVIT Project",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/chapter/using-e-learning-to-address-the-educational-digital-divide-in-remote-communities-in-the-eu/82853",
            "Abstract": "Digital Divide may manifest itself in terms of educational opportunities, especially in remote or insular areas. REVIT, an e-inclusion project, proved that e-learning courses can be designed, developed, and implemented to address the needs as these are described by the trainees themselves in an economically feasible, pedagogically sound, and technologically advanced way. The educational outcome of the project is not a “techie” product threatening to alienate the intended audience. Rather, the medium becomes the message and in some cases the tool employed by the citizens of remote or insular areas to establish their own online communities. This is the value brought forward by the REVIT project.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:mB3voiENLucC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "On the software engineering aspects of educational intelligence",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11893004_144",
            "Abstract": "Students who enroll in the undergraduate program on informatics at the Hellenic Open University (HOU) demonstrate significant difficulties in advancing beyond the introductory courses. We use decision trees and genetic algorithms to analyze their academic performance throughout an academic year. Based on the accuracy of the generated rules, we analyze the educational impact of specific tutoring practices and reflect on some software engineering issues involved in the development of organization-wide measurement systems.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Distributed E-Learning Service for Remote Areas.",
            "Publication year": 2010,
            "Publication url": "https://aisel.aisnet.org/cgi/viewcontent.cgi?article=1059&context=mcis2010",
            "Abstract": "The cloud-compatible architecture of a distributed distance e-learning system which has been deployed and is being utilized in five remote areas in Eastern Europe (Finland, Poland, Bulgaria, Greece and Cyprus) is presented and discussed as a case study of e-learning. A series of e-courses is being conducted with a variety of learning tools and techniques: a Virtual World, Web 2.0 tools, a web conference platform and a learning management system. Emphasis is placed on the feasibility of the delivery of the integrated Distance Learning (DL) service through distributed web services; an architecture is proposed that extends the existing one by implementing the DL service in the form of a SOA in a hybrid cloud.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in Spatial and Temporal Databases: 8th International Symposium, SSTD 2003, Santorini Island, Greece, July 24-27, 2003. Proceedings",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=sgBqCQAAQBAJ&oi=fnd&pg=PA1&dq=info:mUsaLwmBMU0J:scholar.google.com&ots=F1iEeNEIj8&sig=GMtVupquWeVrEaGbokIVrZBdHTg",
            "Abstract": "The refereed proceedings of the 8th International Symposium on Spatial and Temporal Databases, SSTD 2003, held at Santorini Island, Greece in July 2003. The 28 revised full papers presented together with a keynote paper were carefully reviewed and selected from 105 submissions. The papers are organized in topical sections on access methods, advanced query processing, data mining and data warehousing, distance-based queries, mobility and moving points management, modeling and languages, similarity processing, systems and implementation issues.",
            "Abstract entirety": 1,
            "Author pub id": "01kuev4AAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer"
        }
    ]
}]