[{
    "name": "Θεόδωρος  Αποστολόπουλος",
    "romanize name": "Theodoros  Apostolopoulos",
    "School-Department": "Πληροφορικής",
    "University": "aueb",
    "Rank": "Καθηγητής",
    "Apella_id": 19284,
    "Scholar name": "Theodore Apostolopoulos",
    "Scholar id": "WTg8mXoAAAAJ",
    "Affiliation": "Professor, Dept. of Informatics, Athens University of Economics & Business, Greece",
    "Citedby": 1001,
    "Interests": [
        "computer networks"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=WTg8mXoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Trust, Privacy and Security in Digital Business: 5th International Conference, TrustBus 2008 Turin, Italy, September 1-5, 2008, Proceedings",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3kltCQAAQBAJ&oi=fnd&pg=PP2&dq=info:I3xL1Z-XxOQJ:scholar.google.com&ots=Cv3piTe72M&sig=IjMQ62ZSBFuBFZ0t6bSQNdW36Dg",
            "Abstract": "This book contains the proceedings of the 5th International Conference on Trust, Privacy and Security in Digital Business (TrustBus 2008), held in Turin, Italy on 4–5 September 2008. Previous events in the TrustBus series were held in Zaragoza, Spain (2004), Copenhagen, Denmark (2005), Krakow, Poland (2006), and Regensburg, Germany (2007). TrustBus 2008 brought together academic researchers and industrial developers to discuss the state of the art in technology for establishing trust, privacy and security in digital business. We thank the attendees for coming to Turin to parti-pate and debate upon the latest advances in this area. The conference program included one keynote presentation and six technical paper sessions. The keynote speech was delivered by Andreas Pfitzmann from the Technical University of Dresden, Germany, on the topic of “Biometrics–How to Put to Use and How Not at All”. The reviewed paper sessions covered a broad range of topics,-cluding trust and reputation systems, security policies and identity management, p-vacy, intrusion detection and authentication, authorization and access control. Each of the submitted papers was assigned to five referees for review. The program committee ultimately accepted 18 papers for inclusion in the proceedings.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:WC23djZS0W4C",
            "Publisher": "Springer"
        },
        {
            "Title": "An open architecture for monitoring and measuring QoS indicators in wireless community networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4510817/",
            "Abstract": "Wireless community networks (WCNs) are wide-area wireless networks whose nodes are owned and managed by volunteers. These networks are rarely supported by any infrastructure for measuring network performance indicators. In this paper, we present the design, the implementation and the experimental evaluation of KIXEM, an open agent-based architecture, whose design meets the special requirements and characteristics of WCNs. The proposed architecture is designed to passively monitor multiple wireless routing nodes within a WCN, in order to extract flow based network measurements. KIXEM is evaluated on a simulated WCN, representing part of the Athens wireless metropolitan network.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using a Web-based Framework to Manage Grid Deployments.",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/43260156/Using_a_Web-based_Framework_to_Manage_Gr20160302-20905-1e2jgw8.pdf",
            "Abstract": "Management of Distributed services. It is based on the Web-based Enterprise Management (WBEM) standards family and introduces a middleware layer of entities called “Representatives”. Details related to the managed application are detached from the representative logic, making the framework suitable for a variety of services. WebDMF can be integrated with existing WBEM infrastructures and is complementary to web service-based management efforts. This paper describes how the framework can be used to manage grids without modifications to existing installations. It compares the proposed solution with other research initiatives. Experiments on an emulated network topology indicate its viability.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "George Parissis",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.359.8290&rep=rep1&type=pdf",
            "Abstract": "I gratefully thank Prof. Theodore Apostolopoulos for his collaboration and guidance in my research and for his great support during difficult time periods regarding my personal and research life. He has also been my supervisor in several business projects that made me look at the real world in a different perspective.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Statistical analysis of the performance of IEEE 802.11 LANs",
            "Publication year": 2003,
            "Publication url": "https://research-information.bris.ac.uk/en/publications/statistical-analysis-of-the-performance-of-ieee-80211-lans",
            "Abstract": "Wireless LAN technology is relatively new and rapidly developing. The performance of such networks is of great importance and deep understanding is required in order to take advantage of their full potential. In our work, we installed an infrastructure IEEE 802.11 b compliant Wireless LAN in the Computer and Communication Systems Laboratory, measured its performance and analyzed it, using statistical methods. Our ultimate goal was to study the impact of various operational parameters on the aforementioned performance.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An XML-based e-learning service management framework",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1357686/",
            "Abstract": "The aim of this paper is proposing a flexible and component-oriented XML-based e-learning services management framework taking into account several parameters concerning the educational process, the network infrastructure, the QoS requirements, the available educational content, etc. Within this framework, a session profile is dynamically created for each request for e-learning service according to current context.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Trusted Computing vs. Advanced Persistent Threats: Can a defender win this game?",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6726235/",
            "Abstract": "As both the number and the complexity of cyber attacks continuously increase, it is becoming evident that traditional security mechanisms have limited success in detecting sophisticated threats. Stuxnet, Duqu, Flame, Red October and, more recently, Miniduke, have troubled the security community due to their severe complexity and their ability to evade detection in some cases for several years, while exfiltrating gigabytes of data or sabotaging critical infrastructures. The significant technical and financial resources needed for orchestrating such complex attacks are a clear indication that perpetrators are well organized and, likely, working under a state umbrella. In this paper we perform a technical analysis of these advanced persistent threats, highlighting particular characteristics and identifying common patterns and techniques. We also focus on the issues that enabled the malware to evade detection from a wide …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:jgBuDB5drN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Managing the network state evolution over time using CORBA environment",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/842982/",
            "Abstract": "This paper proposes a CORBA-based framework for managing the network state evolution over time. This framework is based on the concept of CORBA temporal agents, capable of managing the past and current behavior of network resources. Managed objects use specific time attributes for representing how their values are evolving in time. Moreover, specially designed operations (services) enable users to exploit the temporal dimension of management information in order to understand the past, control the present, and thus even predict the future of managed objects. The management environment is designed in order to provide coexistence and interoperability with existing management platforms.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Overtester: A Peer-to-Peer, Modular Toolkit for Network Performance Evaluation",
            "Publication year": 2004,
            "Publication url": "https://research-information.bris.ac.uk/en/publications/overtester-a-peer-to-peer-modular-toolkit-for-network-performance",
            "Abstract": "The field of network performance evaluation is of great significance for researchers and network administrators alike. This has resulted in a great number of applications designed to aid the process. These applications vary quite a bit, ranging from simple tools, such as the famous ping program all the way to complex and sophisticated ones. OverTester resides on top of other performance measurement programs, like a management console, automating and co-coordinating the process. It is Modular, while its most significant features are its Peer-to-Peer and Cross-Platform nature.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:6bLC7aUMtPcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A taxonomy of side channel attacks on critical infrastructures and relevant systems",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-00024-0_15.pdf",
            "Abstract": "Information disclosure leads to serious exploits, disruption or damage of critical operations and privacy breaches, both in Critical Infrastructures (CIs) and Industrial Control Systems (ICS) and in traditional IT systems. Side channel attacks in computer security refer to attacks on data confidentiality through information gained from the physical implementation of a system, rather an attack on the algorithm or software itself. Depending on the source and the type of information leakage, certain general types of side channel attacks have been established: power, electromagnetic, cache, timing, sensor-based, acoustic and memory analysis attacks. Given the sensitive nature of ICS and the vast amount of information stored on IT systems, consequences of side channel attacks can be quite significant. In this paper, we present an extensive survey on side channel attacks that can be implemented either on ICS or …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:L1USKYWJimsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Side Channel Attacks over Encrypted TCP/IP Modbus Reveal Functionality Leaks.",
            "Publication year": 2018,
            "Publication url": "https://www.scitepress.org/Papers/2018/68327/68327.pdf",
            "Abstract": "With HMI systems becoming increasingly connected with the internet, more and more critical infrastructures are starting to query PLC/RTU units through the Web through MODBUS ports. Commands sent from such interfaces are inevitably exposed to potential attacks even if encryption measures are in place. During the last decade, side channels have been widely exploited, focusing mostly on information disclosure. In this paper, we show that despite encryption, targeted side channel attacks on encrypted packets may lead to information disclosure of functionality over encrypted TCP/IP running MODBUS RTU protocol. Specifically, we found that any web interface that implements unpadded encryption with specific block cipher modes (eg CFB, GCM, OFB and CTR modes) or most stream ciphers (eg RC4) to send MODBUS functions over TCP/IP is subject to differential packet size attacks. A major cause for this attack is the very small number of potential MODBUS commands and differences in packet sizes, which leads to distinctions in traffic. To support the importance of these findings, we conducted research on Shodan looking for relevant devices with open MODBUS ports over TCP/IP that utilize encrypted web traffic. The result was that a significant amount of web interfaces communicate with MODBUS ports and many use unpadded ciphers and SSL with AES-GCM or RC4. We also implemented a PoC on a simulated architecture to validate our attack models.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:-mN3Mh-tlDkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An open financial services architecture based on the use of intelligent mobile devices",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1567422307000324",
            "Abstract": "The scope of this paper is to explore, analyze and develop a universal architecture that supports mobile payments and mobile banking, taking into consideration the third and the emerging fourth generation communication technologies. Interaction and cooperation between payment and banking systems, integration of existing technologies and exploitation of intelligent procedures provide the prospect to develop an open financial services architecture (OFSA), which satisfies requirements of all involved entities. A unified scenario is designed and a prototype is implemented to demonstrate the feasibility of the proposed architecture.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "CYBER OPERATIONS AND INTERNATIONAL HUMANITARIAN LAW: OBSTACLES IN APPLYING INTERNATIONAL LAW RULES IN CYBER WARFARE",
            "Publication year": 2015,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.704.7745&rep=rep1&type=pdf",
            "Abstract": "The increasing number of cyberattacks has transformed ‘Cyberspace’into a “battlefield”, bringing out'Cyber warfare'as the'fifth dimension of war'and emphasizing the States’ need to effectively protect themselves against these attacks. The existing legal framework seem inadequate to deal effectively with cyber operations and, from a strictly legal standpoint, it indicates that addressing cyberattacks does not fall within the jurisdiction of just one legal branch. This is mainly due to the fact that the concept of cyber warfare itself, is open to many different interpretations ranging from cyber operations performed by states within the context of armed conflict, under International Humanitarian Law, to illicit activities of all kinds performed by non-state actors including cybercriminals and terrorist groups. The paper initially presents major cyber-attack incidents and their impact on States. On this basis, it examines the existing legal framework at the European and International level. Furthermore, it approaches ‘cyber warfare’from the perspective of International Law and focuses on two major issues relating to cyber operations ie “jurisdiction” and “attribution”. The multi-layered process of attribution in combination with a variety of jurisdictional bases in International Law makes the successful tackling of cyberattacks difficult. The paper aims at identifying technical, legal and last but not least political difficulties and at emphasizing the complexity in applying International Law rules in cyber operations.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:U4n9YNQMCAIC",
            "Publisher": "Information and Computer Security"
        },
        {
            "Title": "Managing Large-Scale Service Deployment: 19th IFIP/IEEE International Workshop on Distributed Systems: Operations and Management, DSOM 2008, Samos Island, Greece, September 22-26, 2008, Proceedings",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=23SqCAAAQBAJ&oi=fnd&pg=PR2&dq=info:PfwqbDcTzTkJ:scholar.google.com&ots=BsrdDu0NYq&sig=cjWcMqr7m5jtVmJlBgpd4i__UhQ",
            "Abstract": "This volume of the Lecture Notes in Computer Science series contains all papers accepted for presentation at the 19th IFIP/IEEE International Workshop on Distributed Systems: Operations and Management (DSOM 2008), which was held September 25-26, 2008 on the island of Samos, Greece. DSOM 2008 was the 19th event in a series of annual workshops. It followed in the footsteps of previous s-cessful meetings, the most recent of which were held in San Jos ́ e, California, USA (DSOM 2007), Dublin, Ireland (DSOM 2006), Barcelona, Spain (DSOM 2005), Davis, California, USA (DSOM 2004), Heidelberg, Germany (DSOM 2003), and Montreal, Canada (DSOM 2002). The goal of the DSOM workshops is to bring together researchers from industry and academia working in the areas of n-works, systems, and service management, to discuss recent advances and foster future growth. In contrast to the larger management conferences, such as IM (Integrated Network Management) and NOMS (Network Operations and M-agement Symposium), DSOM workshops have a single-track program in order to stimulate more intense interaction among participants. The theme of DSOM 2008 was “Managing Large-Scale Service Deployment” focusing both on management of overlay networks and on virtualized service-frastructures. The concepts of abstract overlays and virtualization constitute key contributors for e? cient large-scale service deployment and testing. Scalable-stract overlay networks accompanied with appropriate management techniques o? er? exibility for future service deployment and consumption with high qu-ity of experience.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:WHdLCjDvYFkC",
            "Publisher": "Springer"
        },
        {
            "Title": "Cyber-Attacks Evaluation Using Simple Additive Weighting Method on the Basis of Schmitt's Analysis.",
            "Publication year": 2016,
            "Publication url": "https://www.academia.edu/download/64478105/MCIS-2016%20Cyber%20Attack%20Evaluation%20using%20SAW%20Method.pdf",
            "Abstract": "A systematic modelling methodology is presented in this paper, so as to evaluate the effects of cyberattacks on states’ Critical Information Infrastructure, in order to answer the question of whether these attacks have risen to the level of a ‘use of force’under the principles of international law. By using the qualitative criteria for recognizing the impact of cyber-attacks as proposed by the International Group of Experts in the Manual on the International Law Applicable to Cyber Warfare (Tallinn Manual) and by applying the Simple Additive Weighting method, the widely used Multiple Attribute Decision Making method, cyber-operations evaluation results are presented. For the analysis a case study of kinetic and cyber-attacks on Supervisory Control and Data Acquisition system is employed. Taking into account the qualitative and quantitative aspects of such attacks and adding for the first time the ‘military character’attribute as defined by the Tallinn Manual in the calculation procedure, a more complete evaluation of such attacks is achieved.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:7Hz3ACDFbsoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Management using a Temporal Database Approach",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=t-V6CwAAQBAJ&oi=fnd&pg=PA417&dq=info:DCK0IVXr_McJ:scholar.google.com&ots=FuIX8VmgLn&sig=pWX7vGN6HcixHmTigooemSvdYZU",
            "Abstract": "Every day, all over the world, computer networks and hosts are broken into. The network manager has to establish specific network security mechanisms such as authentication, encryption, authorization, access control, firewalls, etc. in order to protect the network resources against Security threats. But, since network Security mechanisms are not impermeable, the network manager has to establish also procedures for continuously monitoring the network security. In this paper we propose a network management system which enables the monitoring and control of security in TCP/IP networks. The system admits the real-time monitoring of security management information by using the SNMP protocol. Moreover, the system includes facilities for collecting and efficiently storing historical security management information in a temporal database for off-line analysis. Finally, the adopted two level hierarchical network management architecture and the model for the security temporal management information base are also described in this paper.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:cK4Rrx0J3m0C",
            "Publisher": "Springer"
        },
        {
            "Title": "DHTbd: A reliable block-based storage system for high performance clusters",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5948630/",
            "Abstract": "Large, reliable and efficient storage systems are becoming increasingly important in enterprise environments. Our research in storage system design is oriented towards the exploitation of commodity hardware for building a high performance, resilient and scalable storage system. We present the design and implementation of DHTbd, a general purpose decentralized storage system where storage nodes support a distributed hash table based interface and clients are implemented as in-kernel device drivers. DHTbd, unlike most storage systems proposed to date, is implemented at the block device level of the I/O stack, a simple yet efficient design. The experimental evaluation of the proposed system demonstrates its very good I/O performance, its ability to scale to large clusters, as well as its robustness, even when massive failures occur.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Browser blacklists: the Utopia of phishing protection",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-25915-4_15",
            "Abstract": "Mobile devices - especially smartphones - have gained widespread adoption in recent years, due to the plethora of features they offer. The use of such devices for web browsing, accessing email services and social networking is also getting continuously more popular. The same holds true for other more sensitive online activities, such as online shopping, contactless payments, and web banking. However, the security mechanisms available on smartphones are not yet mature, while their effectiveness is still questionable. As a result, smartphone users face increased risks when performing sensitive online activities with their devices, compared to desktop/laptop users. In this paper, we present an evaluation of the phishing protection mechanisms that are available with the popular web browsers of the Android and iOS platform. Following, we compare the protection they offer against their desktop counterparts …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:BzfGm06jWhQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A framework for the management of distributed systems based on SNMP",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4456838/",
            "Abstract": "The traditional task of managing and monitoring a network has never been a trivial one. With recent changes in computing and networking, the area of distributed systems management faces new challenges and increasing complexity. Research in the relevant field reveals that, while there are many research and commercial solutions available, some of them are based on proprietary standards. Others focus on monitoring, while lacking the ability to actively make modifications and fine- tuning. Some others have a narrow target group. This paper proposes a framework for the management of distributed applications. The managed hosts are treated as integral parts of the deployment and not as stand alone, isolated entities. The framework is based on SNMP and is not limited to monitoring. On the contrary, it is capable of carrying out SNMP-SET commands, actively modifying the run-time parameters of the managed …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Time dependent network fault management model in a TCP/IP environment",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=10472789158400637179&hl=en&oi=scholarr",
            "Abstract": "In this paper, we address the topic of fault management proposing an extended information model, enabling us to incorporate directly time related information as an attribute of the network state information. Our perspective is based on a Temporal Management Information Base (TMIB) for fault management that represents the evolution in time of network resources. The proposed model may be implemented in a centralized or distributed environment. Moreover, the necessary primitive fault management services are defined. Finally, discussing the benefits of our approach, we briefly present a simple prototype implementing some aspects of the proposed model.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web-Based Management of Distributed Services",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-90-481-2311-7_22",
            "Abstract": "This paper presents WebDMF, a Web-based Framework for the Management of Distributed services. It is based on the Web-based Enterprise Management (WBEM) family of standards and introduces a middleware layer of entities called “Representatives”. WebDMF can be integrated with existing WBEM infrastructures and is not limited to monitoring. On the contrary, it is capable of actively modifying the run-time parameters of a managed service. Due to its abstract design, it is suitable for the management of a variety of distributed services, such as grids and content delivery networks. The paper includes a discussion on Web-DMF's design, implementation and advantages. We also present experiments on an emulated network topology as an indication of the framework's viability.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "A qualitative metrics vector for the awareness of smartphone security users",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40343-9_15",
            "Abstract": "The proliferation of smartphones introduced new challenges in the users’ security and privacy. Currently, the literature concentrates mainly on the ‘nuts and bolts’ of their security models. Not extensive work is available on the security awareness of smartphone users, even though their role in the ecosystem is important. This is so, as users’ actions directly affect their security and privacy. This paper extends a previous work on the awareness of smartphone users who install apps from official repositories. More specifically, we explore if a security background affects the smartphone security awareness of the survey participants by splitting them in two groups, comprising of security savvy and non-security savvy users. The results of the statistical analysis indicate, inter alia, that the participants’ security background has slight impact on their security awareness in the smartphone ecosystem.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The Compact Linear Collider (CLIC)-2018 Summary Report",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1812.06018",
            "Abstract": "The Compact Linear Collider (CLIC) is a TeV-scale high-luminosity linear  collider under development at CERN. Following the CLIC conceptual design published in 2012, this report provides an overview of the CLIC project, its current status, and future developments. It presents the CLIC physics potential and reports on design, technology, and implementation aspects of the accelerator and the detector. CLIC is foreseen to be built and operated in stages, at centre-of-mass energies of 380 GeV, 1.5 TeV and 3 TeV, respectively. CLIC uses a two-beam acceleration scheme, in which 12 GHz accelerating structures are powered via a high-current drive beam. For the first stage, an alternative with X-band klystron powering is also considered. CLIC accelerator optimisation, technical developments and system tests have resulted in an increased energy efficiency (power around 170 MW) for the 380 GeV stage, together with a reduced cost estimate at the level of 6 billion CHF. The detector concept has been refined using improved software tools. Significant progress has been made on detector technology developments for the tracking and calorimetry systems. A wide range of CLIC physics studies has been conducted, both through full detector simulations and parametric studies, together providing a broad overview of the CLIC physics potential. Each of the three energy stages adds cornerstones of the full CLIC physics programme, such as Higgs width and couplings, top-quark properties, Higgs self-coupling, direct searches, and many precision electroweak measurements. The interpretation of the combined results gives crucial and accurate insight …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:Ade32sEp0pkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "arXiv: The Compact Linear Collider (CLIC)-2018 Summary Report",
            "Publication year": 2018,
            "Publication url": "https://cds.cern.ch/record/2652188",
            "Abstract": "The Compact Linear Collider (CLIC) is a TeV-scale high-luminosity linear e+e− collider under development at CERN. Following the CLIC conceptual design published in 2012, this report provides an overview of the CLIC project, its current status, and future developments. It presents the CLIC physics potential and reports on design, technology, and implementation aspects of the accelerator and the detector. For an optimal exploitation of its physics potential, CLIC is foreseen to be built and operated in stages, at centre-of-mass energies of 380 GeV, 1.5 TeV and 3 TeV, respectively, for a site length ranging from 11 km to 50 km. CLIC uses a two-beam acceleration scheme, in which normal-conducting highgradient 12GHz accelerating structures are powered via a high-current drive beam. For the first stage, an alternative with X-band klystron powering is also considered. CLIC accelerator optimisation, technical developments and system tests have resulted in significant progress in recent years. Moreover, this has led to an increased energy efficiency (power around 170 MW) for the 380 GeV stage, together with a reduced cost estimate at the level of 6 billion CHF. The detector concept, which matches the physics performance requirements and the CLIC experimental conditions, has been refined using improved software tools for simulation and reconstruction. Significant progress has been made on detector technology developments for the tracking and calorimetry systems. A wide range of CLIC physics studies has been conducted, both through full detector simulations with overlay of beaminduced backgrounds, and through parametric studies …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:LPtt_HFRSbwC",
            "Publisher": "CERN"
        },
        {
            "Title": "A scalable, extensible framework for grid management",
            "Publication year": 2004,
            "Publication url": "https://research-information.bris.ac.uk/en/publications/a-scalable-extensible-framework-for-grid-management",
            "Abstract": "The picture of global computing is rapidly changing. In the last few years, with the progress made in the area of computer networks, standalone desktop computers became largely interconnected. And then grid computing came along. Managing and monitoring a network had never been a trivial task and many efforts have been made in this direction. A variety of protocols have been proposed and standards have arisen in order to facilitate this process. Now the task has become even more complex. Not only do we have the need to monitor and manage the underlying network, but also the availability and utilisation of shared resources. From simple resources such as CPU cycles and storage space, all the way to complicated equipment used for specific purposes, such as medical or scientific instruments. Our vision is of a management framework for grid deployments, that is easy to use, scalable, secure and modular. We propose a framework that has been designed in order to satisfy the above criteria. Furthermore, it is based on open standards, which makes it easy to implement and integrate with existing management systems.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "WebDMF: A web-based management framework for distributed services",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Theodore-Apostolopoulos/publication/44262017_WebDMF_A_Web-based_Management_Framework_for_Distributed_Services/links/00b7d5290c18f60149000000/WebDMF-A-Web-based-Management-Framework-for-Distributed-Services.pdf",
            "Abstract": "Framework for the Management of Distributed services. It is based on the Web-based Enterprise Management (WBEM) family of standards and introduces a middleware layer of entities called “Representatives”. WebDMF can be integrated with existing WBEM infrastructures and is not limited to monitoring. On the contrary, it is capable of actively modifying the run-time parameters of the managed application. Its design is abstract and suitable for a variety of distributed services, such as grids and content delivery networks. The paper includes a discussion on WebDMF’s design, implementation and advantages. We also present experiments on an emulated network topology as an indication of the framework’s viability.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Public policy and the telecommunications evolution: The case of Greece",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Theodore-Apostolopoulos/publication/228596620_Public_policy_and_the_telecommunications_evolution_The_case_of_Greece/links/00b7d5290c18eb92ce000000/Public-policy-and-the-telecommunications-evolution-The-case-of-Greece.pdf",
            "Abstract": "76, Patission Street, 76, Patission Street, 76, Patission Street, 104 34 Athens 104 34 Athens 104 34 Athens Tel.:+ 30210 8203234 Tel.:+ 30210 8203240 Tel.:+ 30210 8203155-158 Fax:+ 30210 8214012 Fax:+ 30210 8231077 Fax:+ 30210 8231077 E-mail: thodoros@ aueb. gr E-mail: gkak@ aueb. gr E-mail: xpsiaki@ aueb. gr",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiple incentive internet pricing for national academic research networks: a case study",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0308596100000409",
            "Abstract": "In this paper we develop a simple, flexible and adaptable pricing model for NRNs offering best effort services, taking into account the specific characteristics of these networks which differentiate them from those of the commercial ISPs, such as congestion patterns, cost sharing and government subsidisation, governmental policy towards equal access and fairness, and over dimensioning of critical resources. The proposed model captures the above multi-objective policy concepts by using a pricing scheme consisting of two parts, a fixed part, that reflects specific policy parameters, and a variable part, that reflects the usage of the congested links. The latter part is used in order to reduce congestion and provide the revenue needed in order to upgrade the congested resources. We discuss the case study of applying the above model for calculating the tariffs for 1999 for the Greek Academic Research Network (GR-NET).",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:0EnyYjriUFMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An e-learning service management architecture",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1215044/",
            "Abstract": "We propose a configurable architecture for implementing e-learning service management, taking into account several diverse aspects concerning not only the educational process, but also network infrastructure, the QoS requirements, the types of educational content, etc. We present a flexible, parametrical and component-oriented management scheme, which dynamically creates a session profile for each request for e-learning service according to current context that depends on all diverse aspects that an e-learning service comprises. Continuously, we analyse the components comprising the management scheme and the management information bases that they maintain.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Light Sources in Europe—Case Study: The COMPACTLIGHT Collaboration",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/517422",
            "Abstract": "The light sources currently existing or under development in Europe address needs in the Central and Northwestern regions, whereas in the Southeastern European region there is no facility of this kind. The CompactLight collaboration, an H2020 funded project, is going to deliver a Conceptual Design Report (CDR) of a novel generation X-ray Free Electron Laser (XFEL) facility which is compact, innovative, relatively cheap and to be implemented for industrial and medical applications. The CDR will facilitate technological updates of the many European region institutions and enable them to construct a novel light source. Cost and risk analysis, as well as technology transfer and market survey of the project results are also discussed. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:hsZV8lGYWTMC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "E-learning service management and brokerage framework: architecture and functional services",
            "Publication year": 2007,
            "Publication url": "http://ftp.actapress.com/PDFViewer.aspx?paperId=30004",
            "Abstract": "E-LEARNING SERVICE MANAGEMENT AND BROKERAGE FRAMEWORK: ARCHITECTURE \nAND FUNCTIONAL SERVICES Anna Kefala Department of Informatics Athens University of \nEconomics and Business 76 Patission str., 10434, Athens, Greece email: anna@aueb.gr \nTheodore Apostolopoulos Department of Informatics Athens University of Economics and \nBusiness 76 Patission str., 10434, Athens, Greece email: tca@aueb.gr ABSTRACT During the \nlast years, the evolution occurred in WWW and communication technologies has enabled \naccess to e- Services via diverse means and locations. E-learning sys- tems presenting diverse \nfeatures and functionality are im- plemented en masse. We propose a management frame- \nwork that acts as a facilitator among e-learning systems, learners, underlying communication \ninfrastructure, learn- ing content and provided learning methods, offering an in- tegrated , while -…",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Augmented Reality Applications Assisting Maintenance Activities in Extreme Environments: HCI Issues",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07857-1_108",
            "Abstract": "Maintenance of complex technology artifacts in hazardous environments can be a risky and demanding procedure. Operators need to be both efficient and meticulous in their activities in order to ensure the quality of their maintenance activities and the effectiveness of the limited time spent in the hazardous environment. Thus, an intuitive AR informative system could improve the operators’ efficiency during their presence in the hazardous environment. What are the Human-Computer Interaction implications that arise in such applications?",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:zCSUwVk65WsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Combining Invariant Violation with Execution Path Classification for Detecting Multiple Types of Logical Errors and Race Conditions.",
            "Publication year": 2016,
            "Publication url": "https://www.academia.edu/download/64588486/eb0624ad0d94e10df2cb0601a0a4df22f72a.pdf",
            "Abstract": "Context: Modern automated source code analysis techniques can be very successful in detecting a priori defined defect patterns and security vulnerabilities. Yet, they cannot detect flaws that manifest due to erroneous translation of the software’s functional requirements into the source code. The automated detection of logical errors that are attributed to a faulty implementation of applications’ functionality, is a relatively uncharted territory. In previous research, we proposed a combination of automated analyses for logical error detection. In this paper, we develop a novel business-logic oriented method able to filter mathematical depictions of software logic in order to augment logical error detection, eliminate previous limitations in analysis and provide a formal tested logical error detection classification without subjective discrepancies. As a proof of concept, our method has been implemented in a prototype tool called PLATO that can detect various types of logical errors. Potential logical errors are thus detected that are ranked using a fuzzy logic system with two scales characterizing their impact:(i) a Severity scale, based on the execution paths’ characteristics and Information Gain,(ii) a Reliability scale, based on the measured program’s Computational Density. The method’s effectiveness is shown using diverse experiments. Albeit not without restrictions, the proposed automated analysis seems able to detect a wide variety of logical errors, while at the same time limiting the false positives.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:wKETBy42zhYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile Financial Services: A Scenario-driven Requirements Analysis.",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=4478578969320686806&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:PaBasH6fAo0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Content and e-learning provision services management framework: Architecture and session profile",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-6262-9_11",
            "Abstract": "During the last years, we are witnessing an explosion in WWW, communication and device technologies that enables access to e-Services via diverse means and locations. Systems that present different features and functionality, and offer various content and e-learning services are implemented en masse.Proposed management framework aims at acting as a facilitator among content and e-learning systems, clients, underlying communication infrastructure and access devices, content and provided learning/delivery methods, offering an integration management architecture, while at the same time, acts as a broker for e-learning and content providing systems. Our framework is session profile centric, since a key characteristic of proposed architecture is the dynamic creation of user session by detecting and managing information and parameters that are either derived by stored profiles or change …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "PEGASUS: Competitive load balancing using inetd",
            "Publication year": 2006,
            "Publication url": "http://bkarak.wizhut.com/www/pubs/pdfs/pegasus.pdf",
            "Abstract": "As it is proven by practice, load balancing techniques are the only tool that network service provider have, in order to support and handle scalable network load. This paper presents PEGASUS, a novel framework that provides load balancing in network services transparently, using a competitive scheduling algorithm. PEGASUS is designed upon the INETD superserver, thus providing a easy to configure, yet efficient infrastructure. The paper is structured as follows. In section 2 we provide an overview of the current frameworks and popular implementations both open source and commercial. Then we describe our system architecture and the basic axioms that it is designed. The paper concludes with a comparison of PEGASUS with other popular load balancing frameworks.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:ubry08Y2EpUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "USAGE-BASED CHARGING FOR INTERNET USAGE: A CASE STUDY",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812793928_0006",
            "Abstract": "In this paper we discuss usage-based pricing for networks offering best effort services, and review the international experience in the above subject. We propose an approach that is based on the assumptions that a) the fixed part of the charge should reflect a fair distribution of the actual fixed network cost to the users of the network, and b) the usage charge should be directly associated with the congested link in order to provide for the economically optimal sharing of the scarce resources. The usage part of the charge is proportional to the traffic volume that a user contributes on the congested links of the network over a specific time period. Our case study involves the design of the actual tariffs offered by the GR-net to its customers, which consist of the Greek Universities and Research Institutes.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:IaI1MmNe2tcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A distributed hash table-based approach for providing a file system neutral, robust and resilient storage infrastructure",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5175751/",
            "Abstract": "During the past years, anywhere, anytime access to large and reliable storage has become increasingly important in both enterprise and home computer environments. In this paper we present the design and implementation of a distributed storage infrastructure, which combines the benefits emanating by the usage of a distributed hash table as the core storage layer with the transparency provided by a low level operating system storage interface. The results of the experimental evaluation are very promising.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Technology Entrepreneurship and Commercialization: A Set of Assessment Dimensions.",
            "Publication year": 2016,
            "Publication url": "https://aisel.aisnet.org/cgi/viewcontent.cgi?article=1044&context=mcis2016",
            "Abstract": "Technology entrepreneurship is a new topic in the field of Information Systems, although attempts to handle this phenomenon have been made in the management and technical literature in the past. Furthermore, complex technology artifacts are yearly the output of compound research projects developed by highly skilful individuals. The exploitation of these artifact is the process to address more problems that can be solved or applications in more than the initiating case. The exploitation alternatives and pertinent vehicles include the process of new venture creation and technology entrepreneurship.Particularly, the authors argue that technology entrepreuship is a commercialization option in the process of technological research and complex ITC artifact exploitation. This process, of research commercialization and developed artifact exploitation, is rather complex and is affected by a variety of factors including …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:MpfHP-DdYjUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Photocathode study of the CompactLight Collaboration for a novel XFEL development",
            "Publication year": 2020,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S2010194520600071",
            "Abstract": "The latest generation of light sources, the Free Electron Lasers that are capable of delivering high-intensity photon beams of unprecedented brilliance and quality, provide a substantially novel way to probe matter with a very high, largely unexplored potential for science and innovation. The CompactLight Collaboration intends to design a hard X-ray FEL facility beyond today’s state of the art using the latest concepts for bright electron photoinjectors, very high-gradient X-band structures at 12 GHz, and innovative compact short-period undulators. When compared to existing facilities, the proposed facility will benefit from a lower electron beam energy, due to the enhanced undulator performance, will be significantly more compact with a smaller footprint, as a consequence of both the lower energy and the high-gradient X-band structures, and will have a much lower electrical power demand. This paper gives an …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:1yWc8FF-_SYC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "A demand-based approach to optimal resource allocation for network services with Quality of Service (QoS) requirements",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4114886/",
            "Abstract": "Quality of service (QoS) plays a key role to the economic analysis of demand for network resources (bandwidth and buffers). In the absence of any QoS consideration, users are not able to rank their preferences for resource bundles and no utility function can exist. Without such a QoS-based utility-maximizing model, demand for network resources is not possible to be derived and network usage cannot be efficient. In this paper, we assume that QoS-based preferences are expressed by means of Cobb-Douglas utility functions and we propose a demand-based approach to optimal resource allocation with QoS requirements. QoS is the 'glue' that ties together standard economic properties and network performance characteristics. Finally, we examine the economic variables of the model and we determine the optimal amounts for each resource by means of users' demand functions.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Compact Linear  Collider (CLIC) - 2018 Summary Report",
            "Publication year": 2018,
            "Publication url": "https://pure.mpg.de/pubman/faces/ViewItemOverviewPage.jsp?itemId=item_3073854",
            "Abstract": "The Compact Linear Collider (CLIC) is a TeV-scale high-luminosity linear  collider under development at CERN. Following the CLIC conceptual design published in 2012, this report provides an overview of the CLIC project, its current status, and future developments. It presents the CLIC physics potential and reports on design, technology, and implementation aspects of the accelerator and the detector. CLIC is foreseen to be built and operated in stages, at centre-of-mass energies of 380 GeV, 1.5 TeV and 3 TeV, respectively. CLIC uses a two-beam acceleration scheme, in which 12 GHz accelerating structures are powered via a high-current drive beam. For the first stage, an alternative with X-band klystron powering is also considered. CLIC accelerator optimisation, technical developments and system tests have resulted in an increased energy efficiency (power around 170 MW) for the 380 GeV stage, together with a reduced cost estimate at the level of 6 billion CHF. The detector concept has been refined using improved software tools. Significant progress has been made on detector technology developments for the tracking and calorimetry systems. A wide range of CLIC physics studies has been conducted, both through full detector simulations and parametric studies, together providing a broad overview of the CLIC physics potential. Each of the three energy stages adds cornerstones of the full CLIC physics programme, such as Higgs width and couplings, top-quark properties, Higgs self-coupling, direct searches, and many precision electroweak measurements. The interpretation of the combined results gives crucial and accurate insight …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:CdxZDUztZiMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An architecture for the management of smart cards by mobile devices using Java technologies",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1524102/",
            "Abstract": "Smart cards are cards with memory and a processor, ideal for authentication and secure applications. Mobile devices have an extraordinary spread; people carry them along at all times. The ability to combine the features of those two devices is quite compelling. We used technologies of the Java family in order to achieve this. In our work, we designed an architecture for the management of smart cards by mobile devices. The system is built up from three components, the Java card applet, the mobile application and the Java card-mobile device gateway. For the purposes of our work and as proof of concept, we developed a sample electronic wallet application. Finally, we extended the proposed system's functionality and described a business case, where the system could be used in the future.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cyber attack evaluation methodology",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=hFQJBAAAQBAJ&oi=fnd&pg=PA264&dq=info:8Q7hkZMul_0J:scholar.google.com&ots=w5TLkq9H7S&sig=-odpIx3KC5QXiJWmhgndT7dXDZ0",
            "Abstract": "Following the identification on an international basis of cyberspace as a new ‘domain of warfare’, it has become widely (though not fully) accepted that the traditional rules of International Humanitarian Law are also applicable to Computer Network Attacks (CNAs). Despite the fact that there has been considerable progress at the European and International level towards the development of National Cyber Security Strategies and the adoption of an effective comprehensive legal framework of prevention measures against cyber attacks, there is confusion regarding the application of these rules. More specifically, it has not been clarified: a) in which cases do cyber attacks constitute a ‘threat or use of force’so that the prohibition of article 2 (4) of the UN Charter can apply, b) in which cases do cyber attacks constitute a ‘threat to the peace, breach of the peace, or act of aggression’so that the Security Council may decide upon measures to restore international peace and security under Article 42 of the UN Charter, and c) in which cases cyber attacks can be treated as an ‘armed attack’, making it possible for a UN Member State to respond by exercising its legitimate right of self‐-defense under Article 51 of the UN Charter. The difficulty in applying the traditional rules of International Humanitarian Law to categorize cyber attacks stems from a number of factors. The most important of them is the failure to estimate properly the impact of a cyber attack in the host country and in the international environment. Additionally, the inability to positively identify the key actor of an attack makes it often quite hard to handle the issue of ‘attribution’. The aim of this paper is to …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cyberoperations and International Humanitarian Law: A review of obstacles in applying International Law rules in Cyber Warfare",
            "Publication year": 2016,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/ICS-12-2014-0081/full/html",
            "Abstract": " – The increasing number of cyber attacks has transformed the “cyberspace” into a “battlefield”, bringing out “cyber warfare” as the “fifth dimension of war” and emphasizing the States’ need to effectively protect themselves against these attacks. The existing legal framework seem inadequate to deal effectively with cyber operations and, from a strictly legal standpoint, it indicates that addressing cyber attacks does not fall within the jurisdiction of just one legal branch. This is mainly because of the fact that the concept of cyber warfare itself is open to many different interpretations, ranging from cyber operations performed by the States within the context of armed conflict, under International Humanitarian Law, to illicit activities of all kinds performed by non-State actors including cybercriminals and terrorist groups. The paper initially presents major cyber-attack incidents and their impact on the …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:kVjdVfd2voEC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "A new strategy for improving cyber-attacks evaluation in the context of Tallinn Manual",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404817300822",
            "Abstract": "In this paper a systematic modeling methodology for evaluating the effects of cyber-attacks on States Critical Information Infrastructure (CII) is introduced. The analysis is focused on the United Nations Charter's normative scheme of the “use of force”, in order to define whether these attacks constitute a wrongful “use of force” under the principles of international law. By using the qualitative criteria for recognising the impact of cyber-attacks as proposed by the International Group of Experts in the Manual on the International Law Applicable to Cyber Warfare (Tallinn Manual) and by applying Multiple Attribute Decision Making (MADM) methods, cyber operations evaluation results are presented. For the analysis a case study of kinetic and cyber-attacks on Supervisory Control and Data Acquisition (SCADA) system is employed. Pros and cons of the Simple Additive Weighting (SAW) method and the Weighted Product …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:PYBJJbyH-FwC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "A UML Definition of a Management Framework for e-Learning Session-centric Services.",
            "Publication year": 2007,
            "Publication url": "https://www.scitepress.org/Papers/2007/12804/12804.pdf",
            "Abstract": "During the last decade, systems offering various e-learning services are implemented en masse. Proposed management framework aims at acting as a facilitator among e-learning systems, learners, underlying communication infrastructure and access devices, content and delivery methods, forming an integration management middleware, while at the same time acts as a broker for e-learning and content providing systems. Our framework is session profile centric, since a key characteristic is the dynamic creation of user session by detecting and managing information and parameters that are either derived by stored profiles or change dynamically at each user session. In this paper, we present content and e-learning provision services’ context, along with the proposed architecture overview. We also present session profile and a UML definition of its creation process.",
            "Abstract entirety": 1,
            "Author pub id": "WTg8mXoAAAAJ:7BrZ7Jt4UNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web-based management of content delivery networks",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87353-2_4",
            "Abstract": "overlay networks have been considered enablers of efficient management for decentralized, large scale service deployments. A Content Delivery Network (CDN) is an example of service falling within this category. The result of our research is WebDMF, a management framework for distributed services based on the Web-Based Enterprise Management (WBEM) family of specifications. Abstract design, combined with a middleware layer of entities called “Representatives”, makes WebDMF suitable for the management of a variety of services. Details related to the management of each particular service are detached from the representative logic. This paper discusses how WebDMF can be used for the management of CDNs. A WBEM provider resides on each host participating in the service deployment and implements CDN-specific operations. WebDMF representatives decentralize, unify and …",
            "Abstract entirety": 0,
            "Author pub id": "WTg8mXoAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]