[{
    "name": "Θεόδωρος Τζουραμάνης",
    "romanize name": "Theodoros Tzouramanis",
    "School-Department": "Πληροφορική με Εφαρμογές στη Βιοϊατρική",
    "University": "uth",
    "Rank": "Επίκουρος Καθηγητής (Μόνιμος)",
    "Apella_id": 1166,
    "Scholar name": "Theodoros Tzouramanis",
    "Scholar id": "Csb5gNYAAAAJ",
    "Affiliation": "Unknown affiliation",
    "Citedby": 669,
    "Scholar url": "https://scholar.google.com/citations?user=Csb5gNYAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Security Threats in Web-Powered Databases and Web Portals",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/security-threats-web-powered-databases/28565",
            "Abstract": "It is a strongly held view that the scientific branch of computer security that deals with Web-powered databases (Rahayu & Taniar, 2002) than can be accessed through Web portals (Tatnall, 2005) is both complex and challenging. This is mainly due to the fact that there are numerous avenues available for a potential intruder to follow in order to break into the Web portal and compromise its assets and functionality. This is of vital importance when the assets that might be jeopardized belong to a legally sensitive Web database such as that of an enterprise or government portal, containing sensitive and confidential information. It is obvious that the aim of not only protecting against, but mostly preventing from potential malicious or accidental activity that could set a Web portal’s asset in danger, requires an attentive examination of all possible threats that may endanger the Web-based system.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Information Science Publishing"
        },
        {
            "Title": "The dbMark: A benchmarking system for watermarking methods for relational databases",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7956526/",
            "Abstract": "Digital technology keeps falling prey to the ease with which the unauthorized reproduction and distribution of digital objects can be achieved. Research on copyright protection of digital data must counterbalance the failures of legal measures against digital piracy. Digital watermarking tops the list of technical countermeasures and recent research has focused on proposing watermarking methods for relational data as well as on the types of attacks which aim at removing or destroying the watermark. With the database field of research in urgent need of developing tools and platforms for the benchmarking of these watermarking methods, the present work has undertaken to construct a benchmarking system for the automatic evaluation and fair comparison of watermarking schemes for relational data. The new software tool is called dbMark and its construction has taken into consideration the characteristics of a large …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generating Dynamic Raster Data",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.4.932&rep=rep1&type=pdf",
            "Abstract": "Benchmarking of spatio-temporal databases is an issue of growing importance. In case large real data sets are not available, benchmarking requires the generation of artificial data sets following the realworld behavior of spatial objects that change their locations, shapes and sizes over time. In this report, a generator for changing raster data, called “Generator of Time-Evolving Regional Data”(G-TERD), is presented. The basic concepts that determine the function of G-TERD are the structure of complex two-dimensional raster objects, their color, maximum speed, zoom and rotation-angle per time slot, the influence of other moving or static objects on the speed and on the moving direction of an object, the position and movement of the scene-observer, the statistical distribution of each changing factor and finally, time. In the framework developed, the user can control the generator response by setting several parameters values.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quadtrees and Family",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer Science"
        },
        {
            "Title": "Specification [18] Xin based approach on SQL Injection detection",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=11670044120611611095&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:YFjsv_pBGBYC",
            "Publisher": "ACM"
        },
        {
            "Title": "Benchmarking access methods for time-evolving regional data",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X0300154X",
            "Abstract": "In this paper we present a performance comparison of access methods for time-evolving regional data. Initially, we briefly review four temporal extensions of the Linear Region Quadtree: the Time-Split Linear Quadtree, the Multiversion Linear Quadtree, the Multiversion Access Structure for Evolving Raster Images and Overlapping Linear Quadtrees. These methods comprise a family of specialized access methods that can efficiently store and manipulate consecutive raster images. A new simpler implementation solution that provides efficient support for spatio-temporal queries referring to the past through these methods, is suggested. An extensive experimental space and time performance comparison of all the above access methods follows. The comparison is made under a common and flexible benchmarking environment in order to choose the best technique depending on the application and on the image …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:UeHWp8X0CEIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A Generalized Comparison of Open Source and Commercial Database Management Systems",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Information Science Reference - IGI Global"
        },
        {
            "Title": "The range skyline query",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3269206.3271693",
            "Abstract": "The range skyline query retrieves the dynamic skyline for every individual query point in a range by generalizing the point-based dynamic skyline query. Its wide-ranging applications enable users to submit their preferences within an interval of'ideally sought'values across every dimension, instead of being limited to submit their preference in relation to a single sought value. This paper considers the query as a hyper-rectangle iso-oriented towards the axes of the multi-dimensional space and proposes:(i) main-memory algorithmic strategies, which are simple to implement and (ii) secondary-memory pruning mechanisms for processing range skyline queries efficiently. The proposed approach is progressive and I/O optimal. A performance evaluation of the proposed technique demonstrates its robustness and practicability.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A robust watermarking scheme for relational databases",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6148438/",
            "Abstract": "Research into the issue of the rights protection of digital data is of critical importance since legal measures have proved ineffective against digital piracy. Digital watermarking tops the list of technical countermeasures. Its process involves the incorporation of a set of some data in the item to be protected; this set of data is called watermark. The accuracy of the item is slightly degraded but the watermark acts as a seal that henceforth identifies the intellectual owner. This paper proposes a novel watermarking scheme for relational data which is efficient against a range of attacks that may be issued to remove or destroy the watermark. The paper provides experimental results for a variety of parameter settings, revealing the robustness of the proposed scheme in numerous possible attacks.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A robust gender inference model for online social networks and its application to linkedin and twitter",
            "Publication year": 2014,
            "Publication url": "http://firstmonday.org/ojs/index.php/fm/article/view/5216",
            "Abstract": "Online social networking services have come to dominate the dot com world: Countless online communities coexist on the social Web. Some typically characteristic user attributes, such as gender, age group, sexual orientation, are not automatically part of the profile information. In some cases user attributes can even be deliberately and maliciously falsified. This paper examines automated inference of gender on online social networks by analyzing written text with a combination of natural language processing and classification techniques. Extensive experimentation on LinkedIn and Twitter has yielded accuracy of this gender identification technique of up to 98.4 percent.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SQL-IDS: a specification-based approach for SQL-injection detection",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1363686.1364201",
            "Abstract": "Vulnerabilities in web applications allow malicious users to obtain unrestricted access to private and confidential information. SQL injection attacks rank at the top of the list of threats directed at any database-driven application written for the Web. An attacker can take advantages of web application programming security flaws and pass unexpected malicious SQL statements through a web application for execution by the back-end database. This paper proposes a novel specification-based methodology for the detection of exploitations of SQL injection vulnerabilities. The new approach on the one hand utilizes specifications that define the intended syntactic structure of SQL queries that are produced and executed by the web application and on the other hand monitors the application for executing queries that are in violation of the specification.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing and benchmarking access methods for timeevolving regional data",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=8428508478009104914&hl=en&oi=scholarr",
            "Abstract": "In this paper we examine issues involved in designing access methods for time-evolving regional data by extending existing transaction-time indexing techniques. In particular, we describe two new temporal extensions of the Linear Region Quadtree: the Time-Split Linear Quadtree and the Multiversion Access Structure for Evolving Raster Images. These two approaches together with the Multiversion Linear Quadtree and the Overlapping Linear Quadtrees comprise a family of specialized access methods that can efficiently store and manipulate consecutive raster images. A new simpler implementation solution that provides efficient support for spatio-temporal queries referring to the past through these methods, is also suggested. Finally, an extensive experimental time and space performance comparison of all the above access methods, is presented. The comparison is made under a common and flexible …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security Threats in Legally Sensitive Web-Powered Databases and Web Portals",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Information Science Reference - IGI Global"
        },
        {
            "Title": "SQL Code Poisoning: The Most Prevalent Technique for Attacking Web Powered Databases",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/sql-code-poisoning/8025",
            "Abstract": "This chapter focuses on the SQL code poisoning attack. It presents various ways in which a Web database can be poisoned by malicious SQL code, which can result in the compromise of the system. Subsequently, techniques are described for the detection of SQL code poisoning and a number of lockdown issues that are related to this type of attack are discussed. This chapter also reviews security mechanisms and software tools that protect Web applications against unexpected data input by users; against alterations of the database structure; and against the corruption of data and the disclosure of private and confidential information, all of which are owed to the susceptibility of these applications to this form of attack.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Privacy Preservation and Location-Based Online Social Networking.",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=9906476515976179130&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SQL Injection Attack as a Threat of Web Portals",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/sql-injection-attack-threat-web/17992",
            "Abstract": "SQL injection attack (CERT, 2002) is one of the most prevalent security problems faced by today’s security professionals. It is today the most common technique to indirectly attack Web-powered databases and disassemble effectively the secrecy, integrity and availability of Web portals. The basic idea behind this insidious and pervasive attack is that predefined logical expressions within a pre-defined query can be altered simply by injecting operations that always result in true or false statements. With this simple technique, the attacker can run arbitrary SQL queries and thus s/he can extract sensitive customer and order information from e-commerce applications, or she/he can bypass strong security mechanisms and compromise the back-end databases and the file system of the data server. Despite these threats, a surprisingly high number of systems on the internet are totally vulnerable to this attack.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hybrid model for linking multiple social identities across heterogeneous online social networks",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-51963-0_33",
            "Abstract": "Automated online profiling consists of the accurate identification and linking of multiple online identities across heterogeneous online social networks that correspond to the same entity in the physical world. The paper proposes a hybrid profile correlation model which relies on a diversity of techniques from different application domains, such as record linkage and data integration, image and text similarity, and machine learning. It involves distance-based comparison methods and the exploitation of information produced by a social network identification process for use as external knowledge towards searches on other social networks; thus, the remaining identification tasks for the same individual are optimized. The experimental study shows that, even with limited resources, the proposed method collects and combines accurate information effectively from different online sources in a fully-automated way …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Electronic Money Management in Modern Online Businesses",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/cyber-warfare-cyber-terrorism/7449",
            "Abstract": "This chapter discusses electronic money management via modern payment processing systems. The protocols and architectures of modern payment processing systems are reviewed and the way to identify and eliminate the threats of abuse of an electronic payment system by cyber fraud is discussed. The countermeasures necessary to combat possible depredations are detailed methodically. There is also a brief presentation of the payment processing system of PayPal and the payment gateway service that is provided by VeriSign. While this chapter shows that perceptions of the Web as a dangerous place to operate a business are justified, the main objective is to help e-commerce and online businesses understand the nature of possible threats for the safeguard of their customers’ financial transactions against all risks.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A survey of official online sources of high-quality free-of-charge geospatial data for maritime geographic information systems applications",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437916304185",
            "Abstract": "Maritime information systems are innovative geographic information systems for study, monitoring and action-taking in maritime areas. They respond to needs in the development of intelligent systems for applications such as scientific research and safety (monitoring the global ecosystem, the atmosphere, the oceans, the biosphere, ice fields, fish populations etc.) or the support of the maritime industry and its related organizations (tracking the position of vessels in motion, providing them with safe routing etc.). For these systems to efficiently handle the complex demands made on such specialized applications, up-to-date real-world data purchased or downloaded from official, trustworthy online data sources is needed. This article examines geospatial free-of-charge data sources and discusses the various classes of available data. Several hundred resources and their available datasets were empirically tested and …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:IWHjjKOFINEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Consequences of Publishing Real Personal Information in Online Social Networks.",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=9518576766947934833&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overlapping linear quadtrees and spatio-temporal query processing",
            "Publication year": 2000,
            "Publication url": "https://academic.oup.com/comjnl/article-abstract/43/4/325/395627",
            "Abstract": "In this paper, indexing in spatio-temporal databases by using the technique of overlapping is investigated. Overlapping has been previously applied in various access methods to combine consecutive structure instances into a single structure, without storing identical sub-structures. In this way, space is saved without sacrificing time performance. A new access method, overlapping linear quadtrees is introduced. This structure is able to store consecutive historical raster images, a database of evolving images. Moreover, it can be used to support query processing in such a database. Five such spatio-temporal queries along with the respective algorithms that take advantage of the properties of the new structure are introduced. The new access method was implemented and extensive experimental studies for space efficiency and query processing performance were conducted. A number of results of these …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Ethical Issues Surrounding Data Collection in Online Social Networks.",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=12116357883787814417&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Portal Development Tools, the Technological Perspective",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Information Science Reference - IGI Global"
        },
        {
            "Title": "New Trends in Databases and Information Systems: ADBIS 2019 Short Papers, Workshops BBIGAP, QAUCA, SemBDM, SIMPDA, M2P, MADEISD, and Doctoral Consortium, Bled, Slovenia, September 8–11, 2019, Proceedings",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=sR6tDwAAQBAJ&oi=fnd&pg=PR5&dq=info:SBCBk4X0YoEJ:scholar.google.com&ots=lZZIbsEaXU&sig=O3qNAWj4jtGhM_p1hxj4MAMEAnc",
            "Abstract": "This book constitutes the thoroughly refereed short papers, workshops and doctoral consortium papers of the 23rd European Conference on Advances in Databases and Information Systems, ADBIS 2019, held in Bled, Slovenia, in September 2019. The 19 short research papers and the 5 doctoral consortium papers were carefully reviewed and selected from 103 submissions, and the 31 workshop papers were selected out of 67 submitted papers. The papers are organized in the following sections: Short Papers; Workshops Papers; Doctoral Consortium Papers; and cover a wide spectrum of topics related to database and information systems technologies for advanced applications.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:r0BpntZqJG4C",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Skylines and Other Dominance-Based Queries",
            "Publication year": 2020,
            "Publication url": "https://www.morganclaypool.com/doi/abs/10.2200/S01048ED1V01Y202009DTM063",
            "Abstract": " This book is a gentle introduction to dominance-based query processing techniques and their applications. The book aims to present fundamental as well as some advanced issues in the area in a precise, but easy-to-follow, manner. Dominance is an intuitive concept that can be used in many different ways in diverse application domains. The concept of dominance is based on the values of the attributes of each object. An object 𝑝 dominates another object 𝑞 if 𝑝 is better than 𝑞. This goodness criterion may differ from one user to another. However, all decisions boil down to the minimization or maximization of attribute values. In this book, we will explore algorithms and applications related to dominance-based query processing. The concept of dominance has a long history in finance and multi-criteria optimization. However, the introduction of the concept to the database community in 2001 inspired many …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:blknAaTinKkC",
            "Publisher": "Morgan & Claypool Publishers"
        },
        {
            "Title": "SOPE: A spatial order preserving encryption model for multi-dimensional data",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1710.09420",
            "Abstract": "Due to the increasing demand for cloud services and the threat of privacy invasion, the user is suggested to encrypt the data before it is outsourced to the remote server. The safe storage and efficient retrieval of d-dimensional data on an untrusted server has therefore crucial importance. The paper proposes a new encryption model which offers spatial order-preservation for d-dimensional data (SOPE model). The paper studies the operations for the construction of the encrypted database and suggests algorithms that exploit unique properties that this new model offers for the efficient execution of a whole range of well-known queries over the encrypted d-dimensional data. The new model utilizes well-known database indices, such as the B+-tree and the R-tree, as backbone structures in their traditional form, as it suggests no modifications to them for loading the data and for the efficient execution of the supporting query algorithms. An extensive experimental study that is also presented in the paper indicates the effectiveness and practicability of the proposed encryption model for real-life d-dimensional data applications.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "GCDB: a character database system",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1577802.1577821",
            "Abstract": "In this article the GCDB (Greek Characters DataBase) System is presented. GCDB is a complete database system for storing images of Greek unconstrained handwritten characters. The three elements that compose this database are: a specialized input form, a database that contains the images of the filled forms and the software that allows the inputting of the data from the form into the database and their retrieval. The main purpose of this database system is to make it possible to achieve the automatic storage and organization of images of Greek symbols and letters in view of their use by OCR (Optical Character Recognition) systems or other applications. The GCDB system is designed within the concept of future expansion, providing an up to date database of Greek handwritten characters to cover the growing demands for offline character recognition of the Greek language.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Generalized Comparison of Open Source and Commercial Database Management Systems",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Information Science Reference - IGI Global"
        },
        {
            "Title": "Digital Rights Protection Management of Web Portals Content",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/digital-rights-protection-management-web/17879",
            "Abstract": "Without doubt one of the most important factors that contributed to the wide acceptance and popularity of Web portals is the potential for users to access a broad spectrum of information from a single access point, the Web portal itself. A Web portal, in such a way, aggregates information from multiple sources and makes that information available to various users. Regardless of whether the offered assets are hosted within the Web portal or whether the latter serves as a gateway to information services and resources located on the rest of the Internet, a Web portal is simultaneously an all-in-one Web site and a browsing guide to all available Internet information worldwide. Even though there is no definite taxonomy of portals, relevant labels such as government, community, enterprise, general and others are offered aiming at defining the Web portal with respect to its content and its target group. Summarizing, it could be …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:Se3iqnhoufwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "On the Generation of Time-Evolving Regional Data",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1019705618917",
            "Abstract": "Benchmarking of spatio-temporal databases is an issue of growing importance. In case large real data sets are not available, benchmarking requires the generation of artificial data sets following the real-world behavior of spatial objects that change their locations, shapes and sizes over time. Only a few innovative papers have recently addressed the topic of spatio-temporal data generators. However, all existing approaches do not consider several important aspects of continuously changing regional data. In this report, a new generator, called generator of time-evolving regional data (G-TERD), for this class of data is presented. The basic concepts that determine the function of G-TERD are the structure of complex 2-D regional objects, their color, maximum speed, zoom and rotation-angle per time slot, the influence of other moving or static objects on the speed and on the moving direction of an object, the …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Access methods and query processing techniques",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45081-8_6",
            "Abstract": "The performance of a database management system (DBMS) is fundamentally dependent on the access methods and query processing techniques available to the system. Traditionally, relational DBMSs have relied on well-known access methods, such as the ubiquitous B + -tree, hashing with chaining, and, in some cases, linear hashing [52]. Object-oriented and object-relational systems have also adopted these structures to a great extend.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "History-independence: a fresh look at the case of R-trees",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2245276.2245279",
            "Abstract": "The deterministic tree-based database indexing structures unintentionally retain\" additional\" information about previous operations records of the index itself and about the database users' past activities. Privacy is jeopardized when a user gains illegitimate access to an indexing structure and accesses this\" additional\" confidential information from the internal representation of the index. This paper is the first to explore the design of history-independent access methods for spatial and multidimensional databases and proposes the History-Independent R-tree (HIR-tree), an R-tree variant which does not reveal information about the sequence of insertions, deletions and updates that have been applied to it and only reveals the outcome of these historical operations. It differs from the traditional spatial access methods in that the HIR-tree has the additional property of hiding its modification history. This property is …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure reverse k-nearest neighbours search over encrypted multi-dimensional databases",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3216122.3216170",
            "Abstract": "The reverse k-nearest neighbours search is a fundamental primitive in multi-dimensional (ie multi-attribute) databases with applications in location-based services, online recommendations, statistical classification, pat-tern recognition, graph algorithms, computer games development, and so on. Despite the relevance and popularity of the query, no solution has yet been put forward that supports it in encrypted databases while protecting at the same time the privacy of both the data and the queries. With the outsourcing of massive datasets in the cloud, it has become urgent to find ways of ensuring the fast and secure processing of this query in untrustworthy cloud computing. This paper presents searchable encryption schemes which can efficiently and securely enable the processing of the reverse k-nearest neighbours query over encrypted multi-dimensional data, including index-based search schemes which can …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "rz0uRAMANIs T",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=15724290958455228323&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:k_IJM867U9cC",
            "Publisher": "Proe of ACM Symposium on Applied Computing. New York: ACM Press"
        },
        {
            "Title": "The Role of Data Mining in Intrusion Detection Technology",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/role-data-mining-intrusion-detection/21271",
            "Abstract": "Over the past few years, the Internet has changed computing as we know it. The more possibilities and opportunities develop, the more systems are subject to attack by intruders. Thus, the big question is about how to recognize and handle subversion attempts. One answer is to undertake the prevention of subversion itself by building a completely secure system. However, the complete prevention of breaches of security does not yet appear to be possible to achieve. Therefore these intrusion attempts need to be detected as soon as possible (preferably in real time) so that appropriate action might be taken to repair the damage. This is what an intrusion detection system (IDS) does. IDSs monitor and analyze the events occurring in a computer system in order to detect signs of security problems. However, intrusion detection technology has not yet reached perfection. This fact has provided data mining with the …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Countermeasures for Protecting Legally Sensitive Web-powered Databases and Web Portals",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Information Science Reference - IGI Global"
        },
        {
            "Title": "Processing skyline queries in temporal databases",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3019612.3019677",
            "Abstract": "The skyline query aims to filter out a set of eligible points on the basis of a set of evaluation criteria and out of a potentially large dataset of points. The computation of this decision support problem has been studied across a wide range of environments and of types of data. A field of research that has remained unexplored in the context of this problem, and which would also greatly benefit from the study of the computation of the skyline query, is that of temporal databases. A solution for computing skyline queries and some of its variants over temporal data is put forward here. An experimental study indicates the promising effectiveness and practicability of the proposed extension of the skyline query processing in real-life temporal data applications.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New Trends in Databases and Information Systems",
            "Publication year": 2019,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02281167/",
            "Abstract": "New Trends in Databases and Information Systems - Archive ouverte HAL Accéder \ndirectement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL \nHAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation \nEpisciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal \nAccueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par \nannée de publication Par structure de recherche Les portails de l'archive Recherche \nDocumentation hal-02281167, version 1 Direction d'ouvrage, Proceedings, Dossier New \nTrends in Databases and Information Systems: ADBIS 2019 Short Papers, Workshops \nBBIGAP, QAUCA, SemBDM, SIMPDA, M2P, MADEISD, and Doctoral Consortium Tatjana \nWelzer Johann Eder Vili Podgorelec Wrembel Robert Mirjana Ivanovic Johann Gamper \nMikoƚaj Morzy Theodoros Tzouramanis Jérôme - …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer"
        },
        {
            "Title": "A survey of skyline query processing",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1704.01788",
            "Abstract": "Living in the Information Age allows almost everyone have access to a large amount of information and options to choose from in order to fulfill their needs. In many cases, the amount of information available and the rate of change may hide the optimal and truly desired solution. This reveals the need of a mechanism that will highlight the best options to choose among every possible scenario. Based on this the skyline query was proposed which is a decision support mechanism, that retrieves the valuefor- money options of a dataset by identifying the objects that present the optimal combination of the characteristics of the dataset. This paper surveys the state-of-the-art techniques for skyline query processing, the numerous variations of the initial algorithm that were proposed to solve similar problems and the application-specific approaches that were developed to provide a solution efficiently in each case. Aditionally in each section a taxonomy is outlined along with the key aspects of each algorithm and its relation to previous studies.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure Range Query Processing over Untrustworthy Cloud Services",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3105831.3105872",
            "Abstract": "Database-as-a-service is a relatively new cloud computing service offered on a pay-per-use basis and providing on-demand access to a database. The way data has dramatically increased in volume explains its success, while security and privacy issues arise, leaving enterprises, in particular, exposed to the risk of leakage of the data which they entrust to specialized cloud service providers or to other parties in order to reduce storage and query processing costs. Since traditional encryption does not support the execution of queries on encrypted data, this paper focuses on the problem of secure computation on encrypted data and puts forward a cloud database model that supports secure range query processing and retrieval of multi-dimensional (ie multi-attribute) data. It proposes two schemes to resist practical attacks operating on the basis of powerful background knowledge. A performance and efficiency …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:mB3voiENLucC",
            "Publisher": "ACM"
        },
        {
            "Title": "Online Social Network Phishing Attack.",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=9541284107942609485&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Benchmarking and Data Generation in Moving Objects Databases",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/benchmarking-data-generation-moving-objects/11117",
            "Abstract": "Moving objects databases (MODs) provide the framework for the efficient storage and retrieval of the changing position of continuously moving objects. This includes the current and past locations of moving objects and the support of spatial queries that refer to historical location information and future projections as well. Nowadays, new spatiotemporal applications that require tracking and recording the trajectories of moving objects online are emerging. Digital battlefields, traffic supervision, mobile communication, navigation systems, and geographic information systems (GIS) are among these applications. Towards this goal, during recent years many efforts have focused on MOD formalism, data models, query languages, visualization, and access methods (Guting et al., 2000; Saltenis & Jensen, 2002; Sistla, Wolfson, Chamberlain, & Dao, 1997). However, little work has appeared on benchmarking.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Security Threats in Web-Powered Databases and Web Portals",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Portal Development Tools",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/portal-development-tools/17953",
            "Abstract": "A number of customer and company needs can be identified, to which Web portal services appear to provide the best answer. These needs include information sharing and accessibility, content management and abstraction with the use of interfaces to multiple data formats, such as physical data, documents, files and databases. The main purpose of a Web portal is to enable users to access and modify information.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Multiversion linear quadtree for spatio-temporal data",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44472-6_22",
            "Abstract": "Research in spatio-temporal databases has largely focused on extensions of access methods for the proper handling of time changing spatial information. In this paper, we present the Multiversion Linear Quadtree (MVLQ), a spatio-temporal access method based on Multiversion B-trees (MVBT) [2], embedding ideas from Linear Region Quadtrees [4]. More specifically, instead of storing independent numerical data having a different transaction-time each, for every consecutive image we store a group of codewords that share the same transaction-time, whereas each codeword represents a spatial subregion. Thus, the new structure may be used as an index mechanism for storing and accessing evolving raster images. We also conducted a thorough experimentation using sequences of real and synthetic raster images. In particular, we examined the time performance of temporal window queries, and provide …",
            "Abstract entirety": 0,
            "Author pub id": "Csb5gNYAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "SQL Code Poisoning",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/sql-code-poisoning/8025",
            "Abstract": "This chapter focuses on the SQL code poisoning attack. It presents various ways in which a Web database can be poisoned by malicious SQL code, which can result in the compromise of the system. Subsequently, techniques are described for the detection of SQL code poisoning and a number of lockdown issues that are related to this type of attack are discussed. This chapter also reviews security mechanisms and software tools that protect Web applications against unexpected data input by users; against alterations of the database structure; and against the corruption of data and the disclosure of private and confidential information, all of which are owed to the susceptibility of these applications to this form of attack.",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:Zph67rFs4hoC",
            "Publisher": "Information Science Reference - IGI Global"
        },
        {
            "Title": "Time Split Linear Quadtree for Indexing and Querying Image Databases",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Csb5gNYAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        }
    ]
}]