[{
    "name": "Θεόδωρος Χωρίκης",
    "romanize name": "Theodoros Chorikis",
    "School-Department": "Μαθηματικών",
    "University": "uoi",
    "Rank": "Καθηγητής",
    "Apella_id": 9969,
    "Scholar name": "Theodoros Horikis",
    "Scholar id": "9VDoWOEAAAAJ",
    "Affiliation": "University of Ioannina",
    "Citedby": 898,
    "Interests": [
        "Applied Mathematics",
        "Nonlinear waves",
        "Partial Differential Equations",
        "Integrable systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=9VDoWOEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Short pulse equations and localized structures in frequency band gaps of nonlinear metamaterials",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0375960110000150",
            "Abstract": "We consider short pulse propagation in nonlinear metamaterials characterized by a weak Kerr-type nonlinearity in their dielectric response. Two short-pulse equations (SPEs) are derived for the high-and low-frequency “band gaps”(where linear electromagnetic waves are evanescent) with linear effective permittivity ϵ< 0 and permeability μ> 0. The structure of the solutions of the SPEs is also briefly discussed, and connections with the soliton solutions of the nonlinear Schrödinger equation are made.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Multiscale expansions avector solitons of a two‐dimensional nonlocal nonlinear Schrödinger system",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/sapm.12334",
            "Abstract": "One‐ and two‐dimensional solitons of a multicomponent nonlocal nonlinear Schrödinger (NLS) system are constructed. The model finds applications in nonlinear optics, where it may describe the interaction of optical beams of different frequencies. We asymptotically reduce the model, via multiscale analysis, to completely integrable ones in both Cartesian and cylindrical geometries; we thus derive a Kadomtsev‐Petviashvili equation and its cylindrical counterpart, Johnson's equation. This way, we derive approximate soliton solutions of the nonlocal NLS system, which have the form of: (a) dark or antidark soliton stripes and (b) dark lumps in the Cartesian geometry, as well as (c) ring dark or antidark solitons in the cylindrical geometry. The type of the soliton, namely dark or antidark, is determined by the degree of nonlocality: dark (antidark) soliton states are formed for weaker (stronger) nonlocality. We perform …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collisional-inhomogeneity-induced generation of matter-wave dark solitons",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0375960110008534",
            "Abstract": "We propose an experimentally relevant protocol for the controlled generation of matter-wave dark solitons in atomic Bose–Einstein condensates (BECs). In particular, using direct numerical simulations, we show that by switching-on a spatially inhomogeneous (step-like) change of the s-wave scattering length, it is possible to generate a controllable number of dark solitons in a quasi-one-dimensional BEC. A similar phenomenology is also found in the two-dimensional setting of “disk-shaped” BECs but, as the solitons are subject to the snaking instability, they decay into vortex structures. A detailed investigation of how the parameters involved affect the emergence and evolution of solitons and vortices is provided.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:0EnyYjriUFMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Exact solutions and self-similar symmetries of a nonlocal nonlinear Schrödinger equation",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1140/epjp/s13360-020-00571-w",
            "Abstract": "An analytical consideration of a nonlocal nonlinear Schrödinger equation with distributed coefficients is presented. The analysis is twofold: first, exact solutions of the nonlocal equation with constant coefficients are found along with the appropriate conditions for their existence, and second, using a similarity transformation the distributed equation, ie the equations with varying coefficients, is reduced to the constant coefficients case; the solutions of the latter will be utilized in the construction of the solutions for the general case. This similarity transformation is also physically relevant as it allows for the physical parameters of the solution (amplitude, width, centre and phase) to vary in a specific way so that the constant coefficient system is a natural similarity reduction of the distributed case. Certain compatibility conditions needed for the consistency of this reduction are also deduced.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Exciting extreme events in the damped and AC-driven NLS equation through plane-wave initial conditions",
            "Publication year": 2021,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/5.0037462",
            "Abstract": "We investigate, by direct numerical simulations and for certain parametric regimes, the dynamics of the damped and forced nonlinear Schrödinger (NLS) equation in the presence of a time-periodic forcing. It is thus revealed that the wave number of a plane-wave initial condition dictates the number of emerged Peregrine-type rogue waves at the early stages of modulation instability. The formation of these events gives rise to the same number of transient “triangular” spatiotemporal patterns, each of which is reminiscent of the one emerging in the dynamics of the integrable NLS in its semiclassical limit, when supplemented with vanishing initial conditions. We find that the L 2-norm of the spatial derivative and the L 4-norm detect the appearance of rogue waves as local extrema in their evolution. The impact of the various parameters and noisy perturbations of the initial condition in affecting the above behavior is also …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:bFI3QPDXJZMC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Nonlinear waves in optical media",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377042709005172",
            "Abstract": "In nonlinear optical systems quasi-monochromatic waves satisfy the classical, constant dispersion and dispersion managed nonlocal, nonlinear Schrödinger equations, both of which exhibit localized pulse solutions. Current research has shown that mode-locked lasers are also described by dispersion managed equations. In spatial systems recent developments have attracted considerable interest in 2D photonic lattices. A computational method is introduced to find these and other localized waves in nonlinear optical media with vanishing and non-vanishing boundary conditions.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:8k81kl-MbHgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Shape controlling of self-similar evolution in optical fibers",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030402618319892",
            "Abstract": "We numerically demonstrate controlled self-similar evolution of optical pulses in fibers. In so doing, we utilize the nonlinear Schrödinger equation with constant gain to which we add a linear forcing term, which we call an optical potential in analogy to other optical media, which acts as the shape forming mechanism; this term, in earlier studies is added in the form of a periodically placed filter. Here, we show that a distributed equation not only makes the modelling and analysis of the system simpler but also allows for initial Gaussian shaped pulses to grown self-similarly, under evolution, to rectangular or triangular shaped localized structures.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:35N4QoGY0k4C",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "Transverse dynamics of vector solitons in defocusing nonlocal media",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1140/epjp/s13360-020-00544-z",
            "Abstract": "The transverse instability of line solitons of a multicomponent nonlocal defocusing nonlinear Schrödinger (NLS) system is utilized to construct lump and vortex-like structures in 2D nonlocal media, such as nematic liquid crystals. These line solitons are found by means of a perturbation expansion technique, which reduces the nonintegrable vector NLS model to a completely integrable scalar one, namely to a Kadomtsev–Petviashvili equation. It is shown that dark or antidark soliton stripes, as well as dark lumps, are possible depending on the strength of nonlocality: dark (antidark) solitons are formed for weaker (stronger) nonlocality, relatively to a threshold that is analytically determined in terms of the parameters of the system and the continuous-wave amplitude. Direct numerical simulations are used to show that dark lump-like-and vortex-like-structures can spontaneously be formed as a result of the transverse …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Fractal self-transform functions",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-24-1-253",
            "Abstract": "The concept of fractal (self-similar) self-transform functions is examined. A general method to prove existence of these functions is introduced, and necessary conditions for this existence are derived. The results are general and apply to all transforms with product-type kernels.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:5nxA0vEk-isC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Traveling waves of the regularized short pulse equation",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/47/31/315204/meta",
            "Abstract": "The properties of the so-called regularized short pulse equation (RSPE) are explored with a particular focus on the traveling wave solutions of this model. We theoretically analyze and numerically evolve two sets of such solutions. First, using a fixed point iteration scheme, we numerically integrate the equation to find solitary waves. It is found that these solutions are well approximated by a finite sum of hyperbolic secants powers. The dependence of the solitonʼs parameters (height, width, etc) to the parameters of the equation is also investigated. Second, by developing a multiple scale reduction of the RSPE to the nonlinear Schrödinger equation, we are able to construct (both standing and traveling) envelope wave breather type solutions of the former, based on the solitary wave structures of the latter. Both the regular and the breathing traveling wave solutions identified are found to be robust and should thus be …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:aqlVkmm33-oC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Asymptotic reductions and solitons of nonlocal nonlinear Schrödinger equations",
            "Publication year": 2016,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/49/20/205202/meta",
            "Abstract": "Asymptotic reductions of a defocusing nonlocal nonlinear Schrödinger model in (3+ 1)-dimensions, in both Cartesian and cylindrical geometry, are presented. First, at an intermediate stage, a Boussinesq equation is derived, and then its far-field, in the form of a variety of Kadomtsev–Petviashvilli (KP) equations for right-and left-going waves, is found. KP models include versions of the KP-I and KP-II equations, in Cartesian and cylindrical geometry. Solitary waves solutions, planar or ring-shaped, and of dark or anti-dark type, are also predicted to occur. Their nature and stability is determined by a parameter defined by the physical parameters of the original nonlocal system. It is thus found that (dark) anti-dark solitary waves are only supported by a weak (strong) nonlocality, and are unstable (stable) in higher-dimensions. Our analytical predictions are corroborated by direct numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:TQgYirikUcIC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Perturbed solitons in birefringent fibres",
            "Publication year": 2003,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0305-4470/36/17/310/meta",
            "Abstract": "A perturbation theory based on inverse scattering theory is developed for the coupled nonlinear Schrödinger equations. The theory finds useful application to the study of pulse propagation down a birefringent optical fibre and is used to examine features of the radiation field shed by a soliton pulse propagating down the fibre. The radiation field is linked to the scattering data through a transform pair which in the linear limit reduces to the forward and inverse Fourier transform pair. A complementary approach, which is in total agreement to these results, is also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Inverse scattering transform and soliton solutions for square matrix nonlinear Schrödinger equations with non-zero boundary conditions",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278917303378",
            "Abstract": "The inverse scattering transform (IST) with non-zero boundary conditions at infinity is developed for an m× m matrix nonlinear Schrödinger-type equation which, in the case m= 2, has been proposed as a model to describe hyperfine spin F= 1 spinor Bose–Einstein condensates with either repulsive interatomic interactions and anti-ferromagnetic spin-exchange interactions (self-defocusing case), or attractive interatomic interactions and ferromagnetic spin-exchange interactions (self-focusing case). The IST for this system was first presented by Ieda et al.(2007), using a different approach. In our formulation, both the direct and the inverse problems are posed in terms of a suitable uniformization variable which allows to develop the IST on the standard complex plane, instead of a two-sheeted Riemann surface or the cut plane with discontinuities along the cuts. Analyticity of the scattering eigenfunctions and scattering …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:BqipwSGYUEgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Spatiotemporal algebraically localized waveforms for a nonlinear Schrödinger model with gain and loss",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278917301227",
            "Abstract": "We consider the asymptotic behavior of the solutions of a nonlinear Schrödinger (NLS) model incorporating linear and nonlinear gain/loss. First, we describe analytically the dynamical regimes (depending on the gain/loss strengths), for finite-time collapse, decay, and global existence of solutions. Then, for all the above parametric regimes, we use direct numerical simulations to study the dynamics corresponding to algebraically decaying initial data. We identify crucial differences between the dynamics of vanishing initial conditions, and those converging to a finite constant background: in the former (latter) case we find strong (weak) collapse or decay, when the gain/loss parameters are selected from the relevant regimes. One of our main results, is that in all the above regimes, non-vanishing initial data transition through spatiotemporal, algebraically decaying waveforms. While the system is nonintegrable, the …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:k_IJM867U9cC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Modal analysis of circular Bragg fibers with arbitrary index profiles",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-31-23-3417",
            "Abstract": "A finite-difference approach based upon the immersed interface method is used to analyze the mode structure of Bragg fibers with arbitrary index profiles. The method allows general propagation constants and eigenmodes to be calculated to a high degree of accuracy, while computation times are kept to a minimum by exploiting sparse matrix algebra. The method is well suited to handle complicated structures comprised of a large number of thin layers with high-index contrast and simultaneously determines multiple eigenmodes without modification.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Modulation instability and solitons in two-color nematic crystals",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0375960116306181",
            "Abstract": "The conditions under which stable evolution of two nonlinear interacting waves are derived within the context of nematic liquid crystals. Two cases are considered: plane waves and solitons. In the first case, the modulation instability analysis reveals that while the nonlocal term suppresses the growth rates, substantially, the coupled system exhibits significantly higher growth rates than its scalar counterpart. In the soliton case, the necessary conditions are derived that lead the solitons to exhibit stable, undistorted evolution, suppressing any breathing behavior and radiation, leading to soliton mutual guiding.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:R3hNpaxXUhUC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Rogue Waves: Extreme Waves of Water and Light",
            "Publication year": 2014,
            "Publication url": "https://pdfs.semanticscholar.org/6005/c06c7fa2f79c8632fd190a786457c2724092.pdf",
            "Abstract": "The purpose of this editorial is to introduce the reader to the concept of rogue waves, an extreme wave that can occur in many diverse physical systems ranging from deep water waves and liquid Helium to nonlinear optics and microwave cavities and even in finance. The interested readers are referred to [1-3] where parts of this editorial were taken from. For more detailed information on the mathematical developments of the subject, we refer the reader to a recent review [4]. Rogue waves (also known as freak waves, monster waves, killer waves, extreme waves, and abnormal waves) are ocean waves with heights up to thirty meters which have been common elements in stories from people working at sea, as well as in popular fiction. It is not hard to imagine why: being on a small boat in a stormy sea swell and suddenly encountering a wave maybe three times as high as the surrounding waves is a terrifying experience (Figure 1).For centuries, seafarers have told tales of giant waves that can appear without warning on the high seas. These mountainous waves were said to be capable of destroying a vessel (Figure 2) or swallowing it beneath the surface, and then disappearing without the slightest trace. Until recently, these tales were thought to be mythical. In the mid-1990s, however, rogue waves proved very real when recorded for the first time by scientific measurements during an encounter at the Draupner oil platform in the North Sea (Figure 3). Although they are elusive and intrinsically difficult to monitor because of their fleeting existences, satellite surveillance has confirmed that rogue waves roam the open oceans, occasionally encountering …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solitons in fibers with polarization mode dispersion",
            "Publication year": 2002,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-27-17-1516",
            "Abstract": "Evaluating the relative time displacement of the two orthogonally polarized components of a pulse propagating down a birefringent optical fiber is considered. A method that provides analytical expressions for this time displacement is described and generalizes analytical results already published.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A Korteweg–de Vries description of dark solitons in polariton superfluids",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0375960117309490",
            "Abstract": "We study the dynamics of dark solitons in an incoherently pumped exciton–polariton condensate by means of a system composed of a generalized open-dissipative Gross–Pitaevskii equation for the polaritons' wavefunction and a rate equation for the exciton reservoir density. Considering a perturbative regime of sufficiently small reservoir excitations, we use the reductive perturbation method, to reduce the system to a Korteweg–de Vries (KdV) equation with linear loss. This model is used to describe the analytical form and the dynamics of dark solitons. We show that the polariton field supports decaying dark soliton solutions with a decay rate determined analytically in the weak pumping regime. We also find that the dark soliton evolution is accompanied by a shelf, whose dynamics follows qualitatively the effective KdV picture.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:hMod-77fHWUC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Dark solitons for an extended quintic nonlinear Schr\\\"odinger equation: Application to water waves at ",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1810.12500",
            "Abstract": "We study the existence, formation and dynamics of gray solitons for an extended quintic nonlinear Schr\\\"odinger (NLS) equation. The considered model finds applications to water waves, when the characteristic parameter  - where  is the wavenumber and  is the undistorted water's depth - takes the critical value . It is shown that this model admits approximate dark soliton solutions emerging from an effective Korteweg-de Vries equation and that two types of gray solitons exist: fast and slow, with the latter being almost stationary objects. Analytical results are corroborated by direct numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Vector nematicons: Coupled spatial solitons in nematic liquid crystals",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.94.053805",
            "Abstract": "Families of soliton pairs, namely vector solitons, are found within the context of a coupled nonlocal nonlinear Schrödinger system of equations, as appropriate for modeling beam propagation in nematic liquid crystals. In the focusing case, bright soliton pairs have been found to exist provided their amplitudes satisfy a specific condition. In our analytical approach, focused on the defocusing regime, we rely on a multiscale expansion methods, which reveals the existence of dark-dark and antidark-antidark solitons, obeying an effective Korteweg-de Vries equation, as well as dark-bright solitons, obeying an effective Mel'nikov system. These pairs are discriminated by the sign of a constant that links all physical parameters of the system to the amplitude of the stable continuous wave solutions, and, much like the focusing case, the solitons' amplitudes are linked, leading to mutual guiding.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:TFP_iSt0sucC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Matter-wave dark solitons: stochastic vs. analytical results",
            "Publication year": 2009,
            "Publication url": "https://arxiv.org/abs/0909.1660",
            "Abstract": "The dynamics of dark matter-wave solitons in elongated atomic condensates are discussed at finite temperatures. Simulations with the stochastic Gross-Pitaevskii equation reveal a noticeable, experimentally observable spread in individual soliton trajectories, attributed to inherent fluctuations in both phase and density of the underlying medium. Averaging over a number of such trajectories (as done in experiments) washes out such background fluctuations, revealing a well-defined temperature-dependent temporal growth in the oscillation amplitude. The average soliton dynamics is well captured by the simpler dissipative Gross-Pitaevskii equation, both numerically and via an analytically-derived equation for the soliton center based on perturbation theory for dark solitons.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solitons in Mode-Locked Lasers",
            "Publication year": 2012,
            "Publication url": "https://pdfs.semanticscholar.org/271f/bda3029c3090351211a834fb010ceb7354b6.pdf",
            "Abstract": "Following the discovery of the Kerr-lens mode-locking, in recent years femtosecond (10− 15second) solidstate lasers, such as those based on the Ti: Sapphire gain medium, have had a major impact in the field of ultrafast science. The enhanced performance of these lasers has led to their widespread use. Increasingly compact, user-friendly, reliable, and economical instruments have allowed femtosecond lasers to expand beyond research environments and find new applications such as in multi-user biology facilities, medical clinics, manufacturing environments, and even in mobile facilities and aircraft. A modelocked (ML) fiber laser cavity with a passive polarizer is an example of a technologically and commercially promising ultrafast device. It can be expected that improved mathematical modeling of ultra-short pulse passively mode-locked laser devices will help speed their development. Mode-locked laser pulses can be generated actively by use of an external element or passively via the Kerr-lens mechanism. The latter produces shorter pulses and will be the focus here.A mode-locked laser refers to the frequency domain description of how ultra-short pulses are generated by a laser system. The requirement that the electromagnetic field be unchanged after one round trip in the laser means that lasing only occurs for frequencies such that the cavity length is an integer number of wavelengths. If multiple modes lase at the same time, then a short pulse can be formed, but only if the modes are locked in phase, ie, the laser is mode-locked. Passive mode-locking can be described in terms of a saturable absorber, ie, higher intensity is less …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dark solitons of the power-energy saturation model: application to mode-locked lasers",
            "Publication year": 2013,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/46/9/095201/meta",
            "Abstract": "The generation and dynamics of dark solitons in mode-locked lasers is studied within the framework of a nonlinear Schrödinger equation which incorporates power-saturated loss, as well as energy-saturated gain and filtering. Mode-locking into single dark solitons and multiple dark pulses are found by employing different descriptions for the energy and power of the system defined over unbounded and periodic (ring laser) systems. Treating the loss, gain and filtering terms as perturbations, it is shown that these terms induce an expanding shelf around the soliton. The dark soliton dynamics are studied analytically by means of a perturbation method that takes into regard the emergence of the shelves and reveals their importance.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Dynamical playground of a higher-order cubic Ginzburg-Landau equation: From orbital connections and limit cycles to invariant tori and the onset of chaos",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.94.012210",
            "Abstract": "The dynamical behavior of a higher-order cubic Ginzburg-Landau equation is found to include a wide range of scenarios due to the interplay of higher-order physically relevant terms. We find that the competition between the third-order dispersion and stimulated Raman scattering effects gives rise to rich dynamics: this extends from Poincaré-Bendixson–type scenarios, in the sense that bounded solutions may converge either to distinct equilibria via orbital connections or to space-time periodic solutions, to the emergence of almost periodic and chaotic behavior. One of our main results is that third-order dispersion has a dominant role in the development of such complex dynamics, since it can be chiefly responsible (even in the absence of other higher-order effects) for the existence of periodic, quasiperiodic, and chaotic spatiotemporal structures. Suitable low-dimensional phase-space diagnostics are devised and …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:hC7cP41nSMkC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Soliton radiation in an optical fiber",
            "Publication year": 2001,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JOSAB-18-7-913",
            "Abstract": "We discuss the evolution of a perturbed soliton in an anomalously dispersive optical fiber. In so doing, the advantage of using a natural mathematical framework based on inverse scattering theory will be emphasized. Results obtained in this way will be contrasted with these obtained by using an alternative approach commonly known as the associate field formalism. The relative merits of the two techniques will be discussed, and in particular the latter will be shown to fail unless the initial radiation field respects certain symmetry requirements.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:qjMakFHDy7sC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Soliton pairs in two-dimensional nonlocal media",
            "Publication year": 2020,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.101.042208",
            "Abstract": "We study the interaction of optical beams of different wavelengths, described by a two-component, two-dimensional (2D) nonlocal nonlinear Schrödinger (NLS) model. Using a multiscale expansion method the NLS model is asymptotically reduced to the completely integrable 2D Mel'nikov system, the soliton solutions of which are used to construct approximate dark-bright and antidark-bright soliton solutions of the original NLS model; the latter being unique to the nonlocal NLS system with no relevant counterparts in the local case. Direct numerical simulations show that, for sufficiently small amplitudes, both these types of soliton stripes do exist and propagate undistorted, in excellent agreement with the analytical predictions. Larger amplitude of these soliton stripes, when perturbed along the transverse direction, disintegrate either to filled vortex structures (the dark-bright solitons) or to radiation (the antidark-bright …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:fPk4N6BV_jEC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Self-similar evolution in nonlocal nonlinear media",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-44-15-3701",
            "Abstract": "The self-similar propagation of optical beams in a broad class of nonlocal, nonlinear optical media is studied utilizing a generic system of coupled equations with linear gain. This system describes, for instance, beam propagation in nematic liquid crystals and optical thermal media. It is found, both numerically and analytically, that the nonlocal response has a focusing effect on the beam, concentrating its power around its center during propagation. In particular, the beam narrows in width and grows in amplitude faster than in local media, with the resulting beam shape being parabolic. Finally, a general initial localized beam evolves to a common shape.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:M05iB0D1s5AC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Hydrodynamics and two-dimensional dark lump solitons for polariton superfluids",
            "Publication year": 2018,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.98.022205",
            "Abstract": "We study a two-dimensional incoherently pumped exciton-polariton condensate described by an open-dissipative Gross-Pitaevskii equation for the polariton dynamics coupled to a rate equation for the exciton density. Adopting a hydrodynamic approach, we use multiscale expansion methods to derive several models appearing in the context of shallow water waves with viscosity. In particular, we derive a Boussinesq/Benney-Luke–type equation and its far-field expansion in terms of Kadomtsev-Petviashvili-I (KP-I) equations for right-and left-going waves. From the KP-I model, we predict the existence of vorticity-free, weakly (algebraically) localized two-dimensional dark-lump solitons. We find that, in the presence of dissipation, dark lumps exhibit a lifetime three times larger than that of planar dark solitons. Direct numerical simulations show that dark lumps do exist, and their dissipative dynamics is well captured by …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:ns9cj8rnVeAC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Solitons in dispersion-managed mode-locked lasers",
            "Publication year": 2008,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.77.033814",
            "Abstract": "The dynamics and propagation of ultrashort optical pulses generated in mode-locked lasers are investigated. The mode locking process depends crucially on the gain and loss mechanisms inside the cavity. Analytical models are introduced that include dispersion management and gain-loss terms with energy and power saturation. Comparisons of the pulse dynamics with previously well-known models are discussed. Stable soliton solutions are found for wide ranges of the parameters; the only significant requirement being sufficient gain in the system. The evolution of the system “locks” into the pure soliton solutions obtained independently with mode finding algorithms. Such solutions can be viewed as soliton wave attractors. Finally, it is shown that these solutions satisfy an asymptotic averaged system and can be approximated by elementary, Gaussian-type, functions.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:u-x6o8ySG0sC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Collapse for the higher-order nonlinear Schrödinger equation",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278915002328",
            "Abstract": "We examine conditions for finite-time collapse of the solutions of the higher-order nonlinear Schrödinger (NLS) equation incorporating third-order dispersion, self-steepening, linear and nonlinear gain and loss, and Raman scattering; this is a system that appears in many physical contexts as a more realistic generalization of the integrable NLS. By using energy arguments, it is found that the collapse dynamics is chiefly controlled by the linear/nonlinear gain/loss strengths. We identify a critical value of the linear gain, separating the possible decay of solutions to the trivial zero-state, from collapse. The numerical simulations, performed for a wide class of initial data, are found to be in very good agreement with the analytical results, and reveal long-time stability properties of localized solutions. The role of the higher-order effects to the transient dynamics is also revealed in these simulations.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:ZeXyd9-uunAC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Ring dark and antidark solitons in nonlocal media",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-41-3-583",
            "Abstract": "Ring dark and antidark solitons in nonlocal media are found. These structures have, respectively, the form of annular dips or humps on top of a stable CW background, and exist in a weak or strong nonlocality regime, defined by the sign of a characteristic parameter. It is demonstrated analytically that these solitons satisfy an effective cylindrical Kadomtsev–Petviashvili (aka Johnson’s) equation and, as such, can be written explicitly in closed form. Numerical simulations show that they propagate undistorted and undergo quasi-elastic collisions, attesting to their stability properties.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:mB3voiENLucC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Perturbations of dark solitons",
            "Publication year": 2011,
            "Publication url": "https://royalsocietypublishing.org/doi/abs/10.1098/rspa.2010.0663",
            "Abstract": "A direct perturbation method for approximating dark soliton solutions of the nonlinear Schrödinger (NLS) equation under the influence of perturbations is presented. The problem is broken into an inner region, where the core of the soliton resides, and an outer region, which evolves independently of the soliton. It is shown that a shelf develops around the soliton that propagates with speed determined by the background intensity. Integral relations obtained from the conservation laws of the NLS equation are used to determine the properties of the shelf. The analysis is developed for both constant and slowly evolving backgrounds. A number of problems are investigated, including linear and nonlinear damping type perturbations.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:WF5omc3nYNoC",
            "Publisher": "The Royal Society Publishing"
        },
        {
            "Title": "A mechanism to control and detect rogue waves by plane wave initial conditions: the prototypical example of the damped and periodically driven NLS equation",
            "Publication year": 2020,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2020arXiv201013174D/abstract",
            "Abstract": "Investigating by direct numerical simulations the dynamics of the damped and forced nonlinear Schr\\\" odinger equation in the presence of a time periodic forcing and for certain parametric regimes, we show that the wave-number of a plane-wave initial condition dictates the number of emerged Peregrine type rogue waves at the early stages of modulation instability. Another dynamical feature is that the formation of these events gives rise to the same number of transient\" triangular\" spatio-temporal patterns, each of which is reminiscent of the one emerging in the dynamics of the integrable NLS in its semi-classical limit, with vanishing initial conditions. The effects of the various parameters in modifying the above behavior are also discussed, and found to be far from its integrable limit counterpart. Furthermore, we find that the -norm of the spatial derivative and the -norm of the solution provide diagnostics for the …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dark solitons for an extended quintic nonlinear schrodinger equation",
            "Publication year": 2019,
            "Publication url": "https://olympias.lib.uoi.gr/jspui/bitstream/123456789/30806/1/DARK%20SOLITONS%20FOR%20AN%20EXTENDED%20QUINTIC%20NONLINEAR.pdf",
            "Abstract": "We study the existence, formation and dynamics of gray solitons for an extended quintic nonlinear Schrödinger (NLS) equation. The considered model finds applications to water waves, when the characteristic parameter kh–where k is the wavenumber and h is the undistorted water’s depth–takes the critical value kh= 1.363. It is shown that this model admits approximate dark soliton solutions emerging from an effective Korteweg-de Vries equation and that two types of gray solitons exist: fast and slow, with the latter being almost stationary objects. Analytical results are corroborated by direct numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dispersive perturbations of optical solitons",
            "Publication year": 2001,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.64.047602",
            "Abstract": "The precise manner in which radiation disperses away from a soliton in an optical fiber is a topic attracting current attention. The purpose of this paper is to emphasize that there exists a well-developed formalism derived from inverse scattering theory, which has ready application to this problem for the case when the radiation in question forms part of the input pulse to the fiber.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Pulse dynamics and solitons in mode-locked lasers",
            "Publication year": 2008,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.78.011802",
            "Abstract": "A model system is presented that describes the physical properties of mode-locked lasers. This distributed system incorporates gain and filtering saturated with energy while loss is saturated with power. It is found that general initial pulses evolve to stable localized solutions which exist for wide choices of the parameters, the only requirement being sufficient gain. Moreover, these pulses are essentially solitons of the classical nonlinear Schrödinger (NLS) equation. In the anomalous regime, the additional terms present in the system serve to provide the mode locking mechanism. Consequently, these pulses are approximated by the classical NLS soliton, given by hyperbolic secant functions, in agreement with recent experiments.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Recent Developments of Lyapunov–Type Inequalities for Fractional Differential Equations",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-27407-8_24",
            "Abstract": "A survey of results on Lyapunov-type inequalities for fractional differential equations associated with a variety of boundary conditions is presented. This includes Dirichlet, mixed, Robin, fractional, Sturm–Liouville, integral, nonlocal, multi-point, anti-periodic, conjugate, right-focal, and impulsive conditions. Furthermore, our study includes Riemann–Liouville, Caputo, Hadamard, Prabhakar, Hilfer, and conformable type fractional derivatives. Results for boundary value problems involving fractional p-Laplacian, fractional operators with nonsingular Mittag–Leffler kernels, q-difference, discrete, and impulsive equations are also taken into account.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Pulse shaping mechanism in mode-locked lasers",
            "Publication year": 2016,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2040-8978/18/6/06LT01/meta",
            "Abstract": "A pulse shaping mechanism applied to mode-locked lasers is proposed. By adding a linear (forcing) term in the power energy saturation model, we are able to control the resulting pulses in both energy and shape. In fact, this term also provides a focusing effect keeping most of the pulse's energy confined within the width of the forcing. The appropriate condition for which mode-locking occurs is also derived and links the physical parameters of the system (gain, loss, filtering) to those of the pulse (amplitude, width, energy). Thus, given the desired pulse one only needs to fix the laser's parameters accordingly, so as to obey this condition, and mode-locking will occur.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Fluctuating and dissipative dynamics of dark solitons in quasicondensates",
            "Publication year": 2011,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.84.043640",
            "Abstract": "The fluctuating and dissipative dynamics of matter-wave dark solitons within harmonically trapped, partially condensed Bose gases is studied both numerically and analytically. A study of the stochastic Gross-Pitaevskii equation, which correctly accounts for density and phase fluctuations at finite temperatures, reveals dark-soliton decay times to be lognormally distributed at each temperature, thereby characterizing the previously predicted long-lived soliton trajectories within each ensemble of numerical realizations [SP Cockburn et al., Phys. Rev. Lett. 104, 174101 (2010)]. Expectation values for the average soliton lifetimes extracted from these distributions are found to agree well with both numerical and analytic predictions based upon the dissipative Gross-Pitaevskii model (with the same ab initio damping). Probing the regime for which 0.8 k B T< μ< 1.6 k B T, we find average soliton lifetimes to scale with …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Dark soliton dynamics under the complex Ginzburg–Landau equation",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077915001356",
            "Abstract": "The dynamical properties of the complex Ginzburg–Landau equation are considered in the defocusing (normal dispersion) regime. It is found that under appropriate conditions stable evolution of dark solitons can occur. These conditions are derived using a newly developed perturbation theory that also reveals an important aspect of the dynamics: the formation of a shelf that accompanies the soliton and is an intricate part of its evolution. Further conditions to suppress this effect are also derived. These analytical predictions are found to be in excellent agreement with direct numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:IWHjjKOFINEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Self-Fourier functions and self-Fourier operators",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-23-4-829",
            "Abstract": "The concept of self-Fourier functions, i.e., functions that equal their Fourier transform, is almost always associated with specific functions, the most well known being the Gaussian and the Dirac delta comb. We show that there exists an infinite number of distinct families of these functions, and we provide an algorithm for both generating and characterizing their distinct classes. This formalism allows us to show the existence of these families of functions without actually evaluating any Fourier or other transform-type integrals, a task often challenging and frequently not even possible.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Dark solitons in mode-locked lasers",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-36-6-793",
            "Abstract": "Dark soliton formation in mode-locked lasers is investigated by means of a power–energy saturation model that incorporates gain and filtering saturated with energy, and loss saturated with power. It is found that general initial conditions evolve (mode-lock) into dark solitons under appropriate requirements also met in experimental observations. The resulting pulses are essentially dark solitons of the unperturbed nonlinear Schrödinger equation. Notably, the same framework also describes bright pulses in anomalous and normally dispersive lasers.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:roLk4NBRz8UC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Self-transform operators",
            "Publication year": 2006,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0305-4470/39/24/L02/meta",
            "Abstract": "The concept of self-Fourier functions, functions that equal their Fourier transform, is considered using differential operators. The goal is to analyse these functions and determine their properties without evaluating any Fourier, or any other type, transform integrals. Certain known results are generalized and the theory is extended to include integral and fractional-differential operators. Moreover, it is shown that the problem of defining these functions, in its original formulation, is equivalent to this method and in doing so, the concept of a Fourier eigenoperator is introduced. We also describe a procedure for applying this approach to general cyclic transforms.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:UebtZRa9Y70C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Small-amplitude defocusing nematicons",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/48/2/02FT01/meta",
            "Abstract": "Using a perturbation theory based on multiple scales analysis we obtain small amplitude nematicon structures in the defocusing (normal dispersion) regime. The nonlocal equations that describe light propagation through a liquid crystal are reduced to a Korteweg–de Vries (KdV) equation. As such, it is found that under certain conditions there exist dark and anti-dark (small amplitude) nematicons; the criterion is the sign of a constant quantity that relates to the physical parameters of the system. The amplitudes, velocities and phases of these pulses are obtained in closed form and are closely related to the soliton solution of the related KdV equation.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:dhFuZR0502QC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Dynamical oscillations in nonlinear optical media",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401809012000",
            "Abstract": "The spatial dynamics of pulses in Kerr media with parabolic index profile are examined. It is found that when diffraction and graded-index have opposite signs propagating pulses exhibit an oscillatory pattern, similar to a breathing behavior. Furthermore, if the pulse and the index profile are not aligned the pulse oscillates around the index origin with frequency that depends on the values of the diffraction and index of refraction. These oscillations are not observed when diffraction and graded-index share the same sign.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:Se3iqnhoufwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Universal reductions and solitary waves of weakly nonlocal defocusing nonlinear Schrödinger equations",
            "Publication year": 2021,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8121/abdb9f/meta",
            "Abstract": "We study asymptotic reductions and solitary waves of a weakly nonlocal defocusing nonlinear Schrödinger (NLS) model. The hydrodynamic form of the latter is analyzed by means of multiscale expansion methods. To the leading-order of approximation (where only the first of the moments of the response function is present), we show that solitary waves, in the form of dark solitons, are governed by an effective Boussinesq/Benney–Luke (BBL) equation, which describes bidirectional waves in shallow water. Then, for long times, we reduce the BBL equation to a pair of Korteweg–de Vries (KdV) equations for right-and left-going waves, and show that the BBL solitary wave transforms into a KdV soliton. In addition, to the next order of approximation (where both the first and second moment of the response function are present), we find that dark solitons are governed by a higher-order perturbed KdV (pKdV) equation …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:D03iK_w7-QYC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Analysis of optical waveguides with arbitrary index profile using an immersed interface method",
            "Publication year": 2011,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0129183111016543",
            "Abstract": "A numerical technique is described that can efficiently compute solutions of interface problems. These are problems with data, such as the coefficients of differential equations, discontinuous or even singular across one or more interfaces. A prime example of these problems are optical waveguides, and as such the scheme is applied to Maxwell's equations as they are formulated to describe light confinement in Bragg fibers. It is based on standard finite differences appropriately modified to take into account all possible discontinuities across the waveguide's interfaces due to the change of the refractive index. Second- and fourth-order schemes are described with additional adaptations to handle matrix eigenvalue problems, demanding geometries and defects.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:_kc_bZDykSQC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Integrable reduction and solitons of the Fokas–Lenells equation",
            "Publication year": 2021,
            "Publication url": "https://academic.oup.com/imamat/article-abstract/86/4/730/6309916",
            "Abstract": "Novel soliton structures are constructed for the Fokas–Lenells equation. In so doing, and after discussing the stability of continuous waves, a multiple scales based perturbation theory is used to reduce the equation to a Korteweg–de Vries system whose single soliton solution gives rise to intricate (and rather unexpected) solutions to the original system. Both the focusing and defocusing equations are considered and it is found that dark solitons may exist in both cases while in the focusing case antidark solitons are also possible. These findings are quite surprising as the relative nonlinear Schrödinger equation does not exhibit these solutions. So far, similar abundance of solutions has only been observed in relative coupled systems.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Rogue waves in birefringent optical fibers",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1607.01812",
            "Abstract": "Rogue waves in birefringent optical fibers are analyzed within the framework of the coupled nonlinear Schr\\\"odinger (CNLS) system. The generation of rogue waves is frequently associated with modulation instability (MI). It is commonly expected that since the CNLS equations exhibit larger growth rates they should also produce more rogue events than their scalar counterparts. This is found to occur only when both equations are focusing. When at least one component is defocusing, the CNLS equations may still exhibit larger growth rates, compared to the scalar system, but that does not necessarily result in more or larger events. The birefringence angle for which the maximum number of events occurs is also identified and the nature of the rogue wave is described for the different cases.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Eigenstate calculation of arbitrary quantum structures",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0375960106010516",
            "Abstract": "A simple, fast and very accurate numerical technique is presented to calculate the eigenstates of arbitrary quantum structures (both quantum wells and barriers). The method is based on a finite difference scheme which allows the use of sparse matrix algebra, thus, significantly reducing computational time and allowing for high precision results even for the high energy levels. More importantly, in cases where other methods fail or need to be significantly modified our method preforms very well.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Nonlinear optics in a birefringent optical fiber",
            "Publication year": 2004,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.69.016603",
            "Abstract": "We extend the perturbation theory of the nonlinear Schrödinger equation for the study of perturbed (nonintegrable) forms of the vector equation. We derive a set of linear equations that describe the radiation field shed by the soliton as it propagates down a birefringent optical fiber. The formalism is applied to the case when strong birefringence and higher-order dispersion are present in the fiber and to the study of polarization mode dispersion. Finally we discuss an analytical treatment of the mechanism that generates the soliton shadow.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:ufrVoPGSRksC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "On the NLS to KdV connection",
            "Publication year": 2014,
            "Publication url": "https://rjp.nipne.ro/2014_59_3-4/RomJPhys.59.p195.pdf",
            "Abstract": "The link between the perturbed defocusing nonlinear Schrödinger (NLS) equation and the perturbed Korteweg-de Vries (KdV) equation is established using a multiple scales expansion method. Unlike previous studies, we use the idea of a background function, and a simple change in the independent variables, to transform the perturbed NLS in a way such that multiple scales can be directly applied. Different perturbations are examined to include any possible case for the background function.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nematic dispersive shock waves from nonlocal to local",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2076-3417/11/11/4736",
            "Abstract": "The structure of optical dispersive shock waves in nematic liquid crystals is investigated as the power of the optical beam is varied, with six regimes identified, which complements previous work pertinent to low power beams only. It is found that the dispersive shock wave structure depends critically on the input beam power. In addition, it is known that nematic dispersive shock waves are resonant and the structure of this resonance is also critically dependent on the beam power. Whitham modulation theory is used to find solutions for the six regimes with the existence intervals for each identified. These dispersive shock wave solutions are compared with full numerical solutions of the nematic equations, and excellent agreement is found.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Solitons and spectral renormalization methods in nonlinear optics",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1140/epjst/e2009-01072-0",
            "Abstract": "Localized wave solutions, often referred to as solitary waves or solitons, are important classes of solutions in nonlinear optics. In optical communications, weakly nonlinear, quasi-monochromatic waves satisfy the “classical” and the “dispersion-managed” nonlocal nonlinear Schrödinger equations, both of which have localized pulses as special solutions. Recent research has shown that mode-locked lasers are also described by similar equations. These systems are variants of the classical nonlinear Schrödinger equation, appropriately modified to include terms which model gain, loss and spectral filtering that are present in the laser cavity. To study their remarkable properties, a computational method is introduced to find localized waves in nonlinear optical systems governed by these equations.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Nonlinear wave dynamics: From lasers to fluids",
            "Publication year": 2011,
            "Publication url": "https://www.aimsciences.org/article/doi/10.3934/dcdss.2011.4.923",
            "Abstract": "Nonlinear wave equations are central to the study of nonlinear optics and fluid dynamics. Notably, recent research has shown that solitons can be generated in mode-locked lasers. An interesting application of these lasers is the development of optical clocks which have the potential to be considerably more accurate than atomic clocks. Another important area of research in nonlinear optics is lattice dynamics where localized solitary wave or solitons can be obtained in periodic and irregular lattice systems. In honeycomb lattices, discrete and continuous nonlinear Dirac systems can be derived in certain parameter regimes; the Dirac systems describe conical diffraction, a phenomena observed in recent experiments. In water and internal waves the classical equations are reformulated as a system of coupled equations where the free surface equations are formulated as nonlocal equation and the depth variable is eliminated. These systems reduce to interesting asymptotic equations in suitable limits. A numerical method, termed spectral renormalization, is used to find solitary waves in nonlinear optics, water waves and multi-fluid systems.1. Introduction. Nonlinear waves in optics and water waves occur widely; the literature is extensive and in addition to research papers and memoirs there are many books which deal with this subject [16, 22, 56, 68]. Similarly, localized waves are of broad interest. One of the best known example goes back to J. Scott Russell [64] and his observation of solitary waves in shallow canals in Edinburgh, Scotland. This provided motivation for the seminal works of Boussinesq [21] and of KortewegdeVries (KdV)[53] in shallow …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:KlAtU1dfN6UC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Interacting nonlinear wave envelopes and rogue wave formation in deep water",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4906770",
            "Abstract": "A rogue wave formation mechanism is proposed within the framework of a coupled nonlinear Schrödinger (CNLS) system corresponding to the interaction of two waves propagating in oblique directions in deep water. A rogue condition is introduced that links the angle of interaction with the group velocities of these waves: different angles of interaction can result in a major enhancement of rogue events in both numbers and amplitude. For a range of interacting directions, it is found that the CNLS system exhibits significantly more extreme wave amplitude events than its scalar counterpart. Furthermore, the rogue events of the coupled system are found to be well approximated by hyperbolic secant functions; they are vectorial soliton-type solutions of the CNLS system, typically not considered to be integrable. Overall, our results indicate that crossing states provide an important mechanism for the generation of rogue …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Dark solitons in a trapped gas of long-range interacting bosons",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2106.14115",
            "Abstract": "We consider the interplay of repulsive short-range and long-range interactions in the dynamics of dark solitons, as prototypical coherent nonlinear excitations in a trapped quasi-1D Bose gas. Upon examining the form of the ground state, both the existence of the solitary waves and their stability properties are explored and corroborated by direct numerical simulations. We find that single- and multiple-dark-soliton states can exist and are generically robust in the presence of long-range interactions. We analyze the modes of vibration of such excitations and find that their respective frequencies are significantly upshifted as the strength of the long-range interactions is increased. Indeed, we find that a prefactor of the long-range interactions considered comparable to the trap strength may upshift the dark soliton oscillation frequency by {\\it an order of magnitude}, in comparison to the well established one of  in a trap of frequency .",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "PART 2-CHAOS, HYDRODYNAMICS, PLASMAS, AND RELATED TOPICS-Classical physics, including nonlinear media and photonic materials-Nonlinear optics in a birefringent optical fiber",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=16497399315334239751&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:ldfaerwXgEUC",
            "Publisher": "Melville, NY: Published by the American Physical Society through the American Institute of Physics, c2001-"
        },
        {
            "Title": "Solitons in normally dispersive mode-locked lasers",
            "Publication year": 2009,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.79.063845",
            "Abstract": "Soliton pulses in normally dispersive mode-locked lasers are considered using a nonlinear Schrödinger equation, appropriately modified to model power (intensity) and energy saturations. Strongly chirped, localized pulses are obtained when the effects of nonlinearity, dispersion, saturated gain, filtering, and loss form an appropriate balance. In the case of constant dispersion, perturbation theory yields a set of uncoupled equations for the amplitude and the phase of the soliton pulse. In dispersion-managed (DM) systems, an asymptotic multiple-scale theory is used to analyze the dynamics. This equation, which describes solitons in the anomalous regime, also admits higher-order solitons, the so-called antisymmetric soliton or bisoliton, in both constant dispersion and DM systems. Such pulses have been observed in recent experiments.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Higher-dimensional extended shallow water equations and resonant soliton radiation",
            "Publication year": 2021,
            "Publication url": "https://journals.aps.org/prfluids/abstract/10.1103/PhysRevFluids.6.104401",
            "Abstract": "The higher order corrections to the equations that describe nonlinear wave motion in shallow water are derived from the water wave equations. In particular, the extended cylindrical Korteweg–de Vries and Kadomtsev-Petviashvili equations—which include higher order nonlinear, dispersive, and nonlocal terms—are derived from the Euler system in (2+ 1) dimensions, using asymptotic expansions. It is thus found that the nonlocal terms are inherent only to the higher dimensional problem, both in cylindrical and Cartesian geometry. Asymptotic theory is used to study the resonant radiation generated by solitary waves governed by the extended equations, with an excellent comparison obtained between the theoretical predictions for the resonant radiation amplitude and the numerical solutions. In addition, resonant dispersive shock waves (undular bores) governed by the extended equations are studied. It is shown …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:CHSYGLWDkRkC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Water Waves and Light: Two Unlikely Partners",
            "Publication year": 2021,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=SG0tEAAAQBAJ&oi=fnd&pg=PA1&dq=info:AG6lJXUaOIwJ:scholar.google.com&ots=7TZcFps3YU&sig=Ql-HD6ZgLo6Q-IFWWWujxZHoKww",
            "Abstract": "We study a generic model governing optical beam propagation in media featuring a nonlocal nonlinear response, namely a two-dimensional defocusing nonlocal nonlinear Schrödinger (NLS) model. Using a framework of multiscale expansions, the NLS model is reduced first to a bidirectional model, namely a Boussinesq or a Benney-Luke-type equation, and then to the unidirectional Kadomtsev-Petviashvili (KP) equation–both in Cartesian and cylindrical geometry. All the above models arise in the description of shallow water waves, and their solutions are used for the construction of relevant soliton solutions of the nonlocal NLS. Thus, the connection between water wave and nonlinear optics models suggests that patterns of water may indeed exist in light. We show that the NLS model supports intricate patterns that emerge from interactions between soliton stripes, as well as lump and ring solitons, similarly to the situation occurring in shallow water.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "Matter-wave dark solitons: stochastic versus analytical results",
            "Publication year": 2010,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.104.174101",
            "Abstract": "The dynamics of dark matter-wave solitons in elongated atomic condensates are discussed at finite temperatures. Simulations with the stochastic Gross-Pitaevskii equation reveal a noticeable, experimentally observable spread in individual soliton trajectories, attributed to inherent fluctuations in both phase and density of the underlying medium. Averaging over a number of such trajectories (as done in experiments) washes out such background fluctuations, revealing a well-defined temperature-dependent temporal growth in the oscillation amplitude. The average soliton dynamics is well captured by the simpler dissipative Gross-Pitaevskii equation, both numerically and via an analytically derived equation for the soliton center based on perturbation theory for dark solitons.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Vector nematicons",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1610.01759",
            "Abstract": "Families of soliton pairs, namely vector solitons, are found within the context of a coupled nonlocal nonlinear Schrodinger system of equations, as appropriate for modeling beam propagation in nematic liquid crystals. In the focusing case, bright soliton pairs have been found to exist provided their amplitudes satisfy a specific condition. In our analytical approach, focused on the defocusing regime, we rely on a multiscale expansion methods, which reveals the existence of dark-dark and antidark-antidark solitons, obeying an effective Korteweg-de Vries equation, as well as dark-bright solitons, obeying an effective Mel'nikov system. These pairs are discriminated by the sign of a constant that links all physical parameters of the system to the amplitude of the stable continuous wave solutions, and, much like the focusing case, the solitons' amplitudes are linked leading to mutual guiding.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Patterns of water in light",
            "Publication year": 2019,
            "Publication url": "https://royalsocietypublishing.org/doi/abs/10.1098/rspa.2019.0110",
            "Abstract": "The intricate patterns emerging from the interactions between soliton stripes of a two-dimensional defocusing nonlinear Schrödinger (NLS) model with a non-local nonlinearity are considered. We show that, for sufficiently strong non-locality, the model is asymptotically reduced to a Kadomtsev–Petviashvilli-II (KPII) equation, which is a common model arising in the description of shallow water waves, as such patterns of water may indeed exist in light (this non-local NLS finds applications in nonlinear optics, modelling beam propagation in media featuring thermal nonlinearities, in plasmas, and in nematic liquid crystals). This way, approximate antidark soliton solutions of the NLS model are constructed from the stable KPII line solitons. By means of direct numerical simulations, we demonstrate that non-resonant and resonant two- and three-antidark NLS stripe soliton interactions give rise to wave configurations that …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:pqnbT2bcN3wC",
            "Publisher": "The Royal Society Publishing"
        },
        {
            "Title": "Dynamics of a Higher-Order Ginzburg–Landau-Type Equation",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-72563-1_9",
            "Abstract": "We study possible dynamical scenarios associated with a higher-order Ginzburg–Landau-type equation. In particular, first we discuss and prove the existence of a limit set (attractor), capturing the long-time dynamics of the system. Then, we examine conditions for finite-time collapse of the solutions of the model at hand, and find that the collapse dynamics is chiefly controlled by the linear/nonlinear gain/loss strengths. Finally, considering the model as a perturbed nonlinear Schrödinger equation, we employ perturbation theory for solitons to analyze the influence of gain/loss and other higher-order effects on the dynamics of bright and dark solitons.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Asymptotic Analysis of Pulse Dynamics in Mode‐Locked Lasers",
            "Publication year": 2009,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1467-9590.2009.00441.x",
            "Abstract": "Solitons of the power‐energy saturation (PES) equation are studied using adiabatic perturbation theory. In the anomalous regime individual soliton pulses are found to be well approximated by solutions of the classical nonlinear Schrödinger (NLS) equation with the key parameters of the soliton changing slowly as they evolve. Evolution equations are found for the pulse amplitude(s), velocity(ies), position(s), and phase(s) using integral relations derived from the PES equation. The results from the integral relations are shown to agree with multi‐scale perturbation theory. It is shown that the single soliton case exhibits mode‐locking behavior for a wide range of parameters, while the higher states form effective bound states. Using the fact that there is weak overlap between tails of interacting solitons, evolution equations are derived for the relative amplitudes, velocities, positions, and phase differences. Comparisons of …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Blackwell Publishing Inc"
        },
        {
            "Title": "Multi-dimensional localized structures in dust-laden nonthermal plasmas: overview of recent results",
            "Publication year": 2021,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2021cosp...43E1111K/abstract",
            "Abstract": "The occurrence of electrostatic localized structures within a magnetized plasma fluid model is investigated from first principles. The modulational dynamics of ion-acoustic wavepackets is considered in a background characterized by the presence of massive dust particulates and energetic electrons. A (non-Maxwellian) kappa distribution is adopted in account of the presence of superthermal (accelerated) particles in the background-an ubiquitous situation in Space plasma contexts eg in the solar wind. By means of a multiple scale perturbation technique, the nonlinear envelope is shown to obey a Davey-Stewartson system of equations for specific components of the electrostatic potential (disturbance). Various forms of structures are considered, in the form of dromions, lump-shaped solitary waves and dark-type envelope structures, depending on different parameter regions. Crossing-states are also obtained …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Passive mode-locking under higher order effects",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-31-11-2748",
            "Abstract": "The response of a passive mode-locking mechanism, where gain and spectral filtering are saturated with the energy and loss saturated with the power, is examined under the presence of higher order effects. These include third-order dispersion, self-steepening, and Raman gain. The locking mechanism is maintained even with these terms; mode-locking occurs for both the anomalous and normal regimes. In the anomalous regime, these perturbations are found to affect the speed but not the structural integrity of the (locked) pulses. In fact, these pulses behave like solitons of a classical nonlinear Schrödinger equation and, as such, a soliton perturbation theory is used to verify the numerical observations. In the normal regime, the effect of the perturbations is small, in line with recent experimental observations. The results in the normal regime are verified mathematically using a Wentzel–Kramers–Brillouin-type …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "On the Properties of a Nonlocal Nonlinear Schrödinger Model and Its Soliton Solutions",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-89815-5_14",
            "Abstract": "Nonlinear waves are normally described by means of certain nonlinear evolution equations. However, finding physically relevant exact solutions of these equations is, in general, particularly difficult. One of the most known nonlinear evolution equation is the nonlinear Schrödinger (NLS), a universal equation appearing in optics, Bose-Einstein condensates, water waves, plasmas, and many other disciplines. In optics, the NLS system is used to model a unique balance between the critical effects that govern propagation in dispersive nonlinear media, namely dispersion/diffraction and nonlinearity. This balance leads to the formation of solitons, namely robust localized waveforms that maintain their shape even when they interact. However, for several physically relevant contexts the standard NLS equation turns out to be an oversimplified description. This occurs in the case of nonlocal media, such as nematic …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Light meets water in nonlocal media: surface tension analogue in optics",
            "Publication year": 2017,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.118.243903",
            "Abstract": "Shallow water wave phenomena find their analogue in optics through a nonlocal nonlinear Schrödinger (NLS) model in 2+ 1 dimensions. We identify an analogue of surface tension in optics, namely, a single parameter depending on the degree of nonlocality, which changes the sign of dispersion, much like surface tension does in the shallow water wave problem. Using multiscale expansions, we reduce the NLS model to a Kadomtsev-Petviashvili (KP) equation, which is of the KPII (KPI) type, for strong (weak) nonlocality. We demonstrate the emergence of robust optical antidark solitons forming Y-, X-, and H-shaped wave patterns, which are approximated by colliding KPII line solitons, similar to those observed in shallow waters.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:M3NEmzRMIkIC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Rogue waves in nonlocal media",
            "Publication year": 2017,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.95.042211",
            "Abstract": "The generation of rogue waves is investigated in a class of nonlocal nonlinear Schrödinger (NLS) equations. In this system, modulation instability is suppressed as the effect of nonlocality increases. Despite this fact, there is a parameter regime where the number and amplitude of the rogue events increase as compared to the standard NLS equation, which is a limit of the system when nonlocality vanishes. Furthermore, the nature of these waves is investigated; while no analytical solutions are known to model these events, it is shown, numerically, that these rogue events differ significantly from the rational soliton (Peregrine) solution of the limiting NLS equation. The universal structure of the associated rogue waves is discussed and a local description is presented. These results can help in the experimental realization of rogue waves in these media.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:j3f4tGmQtD8C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Rogue waves in birefringent optical fibers: elliptical and isotropic fibers",
            "Publication year": 2017,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2040-8986/aa69da/meta",
            "Abstract": "Rogue waves in elliptically polarized birefringent optical fibers are analyzed within the framework of a'non-integrable'coupled nonlinear Schrödinger (CNLS) system, which can be used to describe pulse propagation in elliptically birefringent optical fibers. The modulation instability (MI) analysis of this system reveals that, in general, this coupled system is more unstable than its scalar (isotropic) counterpart. In fact, numerical simulations indicate that the generation of rogue events is comparable to the isotropic case. This implies that there is no 1-1 correspondence between rogue wave generation and MI, in these media. The birefringence angle for which the maximum number of rogue events is identified and the nature of the rogue wave is described for the different cases. Although the CNLS system is non-integrable in certain cases these rogue waves are well approximated by the rational solutions of the scalar …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:maZDTaKrznsC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Transverse instability and dynamics of nonlocal bright solitons",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.09170",
            "Abstract": "We study the transverse instability and dynamics of bright soliton stripes in two-dimensional nonlocal nonlinear media. Using a multiscale perturbation method, we derive analytically the first-order correction to the soliton shape, which features an exponential growth in time -- a signature of the transverse instability. The soliton's characteristic timescale associated with its exponential growth,is found to depend on the square root of the nonlocality parameter. This, in turn, highlights the nonlocality-induced suppression of the transverse instability. Our analytical predictions are corroborated by direct numerical simulations, with the analytical results being in good agreement with the numerical ones.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solitary waves in the resonant nonlinear Schrödinger equation: Stability and dynamical properties",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0375960120302802",
            "Abstract": "The stability and dynamical properties of the so-called resonant nonlinear Schrödinger (RNLS) equation, are considered. The RNLS is a variant of the nonlinear Schrödinger (NLS) equation with the addition of a perturbation used to describe wave propagation in cold collisionless plasmas. We first examine the modulational stability of plane waves in the RNLS model, identifying the modifications of the associated conditions from the NLS case. We then move to the study of solitary waves with vanishing and nonzero boundary conditions. Interestingly the RNLS, much like the usual NLS, exhibits both dark and bright soliton solutions depending on the relative signs of dispersion and nonlinearity. The corresponding existence, stability and dynamics of these solutions are studied systematically in this work.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:u_35RYKgDlwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Soliton strings and interactions in mode-locked lasers",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401809006580",
            "Abstract": "Soliton strings in mode-locked lasers are obtained using a variant of the nonlinear Schrödinger equation, appropriately modified to model power (intensity) and energy saturation. This equation goes beyond the well-known master equation often used to model these systems. It admits mode-locking and soliton strings in both the constant dispersion and dispersion-managed systems in the (net) anomalous and normal regimes; the master equation is contained as a limiting case. Analysis of soliton interactions show that soliton strings can form when pulses are a certain distance apart relative to their width. Anti-symmetric bi-soliton states are also obtained. Initial states mode-lock to these states under evolution. In the anomalous regime individual soliton pulses are well approximated by the solutions of the unperturbed nonlinear Schrödinger equation, while in the normal regime the pulses are much wider and strongly …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Dark solitons in the presence of higher-order effects",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-38-23-5098",
            "Abstract": "Dark soliton propagation is studied in the presence of higher-order effects, including third-order dispersion, self-steepening, linear/nonlinear gain/loss, and Raman scattering. It is found that for certain values of the parameters a stable evolution can exist for both the soliton and the relative continuous-wave background. Using a newly developed perturbation theory we show that the perturbing effects give rise to a shelf that accompanies the soliton in its propagation. Although, the stable solitons are not affected by the shelf it remains an integral part of the dynamics otherwise not considered so far in studies of higher-order nonlinear Schrödinger models.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Dielectric waveguides of arbitrary cross sectional shape",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0307904X12006300",
            "Abstract": "Numerical guided mode solutions of arbitrary cross sectional shaped waveguides are obtained using a finite difference (FD) technique. The standard FD scheme is appropriately modified to capture all discontinuities, due to the change of the refractive index, across the waveguides’ interfaces taking into account the shape of each interface at the same time. The method is applied to the vector Helmholtz equation formulated to describe the electric or magnetic fields in the waveguide (one field is retrieved from the other through Maxwell’s equations). Computational cost is kept to a minimum by exploiting sparse matrix algebra. The waveguides under study have arbitrary cross sectional shape and arbitrary refractive index profile.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The short-pulse equation and associated constraints",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/42/44/442004/meta",
            "Abstract": "The short-pulse equation (SPE) is considered as an initial boundary value problem. It is found that the solutions of the SPE must satisfy an integral relation otherwise the temporal derivative exhibits discontinuities. This integral relation is not necessary for a solution to exist. An infinite number of such constraints can be dynamically generated by the evolution equation.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Rogue waves and periodic solutions of a nonlocal nonlinear Schrödinger model",
            "Publication year": 2020,
            "Publication url": "https://journals.aps.org/prresearch/abstract/10.1103/PhysRevResearch.2.013351",
            "Abstract": "In the present paper, a nonlocal nonlinear Schrödinger (NLS) model is studied by means of a recent technique that identifies solutions of partial differential equations by considering them as fixed points in space-time. This methodology allows us to perform a continuation of well-known solutions of the local NLS model to the nonlocal case. Four different examples of this type are presented, namely,(a) the rogue wave in the form of the Peregrine soliton and (b) the generalization thereof in the form of the Kuznetsov-Ma breather, as well as two spatiotemporally periodic solutions in the form of elliptic functions. Importantly, all four wave forms can be continued in intervals of the parameter controlling the nonlocality of the model. The first two can be continued in a narrower interval, while the periodic ones can be extended to arbitrary nonlocalities and, in fact, present an intriguing bifurcation whereby they merge with (only …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:SeFeTyx0c_EC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Excited Bose–Einstein condensates: Quadrupole oscillations and dark solitons",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378475410002569",
            "Abstract": "We study the dynamics of atomic Bose–Einstein condensates (BECs), when the quadrupole mode is excited. Within the Thomas–Fermi approximation, we derive an exact first-order system of differential equations that describes the parameters of the BEC wave function. Using perturbation theory arguments, we derive explicit analytical expressions for the phase, density and width of the condensate. Furthermore, it is found that the observed oscillatory dynamics of the BEC density can even reach a quasi-resonance state when the trap strength varies according to a time-periodic driving term. Finally, the dynamics of a dark soliton on top of a breathing BEC are also briefly discussed.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:Zph67rFs4hoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A Davey–Stewartson description of two‐dimensional solitons in nonlocal media",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/sapm.12283",
            "Abstract": "Novel soliton solutions of a two‐dimensional (2D) nonlocal nonlinear Schrödinger (NLS) system are revealed by asymptotically reducing the system to a completely integrable Davey–Stewartson (DS) set of equations. In so doing, the reductive perturbation method in addition to a multiple scales scheme are utilized to derive both the DS‐I and DS‐II systems, depending on the strength of the nonlocality, which in turn, may be regarded here as a measure of the surface tension. As such, two different soliton solutions are obtained: the breather and dromion solutions in the case of DS‐I (weak nonlocality), as well as lump solutions in the case of DS‐II (strong nonlocality). Besides their immediate mathematical importance, our results find a wide range of applications due the high applicability of the relative nonlocal NLS (optics, plasmas, liquid crystals, and thermal media in the strong nonlocality regime, etc.) and hence …",
            "Abstract entirety": 0,
            "Author pub id": "9VDoWOEAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Constructive and destructive perturbations of dark solitons in mode-locked lasers",
            "Publication year": 2015,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2040-8978/17/4/042001/meta",
            "Abstract": "The locking mechanism to dark solitons in passive mode-locked (ML) lasers is studied under the presence of perturbative effects. These include higher order dispersion, self-steepening, and Raman gain. Using a recently developed perturbation theory it is found that linear and nonlinear effects may be combined in such a way as to cancel their respect contributions resulting in stable pulses. Parameter values are found where mode-locking occurs and stable pulses, both black and grey, exist. This work explains why there can be wider observable regimes with ML dark soliton pulses.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "High-order eigenstate calculation of arbitrary quantum structures",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/42/23/235201/meta",
            "Abstract": "Quantum engineering of electronic energy states using nanoscale layers of semiconductor compounds allows the design and the observation of quantum phenomena which are typically observed in atomic structures. Furthermore, semiconductors are present in nearly all modern electronic devices and are a crucial component of integrated circuits. Due to the relatively high rate of manufacturing defects, it is crucial to have a method for testing new semiconductor formations without requiring a sample to be fabricated. A simple, fast and very accurate numerical technique is presented to calculate the eigenstates of such arbitrary quantum structures. The method is based on a high-order finite difference scheme which allows the use of sparse matrix algebra, thus, significantly reducing computational time and allowing for high precision results even for the high energy states.",
            "Abstract entirety": 1,
            "Author pub id": "9VDoWOEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IOP Publishing"
        }
    ]
}]