[{
    "name": "Θωμάς Ξένος",
    "romanize name": "Thomas Xenos",
    "School-Department": "Ηλεκτρολόγων Μηχ & Μηχ Υπολογιστών",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 9959,
    "Scholar name": "Thomas Xenos",
    "Scholar id": "NFCJxPMAAAAJ",
    "Affiliation": "Professor Aristotle University of Thessaloniki",
    "Citedby": 1287,
    "Interests": [
        "antenna design",
        "earthquake prediction",
        "radio-wave propagation"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=NFCJxPMAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Overall Uncertainty Estimation in Multiple Narrow-Band In Situ Electromagnetic Field Measurements",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4840378/",
            "Abstract": "The possible adverse effects on human health of exposure to nonionizing electromagnetic fields have led international organizations and several countries to adopt exposure limits regarding public or occupational safety. To ensure compliance with these limits, specifically designed measurements with suitable instruments have to be performed. Since uncertainty is always present even when expensive instrumentation is employed, the final results from computations of the measured data deviate from the respective true values. The divergence depends on the instrumentation employed, the used methodology, or even the random effects, e.g., human factors or environmental conditions. In this paper, a method for evaluating total uncertainty when multiple narrow-band electromagnetic field measurements are performed is proposed. This is very common when exposure in residential areas is assessed.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tracking of manoeuvring and ballistic targets via measurements taken by a transmitter- independentreceiver network using first order recurrent neural networks.",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=800195027410005502&hl=en&oi=scholarr",
            "Abstract": "In this paper a totally passive multistatic radar, using angle of arrival mode of operation is examinedand a method of tracking of airborne and ballistic target using monopulse antennas and artificial neural networks (ANN) is developed. In the introduction a brief system description is given and methods of operation are briefly examined. Then the AOA method is formulated and a solution using a first order variable weight recurrent ANN is proposed. In order to prove the solution simulation is performed. The same isdone for the velocity of the target (if signal permits Doppler frequency processing). Finally it is shown that practical ANN designsare attractive and simple solutions for an AOA based TIRN for moving target tracking purposes, combining fast and robust convergence, ease of design and construction and - in case of redundancy - adequate survivability.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design of a novel antenna array beamformer using neural networks trained by modified adaptive dispersion invasive weed optimization based data",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6479247/",
            "Abstract": "A new antenna array beamformer based on neural networks (NNs) is presented. The NN training is performed by using optimized data sets extracted by a novel invasive weed optimization (IWO) variant called modified adaptive dispersion IWO (MADIWO). The trained NN is utilized as an adaptive beamformer that makes a uniform linear antenna array steer the main lobe toward a desired signal, place respective nulls toward several interference signals, and suppress the side lobe level (SLL). Initially, the NN structure is selected by training several NNs of various structures using MADIWO-based data and by making a comparison among the NNs in terms of training performance. The selected NN structure is then used to construct an adaptive beamformer, which is compared to MADIWO-based and ADIWO-based beamformers, regarding the SLL and the ability to properly steer the main lobe and the nulls. The …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An artificial neural network predictor for tropospheric surface duct phenomena",
            "Publication year": 2007,
            "Publication url": "https://npg.copernicus.org/articles/14/569/2007/",
            "Abstract": " In this work, an artificial neural network (ANN) model is developed and used to predict the presence of ducting phenomena for a specific time, taking into account ground values of atmospheric pressure, relative humidity and temperature. A feed forward backpropagation ANN is implemented, which is trained, validated and tested using atmospheric radiosonde data from the Helliniko airport, for the period from 1991 to 2004. The network's quality and generality is assessed using the Area Under the Receiver Operating Characteristics (ROC) Curves (AUC), which resulted to a mean value of about 0.86 to 0.90, depending on the observation time. In order to validate the ANN results and to evaluate any further improvement options of the proposed method, the problem was additionally treated using Least Squares Support Vector Machine (LS-SVM) classifiers, trained and tested with identical data sets for direct performance comparison with the ANN. Furthermore, time series prediction and the effect of surface wind to the presence of tropospheric ducts appearance are discussed. The results show that the ANN model presented here performs efficiently and gives successful tropospheric ducts predictions.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Copernicus GmbH"
        },
        {
            "Title": "Wave propagation and reflection in the ionosphere. An alternative approach for ray path calculations",
            "Publication year": 2004,
            "Publication url": "https://www.jpier.org/PIER/pier.php?paper=0307182",
            "Abstract": "In this work, the ray trajectory for oblique incidence is determined by solving the wave equation using the Finite Element Method (FEM). In case of ionospheric reflection the Discrete Fourier Transform (DFT), applied here in the space domain, is used to discriminate the incident and reflected waves. Ray tracing equations are combined with the Poynting vector components in order to calculate the wave trajectory taking into account the Earth's curvature. The results are illustrated for different frequencies and angles of incidence using electron density profiles obtained from the Rome digisonde station, topside profiles from the IRI-95 model and atmospheric data from the MSIS-E-90 model of NSSDC as an inputs.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:pqnbT2bcN3wC",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "Comparative study of broadcasting antenna array optimization using evolutionary algorithms",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7601166/",
            "Abstract": "Broadcasting antenna array optimized design involves gain maximization, main lobe down-tilting and null filling. In this study some of the most powerful evolutionary optimization algorithms are applied to this challenging problem: Differential Evolution, Particle Swarm, Invasive Weed, Adaptive Invasive Weed, and the Taguchi method. Evolutionary algorithms use a random search approach together with mechanisms inspired by biological evolution in order to iteratively improve the precision of randomly obtained solutions. Evolutionary algorithms are shown to require very substantial computational resources due to their random search nature. However, they are also very robust in finding a quasi-optimum solution by optimizing an appropriate fitness function. It is demonstrated that the algorithm producing the best fitness, and thus the best solution to the antenna problem, is Invasive Weed Optimization (IWO …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Development and electromagnetic characterization of adaptable open-architecture WLAN systems",
            "Publication year": 2009,
            "Publication url": "https://www.jpier.org/PIER/pier.php?paper=09021002",
            "Abstract": "The construction and comprehensive electromagnetic analysis of a novel class of WLAN layouts is presented in this paper. The main purpose is to construct a wireless system according to the 802.11 a/b/g standards, which enables significantly larger and more reliable data transfer rates, making use of a new largescale field prediction technique, based on the parabolic equation with finite differences. Thus, four distinct structures, based on two different operating systems and two different hardware architectures, are proposed and elaborately examined. On the other hand, for the prediction algorithm a 3D wide-angle parabolic equation scheme is devised and a recursive approximation of the forward wave equation is accomplished. Unlike existing methods that characterize obstacles by means of surface impedance boundary conditions, a more rigorous approach, by treating them as penetrable objects with known …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:J_g5lzvAfSwC",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "Optimal design of UHF TV band log-periodic antenna using invasive weed optimization",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6934491/",
            "Abstract": "A powerful evolutionary method called Invasive Weed Optimization (IWO) is applied to achieve optimal designs of log-periodic antennas. The antennas are designed for operation in the UHF-TV band, i.e. 470-860 MHz, and are optimized with respect to the standing wave ratio (SWR), the front-to-rear (F/R) ratio, and the forward gain. The parameters under optimization are the dipole lengths, the dipole diameters, the distances between adjacent dipoles and the characteristic impedance of the transmission line that feeds the dipoles. The optimized antenna geometries that resulted from the above method seem to be significantly better than the respective ones derived from the classical design method.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient parabolic equation- finite element model for the analysis of wave propagation in highly complex indoor communication environments.",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=861314654178343773&hl=en&oi=scholarr",
            "Abstract": "In this paper we propose an efficient computational technique to investigate the distribution of the electromagnetic field in complex cases of indoor communication problems, taking into account the exact geometric configuration of the environment under consideration, including walls, metallic structures and other objects. In particular, we consider the highly interesting case of theso-called interface modeling, i.e. when aplane wave propagates to the interior ofa building. The methodology presented herein, is based on a parabolic wave equation in three dimensions, while the cross section of the computational domain, as the wave propagates,is modeled by means of a finite element technique, terminated by highly absorbing PML boundaries. This formulation enables a robust computational modeling of obstacles of complex shape in a fully automated way. On the other hand, the formulation does not make any …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of the electromagnetic fields exposure produced by WiMAX signals",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6294714/",
            "Abstract": "Wireless networking technologies in recent years have witnessed important developments since the advantages benefit both data transmission service providers, and individuals or ordinary users. Ease of installation of a wireless network, led to the development of millions of Wi-Fi networks throughout the world. Nevertheless, Wi-Fi has certain drawbacks that inspired the implementation of a new technology called WiMAX. In 2003, the IEEE 802.16™ standard, also known as WiMAX (Worldwide Interoperability for Microwave Access) was adopted, in order to meet the requirements for broadband wireless access. The purpose of this paper is to study how the electromagnetic fields generated by WiMAX base stations can be evaluated in terms of exposure.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimization of log-periodic dipole antenna with LTE band-rejection",
            "Publication year": 2017,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/cp.2017.0308",
            "Abstract": "This study presents an optimized design of a 10-dipole log-periodic antenna for UHF TV reception with LTE band rejection. The simulation of the antenna was performed in CST simulation software followed by optimization of the design using TRF (Trusted Region Framework) algorithm in the frequency range of 450 MHz-900 MHz. The parameters optimized are S11, realized gain and front-to-back ratio of the antenna. TV reception passband is 450 MHz-790 MHz and LTE band is 810 MHz-900 MHz. The proposed antenna design provides a good matching with a low S11 in the passband (470 MHz-790 MHz) and a high S11 in the stopband (i.e. LTE region of 810 MHz-900 MHz). The antenna provides a realized gain between 7 dBi and 8 dBi whereas front-to-back ratio above 14 dB in the passband.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "A neural network based prediction method for troposheric ducting over the Hellenic region",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1366421.1366478",
            "Abstract": "The prediction of the tropospheric ducting conditions plays an important role in radio wave propagation. The scope of this work is to predict the tropospheric ducting characteristics over the Hellenic region by means of Artificial Neural Networks using data obtained from radio-balloon observations at Hellenicon Airport. It is proved that the tropospheric ducting manifestation can be predicted very accurately. On the other hand the low-altitude duct characteristics are very accurately predicted in all cases, whereas the characteristics of the high-altitude ones are marginally predicted. This can be due to the fact that the frequency of manifestation of the second ones is low.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal design of aperiodic reconfigurable antenna array suitable for broadcasting applications",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/717910",
            "Abstract": "An aperiodic reconfigurable microstrip antenna array is designed to serve as a DVB-T base station antenna operating in a single broadcasting channel. The antenna array is optimized at 698 MHz (center frequency of DVB-T channel 49) to concurrently achieve a particular radiation pattern shaping with high forward gain, main lobe tilting and null filling inside the service area, as well as low sidelobe level outside the service area, and low standing wave ratio at the inputs of all the array elements. To concurrently satisfy all the above requirements, both the geometry dimensions and the array feeding weights (amplitudes and phases) are optimized, thus leading to a complex multi-variable and multi-objective problem. The problem is solved by applying a recently developed particle swarm optimization (PSO) improved variant, called PSO with velocity mutation, in conjunction with the CST software package, which is employed by the PSOvm every time a full-wave analysis is required. Furthermore, all the optimization methods found in the CST environment are compared with the PSOvm. The results show that the PSOvm is capable of producing an antenna array geometry, which is closer to the predefined requirements than the geometries derived by the rest of the optimizers, in the least amount of computational time. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:WbkHhVStYXYC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "FDTD method with oblique incidence for ionospheric wave propagation problems-application to an HF one-hop radio-link study",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/996176/",
            "Abstract": "This paper introduces a new finite-difference time-domain (FDTD) approach for electrically very large wave-propagation problems and especially for high-frequency (HF) ionospheric radio-link studies. An appropriate modification of the FDTD technique is presented, which reduces the problem's dimension by the appropriate introduction of an effective magnetic permeability for the ionospheric layers. The proposed approach gives an answer to the demand for accurate radio-link design, taking into account the characteristics of ionosphere all over the path of propagation, unlike existing simplified analytical methods. The methodology is successfully applied to a practical HF one-hop ionospheric radio-link study.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Application of Self Adaptive Unsupervised Neural Networks for Processing of VLF-LF signals to detect Seismic-Ionospheric Precursor Phenomena.",
            "Publication year": 2012,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2012EGUGA..14.2134S/abstract",
            "Abstract": "This paper investigates the development and application of artificial neural networks (ANN) based on Predictive Modular Neural Networks (PREMONNs) to provide a self adaptive unsupervised method for detecting disturbances that can be attributed to seismic-ionospheric precursor phenomena using VLF radio signals. As such, the neural network is applied to bring forth and adaptively discriminate different characteristics in the received signals, in real time, in order to provide data segments of interest that can be correlated to subsequent seismic phenomena. PREMONNs have been developed for time series prediction and through that for source switching detection in a time series; they are constituted by two modules. The first tier is a module consisting of a dynamic array of neural networks following the data stream in order to predict the next value of a time series whereas the second is a decision one utilizing a …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Anomalies observed in vlf and lf radio signals on the occasion of the western turkey earthquake (mw= 5.7) on may 19, 2011",
            "Publication year": 2012,
            "Publication url": "https://dspace.uevora.pt/rdpc/handle/10174/6957",
            "Abstract": "VLF radio signals lie in the 10 - 60 kHz frequency band. These radio signals are used for worldwide navigation support, time signals and for military purposes. They are propagated in the earth-ionosphere wave-guide mode along great circle propagation paths. So, their propaga-tion is strongly affected by the ionosphere conditions. LF signals lie in 150 - 300 kHz frequency band. They are used for long way broadcasting by the few (this type of broadcasting is going into disuse) transmitters located in the world. These radio signals are characterized by the ground wave and the sky wave propagation modes [1]. The first generates a stable signal that propagates in the channel Earth-troposphere and is affected by the surface ground and troposphere condition. The second instead gives rise to a signal which varies greatly between day and night, and between summer and winter, and which propagates using the lower ionosphere as a reflector; its propagation is mainly affected by the ionosphere condi-tion, particularly in the zone located in the middle of the transmitter-receiver path. The propagation of the VLF/LF radio signals is affected by different factors such as the meteorological condition, the solar bursts and the geo-magnetic activity. At the same time, variations of some parameters in the ground, in the atmosphere and in the ionosphere occurring during the preparatory phase of earthquakes can produce disturbances in the above men-tioned signals. As already reported by many previous studies [2-18] the disturbances are classified as anoma-lies and different methods of analysis as the residual dA/ dP [15], the terminator time TT [9], the Wavelet …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:RGFaLdJalmkC",
            "Publisher": "Scientific Research Publishing (SCIRP)"
        },
        {
            "Title": "Operability Aspects of a Transmitter-Independent Receiver Network Against Radar and Communication Jamming",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4371664/",
            "Abstract": "A transmitter independent receiver network (TIRN) is a network of radar receivers that operates in an area without cooperating with a particular radar transmitter, but rather using transmitters of opportunity (TOA) in order to detect and track airborne, ballistic or surface targets. In this paper a brief vulnerability analysis is given in both the detection/tracking and the communication subsystems of such a network. Electronic defense (ED) solutions and interference avoidance techniques are given. A TIRN is mostly based in silent (low emission) operation and redundancy techniques. It is briefly described in the introduction. In the following paragraphs dealing with jamming techniques and is discussed, for both the detection and communication subsystems, comparing the results with the classic radar equivalent where applicable. It is finally concluded that such a network less vulnerable than conventional radars in most …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and optimization of wideband log-periodic dipole arrays under requirements for high gain, high frontto-back ratio, optimal gain flatness, and low side lobe level: The application of invasive weed optimization",
            "Publication year": 2015,
            "Publication url": "https://pure.unic.ac.cy/en/publications/design-and-optimization-of-wideband-log-periodic-dipole-arrays-un",
            "Abstract": "The design and optimization of wideband log-periodic dipole arrays (LPDAs) are presented in this chapter. The LPDAs are expected to simultaneously satisfy several requirements inside a wide operating frequency range. In particular, the optimized LPDA has to provide standing wave ratio (SWR) below a predefined value, gain values as high as possible, gain flatness (GF) below a desired value, both side lobe level (SLL) and front-to-back ratio (FBR) below a desired value, and all these requirements must be satisfied at the same time inside the entire frequency range of operation. Since the design problem is nonlinear and inherently multiobjective, the simultaneous realization of all the above requirements can only be achieved by applying global optimization algorithms. These algorithms are usually based on evolutionary optimization methods and have been proved to be capable of solving complex nonlinear problems with great success. Such an evolutionary method with high potential in antenna design is presented in this chapter. The method is called invasive weed optimization (IWO) and is applied in conjunction with the method of moments (MoM) to optimize LPDAs under the above-mentioned requirements. The MoM is a well-known full-wave analysis method and is utilized here to extract the radiation characteristics of the LPDA required by the IWO algorithm. Several design cases are studied concerning the LPDA geometry and the operating bandwidth. The derived LPDA geometries exhibit a behavior close to the desired one and therefore are able to enhance the performance of a wireless network in practical applications.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:_xSYboBqXhAC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Vibration signal analysis of rubber-mounted roller-bearing mechanical system using hilbert-huang transform",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Christos-Tsiafis/publication/273330242_Vibration_signal_analysis_of_rubber-mounted_roller-bearing_mechanical_system_using_Hilbert-Huang_transform/links/54fece780cf2741b69f16340/Vibration-signal-analysis-of-rubber-mounted-roller-bearing-mechanical-system-using-Hilbert-Huang-transform.pdf",
            "Abstract": "Machinery diagnostics is an important research area that requires inter-disciplinary expertise. Typically, machines operate in complicated, uncertain and varying environments. Therefore, it is necessary to continuously monitor their performance using non-destructive diagnostic methods. These methods deal with data signals obtained when the machine is operating. In this paper, the method of Hilbert–Huang transform is applied on non-stationary and non-linear vibration signals obtained via velocity-meters from a mechanical system which contains a shaft rotating on roller bearings. Two time series were used. The first series are obtained at the positions of the roller bearings without using rubber mounting while the second ones are obtained at the same positions using rubber mounting. The experimental study and its results are presented, and finally the conclusions derived from the results are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:ufrVoPGSRksC",
            "Publisher": "International Conference on Manufacturing Engineering (ICMEN). Thessaloniki: EEDM and PCCM"
        },
        {
            "Title": "Optimal wideband LPDA design for efficient multimedia content delivery over emerging mobile computing systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7014235/",
            "Abstract": "An optimal synthesis of a wideband log-periodic dipole array (LPDA) is introduced in this paper. The LPDA optimization is performed under several requirements concerning the standing wave ratio, the forward gain, the gain flatness, the front-to-back ratio, and the sidelobe level, over a wide frequency range. The LPDA geometry that complies with the aforementioned requirements is suitable for efficient multimedia content delivery. The optimization process is accomplished by applying a recently introduced method called invasive weed optimization (IWO). The method has already been compared to other evolutionary methods and has shown superiority in solving complex nonlinear problems in telecommunications and electromagnetics. In this paper, the IWO method has been chosen to optimize an LPDA for operation in the frequency range of 800-3300 MHz. Due to its excellent performance, the LPDA can …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Invasive weed optimized planar elliptical dipole antenna for ultra-wideband EMC applications",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8393772/",
            "Abstract": "This paper presents a novel method for optimizing a planar elliptical dipole antenna for ultra-wideband EMC applications. The Invasive Weed optimization (IWO) method is used, which is a nature inspired metaheuristic evolutionary algorithm. The goal is to achieve maximum boresight realized gain and minimum reflection coefficient S11 across the frequency range of 1 GHz to 5 GHz.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Biological Effects of EMFs",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-06079-7_5",
            "Abstract": "People have always considered the exposure to non-ionising radiation with scepticism. The prospect that exposure to electromagnetic fields (EMF) can have a deleterious effect or any effect on cellular behaviour has been debated in scientific and journalistic circles for some years. The drive to determine whether EMFs were involved in cellular behavioural changes is critical since environmental proximity to high voltage power lines and electric stations or the routine use of household appliances and cellular phones is increasing exponentially. Support for a deleterious effect gained impetus with the report that children whose homes were close to power lines had a higher frequency of leukemia. If cell signalling is influenced by EMF exposure, it provides further impetus to determine whether EMF exposure can cause or alter the propensity to cancer or have other deleterious effects in cells. Numerous laboratory …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Adaptive beamforming with sidelobe suppression by placing extra radiation pattern nulls",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8668532/",
            "Abstract": "A new iterative adaptive beamforming (ABF) algorithm based on conventional beamformers is proposed in order not only to steer the main lobe toward the desired signal and place radiation pattern nulls toward respective interference signals but also to achieve the desired sidelobe level (SLL). Thus, the algorithm becomes less susceptible to unpredicted interference signals than conventional beamformers. In each iteration, the algorithm finds the direction of the peak of the greatest sidelobe, which is considered as direction of arrival (DoA) of a hypothetical interference signal, and the conventional beamformer is then employed to find proper antenna array weights that produce an extra null toward this direction. The iterative procedure stops when the desired SLL is obtained. The algorithm is applied on three conventional beamformers and is tested for various signal DoA, while the direction deviation of the main lobe …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sustainable masonry building-shell design of byzantine monuments in Greece for energy efficient constructions",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.564.7845&rep=rep1&type=pdf",
            "Abstract": "Conservation of historical buildings is important to societies that are eager to perpetuate the collective memory. These societies protect their cultural resources and preserve their heritage. To promote the use and preservation of historic buildings, attention must be paid when incorporating modern building service systems. These systems must be adapted to functional peculiarities and demands of the building elements. Winter heating and summer cooling of monumental building can be very demanding and energy consuming task. Consequently, the detailed calculation of their envelope is very important. Masonry buildings, tend to regulate the external temperature fluctuations they are subjected to, either by storing heat in their thermal mass or by offering it back to the interior, with a time lag depending on the thermal capacity of the building and characterized mainly by the overall mass of the masonry. This time lag may vary from a few hours when lightweight masonry is concerned to several days for masonry buildings of large mass. The scope of this work is to calculate the thermal capacity of Byzantine (334 œ 1453 AD) monuments in Greece and to show how their thermal capacity affects their internal temperature temporal profile. The analysis will be based on a typical 6th AD century Byzantine Church in Thessaloniki Greece, dedicated to the Holy Wisdom of God our Lord (Aghia Sophia).",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:-f6ydRqryjwC",
            "Publisher": "WSEAS Press"
        },
        {
            "Title": "Tracking of Maneuvering and Ballistic Targets with a Transmitter–Independent Receiver Network using Time Difference Of Arrival and a Second Order Recurrent Artificial Neural Network.",
            "Publication year": 2005,
            "Publication url": "http://www.wseas.us/e-library/conferences/2005athens/cscc/papers/497-270.pdf",
            "Abstract": "In this paper the time difference of arrival (TDOA) method is evaluated as a location and tracking method of maneuvering targets via measurements taken by totally passive multistatic radars (or transmitter–independent receiver networks–TIRN). For real time target detection a second order recurrent artificial neural network (ANN) is used. In order to examine the capabilities and limitations of such a system, simulation of several target trajectories are made proving that a system implementing ANN and TDOA can be constructed and exploited as a tracking radar with the obvious advantages of a passive system (no transmitted power) and relatively low gain antennas (of small dimensions thus easily portable or mobile).",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A semi-automated approach towards generating three-dimensional mesh of the heart using a hybrid MRI/histology database",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10255842.2010.481286",
            "Abstract": "Both the forward and inverse problems of electrocardiography rely on the precise modelling of the anatomic and electrical properties of the thoracic tissues. This, in turn, requires good knowledge of the electrical anisotropy as well as conductivity inhomogeneity of the heart, lungs and the rest of the thorax. Cardiac electrical anisotropy is related to its microstructure (fibre length, density and orientation). We hereby present detailed three-dimensional (3D) meshes of the thorax and heart, using image data from contiguous 2D magnetic resonance (MR) imaging slices as well as a realistic 3D cardiac fibre orientation model that derives its data from high-resolution ex vivo human heart MR images and from histology specimens of heart tissue. Using specific software, we integrated the 3D thorax and heart meshes in one that addresses the related modelling requirements for the solution of the forward and inverse problems …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:r0BpntZqJG4C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Seismo-ionospheric coupling correlation analysis of earthquakes in Greece, using empirical mode decomposition",
            "Publication year": 2009,
            "Publication url": "https://npg.copernicus.org/articles/16/123/2009/",
            "Abstract": " Ionospheric variability as a result of earthquake events is a confirmed phenomenon as published in various seismo-ionospheric coupling studies. Generally, ionospheric variations resulting from earthquake activity are much weaker than disturbances generated by different sources, e.g. geomagnetic storms. However, geomagnetic storm disturbances exhibit more global behaviour, whereas seismo-ionospheric variations occur only locally in an area that is specified by the magnitude of the earthquake. Cross-correlation coefficient analysis is a technique proposed some years ago, and ensures cancelation of geomagnetic storm variations of the ionospheric plasma, provided that the measurements are taken from stations with similar behaviour in these phenomena. In this paper we will use the aforementioned technique for analyzing data from ionospheric stations in Rome and Athens, and apply it to a series of earthquakes in Greece. Considering the local behaviour of the seismo-ionospheric variations, we expect that the Athens station, which happens to be inside the area affected by the earthquake, will accurately capture the disturbances. Due to its distance from the activity, we also do not expect the Rome station measurements to be affected by the seismic events in Greece. In addition, due to the fact that ionospheric plasma parameters exhibit non-stationary and nonlinear behaviour, we propose a novel signal processing technique known as the Hilbert-Huang transform in order to denoise the data before we calculate the cross-correlation coefficient of the two signals. Results from our analysis are in accordance with previously-conducted …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Copernicus GmbH"
        },
        {
            "Title": "Radar measurements with remote control software",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7551909/",
            "Abstract": "The great development of wireless communication technology has caused much concern about the possible adverse effects of electromagnetic field exposure on human health. A special type of such emissions is the rotating pulsed signals, such as civil aviation approach Radars, often situated close to residential areas. This paper describes a dedicated remote control software developed in order to automate the measurement procedures together with the evaluation of the relevant electromagnetic radiation. The great benefit of this software is that random errors caused by the personnel employed in the measurement procedure are avoided. The remote communication with the measurement system consists of a traditional spectrum analyzer (SA) and a rotating dipole antenna, whereas the post processing of the measurement data is done using two Graphical User Interfaces (GUI) developed in MATLAB. The setup of …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient hybrid parabolic equation–integral equation method for the analysis of wave propagation in highly complex indoor communication environments",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-007-9246-7.pdf",
            "Abstract": "An efficient, full-wave computational technique to investigate the electromagnetic wave propagation within a complex building environment, resulting from contemporary indoor communication systems, is proposed. Unlike a standard ray-tracing technique, this new methodology is based on the parabolic wave equation (PE), appropriately modified to deal with the extremely wide-angle propagation cases, encountered in a typical wireless system of this kind. It is also successfully applied to model the field in the presence of walls, doors or other penetrable structures, taking into account the exact geometric configuration of the environment under consideration. Next, the PE technique is significantly enhanced by an integral equation formulation, in which the computed field in the interior of the walls and other obstacles is used as a secondary equivalent current source and a corrected version of the …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Application of an Automated System for the Processing of VLF signals to Detect, Analyze and Classify Seismic-Ionospheric Precursor Phenomena",
            "Publication year": 2013,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2013EGUGA..15.4134S/abstract",
            "Abstract": "This paper studies the development and application of an automated system based on Predictive Modular Neural Networks (PREMONNs) and Self Organizing Maps (SOMs) along with the necessary backend development of database classification required to provide a fully integrated system for detecting disturbances that can be attributed to seismic-ionospheric precursor phenomena using VLF radio signals. The aforementioned system can analyze all the relevant data and bring forth and adaptively discriminate different characteristics in the received signals, in real time in order to provide data segments of interest that can be correlated to subsequent seismic phenomena and can be classified with respect to pre-recorded samples of previous points of interest (POIs). PREMONNs as it was demonstrated in previous studies can be used for time-series switching detection and can be applied to the detection of POIs …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ten years analysis of Tropospheric refractivity variations",
            "Publication year": 2004,
            "Publication url": "https://www.earth-prints.org/handle/2122/835",
            "Abstract": "The refractivity variations of the troposphere are responsible for various effects on radio wave propagation, such as refraction, bending, radio-station interference, etc. In this work, the refractivity variations of the Hellenic troposphere are studied using data from Helliniko airport of Athens/Greece. The data were analyzed using various interpolation procedures, i.e. in a day-by-day manner for temperature and relative humidity, to transform the data according to a reference height common for the whole dataset and finally for the refractivity N with respect to time, using piece-wise hermite interpolation polynomials for the low and medium altitudes and linear interpolation factors for the high altitudes. Since refractivity varies with time and height, two height independent basic parameters were computed and analyzed: the refractivity at station height N0 and scale height Hs. These parameters can be used to calculate the refractivity profile. Using statistical tools as the moving average, the ß0 parameter and the monthly mean values, together with the corresponding standard deviations, useful results were obtained for the variations of the refractivity with respect to observation hour, height, season, month, day and level.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "INGV"
        },
        {
            "Title": "TEC and foF2 variations: preliminary results",
            "Publication year": 2004,
            "Publication url": "https://www.earth-prints.org/handle/2122/834",
            "Abstract": "Investigation of the relationship between TEC and (foF2)2 shows that although they are highly correlated, a «hysteresis» effect exists between them. The slab thickness is greater before than after mid-day for equal cos ?values. Moreover, a comparison of the calculated upper and lower quartiles of variability in TEC, foF2 and Nmax, respectively shows that the variability of TEC lies between those of foF2 and Nmax depending on the level of solar activity.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:IjCSPb-OGe4C",
            "Publisher": "INGV"
        },
        {
            "Title": "IWO-based synthesis of log-periodic dipole array",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917752/",
            "Abstract": "The Invasive Weed Optimization (IWO) is an effective evolutionary and recently developed method. Due to its better performance in comparison to other well-known optimization methods, IWO has been chosen to solve many complex non-linear problems in telecommunications and electromagnetics. In the present study, the IWO is applied to optimize the geometry of a realistic log-periodic dipole array (LPDA) that operates in the frequency range 800-3300 MHz and therefore is suitable for signal reception from several RF services. The optimization is applied under specific requirements, concerning the standing wave ratio, the forward gain, the gain flatness and the side lobe level, over a wide frequency range. The optimization variables are the lengths and the radii of the dipoles, the distances between them, and the characteristic impedance of the transmission line that connects the dipoles. The optimized LPDA …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "One Heart, Two Bodies: A Simulation Study of Body Surface Potential Differences between Donor and Recipient of Heart Transplantation",
            "Publication year": 2009,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-58603-964-6-389",
            "Abstract": "In cardiac transplantation has been recognized some “abnormalities” in recipient ECG. We investigated the influence of heart geometrical position within the chest cavity as well as somatometric parameters on body surface torso potentials. Two control patients with different Body Mass Index (BMI) were undergone a chest MRI scan. Using specific software we created two tetrahedral meshes that could be applied in our study. A post-mortem human heart was undergone a MRI scan and we also created its tetrahedral mesh. Using second software we extracted the heart mesh of control's torsos and we replaced them with the mesh of the post-mortem heart. The last program also assessed the influence of heart (re) positioning within the thorax, on the body surface potentials. The Finite Elements Method (FEM) was used to solve the forward electrocardiographic problem for both torsos, under the assumption that all the …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:WF5omc3nYNoC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "FUZZY INTRINSIC MODE ENTROPY FOR DATA FEATURE EXTRACTION",
            "Publication year": 2012,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S1793536912500094",
            "Abstract": "The notion of fuzzy entropy (FuzzyEn) is extended to the multiscale case by combining FuzzyEn and empirical mode decomposition (EMD). The proposed technique, fuzzy intrinsic entropy (FIMEn) performs better than its predecessor intrinsic monde entropy (IMEn) and it is less dependent on the algorithmic parameters. In a pattern recognition context, FIMEn provides more separable clusters than IMEn when used for feature extraction, thus allowing for less classification error. The above results suggest that the proposed multiscale entropy metric is a very promising technique for evaluating data regularity and can be used effectively for feature extraction in pattern recognition problems.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:maZDTaKrznsC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Application of empirical mode decomposition to very low frequency signals for identification of seismic-ionospheric precursor phenomena",
            "Publication year": 2012,
            "Publication url": "https://www.annalsofgeophysics.eu/index.php/annals/article/view/5312",
            "Abstract": "This study investigates the application of empirical mode decomposition to signals from very low frequency transmitters in Europe that were received in Thessaloniki, Greece, to provide a method for depicting seismic-ionospheric precursor phenomena that occur prior to an earthquake. The basis for ionosphere interactions with seismic phenomena has been well documented in past studies, and the depiction of disturbances applied from the earthionosphere waveguide on the received signals was the purpose of this study. Empirical mode decomposition is a method for processing of nonlinear and nonstationary signals, to decompose them into their functional components, known as intrinsic mode functions. This method can provide high pass filtering to signals, thus depicting a clearer image of any abnormal disturbances in the signals that are not part of the normal noise content. Observations of such precursor phenomena are presented and correlated to earthquakes, to demonstrate the effectiveness of this method.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An effective modification of conventional beamforming methods suitable for realistic linear antenna arrays",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9036063/",
            "Abstract": "Antenna array beamforming (BF) refers to a real-time procedure that aims at calculating the proper feeding weights applied to the array elements in order to create a main lobe and a number of nulls toward respective preassigned directions. Most of the research performed on BF has been based on a simplified mathematical model, which ignores the nonisotropic radiation pattern of the array elements and the element mutual coupling. This article introduces an innovative way to incorporate the actual radiation pattern of the array elements and the element coupling into two popular deterministic BF methods, thus making these methods applicable to realistic antenna arrays. These two modified methods are applied in several scenarios, where a desired signal and several interference signals with various directions of arrival are received by a realistic microstrip linear antenna array. The statistical analysis performed in …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Signal denoising using empirical mode decomposition and higher order statistics",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/George-Tsolis-2/publication/228522183_Signal_Denoising_Using_Empirical_Mode_Decomposition_and_Higher_Order_Statistics/links/582c898d08ae102f072a0f24/Signal-Denoising-Using-Empirical-Mode-Decomposition-and-Higher-Order-Statistics.pdf",
            "Abstract": "A hybrid denoising method is presented as a combination of Empirical Mode Decomposition (EMD) and Higher Order Statistics (HOS). EMD, an adaptive data-driven method, is used for effective decomposition of a noisy signal into its functional components. Then Kurtosis and Bispectrum operate as Gaussianity estimators, supplemented by Bootstrap techniques, ensuring detection and removal of the signal’s Gaussian components. Thresholding techniques are used at the final step for maximum suppression of signal noise, where thresholds are set by estimating the long-term correlation of the corrupting colored noise in the form of the Hurst exponent. Experimental results prove the applicability of the method in signal denoising. Specifically, EMD-HOS outperforms similar denoising techniques based on Wavelets for the most types of test signals.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measurement, simulation and optimization of wideband log-periodic antennas",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8105240/",
            "Abstract": "Log-periodic antenna is a special antenna type utilized with great success in many broadband applications due to its ability to achieve nearly constant gain over a wide frequency range. Such antennas are extensively used in electromagnetic compatibility measurements, spectrum monitoring and TV reception. In this study, a log-periodic dipole array is measured, simulated, and then optimized in the 470-860 MHz frequency band. Two simulations of the antenna are initially performed in time and frequency domain respectively. The comparison between these simulations is presented to ensure accurate modelling of the antenna. The practically measured net gain is in good agreement with the simulated net gain. The antenna is then optimized to concurrently improve voltage standing wave ration, net gain and front-to-back ratio. The optimization process has been implemented by using various algorithms included in …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A social-oriented mobile cloud scheme for optimal energy conservation",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/chapter/a-social-oriented-mobile-cloud-scheme-for-optimal-energy-conservation/125963",
            "Abstract": "This chapter elaborates on energy usage optimization issues by exploiting a resource offloading process based on a social-oriented mobile cloud scheme. The adoption of the proposed scheme enables for increasing the reliability in services provision to the mobile users by guaranteeing sufficient resources for the mobile application execution. More specifically, this chapter describes the process to improve the energy consumption of the mobile devices through the exploitation of a social-oriented model and a cooperative partial process offloading scheme. This research approach exploits social centrality, as the connectivity model for the resource offloading, among the interconnected mobile devices to increase the energy usage efficiency, the mobile nodes availability, as well as the process of execution reliability. The proposed scheme is thoroughly evaluated to define the validity and the efficiency for the energy …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:dhFuZR0502QC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Discrete Time Integrator Comparison for an Angle of Arrival Neural Network Detector on a Transmitter–Independent Receiver Network",
            "Publication year": 2006,
            "Publication url": "http://www.wseas.us/e-library/conferences/2006cscc/papers/534-618.pdf",
            "Abstract": "A Recurrent First Order Artificial Neural Network may be used for target detection by Angle of Arrival on a Transmitter–Independent Receiver Network (multimode passive multistatic radar). In this paper a model of it is created and then simulation takes place in order to investigate the performance of various integration and accumulation methods. It is shown that construction simplicity that is essential to military systems is retained in this method in any case and the optimum integration method can be chosen.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Airborne video transmission for naval and coast guard applications",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.498.6018&rep=rep1&type=pdf",
            "Abstract": "In certain naval and coast guard security operations a video must be transmitted from an aerial platform–aircraft, helicopter, unmanned aerial vehicle or airship–to a surface station in real time. In this paper the radio channel characteristics and the antenna systems needed are examined in order to achieve a robust direct communication channel with enough bandwidth between the airborne vehicle and the base station. Simulation and experimental work has shown that for a reliable operation, diversity (spatial or frequency) techniques must be used in order to achieve the most reliable link between a moving and a stationary platform over any terrain, and any troposphere conditions.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparative study of the biological effects of various mobile phone wireless LAN antennas",
            "Publication year": 2002,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10330",
            "Abstract": "This paper presents a comprehensive electromagnetic and thermal analysis of radiation and its impact on human beings, due to the use of various types of commonly used mobile phones and communication antennas. This is one of the first studies that deals with a wide-range comparative investigation of modern cell phones, unlike the majority of existing work, which do not extend beyond the obsolete generic phone case. The rather severe, although overlooked, case of wireless local area network antennas is also considered, due to their increasing use and the large times of exposure associated with them. Index Terms Biological application of electromagnetic radiation, electromagnetic radiation effects, FDTD methods, mobile antennas",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Zaharias D. Zaharis, Pavlos I. Lazaridis, Christos Skeberis, George Mastorakis, Constandinos X. Mavromoustakis",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=P5HwCgAAQBAJ&oi=fnd&pg=PA21&dq=info:ftkXN7gCJ0gJ:scholar.google.com&ots=q9G738zj4Q&sig=Bsew5ajNAuPwNLEbA9yw5K_kVPI",
            "Abstract": "The design and optimization of wideband log-periodic dipole arrays (LPDAs) are presented in this chapter. The LPDAs are expected to simultaneously satisfy several requirements inside a wide operating frequency range. In particular, the optimized LPDA has to provide standing wave ratio (SWR) below a predefined value, gain values as high as possible, gain flatness (GF) below a desired value, both side lobe level (SLL) and front-to-back ratio (FBR) below a desired value, and all these requirements must be satisfied at the same time inside the entire frequency range of operation. Since the design problem is nonlinear and inherently multiobjective, the simultaneous realization of all the above requirements can only be achieved by applying global optimization algorithms. These algorithms are usually based on evolutionary optimization methods and have been proved to be capable of solving complex nonlinear problems with great success. Such an evolutionary method with high potential in antenna design is presented in this chapter. The method is called invasive weed optimization (IWO) and is applied in conjunction with the method of moments (MoM) to optimize LPDAs under the above-mentioned requirements. The MoM is a well-known full-wave analysis method and is utilized here to extract the radiation characteristics of the LPDA required by the IWO algorithm. Several design cases are studied concerning the LPDA geometry and the operating bandwidth. The derived LPDA geometries exhibit a behavior close to the desired one and therefore are able to enhance the performance of a wireless network in practical applications.2.1 …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:blknAaTinKkC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Optimal synthesis of feeding network for implementation of Dolph–Chebyshev current distribution on microstrip antenna arrays",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8753697/",
            "Abstract": "A microstrip feeding network (MFN) that implements a Dolph-Chebyshev (D-Ch) current distribution is designed to feed a microstrip antenna array (MAA) operating in B2 LTE band. The study consists of three phases. In the first phase, the elements of MAA are directly excited by equi-phase current sources complying with a D-Ch amplitude distribution to ensure a sidelobe level (SLL) of -20 dB. Then, MAA is optimized for maximum forward gain. Finally, the input impedances of the elements of the optimized MAA and the element spacing are recorded. In the second phase, the MFN is considered to terminate at lumped loads with values equal to the input impedances of the respective elements of the optimized MAA and is then optimized to achieve low standing wave ratio, high power efficiency, and output currents equal to those applied in the first phase by the current sources. All optimizations are performed with an …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "First order discrete integrators for an angle of arrival neural network target detector on a passive multistatic radar.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=15445620778198574759&hl=en&oi=scholarr",
            "Abstract": "A Recurrent First Order Artificial Neural Network maybe used for target detection by Angle ofArrival on a Transmitter - Independent Receiver Network (TIRN, multimode passive multistaticradar). In this paper a model of a TIRN is created and then simulation takes placein order to investigate the performance of various integration methods. In order to retain construction simplicity that is essential to military systems, only first order methods are studied. In any case and the optimumintegration method can be chosen. Careful design though is needed because not all the discrete integration methods are applicable.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-thermal microwave effects on chicken foetuses during organogenesis",
            "Publication year": 2003,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/jhvms/article/view/15215",
            "Abstract": "The purpose of this work is το investigate possible effects of pulse-modulated (PW) and non-modulated (CW) low power density microwave radiation on chicken foetuses during organogenesis. A total of 496 fertilised chicken eggs were used in this study; 380 of diem as experimental material and 116 as controls. The experimental eggs were exposed to a non-thermal power density of 8.8 uW/cm2 (SAR= 1.16 mW/Kg) radiation at 9.152 GHz, from the 3rd to the 10th day of incubation, continuously. 172 eggs were irradiated by CW whereas 208 eggs by PW. The controls were sham-exposed. The foetuses of the experimental eggs and of the controls were macro-and microscopically examined at the end of their incubation. In 62.78% of CW-irradiated, 47.12% of PWirradiated and only in 3.44% of the sham-exposed fetuses abnormalities (development retardation and severe malformations) and embryonic and foetal deaths (embryonic and foetal) were observed. The differences in the effects caused by CW and PW irradiation were statistically evaluated. These results support the aspect that very low power density microwaves applied to the chicken foetuses, in ovo during organogenesis, may cause abnormal development.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A design of elliptical edge-fed circularly polarized patch antenna for GPS and Iridium applications",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8471443/",
            "Abstract": "This study presents a design of an elliptical edge-fed circularly polarized patch antenna to facilitate GPS and Iridium dual-band satellite applications like Search and Rescue (SAR) operations. The simulation of the antenna was performed in CST simulation software in the frequency range of 1.3 GHz - 2 GHz. The proposed antenna provides good matching with low S11 in the dual-band: GPS (1.563 GHz - 1.587 GHz) and Iridium (1.616 GHz - 1.6265 GHz). Additionally, the simulated realized gain and axial ratio are in compliance with the required specifications. This design provides a cost-efficient and compact solution for the required dual-band application.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the spatial averaging of multiple narrowband electromagnetic field measurements: Methods and uncertainty estimation",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5280271/",
            "Abstract": "Methods of computational prediction can be used or specific measurements have to be performed for the estimation of human exposure to nonionizing electromagnetic fields at a certain place. According to the exposure standards, the predicted or the measured values have to be spatially averaged in an area representing the dimensions of the human body and compared with the adopted maximum permissible levels of exposure. In this paper, methods for spatial averaging nonionizing electromagnetic fields are discussed. Moreover, methods for estimating spatial average uncertainty of the total field strength values and of the summation of exposure quotients when narrowband measurements are performed in a multiple-frequency environment are proposed. Furthermore, since maximum field values have to be averaged according to the most widely accepted exposure standards, the traffic-dependent power level …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ZAM distribution analysis of radiowave ionospheric propagation interference measurements",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917753/",
            "Abstract": "This work investigates the occurrence of radiowave propagation disturbances across a wide range of VLF and LF frequencies received prior to a seismic event (Mw=4), that took place on May 12th 2012, the epicenter of which was very close (14Km) to the receiver. The signals analysed were from 4 VLF and 6 LF European transmitters. This seismic event produced precursory ionospheric disturbances, identified as spectral distortion, before its occurrence, providing a distinct pattern. Although the basis of the ionosphere interaction with seismic phenomena has been well documented in previous studies, the close proximity of the receiver to the seismic event provides a new perspective to this study. The received signals have undergone normalisation and then they have been processed by the application of the Zhao-Atlas-Marks Distribution (ZAMD). Diagrams of the signals relevant to the phenomena are presented …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A qualitative study of the seismo-ionospheric precursors prior to the 6 April 2009 earthquake in L'Aquila, Italy",
            "Publication year": 2010,
            "Publication url": "https://nhess.copernicus.org/articles/10/133/2010/",
            "Abstract": " In this paper we use the Cross Correlation analysis method in conjunction with the Empirical Mode Decomposition to analyze foF2 signals collected from Rome, Athens and San Vito ionospheric stations, in order to verify the existence of seismo-ionospheric precursors prior to M=6.3 L'Aquila earthquake in Italy. The adaptive nature of EMD allows for removing the geophysical noise from the foF2 signals, and then to calculate the correlation coefficient between them. According to the cross correlation coefficient theory, we expect the stations which located inside the earthquake preparation area, as evaluated using Dobrovolsky equation, to capture the ionospheric disturbances generated by the seismic event. On the other hand the stations outside of this area are expected to remain unaffected. The results of our study are in accordance with the theoretical model, evidencing ionospheric modification prior to L'Aquila earthquake in a certain area around the epicenter. However, it was found that the selection of stations at the limits of the theoretically estimated earthquake preparation area is not the best choice when the cross correlation method is applied, since the modification of the ionosphere over these stations may not be enough for the ionospheric precursors to appear. Our experimental results also show that when a seismic event constitutes the main shock after a series of pre-seismic activity, precursors may appear as early as 22 days prior to the event.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Copernicus GmbH"
        },
        {
            "Title": "Full-Wave Analysis of Indoor Communication Problems, based on a Parabolic Equation–Finite Element Technique",
            "Publication year": 2005,
            "Publication url": "http://www.wseas.us/e-library/conferences/2005athens/cscc/papers/497-385.pdf",
            "Abstract": "This paper presents a new methodology to compute the electromagnetic field in practical cases of indoor communications. In particular, we consider the highly interesting case of the so-called interface modeling, ie when a plane wave propagates to the interior of a building. The proposed technique is based on a parabolic wave equation in three dimensions, while the cross section of the computational domain, as the wave propagates, is modeled by means of a finite element technique, terminated by highly absorbing PML boundaries. This formulation enables a robust computational modeling of obstacles of complex shape in a fully automated way. Unlike standard ray-tracing techniques, the proposed scheme makes it possible to solve a series of complex geometries and structures that would require vast computational resources with existing approaches.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Near optimal synthesis of exponential log-periodic dipole array geometry by applying invasive weed optimization",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7551911/",
            "Abstract": "A new geometry of log-periodic dipole array (LPDA) is presented in this work. Unlike the traditional LPDA geometry, where all dipoles are considered to be inside the same angular sector, the proposed LPDA adopts an exponential geometry, described by two parameters called exponential scale factor and exponential relative spacing. By properly adjusting these two parameters, the exponential LPDA (ELPDA) geometry obtains wideband behavior with excellent radiation characteristics. A near optimal ELPDA geometry that achieves the desired radiation characteristics inside the required bandwidth is found in the present work by applying a recently developed method called invasive weed optimization (IWO). In particular, the ELPDA is required to operate in the 800-3300MHz frequency range under specific constraints concerning standing wave ratio, forward gain, gain flatness, front-to-back ratio and side lobe …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of the Hilbert-Huang transform application for the recognition of seismic precursory phenomena by the analysis of VLF transmission signals of the European Network.",
            "Publication year": 2013,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2013thmc.book..288S/abstract",
            "Abstract": "In this paper the authors evaluate the suitability of the Hilber-Huang transformation (Empirical Mode Decomposition) in the recognition of seismic precursory phenomena from the analysis of signals which are transmitted by European station in the VLF frequency band. So, the results of the measurements and analysis of the received signals for the time periods of the earthquake occurrence in the area of Greece and the effectiveness of the method is being discussed.(in Greeks)",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of a partial transmitter contribution to the total electromagnetic field exposure, in a multi-transmitter environment.",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=9775218902390161589&hl=en&oi=scholarr",
            "Abstract": "The equipment used for radiation hazard evaluation usually is based in measuring the total electric field strength over a frequency bandwidth of interest. However, because of the fact that the defined Reference Levels (RL) according to the ICNIRP Guidelines or other specific legislation are frequency dependent, the compliance of a particular RF or microwave transmitter and its contribution to the total received electromagnetic energy at a given measurement location is not easily identifiable. On the other hand, narrowband measurements can be used to determine the incident electric field from every single transmitter. However, in such a case, a large number of measurements are required in order to estimate its contribution to the total electric field strength and consequently to check for compliance with the legislation limits, due to the fact that directional antennas should be used. In this work a method is presented for …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Low power density RF radiation effects on experimental animal embryos and foetuses",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=14786901759854408519&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Anti-jamming transmitter independent radar networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4447202/",
            "Abstract": "A transmitter independent receiver network (TIRN) is a network of radar receivers that operates in an area without cooperating with a particular radar transmitter, but rather using transmitters of opportunity (TOA) in order to detect and track airborne, ballistic or surface targets. In this paper a brief vulnerability analysis is given in both the detection/tracking and the communication subsystems of such a network. Electronic Defense (ED) solutions and interference avoidance techniques are given. A TIRN is mostly based in silent (low emission) operation and redundancy techniques. It is briefly described in the introduction. In the following paragraphs dealing with jamming techniques and is discussed, for both the detection and communication subsystems, comparing the results with the classic radar equivalent where applicable. It is finally concluded that such a network less vulnerable than conventional radars in most …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Noise reduction for accurate power measurements of low level signals",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917754/",
            "Abstract": "As a result of the rapid evolution of mobile communications in the last decade many propagation models have been developed for radio planning purposes. To verify the various propagation models, accurate measurements of the received signals have to be performed especially at the edges of mobile communication cells, where the received power is at very low level and signal to noise ratio is degraded. In these cases narrowband receivers such as spectrum analyzers have to be employed. The settings of the receivers have to be examined carefully, since they are of crucial importance, in order to discriminate the measured signals from the noise. On the other hand, noise has to be removed from the measurements and uncertainty has to be estimated correctly; thus the “clean” levels will be suitable for verifying the propagation models and optimize the radio planning. In this paper a method of noise reduction for …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bone morphogenetic protein expression in newborn rat kidneys after prenatal exposure to radiofrequency radiation",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/bem.10185",
            "Abstract": "Effects of nonthermal radiofrequency radiation (RFR) of the global system of mobile communication (GSM) cellular phones have been as yet mostly studied at the molecular level in the context of cellular stress and proliferation, as well as neurotransmitter production and localization. In this study, a simulation model was designed for the exposure of pregnant rats to pulsed GSM‐like RFR (9.4 GHz), based on the different resonant frequencies of man and rat. The power density applied was 5 μW/cm2, in order to avoid thermal electromagnetic effects as much as possible. Pregnant rats were exposed to RFR during days 1–3 postcoitum (p.c.) (embryogenesis, pre‐implantation) and days 4–7 p.c. (early organogenesis, peri‐implantation). Relative expression and localization of bone morphogenetic proteins (BMP) and their receptors (BMPR), members of a molecular family currently considered as major endocrine and …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Analysis of Groove Ball Bearings’ Vibration Signals by Hilbert–Huang Transform as Diagnostic Tool",
            "Publication year": 2012,
            "Publication url": "http://ikee.lib.auth.gr/record/276036?ln=el",
            "Abstract": "Roller bearings are important elements of high performance mechanical systems, as they support the rotating parts and they reduce the contact friction. Therefore, it is necessary to continuously monitor their performance using non-destructive diagnostic methods. These methods interrogate data signals acquired during the machines operation. In this paper, the method of Hilbert–Huang transform was applied on non-stationary and non-linear vibration signals obtained via accelerometers from a mechanical system which contains a shaft rotating on Roller bearings. Two series of signals were used. The first series obtained from healthy bearings. The second series, obtained from bearings with seeded defects. The experimental study and its results are presented, as well as the conclusions drawn from the results.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:738O_yMBCRsC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "The European Network for studying the radio precursors of earthquakes: Principal Component Analysis of LF radio signals collected during July 2009-April 2011",
            "Publication year": 2012,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2012EGUGA..14.1601M/abstract",
            "Abstract": "Since 2009 a network of VLF (20-60 kHz) and LF (150-300 kHz) radio receivers was put into operation in Europe in order to study the disturbances produced by the earthquakes on the propagation of these signals. In 2011 the network for LF signals was formed by six receivers located two in Italy and one in Greece, Portugal, Romania, and Turkey. The LF radio data collected during about two years have been analysed. Each radio signal has been split in day-time and night-time data; then, the earthquakes with M≥ 5.0, occurred in the same period, located in a 300 km radius around each receiver/transmitter and within the 5th Fresnel zone related to each transmitter-receiver path, have been selected. In this study we adopt the Principal Component Analysis (PCA) to study the radio signal anomalies possibly related to earthquake activity. A detailed comparison with similar studies that use wavelet analysis is done …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal Fractal Antenna for In-Vehicle Entertainment Application",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9198719/",
            "Abstract": "A wideband microstrip fractal antenna is presented in this study for satellite reception for in-vehicle entertainment (IVE) application. The antenna geometry is composed of circular structures that follow a logarithmic decrement rule as they cover the entirety of the board. The antenna is modelled and simulated in CST microwave studio environment and optimized with a modified particle swarm optimization algorithm which induces mutation to the previous velocity of particles that did not improve their fitness value in the previous iteration. The optimization goals are low S 11  and high forward gain in the 11.7–12.7 GHz band which covers the broadcasting-satellite service downlink frequencies. The dimensions of the optimized fractal antenna are small enough for IVE use.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electromagnetic absorption, reflection and interference shielding in X-band frequency range of low cost ceramic building bricks and sandwich type ceramic tiles using mill scale waste as an admixture",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0272884211005505",
            "Abstract": "General concern for potential health effects of 24 h electromagnetic fields (EMF) exposure has increased over the recent years. This has led to the necessity of developing low cost electromagnetic interference (EMI) shielding and especially absorbing building materials. In the present study the utilization of steel mill scale waste in ceramic bricks for this purpose was investigated, while the development of an improved, regarding mainly absorption performance, building material also occurred. Both ceramic bricks and sandwich type ceramic tiles were found to have good shielding efficiency and absorption performances in the same X-band frequency range (8–12 GHz) while technological and environmental requirements as building materials were also established.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Evaluation of disturbances detected on a VLF/LF receiver inside the preparation zone of a sequence of earthquakes.",
            "Publication year": 2017,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2017EGUGA..19.2961S/abstract",
            "Abstract": "This work investigates the occurrence of disturbances received prior and during a sequence of 6 earthquakes that took place during November 2016 (08-11-2017, mb= 4.1, 10-11-2017, mb= 4.8, 11-11-2017, ML= 3.7, 16-11-2017, ML= 4.2, 18-11-2017, mb= 4.9, 30-11-2017, ML= 4) with depths less than 8Km and epicenters around 5km from each other in Thessaloniki, Greece, and more importantly 30Km from a VLF/LF receiver, well inside the preparation zone, according to Dobrovolsky's equation. For the purpose of this paper, data acquired in Thessaloniki, Greece (40.59 N, 22, 78E) from ten VLF and LF transmitters around Europe are processed. Data from other receivers in the network are also assessed to establish comparative analysis and study the differences between the received disturbances of the same phenomenon from a receiver in close proximity to the events and another receiver away from the …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "One day before foF2 neural network based prediction models: A performance comparison between ordinary, fuzzy and recurrent neural networks",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=1802050060125511771&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A combined computational and experimental investigation of nonthermal biological effects on prenatal development due to radiation from low power microwave antennas",
            "Publication year": 2015,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10342",
            "Abstract": "This is an integrated study of the biological effects of pulse-modulated very low power density microwave radiation. It employs a combination of a computational model of the rat and extensive in vivo experiments on rat embryos, during embryogenesis and organogenesis. The whole investigation is further enhanced via an immunological and chemical investigation of the rats' organs. The whole study is one of the first to combine results obtained by the computational, the experimental and the biomolecular investigations and attempts a discussion on existing standards for protection from low power density, long-term electromagnetic field exposure.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time–frequency analysis of VLF for seismic-ionospheric precursor detection: Evaluation of Zhao-Atlas-Marks and Hilbert-Huang Transforms",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474706515000170",
            "Abstract": "This work investigates the application of two post-processing methods of extracting spectra from VLF signals in order to detect disturbances that could be attributed to seismic-ionospheric precursory phenomena. Although precursory phenomena have been investigated in detail in past studies, a different application of time–frequency analysis methods may produce distinct patterns, which reveal disturbances in the VLF spectra received from stations that are in the propagation path over preparation zones, and also pinpoint disturbances that could be attributed to seismic-ionospheric precursors.To this purpose, three different methods of post processing are compared. These are the Wavelet Transform as a benchmark method in the form of the Continuous Wavelet Transform, a noise-assisted variant of the Hilbert-Huang Transform and the Zhao-Atlas-Marks Distribution. Comparative diagrams are presented and the …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Measuring non-ionizing electromagnetic fields from a specific direction",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.457.9482&rep=rep1&type=pdf",
            "Abstract": "The apparatus used for broadband radiation hazard evaluation usually measures and displays the total electric field strength (RMS value) over a frequency bandwidth. However, given that the reference levels (RL), according to the ICNIRP Guidelines or other specific legislations, are frequency dependent, the compliance of a particular RF or microwave transmitter and its contribution to the total received electromagnetic energy at a given measurement location it is not easily identifiable. On the other hand, narrowband measurements using appropriate antennas and spectrum analyzers, make determinable the power level from every single transmitter. However, in this case, and given that the antennas used are directional and linearly polarized, a large number of measurements has to be taken in order to obtain the total electric field strength and consequently to check for compliance with the legislation limits. In this work a method is presented for determining: the total electric field from a particular direction to a specific point of a measurement location (eg from a mobile base station mast), the angle of maximum incident electric field and the total exposure quotient from the sources laying at that particular direction in a given frequency band.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An integrated computational and experimental approach oflow power microwave pulse-modulated nonthermal biological effects on prenatal development.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=2772461634086519764&hl=en&oi=scholarr",
            "Abstract": "An integrated study of pulse-modulated very low power density microwave radiation biological effects is presented. It employs a combination of a computational model of the rat and extensive in vivo experiments on rat embryos, during embryogenesis and organogenesis. The whole investigation is further enhanced via an immunological and histochemical investigation of the rats' organs. A simulation concerning similar conditions of exposure for human beings has been also performed, based on a realisticcase of a far field GSM-like base station environment. Hence, an attempt is performed to project the results to a human-oriented case, under conditions of continuous exposure. The whole study is one of the first to combine results obtained by the computational, the experimental and the biomolecular investigations, and attempts a discussion on existing standards for protection from low power density, long-term …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal LTE-protected LPDA design for DVB-T reception using particle swarm optimization with velocity mutation",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8370114/",
            "Abstract": "A near-optimal design of a log-periodic dipole array (LPDA), suitable for digital video broadcasting-terrestrial (DVB-T) reception (470-790 MHz), is presented. The LPDA is required to provide low standing wave ratio as well as high-gain radiation pattern with sufficient gain flatness over the entire passband, and concurrently achieve low gain for frequencies above 800 MHz to reject LTE800 signals and thus improve the reception quality in the DVB-T band. All the above requirements are better satisfied by applying a novel particle swarm optimization (PSO) variant, called PSO with velocity mutation (PSOvm). PSOvm induces mutation on the velocities of those particles, which are unable to improve their fitness. As shown in this paper, PSOvm comes closer to the above requirements compared to four well-known optimization methods and outperforms the traditional LPDA design method proposed by Carrel. The LPDA …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Random feed errors in phased array antennas.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=4769963317313973864&hl=en&oi=scholarr",
            "Abstract": "In many cases accuracy of construction plays a significant role in antenna performance. In this paper an error analysis is studied, and it can be shown that tolerances can be accepted insome cases, making the antenna manufacturers business easier. The tolerances studied here, is random signal amplitude and random phase applied on antenna element feeds. A Gaussian distribution is considered most probable for amplitude errors while uniform andGaussian distributions are examined for phase errors. Combined cases are examined also for both amplitude and phase errors. In the first part (Introduction) the characteristics of a phasedarray are briefly analyzed. In part 2 amplitude error analyses are given alongside simulation results. In part 3 and 4 the same is done for phase errors (Gaussian and uniformdistribution). In parts 5 and 6 combined Gaussian-Uniform and Gaussian-Gaussian distributions for both …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparative study of the biological effects of various mobile phone and wireless LAN antennas",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/996201/",
            "Abstract": "This paper presents a comprehensive electromagnetic and thermal analysis of radiation and its impact on human beings, due to the use of various types of commonly used mobile phones and communication antennas. This is one of the first studies that deals with a wide-range comparative investigation of modern cell phones, unlike the majority of existing work, which do not extend beyond the obsolete generic phone case. The rather severe, although overlooked, case of wireless local area network antennas is also considered, due to their increasing use and the large times of exposure associated with them.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Novel non-linear processing methods of VLF signals for seismic-ionospheric precursor detection: Evaluation of Zhao-Atlas-Marks and Hilbert-Huang Transforms",
            "Publication year": 2014,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2014EGUGA..16.1909S/abstract",
            "Abstract": "This study investigates the application of three different methods of extracting spectra from VLF signals in order to detect disturbances that can be attributed to seismic-ionospheric precursor phenomena. The methods tested here are the Wavelet Transform (WT) as a benchmark method, the Hilbert-Huang Transform (HHT) and the application of Zhao-Atlas-Marks (ZAM) Distribution, which is a quadratic representation, to process the signals in question. For the purpose of this paper, data acquired in Thessaloniki (40.59 N, 22, 78E) from the VLF station in Tavolara, Italy (ICV station Lat 40.923, Lon. 9.731) for over three years (December 2010-December 2013) are used. The receiver was developed by Elettronika Srl and is part of the International Network for Frontier Research on Earthquake Precursors (INFREP). A normalization of the received VLF signals is applied prior to their analysis. The efficacy of the processing …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of disturbances detected on a VLF/LF receiver of earthquakes with similar characteristics in different points in time.",
            "Publication year": 2018,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2018EGUGA..20.4176S/abstract",
            "Abstract": "This work investigates disturbances received prior to the occurrence of 2 earthquakes that took place during November 2016 (10-11-2016, mb= 4.8, 18-11-2016, mb= 4.9, with depths 8km) and compares them with 2 similar earthquakes that took place in December 2017 and January 2018 (31-12-2017, mb= 5, 02-01-2018, mb= 5.1 with depths 5km) and epicenters around 20km from each other, in Thessaloniki, Greece. The occurrence of two distinct and separate seismic events that both took place 30km to 50km from a VLF/LF receiver, well inside the preparation zone, according to Dobrovolsky's equation, has provided a valuable opportunity to firstly be able to evaluate and demonstrate the repeatable and thus objective nature of the precursors, in two different earthquakes, with similar characteristics and secondly to evaluate the method that has been developed, to process and analyze the precursors as they are …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hybrid parabolic equation—Integral equation technique for wave propagation modeling of indoor communications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4787475/",
            "Abstract": "We present a 3D hybrid technique for the simulation of wave propagation in complex indoor communication environments. The hybrid method employs a wide-angle parabolic equation to estimate the electromagnetic field within walls and obstacles, whereas a correction based on a Green's function approach provides clearly improved field approximations. The proposed method is applied in 3D using simple validation models, whereas an approximate 2D analysis is attempted for a much more realistic office space. The simulation is compared with measurements and a particularly enhanced accuracy is observed. The hybrid technique is more systematic and automated, compared to ray-tracing methods and has moderate computational requirements.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instrumentation for and Measurement in Communication-On the Spatial Averaging of Multiple Narrowband Electromagnetic Field Measurements: Methods and Uncertainty Estimation",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=7612478008888653391&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On–Line Tracking of Manoeuvring and Ballistic Targets via Angle of Arrival and Doppler Measurements Taken by a Transmitter–Independent Receiver Network Using First Order Recurrent Linear Neural Networks.",
            "Publication year": 2005,
            "Publication url": "http://www.wseas.us/e-library/conferences/2005athens/cscc/papers/497-355.pdf",
            "Abstract": "A totally passive multistatic radar or Transmitter-Independent Receiver Network (TIRN)[1], can be defined as a number of independent bistatic receivers [2], connected to a communication network, in order to detect and track targets in their coverage area using the signal (s) of non-cooperative transmitter (s). In this paper, an Angle of Arrival (AOA) method of transmitter and target detection is investigated. Linear systems of equations are extracted, and then solved by recurrent Artificial Neural Networks (ANN) for detection and tracking of moving and ballistic targets. These linear systems are often over determined by using a redundant number of receivers in order to achieve a minimal false alarm probability and increase the survivability of the TIRN. Finally it is shown that practical ANN designs are attractive and simple solutions for an AOA based TIRN for moving target tracking purposes, combining fast and robust convergence, ease of design and construction and–in case of adequate redundancy–adequate survivability",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Seismic risk analysis of electric power transmission systems",
            "Publication year": 2007,
            "Publication url": "http://ikee.lib.auth.gr/record/228168/files/xenos.pdf",
            "Abstract": "The paper presents a methodology for the seismic risk assessment of electric power transmission systems. The vulnerability assessment and losses of functionality of the electric power components are evaluated using an innovative approach based on the use of neural networks. Networks’ stability and results’ validity depend on the availability of actual data for the elements exposed to strong seismic excitation. Reliable and accurate prediction of the substations seismic performance can be attained through a non-linear approach, provided that a significant amount of input data for the training procedure exists. Comparison with conventional methods using fragility curves is promising.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Taylor & Francis. London"
        },
        {
            "Title": "A multiple receiver-multiple transmitter VLF high-order differential analysis evaluation network for near real-time detection and discrimination of seismic-ionospheric precursor phenomena",
            "Publication year": 2016,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2016EGUGA..18.2828S/abstract",
            "Abstract": "This study provides an evaluation of the application of high-order differential analysis on VLF signals on a multiple-receiver multiple-transmitter network. This application provides a method for near-real-time detection of disturbances that can be attributed to seismic-ionospheric precursor phenomena and can discriminate disturbances that could be classified as false positives and thus should be attributed to other geomagnetic influences. VLF data acquired in Thessaloniki, Greece (40.59 N, 22, 78E) Herakleion, Greece (35.31 N, 25.10 E), Nicosia, Cyprus (35.17 N, 33.35 E), Italy (42.42 N, 13.08 E) and transmitted by the VLF station in Tavolara, Italy (ICV station 40.923 N, 9.731 E) and the station in Keflavik, Iceland (ICE 64.02 N, 22.57 W) from January 2015 to January 2016 were used for the purpose of this paper. The receivers have been developed by Elettronika Srl and are part of the International Network for …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improved antenna array adaptive beamforming with low side lobe level using a novel adaptive invasive weed optimization method",
            "Publication year": 2012,
            "Publication url": "https://www.jpier.org/PIER/pier.php?paper=11120202",
            "Abstract": "An improved adaptive beamforming technique of antenna arrays is introduced. The technique is implemented by using a novel Invasive Weed Optimization (IWO) variant called Adaptive Dispersion Invasive Weed Optimization (ADIWO) where the seeds produced by a weed are dispersed in the search space with standard deviation specified by the fitness value of the weed. The adaptive seed dispersion makes the ADIWO converge faster than the conventional IWO. This behavior is verified by applying both the ADIWO and the conventional IWO on well-known test functions. The ADIWO method is utilized here as an adaptive beamformer that makes a uniform linear antenna array steer the main lobe towards the direction of arrival (DoA) of a desired signal, form nulls towards the respective DoA of several interference signals and achieve low side lobe level (SLL). The proposed ADIWO based beamformer is compared …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:0EnyYjriUFMC",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "Electromagnetic exposure compliance estimation using narrowband directional measurements",
            "Publication year": 2008,
            "Publication url": "https://academic.oup.com/rpd/article-abstract/130/3/331/1599895",
            "Abstract": "The increased number of everyday applications that rely on wireless communication has drawn an attention to several concerns on the adverse health effects that prolonged or even short time exposure might have on humans. International organisations and countries have adopted guides and legislation for the public safety. They include reference levels (RLs) regarding field strength electromagnetic quantities. To check for RLs compliance in an environment with multiple transmitters of various types, analytical simulation models may be implemented provided that all the necessary information are available. Since this is not generally the case in the most practical situations, on-site measurements have to be performed. The necessary equipment for measurements of this type usually includes broadband field metres suitable to measure the field strength over the whole bandwidth of the field sensor used. These …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Ionospheric radio wave propagation finite element method modeling",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1007/s00202-003-0176-4",
            "Abstract": "In this work, a transionospheric propagation model is presented. The application analyzed here uses data from the Rome ionospheric station together with data from the theoretical IRI-95 and MSIS-E-90 models, in order to simulate the ionosphere. Using formulas from ionospheric propagation theory, these data form the wave equation, which is solved by means of the finite element method. Post-processing of the solution leads to the determination of the main wave propagation parameters.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "The European Network for studying the radio precursors of earthquakes: the case of the May 19, 2011 Turkey earthquake (Mw= 5.7)",
            "Publication year": 2012,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2012EGUGA..14..141B/abstract",
            "Abstract": "Since 2009 a network of VLF (20-60 kHz) and LF (150-300 kHz) radio receivers was put into operation in Europe in order to study the disturbances produced by the earthquakes on the propagation of these signals. In 2011 the network was formed by nine receivers located three in Italy and one in Austria, Greece, Portugal, Romania, Russia and Turkey. On May 19, 2001 an earthquake with Mw= 5.7 occurred in western Turkey, that is inside the\" sensitive\" area of the network. The radio data collected during April-May 2011 were studied using three different methods of analysis which are the wavelet spectra, the principal component technique and the standard deviation trends. Clear anomalies were revealed both in the signals broadcasted by the TRT transmitter (180 kHz) located near Ankara and in some VLF signals coming from transmitters located in western Europe and collected by the receiver TUR of the …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectral Methods Assessment in Journal Bearing Fault Detection Applications",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=17463452215022278149&hl=en&oi=scholarr",
            "Abstract": "The scope of this work is to assess three spectral methods employed in journal bearing fault detection. To this end, two popular methods namely the Short Time Fourier Transform (STFT) and the Wavelet Transform and an innovative and very promising method, namely the Hilbert–Huang transform, were employed. Five experimentations were carried out employing five pairs of journal bearings. Vibration time series, measured by an accelerometer assembled on the base of the bearing, were obtained. The time series were processed by means of Fourier transform, wavelet transform and the Hilbert–Huang transform and the resulting spectra of each pair of bearings, sound and defective, were examined for possible differences. Both the Fourier Transform and the wavelet transform analysis did not reveal any differences between the spectra corresponding to sound and defective bearings. On the contrary, the analysis …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parabolic equation solution of tropospheric wave propagation using FEM",
            "Publication year": 2004,
            "Publication url": "https://www.jpier.org/PIER/pier.php?paper=0404271",
            "Abstract": "In this work, the parabolic equation applied on radiowave and microwave tropospheric propagation, properly manipulated, and resulting in a one-dimensional form, is solved using the Finite Element Method (FEM). The necessary vertical tropospheric profile characteristics are assigned to each mesh element, while the solution advances in small and constant range segments, each excited by the solution of the previous step. This is leading to a marching algorithm, similar to the widely used Split Step formulation. The surface boundary conditions including the wave polarization and surface conductivity properties are directly applied to the FEM system of equations. Since the FEM system returns the total solution, a technique for the separation of the transmitted and reflected waves is also presented. This method is based on the application of the Discrete Fourier Transform (DFT) in the space domain, which allows for …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:5nxA0vEk-isC",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "A Novel Methodology to Detect Non-Linear Signal Distortions Due to External Impulse Stimulations in Ball Bearing Fault Detection Setup",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Zaharias-Zaharis/publication/276409352_A_novel_methodology_to_detect_non-linear_signal_distortions_due_to_external_impulse_stimulations_in_ball_bearing_fault_detection_setup/links/5630d10308aedf2d42beedaf/A-novel-methodology-to-detect-non-linear-signal-distortions-due-to-external-impulse-stimulations-in-ball-bearing-fault-detection-setup.pdf",
            "Abstract": "Machinery diagnostics is an important research area that requires inter-disciplinary expertise. Typically, machines operate in complicated, uncertain and varying environments. A good diagnostic methodology is expected to work accurately in such tough conditions. Early and accurate fault diagnosis of rolling element bearings is very important for improving mechanical system reliability and performance. Signals, even from experimental setups, let alone from industrial machinery monitoring and control, can be interfered by environmental noise. A worst-case condition is impulsive noise, caused by external stimulations, eg hydraulic hummers; it can cause very strong and complicated interferences and it can lead to erroneous conclusion concerning the performance of the ball bearing. On the other hand, avoiding external stimulations by employing optimized machinery mounting, although vital, is not always possible in an industrial environment. The aim of this project is to analyze and assess the mounting of the experimental device in order to estimate non-linear signal distortions due to external impulse stimulations. Therefore, two signal processing methods are employed, the Zhao Atlas Marks time-frequency Distribution (ZAMD) and the Hilbert Huang transform (HHT) in order to analyze non-stationary signals obtained from a ball bearing testing setup. Comparative results are provided by applying the two methods on vibration signals derived by the testing setup under an external stimulation.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparison of evolutionary algorithms for LPDA antenna optimization",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7773840/",
            "Abstract": "A novel approach to broadband log-periodic antenna design is presented, where some of the most powerful evolutionary algorithms are applied and compared for the optimal design of wire log-periodic dipole arrays (LPDA) using Numerical Electromagnetics Code. The target is to achieve an optimal antenna design with respect to maximum gain, gain flatness, front-to-rear ratio (F/R) and standing wave ratio. The parameters of the LPDA optimized are the dipole lengths, the spacing between the dipoles, and the dipole wire diameters. The evolutionary algorithms compared are the Differential Evolution (DE), Particle Swarm (PSO), Taguchi, Invasive Weed (IWO), and Adaptive Invasive Weed Optimization (ADIWO). Superior performance is achieved by the IWO (best results) and PSO (fast convergence) algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:NaGl4SEjCO4C",
            "Publisher": "AGU"
        },
        {
            "Title": "The effects of f0 F2 variability on TEC prediction accuracy",
            "Publication year": 2002,
            "Publication url": "https://www.annalsofgeophysics.eu/index.php/annals/article/view/3489",
            "Abstract": "In this paper hourly daily F2-layer critical frequency data recorded at Rome and one minute daily TEC data recorded at Florence were used and the relevant variabiles were calculated. It was concluded that there was no clear evidence as to how they correlated. In order to obtain a measure of the f 0 F 2 and TEC variability, the normalised differences df0 F2 and d TEC from the relevant monthly median values were also considered. Since no clear evidence could be obtained as of how df0 F2 and d TEC correlate, a new parameter, the? Ap/? R ratio was tried.? Ap was taken as the difference between the maximum value of Ap measured at the relevant disturbance and that corresponding at the beginning of the disturbance.? R corresponded to the two above mentioned values of Ap. This parameter was compared to the differences of the corresponding df0 F2 values called? df and d TEC values called? dT. In wintertime, when? A p/? R was negative, for the vast majority of the occurrences either? df or? dT was negative;? df and? dT were never observed to be negative at the same time whereas they were both positive in fewer than 10% of the observations. When? A p/? R was positive then either? df or? dT were negative. In summertime when? A p/? R was negative both? df and? dT were negative. When? A p/? R was positive, while a positive? df corresponded almost always to a positive? dT, a negative? df would equiprobably indicate either a positive or a negative? dT.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time and frequency domain simulation, measurement and optimization of log-periodic antennas",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-019-06299-w",
            "Abstract": "Log-periodic antenna is a special antenna type utilized with great success in many broadband applications due to its ability to achieve nearly constant gain over a wide frequency range. Such antennas are extensively used in electromagnetic compatibility measurements, spectrum monitoring and TV reception. In this study, a log-periodic dipole array is measured, simulated, and then optimized in the 470–860 MHz frequency band. Two simulations of the antenna are initially performed in time and frequency domain respectively. The comparison between these simulations is presented to ensure accurate modelling of the antenna. The practically measured realized gain is in good agreement with the simulated realized gain. The antenna is then optimized to concurrently improve voltage standing wave ratio, realized gain and front-to-back ratio. The optimization process has been implemented by using various …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "A Combined Computational and Experimental Investigation of Nonthermal Biological Effects on Prenatal Development due to Radiation from Low Power Microwave Antennas",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Theodoros-Zygiridis/publication/234758521_Combined_computational_and_experimental_investigation_of_nonthermal_biological_effects_on_prenatal_development_due_to_radiation_from_low_power_microwave_antennas/links/00463517d3759bca9b000000/Combined-computational-and-experimental-investigation-of-nonthermal-biological-effects-on-prenatal-development-due-to-radiation-from-low-power-microwave-antennas.pdf",
            "Abstract": "This is an integrated study of the biological effects of pulse-modulated very low power density microwave radiation. It employs a combination of a computational model of the rat and extensive in vivo experiments on rat embryos, during embryogenesis and organogenesis. The whole investigation is further enhanced via an immunological and chemical investigation of the rats' organs. The whole study is one of the first to combine results obtained by the computational, the experimental and the biomolecular investigations and attempts a discussion on existing standards for protection from low power density, long-term electromagnetic field exposure.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A qualitative study of seismic-ionospheric precursor phenomena monitored by a very close to the epicenter VLF and LF receiver",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474706515000108",
            "Abstract": "This work investigates the occurrence of disturbances across a wide range of VLF and LF frequencies received prior to a seismic event (Mw = 4), that took place on May 12th 2012, the epicenter of which was very close (14 km) to the VLF/LF station. The signals analyzed were emitted from five VLF and five LF European transmitters. This seismic event produced precursory ionospheric disturbances, identified as spectral distortion, three days before its occurrence, providing a distinct pattern open to further investigation. Although the basis of the ionosphere interaction with seismic phenomena has been well documented in previous studies, the close proximity of the receiver to the seismic event provides a new perspective to this study. The monitored signals have undergone normalization and then they have been processed by means of the Hilbert-Huang Transform. Diagrams of the signals relevant to the phenomena …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:aqlVkmm33-oC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Normalization and processing of VLF signals for the detection of seismic-ion ospheric precursor phenomena using the Empirical Mode Decomposition Method and N eural Networks",
            "Publication year": 2011,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2011EGUGA..13.3160C/abstract",
            "Abstract": "This paper investigates a normalization method for enhancing the detection abilities of seismic-ionospheric precursor phenomena using VLF radio signals. To this purpose, for every received signal the reported characteristics of the transmitter as well as its location are correlated. Taking into account these data, the theoretical transmission loss is calculated. Thus, the free space path loss of the signal together with the ionospheric losses is calculated. Then, the received power density of the signal is calculated taking into account the overall path loss, the transmitted power and the effective area of the receiving antenna. Finally, the amplitude of the electric field of the received signal is estimated. The signal level of each station is then used in order to bring the received signals of all radio stations in use into the same scale and then to point out the disturbances detected by a particular receiver. The normalized signal is …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automation in electromagnetic field measurements",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.456.290&rep=rep1&type=pdf",
            "Abstract": "Carrying out measurements in the vicinity of equipment inducing or transmitting electromagnetic fields (extremely low frequency electric and magnetic fields (ELF), radiowaves (RF) or microwaves (mW)) is one of the main activities of the Electromagnetic Radiation Measurements Laboratory (ERML) of the Department of Applied Informatics and Multimedia of the Technological Educational Institute (TEI) of Crete. These measurements require a measurement protocol [1] in order to comply with the Greek Legislation [2],[3],[4] and other national and international recommendations and standards [5],[6],[7],[8],[9],[10],[11]. Therefore, the ERML has developed special purpose software in order to automate the measurement procedures. This software is used on the one hand to facilitate the measurement procedure; on the other hand it certifies that the measurements follow the necessary protocol. This software operates combined with a Spectrum Analyzer to measure, record, and process electromagnetic fields at various frequency bands of interest. In this work the developed software is described.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of differential analysis of VLF signals for seismic-ionospheric precursor detection from multiple receivers",
            "Publication year": 2015,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2015EGUGA..17.3936S/abstract",
            "Abstract": "This study investigates the application of differential analysis on VLF signals emitted from a single transmitter and received by multiple stations in order to filter and detect disturbances that can be attributed to seismic-ionospheric precursor phenomena. The cross-correlation analysis applied on multiple VLF signals provides a way of discerning the nature of a given disturbance and accounts for more widespread geomagnetic interferences compared to local precursor phenomena. For the purpose of this paper, data acquired in Thessaloniki (40.59 N, 22, 78E) and in Heraklion (35.31 N, 25.10 E) from the VLF station in Tavolara, Italy (ICV station Lat. 40.923, Lon. 9.731) for a period of four months (September 2014-December 2014) are used. The receivers have been developed by Elettronika Srl and are part of the International Network for Frontier Research on Earthquake Precursors (INFREP). A normalization process …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An optimal design of printed log-periodic antenna for L-band EMC applications",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8393968/",
            "Abstract": "This paper proposes a 12-dipole printed log-periodic dipole array antenna (PLPDA) for L-band electromagnetic compatibility (EMC) applications. The antenna proposed is designed to operate in the frequency range of 0.8 GHz to 2.5 GHz. The proposed antenna design is the result of optimization performed using the Trusted Region Framework (TRF) algorithm. The low values of the S-parameter (S) of the optimized PLPDA antenna design suggest good matching. The antenna also provides satisfactory realized gain between 4.5 dBi to 6.3 dBi along with good directional characteristics in its operating frequency range.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Time difference of arrival method of target tracking using a second order recurrent artificial neural network for passive multistage radar application.",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=12305840856609754227&hl=en&oi=scholarr",
            "Abstract": "In this paper Time Difference of Arrival (TDOA) method is used as a tracking method of airborneand ballistic targets. The proposed system is apassive multistatic radar or TransmitterIndependent Receiver Network. This systemconsists of a number of radar receivers networked together. In the introduction the system is briefly described. Then the TDOA problem is formulated and a solution method is proposed by transforming it to an optimization problem. Consequently a recurrent Artificial Neural Network is designed in order to solve this problem and repeatedly extract thetarget coordinates. Then simulation takes placein order to prove the operational capabilities of the systems described. Finally in the conclusion the results are discussed and it is proven that an ANN controlled TIRN is a valuable passive target tracking system.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exponential log-periodic antenna design using improved particle swarm optimization with velocity mutation",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7835106/",
            "Abstract": "An improved particle swarm optimization (PSO) method applied to the design of a new wideband log-periodic antenna (LPA) geometry is introduced. This new PSO variant, called PSO with velocity mutation (PSOvm), induces mutation on the velocities of those particles that cannot improve their position. The proposed LPA consists of wire dipoles with lengths and distances varied according to an exponential rule, which is defined by two specific parameters called length factor and spacing factor. The LPA is optimized for operation in 790-6000 MHz frequency range, in order to cover the most usual wireless services in practice, and also to provide in this range the highest possible forward gain, gain flatness below 2 dB, secondary lobe level below -20 dB with respect to the main lobe peak, and standing wave ratio below 2. To demonstrate its superiority in terms of performance, PSOvm is compared with well-known …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Neural-network-based prediction techniques for single station modeling and regional mapping of the foF2 and M(3000)F2 ionospheric characteristics",
            "Publication year": 2002,
            "Publication url": "https://npg.copernicus.org/articles/9/477/2002/",
            "Abstract": " In this work, Neural-Network-based single-station hourly daily foF2 and M(3000)F2 modelling of 15 European ionospheric stations is investigated. The data used are neural networks and hourly daily values from the period 1964- 1988 for training the neural networks and from the period 1989-1994 for checking the prediction accuracy. Two types of models are presented for the F2-layer critical frequency prediction and two for the propagation factor M(3000)F2. The first foF2 model employs the E-layer local noon calculated daily critical frequency (foE12) and the local noon F2- layer critical frequency of the previous day. The second foF2 model, which introduces a new regional mapping technique, employs the Juliusruh neural network model and uses the E-layer local noon calculated daily critical frequency (foE12), and the previous day F2-layer critical frequency measured at Juliusruh at noon. The first M(3000)F2 model employs the E-layer local noon calculated daily critical frequency (foE12), its ± 3 h deviations and the local noon cosine of the solar zenith angle (cos c12). The second model, which introduces a new M(3000)F2 mapping technique, employs Juliusruh neural network model and uses the E-layer local noon calculated daily critical frequency (foE12), and the previous day F2-layer critical frequency measured at Juliusruh at noon.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:GnPB-g6toBAC",
            "Publisher": "Copernicus GmbH"
        },
        {
            "Title": "Measurements on Modern Wireless Communication Technologies and Estimation of Human Exposure",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-06704-9_5",
            "Abstract": "The evolution of wireless networking technologies in recent years leads to a faster, safer and more efficient knowledge transfer with the demand of growing up the volume of information handled. The ultimate aim of improving the living standards of citizens, requires a new foundation to evaluate and improve the existing to the present relevant measurement techniques and possibly the introduction of new ones. Also, new wireless information propagation models have to be proposed in the future and the old models have to be evaluated and modified for their improvement. This will be achieved by conducting reliable measurements and experimental tests. A key element of such measurements is the estimation of the present uncertainty. In this context, the purpose of this chapter is to study how the electromagnetic fields generated by modern wireless communication base stations can be measured and …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On the uncertainty estimation of electromagnetic field measurements using field sensors: a general approach",
            "Publication year": 2009,
            "Publication url": "https://academic.oup.com/rpd/article-abstract/133/4/240/1602517",
            "Abstract": "One of the most common and popular practices on measuring the non-ionising electric and/or magnetic field strength employs field meters and the appropriate electric and/or magnetic field strength sensors. These measurements have to meet several requirements proposed by specific guidelines or standards. On the other hand, performing non-ionising exposure assessment using real measurement data can be a very difficult task due to instrumentation limits and uncertainties. In addition, each measuring technique, practice and recommendation has its own drawbacks. In this paper, a methodology for estimating the overall uncertainty for such measurements, including uncertainty estimation of spatial average values of electric or magnetic field strengths, is proposed. Estimating and reporting measurement uncertainty are of great importance, especially when the measured values are very close to the …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Wavelet analysis of the LF radio signals collected by the European VLF/LF network from July 2009 to April 2011",
            "Publication year": 2012,
            "Publication url": "https://dspace.uevora.pt/rdpc/handle/10174/6951",
            "Abstract": "In 2008, a radio receiver that works in very low frequency (VLF; 20-60 kHz) and LF (150-300 kHz) bands was developed by an Italian factory. The receiver can monitor 10 frequencies distributed in these bands, with the measurement for each of them of the electric field intensity. Since 2009, to date, six of these radio receivers have been installed throughout Europe to establish a ‘European VLF/LF Network’. At present, two of these are into operation in Italy, and the remaining four are located in Greece, Turkey, Portugal and Romania. For the present study, the LF radio data collected over about two years were analysed. At first, the day-time data and the night-time data were separated for each radio signal. Taking into account that the LF signals are characterized by ground-wave and sky-wave propagation modes, the day-time data are related to the ground wave and the night-time data to the sky wave. In this framework, the effects of solar activity and storm activity were defined in the different trends. Then, the earthquakes with M ≥5.0 that occurred over the same period were selected, as those located in a 300-km radius around each receiver/transmitter and within the 5th Fresnel zone related to each transmitter-receiver path. Where possible, the wavelet analysis was applied on the time series of the radio signal intensity, and some anomalies related to previous earthquakes were revealed. Except for some doubt in one case, success appears to have been obtained in all of the cases related to the 300 km circles in for the ground waves and the sky waves. For the Fresnel cases, success in two cases and one failure were seen in analysing the sky …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:u-x6o8ySG0sC",
            "Publisher": "INGV"
        },
        {
            "Title": "Experimental validation of a hybrid wide-angle parabolic equation-Integral equation technique for modeling wave propagation in indoor wireless communications",
            "Publication year": 2008,
            "Publication url": "https://www.jpier.org/PIER/pier.php?paper=08031903",
            "Abstract": "A new full-wave Parabolic---Integral Equation Method (PE-IEM) for the simulation of wave propagation in realistic, highly complex indoor communication environments is proposed, together with an extensive validation via measurements. The method is based on a wide-angle parabolic equation, further enhanced by an integral equation correction and is capable of providing good approximations of the electromagnetic fields and the received power, incorp orating all fundamental propagation mechanisms in a single simulation. For a rigorous validation, it has been applied in a complex twelve-room office space and compared with measurements at the two different frequencies of 1 GHz and 2.5 GHz. The accuracy of the approximation is within reasonably expected margins, while the method retains all the advantages of full wave methods and it also has moderate requirements of computational resources.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:YsMSGLbcyi4C",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "A Parametric Study of Ionospheric Disturbances Observed At Florence",
            "Publication year": 2002,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2002EGSGA..27.4174S/abstract",
            "Abstract": "In this work a detailed study of 79 ionospheric disturbances is attempted. For this purpose hourly daily TEC data from the ionospheric station of Florence and from the period 1979-1982 and 1989-1991 are used. The disturbed days encountered in this period as well as the days before them are analyzed for several of their parameters ie duration, intensity of the phenomenon, ratio of the days between developing and recessing of disturbance etc. In several cases a high correlation between the above parameters is found. In 13 out of 79 cases the ratio of the days between developing and recessing of the disturbance is found above 1 while in 47 cases this ratio is found below 1. In 19 cases the number of developing days and the number of recessing days are equal. The results are grouped by month and by year. The correlation coefficient between the so calculated mean values has taken very high values.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tropospheric ducting phenomena over the Hellenic region",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.646",
            "Abstract": "The variation of the refractivity profiles of the troposphere and especially of the ducting effect, affects the radio wave propagation causing various phenomena such as refraction, fading and interference between radio‐stations. In this work, the tropospheric ducting phenomena over the Hellenic region are studied using data from Helleniko and Thessaloniki Airports for the time period from 1991 to 1999. The data are analysed, corrected and enhanced using interpolation techniques and after a final statistical process the ducting conditions over the Hellenic region are summarized. Copyright © 2004 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:4TOpqqG69KYC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Implementation of antenna array beamforming by using a novel neural network structure",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7551914/",
            "Abstract": "The present study introduces the implementation of antenna array beamforming based on a new neural network (NN) structure. The NN comprises two hidden layers, which use different interconnectivity patterns. The first one is divided in sublayers, which are equal in number to the inputs of the NN. Each sublayer communicates only with the respective input but is fully interconnected with the second hidden layer. The NN training is performed by using data sets derived by a well-known beamforming technique called minimum variance distortionless response. The trained NN is capable of serving as adaptive beamformer that makes a linear antenna array steer the main lobe towards a desired signal and place nulls towards respective interference signals in the presence of additive zero-mean Gaussian noise. The performance of the trained NN is tested by estimating the mean absolute deviation of main lobe and …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient modeling of the wave propagation through the ionosphere using the finite element method",
            "Publication year": 2006,
            "Publication url": "http://www.wseas.us/e-library/conferences/2006elounda1/papers/537-214.pdf",
            "Abstract": "Aristotle University of Thessaloniki Department of Electrical and Computer Engineering 54006 Thessaloniki, Greece Abstract-In this work, an HF ionospheric wave propagation model, below and above MUF is developed and analyzed using the one-dimensional finite element method. The purpose is to find numerical solutions of the one-dimensional wave equation and study the way that the wave propagates through the ionosphere. The ionospheric medium at heights between 65 to 400 Km, is modeled by its refractive index profile, which is calculated using electron density data from the International Reference Ionosphere model (IRI-95). The frequencies used in this work, in order to illustrate the model are below and above MUF and two slightly different ionospheric profiles have been used in order to evaluate the model response with small variations of the medium characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:2P1L_qKh6hAC",
            "Publisher": "WSEAS PRESS"
        },
        {
            "Title": "Synthesis of a near-optimal high-gain antenna array with main lobe tilting and null filling using Taguchi initialized invasive weed optimization",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6719486/",
            "Abstract": "A near-optimal base-station antenna array synthesis suitable for broadcasting applications is presented. The array is required to provide a high-gain radiation pattern with a main lobe slightly tilted from the horizontal plane and null filling inside an angular sector under the main lobe. To satisfy the above requirements, a novel invasive weed optimization (IWO) variant called Taguchi initialized IWO (TI-IWO) is proposed in this paper. In TI-IWO, the Taguchi's optimization method is employed to initialize effectively the positions of the weeds used by the IWO method. In this way, the fitness function starts from lower values and, thus, the TI-IWO method finds better near-optimal solutions than the conventional IWO method. The proposed method has been applied to linear arrays. Due to its easy implementation in practice, a uniform-amplitude excitation distribution is considered to be applied on the array elements. Two cases …",
            "Abstract entirety": 0,
            "Author pub id": "NFCJxPMAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fault Diagnosis of Roller Bearings Using the Wavelet Transform",
            "Publication year": 2011,
            "Publication url": "https://www.incdmtm.ro/editura/documente/pag.%2021-24%20COMEFIM%2010%20TSIAFIS.pdf",
            "Abstract": "Ball bearings are perhaps the most widely used machine elements and a lot of important and expensive mechanic systems are based on them. Thus, it is necessary to establish a method to detect faults in order to keep the systems running properly. Fault identification of rolling element bearings employing condition monitoring techniques has been the subject of extensive research for the last two decades. Vibration signals of machines provide the dynamic information of the machine condition taking into account the fact that whenever the rolling element encounters a defect, a short duration impulse is generated. These signals are very useful for fault diagnosis. In this paper, the Fast Fourier Transform (FFT) is initially employed for an first comparison between healthy and defective bearings. Then, the main signal analysis is performed using the Wavelet Transform Method (WTM) which proves very effective in problems of this type.",
            "Abstract entirety": 1,
            "Author pub id": "NFCJxPMAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        }
    ]
}]