[{
    "name": "Ιωάννης Αναγνωστόπουλος",
    "romanize name": "Ioannis Anagnostopoulos",
    "School-Department": "Πληροφορικής με Εφαρμογές στη Βιοϊατρική ",
    "University": "uth",
    "Rank": "Καθηγητής",
    "Apella_id": 13705,
    "Scholar name": "Ioannis Anagnostopoulos",
    "Scholar id": "9UBJ4QEAAAAJ",
    "Affiliation": "National Technical University of Athens - University of the Aegean - University of Thessaly",
    "Citedby": 3262,
    "Interests": [
        "Web Information Management",
        "Internet Technologies",
        "Online Social Networks",
        "Linked Data",
        "Intelligent Systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=9UBJ4QEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Evaluating Algorithms for Control and Survivability Mechanisms in SONET",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=5673598867754298286&hl=en&oi=scholarr",
            "Abstract": "During the last years, several types of network control and restoration techniques have been proposed and discussed. However it was evaluated that a single restoration technique in high-speed networks cannot cover the needs for control, survivability and economical spare channel assignment. This is due to the fact that each technique has its own feature and properties in terms of restoration time, flexibility, applied network elements and restoration cost. Three proposed Alternative Shared Self-healing Ring Algorithms (ASSRA) are placed as substitution in a phase of an algorithm, which use an integrated self-healing technique based in the principal of evolving more than one restoration techniques such as Route Diversity (RD), Shared Self-healing Rings (SSR) and Dynamic Self-Healing algorithms. The main scope of this paper is to examine the effects of the different proposed SSR designing algorithms in the …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the feasibility of applying capture–recapture experiments for web evolution estimations",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0893965911000590",
            "Abstract": "This paper proposes a novel application for estimating the size and evolution of web page populations, based on the capture–recapture methodology, which is mainly used in wildlife biological studies. Firstly, we present the necessary modifications and amendments needed for the web capture–recapture paradigm, and then we discuss the limitations confronted. The paper provides the implementation details of the proposed web capture recapture model along with its initial assessment. The anticipated outcome was to examine whether we can conduct capture–recapture experiments on the web (or a web sub-universe such as an Internet search engine directory), in order to further estimate evolution rates in web page populations.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Modelling of indoor low voltage power-line cables in the high frequency range",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Anagnostopoulos-4/publication/266451524_Modelling_of_Indoor_Low-Voltage_Cables_in_the_High_Frequency_range/links/54b50d600cf28ebe92e4b64d/Modelling-of-Indoor-Low-Voltage-Cables-in-the-High-Frequency-range.pdf",
            "Abstract": "Considering Power Line Communications over the Low Voltage network, propagation characteristics of mains cabling in the High Frequency range are being examined. A theoretical model of indoor single-phase sheathed tricels with conductors of circular cross section in the 1-21MHz-frequency area is being introduced. Verification of the model proposed has been performed, involving transfer function measurements of applicable sample cables, which seem to follow quite well the theoretically anticipated behavior.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Revealing information paths in web graphs through an ant colony based algorithm",
            "Publication year": 2009,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/28793",
            "Abstract": "Revealing information paths in web graphs through an ant colony based algorithm Αρχική Σελίδα \n→ Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε περιοδικά \n→ Εμφάνιση Τεκμηρίου HEAL DSpace Revealing information paths in web graphs through an \nant colony based algorithm Αποθετήριο DSpace/Manakin Revealing information paths in web \ngraphs through an ant colony based algorithm Kouzas, G; Anagnostopoulos, I; Kolias, V; \nKayafas, E URI: http://hdl.handle.net/123456789/28793 Ημερομηνία: 2009 Εμφάνιση πλήρους \nεγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή Δεν υπάρχουν \nαρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην ακόλουθη \nσυλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά Περιήγηση Σε όλο το DSpace Κοινότητες \n& Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Αυτή η Συλλογή Ανά / …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:-f6ydRqryjwC",
            "Publisher": "CRL"
        },
        {
            "Title": "ABC",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Text data augmentations: Permutation, antonyms and negation",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417421002104",
            "Abstract": "Text has traditionally been used to train automated classifiers for a multitude of purposes, such as: classification, topic modelling and sentiment analysis. State-of-the-art LSTM classifier require a large number of training examples to avoid biases and successfully generalise. Labelled data greatly improves classification results, but not all modern datasets include large numbers of labelled examples. Labelling is a complex task that can be expensive, time-consuming, and potentially introduces biases. Data augmentation methods create synthetic data based on existing labelled examples, with the goal of improving classification results. These methods have been successfully used in image classification tasks and recent research has extended them to text classification. We propose a method that uses sentence permutations to augment an initial dataset, while retaining key statistical properties of the dataset. We …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:uWiczbcajpAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A license plate-recognition algorithm for intelligent transportation system applications",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1688109/",
            "Abstract": "In this paper, a new algorithm for vehicle license plate identification is proposed, on the basis of a novel adaptive image segmentation technique (sliding concentric windows) and connected component analysis in conjunction with a character recognition neural network. The algorithm was tested with 1334 natural-scene gray-level vehicle images of different backgrounds and ambient illumination. The camera focused in the plate, while the angle of view and the distance from the vehicle varied according to the experimental setup. The license plates properly segmented were 1287 over 1334 input images (96.5%). The optical character recognition system is a two-layer probabilistic neural network (PNN) with topology 108-180-36, whose performance for entire plate recognition reached 89.1%. The PNN is trained to identify alphanumeric characters from car license plates based on data obtained from algorithmic image …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a collaborative ranking mechanism for efficient and personalized internet search service provisioning",
            "Publication year": 2011,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm00368",
            "Abstract": "The aim of this paper is, in accordance with efficient web search service operation objectives, to propose enhancements to the sophistication of the functionality that can be offered by search engine services. A meta-search third-party result ranking mechanism is proposed, which is capable of adapting over the continuous changes that occur on the web, providing in parallel personalized information acquisition considering the user's navigation behaviour. Transparency is achieved for both personalization and web evolution adaptation mechanisms, requiring virtually none effort from the user's part. In essence, the proposed meta search engine rates, re-organises and combines the results acquired from search services for a specific user information resource request in accordance with a weighted combination of a performance related factor (tightly related to the ranking of the web result as given by the search engine …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Testing scalability and performance of decentralized on-line social networks",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003774",
            "Abstract": "During the last years, a lot of research has been conducted in the field of Decentralized Online Social Networks (DOSNs). Due to limited dependency on a dedicated central-based infrastructure, such kind of social networking enhances the privacy of users' personal data and information in case of local attacks, yet on the other hand suffers in terms of scalability. In this paper, we propose a platform that enables the custom creation of a decentralized network configuration, along with all necessary modules for simulating the traffic of real-world online social networks and measuring in parallel the performance of several DOSN architectures across artificial data. The goal of our work is two fold since it i) verifies the benefits of the decentralized paradigm based on several conclusions drawn and ii) provides a platform that enables the provision of custom experimentation for researchers in the related field.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An HF multipath-propagation analysing method for power delay profile estimations of indoor single-phase low voltage PLC channels",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Anagnostopoulos-4/publication/228899109_An_HF_multipath-propagation_analysing_method_for_power_delay_profile_estimations_of_indoor_single-phase_low_voltage_PLC_channels/links/02e7e5181233305e72000000/An-HF-multipath-propagation-analysing-method-for-power-delay-profile-estimations-of-indoor-single-phase-low-voltage-PLC-channels.pdf",
            "Abstract": "Focalised on the statistical characterisation of fading indoor PLC channels, a method providing the High Frequency transfer properties of such channels on account of multipath propagation is introduced. Taking into account a finite set of paths, channel's transfer function is calculated in terms of cable's type and the vicinal network topology. Accuracy of the method has been justified by transfer-function measurements of sample channels in the 2-30MHz band, whereas applicability stands wherever cabling meets the two-conductor transmission-line model. Preliminary power-delay-profile simulations are also demonstrated, indicating utility of the method for channel capacity estimations.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "InfluenceTracker: Rating the impact of a Twitter account",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44722-2_20",
            "Abstract": "This paper describes a methodology for rating the influence of a Twitter account in this famous microblogging service. Then it is evaluated over real accounts, under the belief that influence is not only a matter of quantity (amount of followers), but also a mixture of quality measures that reflect interaction, awareness, and visibility in the social sphere. The authors of this paper have created “InfluenceTracker”, a publicly available website where anyone can rate and compare the recent activity of any Twitter account.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Social networking and on-line communities: Classification and research trends",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6103502/",
            "Abstract": "We investigate the birth and evolution of the on-line social networks research field as it is outlined in several recent works published within the last four years. Our goal is to present how this particular subject attracts a continually growing interest, as during the last years the on-line social networks are transforming from a simple idea to a social-scientific phenomenon, thus attracting a variety of other related sciences towards the new interesting prospects that emerge on the Web.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Introduction to the topical issue on semantic social networks and media applications",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s13278-017-0471-0",
            "Abstract": "Online social networks have been with us since the early days of Six Degrees in 1997, whilst the semantic web in the form we know it emerged in 2001. Yet, only recently have the two areas started to really come together, giving us social networks that incorporate technologies for semantifying the information associated with them, as well as their diffused content. These semantic social networks can be seen as tools to model knowledge from multidisciplinary social media and scattered online communities. Today, the exponential growth of social networking data, combined with developments in the area of semantic technologies, is giving rise to numerous new interesting research topics. Several challenges arise with respect to identification and modeling of complex and evolutionary patterns using computational intelligence and data mining techniques, discovery and analysis of online communities, personalization …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Springer Vienna"
        },
        {
            "Title": "Automatic web site classification in a large repository under information filtering and retrieval techniques",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1014574/",
            "Abstract": "Nowadays, there is a huge volume of information on the Web, which is disseminated to the users in a chaotic way. In order to be easily accessed, the information must be clustered and classified in appropriate knowledge areas. Thus, many heavily visited sites or portals try to unify the access to multiple information sources, providing by this way classification of information. This paper proposes a system, aiming to classify e-commerce sites according their Web-content. This system can be implemented for automatic knowledge segmentation in a portal or in a search engine repository. The system performance reached 96% in the first test sets, after the learning phase. However, the performance significantly increases (up to 98%) as the number of the test sets increases.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Covering Classification Rule Induction Approach for Big Datasets",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7321728/",
            "Abstract": "With the ever increasing production of data from various heterogeneous sources in modern information societies, the need for scalable data-intensive processing is increasing. MapReduce quickly became the de facto framework for large scale data analysis, due to its simple and abstract programming model and its efficient underlying execution system. However, this simplicity comes with a price: its unidirectional communication model and the lack of support for iterations, makes repeated querying of datasets difficult and imposes limitations in many fields including Machine Learning. In this paper we describe the implementation of a classification rule induction algorithm based on MapReduce, with the aim of building a classification model within as few iterations as possible. After a thorough description of the algorithm, we evaluate its performance from three perspectives: its accuracy, its parallel performance and …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementing a customised meta-search interface for user query personalisation",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1024655/",
            "Abstract": "Nowadays it is commonly accepted that the web is structured in a chaotic way. Due to the fact that it grows exponentially, it is a difficult task to efficiently locate specific information. This paper presents a User-defined Meta-Search Engine (UMSE), adaptable to user preferences. UMSE utilises tip to 9 known search engines according to a user-defined ranking, submits its queries in parallel and finally presents the merging results back to the user. The anticipated outcome of using UMSE is that the user gets enhanced amount of information, recording in parallel his search preferences. UMSE also supports history features in order to personalise user queries and facilitate information retrieval.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent Hypermedia for the Adaptive Web: Foreword to the SMAP'08 Special Session",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4724865/",
            "Abstract": "Researchers need to explore and study the plethora of challenges that emergent intelligent hypermedia technologies bring to the Adaptive Web. This special session aims to increase the awareness of researchers in this area, providing an in-depth investigation on several research and deployment issues, regarding the impact of intelligent methods on this new form of Web. In addition, this special session examines the performance characteristics of various approaches in Web-based systems, while it focuses on the development of intelligent methods among different hypermedia applications.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Latent Twitter Image Information for Social Analytics",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/969292",
            "Abstract": "The appearance of images in social messages is continuously increasing, along with user engagement with that type of content. Analysis of social images can provide valuable latent information, often not present in the social posts. In that direction, a framework is proposed exploiting latent information from Twitter images, by leveraging the Google Cloud Vision API platform, aiming at enriching social analytics with semantics and hidden textual information. As validated by our experiments, social analytics can be further enriched by considering the combination of user-generated content, latent concepts, and textual data extracted from social images, along with linked data. Moreover, we employed word embedding techniques for investigating the usage of latent semantic information towards the identification of similar Twitter images, thereby showcasing that hidden textual information can improve such information retrieval tasks. Finally, we offer an open enhanced version of the annotated dataset described in this study with the aim of further adoption by the research community. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:epqYDVWIO7EC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Enhancing fairness in wireless multi-hop networks",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Anagnostopoulos-4/publication/221223399_Enhancing_Fairness_in_Wireless_Multi-Hop_Networks/links/02bfe50dda478bfa37000000/Enhancing-Fairness-in-Wireless-Multi-Hop-Networks.pdf",
            "Abstract": "Wireless multi-hop networks have recently been conceived as a networking paradigm. However, their deployment has been limited, mainly due to the fact that they lack fairness. In this research effort, we briefly review the state of art in fairness mechanisms in multi-hop networks and we propose an algorithm that tries to differentiate the traffic among the connections in a wireless multi-hop ad-hoc sensor network, so that the fairness is enhanced. This is achieved by an adaptive scheme, which tries to assign a higher priority to the traffic connections that experience delay greatly larger than the average, so that their delay is reduced, and the fairness of the system is improved.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Monitoring browsing behaviour and search services evolution adaptation with a capture–recapture Internet-based programming technique: A case-study over medical portals",
            "Publication year": 2007,
            "Publication url": "https://content.iospress.com/articles/information-services-and-use/isu534",
            "Abstract": "Nowadays, web search services are considered as a valuable tool for information exploration. However, due to the extremely rapid growth of the web, search engines cannot index the new information at the same time or with the same priority and thus their performance is hampered in some extend. Besides, web search services index the disseminated information with different algorithms, having as result different response time in updating their directories. In this paper, we propose a meta-search algorithm, which is capable of self-adapting over the continuous changes that occur on the indexed web, using a web evolution adaptation mechanism. This mechanism is put in the context of real capture–recapture experiments conducted in wildlife biological studies. The meta-search algorithm also supports a monitor mechanism, which records the user's browsing behavior during his search sessions. The paper provides …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "On the Evaluation of Coarse Grained Parallelism in AV1 Video Coding",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8501888/",
            "Abstract": "Video compression is arguably one of the most time consuming tasks, especially at high resolutions. For this reason parallelization has been used at various levels: from coarse grained schemes that consider groups of blocks or frames as granules to fine grained approaches that parallelize the compression within a block of pels, e.g., at motion estimation. Given that the decade old H.264/AVC is showing its age in the 4K era, AV1 was recently launched by AOMedia as a royalty free standard promising significant compression gains (for the same quality) over the older H.264/AVC and VP9 protocols. Since AV1 is currently at its infancy, most initial research efforts concentrated on identifying possible strengths and shortcomings of the standard at various settings, focusing on video quality and compression efficiency. However, time performance and parallelism potential are equally important, particularly for media …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Methodological Approach on Linked Open Data Production: The Publicspending. Gr Project",
            "Publication year": 2012,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2193600",
            "Abstract": "Web technologies have evolved to effectively support the creation and existence of Linked Open Data (LOD) within the web. However, the production and mass consumption of LOD have been a matter of debate over methodologies, best practices, and technologies that should be employed. Particularly in the case of government LOD, the production and publication lifecycle needs to follow a methodological approach. The paper presents publicspending. gr, a 5-star LOD project focusing on Greek Public spending as a case of LD application that is developed according to a methodological approach, following a specific Linked Data Production Life Cycle.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Computation of Containment and Complementarity in RDF Data Cubes",
            "Publication year": 2016,
            "Publication url": "https://www.cs.uoi.gr/~pvassil/publications/2016_EDBT/EDBT_2016.pdf",
            "Abstract": "Multidimensional data are published in the web of data under common directives, such as the Resource Description Framework (RDF). The increasing volume and diversity of these data pose the challenge of finding relations between them in a most efficient and accurate way, by taking into advantage their overlapping schemes. In this paper we define two types of relationships between multidimensional RDF data, and we propose algorithms for efficient and scalable computation of these relationships. Specifically, we define the notions of containment and complementarity between points in multidimensional dataspaces, as different aspects of relatedness, and we propose a baseline method for computing them, as well as two alternative methods that target speed and scalability. We provide an experimental evaluation over real-world and synthetic datasets and we compare our approach to a SPARQL-based and a rule-based alternative, which prove to be inefficient for increasing input sizes.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:wbdj-CoPYUoC",
            "Publisher": "OpenProceedings.org"
        },
        {
            "Title": "Paid Crowdsourcing, Low Income Contributors, and Subjectivity",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=I3qYDwAAQBAJ&oi=fnd&pg=PA225&dq=info:C67kNf9TjC4J:scholar.google.com&ots=z3yR2zoeih&sig=-H-oXuIHz5yX77fKQc7GE7PFgNc",
            "Abstract": "Scientific projects that require human computation often resort to crowdsourcing. Interested individuals can contribute to a crowdsourcing task, essentially contributing towards the project’s goals. To motivate participation and engagement, scientists use a variety of reward mechanisms. The most common motivation, and the one that yields the fastest results, is monetary rewards. By using monetary, scientists address a wider audience to participate in the task. As the payment is below minimum wage for developed economies, users from developing countries are more eager to participate. In subjective tasks, or tasks that cannot be validated through a right or wrong type of validation, monetary incentives could contrast with the much needed quality of submissions. We perform a subjective crowdsourcing task, emotion annotation, and compare the quality of the answers from contributors of varying income levels, based on the Gross Domestic Product. The results indicate a different contribution process between contributors from varying GDP regions. Low income contributors, possibly driven by the monetary incentive, submit low quality answers at a higher pace, while high income contributors provide diverse answers at a slower pace.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Springer"
        },
        {
            "Title": "License plate recognition from still images and video sequences: A survey",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4518951/",
            "Abstract": "License plate recognition (LPR) algorithms in images or videos are generally composed of the following three processing steps: 1) extraction of a license plate region; 2) segmentation of the plate characters; and 3) recognition of each character. This task is quite challenging due to the diversity of plate formats and the nonuniform outdoor illumination conditions during image acquisition. Therefore, most approaches work only under restricted conditions such as fixed illumination, limited vehicle speed, designated routes, and stationary backgrounds. Numerous techniques have been developed for LPR in still images or video sequences, and the purpose of this paper is to categorize and assess them. Issues such as processing time, computational power, and recognition rate are also addressed, when available. Finally, this paper offers to researchers a link to a public image database to define a common reference …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "“Storytelling” in the economic LOD: the case of publicspending. gr",
            "Publication year": 2013,
            "Publication url": "https://www.w3.org/2013/04/odw/odw13_submission_30.pdf",
            "Abstract": "The scope of the publicspending. gr project is to generate, curate, interlink and publish economic data in LOD formats that are easily accessible and useful to the scientific community and to provide an user-friendly and objective layer of information that will enable citizens, journalists, business people and politicians to re-discover their own “stories” from data.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving the precision of third-party results by monitoring browsing behaviour and evolution in internet search engine caches",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Anagnostopoulos-4/publication/287887305_Improving_the_Precision_of_Third-Party_Results_by_Monitoring_Browsing_Behaviour_and_Evolution_in_Internet_Search_Engine_Caches/links/58c2879ca6fdcce648dcf478/Improving-the-Precision-of-Third-Party-Results-by-Monitoring-Browsing-Behaviour-and-Evolution-in-Internet-Search-Engine-Caches.pdf",
            "Abstract": "1 Introduction Improving the Precision of Third-Party Results by Monitoring Browsing Behaviour and Evolution in Intern",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:j3f4tGmQtD8C",
            "Publisher": "National Dong Hwa University"
        },
        {
            "Title": "DTCo: An Ensemble SSL Algorithm for X-ray Classification",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-32622-7_24",
            "Abstract": "In the last decades, the classification of images was established as a typical method for diagnosing many abnormalities and diseases. The purpose of an efficient classification method is considered essential in modern diagnostic medicine in order to increase the number of diagnosed patients and decrease the analysis time. The significant storage capabilities of electronic media have enabled research centers to accumulate repositories of classified (labeled) images and mostly of a large number of unclassified (unlabeled) images. Semi-supervised learning algorithms have become a hot topic of research as an alternative to traditional classification methods, seeing as they exploit the explicit classification information of labeled data with the knowledge hidden in the unlabeled data resulting in the creation of powerful and effective classifiers. In this work, we propose a new ensemble self-labeled algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:2KloaMYe4IUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Neural network-based diagnostic and prognostic estimations in breast cancer microscopic instances",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s11517-006-0079-4",
            "Abstract": "This paper deals with breast cancer diagnostic and prognostic estimations employing neural networks over the Wisconsin Breast Cancer datasets, which consist of measurements taken from breast cancer microscopic instances. A probabilistic approach is dedicated to solve the diagnosis problem, detecting malignancy among instances derived from the Fine Needle Aspirate test, while regression algorithms estimate the time interval that possibly correspond to the right end-point of the patients’ disease-free survival time or the time where the tumour recurs (time-to-recur). For the diagnosis problem, the accuracy of the neural network in terms of sensitivity and specificity was measured at 98.6 and 97.5% respectively, using the leave-one-out test method. As far as the prognosis problem is concerned, the accuracy of the neural network was measured through a stratified tenfold cross-validation approach …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A probabilistic neural network for human face identification based on fuzzy logic chromatic rules",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=5996138227009617437&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Editorial on “QoS and service provisioning for integrated wireless networks”",
            "Publication year": 2011,
            "Publication url": "https://ir.lib.uth.gr/xmlui/handle/11615/25519",
            "Abstract": "Editorial on \"QoS and service provisioning for integrated wireless networks\" Toggle navigation \nEnglish Ελληνικά Deutsch français italiano español Ελληνικά English Ελληνικά Deutsch français \nitaliano español Σύνδεση Toggle navigation Προβολή τεκμηρίου Ιδρυματικό Αποθετήριο \nΠανεπιστημίου Θεσσαλίας Επιστημονικές Δημοσιεύσεις Μελών ΠΘ (ΕΔΠΘ) Δημοσιεύσεις σε \nπεριοδικά, συνέδρια, κεφάλαια βιβλίων κλπ. Προβολή τεκμηρίου Ιδρυματικό Αποθετήριο \nΠανεπιστημίου Θεσσαλίας Επιστημονικές Δημοσιεύσεις Μελών ΠΘ (ΕΔΠΘ) Δημοσιεύσεις σε \nπεριοδικά, συνέδρια, κεφάλαια βιβλίων κλπ. Προβολή τεκμηρίου Όλο το DSpace Κοινότητες & \nΣυλλογές Ανά ημερομηνία δημοσίευσης Συγγραφείς Τίτλοι Λέξεις κλειδιά Editorial on \"QoS and \nservice provisioning for integrated wireless networks\" Thumbnail Συγγραφέας Anagnostopoulos, \nI.; Tinnirello, I.; Douligeris, C. Ημερομηνία 2011 DOI 10.1016/j.pmcj..Λέξη-κλειδί Science, :…",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantifying twitter: The influence tracker ontology",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6978961/",
            "Abstract": "In this paper, we propose an ontology schema towards semantification provision of Twitter social analytics. The ontology is deployed over a publicly available service that measures how influential a Twitter account is, by combining its social activity and interaction over Twitter sphere. Apart from influential quantity and quality measures, the service provides a SPARQL endpoint where users can perform advance semantic queries through the RDFized Twitter entities (mentions, replies, hash tags, photos, URLs) over the semantic graph.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and implementation of a VoiceXML-driven wiki application for assistive environments on the web",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00779-009-0274-z",
            "Abstract": "In this paper, we describe the design and implementation of an audio wiki application accessible via both the Public Switched Telephone Network and the Internet. The application exploits mature World Wide Web Consortium standards, such as VoiceXML, Speech Synthesis Markup Language, and Speech Recognition Grammar Specification toward achieving our goals. The purpose of such an application is to assist visually impaired, technologically uneducated, and underprivileged people in accessing information originally intended to be accessed visually via a personal computer (PC). Users may access wiki content via fixed or mobile phones, or via a PC using a Web Browser or a Voice over IP service. This feature promotes pervasiveness to collaboratively created content to an extremely large population, i.e., those who simply own a telephone line.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer London"
        },
        {
            "Title": "On improving the speedup of slice and tile level parallelism in HEVC using AVX2",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3139367.3139427",
            "Abstract": "HEVC has emerged as the new video coding standard promising improved compression ratios (for the same quality) by up to 50% compared to H. 264/AVC. To achieve this performance HEVC requires increased computational overhead compared to its predecessor. For this reason parallelism is used, usually at a coarse grained level, eg, per slice or tile. In this paper we turn our attention towards further speeding up the HEVC encoding process by combining coarse grained parallelism with fine grained, in the form of AVX2 instructions implementing SIMD parallelism at SAD (Sum of Absolute Difference) and SSE (Sum of Squared Error) calculations. Experimental evaluation with common test video sequences illustrates that an additional reduction (in encoding time) of roughly 11% on average, compared to standalone coarse grained parallelism is achievable, leading in many cases to superlinear speedup.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimating the evolution of categorized web page populations",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1149993.1150008",
            "Abstract": "This paper proposes a statistical approach for estimating the evolution of categorized web pages. The proposal is based on the capture-recapture method used in wildlife biological studies and it is modified according to the necessary assumptions and amendments for applying the experiments on the web, where web pages are considered as animals and the specific types of e-commerce pages as particular species of animals whose abundance, birth and survival rates is estimated. An artificial classifier capable of categorizing web pages, plays the role of the biologist who recognizes the species under study. Finally, a virtual experiment in the e-commerce field was simulated and the derived results were quite promising especially as far as the estimations of the survival probability values are concerned.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Big Data for a Linked Open Economy",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-47898-2_28",
            "Abstract": "As the volume data grows exponentially, more and more big data handling approaches are also applied in the linked data cloud. Thus, semantic triplets which are nucleus of the Resource Description Framework (RDF) must be harmonized to the demanding needs of the 4 Vs. This paper presents the architecture and the main components of a big linked data repository named LinkedEconomy. The scope of the platform is to collect, process, interlink and publish unprecedented high-detailed economic data in machine-readable format, in order to (a) provide a new data corpus for enriching research efforts in Economic, Statistics and Business studies, and (b) contribute to Big data analytics for corporate decision making. ",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "High performance computing algorithms for textile quality control",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378475402000319",
            "Abstract": "At the present time, industries like textile are in constant need of modernisation. Thus, their presence in the high technology area of high performance computing (HPC) based inspection is of strategic interest. Textile manufacturers have to monitor the quality of their products in order to maintain the high quality standards established for the textile industry. The scope of this paper is to present a HPC architecture which can be implemented at each step of the quality control process in fabrics. The prerequisites or the overall system are then discussed analytically, as well as the limitations and the restrictions imposed due to the nature of the problem. The software algorithm and the evaluation of the first results are also presented in detail.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Total dermoscopy score calculation using quantitative measurements in digital dermoscopy",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6945176/",
            "Abstract": "The main contributions of this paper are an automated approach for applying the ABCDE rules in a digital dermoscopy platform with fixed settings and a new registration method specially designed for aligning and comparing follow-up digital dermoscopy images in order to evaluate the evolution over time parameter E. Experimental evaluations of the registration method are reported for image pairs acquired during follow-up examinations.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A context-aware telemedicine platform for monitoring patients in remote areas",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Kostas-Perakis/publication/200028531_A_Context-aware_Telemedicine_Platform_for_Monitoring_Patients_in_Remote_Areas/links/0c9605295cd155bc99000000/A-Context-aware-Telemedicine-Platform-for-Monitoring-Patients-in-Remote-Areas.pdf#page=55",
            "Abstract": "Continuous monitoring of patients with chronic diseases can enable early detection of deterioration and initiation of appropriate measures. This may be particularly important for patients who live in remotes areas as emergency medical services may take a long time to reach them. However continuously sending monitored biosignals to a healthcare centre is not practical as it places a high data load on a network. It is also not feasible for a healthcare professional to continuously monitor the data of several patients with chronic illnesses. In this paper we propose a context sensitive platform that sends data only when the biosignals move outside a specified range and which optimises data transmission by taking into account the network environment and the patient status. The framework architecture is open and does not depend on the monitoring applications used, the underlying networks, or the telemedicine system used. The system also incorporates additional functionalities such as obtaining second opinions through peer to peer communication. This paper describes the architecture together with a prototype evaluation.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An intelligent information system for detecting web commerce transactions",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11495772_7",
            "Abstract": "This paper proposes an algorithm for detecting web transactions through web page classification. The algorithm is implemented over a generalised regression neural network and detects e-commerce pages classifying them to the respective transaction phase according to a framework, which describes the fundamental phases of commercial transactions in the web. Many types of web pages were used in order to evaluate the robustness of the method, since no restrictions were imposed except for the language of the content, which is English. Except from revealing the accomplished sequences in a web commerce transaction, the system can be used as an assistant and consultative tool for classification purposes.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:GnPB-g6toBAC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Implementing a Blockchain Infrastructure on Top of Vehicular Ad Hoc Networks",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-02305-8_92",
            "Abstract": "Vehicular ad hoc networks have attracted a lot of research recently, because of the multiple possible applications. Blockchain is a new approach to designing distributed storage infrastructures. In this paper the implementation of a blockchain infrastructure on top of vehicular ad hoc networks is presented. The main motive is to create a peer to peer shared storage between vehicles traveling in a specific area that may enable them to collaboratively produce data that can be used by them or even sold to other vehicles. A proof of concept experiment has been conducted through simulating the proposed system functioning by using a real world dataset containing vehicles GPS coordinates.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:tzM49s52ZIMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "MEASUREMENTS OVER E-COMMERCE ACTIVITIES ON THE WORLD WIDE WEB",
            "Publication year": 2010,
            "Publication url": "https://www.imeko.org/publications/tc4-2010/IMEKO-TC4-2010-133.pdf",
            "Abstract": "In nowadays, there is a huge volume of information on the web, which is disseminated to the users in a chaotic way. In order to be accessed, the information must be clustered and classified in appropriate knowledge models. These models will provide and form the initial conditions of a knowledge structure. A confusing situation exists in the Digital Economy or in the so-called E-Commerce Arena. The way in which economic values and business strategies are created is changing fundamentally and this transforms the general structure of the Economy. A simple survey shows that there is no single, comprehensive and cogent taxonomy of web business models, due to the fact that every classification approach is depending on the importance appointed to the various aspects of the emerging “new economy”. This paper, takes under consideration a web business model taxonomy, proposed by M. Rappa. This taxonomy classifies a web site into a business model according its position in the value chain [1]. Based in the above taxonomy the paper suggests a system, which through information filtering, text retrieval and knowledge techniques, will extract the site content, analyse it and finally classify the e-commerce site. The system uses retrieval techniques, which are emphasised in statistical correlations of words in site content, and scoring content collections with model profiles under the Vector Space Model (VSM)[2],[3]. The anticipated outcome of the proposed system is to identify whether a site is actually offers commerce services through the web. In case of an E-commerce identification, the system proceeds in a business model classification based …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Structure diversity as supplementary survivability method in sonet",
            "Publication year": 2002,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16580685",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D04 Telecommunications and information theory/001D04B Telecommunications/001D04B02 Systems, networks and services of telecommunications/001D04B02G Transmission and modulation (techniques and equipments)",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic hyper/multimedia adaptation: schemes and applications",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=moG5BQAAQBAJ&oi=fnd&pg=PP2&dq=info:U5EEAOnOCJAJ:scholar.google.com&ots=LDXUFYbTJ5&sig=5BKk1x_WOK13JXYBSOfV6ZV6660",
            "Abstract": "Nowadays, more and more users are witnessing the impact of Hypermedia/Multimedia as well as the penetration of social applications in their life. Parallel to the evolution of the Internet and Web, several Hypermedia/Multimedia schemes and technologies bring semantic-based intelligent, personalized and adaptive services to the end users. More and more techniques are applied in media systems in order to be user/group-centric, adapting to different content and context features of a single or a community user. In respect to all the above, researchers need to explore and study the plethora of challenges that emergent personalisation and adaptation technologies bring to the new era. This edited volume aims to increase the awareness of researchers in this area. All contributions provide an in-depth investigation on research and deployment issues, regarding already introduced schemes and applications in Semantic Hyper/Multimedia and Social Media Adaptation. Moreover, the authors provide survey-based articles, so as potential readers can use it for catching up the recent trends and applications in respect to the relevant literature. Finally, the authors discuss and present their approach in the respective field or problem addressed.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Springer"
        },
        {
            "Title": "A Speech-Enabled Assistive Collaborative Platform for Educational Purposes with User Personalization",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4724866/",
            "Abstract": "With the proliferation of Web 2.0 applications, collaborative learning has gathered a lot of attention due its potentiality in the e-learning field. Forums, Wikis and Blogs for example are only some of the applications that exploit the collaborative nature of e-learning. However, these applications are originally designed for access from desktop systems and access to them when on the move can prove a challenging task. This paper elaborates on the design and implementation of an assistive collaborative platform for educational purposes that can be accessed by heterogeneous hardware platforms such as PCs, PDAs, mobile or traditional phones due to its capability of representing data in vocal manner. Its main purpose is to provide a platform for collaboration between university students and teachers in away that enhances students¿ access to educational resources and their overall learning experience. This is …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Knowledge-based Service Creation and Execution Framework for Adapting Composite Wireless IP Services",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-74161-1_29",
            "Abstract": "Wireless services infrastructures beyond 3G are evolving into highly complex and heterogeneous network environments embracing a multitude of different wireless internet access technologies, terminal types and capabilities, different bearer services, core/access network configurations, along with a wide range of application-related functions. Further to this reality, service operators are confronted with increasingly demanding users, becoming more and more aware of their needs. Thus, the main objective of this research work is to pave the way to novel service creation and execution systems beyond 3G, allowing the mobile user to build her/his own highly personalised composite wireless services.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Privacy-Preserving Text Labelling Through Crowdsourcing",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-79157-5_35",
            "Abstract": "The extensive use of online social media has highlighted the importance of privacy in the digital space. As more scientists analyse the data created in these platforms, privacy concerns have extended to data usage within the academia. Although text analysis is a well documented topic in academic literature with a multitude of applications, ensuring privacy of user-generated content has been overlooked. In an effort to reduce the exposure of online users’ information, we propose a privacy-preserving text labelling method for varying applications, based in crowdsourcing. We transform text with different levels of privacy and analyse the effectiveness of the transformation with regards to label correlation. To demonstrate the adaptive nature of our approach we also employ a TF/IDF filtering transformation. Our results suggest that total privacy can be implemented in labelling, retaining the annotational diversity and …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The challenge of improving credibility of user-generated content in online social networks",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2899003",
            "Abstract": "In every environment of information exchange, Information Quality (IQ) is considered one of the most important issues. Studies in Online Social Networks (OSNs) analyze a number of related subjects that span both theoretical and practical aspects, from data quality identification and simple attribute classification to quality assessment models for various social environments. Among several factors that affect information quality in online social networks is the credibility of user-generated content. To address this challenge, some proposed solutions include community-based evaluation and labeling of user-generated content in terms of accuracy, clarity, and timeliness, along with well-established real-time data mining techniques.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:XiVPGOgt02cC",
            "Publisher": "ACM"
        },
        {
            "Title": "Estimating the size and evolution of categorised topics in web directories",
            "Publication year": 2010,
            "Publication url": "https://content.iospress.com/articles/web-intelligence-and-agent-systems-an-international-journal/wia179",
            "Abstract": "In this paper a statistical approach for estimating the evolution of categorized web page populations in web directories is proposed. The proposal is based on the capture-recapture method used in wildlife biological studies and it is modified according to the necessary assumptions and amendments for conducting the experiments on the web. During these experiments, web pages are likened to animals and the specific categories of web pages are likened to particular species of animals whose abundance, birth and survival rates are estimated. The capture-recapture model followed is a model that allows us to consider the populations under study as open. Thus, in the course of time the population evolves, meaning that new web pages are inserted in the study, while others are removed or become inactive, resembling the natural processes of migration or death. Artificial intelligence classifiers, capable of …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Social Media Use in Higher Education: A Review",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/361176",
            "Abstract": "Nowadays, social networks incessantly influence the lives of young people. Apart from entertainment and informational purposes, social networks have penetrated many fields of educational practices and processes. This review tries to highlight the use of social networks in higher education, as well as points out some factors involved. Moreover, through a literature review of related articles, we aim at providing insights into social network influences with regard to (a) the learning processes (support, educational processes, communication and collaboration enhancement, academic performance) from the side of students and educators;(b) the users’ personality profile and learning style;(c) the social networks as online learning platforms (LMS—learning management system); and (d) their use in higher education. The conclusions reveal positive impacts in all of the above dimensions, thus indicating that the wider future use of online social networks (OSNs) in higher education is quite promising. However, teachers and higher education institutions have not yet been highly activated towards faster online social networks’(OSN) exploitation in their activities. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:evX43VCCuoAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Tile Based Wavefront Parallelism in HEVC",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9248441/",
            "Abstract": "High Efficiency Video Coding (HEVC) was developed to tackle the 4K resolution era, achieving up to 50% more compression efficiency (for the same video quality) compared to its predecessor H.264/AVC. However, this performance improvement comes at the expense of increased coding time. In order to ameliorate the situation, HEVC provides three coarse grained parallelization primitives namely: slices, tiles and wave front. Due to the higher overhead incurred by slice parallelism, most related studies in the literature focused on exploring tile and wave front parallelism as standalone mechanisms, or in combination with other finer grained approaches such as SIMD instructions. Nevertheless, the possibility of combining wave front and tile parallelism in order to speed up the encoding process was typically overlooked. In this paper we propose and evaluate a multi-threaded approach for coarse grained parallel …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:ipzZ9siozwsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fair TDMA scheduling in wireless multihop networks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-010-9397-9",
            "Abstract": "In wireless multihop networks, communication between two end-nodes is carried out by hopping over multiple wireless links. However, the fact that each node has to transmit not only its own traffic, but also traffic on behalf of other nodes, leads to unfairness among the communication rates of the nodes. Traditional Carrier Sense Multiple Access/Collision Avoidance (CSMA/CA) based media access control does not work satisfactory in a multihop scenario, since an intended target of a communication may be subject to mutual interference imposed by concurrent transmissions from nodes, which cannot directly sense each other, thus causing unfair throughput allocation. Although Time Division Multiple Access (TDMA) seems to be a more promising solution, careful transmission scheduling is needed in order to achieve error-free communication and fairness. Several algorithms may be found in the literature for …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Enhancing user privacy in adaptive web sites with client-side user profiles",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4724868/",
            "Abstract": "Web personalization is an elegant and flexible process of making a web site responsive to the unique needs of each individual user. Data that reflects user preferences and likings, comprising therefore a user profile, are gathered to an adaptive web site in a non transparent manner. This situation however raises serious privacy concerns to the end user. When browsing aweb site, users are not aware of several important privacy parameters i.e., which behavior will be monitored and logged, how it will be processed, how long it will be kept, and with whom it will be shared in the long run. In this paper we propose an abstract architecture that enhances user privacy during interaction with adaptive web sites. This architecture enables users to create and update their personal privacy preferences for the adaptive web sites they visit by holding their (user) profiles in the client side instead of the server side. By doing so …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Information fusion meta-search interface for precise photo acquisition on the web",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1225373/",
            "Abstract": "Nowadays most Web pages contain both text and images. Nevertheless, search engines index documents based on their disseminated content or their meta-tags only. Although many search engines offer image search, this service is based over textual information filtering and retrieval. Thus, in order to facilitate effective search for images on the Web, text analysis and image processing must work in complement. We present an enhanced information fusion version of the meta-search engine proposed in [Anagnostopoulos .I et al., (2002)], which utilizes up to 9 known search engines simultaneously for content information retrieval while 3 of them can be used for image processing in parallel. In particular this proposed meta-search engine is combined with fuzzy logic rules and a neural network in order to provide an additional search service for human photos in the Web.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient big data analysis on a single machine using apache spark and self-organizing map libraries",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8022657/",
            "Abstract": "Apache Spark is commonly used as a big data analytical platform on powerful computer clusters, as it primarily employ the main computer memory for the evaluation. Our attempt adds self-organizing map software libraries onto a single big data analytical stack and is efficient and fast enough even on a standard single computer. This innovative approach brings the big data analysis to researchers with limited resources. Our genuine idea was experimentally confirmed and is described here. As a case study for our method we we used the available #Brexit data and the sentiment analysis of corresponding tweets and the correlation with the stock exchange data.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Biological-inspired algorithms for dynamic search in web graphs",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983954/",
            "Abstract": "We propose a biological-inspired algorithmic procedure for improving the precision level in respect to a web user's query. This algorithm is capable of tracing relevant information in web graphs, imitating the mission of foraging ants. Our proposal is an Ant Colony Optimization (ACO) modification, however its differentiation lies in the fact that no predefined graph is employed, since the search graph is dynamically constructed during the algorithm execution. Despite some weaknesses in terms of time execution, it was evaluated that the effectiveness of the algorithm was quite satisfying in large web graph sets.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lifespan and propagation of information in On-line Social Networks a Case Study",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1403.1486",
            "Abstract": "Since 1950, information flows have been in the centre of scientific research. Up until internet penetration in the late 90s, these studies were based over traditional offline social networks. Several observations in offline information flows studies, such as two-step flow of communication and the importance of weak ties, were verified in several online studies, showing that the diffused information flows from one Online Social Network (OSN) to several others. Within that flow, information is shared to and reproduced by the users of each network. Furthermore, the original content is enhanced or weakened according to its topic, the dynamic and exposure of each OSNs. In such a concept, each OSN is considered a layer of information flows that interacts with each other. In this paper, we examine such flows in several social networks, as well as their diffusion and lifespan across multiple OSNs, in terms of user-generated content. Our results verify the perception of content and information connection in various OSNs.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Wisconsin breast cancer problem: Diagnosis and TTR/DFS time prognosis using probabilistic and generalised regression information classifiers",
            "Publication year": 2006,
            "Publication url": "https://www.spandidos-publications.com/10.3892/or.15.4.975",
            "Abstract": "This study addresses the breast cancer diagnosis and prognosis problem by employing two neural network architectures with the Wisconsin diagnostic and prognostic breast cancer (WDBC/WPBC) datasets. A probabilistic approach is dedicated to solve the diagnosis problem, detecting malignancy among cases (instances) as derived from fine needle aspirate (FNA) tests, while the second architecture estimates the time interval that possibly contains the right endpoint of disease-free survival (DFS) of the patient. The accuracy of the neural classifiers reaches nearly 98% for the diagnosis and 93% for the prognosis problem, while the prognostic recurrence predictions were evaluated using survival analysis through the Kaplan-Meier approximation method. Both architectures were compared with other similar approaches. The robustness and real-time response of the proposed classifiers were further tested over the …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Spandidos Publications"
        },
        {
            "Title": "The eLOD Ontology: Modeling Economic Open Data",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-44944-9_11",
            "Abstract": "For decades, valuable economic data was out of reach for most of the people. Gradually, public budgets and tenders are becoming openly available and global initiatives promote financial transparency and data innovation. But, yet the poor quality of open data undermines their potential to answer interesting questions (e.g. efficiency of public funds and market processes). The eLOD ontology has been initiated as a top-level conceptualization that interlinks the publicly available economic open data by modelling the flows incorporated in public procurement together with the market process to address complex policy issues. This paper presents the basic aspects of eLOD ontology in interlinking and querying diverse open data ranging from budget execution to prices. Already, eLOD ontology is used by two EU projects in order to to develop new systems, to enable information exchange between systems, to …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:HE397vMXCloC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Real time enhanced random sampling of online social networks",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804513002592",
            "Abstract": "Social graphs can be easily extracted from Online Social Networks (OSNs). However, as the size and evolution of this kind of networks increases over time, conventional sampling methods used to evaluate large graph information cannot accurately project network properties. Furthermore, in an attempt to deal with ever increasing access and possible malicious incidents (e.g. Denial of Services), OSNs introduce access limitations for their data, making the crawling/sampling process even harder. A novel approach on random sampling is proposed, considering both limitations set from OSNs and resources available. We evaluate our proposal with 4 different settings on 14 different test graphs, crawled directly from Twitter. Additionally, we test our methods in various graphs from Stanford Network Analysis Project Collection. Results show that every scenario needs a different approach. Conventional Random Node …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:NhqRSupF_l8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "BRWM: A relevance feedback mechanism for web page clustering",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_6",
            "Abstract": "This paper describes an information system, which classifies web pages in specific categories according to a proposed relevance feedback mechanism. The proposed relevance feedback mechanism is called Balanced Relevance Weighting Mechanism — BRWM and uses the proportion of the already relevant categorized information amount for feature classification. Experimental measurements over an e-commerce framework, which describes the fundamental phases of web commercial transactions verified the robustness of using the mechanism on real data. Except from revealing the accomplished sequences in a web commerce transaction, the system can be used as an assistant and consultation tool for classification purposes. In addition, BRWM was compared with a similar relevance feedback mechanism from the literature over the established corpus of Reuters-21578 text categorization test …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Channel Allocation Handoff Schemes for Cellular Wireless Networks: an overview",
            "Publication year": 2005,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:08ZZubdj9fEC",
            "Publisher": "Lulu. com"
        },
        {
            "Title": "Integrating RFID on event-based hemispheric imaging for internet of things assistive applications",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1839294.1839367",
            "Abstract": "Automatic surveillance of a scene in a broad sense comprises one of the core modules of pervasive applications. Typically, multiple cameras are installed in an area to identify events through image processing techniques, which however present limitations in terms of object occlusion, noise, lighting conditions, image resolution and computational cost. To overcome such limitations and increase recognition accuracy, the video sensor output can be complemented by Radio Frequency Identification technology, which is ideal for the unique identification of objects. In this paper we examine the feasibility of integrating RFID with hemispheric imaging video cameras. After a brief description and discussion of related research regarding RFID location, video surveillance and their integration, we examine the factors that would render such a system feasible in terms of hardware, software and their environments. The …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cache adaptation of internet services and user modelling for improving ranking precision in third-party results",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4414398/",
            "Abstract": "This paper proposes a meta-search algorithm, which adapts to the user browsing behavior during his search sessions. In parallel, the algorithm is capable of monitoring the ability of its third-party search services in terms of refreshing and updating the content of their indexes. The algorithm uses five well known Web search services namely AltaVista, Google, Lycos, MSN, and Yahoo!. The assessments made verified the robustness of our proposal, since we measured a significant improvement in the precision of the unified third-party results, especially for the lower recall levels where the user explores the top-ranked information. In addition, through capture recapture experiments we observed that Google, MSN and Yahoo! managed to adapt more adequately in the incessant evolution of the web, since they achieved higher freshness rates, managing in parallel to provide more validated active results to the end users.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An intelligent system for automated breast cancer diagnosis and prognosis using SVM based classifiers",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s10489-007-0073-z",
            "Abstract": " In recent years, computational diagnostic tools and artificial intelligence techniques provide automated procedures for objective judgments by making use of quantitative measures and machine learning techniques. In this paper we propose a Support Vector Machines (SVMs) based classifier in comparison with Bayesian classifiers and Artificial Neural Networks for the prognosis and diagnosis of breast cancer disease. The paper provides the implementation details along with the corresponding results for all the assessed classifiers. Several comparative studies have been carried out concerning both the prognosis and diagnosis problem demonstrating the superiority of the proposed SVM algorithm in terms of sensitivity, specificity and accuracy. ",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "A man-machine meta-search interface, for handling multiple query submissions in web search services",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.530.1647&rep=rep1&type=pdf",
            "Abstract": "Nowadays it is commonly accepted that the web is structured in a chaotic way. Due to the fact that it grows exponentially, it is a difficult task to efficiently locate specific information. This paper presents a Userdefined Meta-Search Engine (UMSE), capable to handle multiple queries in web search services. UMSE utilises up to 10 known search engines according to a user-defined ranking, submits its queries in parallel and finally presents the merging results back to the user. The anticipated outcome of using UMSE is that the user gets enhanced amount of information, recording in parallel his search preferences. UMSE also supports history features in order to personalise user queries and facilitate information retrieval.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Joint routing and per-flow fairness in wireless multihop networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4556301/",
            "Abstract": "In wireless multihop networks communication between two end-nodes is carried out by hopping over multiple short wireless links. Traditional CSMA/CA based media access control does not work satisfactory in a multihop scenario, since an intended target of a communication may be subject to mutual interference imposed by concurrent transmissions from nodes which cannot directly sense each other, causing unfair throughput allocation. Although TDMA seems to be a more promising solution, careful transmission scheduling is needed in order to achieve error-free communication and fairness. In our previous work, a TDMA scheduling algorithm has been proposed that schedules the transmissions in a fair manner and takes into account the communication requirements of the active flows of the network. In this paper, in order to further improve this scheme, we combine the TDMA scheduling algorithm with two …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A probabilistic neural network for face detection on segmented skin areas based on fuzzy rules",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1014642/",
            "Abstract": "In this paper, the problem of face detection in color images is addressed. Unlike in face recognition, where the classes to be discriminated are different faces, in face detection, the two classes to be discriminated are \"face area\" and \"non-face area\". A novel approach to face detection is presented, which is based on a probabilistic neural network (PNN) specially trained for the identification of faces from skin areas within the image plane, which were previously located using fuzzy logic rules. The performance of the whole system was tested using 137 color image scenes with various illumination conditions containing human faces. The images were taken with a common digital camera, at a resolution of 1280/spl times/960 pixels. The PNN coupled with the fuzzy logic rules become the basis for developing a computer-based face detection system, whose overall identification performance was 85.2%. One limitation of …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing Fairness in Wireless Multi-Hop Networks",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/53499965/Enhancing_fairness_in_wireless_multi-hop20170614-23165-1ikk0yv.pdf",
            "Abstract": "Wireless multi-hop networks have recently been conceived as a networking paradigm. However, their deployment has been limited, mainly due to the fact that they lack fairness. In this research effort, we briefly review the state of art in fairness mechanisms in multi-hop networks and we propose an algorithm that tries to differentiate the traffic among the connections in a wireless multi-hop ad-hoc sensor network, so that the fairness is enhanced. This is achieved by an adaptive scheme, which tries to assign a higher priority to the traffic connections that experience delay greatly larger than the average, so that their delay is reduced, and the fairness of the system is improved.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mining and Linking Open Economic Data from Governmental Communities",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-92375-8_12",
            "Abstract": " In this paper, we propose a model conceptualization (Linked Open Economy - LOE) capable of exploiting the massive amount and variety of open economic data that are gradually becoming available by governments and open source communities. The main aim is to unleash the power of open data and open source systems and create a common ground to serve as a catalyst in providing more efficient answers in important economic activities. ",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:NJ774b8OgUMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Health Care Web Information Systems and Personalized Services for Assisting Living of Elderly People at Nursing Homes",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11684-1_9",
            "Abstract": "Nursing homes, where home adaptations - environmental improvements and assistive technology (AT) are provided, represent an increasingly attractive means of helping senior citizens maintain their independence and enhance the quality of their life. Doctors and specialists are also involved in order to provide elderly people with personalized health care services, in this way improving their treatment and life conditions. The main difference that nursing homes have compared to a typical health home is that the former use new technologies and applications in order to collect data from the elderly and create an electronic file for each individual. The basic idea of this paper is to use a web application along with tablet PCs or PDAs in order to collect the personal information and the clinical characteristics of the patient. Moreover, this application helps doctors manage the nursing home and have a better view of …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Thematic labeling of Twitter accounts using DBpedia properties",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7753393/",
            "Abstract": "In this paper, we propose an iterative algorithm towards the automatic labeling of Twitter accounts in respect to thematic categories derived from DBpedia properties. We describe the rationale behind the selection of these thematic categories, and discuss their evaluation assessment. Finally, we propose and analyze two generic and adaptable methodologies for discovering the necessary linked data resources for further enhancing the thematic description of Twitter accounts.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic Hyper/multimedia Adaptation: Schemes and Applications",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=moG5BQAAQBAJ&oi=fnd&pg=PP2&dq=info:U5EEAOnOCJAJ:scholar.google.com&ots=LDXUFYbTJ7&sig=MnEEXL-5RV1DDkrVL9rDp7L_Z7U",
            "Abstract": "Nowadays, more and more users are witnessing the impact of Hypermedia/Multimedia as well as the penetration of social applications in their life. Parallel to the evolution of the Internet and Web, several Hypermedia/Multimedia schemes and technologies bring semantic-based intelligent, personalized and adaptive services to the end users. More and more techniques are applied in media systems in order to be user/group-centric, adapting to different content and context features of a single or a community user. In respect to all the above, researchers need to explore and study the plethora of challenges that emergent personalisation and adaptation technologies bring to the new era. This edited volume aims to increase the awareness of researchers in this area. All contributions provide an in-depth investigation on research and deployment issues, regarding already introduced schemes and applications in Semantic Hyper/Multimedia and Social Media Adaptation. Moreover, the authors provide survey-based articles, so as potential readers can use it for catching up the recent trends and applications in respect to the relevant literature. Finally, the authors discuss and present their approach in the respective field or problem addressed.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Public spending: Interconnecting and visualizing greek public expenditure following linked open data directives",
            "Publication year": 2012,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2064517",
            "Abstract": "The provision of publicly available open data leads to transparency in several public sector exchanges, spending and decisions. However, this information is served massively and heterogeneously-mostly due to different bureaucratic procedures and paperwork formats, while its diffusion does not occur at regular or at least generally predictable time intervals. Thus, even though the information is available by the involved public sectors, enterprises and citizens are overwhelmed from the size/inconsistency of the information they deal with. The scope of our publicly accessible Web point is two-fold. Firstly, it aims to promote clarity and enhance citizen awareness regarding public spending in Greece through easily consumed visualization diagrams. Information provision is based on semantic processing of real-time open data provided by Greek government ('Diavgia') and the Greek Taxation Information System. Secondly, a proposed ontology for public spending in Greece functions in two distinct levels. It checks the validity of the publicly available data accessed by the system, cleaning and reconstructing in parallel false entries, while it will interconnect the data to existing ontological and data schemes derived from other similar initiatives worldwide and core vocabularies.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network Analysis in the Legal Domain: A complex model for European Union legal sources",
            "Publication year": 2018,
            "Publication url": "https://academic.oup.com/comnet/article-abstract/6/2/243/4071249",
            "Abstract": "Legislators, designers of legal information systems, as well as citizens face often problems due to the interdependence of the laws and the growing number of references needed to interpret them. In this article, we introduce the ‘Legislation Network’ (LN) as a novel approach to address several quite challenging issues for identifying and quantifying the complexity inside the Legal Domain. We have collected an extensive data set of a more than 60-year old legislation corpus, as published in the Official Journal of the European Union, and we further analysed it as a complex network, thus gaining insight into its topological structure. Among other issues, we have performed a temporal analysis of the evolution of the LN, as well as a robust resilience test to assess its vulnerability under specific cases that may lead to possible breakdowns. Results are quite promising, showing that our approach can lead towards an …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Privacy-Preserving Text Labelling Through Crowdsourcing",
            "Publication year": 2021,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=oTQ1EAAAQBAJ&oi=fnd&pg=PA431&dq=info:CBhw5Qn40JIJ:scholar.google.com&ots=1CH-r1LZRj&sig=dDNncXr91wSt90LycEA4xqJ2kg0",
            "Abstract": "The extensive use of online social media has highlighted the importance of privacy in the digital space. As more scientists analyse the data created in these platforms, privacy concerns have extended to data usage within the academia. Although text analysis is a well documented topic in academic literature with a multitude of applications, ensuring privacy of user-generated content has been overlooked. In an effort to reduce the exposure of online users’ information, we propose a privacy-preserving text labelling method for varying applications, based in crowdsourcing. We transform text with different levels of privacy and analyse the effectiveness of the transformation with regards to label correlation. To demonstrate the adaptive nature of our approach we also employ a TF/IDF filtering transformation. Our results suggest that total privacy can be implemented in labelling, retaining the annotational diversity and subjectivity of traditional labelling. The privacy-preserving labelling, with the use of NRC lexicon, demonstrates an average 0.11 Mean Spearman’s Rho correlation, boosted to 0.124 with TF/IDF filtering.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Remote experiments in education: A survey over different platforms and application fields",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4602519/",
            "Abstract": "Distance education as well as remote experimentation, is a modern field that aims to deliver education to students who are not physically present on their class or their testbed instrumentation. Nowadays, more and more students and educators/instructors rather than attending courses in person, communicate with the educational material at times of their own through Internet-based technologies and services that allows them to interact in real time or in an asynchronous mode. Remote access is simplified, since Internet allows computer users to connect to other computers and information is stored and processed easily, wherever they may be across the world. This paper provides a straightforward categorization of remote experimentations in education according to the platform used as the medium for conducting the experiments and the scientific field in which they apply to. This contribution aims to be a starting point …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Crowd Sourcing as an Improvement of N-Grams Text Document Classification Algorithm",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9248454/",
            "Abstract": "A common task in a world of natural language processing is text classification useful for e.g. spam filters, documents sorting, science articles classification or plagiarism detection. This can still be done best and most accurately by human, on the other hand, we can of ten accept certain error in the classification in exchange for its speed. Here, natural language processing mechanism transforms the text in natural language to a form understandable by a classifier such as K-Nearest Neighbour, Decision Trees, Artificial Neural Network or Support Vector Machines. We can also use this human element to help automated classification to improve its accuracy by means of crowdsourcing. This work deals with classification of text documents and its improvement through crowdsourcing. Its goal is to design and implement text documents classifier prototype based on documents similarity and to design evaluation and …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:uc_IGeMz5qoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RuleMR: Classification rule discovery with MapReduce",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7004440/",
            "Abstract": "The vast amounts of data generated, exchanged and consumed on a daily basis by contemporary networks and devices renders their analysis a cumbersome procedure with inherent difficulties. On the one hand, the need for efficient Machine Learning algorithms and tools that scale on large datasets is continuously growing. On the other, parallel or distributed solutions have proven to conceal many pitfalls. The MapReduce programming model has quickly emerged as the de facto model for executing simple algorithmic tasks over huge volumes of data, since it is simple, highly abstract and efficient. However, due to its unidirectional communication model and the inherent lack of support for iterative execution, few Machine Learning algorithms can easily be implemented on MapReduce. In this paper, we present a classification rule discovery algorithm, namely RuleMR, which despite its iterative nature, can capitalize …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measuring the population of web pages in the wild web",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/43316183/MEASURING_THE_POPULATION_OF_WEB_PAGES_IN20160303-31691-vyv0fk.pdf",
            "Abstract": "This paper describes a system capable of measuring the type of pages in the wild WEB. The system uses as theoretical background the capture–recapture methodology, which is mainly used for statistical purposes in other scientific areas. The problem addressed may be compared to the context of capture–recapture experiments used in wildlife biological studies. The novelty in the proposed method stands in the fact that the experiment takes place in the wild WEB and instead of animal species, the measurements concern several types of WEB pages.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Lifespan and propagation of information in On-line Social Networks: A case study based on Reddit",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804515001307",
            "Abstract": "Since 1950, information flows have been in the center of scientific research. Up until the Internet penetration in the late 1990s, these information flow studies were based on traditional offline social networks. From the first Online Social Network studies, various observations of “offline” information flows, such as the two-step flow of communication and the importance of weak ties, were verified in several “online” studies, also indicating that information flows from one Online Social Network (OSN) to several others. Within that flow, information is shared with and reproduced, by users of each network. Furthermore, the original content is enhanced or weakened according to its topic, as well as the dynamic nature and exposure of each Online Social Networks (OSNs). In such an informational connected environment, each OSN is considered as a layer of information flows, which interacts with other layers. We examine …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Public spending as LOD: the case of Greece",
            "Publication year": 2013,
            "Publication url": "https://content.iospress.com/articles/semantic-web/sw155",
            "Abstract": "The Public Spending (PS) project is the first attempt to generate, curate, interlink and distribute daily updated public spending data in LOD formats that can be useful to both expert (ie scientists and professionals) and naïve users. The PS ontology is based on the UK payments ontology and reuses, among others, the W3C Registered Organization Vocabulary and the Core Business Vocabulary. RDFized data are linked to product classifications, Geonames and DBpedia resources. Online services contain advanced search features and domain level information (eg local government), simple and complex visualizations based on network analysis, linked information about payment entities and SPARQL endpoints. During February 2013, the growing dataset consists of approximately 2 million payment decisions valued 44.5 billion euros forming 65 million triples.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Viral content propagation in Online Social Networks",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1712.02245",
            "Abstract": "Information flows are the result of a constant exchange in Online Social Networks (OSNs). OSN users create and share varying types of information in real-time throughout a day. Virality is introduced as a term to describe information that reaches a wide audience within a small time-frame. As a case, we measure propagation of information submitted in Reddit, identify different patterns and present a multi OSN diffusion analysis on Twitter, Facebook, and 2 hosting domains for images and multimedia, ImgUr and YouTube. Our results indicate that positive content is the most shared and presents the highest virality probability, and the overall virality probability of user created information is low. Finally, we underline the problems of limited access in OSN data. Keywords: Online Social Networks, Virality, Diffusion, Viral Content, Reddit, Twitter, Facebook, ImgUr, YouTube",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trust management framework for intelligent agent negotiations in ubiquitous computing environments",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-009-9155-z",
            "Abstract": "In dynamic ubiquitous computing environments, system entities may be classified into two main categories that are, in principle, in conflict. These are the Service Resource Requestors (SRRs) wishing to use services and/or exploit resources offered by the other system entities and the Service Resource Providers (SRPs) that offer the services/resources requested. Seeking for the maximisation of their welfare, while achieving their own goals and aims, entities may misbehave (intentionally or unintentionally), thus, leading to a significant deterioration of system’s performance. In this study, a reputation mechanism is proposed which helps estimating SRPs trustworthiness and predicting their future behaviour, taking into account their past performance in consistently satisfying SRRs’ expectations. Thereafter, under the assumption that a number of SRPs may handle the SRRs requests, the SRRs may decide on …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:ye4kPcJQO24C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Bridging the syntactic and the semantic web search",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11840930_11",
            "Abstract": "This paper proposes an information system, which aims to bridge the semantic gap in web search. The system uses multiple domain ontological structures expanding the user’s query with semantically related concepts, enhancing in parallel the quality of retrieval to a large extend. Query analyzers broaden the user’s information needs from classical term-based to conceptually representations, using knowledge from relevant ontologies and theirs’ properties. Besides the use of semantics, the system employs machine learning techniques from the field of swarm intelligence through the Ant Colony algorithm, where ants are considered as web agents capable of collecting and processing relevant information. Furthermore, the effectiveness of the approach is verified experimentally, by observing that the retrieval precision for the enhanced queries is in higher levels, in comparison with the results derived from …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Monitoring the Internet evolution adaptation in heavily-visited search services",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4413938/",
            "Abstract": "This paper proposes an innovative method of monitoring the ability of Internet search services to maintain new and up-to-date results in their directories. The method is based on capture-recapture experiments performed in real wildlife biological studies. After the necessary modifications needed for conducting similar experiments on the Web, a sixteen-week period of capture-recapture experiments was made over the caches of Google and MSN. During this period the birth as well as the survival rates of Google's and MSN's cached results were estimated based on the Pollock's robust design method. The paper provides the implementation details of the applied model along with its initial assessment. The experimental results showed that this approach can be applied as a method for measuring the ability of Internet search services in terms of maintaining new and up-to-date results in their caches.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Revealing Paths of Relevant Information in Web Graphs",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent modification for the daltonization process of digitized paintings",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=16998645365051600332&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:bnK-pcrLprsC",
            "Publisher": "University of Bielefeld"
        },
        {
            "Title": "A support vector machine approach to breast cancer diagnosis and prognosis",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_58",
            "Abstract": "In recent years, computational diagnostic tools and artificial intelligence techniques provide automated procedures for objective judgments by making use of quantitative measures and machine learning. The paper presents a Support Vector Machine (SVM) approach for the prognosis and diagnosis of breast cancer implemented on the Wisconsin Diagnostic Breast Cancer (WDBC) and the Wisconsin Prognostic Breast Cancer (WPBC) datasets found in literature. The SVM algorithm performs excellently in both problems for the case study datasets, exhibiting high accuracy, sensitivity and specificity indices.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "A Holistic Approach for Modelling, Managing and Mining Legal Sources",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=12653563156234268411&hl=en&oi=scholarr",
            "Abstract": "Recently there has been an exponential growth of the number of publicly available legal resources. Portals allowing users to search legal documents, through keyword queries, are now widespread. However, legal documents are mainly stored and offered in different sources and formats that do not facilitate semantic machine-readable techniques, thus making difficult for legal stakeholders to acquire, modify or interlink legal knowledge. In this paper, we describe Solon, a legal document management platform. It offers advanced modelling, managing and mining functions over legal sources, so as to facilitate access to legal knowledge. It utilizes a novel method for extracting semantic representations of legal sources from unstructured formats, such as PDF and HTML text files, interlinking and enhancing them with classification features. At the same time, utilizing the structure and specific features of legal sources, it …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Call admission control and QOS in wireless ATM networks",
            "Publication year": 2002,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16580760",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D04 Telecommunications and information theory/001D04B Telecommunications/001D04B02 Systems, networks and services of telecommunications/001D04B02G Transmission and modulation (techniques and equipments)",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time-to-Recur Measurements in Breast Cancer Microscopic Disease Instances",
            "Publication year": 2005,
            "Publication url": "https://www.imeko.org/publications/tc4-2005/IMEKO-TC4-2005-055.pdf",
            "Abstract": "In this paper we present an overview of survival curves measurements using the Kaplan-Meier approximation method. The survival curves were constructed upon the decision of an artificial neural network, which estimates the time-to-recur (TTR) in patients who presented malignant breast tumours with no evidence of distant metastases at the time of diagnosis. For our work we used the Wisconsin Prognostic Breast Cancer (WPBC) data set. The measurements taken over actual data evaluated that the accuracy of our proposed decision system is in high levels and can be used for the breast cancer prognosis problem.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementing an Internet Image Search Service Based on the AJAX Web Programming Techniques",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-76361_5",
            "Abstract": "Due to the extremely rapid growth of the web, search engines cannot spider all the new pages at the same time or with the same priority. Besides, the search engines index their catalogues with different algorithms, having as a result, different response time in updating their directories. Consequently, the user may lose some useful information resources if he chooses to use only one search service. Thus, the user has to resubmit his queries to more search engines, adding in this way, to a process that is already time-consuming [11]. Using a meta-search engine, additional information is provided, without the need to know the query language for the search services that contribute to the search. However, in this kind of retrieval a large amount of inappropriate and useless information is often returned to the user, especially when requiring images.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Estimating evolution of freshness in Internet cache directories under the capture-recapture methodology",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128609002977",
            "Abstract": "In this paper, we describe a new web sampling scheme for measuring the evolution of freshness in search engines. The methodology used is the capture–recapture, which is mainly applied for estimating evolution rates in wildlife biological studies. After modifications and amendments, necessary for web paradigm application, we conducted three capture–recapture experiments of different duration over the caches of Google and MSN. In parallel, we used a typical sampling scheme, similar to many other web sampling approaches used in the literature, to evaluate the robustness of our proposal. The paper provides the implementation details of a web-based capture–recapture model along with its assessment. The results show that through the capture–recapture methodology we are able not only to measure the freshness of the tested search services but also to monitor its evolution over time, with a substantially …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Neural networks for routing optimization in wideband networks",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=5358096065248105983&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solon: A Holistic Approach for Modelling, Managing and Mining Legal Sources",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/374782",
            "Abstract": "Recently there has been an exponential growth of the number of publicly available legal resources. Portals allowing users to search legal documents, through keyword queries, are now widespread. However, legal documents are mainly stored and offered in different sources and formats that do not facilitate semantic machine-readable techniques, thus making difficult for legal stakeholders to acquire, modify or interlink legal knowledge. In this paper, we describe Solon, a legal document management platform. It offers advanced modelling, managing and mining functions over legal sources, so as to facilitate access to legal knowledge. It utilizes a novel method for extracting semantic representations of legal sources from unstructured formats, such as PDF and HTML text files, interlinking and enhancing them with classification features. At the same time, utilizing the structure and specific features of legal sources, it provides refined search results. Finally, it allows users to connect and explore legal resources according to their individual needs. To demonstrate the applicability and usefulness of our approach, Solon has been successfully deployed in a public sector production environment, making Greek tax legislation easily accessible to the public. Opening up legislation in this way will help increase transparency and make governments more accountable to citizens. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A Personalized Audio Server using MPEG-7 and MPEG-21 standards",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5706844/",
            "Abstract": "This paper presents a semantic model which delivers personalized audio information. The personalization process is automated and decentralized. The metadata which support personalization are separated in two categories: the metadata describing user preferences stored at each user and the resource adaptation metadata stored at the server. The multimedia models MPEG-21 and MPEG-7 are used to describe metadata information. The Web Ontology Language (OWL) language is used to produce and manipulate the relative ontological descriptions.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Socio-semantic query expansion using Twitter hashtags",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6406845/",
            "Abstract": "In this paper we introduce an algorithmic approach, capable of creating a semantic network with concatenated terms and phrases (hash tags) from collectively postings on the Twitter sphere. This network could be exploited for query expansion provision in respect to users' information needs, without considering any other prior knowledge or access in search logs or browsing history records. For evaluation purposes, we compare our query expansion approach algorithm with query suggestions provided by well-known search engines and mainstream media services (e.g. Google, Yahoo!, Bing, NBC and Reuters), as well as by enrolling a team of human editors, who provided subjective comparisons in respect to the Google Hot Searches service. The results are quite promising, showing that our proposal semantically expands the user's initial query with related terms adapted to social trends and knowledge.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Diversifying the Legal Order",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-44944-9_44",
            "Abstract": "“Public legal information from all countries and international institutions is part of the common heritage of humanity. Maximizing access to this information promotes justice and the rule of law.” In accordance with the aforementioned declaration on Free Access to Law by Legal information institutes of the world (                   http://www.worldlii.org/worldlii/declaration/                                    ), a plethora of legal information is available through the Internet, while the provision of legal information has never before been easier. Given that law is accessed by a much wider group of people, the majority of whom are not legally trained or qualified, diversification techniques, should be employed in the context of legal information retrieval, as to increase user satisfaction. We address diversification of results in legal search by adopting several state of the art methods from the web search domain. We provide an exhaustive …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Semantic hyper/multi-media adaptation: Schemes and applications",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=moG5BQAAQBAJ&oi=fnd&pg=PP2&dq=info:U5EEAOnOCJAJ:scholar.google.com&ots=LDXUFYbTJa&sig=Axip7vAnMzopaNDTwNg5n1a6GeI",
            "Abstract": "Nowadays, more and more users are witnessing the impact of Hypermedia/Multimedia as well as the penetration of social applications in their life. Parallel to the evolution of the Internet and Web, several Hypermedia/Multimedia schemes and technologies bring semantic-based intelligent, personalized and adaptive services to the end users. More and more techniques are applied in media systems in order to be user/group-centric, adapting to different content and context features of a single or a community user. In respect to all the above, researchers need to explore and study the plethora of challenges that emergent personalisation and adaptation technologies bring to the new era. This edited volume aims to increase the awareness of researchers in this area. All contributions provide an in-depth investigation on research and deployment issues, regarding already introduced schemes and applications in Semantic Hyper/Multimedia and Social Media Adaptation. Moreover, the authors provide survey-based articles, so as potential readers can use it for catching up the recent trends and applications in respect to the relevant literature. Finally, the authors discuss and present their approach in the respective field or problem addressed.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ensemble Deep Learning for Multilabel Binary Classification of User-Generated Content",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/679626",
            "Abstract": "Sentiment analysis usually refers to the analysis of human-generated content via a polarity filter. Affective computing deals with the exact emotions conveyed through information. Emotional information most frequently cannot be accurately described by a single emotion class. Multilabel classifiers can categorize human-generated content in multiple emotional classes. Ensemble learning can improve the statistical, computational and representation aspects of such classifiers. We present a baseline stacked ensemble and propose a weighted ensemble. Our proposed weighted ensemble can use multiple classifiers to improve classification results without hyperparameter tuning or data overfitting. We evaluate our ensemble models with two datasets. The first dataset is from Semeval2018-Task 1 and contains almost 7000 Tweets, labeled with 11 sentiment classes. The second dataset is the Toxic Comment Dataset with more than 150,000 comments, labeled with six different levels of abuse or harassment. Our results suggest that ensemble learning improves classification results by 1.5% to 5.4%. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:yB1At4FlUx8C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A pervasive Wiki application based on VoiceXML",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1389586.1389656",
            "Abstract": "In this paper, we describe the design and implementation of an audio wiki application accessible via the Public Switched Telephone Network (PSTN) and the Internet for educational purposes. The application exploits mature World Wide Web Consortium standards such as VoiceXML, Speech Synthesis Markup Language (SSML) and Speech Recognition Grammar Specification (SRGS). The purpose of such an application is to assist visually impaired, technologically uneducated, and underprivileged people in accessing information originally intended to be accessed visually via a Personal Computer. Users may access wiki content via wired or mobile phones, or via a Personal Computer using a Web Browser or a Voice over IP service. This feature promotes pervasiveness to educational material to an extremely large population, ie those who simply own a telephone line.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Query expansion with a little help from twitter",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41016-1_3",
            "Abstract": "With the advent and rapid spread of microblogging services, web information management finds a new research topic. Although classical information retrieval methods and techniques help search engines and services to present an adequate precision in lower recall levels (top-k results), the constantly evolving information needs of microblogging users demand a different approach, which has to be adapted to the dynamic nature of On-line Social Networks (OSNs). In this work, we use Twitter as microblogging service, aiming to investigate the query expansion provision that can be extracted from large graphs, and compare it against classical query expansion methods that require mainly prior knowledge, such as browsing history records or access and management of search logs. We provide a direct comparison with mainstream media services, such as Google, Yahoo!, Bing, NBC and Reuters, while we also …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Handling big data: research challenges and future directions",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11227-016-1677-z.pdf",
            "Abstract": "Today, an enormous amount of data is being continuously generated in all walks of life by all kinds of devices and systems every day. A significant portion of such data is being captured, stored, aggregated and analyzed in a systematic way without losing its “4V” (i.e., volume, velocity, variety, and veracity) characteristics. We review major drivers of big data today as well the recent trends and established platforms that offer valuable perspectives on the information stored in large and heterogeneous data sets. Then, we present a classification of some of the most important challenges when handling big data. Based on this classification, we recommend solutions that could address the identified challenges, and in addition we highlight cross-disciplinary research directions that need further investigation in the future.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:1qzjygNMrQYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Classification of e-commerce web pages using statistical descriptor vectors",
            "Publication year": 2003,
            "Publication url": "http://sa-ijas.stat.unipd.it/sites/sa-ijas.stat.unipd.it/files/91-108_0.pdf",
            "Abstract": "Nowadays, there is a huge volume of information on the web, which is disseminated to the users in a chaotic way. In order to be easily accessed, the information must be clustered and classified in appropriate knowledge areas. Thus, many heavily visited sites or Portals try to unify the access to multiple information sources, providing by this way classiﬁcation of information. This paper proposes a system, aiming to classify e-commerce web pages and sites according to their web—content. This system can be implemented for automatic knowledge segmentation in a Portal or in a search engine repository. The system performance reached 93% in the ﬁrst test sets, after the learning phase. However, relevance feedback mechanisms increase the performance significantly (up to 95%) as the number of the test sets increases",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "LinkZoo: A Collaborative Resource Management Tool Based on Linked Data",
            "Publication year": 2020,
            "Publication url": "https://www.igi-global.com/article/linkzoo/256543",
            "Abstract": "This article presents LinkZoo, a web-based, linked data enabled tool that supports collaborative management of information resources. LinkZoo addresses the modern needs of information-intensive collaboration environments to publish, manage, and share heterogeneous resources within user-driven contexts. Users create and manage diverse types of resources into common spaces such as files, web documents, people, datasets, and calendar events. They can interlink them, annotate them, and share them with other users, thus enabling collaborative editing, as well as enrich them with links to externally linked data resources. Resources are inherently modeled and published as resource description framework (RDF) and can be explicitly interlinked and dereferenced by external applications. LinkZoo supports creation of dynamic communities that enable web-based collaboration through resource sharing and …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:0KyAp5RtaNEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Legislation as a complex network: Modelling and analysis of European Union legal sources.",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=sT8oBgAAQBAJ&oi=fnd&pg=PA143&dq=info:_H7k9Jb8GqAJ:scholar.google.com&ots=Iqzr_3f48C&sig=MD01GHBWsHXLI16v8dzzbYKHmWM",
            "Abstract": "Legislators, designers of legal information systems, as well as citizens face often problems due to the interdependence of the laws and the growing number of references needed to interpret them. Quantifying this complexity is not an easy task. In this paper, we introduce the” Legislation Network” as a novel approach to address related problems. We have collected an extensive data set of a more than 60-year old legislation corpus, as published in the Official Journal of the European Union, and we further analysed it as a complex network, thus gaining insight into its topological structure. Results are quite promising, showing that our approach can lead towards an enhanced explanation in respect to the structure and evolution of legislation properties.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extended characteristic sets: graph indexing for SPARQL query optimization",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7930002/",
            "Abstract": "SPARQL query execution in state of the art RDF engines depends on, and is often limited by the underlying storage and indexing schemes. Typically, these systems exhaustively store permutations of the standard three-column triples table. However, even though RDF can give birth to datasets with loosely defined schemas, it is common for an emerging structure to appear in the data. In this paper, we introduce a novel indexing scheme for RDF data, that takes advantage of the inherent structure of triples. To this end, we define the Extended Characteristic Set (ECS), a schema abstraction that classifies triples based on the properties of their subjects and objects, and we discuss methods and algorithms for the identification and extraction of ECSs. We show how these can be used to assist query processing, and we implement axonDB, an RDF storage and querying engine based on ECS indexing. We perform an …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic query suggestion using Twitter Entities",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231215002192",
            "Abstract": "There are many web information management methods and techniques that help search engines and news services to provide useful suggestions with respect to queries, thus facilitating the users’ search. However, the penetration of microblogging services in our daily life demands to also consider social sphere as far as query suggestion is concerned. Towards this direction, we introduce an algorithmic approach capable of creating a dynamic query suggestion set, which consist of the most viral and trendy Twitter Entities (that is hashtags, user mentions and URLs) with respect to a user׳s query. For evaluation purposes, we firstly compare the results derived from two case studies, against the suggestions of popular services like Google News, Yahoo! News, Bing News, and Reuters. In addition we further evaluate our approach with subjective user ratings against Google Trends service. Finally, we provide …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A neural network and fuzzy logic system for face detection on RGB images.",
            "Publication year": 2001,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/34240",
            "Abstract": "A neural network and fuzzy logic system for face detection on RGB images Αρχική Σελίδα → \nΚεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε συνέδρια → \nΕμφάνιση Τεκμηρίου HEAL DSpace A neural network and fuzzy logic system for face detection \non RGB images Αποθετήριο DSpace/Manakin A neural network and fuzzy logic system for face \ndetection on RGB images Anagnostopoulos, C; Anagnostopoulos, I; Vergados, D; Kayafas, E; \nLoumos, V; Stassinopoulos, G URI: http://hdl.handle.net/123456789/34240 Ημερομηνία: 2001 \nΕμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο \nΠροβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο \nεμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε συνέδρια Περιήγηση Σε \nόλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα η /…",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identifying Personalization Patterns using Intelligent Techniques in XML-based communication records",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5381701/",
            "Abstract": "This position paper presents some techniques for revealing personalization and users' calling behavioral patterns by using XML-based communication records from simulations. A short description of the most common methods applied is provided, along with a case study for potential application employing real telecommunication call detail records (CDRs). Finally, we describe an intelligent architecture which is embedded in mechanisms for performing seamless media independent handover in communications, while some first results are presented and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Portrait identification in digitized paintings on the basis of a face detection system",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vLiTXDHr_sYC&oi=fnd&pg=PA351&dq=info:7GCWeyTk9nIJ:scholar.google.com&ots=CZnytt0Ekp&sig=6-d6__W_VswwAROjspjJl-mQSBw",
            "Abstract": "In this paper, the problem of automatic identification of portraits in paintings collections is addressed. A face detection approach in digital images is now implemented n digitized paintings, which is based on fuzzy logic rules especially set for detecting possible skin areas in color images. The candidate regions are then forwarded in a Probabilistic Neural Network (PNN), which is properly trained for face identification. The test sample for assessing the proposed method consists of 200 digitized paintings downloaded from the website of the State Hermitage Museum. The overall performance of the system reached 88.8%.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:geHnlv5EZngC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Acknowledgement of reviewers 2006",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=13680706746126020533&hl=en&oi=scholarr",
            "Abstract": "The Editors of this journal gratefully acknowledge the referees for their reviews which they provided this year. The list published below are the reviewers who have completed a review on EES, yet the Editor and Elsevier would also like to thank all the reviewers who completed reviews this year outside of EES.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Classifying Web pages employing a probabilistic neural network",
            "Publication year": 2004,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-sen_20040121",
            "Abstract": "The paper proposes a system capable of identifying and categorising Web pages on the basis of information filtering. The system is a three-layer probabilistic neural network (PNN) with biases and radial basis neurons in the middle layer and competitive neurons in the output layer. The domain of study involves the e-commerce area. Thus, the PNN scopes to identify e-commerce Web pages and classify them to the respective type according to a framework which describes the fundamental phases of commercial transactions in the Web. The system was tested with many types of Web pages, demonstrating the robustness of the method, since no restrictions were imposed except for the language of the content, which is English. The probabilistic classifier was used for estimating the population of specific e-commerce Web pages. Potential applications involve surveying Web activity in commercial servers, as well as …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IET"
        },
        {
            "Title": "Urban solid waste collection and routing: The ant colony strategic approach",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Karadimas/publication/228629166_Urban_Solid_Waste_Collection_and_Routing_The_Ant_Colony_Strategic_Approach/links/00463516bbc14c70de000000/Urban-Solid-Waste-Collection-and-Routing-The-Ant-Colony-Strategic-Approach.pdf",
            "Abstract": "In the present paper the Ant Colony Optimization (ACO) Algorithm is introduced for best routing identification applied in urban solid waste collection. The proposed solid waste management system is based on a geo-referenced Spatial Database supported by a Geographic Information System (GIS). The GIS takes into account all the required parameters for solid waste collection. These parameters involve static and dynamic data, such as positions of trash-cans, road network, related traffic and population density. In addition, time schedules of trash-collection workers, track capacities and technical characteristics are considered. The ACO spatiotemporal statistical analysis model is used to estimate interrelations between dynamic factors, like network traffic changes in residential and commercial areas in a 24 hour schedule, and to produce optimized solutions. The user, in the proposed system, is able to define or modify all of the required dynamic factors for the creation of an initial scenario. By modifying these particular parameters, alternative scenarios can be generated leading to several solutions. The objective of the proposed system is to identify the most cost-effective alternative scenario for waste collection and transport, to estimate its running cost and to simulate its application.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Decision support algorithms and optimization techniques for personal homecare environment",
            "Publication year": 2006,
            "Publication url": "http://medlab.cc.uoi.gr/itab2006/proceedings/eHealth/162.pdf",
            "Abstract": "In this paper, various decision support schemes are proposed evaluating the selection of different network infrastructures in terms of routing optimization and signal strength selection. Limited computational and radio communication capabilities require collaborative algorithms with energy-aware communication. Power saving makes it possible to guarantee basic levels of system performance, such as connectivity, throughput and delay, in the presence of both mobility-immobility and a large number of sensor nodes. A variety of approaches for intelligent energy-efficient schemes have been simulated over different performance metrics.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Knowledge-based Service Creation and Execution Framework for Adapting Composite Wireless IP Services",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A proposed system for segmentation of information sources in portals and search engines repositories",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1020986/",
            "Abstract": "Nowadays, there is a huge volume of information on the Web, which is disseminated to users in a chaotic way. In order to be easily accessed, the information must be clustered and classified in appropriate knowledge areas. Thus, many heavily visited sites or portals attempt to unify the access to multiple information sources, providing by this way classification of information. The paper proposes a system, aiming to classify e-commerce sites according their Web content. This system can be implemented for automatic knowledge segmentation in a portal or in a search engine repository. The system performance reached 96% in the first test sets, after the learning phase. However, the performance significantly increases (up to 98%) as the number of test sets increases.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive technologies and methods in e/m‐Learning and Internet‐based education",
            "Publication year": 2010,
            "Publication url": "https://psycnet.apa.org/record/2010-14835-001",
            "Abstract": "We are currently witnessing the remarkable impact of Internet and World Wide Web Technologies on education as a whole, which revolutionized traditional learning concepts and methodologies throughout the diffusion of more sophisticated techniques that are being developed to support new learning paradigms. Nowadays, more and more educational scenarios occur across different locations and learning contexts, where the focus is on the mobility of the educator/learner. Thus, in parallel to e-learning, mobile-learning (m-learning) takes advantage of the prospects offered by portable technologies, the Internet and web services. This special section aims to increase the awareness of researchers in the above-mentioned fields, providing an in-depth investigation on various research and deployment issues, regarding adaptation issues and their application in e-Learning paradigms. In addition, this special section …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Intelligent Internet-Based Systems: Emerging Technologies and Programming Techniques",
            "Publication year": 2008,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=20927669",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D04 Telecommunications and information theory/001D04B Telecommunications/001D04B03 Teleprocessing networks. Isdn/001D04B03D Networks and services in france and abroad/001D04B03D4 Interconnected networks",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent and semantic real-time process of the Greek LOD for enhancing citizen awareness in public expenditures",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35063-4_72",
            "Abstract": "The provision of publicly available Open Data targets to provide transparency in several public sector decisions and actions. However, this information is served massively and in different forms - mostly due to different bureaucratic procedures- while its diffusion does not occur at regular or at least generally predictable time intervals. Thus, even though the information is available by the involved public sectors and enterprises. citizens are overwhelmed from the size/inconsistency of the information they deal with. In this paper, we present a publicly accessible Web point (publicspending.gr/), which aims to promote transparency and enhance citizen awareness regarding public spending in Greece. The information is based on intelligent and semantic real-time processed open data that are derived from the open API of “Diavgeia” (Clarity) Program (diavgeia.gov.gr/en/) and TAXIS - Taxation Information System …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:abG-DnoFyZgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computational Methods and Optimizations for Containment and Complementarity in Web Data Cubes",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S030643791730488X",
            "Abstract": "The increasing availability of diverse multidimensional data on the web has led to the creation and adoption of common vocabularies and practices that facilitate sharing, aggregating and reusing data from remote origins. One prominent example in the Web of Data is the RDF Data Cube vocabulary, which has recently attracted great attention from the industrial, government and academic sectors as the de facto representational model for publishing open multidimensional data. As a result, different datasets share terms from common code lists and hierarchies, this way creating an implicit relatedness between independent sources. Identifying and analyzing relationships between disparate data sources is a major prerequisite for enabling traditional business analytics at the web scale. However, discovery of instance-level relationships between datasets becomes a computationally costly procedure, as typically all …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A query language for multi‐version data web archives",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/exsy.12157",
            "Abstract": "The Data Web refers to the vast and rapidly increasing quantity of scientific, corporate, government and crowd‐sourced data published in the form of Linked Open Data, which encourages the uniform representation of heterogeneous data items on the web and the creation of links between them. The growing availability of open linked datasets has brought forth significant new challenges regarding their proper preservation and the management of evolving information within them. In this paper, we focus on the evolution and preservation challenges related to publishing and preserving evolving linked data across time. We discuss the main problems regarding their proper modelling and querying and provide a conceptual model and a query language for modelling and retrieving evolving data along with changes affecting them. We present in details the syntax of the query language and demonstrate its functionality …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Artificial Neural Network Approach for Classifying E-Commerce Web Pages.",
            "Publication year": 2003,
            "Publication url": "https://www.actapress.com/Abstract.aspx?paperId=14115",
            "Abstract": "AN ARTIFICIAL NEURAL NETWORK APPROACH FOR CLASSIFYING E- COMMERCE WEB \nPAGES Anagnostopoulos I., Kouzas G., Anagnostopoulos C., Psoroulas I., Vergados D., Loumos \nV. and Kayafas E. National Technical University of Athens, Division of Computer Science, \nDepartment of Electrical and Computer Engineering, GR-15773, Athens, Greece \njanag@telecom.ece.ntua.gr ABSTRACT In this paper, an information system capable of identifying \nand categorizing e-commerce web pages is proposed, on the basis of information filtering \ncombined with a Artificial Neural Network (ANN). It includes term transformation techniques \nalong with pattern recognition methods for content identification. The information representation \ntechniques are based on a multi-dimensional descriptor vector with 432 word stems collected \neither manually or in an automatic way. This vector is called e-Commerce Descriptor Vector (-…",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms for Protection Capacity Assignment in Optical Networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600447/",
            "Abstract": "In this paper we propose ASSRA (Alternative Shared Self-healing Ring Algorithm) as a mechanism that provides protection capacity assignment in Optical Networks, employing in parallel different restoration techniques. The anticipated outcome of this work is to examine the influence and the behaviour of the ASSRA in respect to several restoration scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A health care monitoring system that uses ontology agents",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7753382/",
            "Abstract": "The healthcare domain is mission critical and vast research efforts keep being funded in order to improve life quality of people. Health management consists of specific cooperation intensive activities, while medical knowledge and systems are spatially and functionally distributed. Also, medical data flows are inefficient for dynamic data delivery to stakeholders while the manifold of medical care derives from their diversity and autonomy. In such an environment we propose the implementation of vhMentor based on a solid ontological schema. The aim of the proposed system is to suggest an agent-based solution to overcome the automation deficiencies of medical data monitoring. Towards this objective we study the applicability and usefulness of the mobile agent technology in the healthcare domain. Furthermore, we implemented the encapsulation of remote sensing and medical devices signals in an ontology …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling Influence with Semantics in Social Networks: A Survey",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3369780",
            "Abstract": "The discovery of influential entities in all kinds of networks (e.g., social, digital, or computer) has always been an important field of study. In recent years, Online Social Networks (OSNs) have been established as a basic means of communication and often influencers and opinion makers promote politics, events, brands, or products through viral content. In this work, we present a systematic review across (i) online social influence metrics, properties, and applications and (ii) the role of semantic in modeling OSNs information. We found that both areas can jointly provide useful insights towards the qualitative assessment of viral user-generated content, as well as for modeling the dynamic properties of influential content and its flow dynamics.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:nrtMV_XWKgEC",
            "Publisher": "ACM"
        },
        {
            "Title": "Health care information systems and personalized services for assisting living of elderly people at nursing home",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4724860/",
            "Abstract": "The nursing homes, where home adaptations (environmental improvements) and assistive technology (AT) are provided, represent an increasingly attractive mean of helping elderly people to maintain their independence and enhancing their quality of life. Doctors and specialists are involved in order to provide personalized health care services to elderly people so as to have a better life and treatment. The main difference from a typical health home is that nursing homes are using new technologies and applications in order to collect data from elderly people and create an electronic file for each elderly people. The basic idea of this paper is to use a web application and tablet PC or PDA in order to collect people¿s both personal information and clinical characteristics. Moreover, this application helps doctors to manage the nursing home and have a better view of the health status of each patient, getting in parallel a …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Block operator context scanning for commercial tracking",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30448-4_47",
            "Abstract": "The industry that designs and promotes advertising products in television channels is constantly growing. For effective market analysis and contract validation, various commercial tracker systems are employed. However, these systems mostly rely on heuristics and, since commercial broadcasting varies significantly, are often inaccurate. This paper proposes a commercial tracker system based on the Block Operator Context Scanning (Block - OCS) algorithm, which is both accurate and fast. The proposed method, similar to coarse-to-fine strategies, skips a large portion of the image sequences by focusing only on Regions of Interest. In this paper, a video matching algorithm is also proposed, which compares image sequences using time sliding windows of frames. Experimental results showed 100% accuracy and 50% speed increase compared to traditional block-based processing methods.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Semantic social analytics and linked open data cloud",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7370091/",
            "Abstract": "In this paper, we propose an ontology schema towards linking semantified Twitter social analytics with the Linked Open Data cloud. The ontology is deployed over a publicly available service that measures how influential a Twitter account is by combining its social activity in Twitter. According to our knowledge this is the first work that combines social analytics with the Linked Open Data (LOD) cloud.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Information Diffusion Between Web-Based Social Networks",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-20370-6_2",
            "Abstract": "The topic of Information diffusion has been in the centre of sociology interest for many years. Even before the rise of Online Social Networks (OSNs), social ties and the way the information flows have been studied in traditional real-life social networks. In this paper, we propose the concept of multilayer information flow, by considering every On-line Social Network (OSN) as a separate layer and the information as links connecting these layers. Under such formalization, information is spread from a source layer, while it is diffused in multiple other layers. In order to validate our proposal, experimentations are focused on Reddit and its content, by observing the diffusion of its posts and related content in ImgUr and YouTube.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Monitoring the evolution of cached content in Google and MSN",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1242572.1242754",
            "Abstract": "In this paper, we describe a capture-recapture experiment conducted on Google's and MSN's cached directories. The anticipated outcome of this work was to monitor evolution rates in these web search services as well as measure their ability to index and maintain fresh and up-to-date results in their cached directories.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:zA6iFVUQeVQC",
            "Publisher": "ACM"
        },
        {
            "Title": "Semi-automatic e-chartering through multi-agent systems and satellite IP networks",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJIPT.2009.028658",
            "Abstract": "This paper proposes a semi-automatic e-chartering in maritime markets though distributed multi-agent infrastructure over satellite IP networks. Using a distributed Multi-Agent system for Internet Virtual Chartering Markets (MAVCM) in each maritime port and the satellite information from participating vessels, we propose a mechanism for semi-automatic control and creation of e-chartering contracts services. The MAVCM system applies for business-to-business transactions in maritime markets, and provides mechanisms for Internet-based chartering informational and transactional services. The proposed system is based on Shipowners and shippers maritime contracts through the MAVCM infrastructure, services and satellite monitoring of the vessels.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Inderscience Enterprises Ltd"
        },
        {
            "Title": "Network analysis of public expenditure: the case of Greece",
            "Publication year": 2013,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2229303",
            "Abstract": "The scope of the publicspending. gr project is to generate, curate, interlink and publish economic data in LOD formats that are easily accessible by the scientific community and to provide an user-friendly and objective layer of information that will enable citizens, journalists, business people and politicians to re-discover their own “stories” from data. This position paper presents how our research initiative enables citizens, journalists, business people and politicians to re-discover their own “stories” from economic data.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Paid Crowdsourcing, Low Income Contributors, and Subjectivity",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-19909-8_20",
            "Abstract": "Scientific projects that require human computation often resort to crowdsourcing. Interested individuals can contribute to a crowdsourcing task, essentially contributing towards the project’s goals. To motivate participation and engagement, scientists use a variety of reward mechanisms. The most common motivation, and the one that yields the fastest results, is monetary rewards. By using monetary, scientists address a wider audience to participate in the task. As the payment is below minimum wage for developed economies, users from developing countries are more eager to participate. In subjective tasks, or tasks that cannot be validated through a right or wrong type of validation, monetary incentives could contrast with the much needed quality of submissions. We perform a subjective crowdsourcing task, emotion annotation, and compare the quality of the answers from contributors of varying income levels …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluation of Diversification Techniques for Legal Information Retrieval",
            "Publication year": 2017,
            "Publication url": "https://www.mdpi.com/178134",
            "Abstract": "“Public legal information from all countries and international institutions is part of the common heritage of humanity. Maximizing access to this information promotes justice and the rule of law”. In accordance with the aforementioned declaration on free access to law by legal information institutes of the world, a plethora of legal information is available through the Internet, while the provision of legal information has never before been easier. Given that law is accessed by a much wider group of people, the majority of whom are not legally trained or qualified, diversification techniques should be employed in the context of legal information retrieval, as to increase user satisfaction. We address the diversification of results in legal search by adopting several state of the art methods from the web search, network analysis and text summarization domains. We provide an exhaustive evaluation of the methods, using a standard dataset from the common law domain that we objectively annotated with relevance judgments for this purpose. Our results:(i) reveal that users receive broader insights across the results they get from a legal information retrieval system;(ii) demonstrate that web search diversification techniques outperform other approaches (eg, summarization-based, graph-based methods) in the context of legal diversification; and (iii) offer balance boundaries between reinforcing relevant documents or sampling the information space around the legal query. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "TELS: A Voice-Response Internet-Based Learning System",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.464.487&rep=rep1&type=pdf",
            "Abstract": "During the last decade the academic world is continuously capitalizing on the use of Internet and web-based learning solutions, because of the simplicity and immediacy in creating, organizing and managing educational material and student data. However, the delivery of educational content to the end-user is characterized by visual presentation and the requirement of some sort of access either wired or wireless to the Internet, which blocks visually impaired individuals or people who don’t have access to the Internet in one way or another from accessing educational content. In this paper we describe the design and implementation of the Internet Telephony Learning System (TELS). Besides all other, TELS exploits mature Internet/web standards and the most popular communication mean in the world, the telephone, to provide audio interactivity between an otherwise traditional web application and the end-user. Unlike other similar applications, TELS does not need any special software or hardware to be accessed and since it is an open source traditional web application it can be custom-tailored to the individual needs of each institution. Since it is accessible to almost every communication device, we argue that it is useful for visually impaired, technologically uneducated, and underprivileged people for accessing information originally intended to be accessed visually via a Personal Computer.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:3s1wT3WcHBgC",
            "Publisher": "National Dong Hwa University"
        },
        {
            "Title": "Alternative designing algorithms for protection ring schemes in SONET",
            "Publication year": 2001,
            "Publication url": "https://ci.nii.ac.jp/naid/80012546599/",
            "Abstract": "CiNii 論文 - Alternative designing algorithms for protection ring schemes in SONET CiNii 国立\n情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の\n博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル \n著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 \n検索 検索 [機関認証] 利用継続手続きのご案内 Alternative designing algorithms for protection \nring schemes in SONET ANAGNOSTOPOULOS I. 被引用文献: 1件 著者 ANAGNOSTOPOULOS \nI. 収録刊行物 Proc. Applied Informatics 2001, Innsbruck/Austria Proc. Applied Informatics 2001, \nInnsbruck/Austria, 82-87, 2001 被引用文献: 1件中 1-1件を 表示 1 New Algorithms for Working \nand Spare Capacity Assignment in Integrated Self-Healing Networks LOGOTHETIS Michael \n, NIKOLAOU Ioannis IEICE transactions on communications 86(4), 1346-1355, 2003--(/…",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A generalised regression algorithm for Web page categorisation",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-004-0409-0",
            "Abstract": "This paper proposes an information system that classifies Web pages according a taxonomy, which is mainly used from seven search engines/directories. The proposed classifier is a four-layer generalised regression neural network (GRNN) that aims to perform the information segmentation according to information filtering techniques using content descriptor vectors. Eight categories of Web pages were used in order to evaluate the robustness of the method, while no restrictions were imposed except for the language of the content, which is English. The system can be used as an assistant and consultative tool for classification purposes as well as for estimating the population of Web pages at any given point in time.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer London"
        },
        {
            "Title": "An Internet real-time programming technique for monitoring cache changes",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/43316177/An_Internet_real-time_programming_techni20160303-28644-43pfgd.pdf",
            "Abstract": "Due to the extremely rapid growth of the web, Internet services cannot monitor the evolution of its size at the same time or with the same priority. This paper proposes an innovative method for measuring the ability of Internet search services to maintain new and up-to-date results in their directories. The method is based on capture-recapture experiments in real wildlife biological studies. This proposal can be implemented as a real-time Internet service, in order to continuously measure the Internet evolution as well as the capability of Internet search services to maintain new and up-to-date caches.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessment of Health Information Technology Interventions in Evidence-Based Medicine: A Systematic Review by Adopting a Methodological Evaluation Framework",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/333658",
            "Abstract": "Background: The application of Health Information Technologies (HITs) can be an effective way to advance medical research and health services provision. The two-fold objective of this work is to:(i) identify and review state-of-the-art HITs that facilitate the aims of evidence-based medicine and (ii) propose a methodology for HIT assessment. Methods: The systematic review was conducted according to the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines. Furthermore, we consolidated existing knowledge in the field and proposed a Synthesis Framework for the Assessment of Health Information Technology (SF/HIT) in order to evaluate the joint use of Randomized Controlled Trials (RCTs) along with HITs in the field of evidence-based medicine. Results: 55 articles met the inclusion criteria and refer to 51 (RCTs) published between 2008 and 2016. Significant improvements in healthcare through the use of HITs were observed in the findings of 31 out of 51 trials—60.8%. We also confirmed that RCTs are valuable tools for assessing the effectiveness, acceptability, safety, privacy, appropriateness, satisfaction, performance, usefulness and adherence. Conclusions: To improve health service delivery, RCTs apply and exhibit formalization by providing measurable outputs. Towards this direction, we propose the SF/HIT as a framework which may help researchers to carry out appropriate evaluations and extend their studies. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:tKAzc9rXhukC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A methodology for internal Web ethics",
            "Publication year": 2012,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2003192",
            "Abstract": "The vigorous impact of the Web in time and space arises from the fact that it motivates massive creation, editing and distribution of information by Users with little knowledge. This unprecedented continuum provides novel opportunities for innovation but also puts under jeopardy its survival as a stable construct that nurtures a complex system of connections. We examine the Web as an ethics determined space by demonstrating Hayek’s theory of freedom in a three-leveled Web: technological, contextualized and economic. Our approach accounts for the co-dependence of code and values, and assumes that the Web is a self-contained system that exists in and by itself. This view of internal Web ethics directly connects the concept of freedom with issues like centralization of traffic and data control, rights on visiting log file, custom User profiles and the interplay among function, structure and morality of the Web. It is also demonstrated, in the case of Net Neutrality, that generic freedom-coercion trade-offs are incomplete in treating specific cases at work.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using sliding concentric windows for license plate segmentation and processing",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1579889/",
            "Abstract": "In this paper, a new algorithm for vehicle license plate identification is proposed, on the basis of a novel adaptive image segmentation technique (sliding windows) in conjunction with a character recognition neural network. The algorithm was tested with 2820 natural scene gray level vehicle images of different backgrounds and ambient illumination. The camera focused on the plate, while the angle of view and the distance from the vehicle varied according to the experimental setup. The license plates properly segmented were 2719 over 2820 input images (96.4%). The optical character recognition (OCR) system is a two layer probabilistic neural network with topology 108-180-36, whose performance reached 97.4%. The PNN was trained to identify multi-font alphanumeric characters from car license plates based on data obtained from algorithmic image processing.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A capture–recapture sampling standardization for improving Internet meta-search",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920548909000750",
            "Abstract": "This work describes a novel sampling standardization for improving precision of third-party results in web meta-search. The standardization uses the capture–recapture methodology which is mainly applied for estimating evolution rates in wildlife biological studies, as well as a mechanism that records the users' browsing behavior during their web search sessions. The paper provides the implementation details and the initial assessment of a third-party results ranking algorithm which employs both mechanisms. It is proved that an important quality factor in providing relevant information is how frequent Internet search services refresh their databases. It is also proved that when users' browsing behavior is jointly examined with the ability of the Internet search services to offer new and fresh results, a more effective meta-search is provided. Experimental results have shown that the precision levels of third-party results …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Classification of a large Web page collection applying a GRNN architecture",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39737-3_5",
            "Abstract": "This paper proposes an information system that classifies web pages according a taxonomy, which is mainly used from seven search engines/ directories. The proposed classifier is a four-layer Generalised Regression Neural Network (GRNN) that aims to perform the information segmentation according to web page features. Many types of web pages were used in order to evaluate the robustness of the method, since no restrictions were imposed except for the language of the content, which is English. The system can be used as an assistant and consultative tool in order to help the work of human editors.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Architectures and Tools Enabling Seamless Mobility in Future Collaborative Networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35155-6_29",
            "Abstract": "This paper focuses on the concept of the seamless mobility (provided by vertical handover mechanisms) in heterogeneous Future Internet Networks in the context of the HURRICANE project. We discuss future open collaborative network architectures and propose a set of entities that ensure seamless mobility and service continuity, from infrastructural/operational and business standpoints: an 802.21-like implementation of vertical handover, supported by an innovative business modelling software package, which replaces the traditional operations support stack with a more dynamic, marketplace-oriented system. We also discuss, an approach to distributed, policy-based, vertical handover management and a model for such policies, based on the monitorization and analysis of Call Detail Records that reveals users’ behavioural patterns and allows personalization.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:P5F9QuxV20EC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Adopting wildlife experiments for web evolution estimations: the role of an AI web page classifier",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4061491/",
            "Abstract": "This paper proposes a statistical approach for estimating the evolution of Web pages in directories. The proposal is based on the capture-recapture method used in wildlife biological studies in an animal, bird or fish populations, and it is modified according to the necessary assumptions and amendments for applying the experiments in a search engine directory. During these experiments, Web pages are considered as animals and the specific types of Web pages as particular species of animals whose abundance, birth, death and survival rates are estimated. The population is open, meaning that new Web pages are submitted to the search engine directory, while others are removed from the directory indexes, resembling to emigration/immigration processes in nature. The role of the biologist who recognizes the species under study and records their history is assigned to a Web page classifier, which is trained under …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic Media Adaptation and Personalization",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4724831/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discovering similar Twitter accounts using semantics",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0952197616000191",
            "Abstract": "On daily basis, millions of Twitter accounts post a vast number of tweets including numerous Twitter entities (mentions, replies, hashtags, photos, URLs). Many of these entities are used in common by many accounts. The more common entities are found in the messages of two different accounts, the more similar, in terms of content or interest, they tend to be. Towards this direction, we introduce a methodology for discovering and suggesting similar Twitter accounts, based entirely on their disseminated content in terms of Twitter entities used. The methodology is based exclusively on semantic representation protocols and related technologies. An ontological schema is also described towards the semantification of the Twitter accounts and their entities.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:eflP2zaiRacC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Efficient internet search engine service provisioning exploiting a collaborative web result ranking mechanism",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4811494/",
            "Abstract": "In the context of this paper, a meta-search third-party Web result ranking mechanism is proposed, which is capable of adapting over the continuous changes that occur on the Web, providing in parallel personalized information acquisition considering the user's navigation behaviour. The designed meta search engine service rates, re-organises and combines the results acquired from search services for a specific user information resource request in accordance with a weighted combination of a performance related factor (tightly related to the ranking of the Web result as given by the search engine service) and a reliability related factor (corresponding to the user's satisfaction stemming from the specific Web result that he/she browses), while the performance of each search engine with respect to adequately adapting to the Web evolution is taken into account. Assuming a group of users falling within the same …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enriching social analytics with latent Twitter image information",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9248464/",
            "Abstract": "In this paper, we propose a framework that uses latent information from Twitter images by employing the Google Cloud Vision API platform aiming at enriching social analytics with semantics and textual information. Our study reveals that user-generated content, linked data as well as hidden concepts and textual information from social images can be highly considered for enriching social analytics. Finally, we publish our annotated dataset for further use and evaluation from our research community.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:EkHepimYqZsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RAC: a remote application calling framework for coordination of mobile apps",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801978",
            "Abstract": "Mobile applications (apps) have become part of our everyday life with a constantly increasing market. Of particular interest are apps aiding planning and collaboration among family members, or between co-workers. The architecture of such apps usually involves some Cloud storage medium, through which group members post and retrieve data. Naturally, all participants must have the same app installed in their devices for collaboration to be possible. In this paper we investigate an alternative option instead of app collaboration which is based on remote application calling (RAC). Under the RAC framework, a trusted source is able to invoke application actions at other people's devices, without necessarily owning himself the application it handles. We discuss RAC design and implementation related issues, focusing on Android devices. The usability of our approach is demonstrated through two widely used apps …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "ACM"
        },
        {
            "Title": "Linked Open economy: take full advantage of economic data",
            "Publication year": 2016,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2732218",
            "Abstract": "For decades, information related to public finances was out of reach for most of the people. Gradually, public budgets and tenders are becoming openly available and global initiatives promote fiscal transparency and open product and price data. But, the poor quality of economic open data undermines their potential to answer interesting questions (eg efficiency of public funds and market processes). Linked Open Economy (LOE) has been developed as a top-level conceptualization that interlinks the publicly available economic open data by modelling the flows incorporated in public procurement together with the market process to address complex policy issues. LOE approach is extensively used to enrich open economic data ranging from budgets and spending to prices. Developers, professionals, public administrations and any other interested party use and customize LOE model to develop new systems, to enable information exchange between systems, to integrate data from heterogeneous sources and to publish open data related to economic activities.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Architectures and tools enabling seamless mobility in future collaborative networks",
            "Publication year": 2012,
            "Publication url": "https://repositorium.sdum.uminho.pt/handle/1822/17743",
            "Abstract": "This paper focuses on the concept of the seamless mobility (provided by vertical handover mechanisms) in heterogeneous Future Internet Networks in the context of the HURRICANE project. We discuss future open collaborative network architectures and propose a set of entities that ensure seamless mobility and service continuity, from infrastructural/operational and business standpoints: an 802.21-like implementation of vertical handover, supported by an innovative business modelling software package, which replaces the traditional operations support stack with a more dynamic, marketplace-oriented system. We also discuss, an approach to distributed, policy-based, vertical handover management and a model for such policies, based on the monitorization and analysis of Call Detail Records that reveals users’ behavioural patterns and allows personalization.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:f2IySw72cVMC",
            "Publisher": "Springer Verlag"
        },
        {
            "Title": "Modeling Browsing Behavior and Sampling Web Evolution Features through XML Instances.",
            "Publication year": 2007,
            "Publication url": "https://www.scitepress.org/Papers/2007/12795/12795.pdf",
            "Abstract": "Nowadays, many web services have the essential role of accessing and processing the disseminated information on the web, while in parallel, distribute and exchange metadata among them in order to deliver relevant information to the end user. However, their competence is hindered, due to the vast amount of information added, the poor organization, as well as the lack of effective crawling techniques that fail to follow the exponential growth of the web. In this paper we propose an algorithm, which uses five third party web search services and it is capable of self-adapting over the incessant changes that occur on the indexed web. The algorithm works in conjunction with a user browsing behavior model that monitors and records the users’ interactions with the third-party services, using XML search session instances. From the assessment made, it was concluded that the proposed algorithm not only adapts to the users’ web search profiles but also adapts to the evolutionary nature of the web.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploratory Analysis of a Terabyte Scale Web Corpus",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1409.5443",
            "Abstract": "In this paper we present a preliminary analysis over the largest publicly accessible web dataset: the Common Crawl Corpus. We measure nine web characteristics from two levels of granularity using MapReduce and we comment on the initial observations over a fraction of it. To the best of our knowledge two of the characteristics, the language distribution and the HTML version of pages have not been analyzed in previous work, while the specific dataset has been only analyzed on page level.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The impact of social networks on health care",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s13278-017-0438-1.pdf",
            "Abstract": "Our work examines the risks and benefits stemming from the evolution of Social Network Services (SNSs) in the healthcare domain. More specifically, we study the impact of specific health-oriented social networks such as PatientsLikeMe. Social networks evolved to a ubiquitous part of daily life and WEB 2.0 paved the way for the internet to be used as a method of interactive communication and information immersion. Health SNSs have the strength to influence healthcare services delivery and information availability supported by emerging technologies which track, gather and quantify real-time medical data from patients. SNSs support publicly provided information to patients, offering them the power not only to educate themselves but take part in the decision-making process of their health. On the other hand, healthcare stakeholders have gained access to new information which can help to cut costs …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Springer Vienna"
        },
        {
            "Title": "Foreword to the SMAP’09 Special Session on Intelligence, Adaptation and Personalization on the Web",
            "Publication year": 2009,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/smap/2009/05381689/12OmNyGKUlh",
            "Abstract": "For the purpose of the SMAP’09 Special Session on Intelligence, Adaptation and Personalization on the Web, 5 high quality papers authored by 12 researchers from Greece, Spain, Belgium and Slovakia were selected",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "An Evaluation of Texture Segmentation Techniques for Real-Time Computer Vision Applications",
            "Publication year": 2001,
            "Publication url": "http://www.wseas.us/e-library/conferences/skiathos2001/papers/130.pdf",
            "Abstract": "The emergence of new technologies, digital cameras, communications devices, cost effective processors, new control and computer vision systems provide new opportunities to substantially improve efficiency in various computer vision applications (CVAs). An important aspect of such application is the software module, which should be based on a robust texture segmentation technique. A lot of texture segmentation techniques are present in the literature. The content of this paper constitutes a detailed description of the state of the art techniques for texture segmentation as well as an evaluation of experimental research and results on the basis of selected algorithms suitable for real-time applications.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A CONTEXT-AWARE TELEMEDICINE PLATFORM FOR MONITORING PATIENTS IN ISOLATED AREAS OF NORTH AEGEAN REGION",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An intelligent web recommendation system for ubiquitous geolocation awareness",
            "Publication year": 2013,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJAHUC.2013.056270",
            "Abstract": "Because of the rapid development of World Wide Web in recent years, it has become the basic source of information for millions of people around the world. However, the huge volume of data transferred through the web often causes confusion to users, who are often unable to select the kind of information that is actually suitable to their needs. This is where ubiquitous computing techniques should provide relevant information regarding products and services related to the users' needs. This paper presents such a system, the main goal of which is to select among a set of users, those who are most likely to be interested in specific events. For our approach, we employed a ubiquitous information system along with web 2.0 geospatial API technology and we tested it over simulated and real–life data.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:XiSMed-E-HIC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Evaluation of Influential Properties in Twitter",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8908307/",
            "Abstract": "In this paper we describe a methodology for measuring the influence and impact of Twitter accounts, by combining their activity, social degree and disseminated content. Experimental results show that the accuracy of our methodology is comparable to an established commercial service, while the distribution of the assigned influence values and their properties are described by power law distributions.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:z_wVstp3MssC",
            "Publisher": "IEEE"
        },
        {
            "Title": "photo acquisition on the web",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:35r97b3x0nAC",
            "Publisher": "SRCE University Computing Centre, University of Zagreb"
        },
        {
            "Title": "Ant colony route optimization for municipal services",
            "Publication year": 2005,
            "Publication url": "http://www.scs-europe.net/services/ecms2005/pdf/or-15.pdf",
            "Abstract": "In the present paper the Ant Colony Optimization (ACO) Algorithm is introduced for best routing identification applied in urban solid waste collection.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sliding windows: A software method suitable for real-time inspection of textile surfaces",
            "Publication year": 2004,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/004051750407400716",
            "Abstract": "There is a strong interest in expert systems to assist in complex defect identification procedures. To increase accuracy, attempts are made to enhance traditional human inspection by automated visual systems, which employ cameras and image processing routines. It is important that the software core of such a system is based on a robust, fast texture segmentation technique. Many texture segmentation techniques have been pre sented in the literature. Unfortunately, despite the fact that they achieve good results, they are computationally complex and therefore not suitable for real-time applications, since as the complexity of an algorithm grows, it becomes more and more difficult to execute the image examination in real time. This paper presents a detailed description of a fast algorithm for defect detection in textile surfaces and an evaluation of the experimental results for 137 digitized images of representative …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "A Knowledge-based Service Creation and Execution Framework for Adapting Composite Wireless IP Services",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=10066549910020524019&hl=en&oi=scholarr",
            "Abstract": "Wireless services infrastructures beyond 3G are evolving into highly complex and heterogeneous network environments embracing",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evidence-based health and clinical informatics: a systematic review on randomized controlled trials",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s12553-016-0170-2.pdf",
            "Abstract": "Towards the provision of medical research and eHealth services, several Health Information Technology (HIT) platforms are blended with communication and software technologies (i.e. mobile and Web applications, wireless sensor networks, Internet of Things and cloud computing). However, an important research issue is whether and to what degree these technologies are efficiently and effectively integrated into medical practice. Accordingly, this study reviews recent literature on HITs that employ RCTs, which are acknowledged as a reliable solution by the community of health stakeholders. Furthermore, it examines the research efforts in the field and evaluates the relevant functionalities. The literature search strategy was based on PRISMA 2009 Checklist and the CONSORT-EHEALTH Checklist that are two standard methodologies for systematic reviews in Evidence Based Medicine and Health …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Adaptive and personalized multimedia content delivery for disabled users in Internet TV",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11760-009-0103-x.pdf",
            "Abstract": "This paper aims at the delivery of adaptive and personalized multimedia content in interactive Internet Protocol TeleVision (IPTV) environments, using programmable IP services through the MPEG-21 standard, also supporting the features for users with disabilities. Moreover, we propose a system that adapts to users’ preferences using profile separation, not only for individual users but also for user groups as a whole. The system takes advantage of explicit and implicit information through the users’ interaction with the IPTV environment, while the profile reflects groups of similar users, thus dropping the time needed for matching user patterns and profiles when forming a recommendation. The system works in conjunction with a simulation platform acting as an interaction interface between the IPTV architecture and the prospective viewer. Based on this, interactivity in IPTV is faced through metadata and …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Adapting user's browsing behavior and web evolution features for effective search in medical portals",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4041956/",
            "Abstract": "The World Wide Web, inform of medical and health related Web search services has been widely acknowledged as an important tool for accessing and distributing medical information. The efficiency of its use is hampered however to some extent, by the data overload and the poor organization and presentation of medical portals and sites in general. In this paper we propose an intelligent meta-search algorithm exclusively for health-related Web search, capable of self-adapting over the continuous changes that occur on medical sites, using a Web evolution adaptation mechanism. The algorithm also supports personalization features based on the user browsing behavior. The paper provides the implementation details of the proposed meta-search algorithm along with its initial assessment. The experimental results show the efficiency of the proposed algorithm in terms of relevancy on the re-ranked third-party results",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multi-dimension Diversification in Legal Information Retrieval",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-48740-3_12",
            "Abstract": "The number of freely available legal data sets is increasing at high speed. Citizens can easily access a lot of information about regulations, court orders, statutes, opinions and analytical documents. Such openness brings undeniable benefits in terms of transparency, participation and availability of new services. However, legal information overload poses new challenges, especially in the field of Legal Information Retrieval. Search result diversification has gained attention as a way to increase user satisfaction in web search. We hypothesize that such a strategy will also be beneficial for search on legal data sets. We address diversification of results in legal search by introducing legal domain specific diversification criteria and adopting several state of the art methods from the web search, network analysis and text summarization domains. We evaluate our diversification framework using a real data set from …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:Mojj43d5GZwC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "‘Intelligent Modification for the daltonization process of digitized paintings",
            "Publication year": 2007,
            "Publication url": "https://biecoll2.ub.uni-bielefeld.de/index.php/icvs/article/view/227",
            "Abstract": "Daltonization is a procedure for adapting colors in an image or a sequence of images for improving the color perception by a color-deficient viewer. In this paper an intelligent/enhanced daltonization method for individuals suffering from protanopia is proposed. The algorithm implements logical image masking in order to modify the colors that are confused and to preserve those colors that are perceived correctly. The proposed method modifies iteratively the parameters for image daltonization after the provision of the initial conditions. The distinctive characteristic of the proposed approach is that when it is combined with a color-checking module, optimum daltonization parameters are effectively identified. Examples are provided in details, as well as screenshots from the algorithm when it is applied in digitized paintings/artworks.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance Evaluation of Batch Encodings in HEVC Using Slice Level Parallelism",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003782",
            "Abstract": "HEVC has emerged as the new video standard to replace H. 264/AVC. Although the new standard is able to achieve significantly higher compression ratios compared to the older one, it entails high computational demands. To alleviate the problem, parallelism opportunities are offered by the standard at different levels namely, slice, tile and wave front. In this paper we evaluate the performance of slice level parallelism in HEVC encoding. Although significant previous work exists on slice parallelization, particularly for H. 264/AVC, usually the experimental evaluation was limited to characterizing the performance when encoding one sequence at a time. Our focus is to evaluate slice parallelism when a batch of encoding jobs is submitted to the system, with CPU core requirements potentially exceeding the available resources.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparison over focused web crawling strategies",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065096/",
            "Abstract": "In this paper we review and compare focused crawling strategies, studied and published during the past decade. Despite giant leaps in communication, storage and computing power in recent years, crawlers have always struggled to keep up with Web content generation and modification. Focused crawlers attempt to i) accelerate the crawling process, ii) maximize the harvest of high quality pages, iii) assign appropriate credit to different documents along a crawling path, such that short-term gains are not pursued at the expense of less obvious paths that ultimately yield larger sets of valuable pages. Beyond the review and comparison of the focused crawling strategies, we additionally propose additions to the corresponding architectures for further research.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interconnecting distributed virtual worlds using Metabots: performance evaluation against the traditional client‐server model",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cav.1623",
            "Abstract": "Virtual Worlds evolution is breaking the barriers of virtual isolation, thus allowing users to participate in geographically dispersed and culturally diverse places. At the same time, mobile agents have been established as a solid programming method for heterogeneous networking and computing environments. Our work focuses on the definition of a distributed Virtual World reference platform for enhanced users' experience. Towards interconnecting virtual worlds with mobile agents, we have further enriched the concept of a human‐like appearance avatar. We propose two distributed virtual world architectures, namely loose and tight. In parallel, we present a relevant implementation scheme along with experimental results that prove the performance enhancements achieved against the classic client/server model. Copyright © 2014 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "FUZZY LOGIC RULES FOR TURBOMACHINE MONITORING INSTRUMENTATION",
            "Publication year": 2001,
            "Publication url": "https://www.imeko.org/publications/tc4-2001/IMEKO-TC4-2001-051.pdf",
            "Abstract": "Turbomachines’ maintenance diagnostic procedures are generally performed manually by expert engineers and technicians. However, there is a strong interest for expert systems to assist them in these complex fault identification procedures. The purpose of this paper is to describe and evaluate the implementation of a Fuzzy Logic (FL) system for fault diagnosis based on thermodynamic measurements of temperature and pressure. The measurements were taken in regular aerodynamic stations located lengthwise the engine. These stations are placed adequately in order to facilitate its performance monitoring.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special issue on semantic social media dynamics",
            "Publication year": 2013,
            "Publication url": "https://go.gale.com/ps/i.do?id=GALE%7CA359331775&sid=googleScholar&v=2.1&it=r&linkaccess=abs&issn=15526283&p=AONE&sw=w",
            "Abstract": "As social media keep extending over the Web as we know it, new innovative dynamics are constantly formed in the sense of media content acquiring and sharing trends. Research in this area advances current state-of-the-art and among its more important aspects lies the combination of semantics and knowledge engineering fields within social media platforms, mainly because of the overwhelming amount of disseminated information and different contextualization types currently available throughout them over the Internet, as the latter became an integral part of human life.Within this context, the role of\" social media\" has been growing over the last few years, providing users the ability to create and share their own multimedia content through a variety of networked platforms, such as microblogs (eg, Twitter), blogs, collaborative wikis, multimedia sharing sites (eg, Youtube), social networking sites (eg, Facebook), etc …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:URolC5Kub84C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Coding Time Prediction in H. 264/HEVC Transcoding Using Macroblock Sizes",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8864805/",
            "Abstract": "The continuous customers' demand for higher resolution video led to the development of video coding standards that surpass the limitations of H.264/AVC. Prominent examples in this category include the High Efficiency Video Coding (HEVC) and AV1 which both nominally target at least 50% better compression rate compared to H.264/AVC. However, with a plethora of videos already existing in H.264/AVC format and the majority of cameras in use supporting the older standard, the need for efficient transcoding of H.264/AVC videos into newer standards, cannot be overlooked. Although a significant amount of research exists on fast transcoding of H.264/AVC sequences, most of the works have focused on speeding up block level encoding, usually by taking advantage of mode and motion information that is already contained in the compressed input stream. Nevertheless, equally important to reducing per block …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A rich internet-based programming method for measuring web freshness rates under the Pollock’s sampling scheme",
            "Publication year": 2007,
            "Publication url": "https://www.imeko.org/publications/tc4-2007/IMEKO-TC4-2007-171.pdf",
            "Abstract": "In this paper, we use the Pollock’s robust design method in order to measure the ability of five well known Internet search services, namely Altavista, Google, Lycos, MSN and Yahoo!(in alphabetical order), in terms of maintaining fresh and up-to-date results in their cache directories. This paper demonstrates the first Internet-based measuremets regarding the sampling of the cached results along with their initial assesment. For conducting the sampling occassions we used a client-server communication mechanism (XMLHttpRequest), which is based on the Asynchronous Javascript and XML technology (AJAX).",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Revealing Paths of Relevant Information in Web Graphs",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-0221-4_14",
            "Abstract": "In this paper we propose a web search methodology based on the Ant Colony Optimization (ACO) algorithm, which aims to enhance the amount of the relevant information in respect to a user's query. The algorithm aims to trace routes between hyperlinks, which connect two or more relevant information nodes of a web graph, with the minimum possible cost. The methodology uses the Ant-Seeker algorithm, where agents in the web paradigm are considered as ants capable of generating routing paths of relevant information through a web graph. The paper provides the implementation details of the web search methodology proposed, along with its initial assessment, which presents with quite promising results.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Semantics in Adaptive and Personalized Services: Methods, Tools and Applications",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-11684-1_1.pdf",
            "Abstract": "Semantics in Adaptive and Personalized Services, initially strikes one as a specific and perhaps narrow domain. Yet, a closer examination of the term reveals much more.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Structural analysis and classification of search interfaces for the deep web",
            "Publication year": 2018,
            "Publication url": "https://academic.oup.com/comjnl/article-abstract/61/3/386/4539942",
            "Abstract": "The Web has been identified to consist of a large portion of content that cannot be crawled by general-purpose search engines because it is only generated after a valid submission to a search interface. Accessing such content, however, requires the location and identification of search interfaces. Towards the automation of this task, many approaches have been proposed that involve the manual definition of rules for the identification of query interfaces. In this paper, we propose a rule induction approach to automatically construct a set of rules by searching the most promising subspace of all possible rules with a brute-force method and information theoretic criteria. To specify the features for the rules, we initially make a descriptive analysis of Yahoo L11, a specialized dataset containing complex interfaces, which to the best of our knowledge has not been used in previous works. We perform a series of …",
            "Abstract entirety": 0,
            "Author pub id": "9UBJ4QEAAAAJ:hkOj_22Ku90C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Ant Colony Self-Healing Schemes for Survivable Optical Networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1630208/",
            "Abstract": "This paper deals with survivability issues in high-speed optical networks. The authors propose an ant colony-based mechanism as substitution in a phase of an algorithm, which employs an integrated self-healing technique. The benefits as well as the influence of the proposed modification in the design of the self-healing rings and the spare channel assignment are analytically examined over different integration levels. The derived results outline that the proposed ant colony-based modification provides a reduced amount of spare capacity at the same levels of integration, when applied in the integrated self-healing scheme",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Precise photo retrieval on the web with a fuzzy logic\\ neural network-based meta-search engine",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_6",
            "Abstract": "Nowadays most web pages contain both text and images. Nevertheless, search engines index documents based on their disseminated content or their meta-tags only. Although many search engines offer image search, this service is based over textual information filtering and retrieval. Thus, in order to facilitate effective search for images on the web, text analysis and image processing must work in complement. This paper presents an enhanced information fusion version of the meta-search engine proposed in [1], which utilizes up to 9 known search engines simultaneously for content information retrieval while 3 of them can be used for image processing in parallel. In particular this proposed meta-search engine is combined with fuzzy logic rules and a neural network in order to provide an additional search service for human photos in the web.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "A comparable study employing weka clustering/classification algorithms for web page classification",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065094/",
            "Abstract": "Documents and web pages share many similarities. Thus classification methods used in documents can be applied to advanced web content, with or even without modifications. Algorithms for document and web classification are presented as an introduction. One out of many tools that can be used in method evaluation, application and modification is WEKA (Waikato Environment for Knowledge Analysis). Testing results and conclusions strengthen the principles and bases of classification, while demonstrating the need for a new interlayer in the evaluation of classification methods.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Study of the Parameters Concerning Load Balancing Algorithms",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Vassili-Loumos/publication/268424523_A_Study_of_the_Parameters_Concerning_Load_Balancing_Algorithms/links/54d79a760cf2464758173e04/A-Study-of-the-Parameters-Concerning-Load-Balancing-Algorithms.pdf",
            "Abstract": "Computer system performance depends on load balancing which should concern communication delay, grid topology, workload and the negotiation protocol. The interactions and interdependences between these factors and their correlation with the selected load balancing algorithms are studied in the current paper. Vital issues are considered and extensively examined through the systematic introspection and the comparison of two load balancing algorithms, a static and a dynamic one. The former is the well-known deterministic Round-Robin, whereas the latter has been developed for the needs of our research. In addition, a flexible simulation framework is implemented where the experiments take place. Appropriate metrics are formulated so that their joint examination reveals the behaviour of the system in terms of performance. Performance degradation might result when high information policy complexity is combined with important communication overheads. However, system efficiency can be improved when intense workload is adequately combined with increased delay. Precision of the system’s state information is always compensated by the simplicity of the negotiation protocol. Moreover, the grid’s topology is examined. Equations, which reveal the dependency of performance and topology, are derived, through the methodical analysis of potential load balancing scenarios and they are confirmed by the experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special Section: Adaptive Testing",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Blackwell"
        },
        {
            "Title": "Tile classification using the CIELAB color model",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11428831_86",
            "Abstract": "An image processing algorithm was developed for tile shade classification on the basis of quantitative measurements in CIELAB color space. A total of 50 tile images of 10 types were recorded, and evaluated with the proposed algorithm in comparison with the conventional classification method. The objectivity of the method is based on the fact that it is not subject to inter- and intra-observer variability arising from human’s profile of competency in interpreting subjective and non-quantifiable descriptions.",
            "Abstract entirety": 1,
            "Author pub id": "9UBJ4QEAAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]