[{
    "name": "Ιωάννης Νικολαϊδης",
    "romanize name": "Ioannis Nikolaidis",
    "School-Department": "Computing Science",
    "University": "University of Alberta",
    "Rank": "Professor",
    "Apella_id": 7285,
    "Scholar name": "Ioanis Nikolaidis",
    "Scholar id": "GXSdAk0AAAAJ",
    "Affiliation": "University of Alberta",
    "Citedby": 2257,
    "Scholar url": "https://scholar.google.com/citations?user=GXSdAk0AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "NATs and frozen veggies [Editor's Note]",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4626223/",
            "Abstract": "Dear readers, welcome to the September 2008 issue of IEEE Network. The sound of trucks, the heavy duty disposal bins on the curb, and the thud and bang of construction are all elements of a \"quiet\" summer, full of renovations, in my neighborhood. Resisting this Siren's call is difficult even if I swore off any renovations for the rest of my life, given past experience. I naively thought that this time it wouldn't be that bad. After all, this time it looks like a much smaller job than last time. Of course, I neglected a key conservation law: if a job is small, the additional delays for various reasons will expand it to be roughly equal the total time of a \"big\" job (more professionally managed one might argue, and hence with much less slack). What I was not prepared to experience is the shift in attitudes caused by the widespread adoption of many \"information\" appliances in today's household.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:q3oQSFYPqjQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Additive-increase multiplicative-decrease mac protocol with multi-packet reception",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38401-1_2",
            "Abstract": "A distributed medium-access control (MAC) protocol for the time-slotted channel with multi-packet reception (MPR) capability is proposed. In contrast to the commonly assumed collision channel, in the MPR channel with channel capacity K, it is possible to decode up to K packets whose transmissions overlap in time. In order to exploit the MPR capability, the additive-increase multiplicative-decrease MAC (AIMD-MAC) protocol is designed to adaptively adjust the access probabilities of the independent nodes based on their local transmission histories. The examined performance metrics for evaluating this protocol include aggregate throughput, average packet delay and system fairness. Extensive simulations show that the performance of AIMD-MAC is superior to that of S-Aloha* under light traffic loads and achieves the optimum level after the system is saturated. With a suitable parameter set, AIMD-MAC …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Increasing Aggregation Convergecast Data Collection Frequency through Pipelining",
            "Publication year": 2018,
            "Publication url": "https://www.hindawi.com/journals/wcmc/2018/1539642/abs/",
            "Abstract": "We consider the problem of increasing the data collection frequency of aggregation convergecast. Previous studies attempt to increase the data collection frequency by shortening the completion of a single data collection cycle. We aim at increasing the frequency at which data collection updates are collected by the use of pipelining and, consequently, increasing the overall data collection frequency and throughput. To achieve this, we overlap the propagation schedule of multiple data snapshots within the same overall schedule cycle, thus increasing parallelism through pipelining. Consequently, the effective data collection time of an individual snapshot may span over multiple, successive, schedule cycles. To this end, we modify the aggregation convergecast model, decoupling schedule length, and data collection delay, by relaxing its precedence constraints. Our solution for this new problem involves the unconventional approach of constructing the schedule before finalizing the exact form of the data aggregation tree, which, in turn, requires that the schedule construction phase guarantees that every node can reach the sink. We compare our results using snapshot pipelining against a previously proposed algorithm that also uses a form of pipelining, as well as against an algorithm that though lacking pipelining, exhibits the ability to produce very short schedules. The results confirm the potential to achieve a substantial throughput increase, at the cost of some increase in latency.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:RHpTSmoSYBkC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "On the impact of node placement and profile point selection on indoor localization",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03841-9_20",
            "Abstract": "We present an indoor localization technique based on RF profiling using the received signal strength (RSS) measurements from a set of pre–selected reference points. We do not attach any interpretative significance to the measurements other than use them to calculate their difference from the measurements of the reference points. We study the performance of our technique in an environment with multiple adjacent rooms and find that it gives better results compared to the application of the k-Nearest Neighbor algorithm that has been used in the literature for the same task. We also study the proposed scheme and two other well–known localization schemes, with respect to the sensitivity of the localization on the number and layout of the reference points, as well as on the number and layout of the deployed fixed points (pegs) from where the measurements are collected. We find that one can achieve good …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Managing ip addresses; how to number your network for growth and change [book review]",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3282787_Managing_ip_addresses_how_to_number_your_network_for_growth_and_change_book_review/links/579d826808ae5d5e1e14c3a8/Managing-ip-addresses-how-to-number-your-network-for-growth-and-change-book-review.pdf",
            "Abstract": "A part of the Digital Subscriber Loop (DSL) technology is based on advances in the area of Multicarrier Modulation (MCM), an area which still receives the attention of intense research with the potential of more breakthroughs in the future. The book by John Bingham is targeted at engineers who are involved in the design of DSL systems, and MCM modems in particular. The book provides an exciting personal view about the important future work in the area, motivated by the fact that its retiring author will not be working on them while feeling the importance for new research in certain areas. The chapters include sections describing the “Unfinished Business” of the corresponding topic. Clearly,, graduate students and researchers will appreciate the guidance provided. A further feature to satisfy the intellectual appetite of readers are references to patents, that may not be known to the wider audience. The curious reader finds abundant material that explains the particular complexities of high-speed data uses of the local loop, stemming from the impairments of the local loop (presented in chapter 3). Two chapters introduce DSL systems in general and MCM respectively. The Discrete Fourier Transform (DFT) based MCM is presented in the sixth chapter, followed by a chapter on alternative types of MCM (frequency domain spreading, filtering, time domain shaping and discrete wavelet multitone) discussing the tradeoffs of each technique. The implementation of DMT in ADSL is the topic of chapter 8. The coexistence of ADSL with other services such as voice-band services, echo-canceled ISDN, and TDD ISDN are the subject of the next chapter. The …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Next-generation modems: a professional guide to DSL and cable modems [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/885662/",
            "Abstract": "James Carlson, 2000, Addison-Wesley, 0-20 1-70053-0, 400 pages, softcover, CD-ROM included This is the second book encountered in recent months devoted, heart and soul, to the presentation, implementation, debugging, and, finally, appreciation of a particular network protocol (the previous one beingL2TPbyRichard Shea). The book is primarily aimed at programmers implementing PPP or users and administrators troubleshooting PPP installations. To James Carlson’s advantage, PPP is a very well-known protocol that has already reached a remarkable level of maturity. To the general audience considering PPP, still an alternative to SLIP, it should be pointed out that PPP currently provides load balancing between different lines, multilink capabilities, forms of bandwidth management, and so on, and can routinely be tunneled around the Internet or sent over Ethernets. PPP can coexist with a remarkable variety …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "far-play: A framework to develop augmented/alternate reality games",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5766947/",
            "Abstract": "Augmented/Alternate Reality Games are a relatively new, yet increasingly interesting, class of social applications. These games are fundamentally intertwined with the players' real life, in that the players' everyday activities generate events that advance the game logic. At the same time, they augment the players' “regular” activities with game-related tasks and challenges and with rich digital content that is communicated to the players through a variety of devices, usually augmenting their mobile-device views. In our work, we have been developing a software framework, fAR-Play, to support the development of educational AARG games, in the treasure-hunt style, using space as the context for communicating information. Our toolkit extends the stereotypical notion of AARGs to include a virtual world in which the players can also interact and play. Our toolkit has been evaluated through (and has evolved based on our …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multiple path characterization of ad-hoc network capacity",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11561354_7",
            "Abstract": "In this paper, we characterize the performance of wireless ad-hoc networks through a capacity model which is based on explicit modeling of the interference across multiple routing paths. A set of elementary equations were developed to describe single-channel interference based on radio transmissions within a unit disk (UD) under random mobility conditions. The distinguishing feature of the model is that it introduces micro-models for three elementary sources of interference: inter-path, intra-path, and common origin interference. Simulation experiments found that the proposed session-based model generates throughput results consistent with existing approaches for modeling single path (SP) throughput performance within a unit area disk. However, we go one step further to use the SP throughput equations as the basis for developing a set of equations that model multiple path (MP) throughput …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:_Ybze24A_UAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Building sensor networks: from design to applications",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=1cSnAAAAQBAJ&oi=fnd&pg=PP1&dq=info:pTqDIrQV4NUJ:scholar.google.com&ots=KFLA4am3fj&sig=yYyY1fXYJB2yWci7LZy2njnyWa4",
            "Abstract": "For all the interest that wireless sensor networks have created over the past decade, there are few examples to show that they are truly delivering on this promise and anticipation. What is missing? Deviating from the usual focus on routing and energy efficiency, Building Sensor Networks: From Design to Applications attempts to stitch together the path from conceptual development of applications, on one end, to actual complete applications at the other. With this change in perspective, the book examines important facets of wireless sensor networks (WSNs) that are not often discussed in the literature. From Design Practices to the Networking Protocols that Glue Applications Together Organized into three sections, the book presents insights from international experts representing both industry and academia. The first section, on design practices, explores alternative ways to approach the tasks of developing a suitable WSN solution to an application and assisting that development in a manner that is not necessarily tied to a particular application. The second section, on networking protocols, illustrates the impact of the intermediaries—the\" glue\" of putting applications together. Chapters look at ways to address traffic, delays in network clustering, and the coexistence of a WSN with other systems on a frequency band. The final section of the book delves into experiences with applications in chemical sensing, defense, global trade and security, and ecosystem monitoring. Although these applications may fail the purist definition of an ideal WSN, they offer valuable lessons for the future development and deployment of WSNs. Challenge Your Thinking …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:VLnqNzywnoUC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "An inherently loss-less and bandwidth-efficient periodic broadcast scheme for VBR video",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/345063.339400",
            "Abstract": "Many recent proposals for the support of Video-on-Demand (VoD) use a form of periodic broadcast scheduling and assume Constant Bit-Rate (CBR) encoded videos [1, 2, 3, 4, 6, 7, 10]. The few existing proposals [5, 9] for support of the more efficient Variable Bit-Rate (VBI: t) video encoding schemes, employ forms of lossy multiplexing. Thus they can be used for VBR video but at the cost of data losses. In this paper we address the issue of the VBR encoded video broadcast and we propose an inherently Loss-Less and Bandwidth-Efficient (LLBE) scheme. Given ample client storage, LLBE can satisfy any a-priori prescribed per-video startup latency, w. In LLBE, the bandwidth necessary for the transmission and downloading of a video is minimized through an optimization process. We also note that minimization of the server bandwidth can be stated as a shortest path problem and solved in polynomial time.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:hC7cP41nSMkC",
            "Publisher": "ACM"
        },
        {
            "Title": "Object oriented software technologies in telecommunications, from theory to practice [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/885655/",
            "Abstract": "Object oriented software technologies in telecommunications, from theory to practice [Book \nReview] Page 1 NEW BOOKS and MULTIMEDIA/Edited by Ioanis Nikolaidis The New Books and \nMultimedia column contains brief descriptions of new books in the computer communications \nfield. Each description has been abstracted from the publisher's descriptive materials, minus \nmost of the advertising superlatives, after this material has been checked for accuracy against \na copy of the book. Publishers wishing to have their books listed in this manner should send \ncopies and appropriate advertising materials to John Spragins at the address below, with an \nindication the books are intended for the IEEE Network New Books and Multimedia column. \nAppropriate books will be listed in the column. Zoanis Nikolaidis Computing Science \nDepartment, University of Alberta, Edmonton, Alberta, Canada T6G 2Hl Object Oriented in , to -…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Attaining VoIP–Grade qos via deflection: a buffer space tradeoff study",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11422778_137",
            "Abstract": "We consider the issue of QoS (Quality of Service) in a network catering to isochronous VoIP (Voice over IP) sessions. Our simulation experiments strongly suggest that the single–path paradigm of implementing network–layer virtual circuits neither yields the best utilization of network resources (buffer space) nor is it able to provide the best end-to-end service in terms of loss rate and delay. Instead, it turns out that the dynamic exploration of alternative paths at the packet level with small buffer spaces at the routers results in a more efficient and economical delivery.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the benefits of nondeterminism in location-based forwarding",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.151.3760&rep=rep1&type=pdf",
            "Abstract": "We investigate the performance of location-based wireless ad-hoc forwarding schemes in generic network configurations, including regular grids as well as random networks. Through extensive simulation experiments in a realistic wireless propagation model, we arrive at the conclusion that winning forwarding strategies must be randomized, even if the population of next hop neighbors considered for the random selection includes nodes that would be obvious bad choices, if viewed as deterministic candidates. Inspired by this observation, we propose two randomized forwarding strategies and demonstrate their advantages over deterministic schemes. Notably, their advantage becomes more pronounced when traffic patterns are biased, where the primary advantage of nondeterminism is in circumventing hot spots.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sensor-data fusion for multi-person indoor location estimation",
            "Publication year": 2017,
            "Publication url": "https://www.mdpi.com/230924",
            "Abstract": "We consider the problem of estimating the location of people as they move and work in indoor environments. More specifically, we focus on the scenario where one of the persons of interest is unable or unwilling to carry a smartphone, or any other “wearable” device, which frequently arises in caregiver/cared-for situations. We consider the case of indoor spaces populated with anonymous binary sensors (Passive Infrared motion sensors) and eponymous wearable sensors (smartphones interacting with Estimote beacons), and we propose a solution to the resulting sensor-fusion problem. Using a data set with sensor readings collected from one-person and two-person sessions engaged in a variety of activities of daily living, we investigate the relative merits of relying solely on anonymous sensors, solely on eponymous sensors, or on their combination. We examine how the lack of synchronization across different sensing sources impacts the quality of location estimates, and discuss how it could be mitigated without resorting to device-level mechanisms. Finally, we examine the trade-off between the sensors’ coverage of the monitored space and the quality of the location estimates. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:dshw04ExmUIC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Identifying device type from cross channel probe request behavior",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3448300.3468257",
            "Abstract": "Across different Wi-Fi devices, there exist differences in the probing behavior during active scanning. We conjecture that the behavior is sufficiently distinct to identify individual device types. We propose a feature engineering strategy to training machine learning algorithms for determination of the device type. We propose a concurrent capture across multiple Wi-Fi channels, thus allowing the features to include attributes for the transitions happening between channels during active scanning. Small-scale proof-of-concept results provide encouraging results about the method's potential.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Expected path length for angle and distance-based localized routing",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5224132/",
            "Abstract": "We give analytical solutions for the expected path length in ad-hoc wireless networks employing distance-based or angle-based based greedy routing schemes. Such schemes underlay many practical routing protocols for ad-hoc wireless networks in which nodes are aware of their geographical locations and can use that information to simplify (localize) the routing rules. As the two paradigms, i.e., minimizing the distance towards the destination, and minimizing the angular deviation from the straight path towards the destination, lie at the heart of practically all location-based routing protocols, our solutions can be viewed as generic and applicable to a variety of realistic schemes.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Internet and intranet security, [Book Review]",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/993213/",
            "Abstract": "this book by providing the (C-like) pseudocode of what essentially happ’ens behind the scenes when certain c mmands are invoked (we are warned not to expect that the pseudocode is a qneto-one reflection of the actual Ci co source code, but rather a summariz l+ d idea of the control flow). That beidg said, understanding the internals boil down to understanding the pseudocode, possibly alienating some readers nt keen on reading code. Nevertheless, one can approach the pseudocode on an hs needed basis, when the behavior of c mmands is not exactly as intuitive as Xne might expect. The reader is assumed to be familiar with networking, but a short review of IP addressing and its relation to routing is nevertheless provided in the introduction. A chapter describes the routing information organization and management inside Cisco routers, followed by a chapter that describes the IP forwarding process options …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical Network Control, Architecture, Protocols, and Standards [Book Review]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301009/",
            "Abstract": "Bernstein, Rajagopalan, and Saha is different from other available hooks on optical networks because of its admitted focus on the control plane. It addresses the gap between older “dumb” control technologies (requiring manual intervention) and the new advanced control mechanisms (affording us increased automation and leading to “intelligent” network control) that have been developed in recent years, while also vendorproprietary control protocols are gradually giving way to open standards. The book’s audience is presumably technologists dealing with tasks of planning, design, and provisioning of optical networks, as well as managers interested in the business case for efficiency and profitability using. advanced control architectures. However, the overall book also stands as a handy generalpurpose reference work for control and signaling protocols on and around optical networks. Accordingly, beyond a few …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the design of incentive-aware p2p streaming",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/228355886_On_the_design_of_incentive-aware_P2P_streaming/links/02e7e534ff3a75eba2000000/On-the-design-of-incentive-aware-P2P-streaming.pdf",
            "Abstract": "We study peer–to–peer (P2P) multicast streaming protocols for high bandwidth streams to large numbers of heterogeneous and transient users. First, the shortcomings of tree–based P2P schemes are discussed. Subsequently, a scalable swarm–based scheme is introduced that avoids maintaining a rigid logical topology. Peers self–organize into an unstructured overlay in an ad-hoc fashion. Stream data are divided into small–sized units and distributed in a fashion that fully utilizes the upload capacity of all peers. A credit–based incentive scheme is introduced to encourage peers to contribute their capacity. The incentive scheme operates based exclusively on local information. We evaluate the proposed scheme through simulations in a dynamic and heterogeneous environment. A key benefit of the proposed scheme is its ability to operate under resource–constrained conditions where traditional tree–based approaches typically fail.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the performance and policies of mobile peer-to-peer network protocols",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1344730/",
            "Abstract": "Certain \"data diversity\" approaches have been proposed recently as the means to avoid the demonstrated lack of scalability in mobile ad-hoc networks (MANETs). However, exploiting data diversity requires the development of particular protocols that incite the cooperation of nodes. A feature of the protocols we propose is that, instead of assuming all nodes to be interested in the same data item, we assume different per-node data items of interest and a large population of data items (files) with a popularity that follows a Zipf distribution. We also consider dynamic environments where, over time, new nodes join the network (and others depart). Together with a one-for-one reciprocal exchange policy, we observe the impact of density and per-node initial file sets. Extending the basic idea of adjacent node exchanges to a limited-length path routing, and taking care of proper incentives for nodes to route data on behalf of …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Web performance",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=2537579950183156844&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC"
        },
        {
            "Title": "\" If at First You Don't Succeed, Try, Try Again\"[Editor's Note]",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4211210/",
            "Abstract": "LYT/EDIT NOTE/SEP Page 1 IEEE Network • May/June 2007 Director of Magazines Thomas F. \nLa Porta, Penn. State Univ., USA Editor-in-Chief Ioanis Nikolaidis, U. of Alberta, Canada \nAssociate Editor-in-Chief Chatschik Bisdikian, IBM Research, USA Senior Technical Editors \nThomas M. Chen, Southern Methodist U., USA Yi-Bing (Jason) Lin, National Chiao Tung Univ., \nTaiwan Peter O’Reilly, Northeastern Univ., USA Technical Editors Feature Editors IEEE \nProduction Staff 2007 IEEE Communications Society Officers Nim Cheung, President Sergio \nBenedetto, VP–Technical Activities Harvey Freeman, VP–Membership Services Byeong Gi Lee, \nVP–Membership Development Doug Zuckerman, VP–Society Relations Doug Zuckerman, \nPresident-Elect Stan Moyer, Treasurer John M. Howell, Secretary Board of Governors The \nelected officers above plus Members-at-Large: Class of 2007 Len Cimini — Jerry Gibson Larry . .…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:t7zJ5fGR-2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monitoring Exact Top-K Values in Wireless Sensor Networks Using Dominating Set Trees",
            "Publication year": 2009,
            "Publication url": "https://era.library.ualberta.ca/items/c687df4f-00a9-441e-a4a8-5f52c39d7fed",
            "Abstract": "Top-k queries form an important class of aggregation queries in wireless sensor networks. Unlike previous proposals we consider the exact top-k values query problem, ie, where one seeks to find exactly all k highest unique values in the network regardless of how many nodes report it. Previous proposals also did not pay due attention to the underlying logical tree topology used for data aggregation and forwarding. In this context, this paper presents two main contributions:(1) we propose the use of a particular tree topology, based on Dominating Sets, which is well suited to explore the network’s physical topology for processing top-k queries efficiently; and (2) we propose EXTOK, a filtering-based algorithm for processing the exact top-k values query, we also prove its correctness and investigate its performance with respect to a number of parameters, including network link failures. In all examined cases, EXTOK performs consistently well while effectively exploiting the proposed logical tree topology and it is also resilient to link failures.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A top-down aggregation convergecast schedule construction",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7543925/",
            "Abstract": "In this paper we abandon the intuition that the minimum length/latency schedule of aggregation convergecast has to be constructed in an order mimicking the flow of data, i.e., from leaves to the sink. Instead we adopt a top-down construction process (from sink to the leaves), and thus forego the need to construct an aggregation tree a-priori of the (collision free) schedule construction. The resulting scheme, called MINT, is a family of heuristics whose performance is controlled by a candidate link selection strategy. We report on the best found combination of MINT and candidate link selection strategy which specifically attempts to minimize the “cost” incurred by a scheduled transmission where the cost is the number of blocked transmissions that could have occurred in the same timeslot. The results produced show a significant and systematic improvement over the state-of-the-art. We analyze the results to uncover that …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:zLWjf1WUPmwC",
            "Publisher": "Ieee"
        },
        {
            "Title": "A realistic outdoor urban pedestrian mobility model",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1569190X12000627",
            "Abstract": "Existing generative mobility models, used to produce mobility data for simulated agents in, e.g., wireless network simulations, suffer from a number of limitations. Most significantly, existing models are not representative of actual human movement. We introduce a new mobility model based on state-of-the-art work in understanding pedestrian mobility patterns in urban areas, known as Space Syntax. Under our model, agents move in a meaningful fashion in terms of destination selection and pathfinding, constrained by their surroundings in an outdoor urban environment. Our model is implemented as the publicly available Destination-Based Space Syntax Simulator (DBS3). We use DBS3 to demonstrate which mobility model parameters affect wireless network simulations: centrality bias significantly affects network simulation results in non-grid-based urban centres, whereas the pathfinding metric affects results more …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:EUQCXRtRnyEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Monitoring building energy consumption, thermal performance, and indoor air quality in a cold climate region",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2210670714000456",
            "Abstract": "Buildings are major consumers of the world's energy. Optimizing energy consumption of buildings during operation can significantly reduce their impact on the global environment. Monitoring the energy usage and performance is expected to aid in reducing the energy consumption of occupants. In this regard, this paper describes a framework for sensor-based monitoring of energy performance of buildings under occupancy. Different types of sensors are installed at different locations in 12 apartment units in a building in Fort McMurray, Alberta, Canada to assess occupant energy usage, thermal performance of the building envelope, and indoor air quality (IAQ). The relationship between heating energy consumption and the thermal performance of building envelope and occupant comfort level is investigated by analyzing the monitoring data. The results show that the extent of heat loss, occupant comfort level, and …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:ldfaerwXgEUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Patterns in the RSSI Traces from an Urban Environment",
            "Publication year": 2010,
            "Publication url": "http://senserf.com/pg/PAPERS/camad10.pdf",
            "Abstract": "Urban environments are notorious for high levels of noise and interference, particularly in their unlicensed radio bands. The interference patterns visible on a given channel depend on the particular devices competing for the spectrum. Meanwhile, the modern transceivers incorporated into wireless sensor network (WSN) nodes have the ability to measure the background noise/interference and change channels. This combination of capabilities suggests the need to better understand the noise and interference encountered in urban environments so that devices can make better decisions to avoid it. In this paper, we explore the noise and interference patterns found on 256 frequencies in an urban environment’s 900 MHz ISM and non-ISM bands. We begin the process by using off-theshelf WSN hardware to sample the environment at 5 kHz from 16 locations simultaneously. From these samples, we identify five prevalent patterns and then hand-classify the 4096 traces of noise and interference. Finally, we extract a variety of statistics from the traces and use them in a Bayesian network classifier.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Device mobility detection based on optical flow and multi-receiver consensus",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8956541/",
            "Abstract": "The signal strength of wireless transmissions from WiFi-enabled devices, such as smartphones, is related to their distance from the receiver. While this relation is environment-dependent and generally noisy, fluctuations of the signal strength can be used as an indicator of whether a device is moving relative to a static receiver. People tracking in video sequences is also the subject of many Computer Vision (CV) studies. In our work, we combine the inferred motion from these two distinct sensing modalities to identify the time intervals during which people are moving in an indoor environment and to relate to them the WiFi-enabled devices they carry. Deciding whether a device is moving or not is based on the Received Signal Strength Indicator (RSSI) from single and multiple receivers scenarios. We carry out several experiments to corroborate the efficacy of the proposed techniques (both CV and RSSI-based) in a …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:tuHXwOkdijsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Active queue management and global fairness objectives",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1203718/",
            "Abstract": "We present an active queue management policy and we study its ability to steer, in a distributed fashion, an entire TCP/IP network into global max-min fairness of its long-lived flows. A previously proposed technique, initially applicable to circuit-switched networks and feedback-based flow control networks is adapted to the realities of packet-switching and TCP flow/congestion control, together with a per-hop policy, called FairShare. The proposed solution is evaluated using several example topologies, including linear, loop, and irregular topologies as well as dynamic load fluctuations.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Troubleshooting IP Routing Protocols [Book Review]",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1020229/",
            "Abstract": "NEW BOOKS and MULTIMEDIA 1:---(inband crosstalk)-a different form of crosstalk (interband crosstalk) is not the topic of the book, since the impact of the latter can be reduced by concatenating narrowband optical filters. The impact of inband crosstalk is detrimental because it is intensified (accumulated) as it crosses cascaded optical nodes. The book is a summarization of efforts carried out under the Broadband Lightwave Sources and Systems (BLISS) and Advanced Photonic ExperimentalCross-connects (APEX) projects in the framework of the European ACTS projects. The scope is that of a mathematical framework for the modeling and analysis of optical crosstalk. Included are techniques to estimate the effect of crosstalk on optical WDM and experimental verification of the proposed models. Finally, several techniques to mitigate crosstalk are presented and discussed. The book is intended for a very specialized …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "QoS traffic management in IP and ATM networks [Books]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/826364/",
            "Abstract": "QoS traffic management in IP and ATM networks [Books] Page 1 NEW DOOKS and M\"lTIMEDIA \n. ..1 coiiics ;i CII-ItOM with ;I collcctioii 11f RFCs, frtitii thc early 400 scrics iiiiiiihci-s 1111 to thc \ni~iorc recent 2600 scrics. Moic thm 80 ~xigcs arc dc.rlicatctl to voice ovcr 1 I.', iiitlicai iiig tlic \ninllliciicc rccciit tcchiiological ;bchicvcincnts itrc bcginiiiiig 1.n have (111 cnqiorxtc J~c(- workirig \niiilrnstrtrctiu~cs. Aftci, nn iiilro- t l11c t i 0 I1 10 ('I1 11 rl a 171 c I1 t a 1 c 0 II c c p t s around tlic \ntriiiisriiissioli of sigiinls aiid soinc rclatccl clccti~ical ;iiid iictwoi'kiiig tc rmiII ology, a sc q LIC llcc \nof ch ap1 c 1's rlcscrihc ;I tiuiiil)cr of poliiilar protcicols: PPI?, Titlicriict, Gigatit Etlicrnct, ATM, \nISDN, 1~r;im~ Kcl;iy, ;ind xUSl,. Anotli- CT c1i:qilcr prcscnts tlic possihlc nctworking dcviccs \nused in tlcplopiiig I a 1-g c- sc ii IC ii ut WO r ks ow rh c: tc rrig c iicoiis systcms :incl protocols. \nTlic significniice of swiklics is tliscusscd in ii sclmralc cIi:iplcr> prcscirliirg tiii cxtciisivc ti…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless mesh networks: Now in green too [Editor's Note]",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3283170_Editor's_note_-_Wireless_mesh_networks_Now_in_green_too/links/579d827108ae6a2882f2ec2d/Editors-note-Wireless-mesh-networks-Now-in-green-too.pdf",
            "Abstract": "LYT/EDIT NOTE/SEP Page 1 IEEE Network • May/June 2008 Director of Magazines Thomas F. La \nPorta, Penn. State Univ., USA Editor-in-Chief Ioanis Nikolaidis, U. of Alberta, Canada Associate \nEditor-in-Chief Chatschik Bisdikian, IBM Research, USA Senior Technical Editors Thomas M. \nChen, Southern Methodist U., USA Yi-Bing (Jason) Lin, National Chiao Tung Univ., Taiwan \nPeter O’Reilly, Northeastern Univ., USA Technical Editors Feature Editors IEEE Production Staff \n2008 IEEE Communications Society Officers Doug Zuckerman, President Andrzej Jajszczyk, \nVP–Technical Activities Mark Karol, VP–Conferences Byeong Gi Lee, VP–Member Relations \nSergio Benedetto, VP–Publications Nim Cheung, Past President Stan Moyer, Treasurer \nJohn M. Howell, Secretary Board of Governors The officers above plus Members-at-Large: \nClass of 2008 Thomas M. Chen, Andrea Goldsmith Khaled Ben-Letaief, Peter J. of , , -…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Aggregation vs. load balancing in WSNS",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394168/",
            "Abstract": "We consider the interplay between data aggregation and workload balancing in a Wireless Sensor Network (WSN). In particular, we formulate the problem of deciding where to forward traffic, in order to benefit the most from potential aggregation, while also splitting the resulting traffic (once aggregated) on the way to the Sink for the sake of load balancing. Load balancing across multiple paths results in a corresponding balanced energy consumption and therefore prolongs the lifetime of WSNs. The optimization formulation leads to an IP/LP model where the objective is that of maximizing the lifetime of the WSN. Heuristics are proposed for assigning an efficient data aggregation node for each sensor source. Simulation results show that our schemes significantly improve performance both in terms of longer system lifetime and less total data received (indicating more aggressive aggregation) at the Sink.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "IP-Bosed Next-Generotion Wireless Networks [Book Review]",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3282957_IP-Bosed_Next-Generotion_Wireless_Networks_Book_Review/links/00b7d537be2ddc7e2b000000/IP-Bosed-Next-Generotion-Wireless-Networks-Book-Review.pdf",
            "Abstract": "Wireless local loop (WLL) technologies are currently being deployed as they present cost-effective alternatives to fiber1 copper infrastructure in environments with low population density or where socio-economic factors result in a small customer basis. Despite similarities to cellular networks, the lack of specific standards has already spawned a wide rage of (typically) incompatible products that, together with the standardization efforts, make for the complicated landscape of WLLs today. Raj Pandya’s book is mostly addressed to people involved in planning, design, and operating networks with WLL subsystems. It attempts to cover a substantial part of available technologies, explain relevant acronyms, and outline the features of a few of the most significant current commercial offerings. Specifically, the following products are reviewed in more detail: STAREX-WLL (from LG), Air-Loop (from Lucent), corDECT (from Midas), and Internet FWA (from Nortel). A notable characteristic of the book is the inevitable mix of topics seemingly separate from WLLs, but clos, ely related. Thus, in addition to a chapter on the fundamentals of radio svstems (access svstems) we also find a and cordless (DECT’and PHS) technologies. Another chapter provides a refresher in radio access characteristics and radio planning, and how they relate to the overall system capacity, including elements from cellular nctwork planning, such as cell sectoriration, which is linked to WLL‘s spatial reuse planning. The common features of WLL systems (across products) are detailed in two chapters, one outlining the location and components of a WLL, the other on",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the effectiveness of alternative paths in QoS routing",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.623",
            "Abstract": "We propose a routing strategy in which connection requests with specific bandwidth demands can be assigned to one of several alternative paths connecting the source to the destination. The primary goal of this multiple‐path approach is to compensate for the inaccuracy of the knowledge available to routing nodes, caused by the limited frequency of link state (LS) information exchanges. We introduce a collection of K‐shortest path routing schemes and investigate their performance under a variety of traffic conditions and network configurations. We subsequently demonstrate that K‐shortest path routing offers a lower blocking probability in all scenarios and more balanced link utilization than other routing methods discussed in the literature. With our approach, it is possible to reduce the frequency of link state exchanges, and the incurred bandwidth overhead, without compromising the overall performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:HE397vMXCloC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Distributed classification of acoustic targets in wireless audio-sensor networks",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128608001850",
            "Abstract": "Target tracking is an important application for wireless sensor networks. One important aspect of tracking is target classification. Classification helps in selecting particular target(s) of interest. In this paper, we address the problem of classification of moving ground vehicles. The basis of classification are the audible signals produced by these vehicles. We present a distributed framework to classify vehicles based on features extracted from acoustic signals of vehicles. The main features used in our study are based on FFT (fast Fourier transform) and PSD (power spectral density). We propose three distributed algorithms for classification that are based on the k-nearest neighbor (k-NN) classification method. An experimental study has been conducted using real acoustic signals of different vehicles recorded in the city of Edmonton. We compare our proposed algorithms with a naive distributed implementation of the k …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:_kc_bZDykSQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Simulation-Based deployment configuration of smart indoor spaces",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8767206/",
            "Abstract": "Evaluating deployment scenarios for sensor-driven applications in indoor spaces can be a tedious and labour-intensive task. To mitigate the cost of comparatively evaluating sensor deployment configurations and alternatives required by these applications, we present an integrated methodology that enables the modeling, simulation, and evaluation of alternative candidate deployments, as well as, the fine-tuning of the corresponding sensor-driven applications. We illustrate our methodology by applying it to the task of configuring an indoor localization ambient-intelligence application. We explain how our methodology models the real-world environment and the candidate sensor deployment, simulates the occupants' activities and the sensors' run-time behavior, and evaluates, through a variety of metrics, the effectiveness of the application under different deployment configurations. We evaluate our methodology on …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Impulsive interference avoidance in dense wireless sensor networks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-31638-8_13",
            "Abstract": "Wireless sensor networks (WSNs) are subject to interference from other users of the radio-frequency (RF) medium. If the WSN nodes can recognize the interference pattern, they can benefit from steering their transmissions around it. This possibility has stirred some interest among researchers involved in cognitive radios, where special hardware has been postulated to circumvent non-random interference. Our goal is to explore ways of enhancing medium access control (MAC) schemes operating within the framework of traditional off-the-shelf RF modules applicable in low-cost WSN motes, such that they can detect interference patterns in the neighbourhood and creatively respond to them, mitigating their negative impact on the packet reception rate. In this paper, and based on previous work on the post-deployment characterization of a channel aimed at identifying “spiky” interference patterns, we describe …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Dynamic Bandwidth Allocation for Lifetime-Based TCP Classification",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/228579897_Dynamic_Bandwidth_Allocation_for_Lifetime-Based_TCP_Classification/links/02e7e534ff3a6115c8000000/Dynamic-Bandwidth-Allocation-for-Lifetime-Based-TCP-Classification.pdf",
            "Abstract": "We study the separation of TCP flows into short lived and long lived ones, and the subsequent allocation of bandwidth to reflect the dynamically changing load due to short lived flow fluctuations. Three schemes are presented to assist in determining and allocating the bandwidth to short lived flows. Each one represents a different compromise in terms of state and execution complexity. However, all three share the common assumption that they can exploit knowledge of the statistical properties of what constitutes a “typical” short lived TCP flow. We argue that this assumption is totally within reason and hinges on the fact that short lived TCP flows are HTTP connections that have been extensively studied and their statistics are increasingly well understood. We finally present an evaluation of the three proposed schemes against DropTail and RED and determine that all three provide, to varying degrees, reduced response time to the short lived flows. Since short lived flows are predominantly instantiated by interactive applications, we argue that the reduced response time demonstrated by the proposed schemes is in good agreement with the most pressing performance concern of these applications, ie, short delays.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:7PzlFSSx8tAC",
            "Publisher": "Society for Computer Simulation; 1999"
        },
        {
            "Title": "Ad-Hoc, mobile and wireless networks",
            "Publication year": 2010,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2010LNCS.6288.....N/abstract",
            "Abstract": "Ad-Hoc, Mobile and Wireless Networks - NASA/ADS Now on home page ads icon ads Enable full \nADS view NASA/ADS Ad-Hoc, Mobile and Wireless Networks Nikolaidis, Ioanis ; Wu, Kui Abstract \nPublication: Lecture Notes in Computer Science Pub Date: 2010 DOI: \n10.1007/978-3-642-14785-2 Bibcode: 2010LNCS......N Keywords: Computer Science; Computer \nCommunication Networks; Information Systems Applications (incl.Internet); Algorithm Analysis \nand Problem Complexity; Software Engineering; Management of Computing and Information \nSystems; Information Storage and Retrieval full text sources Publisher | © The SAO/NASA \nAstrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian \nAstrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA logo \nSmithsonian logo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs (.…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "java. rmi The remote method invocation guide [Book Review]",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/993215/",
            "Abstract": "this book by providing the (C-like) pseudocode of what essentially happ’ens behind the scenes when certain c mmands are invoked (we are warned not to expect that the pseudocode is a qneto-one reflection of the actual Ci co source code, but rather a summariz l+ d idea of the control flow). That beidg said, understanding the internals boil down to understanding the pseudocode, possibly alienating some readers nt keen on reading code. Nevertheless, one can approach the pseudocode on an hs needed basis, when the behavior of c mmands is not exactly as intuitive as Xne might expect. The reader is assumed to be familiar with networking, but a short review of IP addressing and its relation to routing is nevertheless provided in the introduction. A chapter describes the routing information organization and management inside Cisco routers, followed by a chapter that describes the IP forwarding process options …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network security essentials: applications ond standards [Books]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/826358/",
            "Abstract": "Network security essentials: applications ond standards [Books] Page 1 RIP: An Intra-Domain \nRoutirig Pro to c o I Packet Video Communica- tions ovet ATM Nefworks K. R. Rao ancl Zoi-an \nS. Boikovic, Prentice Hull, 2000, ISBN 0-1 3-01 15 18-5, 420 pages, Iiordcover. 'I 'I I c 1) I it) k i'ii \nck ct Vi& o Cowm i i w ico tioris over A'l.,M Nc/work,v pi~~~viclcs i~ god soiii'cc or' inlorriifiiioii \nlor Oic iictwork cxpcrt who wodd like ti) catch tip with tlic vitlcri stiinditrtls 011 MI'Lli tiiiel 1'I'U'l'. \nIixtctisivc hiickgrriiind infcirmtioii is provided oti viilco criiling tccfiiiiq~ics. 1 .;iycrctI cotling iiiitl \nsc;ilrhility Icchii iqiics arc ills0 prcsciiicil. 13cspitc ils tillc, niitl fipirl frcm Ilic oiiqilinsis nil A'I'M', \nlllc hnok also riisciisscs thc inlc rif thc Iiitcriict iti cartyiiig vidco traffic ;is wcll ;is tlic rlistrihiition \not vidco ti-;d- fic i 11 wirclcss cnvi roii iiic iits. '['lie t;i rgc I iilldicncc ~ lj ~ ~ ~ ~ ~ lr ~ to I3c \ng~il~lll:llc 5111- rlcii1.s with part.iciilai, ii~lci'cst in I:he i'csc ii rcti d ircc t io 11 Fo I, ii cl.work-, …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Internet architectures: an introduction to IP protocols [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/871339/",
            "Abstract": "The use of the term “IP Protocols” to describe protocols below the network layer is uncommon and reveals much about the current state of affairs in networking. Several network technologies, including protocols, have become household names and synonymous with the Internet. The book by Uyless Black includes the IP protocols as well as data link protocols and an assortment of protocols that appear to be interesting and related to the Internet. The book emphasizes the informal description of the protocols and their corresponding operational aspects. Assuming no prior specialized knowledge for the reader, it provides a mixture of undergraduate networking textbook material and a description of very specific protocols with which the casual reader may be familiar. After a brief historical overview, a one-chapter description of some of the Internet’s most important components is given. In a little more than 60 pages, a …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On sensor data aggregation with redundancy removal",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=15293302657933837875&hl=en&oi=scholarr",
            "Abstract": "In sensor networks, overlapping sensed areas result in the collection of partially redundant data. Interior sensor nodes along a data collection tree can remove redundancies and reduce the required bandwidth for the aggregate sensed data. Assuming that the sensed information is proportional to the sensed area, and assuming random node placement, we show how different data collection/aggregation heuristics perform versus the optimal (based on exhaustive search) in terms of minimizing total cost for conveying the aggregated data. We present heuristics that use exclusively local information. Local information of varying degrees of cost (with and without exact location information) is considered.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "About computing science research methodology",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.124.702&rep=rep1&type=pdf",
            "Abstract": "Computing Science researchers use several methodologies to tackle questions within the discipline. This discussion starts by listing several of these methodologies. The idea is not to classify researchers or projects in each of these methodologies or to be exhaustive. Tasks performed by a single researcher fall within different methodologies. Even the activities required to tackle a single research question may include several of these methodologies.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:maZDTaKrznsC",
            "Publisher": "Technical report, Alberta University"
        },
        {
            "Title": "RSSI quantization for indoor localization services",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8292429/",
            "Abstract": "Received Signal Strength Indication (RSSI) measurements are known to be noisy and to exhibit high degree of variability, yet massive sets of RSSI data are streamed and collected with the purpose of using them for localization. In this paper we determine that the full resolution of RSSI measurements is unnecessary and propose, based on an evaluation of indoor localization experiments, a technique of modest computational effort, using Genetic Algorithms, to determine how to best quantize RSSI measurements. Our approach treats the localization algorithm as a “black box” and, hence, its applicability is broad. However, for the purpose of exposition and to generate absolute performance metrics, a particular profiling-based localization algorithm is used. Results from experiments involving real collected RSSI values indicate that it is possible to reduce the RSSI data volume by approximately 72% with no noticeable …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy-efficient multi-hop scheduling for multi-rate 802.15. 3 WPANs",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4289467/",
            "Abstract": "We propose an energy-efficient multi-hop scheduling scheme for single-channel 802.15.3 networks which produces interference-avoiding schedules that are throughput and energy efficient. The scheduler replaces high-interference peer-to-peer transmission with low-interference multi-hop transmissions by interference-aware multi-hop routing, which reduces both interference and energy consumption of transmission. To maximize channel reuse, a multi-hop maximal-weighted-matching grouping scheme is applied to arrange concurrent transmissions. For successful signal decoding, the accumulated interference among concurrent transmissions is taken into account to ensure that signal reception occurs with sufficient SINR.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-layering: An issue of architecture?[Editor's Note]",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3283161_Cross-layering_An_issue_of_architecture_Editor's_Note/links/579d827108ae6a2882f2ec2c/Cross-layering-An-issue-of-architecture-Editors-Note.pdf",
            "Abstract": "LYT/EDIT NOTE/SEP Page 1 IEEE Network • March/April 2008 Director of Magazines Thomas F. \nLa Porta, Penn. State Univ., USA Editor-in-Chief Ioanis Nikolaidis, U. of Alberta, Canada \nAssociate Editor-in-Chief Chatschik Bisdikian, IBM Research, USA Senior Technical Editors \nThomas M. Chen, Southern Methodist U., USA Yi-Bing (Jason) Lin, National Chiao Tung Univ., \nTaiwan Peter O’Reilly, Northeastern Univ., USA Technical Editors Feature Editors IEEE \nProduction Staff 2008 IEEE Communications Society Officers Doug Zuckerman, President Andrzej \nJajszczyk, VP–Technical Activities Mark Karol, VP–Conferences Byeong Gi Lee, VP–Member \nRelations Sergio Benedetto, VP–Publications Nim Cheung, Past President Stan Moyer, Treasurer \nJohn M. Howell, Secretary Board of Governors The officers above plus Members-at-Large: \nClass of 2008 Thomas M. Chen, Andrea Goldsmith Khaled Ben-Letaief, Peter J. of , …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A practical approach to WBEM/CIM management [Book Review]",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1407689/",
            "Abstract": "A practical approach to WBEM/CIM management [Book Review] Page 1 IEEE Network • \nMarch/April 2005 3 A Practical Approach to WBEM/CIM Management C. Hobbs, 2004, \nAuerbach Publications, ISBN 0-8493-2306-1, 325 pages, hardcover. The Web-Based \nEnterprise Management (WBEM) and its Component Information Model (CIM) are a means \nto develop telecommunication applications management. Reading about network \nmanagement in abstract terms is a problem avoided in Chris Hobbs’ book by introducing \nexamples of how WBEM/CIM can be used by a developer. Early on, the distinction between \nWBEM’s and SNMP’s models of operation is made (SNMP being data-centric, ie, based on \na structural model, and WBEM being task-centric, ie, based on a behavioral model). \nHowever, WBEM’s power comes at the expense of having to master a fairly wide set of \nstandardized technologies. WBEM is described (…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:JQOojiI6XY0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed and efficient classifiers for wireless audio-sensor networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4610886/",
            "Abstract": "This paper presents schemes to generate effective feature vectors of low dimension, and also presents a cluster-based algorithm, where sensors form clusters on-demand for the sake of running a classification task based on the produced feature vectors. The features generated through our proposed schemes are evaluated using k-nearest neighbor (k-NN) and maximum likelihood (ML) classifiers. The proposed schemes are effective in terms of classification accuracy, and can even outperform previously proposed approaches, but, in addition, they are also efficient in terms of communication overhead.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Selective idling: Experiments in transport layer energy conservation",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1011118432742",
            "Abstract": "In this paper we consider the potential of using an aggressive form of energy conservation for mobile computing environments. The estimators for the round-trip time and round-trip time variance used by TCP are used to direct the transceiver of a mobile node to idle over extended periods of time when packet activity is not anticipated. In addition, we consider data link layer extensions that provide additional control information allowing the mobile to be further selective as to when to idle and when to activate the network interface device. Simulations are conducted to examine the performance of the proposed scheme under various levels of congestion in the fixed part of the network, from completely unloaded to fully congested. The simulations reveal that the technique is promising but its effectiveness depends crucially on the control of the maximum window size used by TCP and on accurate knowledge of the …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:u_35RYKgDlwC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Guest editorial: mobile and ad-hoc local networks",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/S1389-1286%2802%2900421-8",
            "Abstract": "Guest editorial: mobile and ad-hoc local networks: Computer Networks: The International \nJournal of Computer and Telecommunications Networking: Vol 41, No 3 ACM Digital \nLibrary home ACM home Google, Inc. (search) Advanced Search Browse About Sign in \nRegister Advanced Search Journals Magazines Proceedings Books SIGs Conferences \nPeople More Search ACM Digital Library SearchSearch Advanced Search Computer \nNetworks: The International Journal of Computer and Telecommunications Networking \nPeriodical Home Latest Issue Archive Authors Affiliations Award Winners More HomeBrowse \nby TitlePeriodicalsComputer Networks: The International Journal of Computer and \nTelecommunications NetworkingVol. , No. Guest editorial: mobile and ad-hoc local \nnetworks article Guest editorial: mobile and ad-hoc local networks Share on Authors: \nHossam Hassanein Queen's Univiersity, Kingston, Ont., , , …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Elsevier North-Holland, Inc."
        },
        {
            "Title": "Sensors as an evaluative tool for independent living",
            "Publication year": 2012,
            "Publication url": "https://www.taylorfrancis.com/chapters/sensors-evaluative-tool-independent-living-woo-ganev-stroulia-nikolaidis-liu-lederer-canada/e/10.1201/b12318-77",
            "Abstract": "Now more than ever, the design of systems and devices for effective and safe healthcare delivery has taken center stage. And the importance of human factors and ergonomics in achieving this goal can't be ignored. Underlining the utility of research in achieving effective design, Advances in Human Aspects of Healthcare discusses how human factors an",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:S16KYo8Pm5AC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Lumped Markovian Estimation for Wi-Fi Channel Utilization Prediction",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9012721/",
            "Abstract": "We present a model to predict the short-term utilization of an IEEE 802.11 channel. We approximate the time-varying utilization process via a Markovian state transition model and subsequently create a lumped representation of the transition matrix. Each lumped state can then be treated as a class. The lumped matrix provides a simpler to understand description of the channel utilization behavior and naturally includes the persistence in one lumped state which resembles the characteristic behavior of naive predictors (where predicted state equals the current state). We demonstrate that treating the lumped states as classes allows good prediction models to be built using Logistic Regression and Neural Network models. Our results are based on IEEE 802.11 wireless utilization data collected as reported in the channel utilization (CU) field of the QBSS Load Element in Beacon frames. The presented approach can be …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "NEW BOOKS AND MULTIMEDIA/Edited by Ioanis Nikolaidis",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1668397/",
            "Abstract": "The New Books and Multimedia column contains brief reviews of new books in the computer communications field. Each review includes a highly abstracted description of the contents, relying on the publisher’s descriptive materials, minus advertising superlatives, and checked for accuracy against a copy of the book. The reviews also comment on the structure and the target audience of each book. Publishers wishing to have their books listed in this manner should send copies and appropriate advertising materials to Ioanis Nikolaidis at the address below, with an indication that books are intended for the IEEE Network New Books and Multimedia column. Appropriate books will be reviewed in the column.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:gsN89kCJA0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How Secure is Your Wireless Network? Safeguarding Your Wi-Fi LAN [Book Review]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301011/",
            "Abstract": "resorting exclusively to Wireless Encryption Protocol (WEP) hashing, although WEP receives its due in one chapter. The remedy to the original problems of WEP is presented via an intioduction to 802.11 i, WPA, TKIP, and AES, hut in addition the reader learns about the benefits of deploying virtual private networks, as well as how 802.1~ and EAP can he used to secure enterprise environments. In fact, it attempts to separate home office security concerns (centered mostly around firewalls) from those of enterprise environments (presented primarily as a scalable authentication senices issue).",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tradeoffs of combining network coding and duty cycling in WSNs",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5771216/",
            "Abstract": "One approach to reduce the energy consumption of wireless sensors networks (WSNs) is to reduce the cost of idly listening to the channel by disabling (powering down) the transceivers in what is generally known as transceiver duty-cycling. Additionally, one can construct network coding (NC) schemes that allow a single transmissions to be of value to more than one receiver. In this paper, we account for the impact of duty-cycling by modeling the transmissions (for which the intended receiver was not awake) as a form of packet losses. We then use a specifically designed NC scheme to recover those losses. We compare the energy performance and network throughput against continuous (no duty-cycling) operation. The results demonstrate that the particular combination of NC and duty-cycling can provide gains in terms of energy efficiency but these gains are meaningful in particular configurations and under …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:SdhP9T11ey4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using Simulations to Integrate Technology into Health Care Aides’ Workflow",
            "Publication year": 2013,
            "Publication url": "https://www.learntechlib.org/p/130289/",
            "Abstract": "Health care aides (HCAs) are critical to home care, providing a range of services to people with chronic conditions, aging or are unable to care for themselves independently. The current HCA supply will not keep up with this increasing demand without fundamental changes in their work environment. One possible solution to some of the workflow challenges and workplace stress of HCAs is hand-held tablet technology. In order to introduce the use of tablets with HCAs, simulations were developed. Once an HCA was comfortable with the tablet, a simulated client was introduced. The HCA interacted with the simulated client and used the tablet applications to assist with providing care. After the simulations, the HCAs participated in a focus group. HCAs completed a survey before and after the tablet training and simulation to determine their perception and acceptance of the tablet. Future deployment and …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:olpn-zPbct0C",
            "Publisher": "Kassel University Press GmbH"
        },
        {
            "Title": "Ad-Hoc, Mobile and Wireless Networks: 9th International Conference, ADHOC-NOW 2010, Edmonton, AB, Canada, August 20-22, 2010, Proceedings",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=qZRrCQAAQBAJ&oi=fnd&pg=PP2&dq=info:RUZ3eYpxt2wJ:scholar.google.com&ots=739gLvPNdc&sig=Ch5D8SccAJ7o2vC48-XbHSyvobg",
            "Abstract": "For more than a decade, ad hoc wireless networks have galvanized the interest and sparked the imagination of researchers. Such networks consist of a set of nodes equipped with wireless interfaces and they are designed to form self-organizing and spontaneous networks. They are usually multi-hop in nature, collectively forwarding and processing data to accomplish an application task. In addition, their topologies can be highly dynamic due to the potential mobility of the nodes. All these properties, in isolation and combination, pose a plethora of research challenges as well as new application opportunities. The International Conference on Ad-Hoc Networks and Wireless (ADHOC-NOW) serves as one of the premier venues for researchers and industrial practitioners to exchange ideas in this exciting area. Following previous ADHOC-NOW conferences in Murcia, Spain (2009), Sophia Antipolis, France (2008), Morelia, Mexico (2007), Ottawa, Canada (2006), Cancun, Mexico (2005), Vancouver, Canada (2004), Mo-real, Canada (2003), and Toronto, Canada (2002), the ninth ADHOC-NOW conf-ence took place at the University of Alberta in Edmonton, Canada, during August 20–22, 2010. As the capital city of the Province of Alberta, Edmonton is a cultural, governmental, and educational center and offers year-round world-class f-tivals, including the Edmonton International Fringe Theatre Festival. Edmonton is also home to North America's largest indoor shopping mall, the West Edmonton Mall. The summer in Edmonton is particularly joyful and has mild temperature and long, sunny daytime.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer"
        },
        {
            "Title": "The smart condo project: services for independent living",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/smart-condo-project/51393",
            "Abstract": "Most would agree that older adults want affordable, high-quality healthcare that enables them to live independently longer and in their own homes. To this end, ambient assisted living environments have been developed that are able to non-intrusively monitor the health of people at-home and to provide them with improved care. The authors have designed an environment, the Smart Condo, to support seniors and rehabilitating patients. They have embedded a wireless sensor network into a model living space, which incorporates universal design principles. Information from the sensor network is archived in a server, which supports a range of views via APIs. One such view is a virtual world, which is realistic and intuitive, while remaining non-intrusive. This chapter examines computing technologies for smart healthcare-related environments and the needs of elderly patients. It discusses the Smart Condo architecture …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:O3NaXMp0MMsC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Web Caching and Content Delivery [Book Review]",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1020227/",
            "Abstract": "Compared to other books in the Cisco Press series that cater to the needs of readers preparing for certification levels, the book by Mervana and Le includes a proportionally large fraction of material that is not specific to Cisco equipment configuration. The distinguishing feature of the book is that digital subscriber line (DSL) technology is presented in the context of how service providers (CLECs or ILECs) can design and implement a scalable network in order to offer voice, video, and data services. It therefore targets a mixed audience, of technologists interested in Cisco offerings in the area of DSL-based networks and of service providers interested in how to leverage DSL technology. Naturally, the introductory chapter dedicates a number of pages to explaining the evolution and architecture of the telephone network, leading to a chapter on the basic DSL technologies (ADSL, VDSL, SDSL, IDSL, G. shds1) and a …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable QoS routing using alternative paths",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=16363217265680212332&hl=en&oi=scholarr",
            "Abstract": "We propose a routing strategy in which connection requests with specific bandwidth demands can be assigned to one of several alternative paths connecting the source to the destination. The primary goal of this multiple-path approach is to compensate for the inaccuracy of the knowledge available to routing nodes, caused by the limited frequency of link state (LS) information exchanges. We introduce a collection of¢-shortest path routing schemes and investigate their performance under a variety of traffic conditions and network configurations. We subsequently demonstrate that¢-shortest path routing offers a lower blocking probability in all scenarios and more balanced link utilization than other routing methods discussed in the literature. With our approach, it is possible to reduce the frequency of link state exchanges, and the incurred bandwidth overhead, without compromising the overall performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Indoor Localization: A Cost-Effectiveness vs. Accuracy Study",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8104256/",
            "Abstract": "Recognizing the occupants movement and locations within a home is a basic functionality, underlying a variety of smart-home services, including energy management, ambient environment control, and assistive-living services for seniors and people with disabilities. The outdoor-localization variant of the problem is effectively addressed with the use of GPS; however, GPS does not work well inside buildings, which makes the indoor positioning problem a very active research topic. In this paper, we report on a study of the indoor-localization problem, relying on easy-to-deploy, inexpensive, BLE-enabled stickers and beacons and WiFi access points.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wiley survival guide in global communications [Book Review]",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1407691/",
            "Abstract": "Interdomain routing in the Internet takes place between autonomous routing domains. Today this is implemented with the Border Gateway Protocol (BGP), which exchanges reachability information within and between Autonomous Systems (ASes). The field of interdomain routing is rapidly changing along several fronts. First, the BGP protocol itself is evolving as new extensions are implemented, standardised, and widely deployed. Second, vendor implementations are extended to allow for more complex routing policies. Third, the operator community is continually developing and disseminating “best practices” on how to manage routing. And finally, the research community has made significant progress in the last decade in better understanding many aspects of interdomain routing.The goal of this special issue of IEEE Network Magazine is to publish contributions of state-of-the art understanding of interdomain …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic multichannel scheduling for 802.15. 3 WPANs",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4411758/",
            "Abstract": "We propose a dynamic scheduler for multichannel 802.15.3 WPANs which exploits both channel reuse and interference control. A maximal-weighted-matching based scheduling scheme is designed to arrange simultaneous transmissions in each single channel and a multichannel assignment scheme is proposed to obtain the ultimate schedule in each superframe. For successful signal decoding, accumulated interference among simultaneous transmissions is taken into account to ensure that signal reception occurs with sufficient SINR. To improve the efficiency of channel reuse, the scheduler fragments each transmission request to multiple requests with the equal duration. An analysis is given of the optimal way to implement such process according to online traffic load and overhead. Simulations are used to evaluate the performance and to compare against existing schemes.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The end of the Internet (Revisited)[Editor's Note]",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3283147_The_end_of_the_Internet_Revisited_Editor's_Note/links/5699a46308ae6169e551b7fd/The-end-of-the-Internet-Revisited-Editors-Note.pdf",
            "Abstract": "LYT/EDIT NOTE/SEP Page 1 IEEE Network • January/February 2008 Director of Magazines \nThomas F. La Porta, Penn. State Univ., USA Editor-in-Chief Ioanis Nikolaidis, U. of Alberta, \nCanada Associate Editor-in-Chief Chatschik Bisdikian, IBM Research, USA Senior Technical \nEditors Thomas M. Chen, Southern Methodist U., USA Yi-Bing (Jason) Lin, National Chiao Tung \nUniv., Taiwan Peter O’Reilly, Northeastern Univ., USA Technical Editors Feature Editors IEEE \nProduction Staff 2008 IEEE Communications Society Officers Doug Zuckerman, President \nAndrzej Jajszczyk, VP–Technical Activities Mark Karol, VP–Conferences Byeong Gi Lee, \nVP–Member Relations Sergio Benedetto, VP–Publications Nim Cheung, Past President Stan \nMoyer, Treasurer John M. Howell, Secretary Board of Governors The officers above plus \nMembers-at-Large: Class of 2008 Thomas M. Chen, Andrea Goldsmith Khaled Ben-Letaief, J. of , …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tradeoffs of Implementing TCP Fairness Schemes.",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.58.5953&rep=rep1&type=pdf",
            "Abstract": "In this paper we consider two recently proposed schemes for the fair allocation of bandwidth in high speed networks carrying TCP traffic: XCP and Fair-Share. We explain the different design philosophies represented by each one and demonstrate through a set of simulations that FairShare, by making better use of the round-trip-time information, avoids the performance shortcomings that appear in XCP under environments with diverse round–trip times. Furthermore, it is pointed out that XCP cannot perform well under environments where short lived and long lived flows share the link bandwidth and the isolation of flows on the basis of their lifetimes, as implemented in FairShare is preferable.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "SCB: Staircase broadcast for media-on-demand systems",
            "Publication year": 2000,
            "Publication url": "https://www2.cs.sfu.ca/CourseCentral/886/tiko/papers/LiNikolaidis00.pdf",
            "Abstract": "Periodic broadcast schemes have been proposed to solve the Media-on-Demand (MoD) distribution problem for the set of the most frequently requested media objects. Most of the current proposals for periodic broadcast schemes assume Constant-Bit-Rate (CBR) encoded media objects [1, 2, 5, 9]. The few existing proposals for support of the bandwidth-efficient family of Variable-Bit-Rate (VBR) encoded media objects are available at the cost of data loss due to overflow of the broadcast link capacity by the aggregate traffic of the simultaneouslytransmitted segments of the media contents [3, 8]. In this paper, we investigate a novel broadcast scheme, called StairCase Broadcast (SCB), for VBR encoded media contents, which can guarantee, by its design, zero data loss and predictable service delay with minimal required de-coupled server and client bandwidth.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Better tree-better fruits: using dominating set trees for MAX queries",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1402050.1402052",
            "Abstract": "Finding an aggregation of observed values, in particular the maximum value, is an important type of query in wireless sensor networks. Previous proposals to find the maximum value, the so-called MAX query, relied on a given underlying logical tree topology for data aggregation/forwarding, but did not pay due attention to the role of such topology. Focusing on the MAX queries we first argue that the underlying tree topology plays a very important role in the query processing cost. We then propose the use of a particular tree topology, based on Dominating Sets that is well suited to explore the network's physical topology for processing MAX queries efficiently. Experimental results obtained using real and synthetic datasets confirm that by simply replacing the tree topologies used in previous proposals with the Dominating Set-based Tree (DST) one can reduce the transmission cost of MAX queries by up to 70% and …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "PPP design, implementation and debugging, [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/885660/",
            "Abstract": "James Carlson, 2000, Addison-Wesley, 0-20 1-70053-0, 400 pages, softcover, CD-ROM included This is the second book encountered in recent months devoted, heart and soul, to the presentation, implementation, debugging, and, finally, appreciation of a particular network protocol (the previous one beingL2TPbyRichard Shea). The book is primarily aimed at programmers implementing PPP or users and administrators troubleshooting PPP installations. To James Carlson’s advantage, PPP is a very well-known protocol that has already reached a remarkable level of maturity. To the general audience considering PPP, still an alternative to SLIP, it should be pointed out that PPP currently provides load balancing between different lines, multilink capabilities, forms of bandwidth management, and so on, and can routinely be tunneled around the Internet or sent over Ethernets. PPP can coexist with a remarkable variety …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:0KyAp5RtaNEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Smart-CondoTMInfrastructure and Experience",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-37419-7_6",
            "Abstract": "The term “Smart Home” refers to a home equipped with sensors, which observe the environment and the actions of its occupants, and actuators, which automatically control the home ambience and devices. A Smart Home can provide a variety of services to its occupants, based on information gleaned from the data recorded by the sensors and using the automation afforded by the actuators. Our work in the Smart-CondoTM project has been motivated by healthcare concerns: we aim to support people with chronic conditions to live independently longer. To that end, our first objective has been to develop an accurate location- and activity-recognition method. In this paper, we describe the Smart-CondoTM middleware architecture, focusing on its occupant-localization feature. We report on simulation experiments with three sensor placements, one of which was deployed at a recent indoor localization …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:tS2w5q8j5-wC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Study of Simple Partially-Recovered Sensor Data Imputation Methods",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9012748/",
            "Abstract": "We consider the problem of loss of continuous data feeds from sensor networks, due to transient failures. Because the failures are recoverable, part of the missing data may be, eventually, acquired. Even then, the limited resources of the nodes can result in an incomplete reconstruction of the missing data. In this paper we study a set of proposed data imputation methods, and their variations, on a real data set. We determine the tradeoffs involved in the proposed techniques. A common characteristic of the studied techniques is that they depend on the recent behavior of the data stream and do not make specific assumptions about the long-term stochastic behavior of the data. We consider also the case where simple, sub-sampling based, handling of accumulated missing data is implemented by the nodes.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:nrtMV_XWKgEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "in Sensor Networks with Redundancy Removal",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4387156602399125754&hl=en&oi=scholarr",
            "Abstract": "In sensor networks, overlapping sensed areas result in the collection of partially redundant data. Interior sensor nodes along a data collection tree can remove redundancies and reduce the required bandwidth for the aggregate data. Assuming that the sensed information is propor-tional to the sensed area, we propose heuristic algorithms to build data gathering trees in order to reduce communication costs. The algorithms are completely distributed and are based on finding shortest hop paths and employing particular tie-breaking mechanisms. The mechanisms can be divided into two categories: those that use simple knowledge of the cardinality of a neighbor's neighbor set and those that rely on knowledge of a distance-monotonic metric to a neighbor. We compare five heuristics based on communication cost and also on energy and processing costs. For smaller configurations, the performance of the heuristics are also compared to the optimal. With the proposed approaches, it is possible to build a cost efficient data gathering tree which takes advantage of the data redundancy among closely located sensors.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:ruyezt5ZtCIC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "CNSR 2011",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5771232/",
            "Abstract": "Organizing Committee Page 1 Organizing Committee CNSR 2011 Honorary Conference \nChair Jeremiah F. Hayes, Concordia University, USA General Conference Chair Ioannis \nLambadaris, Carleton University, Canada Technical Program Co-chairs Yannis Viniotis, \nNorth Carolina State University, USA F. Richard Yu, Carleton University, Canada Ioanis \nNikolaidis, University of Alberta, Canada Tutorials and Workshops Chair Ramiro Liscano, \nUniversity of Ontario Institute of Technology, Canada Publication Chair Wei Song, \nUniversity of New Brunswick, Canada Finance Chair Lori Tozer, University of New \nBrunswick, Canada Steering Committee Jalal Almhana, Université de Moncton, Canada \nZhizhang (David) Chen, Dalhousie University, Canada Ali Ghorbani, University of New \nBrunswick, Canada Jacek Ilow, Dalhousie University, Canada Brent R. Petersen, University \nof New Brunswick, Canada Bradford Nickerson, …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Java Microarchitectures [Book Review]",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1020225/",
            "Abstract": "Compared to other books in the Cisco Press series that cater to the needs of readers preparing for certification levels, the book by Mervana and Le includes a proportionally large fraction of material that is not specific to Cisco equipment configuration. The distinguishing feature of the book is that digital subscriber line (DSL) technology is presented in the context of how service providers (CLECs or ILECs) can design and implement a scalable network in order to offer voice, video, and data services. It therefore targets a mixed audience, of technologists interested in Cisco offerings in the area of DSL-based networks and of service providers interested in how to leverage DSL technology. Naturally, the introductory chapter dedicates a number of pages to explaining the evolution and architecture of the telephone network, leading to a chapter on the basic DSL technologies (ADSL, VDSL, SDSL, IDSL, G. shds1) and a …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the application of pipelining in aggregation convergecast scheduling",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6583392/",
            "Abstract": "We consider the problem of scheduling wireless transmissions in a sensor network to perform aggregation convergecast. In contrast to studies that attempt to shorten the schedule for completing a single data collection cycle, we aim to increase the frequency at which updates are collected (higher throughput). To achieve higher throughput, we use a form of pipelined concurrent collection of multiple data snapshots through the network. To attain high performance pipelining, we “expand” the time in which precedence constraints need to be satisfied such that they span over multiple schedule cycles. Our approach involves the unconventional approach of constructing the schedule before finalizing the exact form of the precedence constraints, i.e., before determining the data aggregation tree, which in turn requires that the schedule construction phase guarantees that every node can reach the sink. We compare our …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:yB1At4FlUx8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Role of Technology in Therapeutic Environments for Seniors with Mental Health and Other Complex Needs",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=3986771384630605781&hl=en&oi=scholarr",
            "Abstract": "PURPOSE Through a literature review, examine the role of technology in the living environments of older adults with complex needs. We define complex needs as limitations in physical or mental functioning or social connectedness to the extent that individuals may be at risk for further decline in health status.PROCEDURES A search of English language literature published after 2000 relating to technologies to support older adults in their living environment was undertaken utilizing various health care and computer science databases. Papers were extracted from Cinahl, Scopus, IEEE Xplorer, ACM library, and ISI Web of Knowledge databases using the following search terms alone or in combination using the logical operators of “AND” and “OR”:“smart home”,“health”,“gerontechnology”,“assisted living”,“tech*”,“monitoring”,“older adults”,“telesurveillance”,“telemonitoring”,“older adult”,“senior”,“elderly”.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:HDshCWvjkbEC",
            "Publisher": "OXFORD UNIV PRESS INC"
        },
        {
            "Title": "Malware, Fighting Malicious Code [Book Review]",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3282958_Malware_Fighting_Malicious_Code_Book_Review/links/00b7d537be2dd3c0d6000000/Malware-Fighting-Malicious-Code-Book-Review.pdf",
            "Abstract": "I-. _I extensions), mobility in IPv6, mobility management using SIP, cellular IP, and HAWAII, while on the 3GPP side we find a description of packet mobility management (PMM) and related topics. The third theme, security, covers PKI, IPSec, and AAA, recapping security as implemented in GSM, IS-41, and GPRS, and extending over to 3GPP security, which is clearly heavily influenced by GSM's security architecture. Finally, the quality of service (QoS) theme is a distilled description of IntServ and DiffServ, as well as policybased QoS, as far as the IP side is concerned, while QoS in 3GPP/3GPP2 is exemplified in the UMTS QoS model, and how 3GPP2's QoS architecture cnvisions providing QoS qualifiers.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:AvfA0Oy_GE0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The smart condo: integrating sensor networks and virtual worlds",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1988051.1988061",
            "Abstract": "The term\" Smart Home\" refers to a home that has both a set of sensors to observe the environment and a set of actuators to automatically control home devices to improve the occupants' experience. A Smart Home has the potential to provide a variety of services based on information gleaned by data recorded by a multiplicity of sensor types, but also requires a systematic means (a) of abstracting differences among sensor types and (b) of supporting services and their rapid development. In this paper, we describe our approach towards meeting those needs, including a component of sensor adapters and a language for modeling person activities that can guide the development of health-care services.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling Pairwise XOR Network Coding In Duty-Cycled Wireless Sensor Networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8392576/",
            "Abstract": "Transceiver duty-cycling (DC) is a popular technique to conserve energy in a wireless sensor network (WSN). In our previous work [SoICT 2016: 187-194], we introduce a modeling approach for wireless networks of time-varying topology whose nodes duty cycle periodically. By switching nodes (transceivers) OFF, we however inescapably reduce the attainable throughput to a certain degree. For the throughput reduction problem, in this paper, we consider the application of XOR-pairwise network coding (NC) approach to by combining packets destined for distinct users. Through numerous simulation studies and in comparison with the per-flow rates produced by the optimization step without NC, we found that the NC is really efficient and applicable to arbitrary topology DC WSNs for improving the total throughput of the networks although it may change the maxmin rate allocation to individual flows.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Certain limitations of reputation--based schemes in mobile environments",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1089444.1089448",
            "Abstract": "Cooperation based on reputation--based trust schemes in mobile ad hoc networks has been proposed with the intention of securing networks against possible selfish behavior. Selfishness is defined as refusal of (non--malicious) nodes to participate in network activities such as packet forwarding. We analyze the effectiveness of one such cooperation enforcement mechanism, namely reputation--based cooperation, using a simulated ad hoc network environment. The energy consumption of selfish nodes is also analyzed, to identify whether selfish behavior is actually beneficial to a node, and thus, whether selfish behavior is something that might actually be observed in a real ad hoc network. We find that reputation--based cooperation enforcement is only effective in non--mobile ad hoc network environment, however, we also find evidence that selfish behavior may not have benefits when the cost of energy …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards scalable VoD distribution on the Internet",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/918637/",
            "Abstract": "Recent advances in the construction of broadcast schedules allow the bandwidth-efficient distribution of Variable Bit Rate (VBR) encoded video. Furthermore, most users are no longer severely limited by their local storage requirements, but are still limited in terms of available bandwidth. We examine an architecture that allows scalable video-on-demand (VoD) delivery, given bandwidth restrictions along the path from the distribution (video server) point to the user access point. We assume the use of a reservation scheme, such as RSVP, and we describe how a protocol based on a VoD broadcast algorithms can be deployed over a reservation- and multicast-capable Internet.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:uLbwQdceFCQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PicOS & VNETI-Enabling Real Life Layer-less WSN Applications.",
            "Publication year": 2012,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1061.7750&rep=rep1&type=pdf",
            "Abstract": "Networks are traditionally built around a stack of layers, but in the simple devices of a wireless sensor network, the costs associated with this approach become significant. In response, researchers have developed a number of lowfootprint operating systems that take non-traditional approaches to network abstractions, but at the same time, still simplify software development. In these approaches, some elements of modularity are valuable to retain, eg, packet buffer management, which can be factored out of the layers and supported by a generic interface. In this paper, we describe the PicOS operating system with its versatile network interface (VNETI) and describe our experience using it. VNETI’s approach to the problem, where it acts as a mediator between (a) the application programming interface (API),(b) protocol plug-ins, and (c) a physical input/output (I/O) module, allows for an intuitive component-based design with low overheads. With our essentially layer-less approach to networking, we have found it intuitive to incorporate even the simplest devices into non-trivial networks.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The switch book: the complete guide to LAN switching technology [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/885663/",
            "Abstract": "ferences of switching at Layers 2, 3 or 4 are briefly discussed in the fourth chapter. Rather than hurt the value of the book, the lack of network layer specifics adds to the pleasure ofreading it. Indeed, if you are of the opinion that routing is the crucial techniquebehindnetworking, you will be rightlv immessed bv the oDtions",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:7T2F9Uy0os0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Selective Idling: An Experiment in Transport Layer Power-Efficient Protocol Implementation.",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=15413859812415680488&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:foquWX3nUaYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IEEE Network Magazine Reviewers/2004",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1383433/",
            "Abstract": "The publication offers a note of thanks to its reviewers. Reviewers' comments are an essential part of the process of creating a well written article capable of expressing theoretical content well with effective illustrations, tables and graphs.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Networking the Metaverses [Editor's Note]",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3283128_Networking_the_Metaverses_Editor's_Note/links/579d826e08ae6a2882f2ec2a/Networking-the-Metaverses-Editors-Note.pdf",
            "Abstract": "We would like to thank all the authors who submitted their articles to this special issue. Highlighting the significance and amount of research activities in this area, we received nearly eight times the number of articles that could be published, a number that was beyond any of our expectations. We are grateful to all the reviewers for their time and input in carefully reviewing all the articles and providing valuable review comments. Many thanks go to IEEE Network for giving us the opportunity to serve our community by putting together this special issue. We would like to thank the Editor-in-Chief, Ioanis Nikolaidis, for giving support and guidance during the whole process of this special issue, and the liaison editor, Paolo Giacomazzi, for providing valuable comments in making the final decisions. We would also like to thank the previous Editor-in-Chief, Chatschik Bisdikian, for his support and encouragement during the early stages of this special issue. In addition, we are thankful to Sue Lange, the Digital Production Manager, and all other publication staff for their support and help during the publication process. It is our hope that the articles included in this special issue present a good snapshot of the latest research advances in broadband access networks and become an important reference for researchers and practitioners in the area. Finally, we hope that the readers of IEEE Network will find this special issue timely, informative, and enjoyable.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:eflP2zaiRacC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Alternative Paths vs. inaccurate link state information in realistic network topologies",
            "Publication year": 2002,
            "Publication url": "http://senserf.com/pg/PAPERS/spects02.pdf",
            "Abstract": "Department of Computing Science University of Alberta Edmonton, Alberta, CANADA T6G 2E8 yanxia, yannis, pawel¡@ cs. ualberta. ca",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient aggregation using first hop selection in WSNs",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSNET.2008.019252",
            "Abstract": "We study the approaches to extending the lifetime of Wireless Sensor Networks (WSNs) based on in-network data aggregation at the First Hop (FH) away from each sensor data source, followed by flow-based routing of the resulting traffic. We introduce the concept of flow loss multiplier to express the impact of data aggregation on the conveyed data. A Mixed Integer Linear Programming (MILP) model is formulated for the problem of determining the optimal FH aggregation nodes that maximise network lifetime. Heuristics are proposed to obtain significant aggregation and to prolong the system lifetime. To facilitate performance evaluation, we adopt a flow loss multiplier that depends on the spatial relationship among sensed areas. Simulation results show that FH aggregation provides significant increase in network lifetime for both flow-based and tree-based delivery schemes, and that flow-based mechanisms …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:BqipwSGYUEgC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Distributed and Efficient Classifiers for Wireless Audio-Sensor Networks",
            "Publication year": 2008,
            "Publication url": "https://era.library.ualberta.ca/items/ae5826fa-3ed1-4336-b76a-8a71a4edc7ce",
            "Abstract": "We consider the problem of vehicle classification using acoustic signals captured within a sensor network. The sensors perform collaborative decision and/or data fusion in a distributed and energy efficient manner. We present a distributed cluster-based algorithm, where sensors form clusters on-demand for the sake of running the classification task. We aim at minimizing the energy costs incurred due to the transmission of the feature vectors among collaborating sensors within a cluster. To this end, we present schemes to generate effective feature vectors of low dimension. An experimental study has been conducted using real acoustic signals of military vehicles recorded during DARPA’s Sensit/IXOs project. The features generated through our proposed schemes are evaluated using K-Nearest Neighbor (-NN) and Maximum Likelihood (ML) classifiers. Performance results indicate that the proposed schemes are effective in terms of classification accuracy, and can even outperform previously proposed approaches, but, in addition, they are also efficient in terms of communication overhead.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TagNet: toward tag-based sentiment analysis of large social media data",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8365992/",
            "Abstract": "Hashtags and replies, originally introduced on Twitter, have become the most popular ways to tag short messages in social networks. While the primary uses of these human-labeled metadata are still for message retrieval and clustering, there have been increasing attempts to use them as subject or topic indicators in measuring people's continuous sentiments in large message corpora. However, conducting the analysis for large social media data is still challenging due to the message volume, heterogeneity, and temporal dependence. In this paper, we present TagNet, a novel visualization approach tailored to the tag-based sentiment analysis. TagNet combines traditional tag clouds with an improved node-link diagram to represent the time-varying heterogeneous information with reduced visual clutter. A force model is leveraged to generate layout aesthetics from which the temporal patterns of tags can be easily …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new aggregate local mobility (ALM) clustering algorithm for VANETs",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5501789/",
            "Abstract": "We present a beacon-based clustering algorithm aimed at prolonging the cluster lifetime in VANETs. We use a new aggregate local mobility criterion to decide upon cluster re-organisation. The scheme incorporates a contention method to avoid triggering frequent re-organisations when two clusterheads encounter each other for a short period of time. Simulation results show a significant improvement of cluster lifetime and reduced node state/role changes compared to previous popular clustering algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the advantages of lifetime and RTT classification schemes for TCP flows",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1203712/",
            "Abstract": "We study classification schemes for TCP flows based on (a) lifetime (short vs. long lived flows) and (b) round-trip-time (RTT) attributes, as well as their combinations. The double objective served by the classification schemes is to satisfy the need for reduced response time, which is the primary concern of short lived flows, while at the same time ensuring fairness among long lived flows. The presented results indicate that the combined classification performs, under all tested case, comparably or better than RED and, as such, it is a reasonable alternative to the cumbersome task of properly parameterizing RED. In fact, the presented combined classification schemes achieve results equal or better than simple RED even when used in conjunction with DropTail queue management.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The analysis of the additive-increase multiplicative-decrease MAC protocol",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6578335/",
            "Abstract": "The additive-increase multiplicative-decrease MAC (AIMD-MAC) protocol is a distributed multi-access algorithm proposed in our earlier work and it is controlled by three parameters: the update cycle, the additive increase term and the multiplicative decrease factor. It was designed to exploit the multi-packet reception (MPR) capability in wireless networks. We describe the AIMD-MAC protocol and study how the three parameters impact the performance of AIMD-MAC. We demonstrate that the AIMD-MAC with a suitable set of parameters can be adequately used in a dynamic wireless communication environment.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Crosstalk in WDM Communication Networks [Book Review]",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1020228/",
            "Abstract": "Compared to other books in the Cisco Press series that cater to the needs of readers preparing for certification levels, the book by Mervana and Le includes a proportionally large fraction of material that is not specific to Cisco equipment configuration. The distinguishing feature of the book is that digital subscriber line (DSL) technology is presented in the context of how service providers (CLECs or ILECs) can design and implement a scalable network in order to offer voice, video, and data services. It therefore targets a mixed audience, of technologists interested in Cisco offerings in the area of DSL-based networks and of service providers interested in how to leverage DSL technology. Naturally, the introductory chapter dedicates a number of pages to explaining the evolution and architecture of the telephone network, leading to a chapter on the basic DSL technologies (ADSL, VDSL, SDSL, IDSL, G. shds1) and a …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On coordination tools in the PicOS tuples system",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1988051.1988056",
            "Abstract": "In this paper, we discuss the most recent coordination extension to the PicOS-tuples environment, inspired, to a degree, by B-Threads and FACTS. We illustrate the extensions with two design patterns, highly useful in WSN computations, known as regulative superimposition and distributed detection. Those patterns are employed in a debugging protocol that retrieves snapshots of node states. We demonstrate how our new idioms can be propitious for separating concerns in WSN programming using tuples.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "WISH-RIBS: Broadcast Scheduling and Opportunistic Failure Recovery in Wireless Networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5489336/",
            "Abstract": "Broadcasting is an elementary problem in wireless networks in general, and energy-efficient solutions are important to resource-limited wireless sensor networks. This paper presents two contributions: (1) an (off-line) algorithm to produce an efficient wireless broadcast schedule, and (2) an (on-line) opportunistic recovery strategy from link failures that might occur during the execution of the broadcast protocol. In simulations we find that the proposed scheduling algorithm outperforms state-of-the-art solutions and that the link failure recovery strategy offers improved broadcast resilience across all studied scheduling strategies.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network Systems Design Using Network Processors [Book Review]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301013/",
            "Abstract": "resorting exclusively to Wireless Encryption Protocol (WEP) hashing, although WEP receives its due in one chapter. The remedy to the original problems of WEP is presented via an intioduction to 802.11 i, WPA, TKIP, and AES, hut in addition the reader learns about the benefits of deploying virtual private networks, as well as how 802.1~ and EAP can he used to secure enterprise environments. In fact, it attempts to separate home office security concerns (centered mostly around firewalls) from those of enterprise environments (presented primarily as a scalable authentication senices issue).",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ADSL, VDSL and multicarrier modulation [book review]",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/898814/",
            "Abstract": "A part of the Digital Subscriber Loop (DSL) technology is based on advances in the area of Multicarrier Modulation (MCM), an area which still receives the attention of intense research with the potential of more breakthroughs in the future. The book by John Bingham is targeted at engineers who are involved in the design of DSL systems, and MCM modems in particular. The book provides an exciting personal view about the important future work in the area, motivated by the fact that its retiring author will not be working on them while feeling the importance for new research in certain areas. The chapters include sections describing the “Unfinished Business” of the corresponding topic. Clearly,, graduate students and researchers will appreciate the guidance provided. A further feature to satisfy the intellectual appetite of readers are references to patents, that may not be known to the wider audience. The curious …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Other actions",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-51204-4.pdf",
            "Abstract": "Ad Hoc Networks - Springer Logo Springer Search Options Advanced Search Search Help \nSearch Menu » Sign up / Log in English Deutsch Academic edition Corporate edition Skip to: \nMain content Side column Home Contact Us Download Book (PDF, 44633 KB) Book Lecture \nNotes of the Institute for Computer Sciences, Social Informatics and Telecommunications \nEngineering Volume 184 2017 Ad Hoc Networks 8th International Conference, ADHOCNETS \n2016, Ottawa, Canada, September 26-27, 2016, Revised Selected Papers Editors: Yifeng \nZhou, Thomas Kunz … show all 2 hide ISBN: 978-3-319-51203-7 (Print) 978-3-319-51204-4 \n(Online) Download Book (PDF, 44633 KB) Download Book (ePub, 6791 KB) Table of contents \n(33 chapters) previous Page of 2 1.Front Matter Pages I-XIV Download PDF (113KB) 2.Wireless \nSensor Networks 1.Front Matter Pages 1-1 Download PDF (20KB) 2.Chapter Pages 3-14 , .…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Lossless Characteristic Compression Method for Continuous Arterial Pulse Waveforms",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6245803/",
            "Abstract": "Arterial blood pressure is one of the important biomedical waveforms that possess lots of important clinical and pathological information. This paper aims in designing a technique, which is called characteristic compression method, to perform almost loss less data compression for the continuous arterial blood pressure waveforms. This method uses the spline function to interpolate the original waveform at preselected sample points first. A fourth order spline function is considered with associated formulas in describing the coefficients of the function. A second stage compression is accompanied by using 12-bit digital data representation to store sample points and coefficients for each interval. Numerical simulation confirms that the proposed technique is feasible and does provide a very high compression rate and almost loss less reconstruction for the continuous arterial pulse wave.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ENCAST: energy-critical node aware spanning tree for sensor networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1429976/",
            "Abstract": "Spanning trees rooted at a sink node are often employed for data collection in sensor networks. The node's double task of sensing and forwarding traffic from other nodes results in energy depletion which is dependent on the constructed spanning tree. The approach taken in this paper is to extend the lifetime of a sensor network by judiciously recalculating the data collection tree to adjust it pro-actively before nodes fail due to total energy depletion. The proposed scheme attempts to make energy-critical nodes leaf nodes, or, as a last resort, to balance the traffic load handled by them. Additionally, an exponentially decaying threshold is used for adaptively characterizing nodes as critical. Simulations demonstrate significantly improved network lifetime but also point to the need to carefully set the thresholds for characterizing nodes as critical.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy inferno and nostalgic cow: Two practical applications for ad-hoc networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4297436/",
            "Abstract": "We present two example applications of wireless ad-hoc networks: fuzzy inferno and nostalgic cow. We then describe two general families of applications these two examples belong to. Finally, we mention our routing protocol, operating system and hardware that we used to implement and demonstrate these applications.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:p__nRnzSRKYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Firewalls: a complete guide [Books]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/826359/",
            "Abstract": "Firewalls: a complete guide [Books] Page 1 RIP: An Intra-Domain Routirig Pro to c o I Packet \nVideo Communica- tions ovet ATM Nefworks K. R. Rao ancl Zoi-an S. Boikovic, Prentice Hull, \n2000, ISBN 0-1 3-01 15 18-5, 420 pages, Iiordcover. 'I 'I I c 1) I it) k i'ii ck ct Vi& o Cowm i i w ico \ntioris over A'l.,M Nc/work,v pi~~~viclcs i~ god soiii'cc or' inlorriifiiioii lor Oic iictwork cxpcrt who \nwodd like ti) catch tip with tlic vitlcri stiinditrtls 011 MI'Lli tiiiel 1'I'U'l'. Iixtctisivc hiickgrriiind \ninfcirmtioii is provided oti viilco criiling tccfiiiiq~ics. 1 .;iycrctI cotling iiiitl sc;ilrhility Icchii iqiics \narc ills0 prcsciiicil. 13cspitc ils tillc, niitl fipirl frcm Ilic oiiqilinsis nil A'I'M', lllc hnok also riisciisscs \nthc inlc rif thc Iiitcriict iti cartyiiig vidco traffic ;is wcll ;is tlic rlistrihiition ot vidco ti-;d- fic i 11 \nwirclcss cnvi roii iiic iits. '['lie t;i rgc I iilldicncc ~ lj ~ ~ ~ ~ ~ lr ~ to I3c g~il~lll:llc 5111- rlcii1.s with \npart.iciilai, ii~lci'cst in I:he i'csc ii rcti d ircc t io 11 Fo I, ii cl.work-lxisctl viclco scrviccs, Tlic -c:…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A simple vehicle classification framework for wireless audio-sensor networks",
            "Publication year": 2008,
            "Publication url": "http://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-article-BAT8-0010-0030",
            "Abstract": "EN Vehicle tracking is one of the important applications of wireless sensor networks. We consider an aspect of tracking: the classification of targets based on the acoustic signals produced by vehicles. In this paper, we present a naive classifier and simple distributed schemes for vehicle classification based on the features extracted from the acoustic signals. We demonstrate a novel way of using Aura matrices to create a new feature derived from the power spectral density (PSD) of a signal, which performs at par with other existing features. To benefit from the distributed environment of the sensor networks we also propose efficient dynamic acoustic features that are low on dimension, yet effective for classification. An experimental study has been conducted using real acoustic signals of different vehicles in an urban setting. Our proposed schemes using a naive classifier achieved highly accurate results in classifying different vehicles into two classes. Communication and computational costs were also computed to capture their trade-off with the classification quality.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Node density and connectivity properties of the random waypoint model",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014036640400012X",
            "Abstract": "A frequently used mobility model for mobile ad hoc network (MANET) simulations is the random waypoint (RWP) model. We study the properties exhibited by RWP, with a focus on the impact of the rectangular boundary and the speed of the mobile nodes moving within the boundary. The most notable result is that the average node density within the rectangle is non-uniform, contrary to what is frequently assumed. The density, in fact, does depend on the speed of the nodes. Only at high mobility speeds, and in the asymptotic sense, does the density become approximately uniform. The direct implications of the non-uniformity are studied from the point of view of network connectivity. It is found that higher mobility speed results in better connectivity. We also find that irrespective of the speed, when multiple connected components are present, they typically consist of a very large component and (potentially several …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:eMMeJKvmdy0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Evaluating and Improving the Energy Performance of School Buildings with a Proposed Real-Time Monitoring System",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8671347/",
            "Abstract": "Building energy consumption occupies a significant portion of the final energy consumption, and its trend is increasing. Due to a substantial contribution to the energy use of commercial sector by office buildings, much attention has been brought to them with energy-efficient measures. However, there are only a limited number of studies investigating the school building's energy consumption performance, especially in Canadian cold climate, which it allows opportunities for improving school building's energy efficiency. In this study, the historical electricity consumption and energy-related costs of Edmonton Catholic Schools are statistically analyzed. Energy benchmarking methods are applied to evaluate the energy performance of schools and categorize them. With the aim of improving the energy performance of school buildings by discovering energy saving opportunities existed in them, an electrical management …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The wireless application protocol [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3282782_The_wireless_application_protocol_Book_Review/links/00b7d537be2e5d3c95000000/The-wireless-application-protocol-Book-Review.pdf",
            "Abstract": "Steer your career into a bright future. Join our fast-paced team. We’ll reward you with challenges and acknowledge your accomplishments with professional growth and respect. To apply, please e-mail your resume with, Req.#. to: jobsOcoppermountain. com or mail to: Copper Mountain Networks, Ann: Staffing. 10145 Pacific Heights Blvd..# loo, San Diego, CA 92121. Fax:(858) 410-7351 EOE. jobs. coppermountain. co m improved code density over other RISC processors, an area where RISC architectures lag behind CISG architectures. In the age of mobile computing devices, less space, less memory, and simpler architecture are strong selling points. The ARM architecture is at the center of power-efficient computing. ARM processor cores are found today in cell phones, palmtops, and numerous other embedded devices. Steve Furber’s book covers the architecture, instruction set, assembly programming, and support mechanisms for high-level languages and building operating systems. However, several chapters of the book are devoted to the particular features of the ARM architecture and how they can be exploited. One such characteristic of ARM processors is the so-called Thumb instruction set, the specific instruction set “compression” approach that gives ARM an edge over other RISC architectures. Thumb instructions are 16 bits long. The result is a40percent faster code compared to plain ARM code and, even more important, a 30 percent less external memory power compared toplain ARMcode. TheThumbinstructionset isexplainedindetail, both at the architectural and at the coding level. Next, the particular ways of integrating ARM …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Editor's note-wireless mesh networks: now in green too",
            "Publication year": 2008,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.ieee-art-000004519959",
            "Abstract": "Editor's note - wireless mesh networks: now in green too × Close The Infona portal uses \ncookies, ie strings of text saved by a browser on the user's device. The portal can access those \nfiles and use them to remember the user's data, such as their chosen settings (screen view, \ninterface language, etc.), or their login data. By using the Infona portal the user accepts \nautomatic saving and using this information for portal operation purposes. More information on \nthe subject can be found in the Privacy Policy and Terms of Service. By closing this window the \nuser confirms that they have read the information on cookie usage, and they accept the privacy \npolicy and the way cookies are used by the portal. You can change the cookie settings in your \nbrowser. I accept Polski English Login or register account remember me Password recovery \nINFONA - science communication portal INFONA Search advanced search Browse series - …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of RSS-based Position Tracking using WSNs for Resource Localization in an Indoor Construction Environment.",
            "Publication year": 2013,
            "Publication url": "https://www.scitepress.org/Papers/2013/42743/42743.pdf",
            "Abstract": "Timely information of construction resource is always a concern and an essential task for construction engineers and managers. In the recent past, Wireless Sensor Networks (WSNs) have emerged as a promising means to improve the current construction localization applications due to the ease of deployment and expandability to large scale construction projects, low cost, and capacity to function efficiently under dynamic and rough environments. Received Signal Strength Indicator (RSSI) based localization is a popular technique especially for indoor environments, where satellite based positioning is infeasible. This study evaluates multilateration localization, a popular localization technique, in construction environments as well as a second, profiling-based, localization technique. Both techniques RSSI values collected in a WSN. Indoor experiments were conducted and their results reveal that acceptable position accuracy can be obtained with the profiling-based architecture.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:M7yex6snE4oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Feasibility of Time-Parallel Discrete Event Simulations Over Local and Wide Area Networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-0849-6_4",
            "Abstract": "Parallel applications rarely exhibit a linear speedup to the number of processing elements used. The obstacle is the limited overlap between communication and computation. This paper discusses how the speedup of Parallel Discrete Event Simulation (PDES) is influenced when implemented on a cluster of workstations, either on a Local or a Wide Area Network. We note that optimistic space—parallel PDES algorithms (Time Warp) allow the arbitrary overlap between computation and communication, but suffer in terms of performance because of (a) the frequent communication between the Logical Processes (LPs), (b) the frequent calculation of a distributed snapshot (in the form of the Global Virtual Time (GVT)), and (c) the inherent limit up to which any model can be topologically decomposed. On the other hand, time—parallel PDES algorithms are domain specific but posses the potential for unbounded …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Message from the WLN Co-Chairs",
            "Publication year": 2001,
            "Publication url": "https://www.computer.org/csdl/pds/api/csdl/proceedings/download-article/12OmNy2ah2j/pdf",
            "Abstract": "The workshop is composed of a number of technical and panel session that cover the state of the art in wireless local networks. It can be evidenced by the technical program, that Mobile Ad Hoc Networks and Personal Area Networks (as represented by Bluetooth) are central issues capturing the imagination of researchers, without neglecting the important research in the areas of dependability, security and Quality of Service.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:SpbeaW3--B0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Buffer Space Tradeoffs in Multi-hop Networks",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.6.6880&rep=rep1&type=pdf",
            "Abstract": "Я гвз ж и джг а б г йЋ ж зд ааг и гв в бйаи Й гд зигж Й в Й гжл ж в илгж в зий н и иж Й гЋз ил в и бгйви г йЋ ж зд ааги иг и в Й дг виз г к жий а ж й и в и и зз в иг и гж вг зИ К КИ жгйи жзК Ы бйа и гв ж зйаиз ви и и дгзз аЙ ин и и и з в а Йд и д ж б г бда б ви в в илгж Й а н ж к жий а ж й из з йв б ви аан л Дж и ж и в б ж ан в гвк в ви жгб и к лдг ви г в л и аагЙ и гв в жгйи в м а инЕК зд и из вий и к дд а Дд и гж ж в И дж и а ин г в ЙигЙ в а нзИ и КЕИ з в а Йд и гжл ж в в и ж ж зйаиз в Ц ви йи а о и гв г к а а йЋ ж зд жгб и дг ви г к л г и ви ж в илгж И вгж г з и джгк и зи гк ж аа д ж гжб в в и жбз г аг а в л и йи а о и гв в в ЙигЙ в ей а ин г з жк К Я бгвзиж и и и и зи ей а ин г з жк гж к жий а ж й из Д в и жбз г жгд ж и Е з к л в НК бгзи г и йЋ ж зд в и в илгж з и и зи в Й и гвзИ в ОК з в а к жий а ж й и мдагж з бйаи да д и зИ зз ви аан гаагл в и в ж а дж в да з г и гв жгйиЙ в К",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exact top-k queries in wireless sensor networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5590247/",
            "Abstract": "In this paper, we consider the exact top-k query problem in wireless sensor networks, i.e., where one seeks to find the k highest reported values as well as the complete set of nodes that reported them. Our primary contribution in this context is EXTOK, a provably correct and topology-independent new filtering-based algorithm for processing exact top-k queries. As a secondary contribution we confirm a previous result of ours by showing that the efficiency of top-k query processing algorithms, including EXTOK, can be further improved by simply choosing a proper underlying logical tree topology. We examine EXTOK's performance with respect to a number of parameters and different logical tree topologies while using both synthetic and real data sets. Our simulation reveal that EXTOK consistently outperforms the current state-of-the-art algorithm by a very significant margin and regardless of the underlying logical tree …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards Dynamic Wireless Capacity Management for the Masses",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-51204-4_13.pdf",
            "Abstract": "In this paper we speculate that, with the technological elements already in place, an automated dynamic management of the RF spectrum in urban residential settings will soon be possible. Dense urban environments are increasingly facing RF spectrum congestion, in particular in the ISM bands. The Internet of Things is only expected to add to the pressures. In this work we outline an architecture that will analyze and resolve spectrum congestion. We are motivated by the adaptive and modifiable nature of existing protocols, inspired by existing capacity planning and channel allocation schemes from cellular networks, and emboldened by the synergies possible via software–defined radios. The cloud computing infrastructure can be leveraged to perform most compute-intensive tasks required towards this goal. We are encouraged that the approach is viable by the relatively static, in the local sense, topology …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A robust positioning architecture for construction resources localization using wireless sensor networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6148050/",
            "Abstract": "This paper introduces a cost-effective and robust positioning architecture that relies on wireless sensor networks (WSNs) for construction resources localization. The architecture determines the location of mobile sensor nodes by evaluating radio signal strengths (RSS) received by stationary sensor nodes. Only a limited quantity of reference points with known locations and pre-calibrated RSS in relation to pegs are used to lock on the most likely position coordinates of a tag. Indoor experiments were conducted, revealing that acceptable position estimation with 1-2 m accuracy can be obtained with this flexible sensor network architecture. To simulate the dynamic setting of a construction site, controlled experiments were also conducted by parking a car at various locations in the testing environment in order to evaluate the impact of imposed obstacles on location estimation performance. This localization technique is …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Integrated Architecture for Information Systems based on Sensor Networks",
            "Publication year": 2010,
            "Publication url": "https://www.scitepress.org/Papers/2010/27983/27983.pdf",
            "Abstract": "In this paper, we describe SensorGIS, an integrated architecture for WSN applications. SensorGIS provides an integrated service-oriented architecture for collecting, archiving, analyzing, and visualizing sensor network data in a geographic information system (GIS). By using an extendible GIS framework as one of its user views, SensorGIS can contextually communicate the collected data, its trends, and distinct values of interest. In addition, it is designed in the service-oriented style and hence is extendible in terms of the analyses and visualizations. Finally, it integrates an online collaborative forum that enables annotation of the collected data with the users’ observations and interpretations.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PicOS & VNETI",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/Papers/2012/38068/38068.pdf",
            "Abstract": "In the simple devices used for wireless sensor networks, the costs associated with a layered approach can be significant. Small-footprint operating systems have been developed by adopting non-traditional approaches to network abstractions while still aiming to simplify software development. In these approaches, some elements of modularity are valuable to retain, eg, packet buffer management, which can be factored out of the layers and supported by a generic interface. In this paper, we describe the PicOS operating system with its versatile network interface (VNETI) and describe our experience using it. VNETI’s approach to the problem, where it acts as a mediator between (a) the application programming interface,(b) protocol plug-ins, and (c) a physical input/output module, allows for an effective component-based design with low overheads. With our essentially layer-less approach to networking, we have found it intuitive to incorporate even the simplest devices into nontrivial networks.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "2007: The End of the Incredible Shrinking Student Pool?[Editor's Note]",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4395104/",
            "Abstract": "LYT/EDIT NOTE/SEP Page 1 IEEE Network • November/December 2007 Director of Magazines \nThomas F. La Porta, Penn. State Univ., USA Editor-in-Chief Ioanis Nikolaidis, U. of Alberta, \nCanada Associate Editor-in-Chief Chatschik Bisdikian, IBM Research, USA Senior Technical \nEditors Thomas M. Chen, Southern Methodist U., USA Yi-Bing (Jason) Lin, National Chiao Tung \nUniv., Taiwan Peter O’Reilly, Northeastern Univ., USA Technical Editors Feature Editors IEEE \nProduction Staff 2007 IEEE Communications Society Officers Nim Cheung, President Sergio \nBenedetto, VP–Technical Activities Harvey Freeman, VP–Membership Services Byeong Gi \nLee, VP–Membership Development Doug Zuckerman, VP–Society Relations Doug Zuckerman, \nPresident-Elect Stan Moyer, Treasurer John M. Howell, Secretary Board of Governors \nThe elected officers above plus Members-at-Large: Class of 2007 Len Cimini — Jerry — .…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A DAG-based approach to wireless scheduling",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1494986/",
            "Abstract": "We consider the problem of transmission scheduling in wireless networks. A good transmission scheduling scheme should not only be conflict-free, in the sense of resolving collisions and the hidden terminal problem, but should also provide fairness and transmission efficiency to each node. We propose a class of scheduling schemes that rely on the logical ordering of the schedule update operations. The ordering is imposed by the precedence relationship of vertices in a directed acyclic graph (DAG). Two examples of establishing the logical DAG are given: (a) one relies on a distributed spanning tree construction; (b) one is based on location information. A separate mechanism ensures that nodes do not behave in a greedy fashion and monopolize the schedule slots. We prove the correctness of DAG-based schemes and provide simulation results that demonstrate their fairness and efficiency attributes.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Infiniband Network Architecture [Book Review]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1265825/",
            "Abstract": "The Ncw Books and Multimedia column contains hricf reviews of new hooks in the computer communications field. Each review includes a highly abstracted dcscription of the contents, relying on the publisher's descriptive materials, minus advertising superlatives, and checked for accuracy against a copy of the book. The reviews also comment on the structure and the target audiencc of each hook. Publishers wishing to havc their books listed in this manner should send copies and appropriate advertising materials to Ioanis Nikolaidis at the address below, with an indication that books arc intended for the IEEE Network New Books and Multimedia column. Appropriate books will he reviewed in the column. loanis Nikolaidis Conipiifing Scierice Depanmenl, Univer. si@ of Albenu, Edmonton, Alberta. Canado T6G 2E8 hfiniband Network Architecture",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:UHK10RUVsp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monitoring exact top-k values in wireless sensor networks using dominating set trees",
            "Publication year": 2009,
            "Publication url": "https://scholar.archive.org/work/ibqfe5uzjfawxdtilrn4z3jxcy/access/wayback/https://era.library.ualberta.ca/items/c687df4f-00a9-441e-a4a8-5f52c39d7fed/view/da4130b1-efc1-4ecc-84a9-dded08980471/TR09-01.pdf",
            "Abstract": "Top-k queries form an important class of aggregation queries in wireless sensor networks. Unlike previous proposals we consider the exact top-k values query problem, ie, where one seeks to find exactly all k highest unique values in the network regardless of how many nodes report it. Previous proposals also did not pay due attention to the underlying logical tree topology used for data aggregation and forwarding. In this context, this paper presents two main contributions:(1) we propose the use of a particular tree topology, based on Dominating Sets, which is well suited to explore the network’s physical topology for processing top-k queries efficiently; and (2) we propose EXTOK, a filtering-based algorithm for processing the exact top-k values query, we also prove its correctness and investigate its performance with respect to a number of parameters, including network link failures. In all examined cases, EXTOK performs consistently well while effectively exploiting the proposed logical tree topology and it is also resilient to link failures.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:q3CdL3IzO_QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RIP: an intro-domain routing protocol [Books]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/826360/",
            "Abstract": "RIP: an intro-domain routing protocol [Books] Page 1 RIP: An Intra-Domain Routirig Pro to c o I \nPacket Video Communica- tions ovet ATM Nefworks K. R. Rao ancl Zoi-an S. Boikovic, \nPrentice Hull, 2000, ISBN 0-1 3-01 15 18-5, 420 pages, Iiordcover. 'I 'I I c 1) I it) k i'ii ck ct Vi& o \nCowm i i w ico tioris over A'l.,M Nc/work,v pi~~~viclcs i~ god soiii'cc or' inlorriifiiioii lor Oic \niictwork cxpcrt who wodd like ti) catch tip with tlic vitlcri stiiiiditrtls 011 MI'Lli tiiiel 1'I'U'l'. Iixtctisivc \nhiickgrriiind infcirmtioii is provided oti viilco criiling tccfiiiiq~ics. 1 .;iycrctI cotling iiiitl sc;ilrhility \nIcchii iqiics arc ills0 prcsciiicil. 13cspitc ils tillc, niitl fipirl frcm Ilic oiiqilinsis nil A'I'M', lllc hnok \nalso riisciisscs thc inlc rif thc Iiitcriict iti cartyiiig vidco traffic ;is wcll ;is thc rlistrihiition ot vidco \nti-;d- fic i 11 wirclcss cnvi roii iiic iits. '['lie t;i rgc I iilldicncc ~ lj ~ ~ ~ ~ ~ lr ~ to I3c g~il~lll:llc 5111- \nrlcii1.s with part.iciilai, ii~lci'cst in I:he i'csc ii rch d ircc t io 11 Fo I, ii cl.work-lxisctl viclco , Tlic -c…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Supporting wireless application development via virtual execution",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4747342/",
            "Abstract": "We introduce our ldquoholisticrdquo platform for building wireless ad hoc sensor networks and focus on its most representative and essential virtualization component: VUE 2  (the Virtual Underlay Emulation Engine). Its role is to provide a vehicle for authoritative emulation of complete networked applications before physically deploying the wireless nodes. The goal is to be able to verify those applications exhaustively before programming the hardware, such that no further (field) tests are necessary. We explain how VUE 2  achieves this goal owing to several facilitating factors, most notably the powerful programming paradigm adopted in our platform. As implied by the holistic nature of the discussed system, our presentation touches upon operating systems, simulation, network protocols, real-time systems, and programming methodology.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ad-Hoc, Mobile, and Wireless Networks: Third International Conference, ADHOC-NOW 2004, Vancouver, Canada, July 22-24, 2004, Proceedings",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=cVIGCAAAQBAJ&oi=fnd&pg=PA1&dq=info:Z3V2PIz0ezYJ:scholar.google.com&ots=nB9RD-yEOf&sig=HQLDae5Zu8yRtNoQ369gkzbuf5k",
            "Abstract": "This book constitutes the refereed proceedings of the Third International Conference on Ad-Hoc Networks and Wireless, ADHOiNOW 2004, held in Vancouver, Canada in July 2004. The 22 revised full papers and 8 revised short papers presented were carefully reviewed and selected from more than 150 submissions. All current aspects of ad-hoc networking, sensor networks, mobile, wireless, and cooperating communication systems are addressed including, multicast, broadcast, performance, QoS, routing protocols, scalability, security, hybrid networks, self-organization, auto-configuration, energy consumption, peer-to-peer systems, and MAC protocols.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:mB3voiENLucC",
            "Publisher": "Springer"
        },
        {
            "Title": "Balancing Energy Harvesting and Transmission Scheduling in Aggregation Convergecast",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3242102.3242132",
            "Abstract": "We study tradeoffs between aggregation convergecast and energy harvesting in wireless sensor networks. Existing aggregation convergecast algorithms do not capture the volatile nature of energy reserves of energy harvesting nodes. We therefore propose, and evaluate, new scheduling schemes to address this gap. We also introduce metrics to capture the impact of the inevitable energy depletion on the quantity of aggregated data received at a sink node. Specifically, we consider node behaviors where the inability to perform prompt communication due to energy depletion results in a reduction of the sampling rate (including for aggregated data) and, if it persists, loss of data. The performance evaluation is based on heat flow data collected from an apartment building in the Canadian North. The collected heat flow data are used to approximate the energy harvesting output of thermoelectric harvesters.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Co-simulation Platform for Evaluating Cyber Security and Control Applications in the Smart Grid",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9149212/",
            "Abstract": "The growing adoption of Distributed Energy Re-sources (DER) in low-voltage distribution grids calls for new feedback control algorithms that rely on quasi-real-time data collected by remote sensors. The design and evaluation of such algorithms necessitates a prudent and comprehensive approach since these algorithms require a tight integration of power and communication systems. A simple link failure or a sophisticated cyberattack launched against the grid's monitoring, communication, and control infrastructure could rapidly grow out of control, making the grid unstable. We investigate the design and implementation of a high-fidelity smart grid simulation platform which integrates a network simulator and a power flow simulator using the Mosaik co-simulation framework. The platform allows for evaluating the performance of new control algorithms and understanding dynamics of modern distribution grids …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:oNZyr7d5Mn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiple path routing in networks with inaccurate link state information",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/936616/",
            "Abstract": "We study a collection of K-shortest path routing schemes and investigate their performance under a diverse set of network topologies and traffic conditions. We subsequently demonstrate that K-shortest path routing offers a lower blocking probability and more balanced link utilisation than other routing methods. With the proposed approach, it is possible to reduce the frequency of link state exchange, and the incurred bandwidth overhead, without sacrificing the overall performance of the network.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:tkaPQYYpVKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Communications technology explained [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/885661/",
            "Abstract": "James Carlson, 2000, Addison-Wesley, 0-20 1-70053-0, 400 pages, softcover, CD-ROM included This is the second book encountered in recent months devoted, heart and soul, to the presentation, implementation, debugging, and, finally, appreciation of a particular network protocol (the previous one beingL2TPbyRichard Shea). The book is primarily aimed at programmers implementing PPP or users and administrators troubleshooting PPP installations. To James Carlson’s advantage, PPP is a very well-known protocol that has already reached a remarkable level of maturity. To the general audience considering PPP, still an alternative to SLIP, it should be pointed out that PPP currently provides load balancing between different lines, multilink capabilities, forms of bandwidth management, and so on, and can routinely be tunneled around the Internet or sent over Ethernets. PPP can coexist with a remarkable variety …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Editor's note-the end of the internet (revisited)",
            "Publication year": 2008,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.ieee-art-000004435895",
            "Abstract": "Editor's note - the end of the internet (revisited) × Close The Infona portal uses cookies, ie \nstrings of text saved by a browser on the user's device. The portal can access those files and \nuse them to remember the user's data, such as their chosen settings (screen view, interface \nlanguage, etc.), or their login data. By using the Infona portal the user accepts automatic saving \nand using this information for portal operation purposes. More information on the subject can \nbe found in the Privacy Policy and Terms of Service. By closing this window the user confirms \nthat they have read the information on cookie usage, and they accept the privacy policy and \nthe way cookies are used by the portal. You can change the cookie settings in your browser. \nI accept Polski English Login or register account remember me Password recovery INFONA \n- science communication portal INFONA Search advanced search Browse series books × - (I…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sampling and classifying interference patterns in a wireless sensor network",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2379799.2379801",
            "Abstract": "The low-powered transmissions in a wireless sensor network (WSN) are highly susceptible to interference from external sources. Our work is a step towards enabling WSN devices to better understand the interference in their environment so that they can adapt to it and communicate more efficiently. We extend our previous work in which we collected received signal strength traces using mote-class synchronized receivers at sample rates that are, to the best of our knowledge, higher than previously described in the literature. These traces contain distinct interference patterns, each with a different potential for being exploited by cognitive radio strategies. In order to exploit a pattern, however, a node must first recognize it. Given the energy and space constraints of a node, we explore succinct decision tree classifiers for the two most disruptive patterns. We expand on a basic feature set to incorporate attributes based …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:WqliGbK-hY8C",
            "Publisher": "ACM"
        },
        {
            "Title": "Developing wireless sensor network applications in a virtual environment",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-009-9246-x",
            "Abstract": "We describe our “holistic” platform for developing wireless ad hoc sensor networks and focus on its most representative and essential virtualization component: VUE2 (the Virtual Underlay Emulation Engine). Its role is to provide a vehicle for the authoritative emulation of complete networked applications before physically deploying any wireless nodes. The goal is to be able to verify those applications exhaustively before programming the hardware, such that no further (field) tests are necessary. We explain how VUE2 achieves this goal owing to several facilitating factors, most notably the powerful programming paradigm that our platform adopts. As implied by the holistic nature of the discussed system, our work touches upon operating systems, simulation, network protocols, real-time systems, and programming methodology.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:blknAaTinKkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "On Voyeuristic Protocols [Editor's Note]",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4277240/",
            "Abstract": "LYT/EDIT NOTE/SEP Page 1 IEEE Network • July/August 2007 Director of Magazines Thomas \nF. La Porta, Penn. State Univ., USA Editor-in-Chief Ioanis Nikolaidis, U. of Alberta, Canada \nAssociate Editor-in-Chief Chatschik Bisdikian, IBM Research, USA Senior Technical Editors \nThomas M. Chen, Southern Methodist U., USA Yi-Bing (Jason) Lin, National Chiao Tung Univ., \nTaiwan Peter O’Reilly, Northeastern Univ., USA Technical Editors Feature Editors IEEE \nProduction Staff 2007 IEEE Communications Society Officers Nim Cheung, President Sergio \nBenedetto, VP–Technical Activities Harvey Freeman, VP–Membership Services Byeong Gi \nLee, VP–Membership Development Doug Zuckerman, VP–Society Relations Doug Zuckerman, \nPresident-Elect Stan Moyer, Treasurer John M. Howell, Secretary Board of Governors The \nelected officers above plus Members-at-Large: Class of 2007 Len Cimini — Jerry Gibson — of …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Dynamic Bandwidth Allocation Scheme Based on Lifetime Classification",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=16181678848050482000&hl=en&oi=scholarr",
            "Abstract": "TCP flows are sensitive to environment parameters: the amount of of scarce resource they compete, and the competitive capability of TCP flows. With 95% of Internet traffic today are delivered by TCP traffic, more that 80% of traffic are delivered by a few long-lived TCP flows and the inherent heterogeneous RTT of TCP flows due to geographical distribution, classification schemes based on the lifetime were proposed to provide better quality of service. In this study, we present the basis of a mechanism for dynamic allocation of bandwidth between the class of short-lived flows and the class of long-lived flows, intending to improve the responsive delay of short-lived TCP flows.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pearson PTR interactive's complete Red Hat Linux training course",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=2745485296811772061&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC"
        },
        {
            "Title": "Modeling aggregation convergecast scheduling using constraints",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2068897.2068937",
            "Abstract": "We consider the transmission scheduling problem for aggregation convergecast in wireless sensor networks. All transmissions required for a completed data collection to the sink node are to be scheduled in a single TDMA frame. Concurrent transmissions are possible within each TDMA slot as long as no collisions occur at the intended recipients of each transmission. We observe that previously proposed heuristics to solving the aggregation convergecast scheduling problem rely on a decomposition into two phases. The first phase is the construction of an aggregation tree, typically a Shortest Path Tree (SPT), and the second phase is scheduling transmissions. We express the constraints of the aggregation convergecast problem in a manner compatible with a constraint programming solver, and extract solutions for small sized instances. The, admittedly sparse, evidence suggests that the resultant aggregation …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Risk homeostasis and network security [Editor's Note]",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4804316/",
            "Abstract": "This Special Issue is dedicated to the topic of network intrusion detection. The wide use of many varieties of intrusion detection systems reveals a certain degree of acceptance that, despite our best intentions for building secure systems, there is always enough opportunity for attacks, possibly exploiting weaknesses of the very systems we thought to be secure. Moreover, even though attacks usually follow patterns that can be subsequently used to detect them, they also happen to be the product of intelligent adversaries - humans. The ability to orchestrate ever more elaborate attacks, exhibiting patterns not seen before, means that we expect an IDS to be ready to discern new patterns found to be conceivably detrimental to the security requirements of a system. Intrusion detection systems are sometimes criticized as doing too little too late. However, there are cases where even a late response is better than no …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:N5tVd3kTz84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network Management, MlBs and MPLS [Book Review]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1265826/",
            "Abstract": "The Ncw Books and Multimedia column contains hricf reviews of new hooks in the computer communications field. Each review includes a highly abstracted dcscription of the contents, relying on the publisher's descriptive materials, minus advertising superlatives, and checked for accuracy against a copy of the book. The reviews also comment on the structure and the target audiencc of each hook. Publishers wishing to havc their books listed in this manner should send copies and appropriate advertising materials to Ioanis Nikolaidis at the address below, with an indication that books arc intended for the IEEE Network New Books and Multimedia column. Appropriate books will he reviewed in the column. loanis Nikolaidis Conipiifing Scierice Depanmenl, Univer. si@ of Albenu, Edmonton, Alberta. Canado T6G 2E8 hfiniband Network Architecture",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:dQ2og3OwTAUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smart homes and home health monitoring technologies for older adults: A systematic review",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1386505616300648",
            "Abstract": "Around the world, populations are aging and there is a growing concern about ways that older adults can maintain their health and well-being while living in their homes.The aim of this paper was to conduct a systematic literature review to determine: (1) the levels of technology readiness among older adults and, (2) evidence for smart homes and home-based health-monitoring technologies that support aging in place for older adults who have complex needs.We identified and analyzed 48 of 1863 relevant papers. Our analyses found that: (1) technology-readiness level for smart homes and home health monitoring technologies is low; (2) the highest level of evidence is 1b (i.e., one randomized controlled trial with a PEDro score ≥6); smart homes and home health monitoring technologies are used to monitor activities of daily living, cognitive decline and mental health, and heart …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:-_dYPAW6P2MC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Editor's Note-The Unbearable Simplicity of Being Neutral",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4133928/",
            "Abstract": "Editor's Note - The Unbearable Simplicity of Being Neutral Page 1 IEEE Network • March/April \n2007 Director of Magazines Thomas F. La Porta, Penn. State Univ., USA Editor-in-Chief Ioanis \nNikolaidis, U. of Alberta, Canada Associate Editor-in-Chief Chatschik Bisdikian, IBM Research, \nUSA Senior Technical Editors Thomas M. Chen, Southern Methodist U., USA Yi-Bing (Jason) \nLin, National Chiao Tung Univ., Taiwan Peter O’Reilly, Northeastern Univ., USA Technical \nEditors Feature Editors IEEE Production Staff 2007 IEEE Communications Society Officers Nim \nCheung, President Sergio Benedetto, VP–Technical Activities Harvey Freeman, \nVP–Membership Services Byeong Gi Lee, VP–Membership Development Doug Zuckerman, \nVP–Society Relations Doug Zuckerman, President-Elect Stan Moyer, Treasurer John M. Howell, \nSecretary Board of Governors The elected officers above plus Members-at-Large: Class of M…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:KUbvn5osdkgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Software engineering for health education and care delivery systems: The Smart Condo project",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5069602/",
            "Abstract": "Providing affordable, high-quality healthcare to the elderly while enabling them to live independently longer is of critical importance, as this is an increasing and expensive demographic to treat. Sensor-network technologies are essential to developing assisted living environments. In our Smart Condo project, we have deployed a sensor network with a variety of sensor types in an 850 square-foot condominium. The sensor network records a variety of events and environmental parameters and feeds the related data into our Web-based system. This system is responsible for inferring higher-order information about the activities of the condo's occupant and supporting the visualization of the collected information in a 2D Geographic Information System (GIS) and a 3D virtual world, namely Second Life (SL).",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sensor networks and the law of accelerating returns [Editor's note]",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3283180_Sensor_networks_and_the_law_of_accelerating_returns_Editor's_note/links/579d827408ae5d5e1e14c3a9/Sensor-networks-and-the-law-of-accelerating-returns-Editors-note.pdf",
            "Abstract": "LYT/EDIT NOTE/SEP Page 1 IEEE Network • July/August 2008 Director of Magazines Thomas \nF. La Porta, Penn. State Univ., USA Editor-in-Chief Ioanis Nikolaidis, U. of Alberta, Canada \nAssociate Editor-in-Chief Chatschik Bisdikian, IBM Research, USA Senior Technical Editors \nThomas M. Chen, Swansea U., UK Yi-Bing (Jason) Lin, National Chiao Tung Univ., Taiwan \nPeter O’Reilly, Northeastern Univ., USA Technical Editors Feature Editors IEEE Production Staff \n2008 IEEE Communications Society Officers Doug Zuckerman, President Andrzej Jajszczyk, \nVP–Technical Activities Mark Karol, VP–Conferences Byeong Gi Lee, VP–Member Relations \nSergio Benedetto, VP–Publications Nim Cheung, Past President Stan Moyer, Treasurer John \nM. Howell, Secretary Board of Governors The officers above plus Members-at-Large: Class \nof 2008 Thomas M. Chen, Andrea Goldsmith Khaled Ben-Letaief, Peter J. McLane Class …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Aggregation convergecast scheduling in wireless sensor networks",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-010-0282-y",
            "Abstract": "We consider the problem of scheduling in wireless sensor networks for the purposes of aggregation convergecast. We observe that existing schemes adopt essentially a two phase approach, consisting of, first, a tree construction and, second, a scheduling phase. Following a similar approach, we propose two new improvements, one to each of the two phases. Starting with a new lower bound on the schedule length, we make use of it in the tree construction phase. The tree construction phase consists of solutions to instances of bipartite graph semi-matchings. The scheduling phase is a weight-based priority scheme that obeys dependency (tree) and interference constraints. Our extensive experiments show that, overall, our proposed solution not only outperforms all previously proposed solutions in terms of schedule length, but it also significantly extends the network’s lifetime.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Wavelet-based analysis of interference in WSNs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7796860/",
            "Abstract": "Motivated by the computational, bandwidth and energy restrictions of wireless sensor network nodes and their need to, collectively, determine the presence of exogenous interference that could impair their communication, we consider schemes that could support the task of interference classification as a first step towards interference mitigation strategies. In particular, we examine the effectiveness of the Discrete Wavelet Transform (DWT) to communicate to other nodes the state of the channel, as sampled by a node, in a compressed, denoised form. We examine the suitability of different wavelet filters and thresholding methods in order to: (a) preserve key features of the interference, (b) denoise the noisy interference samples, and (c) reduce the amount of information that needs to be communicated to describe the interference.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:BwyfMAYsbu0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Buffer Space Tradeoffs for VoIP QoS in Deflection Networks",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.69.6656&rep=rep1&type=pdf",
            "Abstract": "We consider the issue of QoS (Quality of Service) in a network catering to isochronous VoIP (Voice over IP) sessions. Our simulation experiments strongly suggest that the single–path paradigm of implementing network–layer virtual circuits neither yields the best utilization of network resources (buffer space) nor is it able to provide the best end-to-end service in terms of loss rate and delay. Instead, it turns out that the dynamic exploration of alternative paths at the packet level, ie, asynchronous deflection routing assisted with small buffer space at the routers, results in a more efficient, and also more economical, delivery. By the latter we mean the lower overall buffer space requirements, aggregated over the routers as well as the end–points of the isochronous sessions.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An inherently loss-less and bandwidth-efficient periodic broadcast scheme for vbr video",
            "Publication year": 2000,
            "Publication url": "https://era.library.ualberta.ca/items/4bdd0609-29fd-4a82-9abb-1b4cfa87aaa9",
            "Abstract": "A key requirement for the successful deployment of Video-on-Demand (VoD) systems is to maintain both bandwidth efficiency as well as tolerable startup latency. The startup latency is defined as the interval between the point a user “tunes–in” to (starts downloading) the video content and the point at which the uninterrupted playout of the video can start. Periodic broadcast schemes have been proposed to solve the VoD distribution problem for the set of the most requested videos. However, the current proposals for periodic broadcast schemes assume CBR encoded videos. The few existing proposals for support of the bandwidth–efficient family of VBR encoded videos are available at the cost of data loss due to overflow of the broadcast link capacity by the aggregate traffic of the simultaneously transmitted segments. In this paper we address the issue of the VBR encoded video broadcast and we propose LLBE (a Loss–Less Bandwidth–Efficient scheme), which, in contrast to previous techniques for VBR video, is an inherently loss–less broadcast distribution scheme. Given ample client storage, LLBE can satisfy any a–priori prescribed per–video startup latency. In LLBE, the bandwidth necessary for the transmission and downloading of a video is minimized through an optimization process. We observe that the minimization of the server bandwidth can be stated as a shortest path problem. Finally, example performance results of LLBE and a discussion of some issues related to its implementation are presented.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient data collection trees in sensor networks with redundancy removal",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-28634-9_20",
            "Abstract": "In sensor networks, overlapping sensed areas result in the collection of partially redundant data. Interior sensor nodes along a data collection tree can remove redundancies and reduce the required bandwidth for the aggregate data. Assuming that the sensed information is proportional to the sensed area, we propose heuristic algorithms to build data gathering trees in order to reduce communication costs. The algorithms are completely distributed and are based on finding shortest hop paths and employing particular tie-breaking mechanisms. The mechanisms can be divided into two categories: those that use simple knowledge of the cardinality of a neighbor’s neighbor set and those that rely on knowledge of a distance–monotonic metric to a neighbor. We compare five heuristics based on communication cost and also on energy and processing costs. For smaller configurations, the performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:Se3iqnhoufwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Understanding internet protocols through hands-on programming [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3282780_Understanding_internet_protocols_through_hands-on_programming_Book_Review/links/00b7d537be2e61ad8d000000/Understanding-internet-protocols-through-hands-on-programming-Book-Review.pdf",
            "Abstract": "NEW BOOKS and MULTIMEDIA protocols rather than for writing applications. That is, socketsbased programming is not included in the book. Given the close relation of the example projects to the particular simulator, the accompanying CD-ROM includesversions of NW that run on Linux, Window, s and Solaris, while other systems can be supported by porting the source code (included as well). Of the suggested projects, a few introductory ones concern installing NW and trying an example topology. The really interesting parts start with data link protocols where bit stuffing, CRC, and ARQ protocols are presented along with a corresponding project for each. MAC protocols are represented by two chapters and an equal number of projects, one on Ethernet and one on token rings. Similarly, two chapters and two projects are related to the network layer, one dealing with shortest path calculation and one with link state updates. The transport layer includes only one project: naturally, building a reliable end-to-end protocol. The pleasant surprise is the inclusion of a project in multicasting, which boilsdown to theconstruction processof amulticast tree. The application layer chapter is accompanied by a list server project. Finally, a packet filtering project represents the security section. The appendices include a glossary, instructions for installing and using NW, and the NW header files.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The smart-condo: Optimizing sensor placement for indoor localization",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6915736/",
            "Abstract": "The Smart-Condo is a hardware/software platform that aims to support and assist an individual in performing a variety of everyday tasks within his/her living space. The key to achieving this goal is being able to recognize the individual's general activities in real-time, without impeding these activities or compromising privacy. Since location and movement constitute meaningful evidence for many everyday tasks (e.g., presence in the bathroom correlates with personal hygiene activities), we are motivated to develop an efficient, accurate, and noninvasive occupant-localization method. To this end, we propose a methodology for planning the deployment of an array of privacy-respecting binary motion sensors. In particular, given the geometric constraints of the deployment space, we generate a model of indoor mobility patterns typical for a single occupant. We then use this model as the basis for a specific optimization …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Editor's note-cross-layering: an issue of architecture?",
            "Publication year": 2008,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.ieee-art-000004476063",
            "Abstract": "Editor's note - cross-layering: an issue of architecture? × Close The Infona portal uses cookies, \nie strings of text saved by a browser on the user's device. The portal can access those files and \nuse them to remember the user's data, such as their chosen settings (screen view, interface \nlanguage, etc.), or their login data. By using the Infona portal the user accepts automatic \nsaving and using this information for portal operation purposes. More information on the \nsubject can be found in the Privacy Policy and Terms of Service. By closing this window the \nuser confirms that they have read the information on cookie usage, and they accept the privacy \npolicy and the way cookies are used by the portal. You can change the cookie settings in your \nbrowser. I accept Polski English Login or register account remember me Password recovery \nINFONA - science communication portal INFONA Search advanced search Browse series × - …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RSSI quantization and genetic algorithm based localization in wireless sensor networks",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870520300135",
            "Abstract": "This paper proposes a RSSI quantization and genetic algorithm based localization method. To quantize RSSI measurements from sensor nodes, we first divide sensing disks of nodes into multiple-rings and adopt genetic algorithm based on elitist preservation strategy to determine rings width. Secondly, we calculate the overlapping of rings and construct the mapping between a binary code sequence and the overlapping area. Thirdly, a density-based clustering algorithm is presented to solve the ambiguity of the target appearing area. Based on which, a two-stage centroid localization algorithm is proposed, which is especially useful for the case of irregular appearing area of the target. Finally, we construct an experimental environment to validate the performance of our algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:-FonjvnnhkoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Flexible On-Board Unit Architecture for Sensor Data and Fleet Management Services",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8633587/",
            "Abstract": "We present a flexible on-board unit (OBU) architecture that provides Vehicle-to-Everything (V2X) communication services. The architecture includes commercial off-the-shelf (COTS) hardware components and open source software components. A lambda-like architecture relegates the transfer of full-resolution bulk data over IEEE 802.11 without excluding the ability for high priority short messages to be sent via other means (DSRC, LTE, etc.). In addition to collecting data from the vehicle's sensors, an OBU can collect data from other, visited, sources, e.g., sensor networks operating within range. Bulk data transfers follow a Delay-Tolerant Networking (DTN) paradigm, by exploiting occasional encounters with other peers to perform data exchanges. In this paper, we summarize our experiences in developing such a system.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "fAARS: a platform for location-aware trans-reality games",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33542-6_16",
            "Abstract": "Users today can easily and intuitively record their real-world experiences through mobile devices, and commodity virtual worlds enable users from around the world to socialize in the context of realistic environments where they simulate real-world activities. This synergy of technological advances makes the design and implementation of trans-reality games, blending the boundaries of the real and virtual worlds, a compelling software-engineering problem. In this paper, we describe fAARS, a platform for developing and deploying trans-reality games that cut across the real and parallel virtual worlds, offering users a range of game-play modalities. We place fAARS in the context of recent related work, and we demonstrate its capabilities by discussing two different games developed on it, one with three different variants.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:EYYDruWGBe4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Patterns in the RSSI traces from an indoor urban environment",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5686963/",
            "Abstract": "Urban environments are notorious for their high spectrum usage, particularly in their unlicensed radio bands. Wireless sensor network (WSN) nodes incorporate modern transceivers that can measure the background noise/interference and change channels. These combined capabilities suggest the need to better understand urban environments so that nodes can better avoid competing devices. In this paper, we explore the noise and interference patterns found on 256 frequencies in an indoor urban environment's 900 MHz ISM and non-ISM bands. We begin the process by using off-the-shelf WSN hardware to sample the environment at 5 kHz from 16 locations simultaneously. From these samples, we identify five prevalent patterns and then hand-classify the 4096 traces of noise and interference. Finally, we extract a variety of statistics from the traces and use them in a Bayesian network classifier.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:9vf0nzSNQJEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improved algorithm for constructing constrained codes with state-independent decoding",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5701752/",
            "Abstract": "Constrained sequence codes are widely used to meet constraints imposed by digital storage and communication systems. This paper presents several improvements to an algorithm for constructing constrained codes that admit state-independent decoding. We use this improved algorithm to design state-independent decodable DC-free run-length-limited codes.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Java server and servlets, building. portable web applications [book reviews]",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/898816/",
            "Abstract": "A part of the Digital Subscriber Loop (DSL) technology is based on advances in the area of Multicarrier Modulation (MCM), an area which still receives the attention of intense research with the potential of more breakthroughs in the future. The book by John Bingham is targeted at engineers who are involved in the design of DSL systems, and MCM modems in particular. The book provides an exciting personal view about the important future work in the area, motivated by the fact that its retiring author will not be working on them while feeling the importance for new research in certain areas. The chapters include sections describing the “Unfinished Business” of the corresponding topic. Clearly,, graduate students and researchers will appreciate the guidance provided. A further feature to satisfy the intellectual appetite of readers are references to patents, that may not be known to the wider audience. The curious …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:vbGhcppDl1QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The procrustean network [Editor's Note]",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4107912/",
            "Abstract": "LYT/EDIT NOTE/SEP Page 1 IEEE Network • January/February 2007 Director of Magazines \nThomas F. La Porta, Penn. State Univ., USA Editor-in-Chief Ioanis Nikolaidis, U. of Alberta, \nCanada Associate Editor-in-Chief Chatschik Bisdikian, IBM Research, USA Senior Technical \nEditors Thomas M. Chen, Southern Methodist U., USA Yi-Bing (Jason) Lin, National Chiao Tung \nUniv., Taiwan Peter O’Reilly, Northeastern Univ., USA Technical Editors Feature Editors IEEE \nProduction Staff 2007 IEEE Communications Society Officers Nim Cheung, President Sergio \nBenedetto, VP–Technical Activities Harvey Freeman, VP–Membership Services Byeong Gi \nLee, VP–Membership Development Doug Zuckerman, VP–Society Relations Doug Zuckerman, \nPresident-Elect Stan Moyer, Treasurer John M. Howell, Secretary Board of Governors The \nelected officers above plus Members-at-Large: Class of 2007 Len Cimini — Jerry Larry . …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Research on triangle adaptive measurement method for unknown-surface",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5412410/",
            "Abstract": "Digitization of free-form surfaces is a key technique in surface reconstruction. The digitization of unknown surface is very important in surface digitization. How to carry out sampling properly to the unknown surface relates the surface reconstruction precision. There are shortcomings among the several algorithms that associated with the adaptive measurement for unknown-surface. In this paper, the triangle adaptive measurement method for unknown-surface is proposed. This method realizes the adaptive distribution of measuring points by triangle division on the basis of equal interval measurement data. It provides a new method to enhance the measuring accuracy of unknown-surface.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Routing Tags and Pegs: Two Generic Application Frameworks for Ad-Hoc Mesh Networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4297452/",
            "Abstract": "We present two blueprints of ad-hoc wireless applications implementable on low-cost hardware platforms. For this demo we focus on a combination of MSP430F148 microcontroller with CC1100 RF module. In addition to the actual working hardware, we demonstrate a powerful emulation engine, which allows us to study virtual deployments of wireless ad-hoc networks running our applications. Our objective is to illustrate the main components of Olsonet's framework for practical ad hoc networking.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:g3aElNc5_aQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the interaction of bandwidth constraints and energy efficiency in all-wireless networks",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39611-6_19",
            "Abstract": "The minimization of expended energy for unicast and broadcast communication between nodes in a wireless network has been studied mostly as a path optimization problem without particular regard for the traffic load demands. In this paper, we consider the call admission problem whereby given a traffic load (described as source-destination rate demands) the required expended energy is minimized. In addition, we explicitly model bandwidth capacity constraints. The capacity constraints reflect the fact that, from the perspective of a single node, traffic includes data that the nodes originate and forward, as well as traffic they receive and is of no interest to them. This last class of traffic is unavoidable due to the transmission radius of nearby stations. Under the assumption that the MAC protocol behaves in an ideal fashion, we consider two centralized algorithms that attempt to admit the given load and we …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:URolC5Kub84C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Modeling time-varying topologies of duty-cycled wireless sensor networks",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3011077.3011102",
            "Abstract": "Transceiver duty-cycling (DC) is a popular technique to conserve energy in a wireless sensor network (WSN). We therefore focus on studying the performance of a DC-WSN with respect to its throughput. We assume a deterministic DC behavior. Our elementary notion of traffic is that of a traffic flow, routed via multiple hops from a source to a destination node. Since DC results in different network\" links\" to be present at different points in time (a\" link\" exists only if both adjacent nodes are ON at the same time), the topology of the network varies over time. In this paper, we propose a general approach of modeling time-varying topologies of duty-cycled networks via node phases by dividing node cycles into unchanged-topology stages, in which the rates allocated to multi-hop flows can be expressed as solution of a max-min problem (assuming predetermined routing) and the rates computed via the max-min programming …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile applications; architecture, design, and development [Book Review]",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1407690/",
            "Abstract": "The new book by Hayes and Ganesh Babu brings new life to an old “academic” topic, that of analytical, and predominantly queuing, techniques as applied to telecommunications networks. The book satisfies all requirements to become a landmark of sorts in the near future. It is a review of both long known results in “classical” queuing and applying analytical techniques to recent problems, like QoS scheduling and self-similar traffic. Added is a feature of considerable online supporting material, based on Excel, Matlab, and Maple, representing the desire to recruit the right tool for the right topic. At a time when multitudes of tools exist, not having to stick with a single tool throughout the book may in fact be a choice that makes sense, especially in academic environments where all of these tools are usually available. The book’s audience is researchers and students alike. With some consideration for the particular …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Smart Condo: Visualizing independent living environments in a virtual world",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5191230/",
            "Abstract": "Providing affordable, high-quality healthcare to the elderly while enabling them to live independently longer is of critical importance. In our Smart Condo project, we have deployed a wireless sensor network in an 850-square-foot condominium for assisted living. The sensor network records a variety of events and environmental parameters and feeds the related data into our web-based system. This system is responsible for inferring higher-order information about the activities of the condo's occupant and visualizing the collected information in both a 2D Geographic Information System (GIS) and a 3D virtual world. The architecture is flexible in terms of supported sensor types, analyses, and visualizations through which it communicates this information to its users, including the condo's occupant, their family, and their healthcare providers.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:z_wVstp3MssC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Routing and Aggregation Strategies for Contour Map Applications in Sensor Networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02118-3_4",
            "Abstract": "We consider the limitations inherent in data aggregation techniques for wireless sensor networks. In particular, we illustrate the limitations of schemes in which data from a sensor are routed to the node that can perform the most effective data aggregation. We then seek alternative forms of aggregation where, in principle, it is possible to aggregate readings from many sensors into a single one. To this end, we select contour maps as the most convenient example of data representation because they are used by various applications and, at the same time, allow for aggressive data aggregation. We describe particular aggregation and routing strategies that exploit the structure of contour maps. Namely, we use clustering based on the contour map values, as well as intra–cluster and inter–cluster routing and aggregation heuristics. Simulation results demonstrate the capabilities and limitations of the various …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:08ZZubdj9fEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Extending sensor network lifetime via first hop data aggregation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1629432/",
            "Abstract": "We consider the problem of extending the lifetime of wireless sensor networks (WSNs) where sensors report their data to a base station via multi-hop transmission. In-network data aggregation is introduced to reduce the traffic. The lifetime is optimized using a LP (linear programming) framework built on a multicommodity network flow model to which we introduce the concept of flow loss multiplier to express the impact of data aggregation over correlated data. To balance energy consumption across the network, data aggregation is performed only at the first hop (FH) transmission. Heuristics are proposed to obtain significant FH aggregation, accordingly prolonging system lifetime. Simulation results show that FH aggregation possesses characteristics that make it suitable under certain data collection applications/scenarios",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A remotely programmable smart pillbox for enhancing medication adherence",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6266350/",
            "Abstract": "Medication adherence is an important challenge for many patients with chronic conditions, most of them elderly. Technology has an important role to play in this area potentially, with electronic devices equipped with reminder capability and medication intake recording. In this paper, we present a remotely programmable pillbox. This pillbox is equipped with a web application which gives the health professional or caregiver a tool to check and program the pillbox. Also, a mobile application is implemented to establish a connection with the web-application to show pills' daily schedule and pill taking notifications.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:4MWp96NkSFoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sociable Elephants: Fairness Among Long Lived TCP Flows",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=7475711165557298856&hl=en&oi=scholarr",
            "Abstract": "It is fairly well known that TCP data transfers in the Internet are heavy–tailed [1]. That is, a large fraction of the data carried is due to a small subset of the total number of connections (these are the “elephants” of the title as opposed to the short lived flows:“mice”). While research is still being carried out on how to dimension the network based on new traf fic models, it is reasonable to assume that we can use the TCP",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "WLC25-4: Dynamic 802.15. 3 WPAN scheduling using maximal matching",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4151390/",
            "Abstract": "We propose a scheduling scheme for single-channel 802.15.3 networks which produces interference-avoiding schedules for both isochronous and asynchronous traffic. The scheduler explores spatial channel reuse by means of maximal weighted matching and request grouping. For fairness, a binary exponential weight adjustment algorithm is applied to dynamically adjust the priority of requests. To enhance scheduling efficiency, requests are split and channel time is allocated accordingly. An efficient schedule update mechanism is also introduced to handle on-the-fly traffic request modifications.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handover [editor's note]",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4804328/",
            "Abstract": "After more than two years serving as Editor-in-Chief of IEEE Network I am stepping down, as new duties at my University have caught up with whatever free time (under whatever definition of free time) I was able to devote to IEEE Network. We are extremely fortunate to have as our new Editor-in- Chief, Dr. Thomas M. Chen. Dr. Chen is a Professor in Networking at the Institute of Advanced Telecommunications (IAT) of Swansea University, UK. Tom has, among other things, the valuable experience of having been Editor-in-Chief of the IEEE Communications Magazine between 2006 and 2007. I would like to extend a warm welcome and wish Tom the best of luck!",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lotus notes and domino 5 scalable network design: web seryer network infrastructure [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/871341/",
            "Abstract": "the other. The book is intended to he acccssililc to tlic novice. There is even an appendix that introcluccs the hinary number system, Examplcs arc uscd throughout tlic book to cxplain the technical conccpts, while spccial shaded boxes point to more detailed information. The introductory chapters use familiar concepts, such as the telcphonc nctwork, to gradually reveal thc complcx naturc of tclccommtiiiicatioiis while describing the public network, from local loops to wircless communications. Thc concepts arc prcsentcd in foiir suc-cessive chapters, including coding and modulation, physical interfaces, multiplexing, data integrity, and sccurity. The first encounter with the OS1 reference model is in the scvcnth chapter, which is also where the notion of a protocol is introduced, along with example data link and transport laycr protocols. In subscquent chapters, thc public network infrastructurc is rcvisitcd, this timc with an …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying received signal strength based methods for indoor positioning and tracking in construction applications",
            "Publication year": 2014,
            "Publication url": "https://cdnsciencepub.com/doi/abs/10.1139/cjce-2013-0433",
            "Abstract": "Effective positioning and tracking of critical construction resources is crucial to fulfilling project objectives in terms of time, cost, and safety. Received signal strength (RSS) based localization methods increasingly become a popular choice in construction applications, especially for indoor scenarios, potentially automating field data acquisition and construction process control. However, the fluctuating nature of collected RSS data due to multipath propagation effects, along with the unavailability of radio signals at certain site locations, hampers effective application of such localization techniques in challenging and dynamic indoor applications. This research evaluates the feasibilities of two RSS-based location tracking techniques, namely, the ranging-based method and the profiling-based method. To verify the positioning accuracy of the two methods, a wireless sensor network system was prototyped for conducting …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:d1gkVwhDpl0C",
            "Publisher": "NRC Research Press"
        },
        {
            "Title": "Biased shortest path trees in wireless networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6108114/",
            "Abstract": "Broadcasting is an elementary problem in wireless networks. Energy - efficient broadcasting is important, e.g., to coordinate the distributed computing operations by sending periodic messages in a network of Automatic Identification System installed on energy constrained maritime lighthouses. To that end logical tree topologies that are based on Connected Dominating Sets have been proposed vigorously in the literature. In this paper we present Biased Shortest Path Tree (BISPT), a new logical tree topology for efficient broadcasting in wireless networks. In simulations we find that BISPT outperforms state-of-the-art solutions.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Crisis of Today Is the Joke of Tomorrow [Editor's Note]",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4694167/",
            "Abstract": "Dear readers, welcome to the November 2008 issue of IEEE Network. Hopefully, the end of the year is finding you all in good health. This has been an interesting period in recent history. Acute convulsions in the financial sector will be felt for a while in the technology sector as well. As with most events of some significance, even words and expressions lose their meaning. (Think how secure you feel today when hearing the expression that something is as safe as \"money in the bank\"!) But on a more hopeful note, we can remember how H. G. Wells put it: \"The crisis of today is the joke of tomorrow.\" So, let us wait for tomorrow then.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "ARM system-on-chip architecture, [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3282781_ARM_system-on-chip_architecture_2nd_edition_Book_Review/links/00b7d537be2e600fdc000000/ARM-system-on-chip-architecture-2nd-edition-Book-Review.pdf",
            "Abstract": "ARM system-on-chip architecture, 2nd edition [Book Review] - IEEE Network Page 1 NEW \nBOOKS and MULTIMEDIA protocols rather than for writing applications. That is, socketsbased \nprogramming is not included in the book. Given the close relation of the example projects to \nthe particular simulator, the accompanying CD-ROM includesversions of NW that run on Linux, \nWindow,s and Solaris, while other systems can be supported by porting the source code \n(included as well). Of the suggested projects, a few introductory ones concern installing NW \nand trying an example topology. The really interesting parts start with data link protocols where \nbit stuffing, CRC, and ARQ protocols are presented along with a corresponding project for \neach. MAC protocols are represented by two chapters and an equal number of projects, one \non Ethernet and one on token rings. Similarly, two chapters and two projects are related to the -…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cisco IP routing [Book Review]",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/993212/",
            "Abstract": "The Stream Control Transmission Protocol (SCTP) is another transport layer protocol for IP, presented in RFC 2960. SCTP’s particular feature is the conservation of messa, ge boundaries (as opposed to TCP’s lack of such a feature). SCTP is motivated by the inconveniences of TCP’s ordered byte stream service model. For example, contrary to TCP, SCTP allows reordering of the messages, as long as integrity of the messages is maintained. Furthermore, the idea of multihomed IP hosts (as exhibited by IPv6) is not exploited by TCP, and TCP is also vulnerable to certain denial of ser-vice attacks. SCTP essentially provides a solution to these issues, while maintaining the same congestion control logic as TCP. The book is geared to protocol developers and implementers, but can be read by anyone curious to know of SCTP’s features or wishing to discover limitations of TCP and how they can be solved. It is not …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:Fu2w8maKXqMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unix system administration handbook, [Book review]",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/898815/",
            "Abstract": "A part of the Digital Subscriber Loop (DSL) technology is based on advances in the area of Multicarrier Modulation (MCM), an area which still receives the attention of intense research with the potential of more breakthroughs in the future. The book by John Bingham is targeted at engineers who are involved in the design of DSL systems, and MCM modems in particular. The book provides an exciting personal view about the important future work in the area, motivated by the fact that its retiring author will not be working on them while feeling the importance for new research in certain areas. The chapters include sections describing the “Unfinished Business” of the corresponding topic. Clearly,, graduate students and researchers will appreciate the guidance provided. A further feature to satisfy the intellectual appetite of readers are references to patents, that may not be known to the wider audience. The curious …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:epqYDVWIO7EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Secure Wireless Ad-hoc Sensor Network for Disaster Management and Recovery",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=4729716570091930396&hl=en&oi=scholarr",
            "Abstract": "We present a simple, robust, and resilient ad-hoc forwarding scheme for small-footprint, low-cost wireless sensor networks (WSNs) and discuss some of its features from the viewpoint of security. The class of applications shaping the security requirements for our discussion covers temporary, and possibly disposable deployments of potentially massive populations of sensing nodes to assist in the management of (and recovery from) disasters, like fires, chemical spills, floods, and earthquakes. Our goal is to make the network resistant to failures of its fragments, which may result from the network’s intended modus operandi or from intentional malicious attempts at crippling its function, while keeping the cost and footprint of the devices at the absolute minimum.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:edDO8Oi4QzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementing CIFS: The Common Internet File System [Book Review]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301010/",
            "Abstract": "Bernstein, Rajagopalan, and Saha is different from other available hooks on optical networks because of its admitted focus on the control plane. It addresses the gap between older “dumb” control technologies (requiring manual intervention) and the new advanced control mechanisms (affording us increased automation and leading to “intelligent” network control) that have been developed in recent years, while also vendorproprietary control protocols are gradually giving way to open standards. The book’s audience is presumably technologists dealing with tasks of planning, design, and provisioning of optical networks, as well as managers interested in the business case for efficiency and profitability using. advanced control architectures. However, the overall book also stands as a handy generalpurpose reference work for control and signaling protocols on and around optical networks. Accordingly, beyond a few …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data communications: from basics to broad band, [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3282765_Data_communications_from_basics_to_broad_band_3rd_edition_Book_Review/links/0c960537f49d6afb52000000/Data-communications-from-basics-to-broad-band-3rd-edition-Book-Review.pdf",
            "Abstract": "The use of the term “IP Protocols” to describe protocols below the network layer is uncommon and reveals much about the current state of affairs in networking. Several network technologies, including protocols, have become household names and synonymous with the Internet. The book by Uyless Black includes the IP protocols as well as data link protocols and an assortment of protocols that appear to be interesting and related to the Internet. The book emphasizes the informal description of the protocols and their corresponding operational aspects. Assuming no prior specialized knowledge for the reader, it provides a mixture of undergraduate networking textbook material and a description of very specific protocols with which the casual reader may be familiar. After a brief historical overview, a one-chapter description of some of the Internet’s most important components is given. In a little more than 60 pages, a summary of the IPv4 address structure, IP routing, and DNS is given. Naturally, the breadth is limited, but is later expanded in subsequent chapters dedicated to individual components of the Internet architecture. Chapter two deals with the data link layer, which also illustrates the difference between the end-to-end error control concept as applied to a transport protocol (TCP) and the hop-by-hop error control using point-to-point data link protocols. The third chapter is devoted to the particular set of LAN MACS, with the usual assortment of Ethernet (at various speeds), Token Ring, and FDDI. The attention to the data link layer is concluded in the fourth chapter, which briefly overviews X. 25, Frame Relay, and ATM, all presented in the context …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secrets and lies: digital security in a networked world [Book Review]",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3282776_Secrets_and_lies_digital_security_in_a_networked_world_Book_Review/links/0c960537f49d4a9ffd000000/Secrets-and-lies-digital-security-in-a-networked-world-Book-Review.pdf",
            "Abstract": "Secrets and lies: digital security in a networked world [Book Review] - IEEE Network Page 1 \nNEW BOOKS and MULTIMEDIA/Edited by Ioanis Nikolaidis The New Books and Multimedia \ncolumn contains brief descriptions of new books in the computer communications field. Each \ndescription has been abstracted from the publisher's descriptive materials, minus most of the \nadvertising superlatives, after this material has been checked for accuracy against a copy of the \nbook. Publishers wishing to have their books listed in this manner should send copies and \nappropriate advertising materials to John Spragins at the address below, with an indication the \nbooks are intended for the IEEE Network New Books and Multimedia column. Appropriate \nbooks will be listed in the column. Zoanis Nikolaidis Computing Science Department, University \nof Alberta, Edmonton, Alberta, Canada T6G 2Hl Object Oriented Software in , From to , …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework to monitor the integrated multi-source space heating systems to improve the design of the control system",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378778813008669",
            "Abstract": "Building space heating contributes to high consumption of energy using primarily non-renewable energy sources. Usage of renewable energy sources is constrained by high initial costs and long-term payback. This paper presents an empirical research study to evaluate the design of the control system and the performance of an integrated heating system utilizing renewable energy sources by means of a geothermal field, solar energy, and drain water heat recovery (DWHR) system. Two main challenges we attempt to address are: (1) the ground source heat pump (GSHP) system is designed to function only as a heating system causing heat loss from the geothermal field and (2) high heating load is required in cold-climate regions. The proposed integrated space heating system uses mainly geothermal energy, which is supported by solar and DWHR systems to recover the heat loss from the geothermal field. The …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:Tiz5es2fbqcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Picos tuples: easing event based programming in tiny pervasive systems",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1865875.1865883",
            "Abstract": "The task of programming sensor-based systems comes with severe constraints on the resources, typically memory, CPU power, and energy. The challenge is usually addressed with techniques that result in poor code understandability and maintainability. In this paper, we report on a data centric language extension based on a tuple-space abstraction, akin to Linda [2], applied to PicOS [5], a programming environment for wireless sensor networks (WSN's). The extension improves state and context management in a multi-tasking environment suffering from severe memory limitations. The solution integrates tuple operations into the model--for networking, event handling, and thread contexts. We demonstrate how tuple constructs improve coding and reduce code overhead. We also show how thread's context-tuples can be used as interface arguments for extension by modular aspect constructs.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wireless network simulation extensions in SIDE/SMURPH",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4117873/",
            "Abstract": "We describe the most recent step in the evolution of SIDE/SMURPH and, specifically, a generic model of a wireless channel, which enables to use the package for accurately modeling wireless networks, especially ad-hoc networks consisting of a potentially large number of possibly mobile nodes. The generic nature of the channel model allows the user to introduce functions describing the propagation characteristics of the actual wireless medium, e.g., the impact of distance on signal level and interference, as well as the relationship between the signal-to-interference ratio and the probability of a successful packet reception. To illustrate the capabilities of the supported extensions, we review an example of a shadowing channel model",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Qualitative Link Stat Dissemination Control in QoS Routng.",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.9.1467&rep=rep1&type=pdf",
            "Abstract": "We study the behavior of a Quality of Service (QoS) routing scheme in which connection requests can be assigned to one of k alternative paths from the source to the destination. The multiple–path routing compensates for the inaccurate link state (LS) information. It is found that the frequency of LS dissemination is not the only factor to influence performance. For large LS update periods, the nature of the LS information also has a dramatic effect. For example, LS information that inhibits the use of certain links, ie, links found to be congested when sampled in the last LS update, can block several future requests. We study the problem by considering exceptional additions to the periodic LS updates, when the residual link bandwidth decreases or increases dramatically. We subsequently examine the resulting blocking rate improvement and its corresponding control message overhead. Our findings indicate that certain schemes result consistently in blocking rate improvements for a small amount of additional control overhead.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a Simulation Framework for Smart Indoor Spaces",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/922388",
            "Abstract": "The effectiveness of sensor-based applications for smart homes and smart buildings is conditioned upon the deployment configuration of their underlying sensors. Real-world evaluation of alternative possible sensor-deployment configurations is labor-intensive, costly, and time-consuming, which implies the need for a simulation-based methodology. In this work, we report on such a methodology that supports the modeling of indoor spaces, the activities of their occupants, and the behaviors of different types of sensors. We argue that, in order for a simulation to be useful for the purpose of evaluating a sensor deployment configuration, it has to generate realistic event streams of individual sensors over time, as well as realistic compositions of sensor events within a time window. We have evaluated our simulator for smart indoor spaces, S I M s i s toolkit, in the context of our Smart-Condo ambient-assisted living platform, supporting the observation and analysis of activities of daily living (ADLs). Our findings indicate that S I M s i s produces realistic agent traces and sensor readings, and has the potential to support the process of developing and deploying sensor-based applications. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:xtoqd-5pKcoC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Networking handbook [Books]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/826363/",
            "Abstract": "Networking handbook [Books] Page 1 Page 2 NEW DOOKS and M\"lTIMEDIA . ..1 coiiics ;i \nCII-ItOM with ;I collcctioii 11f RFCs, frtitii thc early 400 scrics iiiiiiihci-s 1111 to thc i~iorc recent \n2600 scrics. Moic thm 80 ~xigcs arc dc.rlicatctl to voice ovcr 1 I.', iiitlicai iiig tlic inllliciicc rccciit \ntcchiiological ;bchicvcincnts itrc bcginiiiiig 1.n have (111 cnqiorxtc J~c(- workirig iiilrnstrtrctiu~cs. \nAftci, nn iiilro- t l11c t i 0 I1 lo ('I1 11 rl a 171 c I1 t a 1 c 0 II c c p t s around tlic triiiisriiissioli of \nsigiinls aiid soinc rclatccl clccti~ical ;iiid iictwoi'kiiig tc rmiII ology, a sc q LIC llcc of ch ap1 c 1's \nrlcscrihc ;I tiuiiil)cr of poliiilar protcicols: PIT, Titlicriict, Gigatit Etlicrnct, ATM, ISDN, 1~r;im~ \nKcl;iy, ;ind xUSl,. Anotli- CT c1i:qilcr prcscnts tlic possihlc nctworking dcviccs used in tlcplopiiig \nI a 1-g c- sc ii IC ii ut WO r ks ow rh c: tc rrig c iicoiis systcms :incl protocols. Tlic significniice \nof swiklics is tliscusscd in ii sclc~ralc cIi:iplcr> prcscirliirg tiii cxtciisivc caxc sludy ti;tscti I)II . …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "In-Wall Thermoelectric Harvesting for Wireless Sensor Networks.",
            "Publication year": 2014,
            "Publication url": "https://www.scitepress.org/Papers/2014/48641/48641.pdf",
            "Abstract": "We propose the use of embedded in-wall thermoelectric harvesters to power nodes of a wireless sensor network. We exploit the significant temperature differences between indoor and outdoor environments in cold climates. We use heat flow measurements of the exterior (outside-facing) wall of a number of apartments from the same apartment complex. We report on the degree of variability as well as on the seasonal changes that characterize the heat flow, and hence the potential for thermoelectric energy harvesting. We also examine whether the difference between indoor and outdoor air temperature is a good proxy for to the observed heat flow through the walls. Examples of data carrying capability of a particular harvester and sensor node combination are also provided.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SensorGIS-An Integrated Architecture for Information Systems based on Sensor Networks",
            "Publication year": 2010,
            "Publication url": "https://www.scitepress.org/Papers/2010/27983/",
            "Abstract": "In this paper, we describe SensorGIS, an integrated architecture for WSN applications. SensorGIS provides an integrated service-oriented architecture for collecting, archiving, analyzing, and visualizing sensor network data in a geographic information system (GIS). By using an extendible GIS framework as one of its user views, SensorGIS can contextually communicate the collected data, its trends, and distinct values of interest. In addition, it is designed in the service-oriented style and hence is extendible in terms of the analyses and visualizations. Finally, it integrates an online collaborative forum that enables annotation of the collected data with the users’ observations and interpretations.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:kz9GbA2Ns4gC",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "Divalia: a practical framework for anonymous peer-to-peer file exchange in wireless ad-hoc networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1628110/",
            "Abstract": "We describe Divalia, a new peer-to-peer (P2P) file exchange framework that targets mobile wireless ad-hoc networks. The framework supports anonymous transfers, to protect user privacy, as well as pre-authentication of data to be received, to reduce the likelihood of spoofs and the resulting bandwidth wastage. Divalia is composed of two parts: the hash set dual-request protocol, to challenge a would-be provider to prove the possession of the requested file; and, a form of Direct Anonymous Broadcast, for anonymous acquisition of information to be used for the challenge. One goal of this paper is to demonstrate how an original and secure P2P system can be constructed within the constraints and opportunities of mobile wireless ad-hoc networks through the use of well known and extensively studied component cryptographic methods",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An overview of source characterization in ATM networks",
            "Publication year": 2019,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9780367810498-5/overview-source-characterization-atm-networks-ioanis-nikolaidis-ian-akyildiz",
            "Abstract": "Analytical performance results are used in the proper engineering decisions, such as buffer and link dimensioning, in the deployment of computer networks including Asynchronous Transfer Mode networks. This chapter presents a survey of some of the most important results in the area of source characterization. It introduces the multiple definitions and quantitative measures of burstiness as well as the concept of the ON/OFF model. The chapter reviews the phase processes for building Markovian models of bursty traffic, and provides the approximation of the superposition of an arbitrary number of ON/OFF sources by a Markov Modulated Poisson Processes. It addresses the issue of representing more complex forms of correlation, which is particularly suited for video traffic, by Auto-Regressive Models. The chapter examines schemes for deriving quantized rates to enhance the tractability of models related to video …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:dTyEYWd-f8wC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Networks for computer scientists and engineers [Book Review]",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Ioanis-Nikolaidis/publication/3282847_Networks_for_computer_scientists_and_engineers_Book_Review/links/00b7d537be2dec2030000000/Networks-for-computer-scientists-and-engineers-Book-Review.pdf",
            "Abstract": "Among available undergraduate networks texts, the one by Zhcng and Akhtar follows a particularly interesting structure. First, two example applications introduce corresponding architectures: voice'communication for telephone networks on one hand, clientserver applications for packet-switched networks on the other. Mechanisms are presented to illustrate how such networks operate. The examples lead to more detailed information, such as the distinction along the lines of topology and the need for standards. The second part deals with the principles of data communications at the level of signals and modulation but is, oddly, complemented by a section on videoconferencing (applications and standards). The OS1 reference model is next, but once more the chapter includes, oddly enough (since a separate chapter on the topic exists), an introduction to network performance. The OS1 model is followed by LAN technologies (the majori-ty of which is a description of the IEEE 802 standards), including hardware aspects, with the somewhat misplaced addition of LAN operating systems. A single chapter describes TCP/IP, from addressing to IP to essentials of routing and transport layer protocols (TCP and UDP), ending with applications (SMTP, FTP, POP3, Telnet, DNS) as well as dialup data link protocols (SLIP, PPP). What is surprising is the relatively sparse information on HTTP despite a section devoted to Web applications. The next theme discusses access and high-speed technologies. This is really a chapter on both the last mile, as well as on LAN and WAN protocols, namely ISDN, DSL, SMDS, Frame Relay, FDDI, High Speed Ethernet, FDDI …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Study of Channel Classification Agreement in Urban Wireless Sensor Network Environments.",
            "Publication year": 2014,
            "Publication url": "https://www.scitepress.org/Papers/2014/47161/47161.pdf",
            "Abstract": "We consider a wireless sensor network in an urban environment and attempt to characterize the interference found in the communication channel by means of empirically collected Received Signal Strength Indicator (RSSI) values over Industrial, Scientific and Medical (ISM) and non-ISM bands. We assume a node-based interference classification scheme exists and examine whether nodes that classify the channel as belonging to the same class also exhibit strong cross-correlation in terms of the RSSI time series they independently observe. In effect, we are studying how the agreement of nodes, eg, via consensus, on the class of a channel can be linked to the cross-correlation statistic and to what extent. We find that the particular class impacts the degree to which we can confidently claim that the channel observed independently by each node, and classified to belong to the same class, indeed behaves the same way.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advanced features of the message-passing interface [Books]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/826365/",
            "Abstract": "Advanced features of the message-passing interface [Books] Page 1 NEW DOOKS and M\"lTIMEDIA \n. ..1 coiiics ;i CII-ItOM with ;I collcctioii 11f RFCs, frtitii thc early 400 scrics iiiiiiihci-s 1111 to \nthc i~iorc recent 2600 scrics. Moic thm 80 ~xigcs arc dc.rlicatctl to voice ovcr 1 I.', iiitlicai iiig \ntlic inllliciicc rccciit tcchiiological ;bchicvcincnts itrc bcginiiiiig 1.n have (111 cnqiorxtc J~c(- \nworkirig iiilrnstrtrctiu~cs. Aftci, nn iiilro- t l11c t i 0 I1 10 ('I1 11 rl a 171 c I1 t a 1 c 0 II c c p t s \naround tlic triiiisriiissioli of sigiinls aiid soinc rclatccl clccti~ical ;iiid iictwoi'kiiig tc rmiII ology, \na sc q LIC llcc of ch ap1 c 1's rlcscrihc ;I tiuiiil)cr of poliiilar protcicols: PPI?, Titlicriict, Gigatit \nEtlicrnct, ATM, ISDN, 1~r;im~ Kcl;iy, ;ind xUSl,. Anotli- CT c1i:qilcr prcscnts tlic possihlc nctworking \ndcviccs used in tlcplopiiig I a 1-g c- sc ii IC ii ut WO r ks ow rh c: tc rrig c iicoiis systcms :incl \nprotocols. Tlic significniice of swiklics is tliscusscd in ii sclmralc cIi:iplcr> prcscirliirg tiii cxtciiti'…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Localization sensitivity under RSSI quantization",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8761085/",
            "Abstract": "Received Signal Strength Indication (RSSI) is a notoriously noisy metric, yet attractive for localization purposes. We study the effect of reducing the RSSI value to a single bit, essentially turning the RSSI measurement into a proximity indicator. We consider systems where a device, that needs to be localized, transmits and the transmission is received by a number of receivers placed at fixed and known locations. We consider two modes of 1-bit quantization: one (global) where the quantization is defined uniformly across all signal receivers, and one (local) where the RSSI is quantized separately for each receiver. We compare the effects of 1-bit quantization across three profiling k-NN-based localization algorithms, comparing them with each other in addition to comparing against results when no quantization is performed. We furthermore consider the case of global 2-bit quantization. Our study is based on profiling …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A scheme for indoor localization through RF profiling",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5207992/",
            "Abstract": "We present a certain approach to indoor location tracking based on sensing the strength of received RF signal. Our scheme employs a database of signal strength readings from known locations collected during a prerequisite profiling stage. Subsequently, the problem of estimating the location of a node emitting an RF signal from an unknown place boils down to data mining in the database-to select a best matched set of profile points and then average the coordinates of those points into an approximate location of the tracked sender. We show preliminary experimental results which confirm our hope that this approach will result in a better accuracy than, e.g., triangulation based schemes.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy Harvesting in Smart Building Sensing: Overview and a Proof-of-Concept Study",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-97271-8_14",
            "Abstract": "Modern “smart” buildings require a plethora of sensors to be installed at various locations during the construction phase. Wiring costs and limited flexibility of installation make wired installations less attractive. An alternative, flexible, approach is to introduce wireless sensors and endow them with ways to harvest energy from the environment such that they attain the same “zero cost” of maintenance as their wired counterparts. The chapter reviews the sensing needs of smart buildings, and the related merits of energy harvesting to power embedded wireless sensor nodes. A proof-of-concept device exploiting thermoelectric harvesting is designed, built and tested to demonstrate how todays wireless sensing devices enable sustained continuous operation with minor energy harvesting requirements. In multi-hop environments, the underlying optimization problems are described and simple strategies that forego …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:ZuybSZzF8UAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Seasonally aware routing for thermoelectric energy harvesting wireless sensor networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7297973/",
            "Abstract": "Energy-aware routing schemes in wireless sensor networks (WSNs) often employ artificial energy assumptions, e.g., equal initial energy reserves for all nodes. Instead, we consider the case of realistic energy reserves collected via thermoelectric energy harvesting in an apartment complex and examine how the harvested energy impacts routing decisions over relatively large time frames. We formulate the corresponding multi-commodity routing flow problem and, using real observed data, remark that maximizing the volume of collected data typically leads to an uneven collection from each sensor. We propose a corresponding adjustment to the optimization problem to derive a “fair” data collection strategy. We additionally present a low overhead method of constructing a seasonally-aware routing scheme and study its performance. We compare the seasonally-aware routing performance against that of an ideal …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:kuK5TVdYjLIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the potential of MPT/MPR wireless networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6925755/",
            "Abstract": "Due to recent progress in signal processing techniques, the traditional collision channel model is inadequate for communication networks where the transceivers are endowed with the ability to transmit or receive multiple packets simultaneously (the MPT/MPR capability). This paper studies the schedule construction in MPT/MPR systems with the objective to understand how the flows traversing the network can leverage the MPT/MPR capabilities in multi-hop wireless networks. Towards our goal, we present a heuristic algorithm MDSatur to produce a schedule and propose the wireless water-filling (WF) algorithm which extends the traditional water-filling algorithm to multi-hop wireless scenarios to compute max-min allocations when the MPT and MPR capabilities are equal. By combining MDSatur and WF, we also design the LEX scheme to approximate the lexicographically optimal allocation of the system when …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "nLRTS: Improving distance vector routing in sensor networks",
            "Publication year": 2006,
            "Publication url": "https://www.aaai.org/Papers/Workshops/2006/WS-06-11/WS06-11-016.pdf",
            "Abstract": "Routing in ad hoc sensor networks is an important problem with a broad spectrum of applications. Borrowing from the literature on real-time heuristic search, we introduce backtracking and controlled suboptimality to sensor routing, with the intention to improve flexibility by accounting for the restricted capabilities of sensor nodes and the need for prompt delivery of data. The resulting novel algorithm, nLRTS, is compared against a well-known routing method, Distance-Vector Routing (DVR), with respect to several metrics. nL-RTS demonstrates improvement in asychronous networks with limited energy reserves.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Frome relay: techoology and practice [Books]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/826362/",
            "Abstract": "Chant:  :  re you arc reilding lhis article on, ur close to, a UNIX machine. Ch: 1I1CCS arc thm lhe [IN [X machine you lise is'· molillting\" several file  ystellls ll  ing NFS, lhe Nelwork File Systelll protocol. Finally, dHlllces are that yOll arc not 1'1IIticllimly aW< I!\" e or the laet thm NI'· S b pr (] vidin?, transparent m; cess IOlnany or the riles you usc.[11 rr sense, Nt'S i  11 success story among dislrlilute (\\computing< lpplicHtions, and at the same lime the inc, Hllatioll of a corporate moUn into a real jlmduct (in tllis ca  c, Sun Microsystcm\\'The network is tht: wmpuler.\"). NFS hilS ils mots ill an era where disk  paee W, l ! lot,] : li1l1ntlanl a  to ((iIY. Collection and distriblllio! 1 of fil (; , wer several file syslcms WilS thus a ncces  ity. Hooh dedicah; d til as ingle protocol such as NI'S IIluslraled Lypically target an audience specifically interested in lhe deployment ami implemcntation of the protocol. lIowever, NFS illustrated …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Interaction of Charging-Aware Mobility and Wireless Capacity",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8653318/",
            "Abstract": "Today's mobile battery-powered communication devices require that users access chargers via wired and, recently, wireless recharging facilities. For a device departing from a location with a given energy “budget”, a plausible strategy is to seek a charger location once the energy is exhausted. We present a model of mobile nodes that captures the paths followed by the nodes with depleted energy seeking, possibly via a detour, to reach a charger. The derived location-dependent mobile node density distribution is used to express the location-dependent congestion of a wireless network whose capacity is used by the mobile nodes. The boundaries, and the relative placement of the charger, create intriguing discontinuities in the probability density function of the nodes across space. We find that chargers are not always “hotspots” in terms of node density, and that the energy budget of the nodes at the beginning of …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "No junk, no peeking, serious offers only: P2P file exchange in wireless ad-hoc networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1550835/",
            "Abstract": "We consider the problem of anonymous file exchange in wireless ad-hoc networks. We propose a new protocol, dubbed RASH (roam and share), to address the problem. RASH is a peer-to-peer (P2P) protocol which fulfills three objectives: (a) protection of user privacy (understood as the confidentiality of their interests), (b) support for a high degree of file authentication and integrity (to reduce or eliminate false downloads and spoofs), and (c) enforcement of reciprocity (to remove freeloaders from the system). The environment of our scheme is purely ad-hoc, in that it does not assume pre-established trust, fixed-infrastructure, or the existence of specialized nodes",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital telephony, [Book Review]",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/898812/",
            "Abstract": "John Bellamy's book provides the reader with the opportunity to review the entire area of telephony, and digital telephony in particular. The emphasis of the book, which is revised to a new edition approximately once a decade, has evidently shifted from the predominantly analog telephone network of the SOS, to the mostly digital network in the 90s,. and, in the current edition, to a digital telephone networkwitb additional features, such as cellular mobile telephony. The topics are exposed in an application-centric fashion, explainingwhat are the necessary features to support digital telephony applications as well as a presentation of the relevant operational aspects. Even in the chapter regarding modulation techniques, the analytical aspects are restricted in favor of a descriptive high-level presentation. The notable exception isthe last chapter, which deals with traffic analysis, which provides an introduction to traffic …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:fEOibwPWpKIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sensor placement for indoor multi-occupant tracking",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388030/",
            "Abstract": "We consider the problem of localizing and tracking multiple occupants in an indoor space, where the occupants are tagged with RFID tags and the space is embedded with anonymous (Passive Infrared, PIR) motion sensors and identity (RFID reader) sensors. Our localization method uses the RFID readings to disambiguate the occupants' trajectories recognized by the motion sensors. Due to their high cost and generally cumbersome placement requirements, RFID readers must be judiciously placed; in this paper, we study the placement of the readers such that the occupants' trajectory ambiguity is reduced. We rely on a heatmap representing the frequency with which individuals visit locations as they move through the indoor space and on models of coverage for the PIR sensors and RFID readers and develop a heuristic for the RFID reader placement. We demonstrate the effectiveness of our method via simulations.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An exploration of aggregation convergecast scheduling",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870513001273",
            "Abstract": "We consider the problem of aggregation convergecast scheduling as it applies to wireless networks. The solution to aggregation convergecast satisfies the aggregation process, expressed as precedence constraints, combined with the impact of the shared wireless medium, expressed as resource constraints. Both sets of constraints influence the routing and scheduling. We propose an aggregation tree construction suitable for aggregation convergecast that is a synthesis of a tree tailored to precedence constraints and another tree tailored to resource constraints. Additionally, we show that the scheduling component can be modeled as a mixed graph coloring problem. Specifically, the extended conflict graph is introduced, and through it, a mapping from aggregation convergecast to mixed graphs is described. In the mixed graph, arcs represent the precedence constraints and edges represent the resource …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Packet video communications over ATM networks [Books]",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/826361/",
            "Abstract": "Packet video communications over ATM networks [Books] Page 1 RIP: An Intra-Domain \nRoutirig Pro to c o I Packet Video Communica- tions ovet ATM Nefworks K. R. Rao ancl Zoi-an \nS. Boikovic, Prentice Hull, 2000, ISBN 0-1 3-01 15 18-5, 420 pages, Iiordcover. 'I 'I I c 1) I it) k i'ii \nck ct Vi& o Cowm i i w ico tioris over A'l.,M Nc/work,v pi~~~viclcs i~ god soiii'cc or' inlorriifiiioii \nlor Oic iictwork cxpcrt who wodd like ti) catch tip with tlic vitlcri stiinditrtls 011 MI'Lli tiiiel 1'I'U'l'. \nIixtctisivc hiickgrriiind infcirmtioii is provided oti viilco criiling tccfiiiiq~ics. 1 .;iycrctI cotling iiiitl \nsc;ilrhility Icchii iqiics arc ills0 prcsciiicil. 13cspitc ils tillc, niitl fipirl frcm Ilic oiiqilinsis nil A'I'M', \nlllc hnok also riisciisscs thc inlc rif thc Iiitcriict iti cartyiiig vidco traffic ;is wcll ;is tlic rlistrihiition ot \nvidco ti-;d- fic i 11 wirclcss cnvi roii iiic iits. '['lie t;i rgc I iilldicncc ~ lj ~ ~ ~ ~ ~ lr ~ to I3c g~il~lll:llc \n5111- rlcii1.s with part.iciilai, ii~lci'cst in I:he i'csc ii rcti d ircc t io 11 Fo I, ii cl.work-lxisctl -…",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Schedule Template Construction Technique for Duty Cycled Sensor Networks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-19662-6_4",
            "Abstract": "We exploit the relatively predictable nature of wireless sensor networks that exhibit fixed topology and fixed application demands for off-line construction of TDMA schedules. In particular, we are able to account for the duty cycling (DC) behavior of the nodes, and hence for the time-varying properties of the underlying communication graph. The novelty lies in pursuing an alternative to a genuinely algorithmic, but notoriously computationally hard, scheduling approach. Specifically, we leverage the fact that the system is virtually a deterministic one and use a pre-simulation technique, detecting when the system has reached steady state, past which point the behavior is essentially periodic. We extract from the pre-simulation a periodic schedule template which can be subsequently used, with minor adjustments, as the TDMA schedule of all nodes in the network. We study the properties of the technique and …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "All about network directories [book reviews]",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/898817/",
            "Abstract": "(Continued from page 6) first part of the book is a gradual prepossibly the interface to databases, an extension to the servlet API (which the authors of this book call the Servlet Method Invocation (SMI) MI) and apersistence layer. The SMI provides the means of communication between components of servlet applications in\" a fashion reminiscent of Remote Method Invocation (RMI). The persistence layer provides the means of utilizing a relational database for object storage. The sentation of the necessary technologies from servlets, to servlet engines, to SMI and to the persistence layer, providing the architectural issues and sohtions that the authors of the book consider best suited for servlet applications. The second part of the book is a set of example applications using the framework of the first part, and it includes applications for StoreBrowser, OnlineShop and a Chat application.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the potential of hybrid route/relay schemes",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1512918/",
            "Abstract": "The objective of increasing capacity in mobile ad-hoc networks (MANETs) by exploiting the mobility of nodes has produced interesting but rather unrealistic results. The throughput improvement is not followed by reasonable delay performance, and in realistic settings there is a need to compensate for the potentially low mobility of all, or parts of, the network. We explore the throughput/delay tradeoff by attempting to utilize all possible service (transmission) opportunities that may exist. To this end, a measure of redundancy is introduced and its impact characterized. The definition of redundancy admits both the replication of data items as well as the traversal of paths. We study three schemes, where the third is a new proposal for a hybrid scheme that balances off a limited form of routing with relayed packet propagation. We find that the hybrid is resilient to the impact of mobility, providing good performance even at low …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multi–occupant movement tracking in smart home environments",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-19312-0_29",
            "Abstract": "Recognizing the movement and activities of an individual in an indoor space is a key functionality of smart homes, as a prerequisite to providing services in support of the occupant. Focusing on the particular case of smart homes with multiple occupants, we developed a location-and-movement recognition method using many inexpensive passive infrared (PIR) motion sensors and, a small number of, more costly RFID readers. In our method, PIR sensors, placed throughout the space, recognize movement while RFID readers, placed in key locations, recognize tags worn by individuals as they pass through their coverage area. The RFID readings are used to disambiguate the trajectories constructed based on PIR sensor readings. We evaluate through simulations the effectiveness of our method under different occupancy conditions.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:rO6llkc54NcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Lifetime-based TCP service differentiation",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366404002312",
            "Abstract": "We present a lifetime-based differentiation framework for TCP flows. The separation into two classes is based on a threshold technique. We introduce a scheme, FairShare, that handles the long-lived flows and achieves global max–min fairness. The short-lived flows are bundled together and a separate family of mechanisms, DAS, dynamically allocate bandwidth to match the load of newly instantiated short flows. Thus, two different objectives are met: fairness for the long flows, as well as reduced response times and reduced response time variance for the short flows. We argue that the applications are better served this way. Namely, applications generating short transfers are predominantly interested in short response times (e.g. HTTP requests/responses) while those generating long transfers (e.g. long FTP transfers) are at least provided a guarantee they are not penalized compared to other similar connections …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:SP6oXDckpogC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Mechanisms for Multi-Packet Reception Protocols in Multi-Hop Networks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2811587.2811618",
            "Abstract": "We consider multi-hop wireless networks composed of nodes with transceivers capable of multi-packet transmission and reception (MPT/MPR). Legacy MAC protocols based on CSMA/CA are overly restrictive in the interest of avoiding collisions, and are unable to exploit the MPR capability of receivers. We demonstrate how a combination of mechanisms, based on well-known techniques, such as Additive Increase Multiplicative Decrease (AIMD), and the back--pressure (BP) principle, can be used to effectively control medium access in multi-hop MPT/MPR networks. The AIMD component is used to regulate the size of\" bundles\" of simultaneously transmitted packets, while back--pressure provides the basis for prioritizing, locally, which flows' packets should be transmitted in a bundle. We study the performance of the proposed protocol, AB-MAC, under three different models of node coordination in static wireless …",
            "Abstract entirety": 0,
            "Author pub id": "GXSdAk0AAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Indoor Sensor Placement for Diverse Sensor-coverage Footprints.",
            "Publication year": 2015,
            "Publication url": "https://www.scitepress.org/papers/2015/52737/52737.pdf",
            "Abstract": "Single occupant localization in an indoor environment can be accomplished by the deployment of, properly placed, motion sensors. In this paper, we address the problem of cost-efficient sensor placement for highquality indoor localization, taking into account sensors with diverse coverage footprints, and the occlusion effects due to obstructions typically found in indoor environments. The objective is the placement of the smallest number of sensors with the right combination of footprints. To address the problem, and motivated by the vast search space of possible placement and footprint combinations, we adopt an evolutionary technique. We demonstrate that our technique performs faster and/or produces more accurate results (depending on the application) when compared to previously proposed greedy methods. Furthermore, our technique is flexible in that adding new sensor footprints can be trivially accomplished.",
            "Abstract entirety": 1,
            "Author pub id": "GXSdAk0AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        }
    ]
}]