[{
    "name": "Ιωάννης Θεοδωρίδης",
    "romanize name": "Ioannis Theodoridis",
    "School-Department": "Πληροφορικής",
    "University": "unipi",
    "Rank": "Καθηγητής",
    "Apella_id": 7814,
    "Scholar name": "Yannis Theodoridis",
    "Scholar id": "1f5twhoAAAAJ",
    "Affiliation": "Professor of Data Science, University of Piraeus, Greece",
    "Citedby": 12873,
    "Interests": [
        "Data Science",
        "Big Data",
        "Spatial Databases",
        "Spatiotemporal Databases",
        "Mobility Data Analytics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=1f5twhoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Towards a virtual agent control architecture using a spatiotemporal data management framework",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.98.6491&rep=rep1&type=pdf",
            "Abstract": "Virtual Agents are autonomous embodied entities in virtual environments that look and behave like living organisms. They are usually equipped with sensors that read the state of the environment and effectors that apply actions on other entities. Believable agent behavior requires nonomniscience: each agent should contain its own representation of the environment based on its sensing abilities and its interaction history. However, the storage and maintenance of a multitude of different knowledge bases in a dynamic environment with a large number of agents raises memory and performance issues, as data is duplicated and a lot of calculations are repeated. This paper presents an architecture for multiagent virtual environments that is based on a spatiotemporal database, which maintains an abstract representation of the environment and the moving entities, and delivers all the sensory information required by the agents. The use of the spatiotemporal database enhances the agents’ reasoning about the position and motion of other entities by providing a number of queries for spatiotemporal reasoning.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the management and analysis of our lifesteps",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2594473.2594478",
            "Abstract": "Huge volumes of location information are available nowadays due to the rapid growth of positioning devices (GPS-enabled smartphones and tablets, on-board navigation systems in vehicles, vessels and planes, smart chips for animals, etc.). In the near future, it is unavoidable that this explosion will contribute in what is called the Big Data era, raising high challenges for the data management research community. Instead of trying to manage bigger and bigger volumes of raw data, future Moving Object Database (MOD) systems need to extract and manage (the minimum necessary) semantics of movement. Such semantics can foster next-generation location-based services (LBS) and locationbased social networking (LBSN) applications, building more efficient and effective applications, while in parallel opening new research directions in the field of transportation, urban planning etc. In this article, we first present a …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "ACM"
        },
        {
            "Title": "GeoPKDD Deliverable D. 1.1. Privacy-aware Trajectory Warehouse Alignment Report",
            "Publication year": 2006,
            "Publication url": "https://air.unimi.it/handle/2434/31296",
            "Abstract": "GeoPKDD Deliverable D.1.1. Privacy-aware Trajectory Warehouse Alignment Report IRIS \nnascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i \nprodotti per: Autore Titolo Riviste Serie Settore Scientifico Disciplinare Tipologia Login \nSUrplus Archivio Istituzionale della Ricerca Prodotti della ricerca 08 - Relazione interna o \nrapporto di ricerca GeoPKDD Deliverable D.1.1. Privacy-aware Trajectory Warehouse \nAlignment Report Italiano Italiano Italiano Italiano English English GeoPKDD Deliverable D.1.1. \nPrivacy-aware Trajectory Warehouse Alignment Report / ML Damiani, E. Frentzos, A. \nGkoulalas-Divanis, D. Gougoulas, B. Kuijpers, J.Macedo, G. Marketos, A. Mazzoni, I. Ntoutsi, \nW. Othman, N. Pelekis, S. Puntoni, C. Renso, E. Savas, S. Spaccapietra, Y. Theodoridis, C. \nVangenot, V. Verykios. - Pisa : CNR, 2006. …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:dnWPDgH667kC",
            "Publisher": "CNR"
        },
        {
            "Title": "Indexed-based density biased sampling for clustering applications",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X05000406",
            "Abstract": "Density biased sampling (DBS) has been proposed to address the limitations of Uniform sampling, by producing the desired probability distribution in the sample. The ease of producing a random sample depends on the available mechanism for accessing the elements of the dataset. Existing DBS algorithms perform sampling over flat files. In this paper, we develop a new method that exploits spatial indexes and the local density information they preserve, to provide good quality of sampling result and fast access to elements of the dataset. With the proposed method accurate density estimations can be produced with respect to factors like skew, noise or dimensionality. Moreover, significant improvement in sampling time is attained. The performance of the proposed method is examined analytically and experimentally. The comparative results illustrate its superiority over existing methods.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:hC7cP41nSMkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Monitoring patterns through an integrated management and mining tool",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87481-2_46",
            "Abstract": "Patterns upon the data of many real applications are affected by changes in these data. We employ Pattern-Miner tool to detect changes of clusterings extracted from dynamic data and thus, to provide insight on the dataset and to support strategic decisions. Pattern-Miner, is an integrated environment for pattern (data mining model) management and mining that deals with the whole lifecycle of patterns, from their generation (using data mining techniques) to their storage and querying, putting also emphasis on the comparison between patterns and meta-mining operations over the extracted patterns. In the current version, Pattern-Miner integrates also an algorithm and technique for monitoring patterns (currently clusters) over time.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The Baquara2 knowledge-based framework for semantic enrichment and analysis of movement data",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X15000555",
            "Abstract": "The analysis of movements frequently requires more than just spatio-temporal data. Thus, despite recent progresses in trajectory handling, there is still a gap between movement data and formal semantics. This gap hinders movement analyses benefiting from available knowledge, with well-defined and widely agreed semantics. This article describes the Baquara2 framework to help narrow this gap by exploiting knowledge bases to semantically enrich and analyze movement data. It provides an ontological model for structuring and abstracting movement data in a multilevel hierarchy of progressively detailed movement segments that generalize concepts such as trajectories, stops, and moves. Baquara2 also includes a general customizable process to annotate movement data with concepts and objects described in ontologies and Linked Open Data (LOD) collections. The resulting semantic annotations enable …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:ClCfbGk0d_YC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "The DAEDALUS framework: progressive querying and mining of movement data",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1463434.1463497",
            "Abstract": "In this work we propose DAEDALUS, a formal framework and system, specifically focussed on progressive combination of mining and querying operators. The core component of DAEDALUS is the MO-DMQL query language that extends SQL in two respects, namely a pattern definition operator and the capability to uniform manipulating both raw data and unveiled patterns. DAEDALUS system is specifically focussed on movement data and has been implemented as a query execution layer on top of the Hermes Moving Object Database. The expressiveness and usefulness of the MODMQL language as well as the computational capabilities of DAEDALUS are qualitatively evaluated by means of a case study.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hands-on with Hermes@ Postgres MOD",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_13",
            "Abstract": "Marine environment is very important in our society with implications in economy and natural preservation. Marine accidents that happen from time to time cost high amount of money to the involved parties and, more important, incalculable damage to the ecosystem. Unfortunately, there is lack of monitoring vessels at sea for conforming to the international marine safety regulations. To address this issue, the Automatic Identification System (AIS) had been made mandatory equipment for commercial and fishing vessels (above a threshold length). A vessel’s AIS transceiver gathers data from onboard sensors like GPS and compass and broadcasts it publicly so that other vessels at sea or base stations at shore are aware of the position (latitude/longitude) as well as other trip-oriented information of the vessel under consideration. This chapter presents a showcase on a real AIS dataset and exploits the …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:LI9QrySNdTsC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Linear Hashing.",
            "Publication year": 2009,
            "Publication url": "https://www.alexdelis.eu/M149/e_ds_linearhashing.pdf",
            "Abstract": "DEFINITION Linear Hashing is a dynamically updateable disk-based index structure which implements a hashing scheme and which grows or shrinks one bucket at a time. The index is used to support exact match queries, ie find the record with a given key. Compared with the B+-tree index which also supports exact match queries (in logarithmic number of I/Os), Linear Hashing has better expected query cost O (1) I/O. Compared with Extendible Hashing, Linear Hashing does not use a bucket directory, and when an overflow occurs it is not always the overflown bucket that is split. The name Linear Hashing is used because the number of buckets grows or shrinks in a linear fashion. Overflows are handled by creating a chain of pages under the overflown bucket. The hashing function changes dynamically and at any given instant there can be at most two hashing functions used by the scheme.HISTORICAL BACKGROUND A hash table is an in-memory data structure that associates keys with values. The primary operation it supports efficiently is a lookup: given a key, find the corresponding value. It works by transforming the key using a hash function into a hash, a number that is used as an index in an array to locate the desired location where the values should be. Multiple keys may be hashed to the same bucket, and all keys in a bucket should be searched upon a query. Hash tables are often used to implement associative arrays, sets and caches. Like arrays, hash tables have O (1) lookup cost on average.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Online long-term trajectory prediction based on mined route patterns",
            "Publication year": 2019,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/23319/1006836.pdf?sequence=1#page=43",
            "Abstract": "In this paper, we present a Big data framework for the prediction of streaming trajectory data by exploiting mined patterns of trajectories, allowing accurate long-term predictions with low latency. In particular, to meet this goal we follow a two-step methodology. First, we efficiently identify the hidden mobility patterns in an offline manner. Subsequently, the trajectory prediction algorithm exploits these patterns in order to prolong the temporal horizon of useful predictions. The experimental study is based on real-world aviation and maritime datasets.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:L2Pn6qttGKUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Towards a taxonomy of location based services",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11599289_3",
            "Abstract": "Location-based services (LBS) constitute an emerging application domain involving spatio-temporal databases. In this paper, i) we propose a classification of LBS, depending on whether the user (query object) and the data objects are moving or not and ii) we provide algorithms for the efficient support of real applications, for every class. We also survey recent work in query processing for the proposed LBS algorithms and sketch open issues for future research.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "SPARTAN: Semantic integration of big spatio-temporal data from streaming and archival sources",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X17320319",
            "Abstract": "An ever-increasing number of applications in critical domains, such as maritime and aviation, generate, collect, manage and process spatio-temporal data related to the mobility of entities. This wealth of data can be exploited for various purposes, towards improving the safety of operations, reducing economical costs, and increasing dependability: The major issue to achieve these objectives is increasing predictability of moving objects’ trajectories and events. To achieve this purpose in a data-driven way we need to exploit in integrated manners data from a variety of disparate and heterogeneous data sources, both streaming and archival, regarding – among other – surveillance, weather, and contextual data. Motivated by this fact, in this paper, we propose a framework for semantic integration of big mobility data with other data sources that are necessary to data analytics tasks, providing a unified representation of …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:3NskZpgvI9IC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Increasing maritime situation awareness via trajectory detection, enrichment and recognition of events",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-90053-7_13",
            "Abstract": " The research presented in this paper aims to show the deployment and use of advanced technologies towards processing surveillance data for the detection of events, contributing to maritime situation awareness via trajectories’ detection, synopses generation and semantic enrichment of trajectories. We first introduce the context of the maritime domain and then the main principles of the big data architecture developed so far within the European funded H2020 datAcron project. From the integration of large maritime trajectory datasets, to the generation of synopses and the detection of events, the main functions of the datAcron architecture are developed and discussed. The potential for detection and forecasting of complex events at sea is illustrated by preliminary experimental results. ",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:HV_RJt6Pqn0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A unified and flexible framework for comparing simple and complex patterns",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30116-5_45",
            "Abstract": "One of the most important operations involving Data Mining patterns is computing their similarity. In this paper we present a general framework for comparing both simple and complex patterns, i.e., patterns built up from other patterns. Major features of our framework include the notion of structure and measure similarity, the possibility of managing multiple coupling types and aggregation logics, and the recursive definition of similarity for complex patterns.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:4TOpqqG69KYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Similarity search in trajectory databases",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4438678/",
            "Abstract": "Trajectory database (TD) management is a relatively new topic of database research, which has emerged due to the explosion of mobile devices and positioning technologies. Trajectory similarity search forms an important class of queries in TD with applications in trajectory data analysis and spatiotemporal knowledge discovery. In contrast to related works which make use of generic similarity metrics that virtually ignore the temporal dimension, in this paper we introduce a framework consisting of a set of distance operators based on primitive (space and time) as well as derived parameters of trajectories (speed and direction). The novelty of the approach is not only to provide qualitatively different means to query for similar trajectories, but also to support trajectory clustering and classification mining tasks, which definitely imply a way to quantify the distance between two trajectories. For each of the proposed distance …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Novel approaches to the indexing of moving object trajectories.",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.58.4011&rep=rep1&type=pdf",
            "Abstract": "The domain of spatiotemporal applications is a treasure trove of new types of data and queries. However, work in this area is guided by related research from the spatial and temporal domains, so far, with little attention towards the true nature of spatiotemporal phenomena. In this work, the focus is on a spatiotemporal sub-domain, namely the trajectories of moving point objects. We present new types of spatiotemporal queries, as well as algorithms to process those. Further, we introduce two access methods this kind of data, namely the Spatio-Temporal R-tree (STR-tree) and the Trajectory-Bundle tree (TB-tree). The former is an R-tree based access method that considers the trajectory identity in the index as well, while the latter is a hybrid structure, which preserves trajectories as well as allows for R-tree typical range search in the data. We present performance studies that compare the two indices with the R-tree (appropriately modified, for a fair comparison) under a varying set of spatiotemporal queries, and we provide guidelines for a successful choice among them.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "HERMES: A trajectory DB engine for mobility-centric applications",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/article/hermes/125583",
            "Abstract": "This paper presents HERMES, a prototype DB engine that defines a powerful query language for trajectory databases, which enables the support of mobility-centric applications, such as Location-Based Services (LBS). HERMES extends the data definition and manipulation language of Object-Relational DBMS (ORDBMS) with spatio-temporal semantics and functionality based on advanced spatio-temporal indexing and query processing techniques. Its implementation over two ORDBMS and its utilization in various domains proves the expressive power and applicability of HERMES in different application domains where knowledge regarding mobility data is essential. As a proof-of-concept, in this paper HERMES is applied to a case study related with vehicle traffic analysis, demonstrating its flexibility and usefulness for delivering custom-defined LBS.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:SdhP9T11ey4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Mobility data mining and knowledge discovery",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_7",
            "Abstract": "Knowledge discovery in trajectory databases is full of success stories in discovering interesting behavioral patterns of moving objects that can be exploited in several fields. Example domains include traffic engineering, climatology, social anthropology and zoology, implying application of the various mining techniques in vehicle position data, hurricane track data, human and animal movement data, respectively. Mobility data mining can be categorized according to the underlying mining methods used to discover the various collective behavioral patterns. Following this categorization method, there have been proposed works that try to identify various types of clusters of moving objects. Some methods group trajectories by considering the whole lifespan of the moving objects, while others try to identify local patterns that are valid only for a portion of their lifespan. Another line of research, which is parallel to that …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:WZBGuue-350C",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Measuring performance in the retail industry (position paper)",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11837862_14",
            "Abstract": "Bearing in mind the changeable and complicated needs of business environment, in this paper we examine the necessity of evolution in the traditional decision support techniques. Our aim is to intensify the need for integrated performance measurement and management, as a way to ameliorate the existing tools for decision making, which are currently based on historical data. Because of the nature of challenges and trends in the retail industry, it is considered to be an appropriate application scenario. In addition to that, a framework is proposed and a case study is described as a proof of our claim.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Maritime data analytics",
            "Publication year": 2021,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=lYYbEAAAQBAJ&oi=fnd&pg=PA119&dq=info:nBWMhhrVf8kJ:scholar.google.com&ots=XOD24Ot_XK&sig=zQKM0_46cgvPeOAO4jRc4gbHQ-Q",
            "Abstract": "The goal of mobility data analytics is to extract valuable knowledge out of a plethora of data sources that produce immense volumes of data. Focusing on the maritime domain, this relates to several challenging use-case scenarios, such as discovering valuable behavioural patterns of moving objects, identifying different types of activities in a region of interest, estimating fishing pressure or environmental fingerprint, etc. In this chapter, we focus on the exploration, preparation of data and application of several offline maritime data analytics techniques. Initially, we present several methods that assist an analyst to explore and gain insight of the data under analysis. Subsequently, we study several preprocessing techniques that aim to clean, transform, compress and partition long GPS traces into meaningful portions of movement. Finally, we overview some representative maritime knowledge discovery techniques, such as trajectory clustering, group behaviour identification, hot-spot analysis, frequent route or network discovery and data-driven predictive analytics methods.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:f408LfHov48C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Design of the Trajectory Warehouse Architecture. GeoPKDD Deliverable D. 1.3.",
            "Publication year": 2006,
            "Publication url": "https://air.unimi.it/handle/2434/31295",
            "Abstract": "Design of the Trajectory Warehouse Architecture. GeoPKDD Deliverable D.1.3. IRIS \nnascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i \nprodotti per: Autore Titolo Riviste Serie Settore Scientifico Disciplinare Tipologia Login SUrplus \nArchivio Istituzionale della Ricerca Prodotti della ricerca 08 - Relazione interna o rapporto di \nricerca Design of the Trajectory Warehouse Architecture. GeoPKDD Deliverable D.1.3. Italiano \nItaliano Italiano Italiano English English Design of the Trajectory Warehouse Architecture. \nGeoPKDD Deliverable D.1.3. / ML Damiani, C. Vangenot, E. Frentzos, G. Marketos, I. Ntoutsi, N. \nPelekis, Y. Theodoridis, V.Verykios, A. Rafaetta.. - Pisa : CNR, 2006. Scheda breve Scheda \ncompleta Titolo: Design of the Trajectory Warehouse Architecture. GeoPKDD Deliverable D.1.3. \nAutori: DAMIANI, MARIA LUISA (Primo) mostra contributor esterni Data di pubblicazione: : ING'…",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:K8XpiWYAYk8C",
            "Publisher": "CNR"
        },
        {
            "Title": "Moving Object Database Engines",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_5",
            "Abstract": "Spatial database research has focused on supporting the modeling and querying of geometries associated with objects in a database. Regarding static spatial data, the major commercial as well as open source database management systems (e.g. DB2, MySQL, Oracle, PostgreSQL, SQL Server) already provide appropriate data management and querying mechanisms that conform to Open Geospatial Consortium (OGC) standards. On the other hand, temporal databases have focused on extending the knowledge kept in a database about the current state of the real world to include the past, in the two senses of “the past of the real world” (valid time) and “the past states of the database” (transaction time). The recent years’ effort is an attempt to achieve an appropriate kind of interaction between both sub-areas of database research. Spatiotemporal databases are the outcome of the aggregation of time and …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Database support for data mining patterns",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_2",
            "Abstract": "The need of extracting useful knowledge from large collections of data has led to a great development of data mining systems and techniques. The results of data mining are known as patterns. Patterns can also be found in other scientific areas, such as biology, astronomy, mathematics etc. Today requirements impose the need for a system that efficiently manipulates complex and diverse patterns. In this work, we study the problem of the efficient representation and storage of patterns in a so-called pattern-base Management System. Towards this aim we examine three well known models from the database domain, the relational, the object-relational and the semi-structured (XML) model. The three alternative models are presented and compared based on criteria like generality, extensibility and querying effectiveness. The comparison shows that the semi-structure representation is more appropriate for a …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "EvolvingClusters: Online Discovery of Group Patterns in Enriched Maritime Data",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-38081-6_5",
            "Abstract": "In this paper, we propose a novel unified online group pattern mining algorithm, EvolvingClusters, that aims to enrich geospatial data through the mapping of their group behaviour. Specifically, EvolvingClusters is used to discover collective movement behaviour (like flocks and convoys) by monitoring the activity of multiple clusters through time and space. We evaluate the aforementioned algorithm using a real-world marine traffic dataset consisting of vessels’ movement in Brest Bay, France. Our study demonstrates the efficiency and effectiveness of the proposed algorithm as well as its value towards a semantic enrichment tool that can be used to observe and categorize the behaviour of multiple moving objects in real time.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:aKos2Y7kUz0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A quantitative and qualitative analysis of blocking in association rule hiding",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1029179.1029187",
            "Abstract": "Data mining provides the opportunity to extract useful information from large databases. Various techniques have been proposed in this context in order to extract this information in the most efficient way. However, efficiency is not our only concern in this study. The security and privacy issues over the extracted knowledge must be seriously considered as well. By taking this into consideration, we study the procedure of hiding sensitive association rules in binary data sets by blocking some data values and we present an algorithm for solving this problem. We also provide a fuzzification of the support and the confidence of an association rule in order to accommodate for the existence of blocked/unknown values. In addition, we quantitatively compare the proposed algorithm with other already published algorithms by running experiments on binary data sets, and we also qualitatively compare the efficiency of the …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Citywide traffic analysis based on the combination of visual and analytic approaches",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s41651-020-00057-4",
            "Abstract": "A method for citywide traffic analysis is introduced based on the combination of visual and analytical approaches. Large volumes of GPS data collected from urban vehicles are utilized. In the method, a traffic condition map is constructed, composed of five different layers featuring traffic conditions, road linkage, travel patterns, congestion zones, and traffic flows, respectively. Based on the map, specific transport situations surrounding the congested areas are examined and ways of reducing congestion are suggested. The method is evaluated in the aggregated metropolitan area of Athens and Piraeus in Greece, and the potential and the effectiveness of this technique in analysing traffic are demonstrated. With more and more urban vehicles being equipped with GPS devices, the method can be easily transferable to other regions, paving the way for the adoption of the approach for an up-to-date, spatial-temporal …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:QXQxek9En5IC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Closest pair queries in spatial databases",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/335191.335414",
            "Abstract": "This paper addresses the problem of finding the K closest pairs between two spatial data sets, where each set is stored in a structure belonging in the R-tree family. Five different algorithms (four recursive and one iterative) are presented for solving this problem. The case of 1 closest pair is treated as a special case. An extensive study, based on experiments performed with synthetic as well as with real point data sets, is presented. A wide range of values for the basic parameters affecting the performance of the algorithms, especially the effect of overlap between the two data sets, is explored. Moreover, an algorithmic as well as an experimental comparison with existing incremental algorithms addressing the same problem is presented. In most settings, the new algorithms proposed clearly outperform the existing ones.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:qjMakFHDy7sC",
            "Publisher": "ACM"
        },
        {
            "Title": "Event Recognition for Maritime Surveillance.",
            "Publication year": 2015,
            "Publication url": "http://www.dblab.ece.ntua.gr/pubs/uploads/TR-2015-1.pdf",
            "Abstract": "We present a system that combines intelligent online tracking with complex event recognition against streaming positions relayed from numerous vessels. Given the vital importance of maritime safety to the environment, the economy, and in national security, our system leverages the real-time acquisition of vessel activity with geographical and other static information. Thus, it can offer timely notification in emergency situations, such as intrusion into marine preservation areas, loitering, and unsafe sailing. Thanks to a mobility tracking module, evolving trajectories generated by massive positional updates can be compressed online into concise, but reliable synopses per ship, retaining only salient motion features within a sliding window. These features are exploited by a complex event recognition module that detects suspicious situations of interest to maritime authorities. We conducted a comprehensive empirical validation against a real dataset of traces collected from thousands of vessels. Our results confirm the scalability and approximation accuracy of the proposed system, and thus demonstrate its potential for effective, real-time maritime monitoring.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:HbR8gkJAVGIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A general framework for estimating similarity of datasets and decision trees: exploring semantic similarity of decision trees",
            "Publication year": 2008,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611972788.73",
            "Abstract": "Decision trees are among the most popular pattern types in data mining due to their intuitive representation. However, little attention has been given on the definition of measures of semantic similarity between decision trees. In this work, we present a general framework for similarity estimation that includes as special cases the estimation of semantic similarity between decision trees, as well as various forms of similarity estimation on classification datasets with respect to different probability distributions defined over the attribute-class space of the datasets. The similarity estimation is based on the partitions induced by the decision trees on the attribute space of the datasets. We use the proposed framework in order to estimate the semantic similarity of decision trees induced from different subsamples of classification datasets; we evaluate its performance with respect to the empirical semantic similarity, which we …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "The case of big mobility data",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_10",
            "Abstract": "Trillions of bytes of information are being collected by companies about their customers, suppliers, and operations. Devices, such as mobile phones, tablets, smart energy meters, automobiles, industrial machines, carry millions of networked sensors which create huge portions of data that are channeled in the Internet of Things (IoT). In addition, the massive participation of individuals on social networking sites will continue to fuel exponential data growth. Hence, the enormous amount of data being produced in our world during the last decades has posed new challenges in the world of data management. Various methods and technologies have been developed and adapted in order to store, manage, analyze, and visualize the complex vast quantities of data in an efficient way. In this chapter, we introduce the reader to the concept of Big Data management and, then, we highlight interesting works made so far …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:MLfJN-KU85MC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "The PANDA Framework for Comparing Arbitrarily Complex Patterns⋆",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.98.1682",
            "Abstract": "Data Mining techniques are commonly used to extract condensed artifacts, like association rules, decision trees, etc., from huge volumes of data. The comparison of such compact and rich in semantics patterns is a fundamental issue, which can be exploited, among others, to synthetically measure dissimilarities in evolving or different datasets, as well as to compare the output produced by Data Mining algorithms on a same dataset. In this paper we present the Panda framework for the assessment of dissimilarity between both simple and complex patterns, defined upon raw data and other patterns, respectively. With the aim of demonstrating the flexibility of Panda to adapt to specific needs/requirements and its applicability to a wide range of applications, we illustrate how it can be applied to a variety of pattern types, including sets of itemsets, clusterings, and decision trees.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic trajectories modeling and analysis",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2501654.2501656",
            "Abstract": "Focus on movement data has increased as a consequence of the larger availability of such data due to current GPS, GSM, RFID, and sensors techniques. In parallel, interest in movement has shifted from raw movement data analysis to more application-oriented ways of analyzing segments of movement suitable for the specific purposes of the application. This trend has promoted semantically rich trajectories, rather than raw movement, as the core object of interest in mobility studies. This survey provides the definitions of the basic concepts about mobility data, an analysis of the issues in mobility data management, and a survey of the approaches and techniques for: (i) constructing trajectories from movement tracks, (ii) enriching trajectories with semantic information to enable the desired interpretations of movements, and (iii) using data mining to analyze semantic trajectories and extract knowledge about their …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:zLWjf1WUPmwC",
            "Publisher": "ACM"
        },
        {
            "Title": "Learning from Our Movements–The Mobility Data Analytics Era",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-38081-6_1",
            "Abstract": "From the pioneering works on spatiotemporal databases back in ‘90s to the era of Big Mobility Data Analytics nowadays, in this paper we try to follow the thread of research objectives and initiatives in the field. Initially, we provide a flashback to the 25 past years (though from a personal, hence, biased point of view). Then, we discuss in brief the challenges related to mobility data processing, management, analytics, and visualization to be addressed in modern applications tracking populations of moving objects in real time. ",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:8Wa-k36u3iwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Fuzzy miner: extracting fuzzy rules from numerical patterns",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/article/...extracting-fuzzy-rules/1748",
            "Abstract": "We study the problem of classification as this is presented in the context of data mining. Among the various approaches that are investigated, we focus on the use of Fuzzy Logic for pattern classification, due to its close relation to human thinking. More specifically, this paper presents a heuristic fuzzy method for the classification of numerical data, followed by the design and the implementation of its corresponding tool (Fuzzy Miner). The initial idea comes from the fact that fuzzy systems are universal approximators of any real continuous function. Such an approximation method coming from the domain of fuzzy control is appropriately adjusted into pattern classification and an “adaptive” procedure is proposed for deriving highly accurate linguistic if-then rules. Extensive simulation tests are performed to demonstrate the performance of Fuzzy Miner, while a comparison with a neuro-fuzzy classifier of the area is taking …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "GF-Miner: a Genetic Fuzzy Classifier for Numerical Data",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-0221-4_62",
            "Abstract": "Fuzzy logic and genetic algorithms are well-established computational techniques that have been employed to deal with the problem of classification as this is presented in the context of data mining. Based on Fuzzy Miner which is a recently proposed state-of-the-art fuzzy rule based system for numerical data, in this paper we propose GF-Miner which is a genetic fuzzy classifier that improves Fuzzy Miner firstly by adopting a clustering method for succeeding a more natural fuzzy partitioning of the input space, and secondly by optimizing the resulting fuzzy if-then rules with the use of genetic algorithms. More specifically, the membership functions of the fuzzy partitioning are extracted in an unsupervised way by using the fuzzy c- means clustering algorithm, while the extracted rules are optimized in terms of the volume of the rulebase and the size of each rule, using two appropriately designed genetic …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:LPZeul_q3PIC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Birkenheuer, G., see Groppe, S. 64–110",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=17602385762323465220&hl=en&oi=scholarr",
            "Abstract": "Author index to volume 57 (2006) Birkenheuer, G., see Groppe, S. 64–110 Bottcher, S., see Groppe, S. 64–110 Cheung, DW, see Lo, E. 122–147 Corral, A., Y. Manolopoulos, Y. Theodoridis and M. Vassilakopoulos, Cost models for distance joins queries using R-trees 1–36 Dogdu, E., Utilization of execution histories in scheduling real-time database transactions 148–178 Garani, G., A generalised temporal algebra 283–310 Garcıa-Barriocanal, E., see Sicilia, M.-A. 111–121 Groppe, S., S. Bottcher, G. Birkenheuer and A. Hoing, Reformulating XPath queries and XSLT queries on XSLT views 64–110 Hoing, A., see Groppe, S. 64–110 Hunter, A., How to act on inconsistent news: Ignore, resolve, or reject 221–239 Hwang, S.-Y., see Wang, Y. 240–282 Lim, E.-P., see Wang, Y. 240–282 Lin, K.-I., see Lo, E. 122–147 Lo, E., KY Yip, K.-I. Lin and DW Cheung, Progressive skylining over Web-accessible databases 122–147 …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent stock market assistant using temporal data mining",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.100.4328&rep=rep1&type=pdf",
            "Abstract": "The stock market domain is a dynamic and unpredictable environment. Traditional techniques, such as fundamental and technical analysis can provide investors with some tools for managing their stocks and predicting their prices. However, these techniques cannot discover all the possible relations between stocks and thus there is a need for a different approach that will provide a deeper kind of analysis. Data mining can be used extensively in the financial markets and help in stock-price forecasting. Therefore, we propose in this paper a portfolio management solution with business intelligence characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:LjlpjdlvIbIC",
            "Publisher": "University of Manchester"
        },
        {
            "Title": "Optimal time-dependent sequenced route queries in road networks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2820783.2820846",
            "Abstract": "In this paper we present an algorithm for optimal processing of time-dependent sequenced route queries in road networks, ie, given a road network where the travel time over an edge is time-dependent and a given ordered list of categories of interest, we find the fastest route between an origin and destination that passes through a sequence of points of interest belonging to each of the specified categories of interest. Our approach uses the A* search paradigm equipped with an admissible heuristic function, thus guaranteed to yield the optimal solution, along with a pruning scheme for further reducing the search space. Our experiments using a real data set have shown our proposed solution to be up to two orders of magnitude faster than a previous solution extended to handle time-dependency.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:5qfkUJPXOUwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient cost models for spatial queries using R-trees",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/842247/",
            "Abstract": "Selection and join queries are fundamental operations in database management systems (DBMS). Support for nontraditional data, including spatial objects, in an efficient manner is of ongoing interest in database research. Toward this goal, access methods and cost models for spatial queries are necessary tools for spatial query processing and optimization. We present analytical models that estimate the cost (in terms of node and disk accesses) of selection and join queries using R-tree-based structures. The proposed formulae need no knowledge of the underlying R-tree structure(s) and are applicable to uniform-like and nonuniform data distributions. In addition, experimental results are presented which show the accuracy of the analytical estimations when compared to actual runs on both synthetic and real data sets.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic-aware aircraft trajectory prediction using flight plans",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s41060-019-00182-4",
            "Abstract": "Aircraft trajectory prediction (TP) is a challenging and inherently data-driven time-series modeling problem. Adding annotation or enrichment parameters further increases the search space complexity, especially when ‘blind’ optimization algorithms are employed. In this paper, flight plans, localized weather and aircraft properties are introduced as trajectory annotations that enable modeling in a space higher than the typical 4-D spatio-temporal. A multi-stage hybrid approach is employed for a new variation of the core TP task, the so-called Future Semantic Trajectory Prediction, including clustering the enriched trajectory data using a semantic-aware similarity function as distance metric. Subsequently, a separate predictive model is trained for each cluster, using a nonuniform graph-based grid that is formed by the waypoints of each flight plan. In practice, flight plans constitute a constrained-based training of each …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:cybebCj9Au0C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Algorithms for nearest neighbor search on moving object trajectories",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10707-006-0007-7.pdf",
            "Abstract": "Nearest Neighbor (NN) search has been in the core of spatial and spatiotemporal database research during the last decade. The literature on NN query processing algorithms so far deals with either stationary or moving query points over static datasets or future (predicted) locations over a set of continuously moving points. With the increasing number of Mobile Location Services (MLS), the need for effective k-NN query processing over historical trajectory data has become the vehicle for data analysis, thus improving existing or even proposing new services. In this paper, we investigate mechanisms to perform NN search on R-tree-like structures storing historical information about moving object trajectories. The proposed (depth-first and best-first) algorithms vary with respect to the type of the query object (stationary or moving point) as well as the type of the query result (historical continuous or not), thus …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:_kc_bZDykSQC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Cost models for distance joins queries using R-trees",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X0500039X",
            "Abstract": "The K-Closest-Pairs Query (K-CPQ), a type of distance join in spatial databases, discovers the K pairs of objects formed from two different datasets with the K smallest distances. Recently, branch-and-bound algorithms based on R-trees have been developed in order to answer K-CPQs efficiently. For query optimization purposes, analytical models are needed to estimate the processing cost of a specific query in order to evaluate alternative execution plans. In this paper, we combine techniques that have been used for the analysis of nearest neighbor and spatial join queries, and derive the performance cost (in terms of disk accesses) of K-CPQs using R-trees. Moreover, we present two interesting extensions of the cost model for K-CPQs, one exploiting the buffering management using R-trees and another for a second type of distance join, the so-called buffer queries. The proposed cost models are verified under a …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:YFjsv_pBGBYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Online discovery of co-movement patterns in mobility data",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13658816.2020.1834562",
            "Abstract": "The advent of GPS technologies generates location data-streams and accentuates the importance of developing practical tools that can process and analyze the vast amounts of location data at a given moment in a meaningful way. Profiling the trajectory of a moving object with respect to the trajectories of its surrounding objects, for example, can elicit its mobility behaviour and analyze it in order to inform domain experts with critical knowledge in real time. For instance, clustering multiple moving objects with respect to their spatial and temporal dimension to identify co-movement patterns. In this paper, we propose a novel graph-based online co-movement pattern mining algorithm, called EvolvingClusters, which can be used to discover different collective movement behaviours (like the well-known flocks and convoys) in a unified way based on the activity of multiple concurrent objects through time and space. We …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:9tletLqOvukC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Spatio-Temporal-Keyword Pattern Queries over Semantic Trajectories with Hermes@ Neo4j.",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=12490079641665030500&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:kPzzr9KoCG0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Support of Mobility in ORDBMS",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/article/on-the-support-of-mobility-in-ordbms/109590",
            "Abstract": "Composition of space and mobility in a unified data framework results into Moving Object Databases (MOD). MOD management systems support storage and query processing of non-static spatial objects and provide essential operations for higher level analysis of movement data. The goal of this paper is to present Hermes MOD engine that supports the aforementioned functionality through appropriate data types and methods in Object-Relational DBMS (ORDBMS) environments. In particular, Hermes exploits on the extensibility interface of ORDBMS that already have extensions for static spatial data types and methods that follow the Open Geospatial Consortium (OGC) standard, and extends the ORDBMS by supporting time-varying geometries that change their position and/or extent in space and time dimensions, either discretely or continuously. It further extends the data definition and manipulation language of …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:Dip1O2bNi0gC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Cost Models and Efficient Algorithms on Existentially Uncertain Spatial Data",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4621532/",
            "Abstract": "The domain of existentially uncertain spatial data refers to objects that are modelled using an existential probability accompanying spatial data values. An interesting and challenging query type over existentially uncertain data is the search of the nearest neighbor (NN), since the probability of a potential dataset object to be the NN of the query object depends on the locations and probabilities of other points in the same dataset. In this paper, following a statistical approach, we estimate the average number of the NNsrequired to answer probabilistic thresholding NN(PTNN) queries as function of the threshold t, allowing us to utilize existing approaches and propose a cost model for such queries. Based on the same statistical approach, we propose an efficient algorithm for PTNN queries over arbitrarily structured existentially uncertain spatial data. Our experimental study demonstrates the accuracy and efficiency of the …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards trajectory data warehouses",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75177-9_8",
            "Abstract": "Data warehouses have received the attention of the database community as a technology for integrating all sorts of transactional data, dispersed within organisations whose applications utilise either legacy (non-relational) or advanced relational database systems. Data warehouses form a technological framework for supporting decision-making processes by providing informational data. A data warehouse is defined as a subject-oriented, integrated, time-variant, non-volatile collection of data in support of management of decision-making process [10].",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Static Versions of R-trees",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84628-293-5_3",
            "Abstract": "There are common applications that use static data. For instance, insertions and deletions in census, cartographic and environmental databases are rare or even not performed at all. For such applications, special attention should be paid to construct an optimal structure with regard to some tree characteristics, such as storage overhead minimization, storage utilization maximization, minimization of overlap or coverage between tree nodes, or combinations of these. Therefore, it is anticipated that query processing performance will be improved. These methods are well known in the literature as packing or bulk loading. Thus, we next examine such methods that require the data to be known in advance.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:35r97b3x0nAC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Map-matched trajectory compression",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121213000289",
            "Abstract": "The wide usage of location aware devices, such as GPS-enabled cellphones or PDAs, generates vast volumes of spatiotemporal streams of location data raising management challenges, such as efficient storage and querying. Therefore, compression techniques are inevitable also in the field of moving object databases. Related work is relatively limited and mainly driven by line simplification and data sequence compression techniques. Moreover, due to the (unavoidable) erroneous measurements from GPS devices, the problem of matching the location recordings with the underlying traffic network has recently gained the attention of the research community. So far, the proposed compression techniques have not been designed for network constrained moving objects, while on the other hand, existing map matching algorithms do not take compression aspects into consideration. In this paper, we propose solutions …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:tzM49s52ZIMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An evaluation of data stream clustering algorithms",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sam.11380",
            "Abstract": "Data stream clustering is a hot research area due to the abundance of data streams collected nowadays and the need for understanding and acting upon such sort of data. Unsupervised learning (clustering) comprises one of the most popular data mining tasks for gaining insights into the data. Clustering is a challenging task, while clustering over data streams involves additional challenges such as the single pass constraint over the raw data and the need for fast response. Moreover, dealing with an infinite and fast changing data stream implies that the clustering model extracted upon such sort of data is also subject to evolution over time. Several stream clustering surveys exist already in the literature; however, they focus on a theoretical presentation of the surveyed algorithms. On the contrary, in this paper, we survey the state‐of‐the‐art stream clustering algorithms and we evaluate their performance in different …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:CY3uIpTmi-gC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Spatial joins: Algorithms, cost models and optimization techniques",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/spatial-joins-algorithms-cost-models/29663",
            "Abstract": "This chapter describes algorithms, cost models and optimization techniques for spatial joins. Joins are among the most common queries in Spatial Database Management Systems. Due to their importance and high processing cost, a number of algorithms have been proposed covering all possible cases of indexed and non-indexed inputs. We first describe some popular methods for processing binary spatial joins and provide models for selectivity and cost estimation. Then, we discuss evaluation of multiway spatial joins by integrating binary algorithms and synchronous tree traversal. Going one step further, we show how analytical models can be used to combine the various join operators in optimal evaluation plans. The chapter can serve as a comprehensive reference text to the researcher who wants to learn about this important spatial query operator and to the developer who wants to include spatial query …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:e_rmSamDkqQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Clustering and Representing Movements in an Uncertain World",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.505.8999&rep=rep1&type=pdf",
            "Abstract": "Knowledge discovery in Trajectory Databases (TD) is an emerging field which has recently gained great interest; on the other hand the inherent presence of uncertainty in TD during the mining process has not been taken yet into account. Current approaches group trajectories together by accounting only the degree of their similarity, ignoring at the same time the degree in which they are unrelated and more importantly the hesitancy introduced by the uncertainty. In this paper we study the effect of uncertainty on clustering TD, as well as the representation of the clusters and introduce a three-step approach to deal with this challenge. Firstly, we propose an intuitionistic point vector representation of trajectories that encompasses the underlying uncertainty and we introduce an effective distance metric to cope with uncertainty. At the second step, we devise CenTra, a novel algorithm which tackles the problem of discovering the Centroid Trajectory of a group of movements taking into advantage the local similarity between portions of trajectories. At the final step, we devise CenTR-I-FCM a variant of the Fuzzy C-Means (FCM) clustering algorithm, appropriately modified in the context of Intuitionistic Fuzzy Set (IFS) theory, which embodies CenTra as its update procedure when producing the cluster centroids at each iteration. The experimental evaluation with real world trajectory datasets demonstrates the efficiency and effectiveness of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:YohjEiUPhakC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sea Area Monitoring and Analysis of Fishing Vessels Activity: The i4sea Big Data Platform",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9162224/",
            "Abstract": "The i4sea research project provides effective and efficient big data integration, processing and analysis technologies to deliver both real-time and historical operational snapshots of fishing vessels activity in national sea areas. This paper presents the architecture of the i4sea big data platform for sea area monitoring and analysis of fishing vessels activity and demonstrates the operation of some use-case pilot scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:rn2Io16i3IwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hermoupolis: a semantic trajectory generator in the data science era",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2782759.2782764",
            "Abstract": "The domain of trajectory data management and mining undoubtedly contributes with interesting research problems and corresponding effective solutions to what is called data science. An interesting trend that poses new challenges in the field and has emerged especially due to the advance of location-based social networks, is that involved data cannot be considered purely spatiotemporal; trajectories of moving objects also contain additional semantic information that deserves to be further explored. On the other hand, the recently available real trajectory datasets are neither adequate nor appropriate for a wide empirical evaluation of related research proposals. As in other domains, a practical approach to overcome this limitation is developing efficient and functional synthetic trajectory generators. In this line of research, we present Hermoupolis, a pattern- and semantic-aware synthetic trajectory generator, which …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:XoXfffV-tXoC",
            "Publisher": "ACM"
        },
        {
            "Title": "Efficient algorithms for distortion and blocking techniques in association rule hiding",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s10619-007-7013-0",
            "Abstract": " Data mining provides the opportunity to extract useful information from large databases. Various techniques have been proposed in this context in order to extract this information in the most efficient way. However, efficiency is not our only concern in this study. The security and privacy issues over the extracted knowledge must be seriously considered as well. By taking this into consideration, we study the procedure of hiding sensitive association rules in binary data sets by blocking some data values and we present an algorithm for solving this problem. We also provide a fuzzification of the support and the confidence of an association rule in order to accommodate for the existence of blocked/unknown values. In addition, we quantitatively compare the proposed algorithm with other already published algorithms by running experiments on binary data sets, and we also qualitatively compare the efficiency of …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Novel approaches in query processing for moving objects",
            "Publication year": 2000,
            "Publication url": "https://vbn.aau.dk/en/publications/novel-approaches-in-query-processing-for-moving-objects",
            "Abstract": "Novel Approaches in Query Processing for Moving Objects — Aalborg University's Research \nPortal Skip to main navigation Skip to search Skip to main content Aalborg University's Research \nPortal Logo Dansk English Home Profiles Projects Publications Activities Research Units \nFacilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Novel \nApproaches in Query Processing for Moving Objects Dieter Pfoser, Christian Søndergaard \nJensen, Y. Theodoridis Department of Computer Science Research output: Book/Report › \nBook › Research Overview Original language English Place of Publication Aalborg Publisher \nAalborg Universitetsforlag Publication status Published - 2000 Series Chorochronos Technical \nReport Number CH-00-03 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver \nPfoser, D., Jensen, CS, & Theodoridis, Y. (2000). Novel Approaches in Query Processing . -…",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:KIMFRoSX18MC",
            "Publisher": "Aalborg Universitetsforlag"
        },
        {
            "Title": "Multi-way distance join queries in spatial databases",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:GEIN.0000040832.25622.8d",
            "Abstract": "Let a tuple of n objects obeying a query graph (QG) be called the n-tuple. The “D_distance-value” of this n-tuple is the value of a linear function of distances of the n objects that make up this n-tuple, according to the edges of the QG. This paper addresses the problem of finding the K n-tuples between n spatial datasets that have the smallest D_distance-values, the so-called K-multi-way distance join query (K-MWDJQ), where each set is indexed by an R-tree-based structure. This query can be viewed as an extension of K-closest-pairs query (K-CPQ) [8] for n inputs. In addition, a recursive non-incremental branch-and-bound algorithm following a depth-first search for processing synchronously all inputs without producing any intermediate result is proposed. Enhanced pruning techniques are also applied to n R-trees nodes in order to reduce the total response time and the number of distance computations of …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:maZDTaKrznsC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Big data analytics for time critical maritime and aerial mobility forecasting",
            "Publication year": 2018,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/22887/",
            "Abstract": "The correlated exploitation of heterogeneous data sources offering very large archival and streaming data is important to increase the accuracy of computations when analysing and predicting future states of moving entities. Aiming to significantly advance the capacities of systems to improve safety and effectiveness of critical operations involving a large number of moving entities in large geographical areas, this paper describes progress achieved towards time critical big data analytics solutions to user-defined challenges in the air-traffic management and maritime domains. Besides, this paper presents further research challenges concerning data integration and management, predictive analytics for trajectory and events forecasting, and visual analytics.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:WIzaTCs-0dQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the effect of location uncertainty in spatial querying",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4589209/",
            "Abstract": "An emerging topic in the field of spatial data management is the handling of location uncertainty of spatial objects, mainly due to inaccurate measurements. The literature on location uncertainty so far has focused on modifying traditional spatial search algorithms in order to handle the impact of objects' location uncertainty in query results. In this paper, we present the first, to the best of our knowledge, theoretical analysis that estimates the average number of false hits introduced in the results of rectangular range queries in the case of data points uniformly distributed in 2D space. Then, we relax the original distribution assumptions showing how to deal with arbitrarily distributed data points and more realistic location uncertainty distributions. The accuracy of the results of our analytical approach is demonstrated through an extensive experimental study using various synthetic and real datasets. Our proposal can be …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The MONIC framework for cluster transition detection",
            "Publication year": 2006,
            "Publication url": "https://kbs.uni-hannover.de/~ntoutsi/papers/06.HDMS.pdf",
            "Abstract": "There is much recent work on detecting and tracking changes in clusters, often based on the study of their spatiotemporal properties. For the many applications where cluster change is relevant, among them customer relationship management, fraud detection and marketing, it is also necessary to provide insights about the nature of change: Is a cluster corresponding to a group of customers simply disappearing or are its members migrating to other clusters? Is a new emerging cluster reflecting a new target group of customers or does it rather consist of existing customers whose preferences shift? To answer such questions, we propose the MONIC framework for modelling and tracking of cluster transitions. Our cluster transition model encompasses changes that involve more than one cluster, thus allowing for insights on cluster change in the whole clustering. Our transition tracking mechanism is not based on the topological properties of clusters, which are only available for some types of clustering, but on the contents of the underlying data stream. We present our first results on monitoring cluster transitions over the ACM digital library.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling and acquiring mobility data",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_3",
            "Abstract": "The vast spread of GPS equipped mobile devices, such as smart phones, GPS navigation devices etc., combined with the development of appropriate techniques for storing, processing, querying, and mining such kind of data, has resulted in the production of huge amounts of location-aware information. However, getting this kind of raw data into a meaningful form in terms of mobility is not a straightforward task at all. During this transformation procedure, many aspects arise, such as the treatment of inaccurate or noisy information, the identification of trajectories as sequences of sampled positions, the reduction of the size of the datasets in order to deal with the storage challenges that may appear, etc. Furthermore, in order to be able to evaluate the performance of spatiotemporal algorithms and data structures, enormous amounts of real-world mobility data are required, which cannot be easily found available …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:M7yex6snE4oC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Cost Models and Efficient Query Processing over Existentially Uncertain Spatial Data",
            "Publication year": 2008,
            "Publication url": "http://isl.cs.unipi.gr/pubs/TR/UNIPI-ISL-TR-2008-01.pdf",
            "Abstract": "The domain of existentially uncertain spatial data refers to objects that are modelled using an existential probability accompanying spatial data values. An interesting and challenging query type over existentially uncertain data is the search of the Nearest Neighbor (NN), since the probability of a potential dataset object to be the NN of the query object depends on the locations and probabilities of other points in the same dataset. In this paper, following a statistical approach, we estimate the average number of the NNs required to answer probabilistic thresholding NN (PTNN) queries as function of the threshold t, allowing us to utilize existing approaches and propose a cost model for such queries. Based on the same statistical approach, we propose an efficient algorithm for PTNN queries over arbitrarily structured existentially uncertain spatial data. Our experimental study demonstrates the accuracy and efficiency of the proposed techniques.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "UNIPI-ISL-TR-2008-01, Technical Report Series, University of Piraeus, 2008. Available at: http://isl. cs. unipi. gr/db/index. html"
        },
        {
            "Title": "ST_VISIONS: A Python Library for Interactive Visualization of Spatio-temporal Data",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9474850/",
            "Abstract": "In this demo paper we present ST_VISIONS, an easy-to-use Python library for interactive visualizations of spatial and spatio-temporal datasets. By automating the low-level details of the underlying visualization library (Bokeh), ST_VISIONS allows data scientists to create interactive, map-based visualizations, by writing Python code at a higher level of abstraction. Consequently, we accelerate the task of visualization from different sources, while we support interactive filtering, colorization, as well as multiple graphs, for various types of spatial and spatio-temporal data.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:UuaQgmrAG1sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Big Data Analytics for Time Critical Mobility Forecasting: Recent Progress and Research Challenges.",
            "Publication year": 2018,
            "Publication url": "https://crida.es/webcrida/wp-content/uploads/2018/12/2018-EDBT-Big-Data-Analytics-for-Time-Critical-Mobility-Forecasting-Recent-Progress-and-Research-Challenges.pdf",
            "Abstract": "The correlated exploitation of heterogeneous data sources offering very large archival and streaming data is important to increasing the accuracy of computations when analysing and predicting future states of moving entities. Aiming to significantly advance the capacities of systems to promote safety and effectiveness of critical operations for large numbers of moving entities in large geographical areas, this paper describes progress achieved towards time critical big data analytics solutions in user-defined challenges concerning moving entities in the air-traffic management and maritime domains. Specifically, the objective of this paper is to report progress and present further research challenges concerning data integration and management, predictive analytics for trajectory and events forecasting, and visual analytics.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:rzkGdFpNPO0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secondary Index.",
            "Publication year": 2009,
            "Publication url": "http://delab.csd.auth.gr/papers/SecondaryIndex2017.pdf",
            "Abstract": "A tree-based index is called a secondary index if the order which it maintains on the searchkey values is not the same as the order of the file which it indexes. For example, consider a relation R with some numeric attribute A taking values over an (ordered) domain D. Assume that relation R is not physically stored on the values of attribute A (ie, relation R is either stored as a heap–an unordered file, or is ordered on another attribute). Furthermore, assume that a tree-based index (eg, BC-tree) has been created on attribute A. Then this index is secondary.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fundamental Query Processing Techniques",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84628-293-5_4",
            "Abstract": "In this chapter, we present the basic techniques for processing spatial queries with R-trees. This includes methods for range and topological queries (which find data that satisfy a query region, along with their topological relations with respect to this region), nearest-neighbor queries (which find data closest to a query point), and spatial join queries (which find pairs of data that satisfy a condition, e.g., “determine all hotels that are placed near a square”). For each query type we present all the techniques and their variations that have been proposed in related research. Since the usefulness of the aforementioned query types is significant, several more complex extensions have been proposed. However, in this chapter we focus on the fundamental techniques and leave the examination of the more complex extensions for the next chapter.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Measuring and evaluating dissimilarity in data and pattern spaces",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.70.8263&rep=rep1&type=pdf#page=49",
            "Abstract": "Nowadays, the amount of patterns extracted from Knowledge Discovery and Data Mining (KDD) is rapidly growing, thus imposing new challenges regarding their management. One of the most important operations on pattern sets (or pattern bases) is that of similarity comparison. In our research, we investigate issues regarding pattern comparison and the degree of distance preservation in pattern space with respect to the original data space.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Baquara: A holistic ontological framework for movement analysis using linked data",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41924-9_28",
            "Abstract": "Movement understanding frequently requires further information and knowledge than what can be obtained from bare spatio-temporal traces. Despite recent progress in trajectory data management, there is still a gap between the spatio-temporal aspects and the semantics involved. This gap hinders trajectory analysis benefiting from growing collections of linked data, with well-defined and widely agreed semantics, already available on the Web. This article introduces Baquara, an ontology with rich constructs, associated with a system architecture and an approach to narrow this gap. The Baquara ontology functions as a conceptual framework for semantic enrichment of movement data with annotations based on linked data. The proposed architecture and approach reveal new possibilities for trajectory analysis, using database management systems and triple stores extended with spatial data and operators …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:URolC5Kub84C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Future Location and Trajectory Prediction",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-45164-6_8",
            "Abstract": "This chapter presents modern approaches and frameworks for predicting trajectories with detailed descriptions of three main research pillars. The first pillar is the problem formulation regarding two complementary tasks, namely the Future Location Prediction (FLP) and the Trajectory Prediction (TP). The second pillar tackles the issue of effectiveness, efficiency, and scalability    scalability  for the corresponding predictive analytics models for big fleets of moving objects. Finally, the third pillar takes into account historical patterns and semantically rich contextual information, so as to improve the prediction accuracy, especially for long-term time windows. The overall assessment of these methods shows that the suite of FLP and TP algorithms developed addresses all the major prediction challenges regarding mobility patterns in terms of points or trajectories, respectively. It is expected that these modeling approaches …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:kMrClmKSQGwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Advanced database indexing",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Mining trajectory databases via a suite of distance operators",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4401043/",
            "Abstract": "With the rapid progress of mobile devices and positioning technologies, Trajectory databases (TD) have been in the core of database research during the last decade. Analysis and knowledge discovery in TD is an emerging field which has recently gained great interest. Extracting knowledge from TD using certain types of mining techniques, such as clustering and classification, impose that there is a mean to quantify the distance between two trajectories. Having as a main objective the support of effective similarity query processing, existing approaches utilize generic distance metrics that ignore the peculiarities of the trajectories as complex spatio-temporal data types. In this paper, we define a novel set of trajectory distance operators based on primitive (space and time) as well as derived parameters of trajectories (speed and direction). Aiming at providing a powerful toolkit for analysts who require producing …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the comparison of association rule hiding heuristics",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=13928568612640017347&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:_Ycx_gLZKoMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How not to drown in a sea of information: An event recognition approach",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7363849/",
            "Abstract": "Maritime monitoring is a typical Big Data problem where hundreds of thousands of vessels across the globe transmit messages about their location, speed and other information. We have developed a system for online vessel tracking that performs, as a first step, a high-rate but accurate trajectory compression. Subsequently, the compressed trajectories are analyzed by a complex event recognition engine, promptly reporting alerts to maritime authorities. To deal with realistic maritime event patterns, we seamlessly integrated spatial and temporal reasoning for online event recognition. The system is evaluated on real data from the Greek seas.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:PVjk1bu6vJQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MetaOn-Ontology driven metadata construction and management for intelligent search in text and image collections",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1698384/",
            "Abstract": "State of the art in multimedia technology focuses in managing data collected from various sources, including documents, images, video, and speech. Therefore the effective management, analysis and mining of such heterogeneous data require the combination of various techniques. In this paper, we present an overview of the funded MetaOn project. The core objective of MetaOn is to construct and integrate semantically rich metadata collections extracted from documents, images and linguistic resources, to facilitate intelligent search and analysis. The proposed MetaOn framework involves ontology-based information extraction and data mining, semi-automatic construction of domain specific ontologies, content-based image indexing and retrieval, and metadata management. The Hellenic history has been chosen as a challenging application case study",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy miner: Extracting fuzzy rules from numerical patterns",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/data-warehousing-mining/7753",
            "Abstract": "We study the problem of classification as this is presented in the context of data mining. Among the various approaches that are investigated, we focus on the use of Fuzzy Logic for pattern classification, due to its close relation to human thinking. More specifically, this paper presents a heuristic fuzzy method for the classification of numerical data, followed by the design and the implementation of its corresponding tool (Fuzzy Miner). The initial idea comes from the fact that fuzzy systems are universal approximators of any real continuous function. Such an approximation method coming from the domain of fuzzy control is appropriately adjusted into pattern classification and an “adaptive” procedure is proposed for deriving highly accurate linguistic if-then rules. Extensive simulation tests are performed to demonstrate the performance of Fuzzy Miner, while a comparison with a neuro-fuzzy classifier of the area is taking …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:4hFrxpcac9AC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Time-aware Sub-Trajectory Clustering in Hermes@ PostgreSQL",
            "Publication year": 2018,
            "Publication url": "https://www.scipedia.com/public/Pelekis_et_al_2018b",
            "Abstract": "In this paper, we present an efficient in-DBMS framework for progressive time-aware sub-trajectory cluster analysis. In particular, we address two variants of the problem:(a) spatiotemporal sub-trajectory clustering and (b) index-based time-aware clustering at querying environment. Our approach for (a) relies on a two-phase process: a voting-and-segmentation phase followed by a sampling-and-clustering phase. Regarding (b), we organize data into partitions that correspond to groups of sub-trajectories, which are incrementally maintained in a hierarchical structure. Both approaches have been implemented in Hermes@ PostgreSQL, a real Moving Object Database engine built on top of PostgreSQL, enabling users to perform progressive cluster analysis via simple SQL. The framework is also extended with a Visual Analytics (VA) tool to facilitate real world analysis.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:T-Bu49-jKQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Unveiling movement uncertainty for robust trajectory similarity analysis",
            "Publication year": 2018,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13658816.2017.1372763",
            "Abstract": "Trajectory data analysis and mining require distance and similarity measures, and the quality of their results is directly related to those measures. Several similarity measures originally proposed for time-series were adapted to work with trajectory data, but these approaches were developed for well-behaved data that usually do not have the uncertainty and heterogeneity introduced by the sampling process to obtain trajectories. More recently, similarity measures were proposed specifically for trajectory data, but they rely on simplistic movement uncertainty representations, such as linear interpolation. In this article, we propose a new distance function, and a new similarity measure that uses an elliptical representation of trajectories, being more robust to the movement uncertainty caused by the sampling rate and the heterogeneity of this kind of data. Experiments using real data show that our proposal is more accurate …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:lRnoeYR1YAAC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Visual Analytics for Characterizing Mobility Aspects of Urban Context",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-15-8983-6_40",
            "Abstract": "Visual analytics science develops principles and methods for efficient human–computer collaboration in solving complex problems. Visual and interactive techniques are used to create conditions in which human analysts can effectively utilize their unique capabilities: the power of seeing, interpreting, linking, and reasoning. Visual analytics research deals with various types of data and analysis tasks from numerous application domains. A prominent research topic is analysis of spatiotemporal data, which may describe events occurring at different spatial locations, changes of attribute values associated with places or spatial objects, or movements of people, vehicles, or other objects. Such kinds of data are abundant in urban applications. Movement data are a quintessential type of spatiotemporal data because they can be considered from multiple perspectives as trajectories, as spatial events, and as changes of …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:M6kHaddf_34C",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "Seismological data warehousing and mining: A survey",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/article/seismological-data-warehousing-mining/1797",
            "Abstract": "Earthquake data composes an ever increasing collection of earth science information for post-processing analysis. Earth scientists, local or national administration officers and so forth, are working with these data collections for scientific or planning purposes. In this article, we discuss the architecture of a so-called seismic data management and mining system (SDMMS) for quick and easy data collection, processing, and visualization. The SDMMS architecture includes, among others, a seismological database for efficient and effective querying and a seismological data warehouse for OLAP analysis and data mining. We provide template schemes for these two components as well as examples of their functionality towards the support of decision making. We also provide a comparative survey of existing operational or prototype SDMMS.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Semantic aspects on mobility data",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_9",
            "Abstract": "The bang of mobility data (due to the evolution of positioning devices such as GPS-enabled smartphones and tablets, on-board navigation systems in vehicles, vessels and planes, smart chips embedded in animals, etc.) has an equal share in what is called the BIG DATA era that raises important issues for Moving Object Databases (MOD) and Trajectory Data Warehouses (TDW), which are responsible for the operational and analytical, respectively, processing of moving object trajectories. A reasonable question that arises, is whether we really need all this detailed (i.e., point-by-point) information in order to perform the above processing effectively (i.e., having advanced mobile-aware applications and services in mind)? Trying to address this question, during the recent years mobility data are accompanied by semantic information (such as diaries filled in manually by citizens for urban transportation research …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Processing More Complex Queries",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84628-293-5_5",
            "Abstract": "The query processing techniques studied in the previous chapter can be considered fundamental. In recent research, however, several more complex extensions have been proposed, which consider additional aspects. In this chapter, we consider such extensions and present them in the same order as in the previous chapter. Therefore, we first describe extensions to range queries, next we consider extensions to nearest-neighbor queries, and finally we present extensions to spatial join queries. These queries require significant I/O and CPU cost, and therefore sophisticated methods have be applied to reduce processing cost. Finally, approximate query processing techniques are presented that sacrifice accuracy for better performance.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Tree-Based Indexing.",
            "Publication year": 2009,
            "Publication url": "http://delab.csd.auth.gr/papers/TreeIndexing2017.pdf",
            "Abstract": "Consider a relation R with some numeric attribute A taking values over an (ordered) domain D. A range query retrieves all tuples in R whose attribute A has values in the interval [low, high]. That is, low Ä RA Ä high. To enable fast processing of range selection queries, an access method that maintains order is needed. Such an index has the form of a tree, where each node corresponds to a page. Leaf nodes contain (or index) the actual values of A, while index nodes provide ordered access to the nodes underneath. Examples of tree-based indexing are the BC-tree and the R-tree (for single-and multidimensional ranges, respectively).",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trajectory Detection and Summarization over Surveillance Data Streams",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-45164-6_4",
            "Abstract": "In this chapter, we present Synopses Generator, a stream-based processing framework that can provide online summarized representations of trajectories specifically for sailing vessels and flying aircraft. Assuming that surveillance data monitoring their locations over a large geographical area is available in a streaming fashion, this novel methodology drops any predictable positions (along trajectory segments of “normal” motion characteristics) with minimal loss in accuracy. Effectively, it can keep only those positions conveying salient mobility events (annotated as stop, change in speed, heading, or altitude, etc.), identified when the mobility pattern of a given vessel or aircraft changes significantly. Moreover, this framework specifies parametrized conditions for detecting such mobility features, as well as suitable heuristics that can eliminate inherent noise and can provide succinct trajectory synopses in one pass …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:uYElc5AnwZoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Report on the International Workshop on Pattern Representation and Management (PaRMa'04)",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1083784.1083799",
            "Abstract": "The increasing ability to quickly collect and cheaply store large volumes of data, and the need for extracting concise information to be efficiently manipulated and intuitively analyzed, are posing new requirements for Database Management Systems (DBMS) in both industrial and scientific applications. A common approach to deal with huge data volumes is to reduce the available information to knowledge artifacts (i.e., clusters, rules, etc.), hereafter called patterns, through data processing methods (pattern recognition, data mining, knowledge extraction). Patterns reduce the number and size of the original information to manageable size while preserving as much as possible its hidden / interesting content. In order to efficiently and effectively deal with patterns, academic groups and industrial consortiums have recently devoted efforts towards modeling, storage, retrieval, analysis and manipulation of patterns with …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:_xSYboBqXhAC",
            "Publisher": "ACM"
        },
        {
            "Title": "Hermoupolis: a trajectory generator for simulating generalized mobility patterns",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40994-3_49",
            "Abstract": "During the last decade, the domain of mobility data mining has emerged providing many effective methods for the discovery of intuitive patterns representing collective behavior of trajectories of moving objects. Although a few real-world trajectory datasets have been made available recently, these are not sufficient for experimentally evaluating the various proposals, therefore, researchers look to synthetic trajectory generators. This case is problematic because, on the one hand, real datasets are usually small, which compromises scalability experiments, and, on the other hand, synthetic dataset generators have not been designed to produce mobility pattern driven trajectories. Motivated by this observation, we present Hermoupolis, an effective generator of synthetic trajectories of moving objects that has the main objective that the resulting datasets support various types of mobility patterns (clusters, flocks …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:epqYDVWIO7EC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A tool for collecting, querying and mining macroseismic data",
            "Publication year": 2004,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/geosociety/article/view/16509",
            "Abstract": "SEISMO-SURFER is a tool for collecting, querying and mining seismic data being developed in Java programming language using Oracle database system. The objective is to combine recent research trends and results in the fields of spatial and spatio-temporal databases, data warehouses and data mining, as well as well established visualization techniques for geographical information. The database of the tool is automatically updated from remote sources while existing possibilities allow the querying on different earthquakes parameters, the analysis of the data for extraction of useful information and the graphical representation of the results via maps, charts etc. In the present work, we extend SEISMO-SURFER to include macroseismic data collected by the Geodynamic Institute and filled in a relative database. More specifically, the seismic parameters of the strong earthquakes, stored into the SEISMO-SURFER database, are linked to the macroseismic intensities observed at different sites. Administrative information for each site, local surface geology, tectonic lines, damage photographs and detailed descriptions from newspapers are also included. University of Piraeus and Geodynamic Institute are working together to continuously update and develop SEISMO-SURFER, concerning the data included, the variety of parameters stored and the mining algorithms supported for exploiting knowledge.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hermessem: A semantic-aware framework for the management and analysis of our LifeSteps",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7344849/",
            "Abstract": "The explosion of available positioning information associated with the inferred or user-declared semantics of the respective locations, already contributes in what is called the big data era, posing new challenges to the mobility data management and mining research community. In this paper, motivated by a series of challenges set in [11], we present a unified framework for the management and the analysis of our LifeSteps, i.e. data objects that include both (raw) trajectories and their semantic counterpart. In particular, we provide solutions for developing real-world semantic-aware Moving Object Database (MOD) and Trajectory Data Warehouse (TDW) systems and we devise respective query processing algorithms. Our experimental study on synthetic data including synchronized raw (i.e., GPS log) and semantic (i.e., diaries) information, verifies the effectiveness and efficiency of the proposed framework.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:86PQX7AUzd4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the effect of trajectory compression in spatiotemporal querying",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75185-4_17",
            "Abstract": "Existing work repeatedly addresses that the ubiquitous positioning devices will start to generate an unprecedented stream of time-stamped positions leading to storage and computation challenges. Hence the need for trajectory compression arises. The goal of this paper is to estimate the effect of compression in spatiotemporal querying; towards this goal, we present an analysis of this effect and provide a model to estimate it in terms of average false hits per query. Then, we propose a method to deal with the model’s calculation, by incorporating it in the execution of the compression algorithm. Our experimental study shows that this proposal introduces a small overhead in the execution of trajectory compression algorithms, and also verifies the results of the analysis, confirming that our model can be used to provide a good estimation of the effect of trajectory compression in spatiotemporal querying.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:GnPB-g6toBAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "R-trees in spatiotemporal databases",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84628-293-5_6",
            "Abstract": "Spatiotemporal database systems aim at combining the spatial and temporal characteristics of data. There are many applications that benefit from efficient processing of spatiotemporal queries such as: mobile communication systems, traffic control systems (e.g., air-traffic monitoring), geographical information systems (GIS), multimedia, and location-based services (LBS). The common basis of these applications is the requirement to handle both the space and time characteristics of the underlying data [217, 232, 246]. These applications pose high requirements concerning the data and the operations that need to be supported, and therefore new techniques and tools are needed for increased processing efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:olpn-zPbct0C",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Generating spatiotemporal datasets on the WWW",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/362084.362104",
            "Abstract": "Efficient storage, indexing and retrieval of time-evolving spatial data are some of the tasks that a Spatiotemporal Database Management System (STDBMS) must support. Aiming at designers of indexing methods and access structures, in this article we review the GSTD algorithm for generating spatiotemporal datasets according to several user-defined parameters, and introduce a WWW-based environment for generating and visualizing such datasets. The GSTD interface is available at two main sites: http://www.cti.gr/RD3/GSTD/ and http://www.cs.ualberta.ca/~mn/GSTD/.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:UebtZRa9Y70C",
            "Publisher": "ACM"
        },
        {
            "Title": "Pattern Comparison in Data Mining",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=1bpEifVEi2MC&oi=fnd&pg=PA228&dq=info:RFtYlN0pGq8J:scholar.google.com&ots=WAEb0ftjHL&sig=jJKJl_GJT_PijsPpcZbTASe2Anw",
            "Abstract": "Many patterns are available nowadays due to the widespread use of knowledge discovery in databases (KDD), as a result of the overwhelming amount of data. This “flood” of patterns imposes new challenges regarding their management. Pattern comparison, which aims at evaluating how close to each other two patterns are, is one of these challenges resulting in a variety of applications. In this chapter we investigate issues regarding the pattern comparison problem and present an overview of the work performed so far in this domain. Due to heterogeneity of data mining patterns, we focus on the most popular pattern types, namely frequent itemsets and association rules, clusters and clusterings, and decision trees.Nowadays a large quantity of raw data is collected from different application domains (business, science, telecommunication, health care systems, etc.). According to Lyman and Varian (2003),“The world produces between 1 and 2 exabytes of unique information per year, which is roughly 250 megabytes for every man, woman, and child on earth”. Due to their quantity and complexity, it is impossible for humans to thoroughly investigate these data collections directly. Knowledge discovery in databases (KDD) and data mining (DM) provide a solution to this problem by generating compact and rich semantics representations of raw data, called patterns (Rizzi et al, 2003). With roots in machine learning, statistics, and pattern recognition, KKD aims at extracting valid, novel, potentially useful, and ultimately understandable",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:0kxB6oEY0CcC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Fragkiskos Gryllakis",
            "Publication year": 2018,
            "Publication url": "http://openproceedings.org/2018/conf/edbt/paper-306.pdf",
            "Abstract": "In this paper, we demonstrate Hermes@ Neo4j1, an extension of Neo4j graph DMBS for semantic trajectories of moving objects, on the so-called Spatio-Temporal-Keyword Pattern queries. For this purpose, our engine exploits on hybrid Spatio-Temporal-",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:l1jknz_x7mgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "i4sea: a big data platform for sea area monitoring and analysis of fishing vessels activity",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10095020.2021.1971055",
            "Abstract": "The i4sea research project provides effective and efficient big data integration, processing, and analysis technologies to deliver both real-time and historical operational snapshots of fishing vessels activity in national sea areas. This paper presents the architecture of the i4sea big data platform for sea area monitoring and analysis of fishing vessels activity and demonstrates the operation of some use-case pilot scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:rEjdzzKT7SMC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Trajectory database systems",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75177-9_7",
            "Abstract": "In this chapter, we deal with trajectory database management issues and physical aspects of trajectory database systems, such as indexing and query processing. Our emphasis is on historical databases handling past positions of moving objects represented as trajectories. This is because only such databases can be used in the context of trajectory data warehouses, which is the core subject of this book.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Preparing for Mobility Data Exploration",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_6",
            "Abstract": "Exploring mobility data already collected and stored in efficient database systems is the next step of mobility data management. Historical data ‘hide’ a treasure of ‘buried’ knowledge that ‘asks’ for mining. To do so, the typical Knowledge Discovery in Data (KDD) process typically includes the organization of historical information in a Data Warehouse (DW), a first level of analysis exploiting on data cubes build upon the DW, according to a multi-dimensional model, and, then, a deeper look into the data in order to extract models and patterns that data obey or follow, using data mining techniques. In this chapter, we provide the preparatory actions in order for data mining to follow in the next chapter. In particular, we present DW approaches for mobility, especially for trajectory data (Sect. 6.1), discuss about the kind of multi-dimensional analysis that is suitable for mobility data and the challenges that arise due to …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:tuHXwOkdijsC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Moving objects analytics: survey on future location & trajectory prediction methods",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1807.04639",
            "Abstract": "The tremendous growth of positioning technologies and GPS enabled devices has produced huge volumes of tracking data during the recent years. This source of information constitutes a rich input for data analytics processes, either offline (e.g. cluster analysis, hot motion discovery) or online (e.g. short-term forecasting of forthcoming positions). This paper focuses on predictive analytics for moving objects (could be pedestrians, cars, vessels, planes, animals, etc.) and surveys the state-of-the-art in the context of future location and trajectory prediction. We provide an extensive review of over 50 works, also proposing a novel taxonomy of predictive algorithms over moving objects. We also list the properties of several real datasets used in the past for validation purposes of those works and, motivated by this, we discuss challenges that arise in the transition from conventional to Big Data applications. CCS Concepts: Information systems > Spatial-temporal systems; Information systems > Data analytics; Information systems > Data mining; Computing methodologies > Machine learning Additional Key Words and Phrases: mobility data, moving object trajectories, trajectory prediction, future location prediction.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:VTkKiNFP83YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Offline Trajectory Analytics",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-45164-6_10",
            "Abstract": "In recent years, there has been observed an “explosion” of trajectory data production due to the proliferation of GPS-enabled devices, such as mobile phones and tablets. This massive-scale data generation has posed new challenges in the data management community in terms of storing, querying, analyzing, and extracting knowledge out of such data. Knowledge discovery out of mobility data is essentially the goal of every mobility data analytics task. Especially in the maritime and aviation domains, this relates to challenging use-case scenarios, such as discovering valuable behavioral patterns of moving objects, identifying different types of activities in a region of interest, environmental fingerprint, etc. In order to be able to support such scenarios, an analyst should be able to apply, at massive scale, several knowledge discovery techniques, such as trajectory clustering, hotspot analysis, and frequent route …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:_TIfIljC7OAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Query Optimization Issues",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84628-293-5_8",
            "Abstract": "Determining the best execution plan for a spatial query requires tools for measuring (more precisely, estimating) the number of (spatial) data items that are retrieved by a query as well as its cost, in terms of I/O and CPU effort. As in traditional databases, spatial query optimization tools include cost-based models, exploiting analytical formulae for selectivity and cost of a query, and histogram-based techniques.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Building real-world trajectory warehouses",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1626536.1626539",
            "Abstract": "The flow of data generated from low-cost modern sensing technologies and wireless telecommunication devices enables novel research fields related to the management of this new kind of data and the implementation of appropriate analytics for knowledge extraction. In this work, we investigate how the traditional data cube model is adapted to trajectory warehouses in order to transform raw location data into valuable information. In particular, we focus our research on three issues that are critical to trajectory data warehousing:(a) the trajectory reconstruction procedure that takes place when loading a moving object database with sampled location data originated eg from GPS recordings,(b) the ETL procedure that feeds a trajectory data warehouse, and (c) the aggregation of cube measures for OLAP purposes. We provide design solutions for all these issues and we test their applicability and efficiency in real world …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spatial Joins: Algorithms, Cost Models and Optimization",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.101.6047&rep=rep1&type=pdf",
            "Abstract": "This chapter describes algorithms, cost models and optimization techniques for spatial joins. Joins are among the most common queries in Spatial Database Management Systems. Due to their importance and high processing cost, a number of algorithms have been proposed covering all possible cases of indexed and non-indexed inputs. We first describe some popular methods for processing binary spatial joins and provide models for selectivity and cost estimation. Then, we discuss evaluation of multiway",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "In-network approximate computation of outliers with quality guarantees",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437911001116",
            "Abstract": "Wireless sensor networks are becoming increasingly popular for a variety of applications. Users are frequently faced with the surprising discovery that readings produced by the sensing elements of their motes are often contaminated with outliers. Outlier readings can severely affect applications that rely on timely and reliable sensory data in order to provide the desired functionality. As a consequence, there is a recent trend to explore how techniques that identify outlier values based on their similarity to other readings in the network can be applied to sensory data cleaning. Unfortunately, most of these approaches incur an overwhelming communication overhead, which limits their practicality. In this paper we introduce an in-network outlier detection framework, based on locality sensitive hashing, extended with a novel boosting process as well as efficient load balancing and comparison pruning mechanisms. Our …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:D03iK_w7-QYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "International Journal of Knowledge-Based Organizations",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/pdf.aspx?tid%3D125580%26ptid%3D118838%26ctid%3D15%26t%3Dtable+of+contents",
            "Abstract": "International Journal of Knowledge-Based Organizations Page 1 The International Journal of \nKnowledge-Based Organizations is indexed or listed in the following: Bacon’s Media Directory; \nCabell’s Directories; DBLP; Google Scholar; INSPEC; JournalTOCs; MediaFinder; ProQuest \nAdvanced Technologies & Aerospace Journals; ProQuest Computer Science Journals; \nProQuest Engineering Journals; ProQuest Illustrata: Technology; ProQuest SciTech Journals; \nProQuest Technology Journals; The Standard Periodical Directory; Ulrich’s Periodicals \nDirectory Copyright The International Journal of Knowledge-Based Organizations (IJKBO) (ISSN \n2155-6393; eISSN 2155-6407), Copyright © 2015 IGI Global. All rights, including translation \ninto other languages reserved by the publisher. No part of this journal may be reproduced or \nused in any form or by any means without written permission from the publisher, except for , . …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:kh2fBNsKQNwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PBMS Querying and Storage Issues",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=783402061049263616&hl=en&oi=scholarr",
            "Abstract": "Motivated by a benchmark pattern base, we present a wish list of queries that should be supported by a Pattern-Base Management System (PBMS) and examine alternative approaches regarding the physical representation layer, namely the relational, the objectrelational, and the semi-structured data model. A primitive comparative study of their advantages and disadvantages follows.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:RYcK_YlVTxYC",
            "Publisher": "PANDA Technical Report PANDA-TR-2004-02"
        },
        {
            "Title": "Implementation Issues",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84628-293-5_9",
            "Abstract": "The implementation of an access method in a commercial DBMS or a research prototype raises many issues that must be considered to provide effective and efficient access to the underlying data. An access method is useless unless it can be efficiently implemented in real-life data intensive applications. Making the access method part of a larger (usually multiuser) system is not an easy task. The access method must be adjusted to the underlying system architecture and therefore issues like concurrency control and parallelism must be handled carefully. In this chapter, we discuss implementation issues regarding the Rtree access method. More specifically, we investigate the following topics:   the adjustment of the R-tree to parallel architectures,   the management of concurrent accesses, and   R-tree implementations in …the adjustment of the R-tree to parallel architectures,the management of concurrent accesses, andR-tree implementations in …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:eflP2zaiRacC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Fuzzy Miner: Extracting Fuzzy Rules from Numerical Patterns",
            "Publication year": 2008,
            "Publication url": "https://www.research.manchester.ac.uk/portal/en/publications/fuzzy-miner-extracting-fuzzy-rules-from-numerical-patterns(947fb5f2-d1f8-4038-8e96-a7f73c9aad52).html",
            "Abstract": "Fuzzy Miner: Extracting Fuzzy Rules from Numerical Patterns | Research Explorer | The \nUniversity of Manchester The University of Manchester Menu Search the University of \nManchester site Search Search text Search type Research Explorer Website Staff directory \nAlternatively, use our A–Z index Home Study Undergraduate Undergraduate Courses \nProspectus (undergraduate) Offer-holders Undergraduate Teaching and learning \nExpanding your study (undergraduate) After you graduate (undergraduate) Undergraduate \nApplications Undergraduate Student finance Webinars (undergraduate) Contextual \nadmissions Mature students Parents and supporters Contact us (undergraduate) Taught \nmaster's Why study a master's? Why Manchester? (taught master's) Taught master's \nCourses Teaching and learning (taught master's) After you graduate (taught master's) \nPostgraduate prospectus (taught master's) Admissions () (…",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:dJ-sGqsME_YC",
            "Publisher": "Information Science Reference"
        },
        {
            "Title": "A framework for trajectory data warehousing",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Gerasimos-Marketos/publication/228971768_A_Framework_for_Trajectory_Data_Warehousing/links/0fcfd505bbc883c370000000/A-Framework-for-Trajectory-Data-Warehousing.pdf",
            "Abstract": "Technological advances in sensing technologies and wireless telecommunication devices enable novel research fields related to the management of trajectory data. As it usually happens in data management world, the challenge after storing the data is the implementation of appropriate analytics that could extract useful knowledge. However, traditional data warehousing systems and techniques were not designed for analyzing trajectory data. Thus, in this work, we investigate how the traditional data cube model is adapted to trajectory warehouses in order to transform raw location data into valuable information. In particular, we focus our research on three issues that are critical to trajectory data warehousing:(a) the trajectory reconstruction procedure that takes place in order to transform sampled location data originated eg from GPS recordings into trajectories and load them to a moving object database,(b) the ETL procedure that feeds a trajectory data warehouse, and (c) the aggregation of cube measures for OLAP purposes. We provide design solutions for all these issues and we test their applicability and efficiency in real world settings.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards the next generation of location-based services",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-76925-5_15",
            "Abstract": "Location-based services (LBS) constitute an emerging application domain rapidly introduced in modern life habits. However, given that LBS already count a few years of commercial life, the services provided are rather naïve, not exploiting the current software capabilities and the recent research advances in the fields of spatial and spatio-temporal data management. The goal of this paper is to fill this gap by first presenting the next generation of location-based services and then, demonstrating their implementation which takes advantage of both modern commercial software and state-of-the-art spatial network and spatio-temporal databases techniques. Novel techniques are also proposed in fields non-thoroughly addressed by the research community, such as the prediction of future position of objects moving on a road network.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Sustainable Urban Mobility in the Post-Pandemic Era (position paper)",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2109.12982",
            "Abstract": "COVID-19 is the first pandemic of the modern world causing significant changes to the everyday life of billions of people in all continents. To reduce its expansion, most governments decided to mitigate a great percentage of daily movements of their citizens. For instance, they enforced strict controls (in space, time, etc.) on urban movement whereas they selectively prohibited international air and ground connections. In this short study, we briefly discuss some lessons learned out of this process based on recorded mobility figures, and we raise challenges that are emerging in the post-pandemic era, in the intersection of the sustainable urban mobility and movement data science fields.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:osi8XriVlOYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access methods for intervals",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-8590-3_4",
            "Abstract": "Intervals provide a compact way to represent the duration of a property. They appear in many database applications, including spatial, temporal [Jensen and Snodgrass, 1999], constraint [Bertino et al., 1997; Ramaswamy, 1997] and object-oriented databases [Kanellakis et al., 1993]. Due to their importance, many techniques have been proposed in literature for indexing intervals. Here we concentrate on the 1-dimensional dynamic interval management problem and in particular the so-called stabbing query. We first present classical main-memory solutions to the stabbing query, namely: the Interval Tree, the Segment Tree and the Priority Search Tree. These structures have been extended in various ways to support intervals in external memory (i.e., on the disk). Among other structures in this chapter we discuss: the Segment R-tree, the External Segment Tree, the External Priority Search Tree, the Metablock …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Systems for Privacy-Preserving Mobility Data Management",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-98161-1_11",
            "Abstract": "The increasing availability of data due to the explosion of mobile devices and positioning technologies has led to the development of efficient management and mining techniques for mobility data. However, the analysis of such data may result in significant risks regarding individuals’ privacy. A typical approach for privacy-aware mobility data sharing aims at publishing an anonymized version of the mobility dataset, operating under the assumption that most of the information in the original dataset can be disclosed without causing any privacy violation. On the other hand, an alternative strategy considers that data stays in-house to the hosting organization and privacy-preserving mobility data management systems are in charge of privacy-aware sharing of the mobility data. In this chapter, we present the state-of-the-art of the latter approach, including systems such as HipStream, Hermes++, and Private-Hermes.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:F1-V36_CjEsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Hands-on with Hermes@ Oracle MOD",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_12",
            "Abstract": "Moving Object Database (MOD) engines enable us to process, manage and analyze mobility data. One of the already presented systems that satisfy these requirements is the Hermes MOD engine. Hermes provides MOD functionality to OpenGIS-compatible state-of-the-art Object-Relational DBMS. Currently, Hermes comes in two implementations; the first operates on top of Oracle DBMS (denoted as Hermes@Oracle) and the second operates on top of PostgreSQL (denoted as Hermes@Postgres). In Chap.                  5                                , we studied the collection of abstract data types (ADT) and their corresponding operations of the Hermes@Oracle, which were defined, developed and provided as a data cartridge extending Oracle’s SQL query language with MOD semantics. The present chapter contains a detailed description of a hands-on experience over a dataset of synthetic trajectories (produced by the …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Hot spot analysis over big trajectory data",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8622376/",
            "Abstract": "Hot spot analysis is the problem of identifying statistically significant spatial clusters from an underlying data set. In this paper, we study the problem of hot spot analysis for massive trajectory data of moving objects, which has many real-life applications in different domains, especially in the analysis of vast repositories of historical traces of spatio-temporal data (cars, vessels, aircrafts). In order to identify hot spots, we propose an approach that relies on the Getis-Ord statistic, which has been used successfully in the past for point data. Since trajectory data is more than just a collection of individual points, we formulate the problem of trajectory hot spot analysis, using the Getis-Ord statistic. We propose a parallel and scalable algorithm for this problem, called THS, which provides an exact solution and can operate on vast-sized data sets. Moreover, we introduce an approximate algorithm (aTHS) that avoids exhaustive …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:mSXQG6lSlFkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Online Long-Term Trajectory Prediction Based on Mined Route Patterns",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=K_bHDwAAQBAJ&oi=fnd&pg=PA34&dq=info:NwvlKbk_I00J:scholar.google.com&ots=W8l5yyDmWW&sig=kQIHpowo8e4gyRLhDKhrahAEgeI",
            "Abstract": "In this paper, we present a Big data framework for the prediction of streaming trajectory data by exploiting mined patterns of trajectories, allowing accurate long-term predictions with low latency. In particular, to meet this goal we follow a two-step methodology. First, we efficiently identify the hidden mobility patterns in an offline manner. Subsequently, the trajectory prediction algorithm exploits these patterns in order to prolong the temporal horizon of useful predictions. The experimental study is based on real-world aviation and maritime datasets.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:c3oc_9pK2TEC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "State-of-the-art in privacy preserving data mining",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/974121.974131",
            "Abstract": "We provide here an overview of the new and rapidly emerging research area of privacy preserving data mining. We also propose a classification hierarchy that sets the basis for analyzing the work which has been performed in this context. A detailed review of the work accomplished in this area is also given, along with the coordinates of each work to the classification hierarchy. A brief evaluation is performed, and some initial conclusions are made.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:u-x6o8ySG0sC",
            "Publisher": "ACM"
        },
        {
            "Title": "R-trees for Multimedia, Warehousing and Mining",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84628-293-5_7",
            "Abstract": "Modern applications like multimedia, data warehouses, and data mining require the organization and manipulation of complex objects, and pose diverse requirements with respect to the efficient processing of queries. Based on the fact that indexing schemes are ubiquitous to improving the response time of a user query, researchers studied the application of indexing techniques to the aforementioned advanced applications as well. In this chapter, we focus on the application of the R-tree access method to the efficient handling end processing of multimedia queries, data warehousing operations, and data mining tasks.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer, London"
        },
        {
            "Title": "HERMES: aggregative LBS via a trajectory DB engine",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1376616.1376748",
            "Abstract": "We present HERMES, a prototype system based on a powerful query language for trajectory databases, which enables the support of aggregative Location-Based Services (LBS). The key observation that motivates HERMES is that the more the knowledge in hand about the trajectory of a mobile user, the better the exploitation of the advances in spatio-temporal query processing for providing intelligent LBS. HERMES is fully incorporated into a state-of-the-art Object-Relational DBMS, and its demonstration illustrates its flexibility and usefulness for delivering custom-defined LBS.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient ais data processing for environmentally safe shipping",
            "Publication year": 2013,
            "Publication url": "https://spoudai.unipi.gr/index.php/spoudai/article/view/81",
            "Abstract": "Reducing ship accidents at sea is important to all economic, environmental, and cultural sectors of Greece. Despite an increase in traffic and national monitoring, ships formulate routes according to their best judgment risking an accident. In this study we take a dataset spanning in 3 years from the AIS (Automatic Identification System) network, which is transmitting in public a ship's identity and location with an interval of seconds, and we load it in a trajectory database supported by the Hermes Moving Objects Database (MOD) system. Presented analysis begins by extracting statistics for the dataset, both general (number of ships and position reports) as well as safety related ones. Simple queries on the dataset illustrate the capabilities of Hermes and allow to gain insight on how the ships move in the Greek Seas. Analysis of movement based on an Origin-Destination matrix between interesting areas in the Greek territory is presented. One of the newest challenges that emerged during this process is that the amount of the positioning data is becoming more and more massive. As a conclusion, a preliminary review of possible solutions to this challenge along with others such as dealing with the noise in AIS data is mentioned and we also briefly discuss the need for interdisciplinary cooperation.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "BabisTheodoulidis",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4456818976298443869&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:m1aD9PlKDecC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic Versions of R-trees",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84628-293-5_2",
            "Abstract": "The survey by Gaede and Guenther [69] annotates a vast list of citations related to multi-dimensional access methods and, in particular, refers to R-trees to a significant extent. In this chapter, we are further focusing on the family of R-trees by enlightening the similarities and differences, advantages and disadvantages of the variations in a more exhaustive manner. As the number of variants that have appeared in the literature is large, we group them according to the special characteristics of the assumed environment or application, and we examine the members of each group.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer, London"
        },
        {
            "Title": "KDD for Decision Making and Optimisation",
            "Publication year": 2008,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=20347941",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:BnRbUGEozz8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework for integrating ontologies and pattern-bases",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/data-mining-ontologies/7580",
            "Abstract": "Pattern Base Management Systems (PBMS) have been introduced as an effective way to manage the high volume of patterns available nowadays. PBMS provide pattern management functionality in the same way where a Database Management System provides data management functionality. However, not all the extracted patterns are interesting; some are trivial and insignificant because they do not make sense according to the domain knowledge. Thus, in order to automate the pattern evaluation process, we need to incorporate the domain knowledge in it. We propose the integration of PBMS and Ontologies as a solution to the need of many scientific fields for efficient extraction of useful information from large databases and the exploitation of knowledge. In this chapter, we describe the potentiality of this integration and the issues that should be considered introducing an XML-based PBMS. We use a case …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Pattern comparison in data mining: a survey",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/pattern-comparison-data-mining/28422",
            "Abstract": "Many patterns are available nowadays due to the widespread use of knowledge discovery in databases (KDD), as a result of the overwhelming amount of data. This “flood” of patterns imposes new challenges regarding their management. Pattern comparison, which aims at evaluating how close to each other two patterns are, is one of these challenges resulting in a variety of applications. In this chapter we investigate issues regarding the pattern comparison problem and present an overview of the work performed so far in this domain. Due to heterogeneity of data mining patterns, we focus on the most popular pattern types, namely frequent itemsets and association rules, clusters and clusterings, and decision trees.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:blknAaTinKkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Spatiotemporal access methods",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-8590-3_7",
            "Abstract": " Spatiotemporal Database Management Systems (STDBMSs) manage data whose geometry changes over time. There are many applications that create such data, including global change (as in climate or land cover changes), transportation (traffic surveillance data, intelligent transportation systems), social (demographic, health, etc.), and multimedia (animated movies) applications. For simplicity we consider two spatial attributes, the object position and extent, either (or both) of which can change with time. Based on the rate that spatial attributes change, we identify two cases: the discrete and the continuous spatiotemporal environments. We first introduce the basic characteristics and interesting queries for each environment and then present efficient spatiotemporal indexing techniques.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Mobility Data Management and Exploration",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4939-0392-4.pdf",
            "Abstract": "Mobility data is ubiquitous, particularly due to the automated collection of timestamped location information from GPS-equipped devices, from everyday smartphones to dedicated software and hardware in charge of monitoring movement in land, sea, and air. Such wealth of data, referenced both in space and time, enables novel classes of applications and services of high societal and economic impact, provided that the discovery of consumable and concise knowledge out of these raw data collections is made possible. In this book, we aim at presenting a step-by-step methodology to understand, manage, and exploit mobility data: from the collecting and cleansing data stage to their storage in Moving Object Database (MOD) engines, and, then, analyzing and mining mobility data for decision-making purposes. Privacy aspects arising from handling mobility data and emerging topics, such as semantic-aware and …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:D-3shSm-n1oC",
            "Publisher": "Springer"
        },
        {
            "Title": "Mobility Database Management",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_4",
            "Abstract": "Adding temporal information, as an extra attribute in spatial databases, is not as straightforward as it may appear at a first glance. Time is not yet another dimension besides the two (or three, in some applications) spatial dimensions; monotonicity, for example, is a key difference. Could we adopt “as-is” methods and techniques for spatial databases, such as the ones outlined in Chap. 2? The answer is rather not, and this has been argued extensively in the spatiotemporal database literature. Therefore, novel data types (e.g., moving points), query processing techniques (e.g., “search for trajectories that ‘entered’ an area during a timeframe” or “search for trajectories that are ‘similar’ with respect to a reference trajectory”) and indexing methods (most probably, extensions of the well-known R-tree) have been explored. This chapter surveys the above aspects, which are essential components of a database system …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "A Survey on Big Data Processing Frameworks for Mobility Analytics",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3484622.3484626",
            "Abstract": "In the current era of big spatial data, the vast amount of produced mobility data (by sensors, GPS-equipped devices, surveillance networks, radars, etc.) poses new challenges related to mobility analytics. A cornerstone facilitator for performing mobility analytics at scale is the availability of big data processing frameworks and techniques tailored for spatial and spatio-temporal data. Motivated by this pressing need, in this paper, we provide a survey of big data processing frameworks for mobility analytics. Particular focus is put on the underlying techniques; indexing, partitioning, query processing are essential for enabling efficient and scalable data management. In this way, this report serves as a useful guide of state-of-the-art methods and modern techniques for scalable mobility data management and analytics.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:4IpgxnMJogoC",
            "Publisher": "ACM"
        },
        {
            "Title": "Time-aware sub-trajectory clustering in hermes@ postgresql",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8509402/",
            "Abstract": "In this paper, we present an efficient in-DBMS framework for progressive time-aware sub-trajectory cluster analysis. In particular, we address two variants of the problem: (a) spatiotemporal sub-trajectory clustering and (b) index-based time-aware clustering at querying environment. Our approach for (a) relies on a two-phase process: a voting-and-segmentation phase followed by a sampling-and-clustering phase. Regarding (b), we organize data into partitions that correspond to groups of sub-trajectories, which are incrementally maintained in a hierarchical structure. Both approaches have been implemented in Hermes@PostgreSQL, a real Moving Object Database engine built on top of PostgreSQL, enabling users to perform progressive cluster analysis via simple SQL. The framework is also extended with a Visual Analytics (VA) tool to facilitate real world analysis.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:cTLm0pkq19gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nearest neighbor search on moving object trajectories",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11535331_19",
            "Abstract": "With the increasing number of Mobile Location Services (MLS), the need for effective k-NN query processing over historical trajectory data has become the vehicle for data analysis, thus improving existing or even proposing new services. In this paper, we investigate mechanisms to perform NN search on R-tree-like structures storing historical information about moving object trajectories. The proposed branch-and-bound algorithms vary with respect to the type of the query object (stationary or moving point) as well as the type of the query result (continuous or not). We also propose novel metrics to support our search ordering and pruning strategies. Using the implementation of the proposed algorithms on a member of the R-tree family for trajectory data (the TB-tree), we demonstrate their scalability and efficiency through an extensive experimental study using synthetic and real datasets.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Scalable distributed subtrajectory clustering",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9005563/",
            "Abstract": "Trajectory clustering is an important operation of knowledge discovery from mobility data. Especially nowadays, the need for performing advanced analytic operations over massively produced data, such as mobility traces, in efficient and scalable ways is imperative. However, discovering clusters of complete trajectories can overlook significant patterns that exist only for a small portion of their lifespan. In this paper, we address the problem of Distributed Subtrajectory Clustering in an efficient and highly scalable way. The problem is challenging because the subtrajectories to be clustered are not known in advance, but they need to be discovered dynamically based on adjacent subtrajectories in space and time. Towards this objective, we split the original problem to three sub-problems, namely Subtrajectory Join, Trajectory Segmentation and Clustering and Outlier Detection, and deal with each one in a distributed …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:J2Md-p1DcKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Online event recognition from moving vessel trajectories",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10707-016-0266-x.pdf",
            "Abstract": "We present a system for online monitoring of maritime activity over streaming positions from numerous vessels sailing at sea. The system employs an online tracking module for detecting important changes in the evolving trajectory of each vessel across time, and thus can incrementally retain concise, yet reliable summaries of its recent movement. In addition, thanks to its complex event recognition module, this system can also offer instant notification to marine authorities regarding emergency situations, such as suspicious moves in protected zones, or package picking at open sea. Not only did our extensive tests validate the performance, efficiency, and robustness of the system against scalable volumes of real-world and synthetically enlarged datasets, but its deployment against online feeds from vessels has also confirmed its capabilities for effective, real-time maritime surveillance.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:rmuvC79q63oC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Literature review of spatio-temporal database models",
            "Publication year": 2004,
            "Publication url": "https://www.cambridge.org/core/journals/knowledge-engineering-review/article/literature-review-of-spatiotemporal-database-models/38175D21635346C9002C3C2DEDF9232D",
            "Abstract": "Recent efforts in spatial and temporal data models and database systems have attempted to achieve an appropriate kind of interaction between the two areas. This paper reviews the different types of spatio-temporal data models that have been proposed in the literature as well as new theories and concepts that have emerged. It provides an overview of previous achievements within the domain and critically evaluates the various approaches through the use of a case study and the construction of a comparison framework. This comparative review is followed by a comprehensive description of the new lines of research that emanate from the latest efforts inside the spatio-temporal research community.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Trajectory based traffic analysis",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2525314.2525322",
            "Abstract": "We present the INTRA system for interactive path-based traffic analysis. The analyses are developed in collaboration with traffic researchers and provide novel insights into conditions such as congestion, travel-time, choice of route, and traffic-flow. INTRA supports interactive point-and-click analysis, due to a novel and efficient indexing structure. With the web-site daisy. aau. dk/its/spqdemo/we will demonstrate several analyses, using a very large real-world data set consisting of 1.9 billion GPS records (1.5 million trajectories) recorded from more than 13 000 vehicles, and touching most of the road network in Denmark.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A pattern similarity scheme for medical image retrieval",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4487049/",
            "Abstract": "In this paper, we propose a novel scheme for efficient content-based medical image retrieval, formalized according to the PAtterns for Next generation DAtabase systems (PANDA) framework for pattern representation and management. The proposed scheme involves block-based low-level feature extraction from images followed by the clustering of the feature space to form higher-level, semantically meaningful patterns. The clustering of the feature space is realized by an expectation-maximization algorithm that uses an iterative approach to automatically determine the number of clusters. Then, the 2-component property of PANDA is exploited: the similarity between two clusters is estimated as a function of the similarity of both their structures and the measure components. Experiments were performed on a large set of reference radiographic images, using different kinds of features to encode the low-level image …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "UNIPI-ISL-TR-2006-01 November 2006",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.106.2321&rep=rep1&type=pdf",
            "Abstract": "The problem of trajectory similarity in moving object databases is a relatively new topic in the spatial and spatiotemporal database literature. Existing work focuses on the spatial notion of similarity ignoring the temporal dimension of trajectories and disregarding the presence of a general-purpose spatiotemporal index. In this work, we address the issue of spatiotemporal trajectory similarity search by defining a similarity metric, proposing an efficient approximation method to reduce its calculation cost, and developing novel metrics and heuristics to support k-most-similar-trajectory search in spatiotemporal databases exploiting on existing R-treelike structures that are already found there to support more traditional queries. Our experimental study, based on real and synthetic datasets, verifies that the proposed similarity metric efficiently retrieves spatiotemporally similar trajectories in cases where related work fails, while at the same time the proposed algorithm is shown to be efficient and highly scalable.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pattern management challenges",
            "Publication year": 2004,
            "Publication url": "http://kops.uni-konstanz.de/bitstream/handle/123456789/5480/panel.pdf?sequence=1",
            "Abstract": "The increasing opportunity of quickly collecting and cheaply storing large volumes of data, and the need for extracting concise information to be efficiently manipulated and intuitively analyzed, are posing new requirements for data management systems in both industrial and scientific applications. A usual approach to deal with such huge volume of data is to reduce the available data to knowledge artifacts (ie, clusters, rules, etc.), also called patterns, through data processing methods (pattern recognition, data mining, knowledge extraction) that reduce their number and size to make them manageable from humans while preserving as much as possible their hidden/interesting information. In order to efficiently and effectively deal with patterns, academic groups and industrial consortiums have devoted efforts towards the modeling, storage, retrieval, analysis and manipulation of patterns with results mainly in the area of standards, inductive databases and pattern-base management systems. Notably, two main lines of research have been pursued, by different research groups. The first line of research, focused around the notion of the Pattern-Base Management System (PBMS), has been pursued by the members of the European PANDA project [1]. In the PANDA approach, patterns are concise and rich in semantics representations of data. Patterns are differentiated from data: the former lie in the PBMS, where customized operations (eg, similarity checks) are to be applied, whereas the latter reside in traditional data stores. PANDA has come up with a generic model and languages for patterns [2, 3] as well as results for internal data representation in …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image and Multimedia indexing",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-8590-3_8",
            "Abstract": "Image Databases represent a direction of ongoing interest in database area. Satellite photos from earth or space observation projects (e.g., NASA’s Earth Observing System [EOS]), medical records, and many more applications include a large number of B/W or color images.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Pattern-based retrieval of cultural heritage images",
            "Publication year": 2007,
            "Publication url": "http://isl.cs.unipi.gr/pubs/confs/PCI2007.pdf",
            "Abstract": "Conventional Content-Based Image Retrieval (CBIR) systems make use of similarity measures estimated directly from low-level image features, involving multidimensional and exhaustive, nearest neighbor searching. In this paper we present an image retrieval methodology suited for efficient search in cultural heritage images that utilizes similarity measures defined over higher-level patterns associated with clusters of low-level image features. The similarity between two patterns is estimated as a function of the similarity between both the structure and the measure components of the patterns. We evaluate our system using cultural heritage images derived from the repository of the Foundation of Hellenic World (FHW). For the experiments we use Local Binary Pattern (LBP) and contrast distributions as image features and the results show that the proposed pattern-based approach efficiently retrieves images compared to commonly employed methods.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Index-based most similar trajectory search",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4221730/",
            "Abstract": "The problem of trajectory similarity in moving object databases is a relatively new topic in the spatial and spatiotemporal database literature. Existing work focuses on the spatial notion of similarity ignoring the temporal dimension of trajectories and disregarding the presence of a general-purpose spatiotemporal index. In this work, we address the issue of spatiotemporal trajectory similarity search by defining a similarity metric, proposing an efficient approximation method to reduce its calculation cost, and developing novel metrics and heuristics to support k-most-similar-trajectory search in spatiotemporal databases exploiting on existing R-tree-like structures that are already found there to support more traditional queries. Our experimental study, based on real and synthetic datasets, verifies that the proposed similarity metric efficiently retrieves spatiotemporally similar trajectories in cases where related work fails …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On-the-fly mobility event detection over aircraft trajectories",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3274895.3274970",
            "Abstract": "We present an application framework that consumes streaming positions from a large fleet of flying aircrafts monitored in real time over a wide geographical area. Tailored for aviation surveillance, this online processing scheme only retains locations conveying salient mobility events along each flight, and annotates them as stop, change of speed, heading or altitude, etc. Such evolving trajectory synopses must keep in pace with the incoming raw streams so as to get incrementally annotated with minimal loss in accuracy. We also develop one-pass heuristics to eliminate inherent noise and provide reliable trajectory representations. Our prototype implementation on top of Apache Flink and Kafka has been tested against various real and synthetic datasets offering concrete evidence of its timeliness, scalability, and compression efficiency, with tolerable concessions to the quality of resulting trajectory approximations.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:ZHR7-34Bl2wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MaSEC: Discovering Anchorages and Co-movement Patterns on Streaming Vessel Trajectories",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3469830.3470909",
            "Abstract": "The massive-scale data generation of positioning (tracking) messages, collected by various surveillance means, has posed new challenges in the field of mobility data analytics in terms of extracting valuable knowledge out of this data. One of these challenges is online cluster analysis, where the goal is to unveil hidden patterns of collective behaviour from streaming trajectories, such as co-movement and co-stationary (aka anchorage) patterns. Towards this direction, in this paper, we demonstrate MaSEC (Moving and Stationary Evolving Clusters), a system that discovers valuable behavioural patterns as above. In particular, our system provides a unified solution that discovers both moving and stationary evolving clusters on streaming vessel position data in an online mode. The functionality of our system is evaluated over two real-world datasets from the maritime domain.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:9xDRhSErrBIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pattern-miner: integrated management and mining over data mining models",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1401890.1402024",
            "Abstract": "This demo presents Pattern-Miner, an integrated environment for pattern management and mining that deals with the whole lifecycle of patterns, from their generation (using data mining techniques) to their storage and querying, putting also emphasis on the comparison between patterns and meta-mining operations over the extracted patterns. Pattern comparison (comparing results of the data mining process) and meta-mining are high level pattern operations that can be applied in a variety of applications, from database change management to image comparison and retrieval.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Path-based queries on trajectory data",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2666310.2666413",
            "Abstract": "In traffic research, management, and planning a number of path-based analyses are heavily used, eg, for computing turn-times, evaluating green waves, or studying traffic flow. These analyses require retrieving the trajectories that follow the full path being analyzed. Existing path queries cannot sufficiently support such path-based analyses because they retrieve all trajectories that touch any edge in the path. In this paper, we define and formalize the strict path query. This is a novel query type tailored to support path-based analysis, where trajectories must follow all edges in the path. To efficiently support strict path queries, we present a novel NET work-constrained TRAjectory index (NETTRA). This index enables very efficient retrieval of trajectories that follow a specific path, ie, strict path queries. NETTRA uses a new path encoding scheme that can determine if a trajectory follows a specific path by only retrieving …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:ruyezt5ZtCIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ARGO: A big data framework for online trajectory prediction",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3340964.3340988",
            "Abstract": "We present a big data framework for the prediction of streaming trajectory data, enriched from other data sources and exploiting mined patterns of trajectories, allowing accurate long-term predictions with low latency. To meet this goal, we follow a multi-step methodology. First, we efficiently compress surveillance data in an online fashion, by constructing trajectory synopses that are spatio-temporally linked with streaming and archival data from a variety of diverse and heterogeneous data sources. The enriched stream of trajectory synopses is stored in a distributed RDF store, supporting data exploration via SPARQL queries. The enriched stream of synopses along with the raw data is consumed by trajectory prediction algorithms that exploit mined patterns from the RDF store, namely medoids of (sub-) trajectory clusters, which prolong the horizon of useful predictions. The framework is extended with offline and …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:7gg4mBK4JdgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Oracle data cartridge for moving objects",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.101.9971",
            "Abstract": "Composition of time and space in a unified data framework results into spatio-temporal databases. Spatio-temporal Database Management Systems (STDBMS) are able to process, manage and analyze spatio-temporal data. Spatial TAU 1 (STAU), developed in [Pel02], provides spatio-temporal functionality to Oracle10g Object-Relational Database Management System (ORDBMS). Although STAU is designed in a way that it can also be used as a pure temporal or a pure spatial system, its main functionality is to support modeling and querying of moving objects. Such a collection of data types and their corresponding operations are defined, developed and provided as a data cartridge using the extensibility interface of Oracle10g. This paper presents HERMES Moving Data Cartridge (HERMES-MDC), the core component of STAU system architecture. HERMES-MDC integrates two other data cartridges, namely the TAU temporal data cartridge and Oracle’s spatial data cartridge. It introduces time-varying geometries that change their position and/or extent in space and time dimension, either discretely or continuously. HERMES-MDC extends PL/SQL, the data definition and manipulation language of Oracle10g, with spatio-temporal semantics. The resulted query language is applied to a case study related with truck motion analysis formulating a benchmarking framework for the evaluation of next generation fleet management systems.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms for processing k-closest-pair queries in spatial databases",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X03001393",
            "Abstract": "This paper addresses the problem of finding the K closest pairs between two spatial datasets (the so-called, K closest pairs query, K-CPQ), where each dataset is stored in an R-tree. There are two different techniques for solving this kind of distance-based query. The first technique is the incremental approach, which returns the output elements one-by-one in ascending order of distance. The second one is the non-incremental alternative, which returns the K elements of the result all together at the end of the algorithm. In this paper, based on distance functions between two MBRs in the multidimensional Euclidean space, we propose a pruning heuristic and two updating strategies for minimizing the pruning distance, and use them in the design of three non-incremental branch-and-bound algorithms for K-CPQ between spatial objects stored in two R-trees. Two of those approaches are recursive following a Depth-First …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:Se3iqnhoufwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Background on Spatial Data Management and Exploration",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4939-0392-4_2",
            "Abstract": "Before studying mobility data, we have to make a short tour at the (stationary) spatial domain. For decades, spatial information has been studied thoroughly; from Cartography and Geodesy to Geographical Information Systems (GIS) and Spatial Database Management Systems (SDBMS); this is justified due to its importance and ubiquity in our everyday lives. Database community has followed the paradigm of extended DBMS and provided inherent spatial functionality in geographical data collections by developing spatial data types, operators and methods for querying, as well as indexing techniques. At the exploration level, multi-dimensional online analytical processing (OLAP) and knowledge discovery in databases (KDD) have attracted excellent results at the spatial domain. In this chapter, we review spatial database management (modeling, indexing, query processing) and exploration aspects (data …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Maritime data integration and analysis: recent progress and research challenges",
            "Publication year": 2017,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/19854/",
            "Abstract": "The correlated exploitation of heterogeneous data sources offering very large historical as well as streaming data is important to increasing the accuracy of computations when analysing and predicting future states of moving entities. This is particularly critical in the maritime domain, where online tracking, early recognition of events, and real-time forecast of anticipated trajectories of vessels are crucial to safety and operations at sea. The objective of this paper is to review current research challenges and trends tied to the integration, management, analysis, and visualization of objects moving at sea as well as a few suggestions for a successful development of maritime forecasting and decision-support systems.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:s9piBQ-TX4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "R-Trees: A Dynamic Index Structure for Spatial Searching.",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=17088515831923773183&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Generating semantics-based trajectories of moving objects",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0198971502000236",
            "Abstract": "The domain of spatiotemporal applications is a treasure trove of new types of data as well as queries. For designing and testing novel data types and access methods that will support these applications, large spatiotemporal datasets are needed. As in many cases it is not possible to obtain real datasets, either they do not exist or they are not accessible, synthetic datasets are governed by artificial parameters rather than by the (sometimes invisible) rules governing real-world behavior. In this work, we show how, at least for some cases, one can generate spatiotemporal datasets that simulate real-world behavior. We illustrate example cases and translate them into appropriate calls of GSTD2 a spatiotemporal data generator. The generated data is illustrated using two-dimensional snapshot pictures as well as three-dimensional (two spatial plus one temporal dimension) trajectory images.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:roLk4NBRz8UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Spatial Access Methods",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-8590-3_6",
            "Abstract": "Spatial Databases cover a wide set of applications that handle spatial data, such as points, lines, and regions in multi-dimensional space. GISs are the most popular ones. GIS applications include cartography and network (such as road, telephone, or computer) mapping; apart from such applications, spatial data sets are of interest in the fields of Computer Aided Design (CAD), Robotics, Very Large Scale Integration (VLSI) Design, and Multimedia Systems. In this chapter, we briefly present the basic characteristics of a spatial database and then describe in detail the major efforts on efficiently manipulating spatial data using specialized indexing structures and access methods.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Tracing cluster transitions for different cluster types",
            "Publication year": 2007,
            "Publication url": "http://infolab.cs.unipi.gr/people/ntoutsi/papers/UNIPI-ISL-TR-2007-03.pdf",
            "Abstract": "Clustering algorithms detect groups of similar population members, like customers, news or genes. In many clustering applications the observed population evolves and changes, subject to internal and external factors. Detecting and understanding change is important for decision support. We extend our earlier framework MONIC for cluster transition modeling and detection, into MONIC+ for cluster-type specific transition monitoring. MONIC+ encompasses a typification of clusters and cluster-type-specific transition indicators, by exploiting cluster topology and cluster statistics for transition detection. 3",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:C-GuzCveMkwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed subtrajectory join on massive datasets",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3373642",
            "Abstract": "Joining trajectory datasets is a significant operation in mobility data analytics and the cornerstone of various methods that aim to extract knowledge out of them. In the era of Big Data, the production of mobility data has become massive and, consequently, performing such an operation in a centralized way is not feasible. In this article, we address the problem of Distributed Subtrajectory Join processing by utilizing the MapReduce programming model. Compared to traditional trajectory join queries, this problem is even more challenging since the goal is to retrieve all the “maximal” portions of trajectories that are “similar.” We propose three solutions: (i) a well-designed basic solution, coined DTJb; (ii) a solution that uses a preprocessing step that repartitions the data, labeled DTJr; and (iii) a solution that, additionally, employs an indexing scheme, named DTJi. In our experimental study, we utilize a 56GB dataset of real …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:tgXRM5oPLYQC",
            "Publisher": "ACM"
        },
        {
            "Title": "Comparing datasets using frequent itemsets: Dependency on the mining parameters",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_20",
            "Abstract": "Comparison between sets of frequent itemsets has been traditionally utilized for raw dataset comparison assuming that frequent itemsets inherit the information lying in the original raw datasets. In this work, we revisit this assumption and examine whether dissimilarity between sets of frequent itemsets could serve as a measure of dissimilarity between raw datasets. In particular, we investigate how the dissimilarity between two sets of frequent itemsets is affected by the minSupport threshold used for their generation and the adopted compactness level of the itemsets lattice, namely frequent itemsets, closed frequent itemsets or maximal frequent itemsets. Our analysis shows that utilizing frequent itemsets comparison for dataset comparison is not as straightforward as related work has argued, a result which is verified through an experimental study and opens issues for further research in the KDD field.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Trajectory data models",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75177-9_6",
            "Abstract": "Trajectory databases is an important research area that has received a lot of interest in the last decade. The objective of trajectory databases is to extend database technology to support the representation and querying of moving objects and their trajectory.",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On temporal-constrained sub-trajectory cluster analysis",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10618-017-0503-4",
            "Abstract": "Cluster analysis over Moving Object Databases (MODs) is a challenging research topic that has attracted the attention of the mobility data mining community. In this paper, we study the temporal-constrained sub-trajectory cluster analysis problem, where the aim is to discover clusters of sub-trajectories given an ad-hoc, user-specified temporal constraint within the dataset’s lifetime. The problem is challenging because: (a) the time window is not known in advance, instead it is specified at query time, and (b) the MOD is continuously updated with new trajectories. Existing solutions first filter the trajectory database according to the temporal constraint, and then apply a clustering algorithm from scratch on the filtered data. However, this approach is extremely inefficient, when considering explorative data analysis where multiple clustering tasks need to be performed over different temporal subsets of the database …",
            "Abstract entirety": 0,
            "Author pub id": "1f5twhoAAAAJ:bf7w-NijnqMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The Notion of Patterns in Data Mining∗",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.502.7455",
            "Abstract": "Several heterogeneous pattern types are available nowadays as a result of the different goals that a mining task tries to accomplish and of the application of Data Mining techniques over different domains. In this chapter we overview three popular pattern types, namely frequent itemsets and association rules, clusters and clusterings, and decision trees. We also adopt a pattern representation schema based on both extensional and intensional description of patterns and describe how the different pattern types are expressed with respect to this schema. 1",
            "Abstract entirety": 1,
            "Author pub id": "1f5twhoAAAAJ:9pM33mqn1YgC",
            "Publisher": "Unknown"
        }
    ]
}]