[{
    "name": "Ιωάννης Μουρτζόπουλος",
    "romanize name": "Ioannis Mourtzopoulos",
    "School-Department": "Ηλεκτρολόγων Μηχανικών & Τεχνολογίας Υπολογιστών",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 18243,
    "Scholar name": "John Mourjopoulos",
    "Scholar id": "CitiWhkAAAAJ",
    "Affiliation": "Professor of Electrical and Computer Engineering, University of Patras, Greece",
    "Citedby": 2979,
    "Interests": [
        "Audio",
        "Digital Signal Processing",
        "Acoustics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=CitiWhkAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Measuring resonator panels’ frequency absorption and Q factor, using Finite Elements Method",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=6263025774832682477&hl=en&oi=scholarr",
            "Abstract": "The analysis of the sound field generated by a Helmholtz resonators panel is described by a Finite Elements Method. The resonance frequency, absorption and Q factor of the panel was evaluated at different positions for a sound source and different geometries of the panel mainly over the frequency range from 20Hz to 100Hz. The results showed that as the source moves away from the panel, the absorbed frequency is getting lower (2-3Hz every 0.1 m) but the Q factor stays constant. The attenuation 5-7 meters from the panel can be up to 20dB for the central absorption frequency. Also it was observed that the absorption frequency can be lower by reducing the panel’s perforation density.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "About room response equalization and dereverberation",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=13438698143576551068&hl=en&oi=scholarr",
            "Abstract": "Improvement of sound reproduction in rooms by signal process-ing techniques has been studied seriously for more than twenty years. Such methods are called for example dereverberation, room (response) equalization, and room (response) correction. Understanding the limitations and quality criteria for such methods is gradually achieved through studies of this highly multidimensional problem. In the present paper we discuss the terminology and goals, compare some recent approaches of these techniques in prac-tical cases, and finally point out future challenges.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:p__nRnzSRKYC",
            "Publisher": "IEEE Service Center"
        },
        {
            "Title": "On the statistics of binaural room transfer functions",
            "Publication year": 2012,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?conv=132&papernum=8619",
            "Abstract": "The well-known property of the spectral standard deviation of Room Transfer Functions (RTFs), that is, its convergence to 5.57 dB, is extended to reverberant Binaural Room Transfer Functions (BRTFs). The BRTFs are related to the anechoic Head Related Transfer Functions (HRTFs) and the corresponding RTFs. Consequently, the statistical properties of the RTFs and HRTFs can be systematically related to the statistical properties of the BRTFs. In this work, the standard deviation of BRTFs measured in different types of rooms, for various source/receiver distances and azimuth angles is computed. The derived values are compared to the ones obtained from the single channel RTFs measured at the same positions. Their relationship to the 5.57 dB value is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:vRqMK49ujn8C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Analysis of Low Frequency Audio Reproduction via Multiple Low-Bl Loudspeakers",
            "Publication year": 2010,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=15308",
            "Abstract": "Small loudspeakers with low force factors (Bl) behave as narrow bandwidth filters with high quality factors and can be tuned at low resonance frequencies. It is possible to optimize low frequency reproduction (in the “sub-woofer” range) using a number of such drivers. This study employs a set of such low-Bl loudspeakers with different eigenfrequencies to achieve efficient reproduction of low frequency signals and examines aspects of such implementation comparing the results to an ideal sub-woofer system and also via perceptual evaluation of these systems.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Laser-sound: optoacoustic transduction from digital audio streams",
            "Publication year": 2021,
            "Publication url": "https://www.nature.com/articles/s41598-020-78990-z",
            "Abstract": "This work presents a novel laser-based optoacoustic transducer capable of reproducing controlled and continuous sound of arbitrary complexity in the air or on solid targets. Light-to-sound transduction is achieved via laser-induced breakdown, leading to the formation of plasma acoustic sources in any desired spatial location. The acoustic signal is encoded into pulse streams via a discrete-time audio modulation and is reproduced by fast consecutive excitation of the target medium with appropriately modulated laser pulses. This results in the signal being directly reconstructed at the desired location of the target medium without the need for a receiver or demodulation device. In this work, the principles and evaluation results of such a novel laser-sound prototype system are presented. The performance of the prototype is evaluated by systematic experimental measurements of audio test signals, from which the basic …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Auralisation of masked actor performances in the ancient Greek theatre of Epidaurus",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=7006499737667509469&hl=en&oi=scholarr",
            "Abstract": "Theatrical art evolved from ancient Greek drama plays performed in the open theatres, having acoustics supporting speech intelligibility over huge audiences. Possibly the archetypal of these theatres is the Epidaurus ancient theatre with impressive acoustics that can be easily verified today due to its good preservation state. However, it is also well documented that the actors during ancient theatrical Greek plays were always wearing theatrical masks. In a previous research work, such ancient Greek theatrical masks were constructed by a specialized artist and their acoustic response was measured via the use of a KEMAR manikin. In this work, more detailed auralisation results are provided to identify the sound character of the ancient theatrical plays resulting from the coupling of such masks and the theatre response. For these investigations, the source properties are described by the combination of the measured …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A thermoacoustic device for sound reproduction",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/47478485/A_thermoacoustic_device_for_sound_reprod20160724-18001-1o0r85b.pdf",
            "Abstract": "Thermoacoustic loudspeakers are devices converting A/C current electrical signals to thermal energy, causing a local fluctuation of air pressure which generates acoustic waves. This work discusses former research efforts in the field and examines such novel and alternative audio transduction technologies based on a recently developed prototype. This hybrid solid state device without moving parts is based on the thermoacoustic method of sound reproduction and preliminary response measurements of its performance are presented. The thermoacoustic transduction is viewed as a promising technology for future implementation of small size loudspeakers integrated on chip.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:9Nmd_mFXekcC",
            "Publisher": "[New York: Acoustical Society of America]"
        },
        {
            "Title": "Archaeoacoustic Research on Caves dedicated to Pan and the Nymphs in Attica, Greece",
            "Publication year": 2018,
            "Publication url": "https://www.euronoise2018.eu/docs/papers/360_Euronoise2018.pdf",
            "Abstract": "Visual senses overwhelm aural senses in Western culture and have dominated modern scientific thought [2]. However, in the past few decades there has been an increasing interest towards the acoustical and sensual properties of the material past. Especially within sensual archaeology, current research considers the aural perspectives of ancient sacred grottos and other rural sacred places, offering the potential to enrich interpretations of how ancient buildings or natural spaces were used, and proclaiming the importance of sound as one of the determinants in their identification as places of divine presence and worship [3, 4, 5, 6].(c) European Acoustics AssociationCaves are understood as complicated enclosed spaces composed of numerous surfaces, objects, and geometries, creating an acoustic space which behaves differently from open-air spaces [7]. Likewise, the underground sanctuaries dedicated to the Nymphs and Pan in ancient Greece should not only be perceived as landscapes with certain visual characteristics, but also as soundscapes with important auditory features [8]. As a result, an acoustic survey of these caves and an appropriate analysis of their aural characteristics, combined with archaeological and musical methods is necessary, in order to understand whether sound was a determining factor in the selection of caves as appropriate sacred sites to host the combined cult of Pan and the Nymphs in antiquity.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Acoustics of Ancient Theatres",
            "Publication year": 2011,
            "Publication url": "https://iris.unife.it/handle/11392/1539998",
            "Abstract": "The Conference on The Acoustics of ancient Theatres is the first on this topic and is jointly organized by the European Acoustics Association (E.A.A.) and the Hellenic Institute of Acoustics (HEL.IN.A.) with the assistance of the E.A.A. Technical Committee on Room and Building Acoustics and the Italian Acoustical Association (A.I.A.). The Conference aims to bring together experts to present and discuss all aspects and findings related to the acoustic properties of these unique ancient monuments which are largely located around the Mediterranean region and are often still used for public performances of theatrical plays, drama, speech and music. There is an ever growing interest for the renowned acoustic performance of such outdoor and roofed auditoria which since ancient times had a significant contribution to the evolution of the art of live performance, being also an important foundation for the science of acoustic communication engineering.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:kzcrU_BdoSEC",
            "Publisher": "European Acoustics Association and Hellenic Institute of Acoustics"
        },
        {
            "Title": "Errors in real-time room acoustics dereverberation",
            "Publication year": 2004,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=13017",
            "Abstract": "Significant measurable audible distortions are generated during real-time room acoustics dereverberation, which are far greater in magnitude than those expected from identical simulated (off-line) dereverberation experiments. Long inverse filters worsen this effect. Possible mechanisms for such discrepancy between simulated and real-time tests are examined. It is also shown that dereverberation based on complex smoothing is immune to such errors.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Acoustic radiation properties of ancient Greek theatre masks",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Eleftheria-Georganti/publication/228078453_Acoustic_radiation_properties_of_ancient_Greek_theatre_masks/links/0fcfd4fec8df84b00e000000/Acoustic-radiation-properties-of-ancient-Greek-theatre-masks.pdf",
            "Abstract": "Theatre masks were fundamental elements of the ancient Greek theatre tradition, having a dramatic impact on the artistic performance. Apart from the obvious change of the visual appearance of the actors, the masks also altered the acoustic characteristics of their voices. Therefore, both from the spectator’s and the actor’s point of view these masks significantly modified the acoustic events and inevitably transformed the overall theatrical experience. As the art of theatre evolved, the physical characteristics of the masks were transformed in terms of their size, mouth and ear openings and construction materials. Quite recently, masks replicating the original shape and structure of the ancient prototypes have been constructed based on the relevant literature and on archaeological findings. In this work, such a theatre mask is created in order to measure the corresponding acoustic characteristics. For this, the KEMAR manikin is used and the acoustic impulse responses are measured both from the listener’s and the speaker’s point of view. Based on semi-anechoic measurements the acoustic effect of the mask is presented for various azimuth angles and the spectral and timbral characteristics of the reconstructed mask are discussed. Two of the authors have already analysed the perceptual effect of the mask on the actors, while studying how they alter the overall artistic performance. In the present work, the above research results are discussed in relation to the obtained acoustic measurements, providing insights on the perceptual impact of the masks’ employment.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust speech recognition in reverberant environments based on complex-smoothed responses",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/John-Mourjopoulos/publication/238312998_Robust_speech_recognition_in_reverberant_environments_based_on_complex-smoothed_responses/links/00b7d5329cc9057371000000/Robust-speech-recognition-in-reverberant-environments-based-on-complex-smoothed-responses.pdf",
            "Abstract": "The problem addressed in this work concerns automatic speech recognition (ASR) in a reverberant room, using a distant microphone. It is well known that in such conditions, the system performance deteriorates gravely; however, in principle, the deterioration can be constrained with dereverberation techniques implemented prior to the ASR system. The method considered in this work is that of inverse filtering using complex-smoothed responses. Experiments were conducted via simulation, using real room measurements with variable reverberation time and for different room positions. The results indicate a small but consistent increase of the ASR rate in all test cases.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Audio system spatial image evaluation via binaural feature classification",
            "Publication year": 2017,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=18637",
            "Abstract": "A method for evaluating different audio systems with respect to their spatial reproduction accuracy is described based on binaural auditory feature classification. The classifier is trained to act as expert listener judging system spatial quality and achieves high accuracy for a reference ideal system under anechoic conditions. The trained classifier is then employed to assess different suboptimal reproduction setups and listening conditions. The spatial accuracy was assessed with respect to this reference with respect to the panned image, image localization accuracy and the sweet spot area spread. For 2 channel stereo reproduction, the study used loudspeakers of different directivity under anechoic or varying reverberant room conditions. The work also assesses the relative effects of upmixing stereo for 5 channel reproduction.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:_Ybze24A_UAC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Hierarchical perceptual mixing",
            "Publication year": 2009,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=14985",
            "Abstract": "A novel technique of perceptually-motivated signal dependent audio mixing is presented. The proposed Hierarchical Perceptual Mixing (HPM) method is implemented in the spectro-temporal domain; its principle is to combine only the perceptually relevant components of the audio signals, derived after the calculation of the minimum masking threshold which is introduced in the mixing stage. Objective measures are presented indicating that the resulted signals have enhanced dynamic range and lower crest factor with no unwanted artifacts, compared to the traditionally mixed signals. The overall headroom is improved, while clarity and tonal balance are preserved.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Function and acoustic properties of ancient Greek theatre masks",
            "Publication year": 2013,
            "Publication url": "https://www.ingentaconnect.com/content/dav/aaua/2013/00000099/00000001/art00012",
            "Abstract": "Masks were always used by the actors of the ancient Greek theatrical plays. Their theatrical function indicates an integral connection between the performers, the plot and the acoustics of the open-air ancient theatres which has not been explored in the past. Although the exact form, shape and material of such masks can be only deduced from limited archaeological finds, based on these and other sources, a number of typical mask templates were constructed covering most of the potential alternative forms. For these mask templates, the acoustic frequency response, the angle-dependent radiation and the actor's voice self-perception were tested via use of a KEMAR manikin and appropriate post processing. The novel results illustrate important acoustic and voice communication aspects of these masks.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:tS2w5q8j5-wC",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "A perceptual measure for assessing and removing reverberation from audio signals",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Joerg-Buchholz/publication/267692569_A_perceptual_measure_for_assessing_and_removing_reverberation_from_audio_signals/links/546285a70cf2837efdaffc13/A-perceptual-measure-for-assessing-and-removing-reverberation-from-audio-signals.pdf",
            "Abstract": "A novel signal-dependent approach is followed here for modeling perceived distortions due to reverberation in audio signals. The method describes perceived monaural time-frequency and level distortions due to reverberation which depend on the reproduced signal’s evolution. A Computational Auditory Masking Model (CAMM) is employed, using as inputs the reverberant and reference (anechoic) signal, generating time-frequency maps of perceived distortions. From these maps and in a number of sub-bands, suitable processing functions can be derived allowing suppression of reverberation in the processed signal.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comments on'analysis of traditional and reverberation-reducing methods of room equalization'",
            "Publication year": 2003,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=12186",
            "Abstract": "LETTERS TO THE EDITOR COMMENTS ON\" ANALYSIS OF TRADITIONAL AND REVERBERATION-REDUCING METHODS OF ROOM EQUALIZATION\"* I have read with interest the above paper1 and have found that the topics discussed provide useful insight into many aspects of digital room equalization. However, I have also found that the paper has overlooked previously published work in this area so that, in my opinion, some of the conclusions drawn are mainly relevant to the specific methodology adopted by the paper's author and thus are not generally applicable to the problem of reverberation-reducing methods. Aim of this letter is to amend this shortcoming, to explain that some of the findings in the paper were known for a very long time, and also to illustrate that appropriate solutions have been proposed which alleviate the problems discussed in the above paper. 1) A main conclusion derived in the …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:Zph67rFs4hoC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "The Effect of Geometry on the Acoustic Radiation of Plasma Filaments in Air",
            "Publication year": 2020,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03240360/",
            "Abstract": "Plasma filaments generated by femtosecond lasers in air via laser-induced breakdown (LIB) are short-lived plasma channels with cylindrical geometry. Plasma filaments in air can be considered as massless optoacoustic sound sources, since filamentation is followed by the emission of a sound pulse with acoustic energy within and beyond the audible range. In this work, the acoustic radiation of plasma filaments is studied using a simple model based on the classical cylindrical acoustic source. The impact of the filament?s geometry, particularly its length, on the radiation directivity is systematically evaluated. The limit in length for omnidirectional radiation within the audible range is identified and the acoustic frequency spectrum of the sound pulses is calculated and compared to that taken from broadband acoustic measurements. The possibility of studying such laser filament sound sources via scale models developed in acoustics simulation software is examined and compared to measured results.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:KUbvn5osdkgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal acoustic reverberation evaluation of Byzantine chanting in churches",
            "Publication year": 2014,
            "Publication url": "http://speech.di.uoa.gr/ICMC-SMC-2014/images/VOL_2/0941.pdf",
            "Abstract": "Byzantine chants constitute a form of monophonic vocal music characterized by lengthy phrases and by musical scales with intervals smaller than the western music semitones. Byzantine churches have extremely long Reverberation Time and their acoustics is dominated by the contributions of the diffuse sound field. Thus, the sound character of Byzantine chanting is closely linked to the acoustic reverberation. In this work we examine the perceived preference for the various features of reverberation imposed on excerpts of Byzantine psalms. This is achieved by simulations of typical churches with varying internal volume, reverberation time and source/receiver distance, utilizing chants from the DAMASKINOS corpus. The simulation (auralization) results were evaluated via statistical preference method using a group of 15 listeners. The results of such controlled experiments illustrate the listener preferences and acceptability of various parameters or combinations of parameters related to reverberation, eg of the Reverberation Time value in relation to church dimensions and listener position inside the church.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Limitations of All-Digital, Networked Wireless, Adaptive Audio Systems",
            "Publication year": 2007,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=13933",
            "Abstract": "Future digital audio delivery systems, especially for home-based multichannel applications, will greatly benefit from the evolution of all-digital wireless networked receivers integrating amplification, signal processing and direct digital emission. The paper will examine the limitations imposed by current technologies and methods in each of these contributing fields, ie: WLANs, amplification, signal processing for format adaptation and acoustics compensation and direct acoustic transduction of digital streams. It will be shown that current WLAN protocols lacking adequate quality guarantees cannot support the required high resolution multichannel audio traffic without appropriate post-processing for potential channel-induced error concealment. It will be also discussed why such systems may need to incorporate flexible bitstream conversion between PCM audio (the de-facto format after wireless reception), PWM (most …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:XiSMed-E-HIC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "The origins of building acoustics for theater and music performances",
            "Publication year": 2015,
            "Publication url": "https://asa.scitation.org/doi/abs/10.1121/1.4920853",
            "Abstract": "The ancient Greek amphitheaters and roofed odeia represent the earliest examples of acoustics utilized for enhancing theatrical and music performances over large public audiences, often up to 15,000 participants. Such an early achievement, more than 2000 years ago, was possibly crucial for the foundation of these performance-based art forms within the ancient Greek society and the eventual geographical spread of these buildings. Through the continuous evolution during the Roman era, via the Renaissance theaters and the modern concert halls, these specially constructed spaces allowed the performance-based art forms to be sustained and evolve as essential constituents of the western cultural heritage and civilization. We shall first consider some historical and architectural properties of these early performance spaces and then summarize their design principles and acoustic parameters. Acoustic …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Acoustical Society of America"
        },
        {
            "Title": "A distortion-free PWM coder for all-digital audio amplifiers",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=349011007350003339&hl=en&oi=scholarr",
            "Abstract": "Using analytic PCM-to-PWM mapping, combined with a novel method for eliminating PWM-induced distortions (“Jithering”), a distortion-free, all-digital and high-quality PWM coder was developed. High efficiency and performance is achieved at switching frequencies between 44.1-176.4 kHz. A Field Programmable Gate Array-based environment was used for the implementation of the PWM converter, which is suitable for any digital audio applications.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:GnPB-g6toBAC",
            "Publisher": "Audio Engineering Society; 1999"
        },
        {
            "Title": "Speech dereverberation based on a recorded handclap",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6004895/",
            "Abstract": "A semi-blind framework for the suppression of late speech reverberation is presented. The method is based on spectral subtraction and utilizes a simple recorded handclap to estimate the Power Spectral Density (PSD) of late reverberation. A statistical analysis of measured Room Impulse Responses (RIRs) and recorded handclaps demonstrates the sufficiency of the above estimation. Dereverberation results show that the proposed technique achieves significant reverberation suppression at multiple speaker positions in each room without compromising the quality of the estimated signals.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distortion-free 1-bit PWM coding for digital audio signals",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2007/94386.pdf",
            "Abstract": "Although uniformly sampled pulse width modulation (UPWM) represents a very efficient digital audio coding scheme for digital-to-analog conversion and full-digital amplification, it suffers from strong harmonic distortions, as opposed to benign non-harmonic artifacts present in analog PWM (naturally sampled PWM, NPWM). Complete elimination of these distortions usually requires excessive oversampling of the source PCM audio signal, which results to impractical realizations of digital PWM systems. In this paper, a description of digital PWM distortion generation mechanism is given and a novel principle for their minimization is proposed, based on a process having some similarity to the dithering principle employed in multibit signal quantization. This conditioning signal is termed\" jither\" and it can be applied either in the PCM amplitude or the PWM time domain. It is shown that the proposed method achieves …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Subjective assessments of real-time room dereverberation and loudspeaker equalization",
            "Publication year": 2005,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=13177",
            "Abstract": "Formal subjective tests of real-time room dereverberation using Complex Smoothing were conducted to assess the robustness and the validity of the method under real sound reproduction conditions. For comparison, anechoic, inverse loudspeaker real-time filtering was also subjected to assessment to decouple improvements due to the complex smoothing inverse room filtering and due to mere equalization of the loudspeakers. Results derived from a multivariate analysis of variance (MANOVA) of the test data, verify the conclusions detected in the past by the objective evaluation of the method eg significant improvement in sound quality and immunity to real-time processing artifacts independently of room size and listener position.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "A Transient-aware frequency domain audio processor",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371456.2371470",
            "Abstract": "In this paper, the implementation of a transient-aware, discrete-time audio processor is presented. The processing takes place in the Short Time Fourier Transform (STFT) domain, using a variant of the well known overlap-add technique. The proposed method identifies the presence of transients in the input signal and constantly adapts the analysis-synthesis frame size. Hence, the proposed technique ensures optimal time or frequency resolution, depending on the intrinsic characteristics of each processing frame.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Wiener filter approach to microphone leakage reduction in close-microphone applications",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5989847/",
            "Abstract": "Microphone leakage is one of the most prevalent problems in audio applications involving multiple instruments and multiple microphones. Currently, sound engineers have limited solutions available to them. In this paper, the applicability of two widely used signal enhancement methods to this problem is discussed, namely blind source separation and noise suppression. By extending previous work, it is shown that the noise suppression framework is a valid choice and can effectively address the problem of microphone leakage. Here, an extended form of the single channel Wiener filter is used which takes into account the individual audio sources to derive a multichannel noise term. A novel power spectral density (PSD) estimation method is also proposed based on the identification of dominant frequency bins by examining the microphone and output signal PSDs. The performance of the method is examined for …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sound source distance estimation in rooms based on statistical properties of binaural signals",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6508870/",
            "Abstract": "A novel method for the estimation of the distance of a sound source from binaural speech signals is proposed. The method relies on several statistical features extracted from such signals and their binaural cues. Firstly, the standard deviation of the difference of the magnitude spectra of the left and right binaural signals is used as a feature for this method. In addition, an extended set of additional statistical features that can improve distance detection is extracted from an auditory front-end which models the peripheral processing of the human auditory system. The method incorporates the above features into two classification frameworks based on Gaussian mixture models and Support Vector Machines and the relative merits of those frameworks are evaluated. The proposed method achieves distance detection when tested in various acoustical environments and performs well in unknown environments. Its …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The acoustics of roofed ancient odeia: The case of Herodes Atticus Odeion",
            "Publication year": 2009,
            "Publication url": "https://www.ingentaconnect.com/content/dav/aaua/2009/00000095/00000002/art00009",
            "Abstract": "Ancient Greek / Roman odeia were semi-enclosed theaters that currently survive without their original roof sections. The work compares the acoustics of the well-preserved Herodes Odeion in its current open-air form to a detailed acoustic model reconstruction of its original roofed version and illustrates the significant differences in acoustics between the two spaces. It is shown that in their original state, the odeia had acoustics appropriate for music performances in contrast to their current open-air form that have acoustic properties appropriate for speech reproduction, similar to the larger open-air theaters of the time which were used specifically for ancient drama performances.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:-f6ydRqryjwC",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "Acoustic reconstruction of buildings in the ancient city of Olympia",
            "Publication year": 2004,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=12690",
            "Abstract": "Virtual acoustics can assist the aural exploration and the study of the acoustic properties of famous buildings of the antiquity. Here, examples of such reconstruction of ritual and public buildings of the ancient Greek city of Olympia are presented and findings of their acoustic behavior are introduced, especially with respect to the modes of speech communication and general functionality. Examples of these auralisations are presented and are made available in an electronic address.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:_xSYboBqXhAC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Experimentally validated modeling of the optical energy deposition in highly ionized ambient air by strong femtosecond laser pulses",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1140/epjd/s10053-021-00237-x",
            "Abstract": "The deposition of femtosecond laser optical energy in gases leads to the emission of secondary electromagnetic and acoustic radiation. These optoacoustic components have a complex nonlinear dependency on the laser beam characteristics, such as the pulse energy, duration, wavelength and the focusing conditions, as well as on the optical and elastic characteristics of the gaseous medium. The initial interaction times are governed by the high electronic excitation and ionization. These phenomena result in a self-modulation of the laser pulse, significantly affecting the optical energy deposition on the medium. Such complex nonlinear phenomena are very difficult to be studied via analytical equations. To address this, a multiphysics Particle-In-Cell model is applied for the evaluation of the optical energy deposition and plasma generation from tightly focused femtosecond pulses in ambient air. The computational …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Detection of\" Solo Intervals\" in Multiple Microphone Multiple Source Audio Applications",
            "Publication year": 2011,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=15795",
            "Abstract": "In this work a simple and effective method is proposed to detect time intervals where only a single source is active (solo intervals) for multiple microphone, multiple source settings commonly encountered in audio applications, such as live sound reinforcement. The proposed method is based on the short term energy ratios between all available microphone signals and a single threshold value is used to determine if and which source is solely active. The method is computationally efficient and results indicate that it is accurate and fairly robust with respect to reverberation time and amount of source interference.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "A computational auditory masking model based on signal-dependent compression. I. Model description and performance analysis",
            "Publication year": 2004,
            "Publication url": "https://www.ingentaconnect.com/content/dav/aaua/2004/00000090/00000005/art00009",
            "Abstract": "In the present study, a novel computational model is proposed, which can efficiently emulate many aspects of the monaural signal processing of the auditory system. The model employs the concept of Signal-Dependent Compression (SDC), according to which the auditory system is assumed to perform a compression of the input signal's dynamics, controlled by an operating-point signal, which is directly derived from the input signal itself. This model is characterized by a simple, analytically defined, and flexible general structure, which employs a small number of free parameters and allows for a computationally very efficient realization. The model seems to be useful in describing various aspects of psychoacoustical masking (simultaneous and forward masking) and shows significant physiological relevance (e.g., auditory adaptation, peripheral compression at critical frequency). Considering possible audio and …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:yB1At4FlUx8C",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "An audio quantizer based on time domain auditory masking model",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/John-Mourjopoulos/publication/228721202_An_audio_quantizer_based_on_time_domain_auditory_masking_model/links/0fcfd51484fcbc7a18000000/An-audio-quantizer-based-on-time-domain-auditory-masking-model.pdf",
            "Abstract": "A novel, non-uniform PCM audio quantizer is described, employing a time-domain Computational Auditory Masking Model (CAMM). The model utilizes the concept of Signal Dependent Compression to produce an internal representation of the input signal so that via the use of a decision device a time-varying threshold can be derived. Based on this model, the proposed quantizer evaluates masked/unmasked regions of the signal, so that by an iterative process, the desired variable bit allocation table can be generated to quantize audio samples. Preliminary results indicate good perceptual quality for an average rate of 6.7 bits/sample.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Power Out of Thin Air: The Harvesting of Acoustic Energy",
            "Publication year": 2017,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=18714",
            "Abstract": "Recent evolution in Acoustic Energy Harvesting (AEH) indicate that beyond its communication function, sound can be a potential energy resource for powering contemporary and future applications operating in the range nW-mW. Acoustic energy can be either ambient or produced via speech and music reproduction, portable and mobile devices, jet and automobile engines, means of transport, electroacoustic transducers etc. This work provides a short review of relevant studies in the art and focuses on AEH inside closed-box loudspeaker enclosures.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:uLbwQdceFCQC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Analysis of room transfer function and reverberant signal statistics",
            "Publication year": 2008,
            "Publication url": "http://webistem.com/acoustics2008/acoustics2008/cd1/data/articles/002168.pdf",
            "Abstract": "This work examines existing statistical time-frequency models and techniques for Room Transfer Function (RTF) analysis (ie Schroeder’s stochastic model and the standard deviation over frequency bands for the RTF magnitude). RTF fractional octave smoothing, as with 1/3 octave analysis, may lead to RTF simplifications that can be useful for audio applications, and this work examines the relationship of such operations with respect to the original RTF statistics. More specifically, the RTF statistics, derived after complex smoothing using 1/3 fractional octave analysis, are compared to the original statistics across frequency and across space inside typical rooms, by varying the source, the receiver position and the corresponding ratio of the direct and reverberant signal. In addition, this work examines the statistical quantities for speech and audio signals prior to their reproduction within rooms and when recorded in …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:hqOjcs7Dif8C",
            "Publisher": "[New York: Acoustical Society of America]"
        },
        {
            "Title": "Modeling the Aesthetics of Audio-Scene Reproduction",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-00386-9_16",
            "Abstract": "Reviewing work from diverse scientific fields, this chapter approaches the human aesthetic response to reproduced audio as a process of attraction and efficient (“fluent”) processing for certain auditory stimuli that can be associated with listener pleasure (valence) and attention (arousal), provided that they conform to specific semantic and contextual principles, either derived from perceived signal features or from top-down cognitive processes. Recent techniques for room-related loudspeaker-based presentation of auditory scenes, especially via multichannel reproduction, further extend the options for manipulating the source signals to allow the rendering of virtual sources beyond the frontal azimuth angles and to enhance the listener envelopment. Hence, such methods increase arousal and valence and contribute additional factors to the listeners’ aesthetic experience for reproduced natural or virtual scenes. This …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:EYYDruWGBe4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Acoustic Energy Harvesting Inside Loudspeaker Enclosures",
            "Publication year": 2018,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=19703",
            "Abstract": "This study employs physical modeling prototypes for investigating acoustic energy harvesting inside closed-box loudspeaker enclosures via a biomimetic mechanism and a piezoelectric transducer. Test results indicate that the proposed device can generate up to 0.34 mW (0.64 µW/cm2) for Lp= 129 dB and 6.58 mW (256 µW/cm2) for Lp= 159 dB inside a large and a small enclosure respectively (for driving power of 1 W) having also an effect similar to that of absorption material.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Joint noise and reverberation suppression for speech applications",
            "Publication year": 2011,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=15898",
            "Abstract": "An algorithm for joint suppression of noise and reverberation from speech signals is presented. The method requires a handclap recording that precedes speech activity. A running kurtosis technique is applied in order to extract an estimation of the late reflections of the room impulse response from the clap while a moving average filter is employed for the noise estimation. Moreover, the excitation signal derived from the Linear Prediction (LP) analysis of the noisy speech along with the estimated power spectrum of the late reflections are used to suppress late reverberation through spectral subtraction while a Wiener filter compensates for the ambient noise. A gain magnitude regularization step is also implemented to reduce overestimation errors. Objective and subjective results show that the proposed method achieves significant speech enhancement in all tested cases.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Speaker distance detection using a single microphone",
            "Publication year": 2011,
            "Publication url": "http://nemertes.library.upatras.gr/jspui/handle/10889/4843",
            "Abstract": "A method to detect the distance of a speaker from a single microphone in a room environment is proposed. Several features, related to statistical parameters of speech source excitation signals, are introduced and are shown to depend on the distance between source and receiver. Those features are used to train a pattern recognizer for distance detection. The method is tested using a database of speech recordings in four rooms with different acoustical properties. Performance is shown to be independent of the signal gain and level, but depends on the reverberation time and the characteristics of the room. Overall, the system performs well especially for close distances and for rooms with low reverberation time and it appears to be robust to small distance mismatches. Finally, a listening test is conducted in order to compare the results of the proposed method to the performance of human listeners.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A high-quality digital audio delivery bluetooth platform",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1706488/",
            "Abstract": "The recent growth of home networking applications has raised the requirement for cable-free audio streaming. In this work, the \"BlueDAT\" digital audio platform is presented, which employs the Bluetooth wireless technology for real-time, CD-like quality, stereo reproduction. It is shown that, despite the strict throughput limitations imposed by the Bluetooth protocol, the BlueDAT application setup can efficiently accommodate cable-free, high-quality audio streaming and playback over one or two receivers for home environments, through the employment of a set of novel mechanisms for the automatic adaptation of both the transmission rate and the audio coding bitrate",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Study of Wireless Compressed Digital-Audio Transmission",
            "Publication year": 2002,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=11358",
            "Abstract": "The paper examines the transmission of audio coded according to the MPEG-I Layer III standard over the Bluetooth Wireless Digital protocol. The study presents the effect of the transmission parameters (such as distance, packet type and length) on the achieved wireless bit rate. The paper also analyzes several aspects concerning the real-time implementation of complete Bluetooth-based audio playback setups and addresses the effects of using single-channel, stereo or multichannel audio streams.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:r0BpntZqJG4C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "A Wireless PDA-based Acoustics Measurement Platform",
            "Publication year": 2007,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?conv=122&papernum=7148",
            "Abstract": "The proposed platform allows acoustic measurements via a flexible, portable system, based on commercially available hardware, such as a personal digital assistant (PDA) equipped with a wireless adapter and a digital audio capture card, together with a standard personal computer (PC) with wireless network access. Using this hardware, three software applications were implemented:(i) a device driver that handles the communication of the digital audio capture card with the PDA,(ii) a PDA application that realizes the WiFi connection with the personal computer, also incorporating a data recording function and suitable presentation of their analysis, and (iii) the personal computer application that initiates the playback sequence as dictated by the connected PDA. The system can assist the fast measurement of large spaces as is illustrated by Room Response measurements.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:geHnlv5EZngC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Room masking: Understanding and modelling the masking of reflections in rooms",
            "Publication year": 2001,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=9931",
            "Abstract": "For human listeners, many of the reflections generated inside rooms are masked by the direct signal and other re-flections. To describe such masking, a multidimensional function is introduced, which determines the Reflection Masking Threshold (RMT). Based on this function, a perceptual model is developed, which can evaluate the audibility of reflections, as it is described in examples derived from simulated rooms",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:P5F9QuxV20EC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "The acoustics of the Ancient theatres",
            "Publication year": 2013,
            "Publication url": "https://www.ingentaconnect.com/content/dav/aaua/2013/00000099/00000001/art00002",
            "Abstract": "Ancient theatres were prominent public buildings of the Greek-Roman era. Although mostly located around the Mediterranean, such theatres were built in every major city of the ancient world in Europe, Middle East, North Africa and beyond, spreading from Alexandria on Oxus (now Ai Khanum) in Afghanistan to Lisbon along the east-west axis, and from the Roman sites in northern England to Ptolemais in southern Egypt, along the north-south axis. To date, 741 ancient theatre structures have been identified and documented, 194 being earlier Greek theatres, 425 theatres and 46 odeia being from the Roman period and another 76 recorded theatres not accurately categorised. The evolution of these theatres starts from 6th century BC and the transition from the Hellenistic to the Roman period is placed around the mid-1st century BC. These ancient theatres stand as the earliest testament to the close relationship …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:5ugPr518TE4C",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "Measuring perception of coloration due to early reflections in binaural room impulse responses",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=12950176471660816711&hl=en&oi=scholarr",
            "Abstract": "Summary In [Meynial and Vuichard, 1999], coloration was examined using the statistical measure of the spectral standard deviation, and was found to be highly correlated with the perception of coloration by humans, using single-channel room impulse responses. In this study, this approach is extended to the binaural case. Binaural room impulse responses (BRIRs) measured in various enclosed spaces, for various source/receiver distances and orientation angles are used. Reverberant speech signals are used in a listening test where the test subjects are asked to evaluate the perceived coloration effect on the audio signals. The results of the listening test are discussed as a function of the source/receiver listener, orientation angle (azimuth plane) of the BRIR measurements. Based on the listening test results, a model for the minimum audible spectral standard deviation difference is proposed.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A study of acoustical-mechanical coupling for acoustic energy harvesting",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=193829127290979639&hl=en&oi=scholarr",
            "Abstract": "The principles of acoustical-mechanical coupling between piezoelectric transducers and sound fields are studied for acoustic energy harvesting. The inefficiency of direct coupling is highlighted and an indirect coupling method inspired by the structure and operation of the human middle-ear is introduced. Simulations indicate that the proposed method can potentially ensure sufficient acoustic energy harvesting for low-power applications.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:1yQoGdGgb4wC",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "Design and performance of a sigma–delta digital loudspeaker array prototype",
            "Publication year": 2009,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=14806",
            "Abstract": "Digital loudspeaker arrays (DLAs) are electroacoustic transducers reconstructing acoustic signals out of binary audio streams, usually consisting of a digital signal processing module driving multiple actuators (small loudspeakers). In this work a DLA prototype was implemented using an all-digital audio chain driven by 1-bit sigma–delta signals. The prototype implementation is described and its performance measured and evaluated using frequencydomain and THD analysis. These results also compare the DLA performance when driven by either sigma–delta or PCM input signals.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Blind single-channel suppression of late reverberation based on perceptual reverberation modeling",
            "Publication year": 2011,
            "Publication url": "https://asa.scitation.org/doi/abs/10.1121/1.3533690",
            "Abstract": "A blind method for suppressing late reverberation from speech and audio signals is presented. The proposed technique operates both on the spectral and on the sub-band domains employing a single input channel. At first, a preliminary rough clean signal estimation is required and for this, any standard technique may be applied; however here the estimate is obtained through spectral subtraction. Then, an auditory masking model is employed in sub-bands to extract the reverberation masking index (RMI) which identifies signal regions with perceived alterations due to late reverberation. Utilizing a selective signal processing technique only these regions are suppressed through sub-band temporal envelope filtering based on analytical expressions. Objective and subjective measures indicate that the proposed method achieves significant late reverberation suppression for both speech and music signals over a …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Acoustical Society of America"
        },
        {
            "Title": "The evolution of digital audio technology",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-27437-5_12",
            "Abstract": "Digital audio technology is allowing music and speech to be easily and readily accessible to most people, since these signals are treated as digital media and, hence, are significant components of the information-age revolution. From its commercial introduction via the audio Compact Disc, CD, approximately 20 years ago, this technology had a meteoric evolution which have seen the introduction of numerous methods, techniques, systems and formats and has allowed the users to benefit from reductions in the size of digital audio equipment and its cost. An overview of these developments is presented here with a critical assessment of their significance, along with a reference to many important publications and events. It is shown that this technology is mainly rooted on three constituent evolutionary components, namely, (a) digital electronics and computer technology, (b) DSP theory and techniques, (c …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Automatic speech recognition performance in different room acoustic environments with and without dereverberation preprocessing",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0885230812000526",
            "Abstract": "The performance of recent dereverberation methods for reverberant speech preprocessing prior to Automatic Speech Recognition (ASR) is compared for an extensive range of room and source-receiver configurations. It is shown that room acoustic parameters such as the clarity (C50) and the definition (D50) correlate well with the ASR results. When available, such room acoustic parameters can provide insight into reverberant speech ASR performance and potential improvement via dereverberation preprocessing. It is also shown that the application of a recent dereverberation method based on perceptual modelling can be used in the above context and achieve significant Phone Recognition (PR) improvement, especially under highly reverberant conditions.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Aural assessment by means of binaural algorithms− The AABBA project−",
            "Publication year": 2009,
            "Publication url": "http://proceedings.isaar.eu/index.php/isaarproc/article/view/2009-12",
            "Abstract": "AABBA is an intellectual grouping with the goal of collaborating for 4− 5 years on the application of computational models of human binaural hearing. The grouping will compile a battery of common software components for setting-up dedicated full-scale binaural models for various technological applications− particularly in areas related to communication acoustics. Examples are: quality assessment of audio channels and loudspeakers as well as rooms for acoustical performances, assessment of disorders of binaural hearing, assessment of speech-understanding capabilities in acoustically adverse surroundings, auditory-scene mapping, assessment of spatial properties of product sounds as well as of the sense of envelopment and immersion, analysis of human spatial hearing in a multimodal world with, for example, the listeners moving in space and/or receiving additional visual and/or tactile cues.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Alternative encoding techniques for digital loudspeaker arrays",
            "Publication year": 2007,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=14044",
            "Abstract": "Recent developments in Digital Loudspeakers have resulted in the introduction of Digital Transducer Arrays (DTA). In most implementations, DTA loudspeakers are driven by PCM encoded audio signals, usually resampled and requantised to an appropriate number of bits, in accordance to the number of the transducers constituting the DTA topology. However, given that DTAs generally increase harmonic distortion, especially for off-axis listening positions, optimization in signal encoding and bit-to-transducer assignment, is necessary. Here, a number of novel, alternative strategies are examined, concerning the input signal encoding via PCM-to-PWM conversion, as well as techniques for bit-assignment on the transducers of a DTA. These tests are supported by simulation results and comparisons between these alternative methods, for different operating parameters.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Small-sized subwoofer system implementation and measurement",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371456.2371473",
            "Abstract": "In this paper an implementation for a small-sized subwoofer system is proposed, utilizing three 4-inch drivers. The low frequency reproduction approach adopted here is based on narrow bandwidth loudspeaker design with high quality factors. The desired resonance frequency of each loudspeaker is obtained by increasing the cone mass, in order to minimize the volume of each enclosure.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A computational auditory masking model based on signal-dependent compression. II. Model simulations and analytical approximations",
            "Publication year": 2004,
            "Publication url": "https://www.ingentaconnect.com/content/dav/aaua/2004/00000090/00000005/art00010",
            "Abstract": "This paper presents the second part of an analytically-defined computational model, which can efficiently emulate many aspects of the",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:roLk4NBRz8UC",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "Low Filter Order Digital Equalization for Mobile Device Earphones",
            "Publication year": 2021,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?elib=21035",
            "Abstract": "This work examines the feasibility and acceptability of digitally correcting the response irregularities of typical earphones used for listening with cell phones and other mobile devices. A novel adaptive low filter order response equalization method is introduced since for these applications digital signal processing resources are limited; hence such filters are restricted in order. The method employs parallel infinite impulse response (IIR) filter sections with 5–9 pole pairs that match well a target frequency response known to be suitable for earphone listening. The tests with earphones of varying specifications and price indicate that these short filters can be effective for response equalization and that such processing improves listener preference.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:hMsQuOkrut0C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "CORRECTIONS-Correction to\" Comments on'Analysis of Traditional and Reverberation-Reducing Methods of Room Equalization\"",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=8947100587500589753&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:u9iWguZQMMsC",
            "Publisher": "New York, NY: The Society, 1986-"
        },
        {
            "Title": "Blind estimation and suppression of late reverberation utilising auditory masking",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4538723/",
            "Abstract": "A new method for blind estimation and suppression of late reverberation of speech signals is presented. The proposed algorithm consists of two steps. In a first step, the reverberation time is blindly determined from the reverberant signal. Then, an approximation of the power spectrum of late reverberation is subtracted from the power spectrum of the reverberant signal. Hence, a preliminary estimation of the anechoic speech spectrum is derived. In a second step, the auditory masking threshold of the clean spectrum estimation is calculated and used to define the coefficients for a nonlinear filter for the reverberant signal, which produces the final enhanced speech signal. The performance of the algorithm is demonstrated on artificially generated signals. Subjective tests are conducted and their results indicate that the quality of the speech signals obtained by the proposed method is superior when compared to previous …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dual-band PWM audio coding for ultrasound artefact reduction",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8081525/",
            "Abstract": "A novel approach to PWM coding is introduced based on generating two complementary PWM streams out of the in-band signal's spectrum. The 2 streams are then recombined in a suitable way, so that out-of-phase cancellation of the carrier frequency harmonics is achieved. The approach suppresses the strong out-of-band frequencies of the carrier signal without introducing distortion of the in-band coded signal. Such method can achieve superior reduction compared to the out-of-band artefact suppression induced by traditional analog low-pass filters employed in typical Class-D audio amplifiers or other switching power delivery systems, hence allowing designs with reduced filter requirements or even filterless implementations.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Statistical analysis of binaural room impulse responses",
            "Publication year": 2011,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=15890",
            "Abstract": "In previous work of the authors, the spectral magnitude of room transfer functions (RTFs) was analyzed using histograms and statistical quantities (moments), such as the kurtosis and skewness. In this work, the above analysis is extended to binaural room impulse responses (BRIRs) and the dependence of the statistical measures on the room acoustical properties, such as the reverberation time, the room size and the sourcereceiver distance is discussed. Emphasis is given on the binaural measure of the magnitude squared coherence (MSC) which is considered to be an important cue for binaural hearing related to perceptual aspects such as the source width, the envelopment and the spaciousness. After a brief overview of the existing MSC models, a perceptually-motivated MSC implementation is examined, based on a gammatone filterbank. MSC results for various rooms and source-receiver positions are …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:maZDTaKrznsC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "An Audio Quantizer Based on a Time Domain Auditory Masking Model",
            "Publication year": 2005,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=13094",
            "Abstract": "A novel, non-uniform PCM audio quantizer is described, employing a time-domain computational auditory masking model. The model utilizes the concept of Signal Dependent Compression to produce an internal representation of the input signal so that via the use of a decision device a time-domain masking threshold can be derived. Based on this model, for inputs the reference audio and its quantized versions, the proposed quantizer derives masked/unmasked regions of the signal, so that by using an iterative process, the desired variable bit allocation can be achieved on the audio samples. Results indicate high quality quantization for an average rate of 6.5 bits/sample, the quantizer having low-computational complexity and very low latency.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Perceptual Distortion Maps for Room Reverberation",
            "Publication year": 2007,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=14078",
            "Abstract": "From reverberated audio signals and using as reference the input (anechoic) audio, a number of distortion maps are extracted indicating how room reverberation distorts in time-frequency scales, perceived features in the received signal. These maps are simplified to describe the monaural time-frequency/level distortions and the distortion of the spatial cues (ie, inter-channel cues and coherence) which are very important for sound localization in a reverberant environment. Such maps here are studied as functions of room parameters (size, acoustics, distance, etc), as well as due to input signal properties. Overall perceptual distortion ratings are produced and reverberation-resilient signal features are extracted. These tests are also compared to results of subjective evaluation for the relevant features in the reverberant signals.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Blind single-channel dereverberation for music post-processing",
            "Publication year": 2011,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=15897",
            "Abstract": "Although dereverberation can be useful in many audio applications, such techniques often introduce artifacts that are unacceptable in audio engineering scenarios. Recently, the authors have proposed a novel dereverberation approach, suitable for both speech and music signals, based on perceptual reverberation modeling. Here, the method is fine-tuned for sound engineering applications and tested for both natural and artificial reverberation. The results show that the proposed technique efficiently suppresses reverberation without introducing significant processing artifacts and the method is appropriate for the post-processing of music recordings.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:BqipwSGYUEgC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "A paradigm for wireless digital audio home entertainment",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Floros/publication/228750408_A_Paradigm_for_Wireless_Digital_Audio_Home_Entertainment/links/0fcfd50ad085037e47000000/A-Paradigm-for-Wireless-Digital-Audio-Home-Entertainment.pdf",
            "Abstract": "Despite recent advances in wireless networking technology, real-time streaming of CD-quality digital audio remains a challenging topic. In this work, a set of applications following the server-client model was developed, facilitating the transmission and playback of PCM-coded audio over wireless links. The implementation is based on typical Personal Computer (PC) platforms interconnected with off-the-shelf wireless networking hardware. Performance evaluation tests are presented under different networking parameters and link conditions, leading to an optimal set of parameters for high-quality wireless digital audio delivery.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Room statistics and direct-to-reverberant ratio estimation from dual-channel signals",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6854496/",
            "Abstract": "A method for the estimation of the direct-to-reverberant-ratio (DRR) from dual-channel microphone recordings without having knowledge of the source signal is proposed. The method is based on previous findings for the statistics of the room transfer function spectral standard deviation and its relationship to the DRR. A novel relationship for the standard deviation of the difference of the magnitude spectra of dualchannel microphone recordings as a function of the DRR is derived. The proposed DRR estimation method is tested and evaluated on reverberant signals recorded in various rooms and at various source/receiver distances.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental and analytical evaluation of the acoustic radiation of femtosecond laser plasma filament sound sources in air",
            "Publication year": 2019,
            "Publication url": "https://asa.scitation.org/doi/abs/10.1121/1.5124509",
            "Abstract": "Plasma filaments in air induced by femtosecond laser pulses lead to the generation of strong shock waves. This letter presents a systematic study, both experimental and theoretical, of the acoustic radiation by femtosecond laser-generated filaments. A theoretical model is developed based on the experimental results and is used to evaluate the directivity of the filament's acoustic radiation within and beyond the audible frequency range. It is shown that the acoustic directivity of plasma filaments can be derived from the model of a weighted acoustic line source, consisting of elementary point sources with N-shaped excitation.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Acoustical Society of America"
        },
        {
            "Title": "Dual-Band PWM for filterless class-D audio amplification",
            "Publication year": 2018,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=19454",
            "Abstract": "The benefits of Dual-Band Pulse Width Modulation (DBPWM) are demonstrated for filter-less audio class-D amplifier implementations. DBPWM is evaluated in terms of energy efficiency (thermal loading) and reproduction fidelity for direct driving of loudspeaker units by DBPWM signals. Detailed physical models of low-frequency (woofer) and high-frequency (tweeter) loudspeakers are employed for simulation of the coupling between the DBPWM signal and the electro-mechanical and acoustic properties of loudspeaker systems in the broadband PWM spectral range. Derived frequency responses are used to estimate the reproduced sound signal of the loudspeaker. Equivalent impedance of the speaker's voice coil is used to estimate thermal loading by the DBPWM signal's out-of-band spectral energy, comparing standard filtered PWM implementations to the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Room masking: Understanding and modelling the masking of room reflections",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=14174718209217634107&hl=en&oi=scholarr",
            "Abstract": "For human listeners, many of the reflections generated inside rooms are masked by the direct signal and other reflections. To describe such masking, a multidimensional function is introduced, which determines the Reflection Masked Threshold (RMT). Based on this function, a perceptual model is developed, which can evaluate the audibility of reflections, as it is described in examples derived from simulated rooms.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Audio Engineering Society; 1999"
        },
        {
            "Title": "Reverberation and dereverberation effect on Byzantine chants",
            "Publication year": 2013,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?conv=135&papernum=8977",
            "Abstract": "Byzantine music is typically monophonic and is characterized by (i) prolonged music phrases and (ii) Byzantine scales that often contain intervals smaller than the Western semitone. As happens with most religious music genres, reverberation is a key element of Byzantine music. Byzantine churches/cathedrals are usually characterized by particularly diffuse fields and very long Reverberation Time (RT) values. In the first part of this work, the perceptual effect of long reverberation on Byzantine music excerpts is investigated. Then, a case where Byzantine music is recorded in non-ideal acoustic conditions is considered. In such scenarios, a sound engineer might require to add artificial reverb on the recordings. Here it is suggested that the step of adding extra reverberation can be preceded by a dereverberation processing to suppress the originally recorded non ideal reverberation. Therefore, in the second part of the …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Unmixing acoustic sources in real reverberant environments for close-microphone applications",
            "Publication year": 2010,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=15737",
            "Abstract": "The problem of acoustic source separation is addressed in an audio application context, especially when considering close-microphone applications and the effects of room acoustics. The framework of blind source separation (BSS) is used here to formally describe the problem, and solutions derived from this framework are examined for the case of separating two interfering acoustic sources in various realistic rooms and conditions. Specifically the performance of a benchmark convolutive BSS algorithm and a Wiener filter, considered in this context as a special case of BSS algorithm, is compared via objective measures as well as a subjective evaluation test to assess their performance. The Wiener filter was found to achieve superior performance and proved to be a simple, efficient method to separate two audio sources in such applications.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:4TOpqqG69KYC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "BlueBox: a cable-free digital jukebox for compressed-quality audio delivery",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1467998/",
            "Abstract": "The recent growth of home networking applications has raised the requirement for cable-free distribution of an increasing amount of media to portable playback devices, which lack the resources for local storage. In this work, the \"BlueBox\" wireless digital jukebox application is presented, which employs the Bluetooih wireless technology for distributing on demand, high-quality compressed audio, originally stored in a Bluetooth-enabled digital jukebox to remote portable client devices. It is shown that despite the strict throughput limitations imposed by the early-defined Bluetooth protocols, the BlueBox application setup can efficiently accommodate cable-free, high-quality audio distribution over an adequate number of receivers for home environments.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Distortion-free PWM Coder for All-digital Audio Amplifiers",
            "Publication year": 2001,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=9999",
            "Abstract": "Using analytic PCM-to-PWM mapping, combined with a novel method for eliminating PWM-induced distortions (“Jithering”), a distortion-free, all-digital and high-quality PWM coder was developed. High efficiency and performance is achieved at switching frequencies between 44.1-176.4 kHz. A Field Programmable Gate Array-based environment was used for the implementation of the PWM converter, which is suitable for any digital audio applications.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Exploiting phase coherence in the analysis of binaurally recorded signals",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=9206698034193180231&hl=en&oi=scholarr",
            "Abstract": "The phase function of the complex coherence for two close-spaced input signals is examined here. Initially, analytic expressions are derived for such signals as function of frequency and source angle, for the case of coherent, di use or mixed sound elds, such analysis leading to an expression incorporating a Coherent to Di use ratio for each scenario. The tests were then extended to binaurally recorded signals inside reverberant rooms indicating a robust detection of source angle and a good match to the proposed model prediction.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Perceptually-motivated selective suppression of late reverberation",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5201165/",
            "Abstract": "An improved spectral subtraction algorithm for suppressing late reverberation is presented. Existing spectral subtraction methods, process similarly all frames of the reverberant speech signal. This work introduces two criteria for the identification of the speech frames that do not contain significant late reverberation power. The subtraction is adequately relaxed in these frames in order to preserve the signal from unwanted distortions caused by overestimation errors. These novel relaxation criteria together with previous improvements on the conventional spectral subtraction algorithms (i.e. the introduction of a perceptually motivated non linear filtering technique) result in an improved estimation of the anechoic speech signal. Objective assessments in terms of Noise to Mask Ratio and Weighted Spectral Slope Distance are used to demonstrate the performance of the algorithm. The results indicate that the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling perceptual effects of reverberation on stereophonic sound reproduction in rooms",
            "Publication year": 2009,
            "Publication url": "https://asa.scitation.org/doi/abs/10.1121/1.3129382",
            "Abstract": "The proposed model derives time-frequency maps to estimate perceived alterations due to reverberation in stereo audio signals reproduced in rooms. These alterations relate to monaural masking due to reverberant decay, derived via a computational auditory masking model and to inter-channel cues for the formation of the spatial position of the aural objects, derived via an inter-channel cue mapping module. The maps illustrate in detail the varying nature of the perceptually-relevant alterations due to room reverberation. Quantitative metrics are also introduced which were found to be proportional to reverberation interference, to room-reverberation time and to depend on the specific audio signal. A statistical approach classifies room response properties via their histogram distributions. Corresponding distributions were also applied to the proposed signal-dependent perceptual maps. Such distributions were found …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:UebtZRa9Y70C",
            "Publisher": "Acoustical Society of America"
        },
        {
            "Title": "Analysis of the acoustical environment based on the signals' statistics",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371456.2371479",
            "Abstract": "In this study, the results of the ongoing work of the authors on the topic of the analysis of the acoustical environment from reverberant signals will be presented. Initially, some theoretical aspects on the relationships of the statistical quantities of the room transfer functions and the reverberant signals will be given. Then, the way that these statistical relationships can assist acoustical scene analysis methods will be discussed. The advantage of the use of two-channel (ie binaural) instead of single channel signals will be underlined. Finally, the implementation details of methods for the estimation of various acoustical parameters from signals will be presented.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measurements and analysis of the Epidaurus Ancient Theatre acoustics",
            "Publication year": 2013,
            "Publication url": "https://www.ingentaconnect.com/content/dav/aaua/2013/00000099/00000001/art00006",
            "Abstract": "Extensive results are presented for acoustic and meteorological measurements at the ancient open theatre of Epidaurus. The analysis of the results, illustrates most aspects of the theatre's acoustic properties, indicating the pattern and mechanism for the early reflections, the spectral response of the theatre, aspects of time-frequency response interaction and aspects of the spatial impression. The results also verify predictions of earlier acoustic models for this theatre and indicate no significant effects from environmental factors such as temperature, humidity and wind variations across the theatre. Measurements with the theatre partially full with audience show no change with respect to speech intelligibility. The results restate the renowned exceptional acoustic characteristics of the theatre for speech, for all listener positions.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "A study of ancient Greek and Roman theater acoustics",
            "Publication year": 2003,
            "Publication url": "https://www.ingentaconnect.com/content/dav/aaua/2003/00000089/00000001/art00015",
            "Abstract": "Ancient Greek and Roman open-air theaters had re-known acoustic properties, allowing speech communication for more than 10000 people. Here, acoustic properties for the most famous of these theaters, Epidauros, are analysed and compared to 2 other theaters (Dodoni and Patras' Odeion) via computer-aided prediction and auralisation. Novel, detailed and in-depth conclusions for these theaters acoustics properties are derived and presented, together with audio demonstrations.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:uc_IGeMz5qoC",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "Binaural extension and performance of single-channel spectral subtraction dereverberation algorithms",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5946837/",
            "Abstract": "Single-channel spectral subtraction algorithms are commonly used to suppress late reverberation. A binaural extension of such methods, apart from suppressing reverberation without introducing processing artifacts, should also preserve the signal's binaural localization cues. Here, three state-of-the-art spectral subtraction dereverberation algorithms are extended into a binaural context utilizing three alternative bilateral gain adaptation schemes and are compared to an extension derived from a Delay and Sum Beamformer. Objective results for several experimental conditions reveal the most prominent binaural extensions.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WLAN Technologies for Audio Delivery",
            "Publication year": 2007,
            "Publication url": "https://www.hindawi.com/journals/am/2007/012308/",
            "Abstract": "Audio delivery and reproduction for home or professional applications may greatly benefit from the adoption of digital wireless local area network (WLAN) technologies. The most challenging aspect of such integration relates the synchronized and robust real-time streaming of multiple audio channels to multipoint receivers, for example, wireless active speakers. Here, it is shown that current WLAN solutions are susceptible to transmission errors. A detailed study of the IEEE802.11e protocol (currently under ratification) is also presented and all relevant distortions are assessed via an analytical and experimental methodology. A novel synchronization scheme is also introduced, allowing optimized playback for multiple receivers. The perceptual audio performance is assessed for both stereo and 5-channel applications based on either PCM or compressed audio signals.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:TQgYirikUcIC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "On the correlation of light and sound radiation following laser-induced breakdown in air",
            "Publication year": 2020,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6463/ab9ee6/meta",
            "Abstract": "Laser-induced breakdown in ambient air by short optical pulses is accompanied by light and sound emission from the excited volume. In this work, these secondary radiative phenomena are jointly studied and their correlation is analyzed and demonstrated both experimentally and analytically. Simultaneous systematic measurements of the light and acoustic signals produced by nanosecond laser pulses of different energies are presented at sufficiently large time windows that allow for the observation of the complete phenomena. The contribution originating from the raised temperature (thermal radiation) in the excited volume is isolated out of the full optical signal and reconstructed via signal processing techniques. Through this analysis it becomes evident that the thermal radiation and the acoustic radiation take place at the same time scales. Moreover, the thermal radiation signal is used as a source in a …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:vbGhcppDl1QC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Performance analysis of digital loudspeaker arrays",
            "Publication year": 2008,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=14631",
            "Abstract": "Digital loudspeaker arrays currently are based on small moving-coil loudspeakers to reconstruct acoustic signals from binary audio streams. An overview of significant performance issues for such systems is given to explain frequency response and loudspeaker discrete transition rates achieved with digital data. Detailed simulations provide comparisons for a 32-loudspeaker DLA with similar arrangements of loudspeakers driven by analog signals. These tests produce novel results for electric power requirements and array sensitivity, concluding that these two systems achieve comparable performance.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "An Error–Concealment Technique for Wireless Digital Audio Delivery",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/49001643/pub_fpr.pdf",
            "Abstract": "Real-time digital audio streaming over unreliable wireless IP networks, such as WLANs, encounters playback quality degradation, due to late arrivals or permanent loss of the transmitted packets. In this paper we present a perceptually efficient error concealment technique, which, combined with playback synchronization correction schemes and a high-rate wireless transmission protocol with Qualityof-Service support, can significantly improve the overall audio playback quality of typical multichanel home-theater wireless applications.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital Loudspeaker Arrays driven by 1-bit signals",
            "Publication year": 2004,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=12676",
            "Abstract": "Loudspeaker Arrays driven by digital bitstreams are direct digital-signal to acoustic transducers, usually comprising of a digital signal processing module driving actuators. Current research efforts are focusing on topologies directly driven by multi-bit digital bitstreams. In this work, the above investigations are extended to the case of using 1-bit signals such as Sigma-Delta for driving such topologies, using time and frequency domain analysis. Simulation results will be presented for idealized actuators. Finally, an optimized architecture for such a loudspeaker will be proposed, based on this analysis.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Sound pressure analysis for closed-box loudspeaker enclosures",
            "Publication year": 2016,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=18140",
            "Abstract": "This study employs a physical modeling method to explore the pressure distribution within typical closed-box loudspeaker enclosures of different shape and inner volume. The simulation results are compared to measurements in such enclosures. The results indicate that sound pressure within such enclosures often exceeds levels of 130 dB. The pressure profile is usually constant at lower frequencies and displays some strong resonances at higher frequencies due to normal modes. Such levels traditionally challenge enclosure air-tightness, box rigidity, but they can also provide useful acoustic energy for harvesting.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "An evaluation tool for Wireless Digital Audio applications",
            "Publication year": 2005,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=13102",
            "Abstract": "Despite the recent advances in the wireless networking technology, wireless multichannel digital audio delivery is not yet efficiently realized, because of the additional implementation issues raised for managing possible distortions introduced. In this work, a novel, open-architecture, software platform for evaluating wireless digital audio distribution is presented. This tool facilitates the assessment of real-time playback distortions induced by variable packet reception delays and packet losses, typically encountered in WLAN transmissions. Moreover, this platform can be also employed for producing audio streams corresponding to the wirelessly delivered digital audio, in order to investigate the audibility of such distortions.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:KxtntwgDAa4C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "A Paradigm for Wireless Digital Audio Home Entertainment",
            "Publication year": 2006,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=13469",
            "Abstract": "Despite recent advances in wireless networking technology, real-time streaming of CD-quality digital audio remains a challenging topic. In this work, a set of applications following the server-client model was developed, facilitating the transmission and playback of PCM-coded audio over wireless links. The implementation is based on typical Personal Computer (PC) platforms interconnected with off-the-shelf wireless networking hardware. Performance evaluation tests are presented under different networking parameters and link conditions, leading to an optimal set of parameters for high-quality wireless digital audio delivery.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Acoustic design of the ancient theatre of Kourion, in Limassol, Cyprus",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=8023932502134601433&hl=en&oi=scholarr",
            "Abstract": "The theatre of Kourion, in Cyprus is well preserved today and still used for theatrical and music performances. The simulation aims to calculate the acoustic parameters and speech intelligibility which help to define the acoustic behavior of the theatre. In addition to this, an auralization of the theatre was created, giving an impression of how the music, or the speech, would sound if replayed in the Ancient Theatre of Kourion. Firstly, the model of the theatre was created in the AutoCAD software, after measuring the surfaces of the theatre as it stands today. A two dimensional plan of the theatre, indicating the theatre’s form in antiquity, was very helpful for the design of the part of the theatre that wasn’t reconstructed. Subsequently, the Ancient theatre was modeled using commercially available acoustic modeling software. The findings are presented in color maps of the audience area, but they are also given with numbers …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Suitability of game engines for virtual acoustic experiments",
            "Publication year": 2019,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=20382",
            "Abstract": "Game engines like Unity [1], are recently becoming widely used not only by the game industry but also in the creation of serious games and for animations by the movie industry. The enhanced audio spacialisation assets that have been developed for such platforms [2], may also provide a suitable development environment for interactive acoustic auralisation and hence may allow the evolution of controlled acoustic and perceptual experiments within such “virtual laboratory” spaces. Here, the above concept is investigated via some preliminary experiments assessing virtual source localisation achieved by using such a virtual platform within a stereo loudspeaker virtual set-up, when compared to the localisation achieved using an established auralisation method and a listener test. In all cases, the source localisation is compared to the ideal (intended–ground truth) image source positions and the estimated …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "The sound effect of ancient Greek theatrical masks",
            "Publication year": 2014,
            "Publication url": "https://speech.di.uoa.gr/ICMC-SMC-2014/images/VOL_2/1444.pdf",
            "Abstract": "All theatrical forms developed in ancient Greece were forms of masked drama. Apart from the obvious change of the visual appearance of the actors, the masks also altered the acoustic characteristics of their voices. Therefore, both from the listener’s and the actor’s points of view these masks significantly modified the acoustic events and inevitably transformed the overall theatrical experience. In this work, we employ recreations of such masks and through controlled experiments, via measurements and simulations, we evaluate their impact on the acoustics of the most typical and famous of the ancient theatres, this one of Epidaurus. Emphasis is given on unraveling the character of the combined acoustics of the voice of masked actor and the response of such a theatre which is famous for its perfect acoustics for speech and drama plays.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Suppression of late reverberation at multiple speaker positions utilizing a single impulse response measurement",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=18074724428427719724&hl=en&oi=scholarr",
            "Abstract": "A spectral subtraction method for dereverberation at multiple speaker positions utilizing a single Room Impulse Response (RIR) measurement is presented. A running kurtosis approach is applied in order to define the RIR early/late reflections boundary. Then, the power spectrum of the late reverberant part of the measured RIR along with the excitation signal derived from the Linear Prediction (LP) analysis of the reverberant source are used to estimate the late reverberant power spectrum. A gain magnitude regularization step is also employed to compensate for overestimation errors and reduce musical noise artifacts. Objective and subjective performance measures show that a significant enhancement of the reverberant signals is achieved in all examined cases.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An evaluation tool for wireless digital audio applications",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Floros/publication/228962715_An_evaluation_tool_for_wireless_digital_audio_applications/links/0fcfd50ad084d57797000000/An-evaluation-tool-for-wireless-digital-audio-applications.pdf",
            "Abstract": "Despite the recent advances in the wireless networking technology, wireless multichannel digital audio delivery is not yet efficiently realized, because of the additional implementation issues raised for managing possible distortions introduced. In this work, a novel, open-architecture, software platform for evaluating wireless digital audio distribution is presented. This tool facilitates the assessment of real-time playback distortions induced by variable packet reception delays and packet losses, typically encountered in WLAN transmissions. Moreover, this platform can be also employed for producing audio streams corresponding to the wirelessly delivered digital audio, in order to investigate the audibility of such distortions.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wave-based acoustic modeling of the Epidaurus theatre",
            "Publication year": 2018,
            "Publication url": "https://www.euronoise2018.eu/docs/papers/359_Euronoise2018.pdf",
            "Abstract": "The acoustics of the ancient theatre of Epidaurus have been evaluated in the past via measurements and models. However, the topic still remains open especially with respect to the contributions of the specific architectural elements to the theatre's excellent acoustic performance. Here, the study focuses on 3 novel aspects for a better understanding of the theater's acoustics:(a) introduces a wave-based acoustics simulation of the Epidaurus theatre based on a flexible but simplified 3D geometric model (b) matches temporal and spectral features of measured and modeled responses, The wave model considers direct, reflected, diffracted and mixed reflection-diffraction sound paths for calculating the theatre's acoustic Impulse Response (IR) in several listening positions, from the front rows of the lower tier to the last rows of the upper tier. For exact tuning of the model, such simulated IR discrete temporal features due to the calculated sound paths are examined through time-distance matching, allowing thus direct comparison to the theatre's measured IRs and further interpretation of the effects of each of the architectural features of the theatre. In order to precisely match the simulation to measurements, the acoustic behavior of reflecting and diffracting surfaces/edges is incorporated in the model through application of special filters, developed according to the spectral characteristics of the reflection and diffraction features of the measured IRs. From the study it is deduced that sound diffraction plays a major role in the theatre's acoustics, assisting signal reception especially at the distant positions.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Signal-dependent constraints for perceptually motivated suppression of late reverberation",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165168409004113",
            "Abstract": "The suppression of late reverberation by spectral subtraction tends to degrade disproportionally low-level signal regions and signal transients. This work proposes two novel relaxation criteria that can constrain such problems in a signal-dependent fashion. These criteria were found to improve the performance of state-of-the-art late reverberation suppression algorithms when used in conjunction with a perceptually motivated non linear filtering stage. Objective results indicate that the proposed method is robust over a wide range of practical reverberation scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Harvesting energy mostly from acoustic signals",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371456.2371480",
            "Abstract": "Nowadays, numerous daily life applications related to wireless networks, sensors, low power electronics, biomedical applications etc. demand small amount of electrical power for their operation. These applications are rapidly increasing and bringing to the fore the need for small scale electrical power generation. To this end, strong efforts are being made to exploit ambient and man made energy sources such as electromagnetic radiation including sun, infrared and RF radiation, thermal sources, mechanical stress and strain, vibrations, biochemistry etc.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Single-channel sound source distance estimation based on statistical and source-specific features",
            "Publication year": 2009,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?conv=126&papernum=7689",
            "Abstract": "In this paper we study the problem of estimating the distance of a sound source from a single microphone recording in a room environment. The room effect cannot be separated from the problem without making assumptions about the properties of the source signal. Therefore, it is necessary to develop methods of distance estimation separately for different types of source signals. In this paper, we focus on speech signals. The proposed solution is to compute a number of statistical and source specific features from the speech signal and to use pattern recognition techniques to develop a robust distance estimator for speech signals. Experiments with a database of real speech recordings showed that the proposed model is capable of estimating source distance with acceptable performance for applications such as ambient telephony.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:hMod-77fHWUC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "A Paradigm Shift for Modelling Sound Sensation",
            "Publication year": 2014,
            "Publication url": "https://speech.di.uoa.gr/ICMC-SMC-2014/images/VOL_2/0878.pdf",
            "Abstract": "How do we describe the exemplary acuity of humans to analyze and respond to sounds, particularly to music? Is our current knowledge sufficient to produce working computational models for such sensations? Has our perspective for the conceptual structure of such models changed and why is this important? This work attempts to provide brief answers to these questions, focusing on a recent comprehensive model of binaural listening which is directed towards engineering applications in audio and acoustics [1]. It is also discussed how such model can formally approach the concepts of quality and fidelity in sounds and how it may be employed to demystify experienced listener and audiophile perception. A brief discussion of the conceptual and philosophical implications of such a model is also given.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual acoustic reconstruction of ritual and public spaces of ancient Greece",
            "Publication year": 2001,
            "Publication url": "https://www.ingentaconnect.com/content/dav/aaua/2001/00000087/00000005/art00009",
            "Abstract": "Virtual acoustics can assist the aural exploration and the study of the acoustic properties of famous buildings of the antiquity. Here, examples of such reconstruction of ritual and public buildings of the ancient Greek world are presented and novel findings of their acoustic behaviour are introduced, especially with respect to the modes of speech communication and general functionality. Examples of these auralisations are made available in an electronic address.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:epqYDVWIO7EC",
            "Publisher": "S. Hirzel Verlag"
        },
        {
            "Title": "Measurements and analysis of the acoustics of the ancient theatre of Epidaurus",
            "Publication year": 2011,
            "Publication url": "http://www.ancientacoustics2011.upatras.gr/Files/Vassilantonopoulos%20et%20al._Epidauros%20Measurements.pdf",
            "Abstract": "Results are presented from recent acoustic measurements performed in the ancient open theater of Epidaurus. These measurements were obtained using modern techniques, allowing evaluation of numerous acoustic parameters for the theatre, such as: Clarity C-80, Definition D-50, RASTI, LEF, etc. These measurements and results are also compared to those obtained from a computer acoustic simulation of the theatre’s acoustics. The analysis of the results, illustrates many novel aspects of the theatre’s acoustic properties, such as the pattern and mechanism for the early reflections, the spectral response of the theatre, aspects of time-frequency response interaction and aspects of the spatial impression. The results restate the well-known exceptional acoustic quality of the theatre for speech, with speech intelligibility remaining nearly perfect at all listener positions.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Generalized fractional-octave smoothing of audio and acoustic responses",
            "Publication year": 2000,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=12070",
            "Abstract": "A methodology is introduced for smoothing the complex transfer function of measured responses using well-established or arbitrary fractional-octave profiles, based on a novel time-frequency mapping framework. A corresponding impulse response, also derived analytically, has reduced complexity but conforms to perceptual princples. The relationship between complex smoothing and traditional power spectral smoothing is also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:fEOibwPWpKIC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Binaural dereverberation",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-37762-4_14",
            "Abstract": "Room reverberation degrades the quality and intelligibility of speech and also reduces the performance of automatic speech-recognition systems. Hence, blind or semi-blind dereverberation methods have been developed, utilising single or multiple input channels. Dereverberation is also important for binaural applications in the context of digital hearing aids, binaural telephony and hands free devices. However, the development of binaural dereverberation solutions is not trivial. Apart from the challenging task of reducing reverberation without introducing audible artifacts, binaural dereverberation should also at least preserve the interaural arrival-time and amplitude differences of the signals at the two ears, as these represent relevant cues for sound-source localization. In this chapter, an overview of auditory perception and physical features of reverberation is given. Further, a literature review of …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Results for room acoustics equalisation based on smoothed responses",
            "Publication year": 2003,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=12514",
            "Abstract": "Digital equalisation of room acoustics based on inverse filtering of measured response functions, introduces a number of theoretical and practical challenges. To overcome such problems, inverse filtering based on modified measured responses is proposed, derived via their complex Transfer Function smoothing, so that the processed responses are more perceptually compliant, of lower order and less position-sensitive than the original functions. Aim of this study is to evaluate via objective and subjective tests conducted for different-sized rooms and real-time reproduction, the use of such smoothed room responses for the derivation of appropriate room equalisation filters, which can improve the perceived and measured quality of audio reproduction in any reverberant environment.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:35r97b3x0nAC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Perceptual distortion maps for room reverberation",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/John-Mourjopoulos/publication/266216094_Perceptual_Distortion_Maps_for_Room_Reverberation/links/5878ab0508ae8fce4932515f/Perceptual-Distortion-Maps-for-Room-Reverberation.pdf",
            "Abstract": "From reverberated audio signals and using as reference the input (anechoic) audio, a number of distortion maps are extracted indicating how room reverberation distorts in time-frequency scales, perceived features in the received signal. These maps are simplified to describe the monaural time-frequency/level distortions and the distortion of the spatial cues (ie, inter-channel cues and coherence) which are very important for sound localization in a reverberant environment. Such maps here are studied as functions of room parameters (size, acoustics, distance, etc), as well as due to input signal properties. Overall perceptual distortion ratings are produced and reverberationresilient signal features are extracted.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Efficient Data Reduction Method for Binaural Parameter Utilization",
            "Publication year": 2020,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03235948/",
            "Abstract": "A novel approach for efficiently and drastically reducing the dimensionality of the ILD and ITD binaural parameters is proposed. The goal of this method is to allow optimal utilization of such parameters in Neural Networks and other Machine Learning applications. For such applications, a compromise is required between training data size and information preservation. The complete set of subband binaural parameters is projected into characteristic two-dimensional profiles resulting to an easily scalable approach with extremely high data reduction ratio. The proposed method provides approximately 88% reduction in such binaural parameter data, while retaining the important cue components for accurate results. The method was tested for convergence performance of NNs trained using the proposed dimensionally-reduced vectors in comparison to traditional approaches based on unprocessed binaural cues. Results for estimating the DOA of signals in rooms, indicate a significant reduction in convergence time when the proposed method was utilized. The algorithm also presents linear time and space complexity, making it a prime candidate for use in real-time embedded systems employing binaural cues.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Speaker distance detection using a single microphone",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5682396/",
            "Abstract": "A method to detect the distance of a speaker from a single microphone in a room environment is proposed. Several features, related to statistical parameters of speech source excitation signals, are introduced and are shown to depend on the distance between source and receiver. Those features are used to train a pattern recognizer for distance detection. The method is tested using a database of speech recordings in four rooms with different acoustical properties. Performance is shown to be independent of the signal gain and level, but depends on the reverberation time and the characteristics of the room. Overall, the system performs well especially for close distances and for rooms with low reverberation time and it appears to be robust to small distance mismatches. Finally, a listening test is conducted in order to compare the results of the proposed method to the performance of human listeners.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless digital audio delivery analysis and evaluation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1661247/",
            "Abstract": "Real-time digital wireless playback of CD-quality audio in multipoint setups using quality of service enhancements is analyzed and evaluated in this work. A novel methodology is introduced for simulating wireless digital audio delivery as well as for theoretically deriving the playback distortions. This methodology allows the accurate wireless digital audio delivery and reproduction simulation and leads to significant results for both the wireless networking and audio playback performance, while it provides a framework for defining the optimal parameters for error-free wireless stereo audio reproduction",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Introducing the topic’aural assessment'with binaural algorithms",
            "Publication year": 2011,
            "Publication url": "https://research.aalto.fi/en/publications/introducing-the-topic-aural-assessment-with-binaural-algorithms",
            "Abstract": "Introducing the topic ’aural assessment' with binaural algorithms — Aalto University's \nresearch portal Skip to main navigation Skip to search Skip to main content Aalto \nUniversity's research portal Logo Accessibility statement English Suomi Home Profiles \nResearch output Datasets Projects Prizes Activities Press / Media Infrastructure Research \nUnits Impacts Search by expertise, name or affiliation Introducing the topic ’aural \nassessment' with binaural algorithms Armin Kohlrausch, Jens Blauert, Jonas Braasch, H.Steven \nColburn, James Culling, Torsten Dau, JU.V Hohmann, John Mourjopoulos, Ville Pulkki, \nAlexander Raake, Peter Soendergaard, Dorothea Kolossa Department of Signal \nProcessing and Acoustics Communication Acoustics: Spatial Sound and Psychoacoustics \nResearch output: Chapter in Book/Report/Conference proceeding › Conference contribution \n› Scientific Overview Original language English Title -…",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:g3aElNc5_aQC",
            "Publisher": "European Acoustical Association"
        },
        {
            "Title": "Cable-Free Audio Delivery for Home Theater Entertainment Systems",
            "Publication year": 2008,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=14524",
            "Abstract": "Real time, multichannel audio content delivery over the air is expected to significantly simplify the interconnection complexity required for setting up typical home theater applications. However, despite the technological advantages of wireless networking standards related to high transmission rates and Quality4of4Service support, a number of issues have to be additionally addressed, such as multiple loudspeaker synchronization and packet delay/losses containing compressed quality and multiplexed audio data. In this work, further developments in the area of wireless audio delivery are presented by considering in detail multichannel reproduction for wireless home theater applications. Using both subjective and objective performance evaluation criteria, it is shown that cable4free multichannel audio playback is feasible under specific networking and audio coding conditions.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:8AbLer7MMksC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "A perceptual measure for assessing and removing reverberation from audio signals",
            "Publication year": 2006,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=13506",
            "Abstract": "A novel signal-dependent approach is followed here for modeling perceived distortions due to reverberation in audio signals. The method describes perceived monaural time-frequency and level distortions due to reverberation which depend on the reproduced signal’s evolution. A Computational Auditory Masking Model (CAMM) is employed, using as inputs the reverberant and reference (anechoic) signal, generating time-frequency maps of perceived distortions. From these maps and in a number of sub-bands, suitable processing functions can be derived allowing suppression of reverberation in the processed signal.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Binaural Auditory Feature Classification for Stereo Image Evaluation in Listening Rooms",
            "Publication year": 2016,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?conv2=140&ebrief=269",
            "Abstract": "Two aspects of stereo imaging accuracy from audio system listening have been investigated:(i) panned phantom image localization accuracy at 5-degree and (ii) sweet spot spatial spread from the ideal anechoic reference. The simulated study used loudspeakers of different directivity under ideal anechoic or realistic varying reverberant room conditions and extracted binaural auditory features (ILDs, ITDs, and ICs) from the received audio signals. For evaluation, a Decision Tree classifier was used under a sparse data self-training achieving localization accuracy ranging from 92%(for ideal anechoic when training/test data were similar audio category), down to 55%(for high reverberation when training/test data were different music segments). Sweet spot accuracy was defined and evaluated as a spatial spread statistical distribution function.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:hkOj_22Ku90C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Stereo image localization maps for loudspeaker reproduction in rooms",
            "Publication year": 2018,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?conv=144&papernum=9922",
            "Abstract": "A novel approach is proposed for maps illustrating the accuracy of image source position reproduced by stereo systems in various scenarios of listening rooms/loudspeakers. Based on previous work by the authors, the maps unify results derived from an image localization classifier and the sweet spot area metric estimating the direction of arrival angles (DOA) of all potential image source positions reproduced by the system via a perceptual model. The statistical analysis of these maps indicates the skewness and kurtosis of the DOA classification error and hence the consistency and robustness of the image definition along the plane of listener positions. Results utilize such parameter mappings to objectively illustrate the robustness of this qualitative aspect of audio reproduction in rooms.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:tKAzc9rXhukC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Real-time room equalization based on complex smoothing: Robustness results",
            "Publication year": 2004,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=12683",
            "Abstract": "The aim of this study is to investigate the robustness of room acoustics real-time equalization using inverse filters derived from the Complex Smoothing of the Transfer Function using perceptual criteria. The robustness of the method is assessed by real-time tests which compare the performance of Complex Smoothing-based equalization (for different filter lengths) with the traditional, ideal inverse filtering, over a range of room locations, which differ to the ones where response measurements were taken. Objective measurements and audio examples will show that the Complex Smoothing-based equalization performance, is largely immune to position changes and does not introduce processing artifacts, problems affecting the traditional ideal inversion.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:8k81kl-MbHgC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Efficient filter-based model for resonator panel absorbers",
            "Publication year": 2014,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=17082",
            "Abstract": "A novel and computationally efficient method for evaluating the response of a perforated absorption panel with an arbitrary number of Helmholtz resonator elements is proposed. The method is based on a simplified, parametric filter-based model using 2nd-order parametric IIR digital filters that emulate both the linear filtering response of each resonator and the relative acoustic path delays and gains of responses. This allows for the evaluation of the time-and frequency-domain response of arbitrary-sized perforated panels in any specific receiver position under free-field and diffuse-field acoustic environments. Unlike existing analytical approaches, the proposed approach offers significant computational efficiency and allows flexible and fast practical evaluation of the effects of such panel absorbers.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:Mojj43d5GZwC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Reverberation analysis via response and signal statistics",
            "Publication year": 2010,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=15331",
            "Abstract": "This work examines statistical quantities (ie kurtosis, skewness) of room transfer functions and audio signals (anechoic, reverberant, speech, music). Measurements are taken under various reverberation conditions in different real enclosures ranging from small office to a large auditorium and for varying source-receiver positions. Here, the statistical properties of the room responses and signals are examined in the frequency domain. From these properties, the relationship between the spectral statistics of the room transfer function and the corresponding reverberant signal are derived.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:_kc_bZDykSQC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Perceptually motivated signal-dependent processing for sound reproduction in reverberant rooms",
            "Publication year": 2011,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=15924",
            "Abstract": "Room reverberation changes perception in a signal-dependent way. A reverberation masking index (RMI), which relates to room size and listening location, represents the way in which reverberation decay produces perceptual smearing and masking. These influences are time varying and signal dependent rather than a signal-independent description of room acoustics. Informal listening tests show a direct relationship between the RMI and subjective experience. The index also provides guidance for preprocessing the audio signal for a particular acoustic environment.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "The acoustics of Roman Odeion of Patras: comparing simulations and acoustic measurements",
            "Publication year": 2005,
            "Publication url": "http://webistem.com/acoustics2008/acoustics2008/cd1/data/fa2005-budapest/paper/857-0.pdf",
            "Abstract": "The acoustics of Patras’ Odeion, a well-preserved open-air ancient Roman theatre, have been investigated via computer model simulation and a novel set of acoustic measurements. These tests were aiming at verifying the accuracy of the modelling procedure, optimising its parameters, and investigating the various means for describing the 3-D sound field for acoustic analysis and auralization. The detailed computer simulation of the theatre and acoustic measurements were made for 5 identical listener/receiver positions, respectively. The measurements consisted of single-channel impulse responses, 8-channel microphone array responses and 2-channel binaural responses. From the analysis of the singlechannel response measurements and the simulation results, comparisons are drawn related to various acoustic parameters (RASTI, D-50, C-80, etc). The microphone array responses were processed to …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal Acoustic Reverberation Evaluation of Byzantine Chants in Churches",
            "Publication year": 2014,
            "Publication url": "https://speech.di.uoa.gr/sppages/spppdf/Kouroupetroglou%20et%20al%20-%20Optimal%20Acoustic%20Reverberation%20Evaluation%20of%20Byzantine%20Chants%20in%20Churches.pdf",
            "Abstract": "Η Βυζαντινή ψαλτική είναι τυπικά μονοφωνική φωνητική μουσική που χαρακτηρίζεται αφενός από μουσικές φράσεις μακράς διάρκειας και αφετέρου από κλίμακες, οι οποίες συχνά περιέχουν διαστήματα μικρότερα από το ημιτόνιο που εμφανίζεται στη δυτική μουσική. Οι Βυζαντινοί ναοί χαρακτηρίζονται συνήθως από ιδιαιτέρως διάχυτα πεδίο και εξαιρετικά μεγάλες τιμές του χρόνου αντήχησης. Έτσι, η ακουστική αντήχηση του ναού αποτελεί αδιάσπαστο στοιχείο του ακουστικού χαρακτήρα των Βυζαντινών ψαλμών. Σε αυτή την εργασία, διερευνάται η αντιληπτική προτίμηση των χαρακτηριστικών της αντήχησης σε Βυζαντινά ψαλτικά αποσπάσματα. Εξομοιώνονται καταστάσεις αντήχησης σε τυπικούς ναούς με διαφορετικό εσωτερικό όγκο, χρόνο αντήχησης και απόσταση πηγής (ψάλτη)/δέκτη (ακροατή), χρησιμοποιώντας τη συλλογή «Δαμασκηνός». Τα αποτελέσματα προέκυψαν από πειράματα 7ακρόασης με χρήση της στατιστικής μεθόδου αξιολόγησης της προτίμησης σε ομάδα από 15 ακροατές. Τα αποτελέσματα αναδεικνύουν την προτίμηση αποδοχής των ακροατών σε σχέση με την καταλληλότητα διαφόρων παραμέτρων ή και συνδυασμών παραμέτρων της αντήχησης, όπως π. χ. η τιμή του χρόνου αντήχησης σε σχέση με τις διαστάσεις ή και τη θέση ακρόασης μέσα στο ναό.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The application of complex-spectral smoothing in the analysis of room acoustics,”",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Hatziantoniou/publication/247763577_The_application_of_complex-spectral_smoothing_in_the_analysis_of_room_acoustics/links/53cfe7f40cf2f7e53cf83e2b/The-application-of-complex-spectral-smoothing-in-the-analysis-of-room-acoustics.pdf",
            "Abstract": "After fractional-octave smoothing of measured acoustic responses of various spaces, comparisons were undertaken with the original responses using well-established time and frequency domain criteria. It was found that after smoothing, the late reflection energy is largely suppressed, clarity is increased, spectral mean and deviation is lowered, especially at mid and high frequencies.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extracting sound-source-distance information from binaural signals",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-37762-4_7",
            "Abstract": "The problem of distance estimation by computational methods utilizing binaural information is discussed. Initially, a brief overview is given concerning findings related to the auditory distance perception. Then, several acoustical parameters that depend on the distance between the source and the receiver especially within reverberant rooms are presented. An overview of several existing distance estimation techniques using binaural signals is given and a recent distance estimation method is presented in more detail. This method relies on several statistical features extracted from binaural signals and incorporates all the above features into a classification framework based on Gaussian Mixture models.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:XiVPGOgt02cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Modeling and measuring a Moog voltage-controlled filter",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8282295/",
            "Abstract": "The analog voltage-controlled filter used in historical music synthesizers by Moog is modeled using a digital system, which is then compared in terms of audio measurements with the original analog filter. The analog model is mainly borrowed from D'Angelo's previous work. The digital implementation of the filter incorporates a recently proposed antialiasing method. This method enhances the clarity of output signals in the case of large-level input signals, which cause harmonic distortion. The combination of these two ideas leads to a novel digital model, which represents the state of the art in virtual analog musical filters. It is shown that without the antialiasing, the output signals in the nonlinear regime may be contaminated by undesirable spectral components, which are the consequence of aliasing, but that the antialiasing technique suppresses these components sufficiently. Comparison of measurements of the …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Statistical relationships of room transfer functions and signals",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Eleftheria-Georganti/publication/228078432_Statistical_relationships_of_Room_Transfer_Functions_and_Signals/links/0912f4fec8acb4fd50000000/Statistical-relationships-of-Room-Transfer-Functions-and-Signals.pdf",
            "Abstract": "The spectral magnitude of Room Transfer Functions (RTFs) and signals (anechoic and reverberant) is analysed using statistical quantities, such as the standard deviation and the kurtosis. These measures are examined for RTFs recorded at di erent distances between source and receiver and their dependency on distance is modeled using polynomial expressions. Using such models, novel relationships are derived that can describe the dependence of the statistical properties of the reverberant signal on the RTF statistical properties. The models are then evaluated for di erent types of audio signals, estimating these two statistical measures for the anechoic signal directly from the reverberant signal and the results show that there was only a very small error on the predictions that depends on the Reverberation Time (RT) of the room. The proposed methodology can provide a promising framework for the blind estimation of any statistical parameter of the source speech/audio spectrum using only the reverberant signals.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Statistical properties of the close-microphone responses",
            "Publication year": 2012,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?conv=132&papernum=8617",
            "Abstract": "The close-microphone technique is widely used in modern sound engineering practice. It is mainly used to minimize the effect of leakage and room acoustics on the received signal. In this work, the properties of the close-microphone response are investigated from a signal processing point of view, through the respective frequency domain statistical moments. Room impulse response measurements were made in various rooms and source-microphone distances and statistical moments were calculated over frequency and distance. It is shown that the statistical properties of the impulse responses remain relatively constant for short source-microphone distances and this in turn provides a consistent sound, which was validated through a subjective evaluation test.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Towards the all-digital audio/acoustic chain: challenges and solutions",
            "Publication year": 2003,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=12318",
            "Abstract": "The obvious advantages of digital audio technology have up to now being manifested mainly in media storage and processing sub-components, witch are parts of a more elaborate audio/acoustic analog reproduction chain. It is envisaged that the remaining components such as cables, amplifiers and transducers will soon be also implemented in digital form, potentially leading to networked, integrated and highly optimized solutions. The paper examines theoretical and implementation aspects related to each of the modules that could constitute such an all-digital audio/acoustic transducer, namely:(a) the digital wireless receiver, via the Bluetooth and IEEE 802.11 protocols,(b) audio decoding and format adaptation (c) DSP for acoustic compensation, based on measured results for smoothed response equalization,(d) digital amplification, and,(e) all-digital transduction.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "On the nature of digital audio PWM distortions",
            "Publication year": 2000,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=9215",
            "Abstract": "Using a novel mathematical methodology, based on the analytic time and spectral description of the instantaneously-sampled PCM signal and the Analytic PCM-to-PWM mapper, the exact nature of the PWM-induced distortions is derived and an exact description for the generated mapping error in both time and frequency domains is presented. The effect of the input PCM signal and the conversion parameters is also assessed for several cases of PCM to PWM conversion.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Testing and simulation of a thermoacoustic transducer prototype",
            "Publication year": 2009,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=14875",
            "Abstract": "Thermoacoustic transduction is the transformation of thermal energy fluctuations into sound. Devices fabricated by appropriate materials utilise such a mechanism in order to achieve acoustic wave generation by direct application of an electrical audio signal and without the use of any moving components. A thermoacoustic transducer causes local vibration of air molecules resulting in a proportional pressure change. The present work studies an implementation of this alternative audio transduction technique for a prototype developed on silicon wafer. Measurements of the performance of this hybrid solid state device are presented and compared to the theoretical principles of its operation which are evaluated via simulations.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:tOudhMTPpwUC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Perceptually-optimized error concealment for audio over WLANs",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/6612560/published_paper.pdf",
            "Abstract": "Digital audio delivery over Wireless Local Area Networks (WLANs) represents an attractive framework for realizing high quality, multichannel audio applications in home and small office enclosures, offering increased setup flexibility and cable-free, low cost audio system interconnections. However, real-time digital audio streaming over unreliable wireless IP networks, such as WLANs, may encounter significant playback quality degradation, due to the unpredictable and variable link quality that causes delayed audio delivery or even permanent loss of the transmitted packets. In this paper, we present a perceptually efficient error concealment technique which combined with playback synchronization correction schemes, and a high-rate wireless transmission protocol with Quality-of-Service (QoS) support that can significantly enhance the overall audio playback quality of typical multichannel home-theater wireless applications.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "About room response equalization and dereverberation",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1540200/",
            "Abstract": "Improvement of sound reproduction in rooms by signal processing techniques has been studied seriously for more than twenty years. Such methods are called for example dereverberation, room (response) equalization, and room (response) correction. Understanding the limitations and quality criteria for such methods is gradually achieved through studies of this highly multidimensional problem. In the present paper we discuss the terminology and goals, compare some recent approaches of these techniques in practical cases, and finally point out future challenges",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identification of a room impulse response using a close-microphone reference signal",
            "Publication year": 2010,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=15322",
            "Abstract": "The identification of room impulse responses is very important in many audio signal processing applications. Typical system identification methods require access to the original source signal which is seldom available in practice, while blind system identification methods require prior knowledge of the statistical properties of the source signal which for audio applications, are not available. In this work, a new system identification method is proposed using a close-microphone reference signal and it is shown that it accurately identifies real room impulse responses.",
            "Abstract entirety": 1,
            "Author pub id": "CitiWhkAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Addendum to'Generalized Fractional-Octave Smoothing of Audio and Acoustic Responses'",
            "Publication year": 2000,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=12042",
            "Abstract": "LETTERS THEEDITOR TO LETTERS TO THE EDITOR ADDENDUM TO\" GENERALIZED FRACTIONALOCTAVE SMOOTHING OF AUDIO AND ACOUSTIC RESPONSES''1 In relation to the above paper 2 it has been brought to our attention that some earlier work by DB Keele, 3 introducing the principle of log sampling, is relevant to our work. We recognized this omission and would like to take this opportunity to include Keele's publication in the reference section of our paper. PANAGIOTIS. HATZIArCro_otJ, AES Member D JOHN N. MOtJRJOPOULOS, ES Member A Audio Group Electrical Wire Communications Laboratory and Computer Engineering Department University of Patras Patras 26500, Greece and-add technique produces a marked improvement in the overall sound quality. In their preprint 6 Spleesters et al. reported the occurrence of more severe distortions for large time-scale expansion than for time …",
            "Abstract entirety": 0,
            "Author pub id": "CitiWhkAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Audio Engineering Society"
        }
    ]
}]