[{
    "name": "Ιωάννης Μαυρίδης",
    "romanize name": "Ioannis Mavridis",
    "School-Department": "Εφαρμοσμένης Πληροφορικής",
    "University": "uom",
    "Rank": "Καθηγητής",
    "Apella_id": 3176,
    "Scholar name": "Ioannis Mavridis",
    "Scholar id": "l2FvCz8AAAAJ",
    "Affiliation": "Professor, University of Macedonia, Thessaloniki, Greece",
    "Citedby": 1483,
    "Interests": [
        "Information Security"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=l2FvCz8AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Σύνθεση και μελέτη μη φυσικών δομών που αλληλεπιδρούν με το ριβοσωμικό RNA",
            "Publication year": 2014,
            "Publication url": "https://www.didaktorika.gr/eadd/handle/10442/42651",
            "Abstract": "The bacterial ribosome represents the biological target for a variety of known antibiotics, aminoglycosides being the most characteristic example. The pharmaceutical properties of aminoglycosides are due to their ability to bind strongly to the bacterial A-site. This binding interferes with the mechanism of protein synthesis and eventually results in cell death. Nevertheless, despite their former universitality their effectiveness has been greatly diminished by the increasing appearance of resistant bacterial strains. In this thesis, aiming to a new generation of antibiotics based on the aminoglycoside structures, we have designed and synthesized a series of novel, spiro-bicyclic analogues. Selecting amongst the most promising analogues we proceeded to further derivatization by means of proper substitution. The resulting second generation products presented improved antibacterial properties. Furthermore we envisioned and tested a new protocol for indentifying the binding sites of small molecules within the RNA target. Being able to apply such a procedure to molecules with pharmaceutical significance would lead to better clarification of their mechanism of action and easier synthetic protocols of improved analogues.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards new access control models for Cloud computing systems",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Verification of secure inter-operation properties in multi-domain RBAC systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6616323/",
            "Abstract": "The increased complexity of modern access control (AC) systems stems partly from the need to support diverse and multiple administrative domains. Systems engineering is a key technology to manage this complexity since it is capable of assuring that an operational system will adhere to the initial conceptual design and defined requirements. Specifically, the verification stage of an AC system should be based on techniques that have a sound and mathematical underpinning. Working on this assumption, model checking techniques are applied for the verification of predefined system properties, and thus, conducting a security analysis of a system. In this paper, we propose the utilization of automated and error-free model checking techniques for the verification of security properties in multi-domain AC systems. Therefore, we propose a formal definition in temporal logic of four AC system properties regarding secure …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Surveying privacy leaks through online social network",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600443/",
            "Abstract": "This paper presents a survey on social networks' privacy leaks and the potential hazards for users, especially teenagers. In particular, the profiles of two teenagers, one male and one female, with fake names were created. Using a suitable software tool, friend requests were sent massively. As a result, two networks of friends were created and access was granted to a significant amount of users' personal information. Both profiles received requests for friendship and personal chat by adults aged up to 53 years old. In general the survey leads to results that reveal several hazards for children and critical issues about privacy of social network users.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A methodology for the development and verification of access control systems in cloud computing",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-37437-1_8",
            "Abstract": "Cloud computing is an emergent technology that has generated significant interest in the marketplace and is forecasted for high growth. Moreover, Cloud computing has a great impact on different type of users from individual consumers and businesses to small and medium size (SMBs) and enterprise businesses. Although there are many benefits to adopting Cloud computing, there are significant barriers to adoption, viz. security and privacy. In this paper, we focus on carefully planning security aspects regarding access control of Cloud computing solutions before implementing them and, furthermore, on ensuring they satisfy particular organizational security requirements. Specifically, we propose a methodology for the development of access control systems. The methodology is capable of utilizing existing security requirements engineering approaches for the definition and evaluation of access control …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:ns9cj8rnVeAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Διαχείριση Συνθηματικών και Επιθέσεις",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/bitstream/11419/528/1/05_chapter_03.pdf",
            "Abstract": "Δημιουργία ασφαλών συνθηματικών για την αυθεντικοποίηση χρηστών σε περιβάλλον Windows. Διαμόρφωση κατάλληλων πολιτικών ασφάλειας (όπως για τον ορισμό συνθηματικών και αντιμετώπιση επιθέσεων, π. χ. με κλείδωμα λογαριασμού). Παρουσίαση διαφόρων τύπων επιθέσεων σε συνθηματικά (π. χ. dictionary attacks, brute force, rainbow tables κ. ά.) και εφαρμογή τεχνικών (rainbow tables κλπ) για την ανάκτηση συνθηματικών.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deploying Privacy Improved RBAC in Web Information Systems",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/content/66930",
            "Abstract": "Access control technology holds a central role in achieving trustworthy management of personally identifiable information in modern information systems. In this article, a privacy-sensitive model that extends Role-Based Access Control (RBAC) to provide privacy protection through fine-grained and just-in-time access control in Web information systems is proposed. Moreover, easy and effective mapping of corresponding components is recognized as an important factor for succeeding in matching security and privacy objectives. Such a process is proposed to be accomplished by capturing and modeling privacy requirements in the early stages of information system development. Therefore, a methodology for deploying the mechanisms of an access control system conforming to the proposed Privacy Improved Role-Based Access Control (PIRBAC) model is presented. To illustrate the application of the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:hC7cP41nSMkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A Hypermedia Virtual Environment for Education in Medicine",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=16838363434829534667&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ασφαλής Διασύνδεση",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1027",
            "Abstract": "Ζητήματα και μέθοδοι εξασφάλισης των βασικών ιδιοτήτων ασφάλειας πληροφοριών πάνω από ένα κοινό κανάλι επικοινωνίας. Θα καλυφθούν αναλυτικά περιοχές όπως ο εντοπισμός εισβολών και η πρόληψή τους στο πλαίσιο της ασφάλειας περιμέτρου (firewalls, intrusion detection & prevention), καθώς και η ασφάλεια ασύρματων δικτύων και δικτύων αισθητήρων κ. ά. Ενδεικτικά θα περιέχονται θέματα Authentication & Encryption, Intrusion Detection & Prevention Systems: Intrusions (IDS & IPS), Types of ID Systems, Case studies, Wireless Security, Sensors security κ. ά.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Έλεγχος Πρόσβασης σε Λειτουργικά Συστήματα",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/530",
            "Abstract": "Καθορισμός και διαχείριση δικαιωμάτων πρόσβασης σε περιβάλλον Windows & Linux. Συμπεριλαμβάνονται πραγματικά σενάρια ελέγχου πρόσβασης, όπως: Δημιουργία αντικειμένων (αρχείων και καταλόγων), Προσθήκη δικαιωμάτων για πρόσβαση σε αντικείμενα, Προκαθορισμός δικαιωμάτων, Διαχείριση Ομάδων χρηστών, Εκχώρηση δικαιωμάτων σε χρήστες και μέσω ομάδων χρηστών, Λειτουργία των δικαιωμάτων κ.ά.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Συλλογή μετρήσεων και σύνδεση τοπικών κοινοτήτων μέσω DIY ασύρματων δικτύων",
            "Publication year": 2018,
            "Publication url": "https://ir.lib.uth.gr/xmlui/bitstream/handle/11615/49304/18197.pdf?sequence=1",
            "Abstract": "Στην σύγχρονη εποχή τα αυτό-δημιουργούμενα ασύρματα κοινοτικά δίκτυα συνεχώς αυξάνονται, προσπερνώντας με αυτό τον τρόπο την ανάγκη ενός κεντρικού συντονιστή για την υλοποίηση του. Η δημιουργία και η ύπαρξη ενός κοινοτικού ασύρματου δικτιού, οπού οι χρήστες του θα την δυνατότητα αλληλεπίδρασης μεταξύ τους αποτελεί επιτακτική κοινωνική ανάγκη. Σε αυτή την διπλωματική εργασία μελετήσαμε τον τρόπο δημιουργίας και λειτουργίας ασύρματων κοινοτικών δικτυών με απτότερο σκοπό την ανάπτυξη μια αυτό-δημιουργούμενης δικτυακής εργαλειοθήκης. Αυτή η εργαλειοθήκη παρέχει την δυνατότητα σε πολίτες που δεν έχουν ειδικευμένη γνώση στην επιστήμη των ασύρματων δικτυών να δημιουργήσουν ένα για να καλύψουν τις ανάγκες της τοπικής τους κοινότητας. Η εργαλειοθήκη αυτή περιλαμβάνει διάφορες εφαρμογές ανοιχτού λογισμικού, αισθητήρες και υπηρεσίες και με σκοπό να βελτιώσει την καθημερινή αλληλεπίδραση των πολιτών μια κοινότητας.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The promotion of eating behaviour change through digital interventions",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/856454",
            "Abstract": "Diet-related chronic disease is a global health epidemic giving rise to a high incidence of morbidity and mortality. With the rise of the digital revolution, there has been increased interest in using digital technology for eating behavioural change as a mean of diet-related chronic disease prevention. However, evidence on digital dietary behaviour change is relatively scarce. To address this problem, this review considers the digital interventions currently being used in dietary behaviour change studies. A literature search was conducted in databases like PubMed, Cochrane Library, CINAHL, Medline, and PsycInfo. Among 119 articles screened, 15 were selected for the study as they met all the inclusion criteria according to the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) search strategy. Four primary digital intervention methods were noted: use of personal digital assistants, use of the internet as an educational tool, use of video games and use of mobile phone applications. The efficiency of all the interventions increased when coupled with tailored feedback and counselling. It was established that the scalable and sustainable properties of digital interventions have the potential to bring about adequate changes in the eating behaviour of individuals. Further research should concentrate on the appropriate personalisation of the interventions, according to the requirements of the individuals, and proper integration of behaviour change techniques to motivate long-term adherence. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:2KloaMYe4IUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Access control based on attribute certificates for medical intranet applications",
            "Publication year": 2001,
            "Publication url": "https://www.jmir.org/2001/1/e9/",
            "Abstract": "Clinical information systems frequently use intranet and Internet technologies. However these technologies have emphasized sharing and not security, despite the sensitive and private nature of much health information. Digital certificates (electronic documents which recognize an entity or its attributes) can be used to control access in clinical intranet applications.To outline the need for access control in distributed clinical database systems, to describe the use of digital certificates and security policies, and to propose the architecture for a system using digital certificates, cryptography and security policy to control access to clinical intranet applications.We have previously developed a security policy, DIMEDAC (Distributed Medical Database Access Control), which is compatible with emerging public key and privilege management infrastructure. In our implementation approach we propose the use of digital certificates, to be used in conjunction with DIMEDAC.Our proposed access control system consists of two phases: the ways users gain their security credentials; and how these credentials are used to access medical data. Three types of digital certificates are used: identity certificates for authentication; attribute certificates for authorization; and access-rule certificates for propagation of access control policy. Once a user is identified and authenticated, subsequent access decisions are based on a combination of identity and attribute certificates, with access-rule …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:d1gkVwhDpl0C",
            "Publisher": "JMIR Publications Inc., Toronto, Canada"
        },
        {
            "Title": "Building virtual reality environments for distance education on the web: A case study in medical education",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.107.634&rep=rep1&type=pdf",
            "Abstract": "The paper presents an investigation into the role of virtual reality and web technologies in the field of distance education. Within this frame, special emphasis is given on the building of web-based virtual learning environments so as to successfully fulfill their educational objectives. In particular, basic pedagogical methods are studied, focusing mainly on the efficient preparation, approach and presentation of learning content, and specific designing rules are presented considering the hypermedia, virtual and educational nature of this kind of applications. The paper also aims to highlight the educational benefits arising from the use of virtual reality technology in medicine and study the emerging area of web-based medical simulations. Finally, an innovative virtual reality environment for distance education in medicine is demonstrated. The proposed environment reproduces conditions of the real learning process and enhances learning through a real-time interactive simulator.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A use-based approach for enhancing UCON",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38004-4_6",
            "Abstract": "The security related characteristics of entities, the contextual information that describes them and the previous or concurrent usages exercised in the system are the criteria that the Usage CONtrol (UCON) family of models utilizes in the usage decision process. In this paper, a detailed classification of the aforementioned criteria along with a representative usage scenario for each category is presented, unveiling a number of UCON’s limitations. In turn, a Use-based Usage CONtrol (UseCON) model is proposed that provides, for the creation of a usage decision, enhanced handling of information regarding context and previous or current usages exercised in the system. The enhanced capabilities of the proposed approach are demonstrated and discussed with the use of detailed application examples.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Conceptualization of game based approaches for learning and training on cyber security",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3139367.3139415",
            "Abstract": "Utilizing game based approaches for learning and training on cyber security is a way to foster innovative methods and effectively train learners in highly-motivating settings. In this work, we investigate related works on such approaches. Our study reveals only a limited set of works focusing on diverse target groups and methodologies and a lack of conceptual analysis and design standards. To this end, we analyse the structure of cyber security learning and training approaches that utilize gamification and game based learning notions; we decompose these approaches into their respective elements; we define their relations; and we construct a concept map of pedagogical and technological elements of game based learning and training approaches on cyber security.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a risk management based approach for protecting internet conversations",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=WfIFiEs0HQ8C&oi=fnd&pg=PA201&dq=info:MXAwpLxhdSIJ:scholar.google.com&ots=6Ow26dOvza&sig=ZEYvBnLMdLOzGUmBrtKc5ysb0l8",
            "Abstract": "During recent years the number of online communication means between teenagers has been growing rapidly. However, the hazards that follow these new types of communication are growing as well. Predators use Internet conversations to attract minor users, usually resulting in catastrophic consequences. In this paper, a new risk management based approach is proposed, which aims to monitor internet-based conversations and identify possible attacks. In particular, a wide research on the area of children exploitation is first conducted, in order to identify the methods and the techniques that are used. Then, the implementation of a system capable of capturing and analyzing chat dialogs is proposed. The proposed system is under development and has not be implemented yet. It is based on three different sensors. The first one performs text analysis on captured traffic, as an attempt to look for known patterns that may indicate a possible attack. The Naive Bayes classifier method then follows, based upon the initial training set. In addition, this training set is enhanced and adopted to specific users' needs via the proposed “supervised learning technique”. The second sensor captures files or web links that are sent through the chat conversation, indicating possible personal information leak or exposing unwanted material to minors. The third sensor counts how many times the same users talk with a particular child. As a result, a total risk factor is calculated as a weighted sum of the three risk factors, through applying the proper weight coefficients. In case the risk factor is above the predefined threshold, a warning signal is sent in order to warn on time …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A fine-grained metric system for the completeness of metadata",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04590-5_8",
            "Abstract": "Metadata quality is an issue that can be approached from different aspects. Among the most essential properties characterizing a quality metadata record is its sufficiency to describe a resource, which is expressed as the completeness of the record. The paper presents a fine-grained metric system for measuring metadata completeness that is capable of following the hierarchy of metadata as it is set by the metadata schema and admeasuring the effect of multiple values of multi-valued fields. Moreover, it introduces the aspect of the representation level of semantically equivalent information that should be taken into account when measuring completeness. The proposed metric system, based on the definition of completeness of a field, treats several deficiencies of the traditional coarse metrics and offers the ability of targeted measures of completeness throughout the metadata hierarchy.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Context-based humanized and authorized personalization",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=6651013064614066407&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ασφάλεια Διαδικτυακών Εφαρμογών",
            "Publication year": 2015,
            "Publication url": "https://repository-web.kallipos.gr/bitstream/11419/1029/1/05_chapter_05.pdf",
            "Abstract": "Ζητήματα ασφάλειας (ευπάθειες, κίνδυνοι, επιθέσεις κλπ) στο επίπεδο εφαρμογής. Ανάλυση των προβλημάτων ασφάλειας κατά την αξιοποίηση των τεχνολογιών διαδικτύου και μέτρα προστασίας των διαδικτυακών εφαρμογών (web applications). Συμπεριλαμβάνονται ενότητες για την επεξήγηση και μελέτη ευπαθειών όπως: Access control flaws, Authentication flaws, Buffer overflows, Cross-Site Scripting (XSS), Denial of Service, Injection flaws (SQL Injection), Session Management Flaws, κ. ά.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:AXPGKjj_ei8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access-rule certificates for secure distributed healthcare applications over the Internet",
            "Publication year": 2002,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/146045820200800302",
            "Abstract": "Access control in medical information systems distributed over the Internet is an important issue directly related to the protection of patients’ privacy. It is therefore essential to satisfy the increasing demand for exploiting Internet mechanisms in order to achieve a secure health information network. This can only be done, however, if it can be guaranteed that appropriate measures have been taken to preserve a satisfactory level of security for the information concerned. Recent efforts in this direction rely on public-key cryptography and digital certificates. Identity certificates are suitable for identification and authentication purposes. In addition, attribute certificates are another type of certificate particularly suitable for authorization purposes. In order to fully exploit digital certificates to protect distributed healthcare applications over the Internet, we propose the use of a third type of certificate, called access-rule certificates …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "A method to calculate social networking hazard probability in definite time",
            "Publication year": 2013,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/09685221311314392/full/html",
            "Abstract": "The purpose of this paper is to investigate hazards for minor users while they are exposed to social networks. In particular, it provides the statistical relationship of these hazards with the exposure time as well as the amount of published personal information.An experiment was conducted that has revealed a huge number of personal information exposed by users of social network applications. Moreover, a significant amount of suspicious activity against minors has been recorded. Experimental data led to the hypothesis that online hazards can be modeled with known statistical distributions. In order to examine this hypothesis, survival analysis techniques, which involve the estimation of certain functions that reflect the relation of a disastrous event with time, were applied.The results show that the incoming hazards for minor female profiles follow the Logistic …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:hMod-77fHWUC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "E-reputation ontology for adaptation in e-learning",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Mavridis-2/publication/27384605_E-Reputation_Ontology_for_Adaptation_in_E-Learning/links/0fcfd50a60bbe738fa000000/E-Reputation-Ontology-for-Adaptation-in-E-Learning.pdf",
            "Abstract": "This paper presents an ontology, developed for e-Learning, which utilizes existing tools and methods available in the semantic web, as to further distribute personalized multimedia educational material into a private network environment. The ontology is enriched with a set of criteria inducing the consumers to evaluate the learning system. This collected e-Reputation metadata, through a mechanism based on KAON, anticipates for methods to provide adaptable learning objects.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access Control Issues in Utilizing Fog Computing for Transport Infrastructure",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-33331-1_2",
            "Abstract": "The integration of the information and communication technologies of cloud computing, Software Defined Networking (SDN) and Internet of Things (IoT) into traditional transportation infrastructures enables the evolution of Intelligent Transportation Systems (ITS). Moreover, the specific requirements for real-time applications and service provision near to consumers introduce the utilization of fog computing as an extension of cloud. However, such a movement affects security aspects and poses new access control challenges. In this paper, we study the operational characteristics of a proposed ITS paradigm utilizing fog computing and identify corresponding access control issues. To address these issues in such a versatile and highly distributed environment, we present the key pointers of an attribute-based access control scheme suitable for fog computing. This paper aims to set a basis for further work in …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Role-based secure inter-operation and resource usage management in mobile grid systems",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21040-2_3",
            "Abstract": "Dynamic inter-domain collaborations and resource sharing comprise two key characteristics of mobile Grid systems. However, inter-domain collaborations have proven to be vulnerable to conflicts that can lead to privilege escalation. These conflicts are detectable in inter-operation policies, and occur due to cross-domain role relationships. In addition, resource sharing requires to be enhanced with resource usage management in virtual organizations where mobile nodes act as resource providers. In this case the enforcement of resource usage policies and quality of service policies are required to be supported due to the limited capabilities of the devices. Yet, the ANSI INCITS 359-2004 standard RBAC model provides neither any policy conflict resolution mechanism among domains, nor any resource usage management functionality. In this paper, we propose the domRBAC model for access control in …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Design and Evaluation of COFELET-based Approaches for Cyber Security Learning and Training",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404821000870",
            "Abstract": "Cyber security game-based learning is a new field that lacks design standards and common methodologies. To this end, the Conceptual Framework for eLearning and Training (COFELET) and the COFELET ontology have been proposed. COFELET is a framework that can be used as a guide for the design and evaluation of effective cyber security learning and training approaches, whereas the COFELET ontology describes the key elements that such approaches should embrace to assimilate well known cyber security threat analysis and modeling standards as the means to create interesting educational experiences. Aiming at providing insights on how COFELET compliant approaches can be developed, we propose the life-cycle of a COFELET game, a blueprint illustrating the design aspects and the course of phases for the development of COFELET compliant games (COFELET games). Besides, an extension …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:35r97b3x0nAC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Ψηφιακές υπογραφές και ψηφιακά πιστοποιητικά",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1033",
            "Abstract": "Αξιοποίηση της κρυπτογραφίας και των συναρτήσεων κατακερματισμού για τη δημιουργία ψηφιακών υπογραφών. Μελέτη σχετικών προτύπων, όπως το DSS. Αντιμετώπιση του προβλήματος πιστοποιημένης αντιστοίχισης του δημόσιου κλειδιού με συγκεκριμένη οντότητα με τη δημιουργία ψηφιακών πιστοποιητικών και τη διαχείρισή τους στο πλαίσιο υποδομών δημοσίου κλειδιού (PKI). Εναλλακτικά, θα μελετηθούν τα περιβάλλοντα X.509 και PGP.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Verification of Hybrid System Specifications using Linear Hybrid Automata",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=12688781448635890260&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Shaping smarter consumer food choices: The Food SMART project",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/nbu.12376",
            "Abstract": "Compared to meals prepared at home, meals eaten out of home tend to contain more energy, total fat and saturated fat and it is here where consumers can have very little knowledge of the nutrient profile of the dish they are eating. The aim of the European Union‐funded FoodSMART project (www.foodsmartproject.net) was to develop an innovative technical menu solution ‘app’ that enables informed consumer food choice, which takes into account individual preferences (such as dietary requirements) as well as food product specifications, in a workplace canteen setting. A best–worst scaling questionnaire was conducted to identify consumers’ functional app requirements and inform the development of personalised food choice messages. Proof of concept was tested using the System Usability Scale in consumers from four European countries (Denmark, France, Greece and the UK). Information on ingredients …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security policy verification for multi-domains in cloud systems",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10207-013-0205-x.pdf",
            "Abstract": "The cloud is a modern computing paradigm with the ability to support a business model by providing multi-tenancy, scalability, elasticity, pay as you go and self-provisioning of resources by using broad network access. Yet, cloud systems are mostly bounded to single domains, and collaboration among different cloud systems is an active area of research. Over time, such collaboration schemas are becoming of vital importance since they allow companies to diversify their services on multiple cloud systems to increase both uptime and usage of services. The existence of an efficient management process for the enforcement of security policies among the participating cloud systems would facilitate the adoption of multi-domain cloud systems. An important issue in collaborative environments is secure inter-operation. Stemmed from the absence of relevant work in the area of cloud computing, we define a model …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Implementation and Evaluation of TCP Enhancements over Satellite Links",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4124173/",
            "Abstract": "Internet over satellite is an emerging facet of communications enabling users to have access to the Internet over high speed satellite links. However, new requirements should be satisfied by the involved protocols in order to fully utilize the available network resources. This paper discusses the possible mitigations that can be applied to the transmission control protocol over satellite links. Furthermore, we study the performance of the TCP enhancements we implemented in a simulated satellite environment.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Αναγνώριση και Αυθεντικοποίηση",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/bitstream/11419/527/1/05_chapter_02.pdf",
            "Abstract": "Δημιουργία και διαχείριση λογαριασμών χρηστών σε περιβάλλον Windows και UNIX (Linux). Εναλλακτικές μέθοδοι αναγνώρισης και αυθεντικοποίησης  (συνθηματικά, πιστοποιητικά, κλπ) και εφαρμογή τους.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Κακόβουλο λογισμικό: στατική ανάλυση",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/534",
            "Abstract": "Παρουσίαση βασικών εννοιών κια το κακόβουλο λογισμικό και την ανάλυση των συνεπειών του. Κατηριοποίηση των τεχνικών ανάλυσης (όπως: Surface analysis,  Behavioral analysis, Static code analysis, Dynamic code analysis, Volatile Memory Analysis, κ.ά.). Εφαρμογή σεναρίων στατικής ανάλυσης που θα συμπεριλαμβάνει: 1. Εύρεση αποτυπώματος (fingerprint), Έλεγχο για συμπίεση (file packing), ανάλυση δομής αρχείου (file structure), αναζήτηση για αλφαριθμητικά (string), αντίστροφη- μηχανική (disassembling) κ.ά.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ARES: Automated Risk Estimation in Smart Sensor Environments",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/799914",
            "Abstract": "Industry 4.0 adoption demands integrability, interoperability, composability, and security. Currently, integrability, interoperability and composability are addressed by next-generation approaches for enterprise systems integration such as model-based standards, ontology, business process model life cycle management and the context of business processes. Security is addressed by conducting risk management as a first step. Nevertheless, security risks are very much influenced by the assets that the business processes are supported. To this end, this paper proposes an approach for automated risk estimation in smart sensor environments, called ARES, which integrates with the business process model life cycle management. To do so, ARES utilizes standards for platform, vulnerability, weakness, and attack pattern enumeration in conjunction with a well-known vulnerability scoring system. The applicability of ARES is demonstrated with an application example that concerns a typical case of a microSCADA controller and a prototype tool called Business Process Cataloging and Classification System. Moreover, a computer-aided procedure for mapping attack patterns-to-platforms is proposed, and evaluation results are discussed revealing few limitations. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:tzM49s52ZIMC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A foundation for defining security requirements in grid computing",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5298349/",
            "Abstract": "Despite the wide adoption by the scientific community, grid technologies have not been given the appropriate attention by enterprises. This is merely due to the lack of enough studying and defining security requirements of grid computing systems. More specifically, access control in grid systems has been addressed with the same models for collaborative systems based on distributed computing across multiple administrative domains. However, existing solutions are not based on a foundation for a holistic approach in grid access control. This paper aims to provide an adequate approach in this direction. Additionally, a comparative review of current access control models is provided in the context of our proposed four-layer conceptual grid categorization.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DARBAC: dynamically administering role based access control",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=8662072996148456832&hl=en&oi=scholarr",
            "Abstract": "Access control administration regulates and enforces the definition of the components of an access control system by authorized administrative users. In this paper, the limitationson administrative aspects of well-known security models are addressed and the requirements for efficient management of authorizations are investigated in order to provide fine-grained and just-in-time access control for collaborative applications. Subsequently, the DARBAC (Dynamically Administering Role Based Access Control) model, which is a new approach in the area of role-based access control administration, is proposed and formally defined. The DARBAC model introduces new mechanisms for dynamic administration of access control and provides security features that comprise temporal role activation depending on particular objectives, controlled decentralization of administrative care, constraint-based privacy protection …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ΚΑΣΣΙΟΠΕΙΑ: Κινητό Σύστημα Επιθεώρησης Ασφαλείας",
            "Publication year": 2012,
            "Publication url": "https://repository.ellak.gr/ellak/handle/11087/1707",
            "Abstract": "Αποθετήριο ΕΛ/ΛΑΚ: ΚΑΣΣΙΟΠΕΙΑ: Κινητό Σύστημα Επιθεώρησης Ασφαλείας Αναζήτηση \nΣύνθετη Αναζήτηση EN A A A no Αρχική no Πλοήγηση Συλλογές Ημερομηνία Συγγραφέας \nΤίτλος Τύπος no Είσοδος στο Αποθετήριο no Σχετικά με το Αποθετήριο no Επικοινωνία \nΑκολουθήστε την ΕΕΛ/ΛΑΚ ΚΑΣΣΙΟΠΕΙΑ: Κινητό Σύστημα Επιθεώρησης Ασφαλείας \nΣυγγραφέας/Δημιουργός: Μαυρουδής, Βασίλειος Μαυρίδης, Ιωάννης Ημερομηνία: 2011-01-01 \nURI: http://hdl.handle.net/11087/1707 Ηλεκτρονική διεύθυνση τεκμηρίου σε ελεύθερη \nπρόσβαση (link): http://conferences.ellak.gr/2011/files/2011/05/ELLAK-PRES.pdf \nΕξειδίκευση τύπου: Παρουσίαση Άδεια χρήσης: http://creativecommons.org/licenses/by-sa/3.0/gr/ \nΕμφανίζεται στις συλλογές: Παρουσιάσεις Παρουσιάσεις Το πλήρες κείμενο αυτού του \nτεκμηρίου δεν διατίθεται προς το παρόν από το Αποθετήριο ΕΛ/ΛΑΚ. …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending LMS to support IRT-based assessment test calibration",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13166-0_75",
            "Abstract": "Developing unambiguous and challenging assessment material for measuring educational attainment is a time-consuming, labor-intensive process. As a result Computer Aided Assessment (CAA) tools are becoming widely adopted in academic environments in an effort to improve the assessment quality and deliver reliable results of examinee performance. This paper introduces a methodological and architectural framework which embeds a CAA tool in a Learning Management System (LMS) so as to assist test developers in refining items to constitute assessment tests. An Item Response Theory (IRT) based analysis is applied to a dynamic assessment profile provided by the LMS. Test developers define a set of validity rules for the statistical indices given by the IRT analysis. By applying those rules, the LMS can detect items with various discrepancies which are then flagged for review of their content …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Information infrastructure risk prediction through platform vulnerability analysis",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121215000837",
            "Abstract": "The protection of information infrastructures is important for the function of other infrastructure sectors. As vital parts for the information infrastructure operation, software-based platforms, face a series of vulnerabilities and threats. This paper aims to provide a complementary approach to existing vulnerability prediction solutions and launch the measurement of zero-day risk by introducing a risk prediction methodology for an information infrastructure. The proposed methodology consists of four steps and utilizes the outcomes of a proper analysis of security measurements provided by specifications from the Security Content Automation Protocol. First, we identify software platform assets that support an information infrastructure and second we measure the historical rate of vulnerability occurrences. Third, we use a distribution fitting procedure to estimate the statistical correlation between empirical and reference …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:pyW8ca7W8N0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Σχεδίαση μέσω υπολογιστή και σύγκριση σχεδιαστικών προγραμμάτων",
            "Publication year": 2017,
            "Publication url": "http://okeanis.lib.teipir.gr/xmlui/handle/123456789/3733",
            "Abstract": "Η παρούσα πτυχιακή εργασία ασχολείται με την έννοια της παραμετρικής σχεδίασης και σχεδιαστικών παραμετρικών προγραμμάτων. Πιο συγκεκριμένα θα επικεντρωθούμε στο τί είναι σχεδιασμός με τη βοήθεια ηλεκτρονικού υπολογιστή, παραμετρική σχεδίαση δίνοντας έμφαση σε προγραμματιστικά εργαλεία, στα οποία παραγματοποιείται η εφαρμογή της. Αναλυτικότερα θα εξετασθούν τέσσερα προγράμματα παραμετρικής σχεδίασης τα οποία είναι τα εξής: Rhinoceros 3D, SolidWorks, Pro-Engineer και Autodesk Inventor. Ολοκληρώνοντας την εργασία θα αναλυθούν τα χαρακτηριστικά του κάθε προγράμματος ξεχωριστά και θα συγκριθούν οι δυνατότητές τους.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:NJ774b8OgUMC",
            "Publisher": "ΑΕΙ Πειραιά ΤΤ"
        },
        {
            "Title": "A methodology for evaluating web-based educational systems using statistical multidimensional analysis",
            "Publication year": 2011,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJLT.2011.044631",
            "Abstract": "Current research on web-based learning systems focuses on providing adaptation as part of usability and learnability aspects of these systems. Working in this direction, the (asynchronous adaptive learning and evaluation system) has been developed, which provides new opportunities to the transfer of knowledge between educators and learners by widely incorporating pedagogical principles in order to enhance the effectiveness of the learning procedure. This paper aims to provide an approach on evaluating the impact of adaptivity, usability and learnability based on Nielsen’s ten usability heuristics (Nielsen, 1993b) on improving the effectiveness of users’ learning in web-based courses. For this purpose, a new evaluation methodology is presented that utilises the statistical method of multidimensional analysis (correspondence analysis) and uses special contingency tables that came from a new coding of scales …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:-f6ydRqryjwC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Supporting dynamic administration of RBAC in web-based collaborative applications during run-time",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJICS.2008.022487",
            "Abstract": "The requirements for the efficient management of authorisations in web-based collaborative applications lead to new access control administration paradigms during run-time. The need for fine-grained and just-in-time access control can effectively be addressed by dynamic administration of authorisations, via either proper role or permission activation. In this paper, an authorisation architecture that is based on the Dynamically Administering Role-based Access Control (DARBAC) model, and provides access control and meta-access control capabilities, is presented. The paper describes the implementation of the components and the structure of the architecture within the .NET framework. The application of the implemented access control system is also demonstrated. Based on the results of this demonstration, a more detailed investigation of the benefits of the proposed approach, which are related to improvements …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Challenging issues of UCON in modern computing environments",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371316.2371346",
            "Abstract": "Usage CONtrol (UCON) is a next generation access control model enhanced with capabilities presented in trust and digital rights management. However, modern computing environments are usually introducing complex usage scenarios. Such a complexity results in involving a large number of entities and in utilizing multi party contextual information during the decision making process of a particular usage. Moreover, usage control is demanded to support novel access modes on single or composite resources, while taking into account new socio-technical abstractions and relations. In this paper, a number of challenging issues faced when UCON is applied in modern computing environments are highlighted through the utilization of representative usage scenarios. The results of this study are revealing various limitations in contextual information handling, lack to support complicated usage modes of subjects on …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "domRBAC: An access control model for modern collaborative systems",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404812000144",
            "Abstract": "Modern collaborative systems such as the Grid computing paradigm are capable of providing resource sharing between users and platforms. These collaborations need to be done in a transparent way among the participants of a virtual organization (VO). A VO may consist of hundreds of users and heterogeneous resources. In order to have a successful collaboration, a list of vital importance requirements should be fulfilled, viz. collaboration among domains, to ensure a secure environment during a collaboration, the ability to enforce usage constraints upon resources, and to manage the security policies in an easy and efficient way. In this article, we propose an enhanced role-based access control model entitled domRBAC for collaborative applications, which is based on the ANSI INCITS 359-2004 access control model. The domRBAC is capable of differentiating the security policies that need to be enforced in …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:j3f4tGmQtD8C",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Realistic Modelling of Deformable Surfaces for Web-Based Medical Simulations",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=16077307056903918944&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of HackLearn COFELET Game User Experience for Cybersecurity Education",
            "Publication year": 2021,
            "Publication url": "http://journal.seriousgamessociety.org/~serious/index.php/IJSG/article/view/437",
            "Abstract": "HackLearn is a scenario-based hacking simulation game for teaching cybersecurity concepts while providing hands-on hacking experiences to the learners. HackLearn design is based on the COFELET framework, which assimilates modern learning theories, well-known cybersecurity standards, and built-in scaffolding and assessment features. Aiming at evaluating the user experience perceived by HackLearn’s users, we describe the process of adopting it in a real educational environment based on the didactic framework for simulation games. Additionally, we present the evaluation methodology elaborated, based on the serious games’ quality characteristics framework. We discuss the evaluation results which indicate that HackLearn is engaging, motivating, usable and effective in teaching cybersecurity concepts and hacking strategies and techniques. The evaluation results revealed the HackLearn’s aspects that can be improved such as the scaffolding feature and the communication mechanism with the game’s back-end facility. The presented work validates and finalizes prior work elaborated on the COFELET framework (eg, COFELET ontology and the COFELET games life-cycle), whereas it provides directions for future work in the development and evaluation of cybersecurity serious games.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ontology-Based Modelling for Cyber Security E-Learning and Training",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-35758-0_2",
            "Abstract": "The Conceptual Framework for e-Learning and Training (COFELET) constitutes a design standard for the enhancement of cyber security education by guiding the development of effective game-based approaches (e.g., serious games). The COFELET framework envisages cyber security serious games as highly organized and parameterized learning environments which monitor learner’s actions, evaluate their efforts and adapt to their needs. To this end, the COFELET framework employs well known cyber security standards (e.g., MITRE’s CAPEC, Lockheed Martin’s Cyber Kill Chain model or CKC) as a vehicle for organizing educational environments which model learners’ actions and strategies. In this light, the COFELET ontology is proposed aiming at providing a foundation for the development of a universal knowledge base for modeling such environments. The COFELET ontology provides an analytical …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:1yQoGdGgb4wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Verifying specifications in hybrid automata models of systems",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=9627494297571675538&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "GARS: Real-time system for identification, assessment and control of cyber grooming attacks",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404813001806",
            "Abstract": "In this paper, the Grooming Attack Recognition System (GARS) is presented. The main objectives of GARS are the real-time identification, assessment and control of cyber grooming attacks in favor of child protection. The system utilizes the processes of document classification, personality recognition, user history and exposure time recording to calculate specific risks children are exposed to during chat conversations. The above processes are repeated after each new message and three of them feed corresponding fuzzy logic controllers that provide particular but homogenized risk values as outputs. The weighted sum of the particular risk values results in a total value that indicates the current cyber grooming risk the child is exposed to, as the conversation evolves. Depending on predefined thresholds, the total risk value can be used to trigger alarms for various scopes (children, parents, etc). The practical use of …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:a0OBvERweLwC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "A study on user behavior and acceptance of electronic banking services",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600442/",
            "Abstract": "This paper presents a study which investigates user behavior towards electronic banking (e-banking) and particularly in internet banking based on behavioral theoretical models and scales such as the theory of planned behavior (TPB), the diffusion of innovations theory, the technology acceptance model (TAM) and Kirton's adaptor-innovator scale (KAI). In this study, behavioral and personality patterns lead to certain hypothesis regarding adoption towards internet banking. In addition, we categorize the most important factors affecting e-banking and propose the use of dependencies among different factors within the e-banking infrastructure in order to assess potential impacts and risks.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Έλεγχος Πρόσβασης σε Συστήματα Διαχείρισης Βάσεων Δεδομένων",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/532",
            "Abstract": "Παροουσίαση του συστήματος ελέγχου πρόσβασης ενός συστήματος διαχείρισης βάσεων δεδομένων (π.χ. ORACLE DBMS), των δικαιωμάτων πρόσβασης (συστήματος και αντικειμένων) και διερεύνηση της αιξοποίησή τους στη βάση πραγματικών σεναρίων, που συμπεριλαμβάνουν: Καθορισμό και διαχείριση δικαιωμάτων πρόσβασης συστήματος, Δημιουργία υποκειμένων, Καθορισμό και διαχείριση δικαιωμάτων πρόσβασης αντικειμένων, Δημιουργία αντικειμένων, Εκχώρηση και ανάκληση δικαιωμάτωνπρόσβασης, ∆ιαχειριστικό έλεγχο συστήματος (review) κ.ά.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ευρωπαϊκές ναυτιλιακές συστάδες και πολίτικες ανάπτυξης τους",
            "Publication year": 2020,
            "Publication url": "https://dione.lib.unipi.gr/xmlui/handle/unipi/12707",
            "Abstract": "Η συγκεκριμένη μελέτη είναι δομημένη ως εξής. Αρχικά παρουσιάζει μια γενική εικόνα των ναυτιλιακών συστάδων στη Μεσόγειο, υπογραμμίζοντας τα βασικά χαρακτηριστικά τους και τα στοιχεία που τις δομούν όπως και τις ιδιαιτερότητες τους. Δίνει ιδιαίτερη προσοχή στα χαρακτηριστικά, στην κρίσιμη μάζα, στις διαφορές βαθμού ανάπτυξης και τη διασυνοριακή συνεργασία. Στη συνέχεια επικεντρώνεται στον τομέα χάραξης πολιτικής των συστάδων και στην σύντομη περιγραφή της ναυτιλιακής συστάδας του Πειραιά.  Η εργασία αυτή έχει σκοπό και στόχο να συνδράμει τους διαχειριστές θαλάσσιων συστάδων. Επισημαίνει την λογική και τις αρχές που διέπουν την λειτουργεία των ναυτιλιακών συστάδων ειδικά στις περιοχές της Μεσογείου, υπογραμμίζει τα πλεονεκτήματα  τους  αλλά και τις προϋποθέσεις για την ανάπτυξη ναυτιλιακών συστάδων στην περιοχή. Ακολουθούν, συστάσεις πολιτικής για τις συστάδες στον ευρωπαϊκό χώρο, αξιολόγηση του πλαισίου πολιτικής της Ε.Ε όπως και προτάσεις ναυτιλιακής πολιτικής .",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:tKAzc9rXhukC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Απόκριση σε συμβάντα & Digital Forensics",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1036",
            "Abstract": "Διαδικασία αντιμετώπισης και διαχείρισης περιστατικών ασφάλειας, με εστίαση στον έλεγχο ζημιών (damage control), το μικρό χρόνο αποκατάστασης (low recovery time) και το χαμηλό κόστος (low cost). Στο πλαίσιο απόκρισης σε περιστατικά ασφάλειας, ιδιαίτερο βάρος θα δοθεί σε τεχνικά και διαδικαστικά θέματα εγκληματολογίας ηλεκτρ. υπολογιστών και δικτύων, που γενικότερα αποδίδονται ως digital forensics. Θα αναλυθούν επιμέρους οι ακόλουθες ενότητες: collection, file system analysis, application analysis, OS analysis, file analysis, Internet αrtifacts, counter forensics.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing multimedia traffic performance in IEEE 802.11 e networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5629098/",
            "Abstract": "IEEE 802.11e constitutes the “state of the art” standard for providing QoS to multimedia traffic in Wireless Local Area Networks (WLANs). However, it has been proven inadequate in certain network conditions (high load). Several mechanisms improving its performance have been proposed in the past years. Most of them focused on altering the static nature of resource allocation specified in IEEE 802.11e. Nevertheless, it is of high importance to consider the traffic characteristics before doing so. In this paper, a new, centralized and simple algorithm is proposed that considers multimedia traffic characteristics and adequately copes with high load situations in wireless infrastructure networks. The proposed algorithm is evaluated and its effectiveness is proven by means of simulation.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evolving Challenges In Information Security Compliance.",
            "Publication year": 2009,
            "Publication url": "https://aisel.aisnet.org/cgi/viewcontent.cgi?article=1073&context=mcis2009",
            "Abstract": "With the proliferation of computer-driven organizations and internet-based business information systems, the need for security has increased significantly. In addition, information security compliance is becoming a controversial issue among IT professionals. This paper aims to address the concerns arising from compatibility of security standards, compliance cost, certification approval and human involvement that affect compliance management. A unified approach to information security compliance is suggested for organizations seeking to build strong relationships across business and IT departments, improving in that way a company’s security value.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hepatic Cells Deformation: Simulating a Pathological Condition Resulting in Jaundice",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantifying and measuring metadata completeness",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/asi.21706",
            "Abstract": "Completeness of metadata is one of the most essential characteristics of their quality. An incomplete metadata record is a record of degraded quality. Existing approaches to measure metadata completeness limit their scope in counting the existence of values in fields, regardless of the metadata hierarchy as defined in international standards. Such a traditional approach overlooks several issues that need to be taken into account. This paper presents a fine‐grained metrics system for measuring metadata completeness, based on field completeness. A metadata field is considered to be a container of multiple pieces of information. In this regard, the proposed system is capable of following the hierarchy of metadata as it is set by the metadata schema and admeasuring the effect of multiple values of multivalued fields. An application of the proposed metrics system, after being configured according to specific user …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:QIV2ME_5wuYC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Ασφάλεια πληροφοριών στο διαδίκτυο",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1024",
            "Abstract": "Το σύγγραμμα θα αποτελέσει πολύτιμο βοηθό για τον αναγνώστη στο μάθημα \"Ασφάλεια Δικτύων και Διαδικτυακών Εφαρμογών\" στόχος του οποίου είναι η εξοικείωση με τις απαιτήσεις προστασίας των σύγχρονων συστημάτων πληροφορικής και επικοινωνιών και η εκμάθηση βασικών τεχνικών ασφάλειας των πληροφοριών κατά την τηλεπεξεργασία και ηλεκτρονική μεταφορά τους στο διαδίκτυο π.χ. με την αξιοποίηση της κρυπτολογίας και όχι μόνον. Επίσης το σύγγραμα θα περιλαμβάνει εργαστηριακές ασκήσεις και δραστηριότητες, ώστε να δώσει την ευκαιρία στο φοιτητή να αποκτήσει εμπειρίες από την εφαρμογή των παραπάνω τεχνικών.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web services and multimedia in m‐business applications: Opportunities and concerns",
            "Publication year": 2006,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/17440080680000101/full/html",
            "Abstract": "Web services refer to a specific set of technologies used to implement a Service Oriented Architecture. Thanks to maturing Web‐services standards, and to new mobile devices and application solutions, progress is being made in presenting similar Web‐services offerings in both mobile and fixed networks. To bring that architecture and the solutions it will support to the world of mobility is indeed a significant issue in m‐business applications, because mobile Web services present various advantages: Reduction of the overall cost of development (by reusing existing system components), faster time to market introduction of products (provided by applications’ rapid development and deployment) and remarkable possibilities to emerge new applications with increased functionalities. In addition, the new and forthcoming mobile networks, with native IP connection and high speed transmission capability, allow the …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:KlAtU1dfN6UC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Utilizing Survival Analysis for Modeling Child Hazards of Social Networking",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=YxfHAwAAQBAJ&oi=fnd&pg=PA195&dq=info:4-s9zBolryAJ:scholar.google.com&ots=jlQJdthUG6&sig=225kviYbQ5Hnu16K6vOTG4uWt7U",
            "Abstract": "Social networks induce several hazards to children, which are correlated with the amount of time that children are exposed to those networks. To this end, this work investigates the relation of the aforementioned hazards with the exposure time. To address this issue, we adopt techniques used in survival analysis. These techniques involve the estimation of certain functions which reflect the relation of a disastrous event with time. In particular, we derive the distribution of the rate at which suspicious activities towards children occur in social networks. This is accomplished through experiments on data sets extracted from Facebook. The results show that the incoming hazards for minor female profiles follow the Logistic distribution, while the corresponding hazards for minor male profiles follow the Normal distribution. This knowledge is then utilized for developing an effective system for automated grooming recognition, by optimizing the detection threshold as a function of time. Thus, the threshold sensitivity can be appropriately adjusted such that lower frequencies of occurrence lead to lower threshold sensitivities, and higher frequencies of occurrence lead to higher threshold sensitivities.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Consumer preferences for the use of an innovative digital menu solution in public food service settings in four European countries",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S095032932100207X",
            "Abstract": "Consumer preferences for the use of an innovative menu solution in public canteen services in the UK, Greece, France, and Denmark were investigated. Participants from both control and test groups were first introduced to the FoodSMART app through a video clip as well as verbal explanations. The control group filled a questionnaire evaluating their preferences for the use of a technical menu solution in public food services straight away, whereas the test group had the opportunity to experience the app adapted to a daily canteen menu in real-time before completing the questionnaire. The data collected was examined in both country-specific and collected manners. Participants in all four countries valued the canteen food quality the most, especially food hygiene, sustainability, safety, and freshness. Their preferences for other features such as app functions, information provision, and ethical issues varied in …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:fEOibwPWpKIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "What are we eating? Consumer information requirement within a workplace canteen",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0950329316301112",
            "Abstract": "The workplace is a captive environment where the overall contribution of the meal served could be an important element of the overall diet. Despite growing demand little information is available to aid healthy dish selection.This study identifies information valued by consumers in the UK, Greece, Denmark and France using best-worst scaling. Value for Money, Nutrition and Naturalness are key elements of information that consumers require to be able to make a conscious decision about dish selection in all four countries. Latent class analysis shows that consumers align to one of five cluster groups, i.e., Value Driven, Conventionalists, Socially Responsible, Health Conscious and Locavores.Understanding key information needs can allow food operators to align their service with consumer preferences across different market segments.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:CHSYGLWDkRkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Integrating IRT Analysis into LMS for Assessment Test Calibration",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=5577698104444523778&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilizing document classification for grooming attack recognition",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983950/",
            "Abstract": "Grooming attack recognition is a complex issue that is difficult to address using simple word matching in order to identify potential hazard for minor users. In this paper, the utilization of document classification to create patterns from real dialogs is proposed. Furthermore, a decision making method that results in generating proper warning signals based on the classification results is introduced. The decision making method is then applied using the best ranked algorithm with a comparative evaluation which conducted on seven document classification algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A mobile phone app for the provision of personalized food-based information in an eating-out situation: development and initial evaluation",
            "Publication year": 2019,
            "Publication url": "https://formative.jmir.org/2019/4/e12966",
            "Abstract": "Background: Increasing pressure from governments, public health bodies, and consumers is driving a need for increased food-based information provision in eating-out situations. Meals eaten outside the home are known to be less healthy than meals eaten at home, and consumers can complain of poor information on the health impact and allergen content of meals eaten out.Objective: This paper aimed to describe the development and early assessment of a mobile phone app that allows the provision of accurate personalized food-based information while considering individual characteristics (allergies, diet type, and preferences) to enable informed consumer choice when eating out.Methods: An app was designed and developed to address these requirements using an agile approach. The developed app was then evaluated at 8 public engagement events using the System Usability Scale (SUS) questionnaire and qualitative feedback.Results: Consideration of the literature and consultation with consumers revealed a need for information provision for consumers in the eating-out situation, including the ability to limit the information provided to that which was personally relevant or interesting. The app was designed to provide information to consumers on the dishes available in a workplace canteen and to allow consumers the freedom to personalize the app and choose the information that they received. Evaluation using the SUS questionnaire revealed positive responses to the app from a range of potential users, and qualitative comments demonstrated broad interest in its use.Conclusions: This paper details the successful development and …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:N5tVd3kTz84C",
            "Publisher": "JMIR Publications Inc., Toronto, Canada"
        },
        {
            "Title": "On the identification of inference rules for automatic metadata generation",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.108.1723&rep=rep1&type=pdf",
            "Abstract": "Learning objects metadata (LOM) facilitate search, evaluation, acquisition, and use of learning objects, which may contain any kind of multimedia information, by learners, instructors or automated software processes. As a result, learning objects reuse is promoted and thus, development cost for new ones is reduced. However, manual indexing of learning resources according to metadata standards is a laborious task. This fact suspends the full usage and reduces the intended advantages of standards, like IEEE LOM. The introduction of automatic metadata generation processes is a developing research field with diverse approaches. In this paper, we present a step-by-step methodology for automatic generation of metadata that exploits relations between the resources to be described. The methodology comprises the execution of consecutive steps of actions aiming at identifying inference rules for automatic generation of a resource’s metadata based on pre-existing metadata of its related resources.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Δίκτυα και Διαδίκτυο",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1026",
            "Abstract": "Βασικές και προαπαιτούμενες γνώσεις σε βασικές αρχές δικτύωσης και διαδικτύωσης αλλά και αναφορά σε νέες τεχνολογίες όπως το διαδίκτυο των πραγμάτων (internet of things), τα δίκτυα αισθητήρων (sensor networks) και ο χώρος του πανταχού παρόντος υπολογισμού (ubiquitous computing), προκειμένου ο αναγνώστης να μπορεί να αντιληφθεί σε βάθος τα προβλήματα ασφάλειας που ανακύπτουν. Ενδεικτικά θα περιλαμβάνονται βασικές έννοιες δικτύων υπολογιστών, υποδομές και είδη δικτύων (WAN, LAN, PAN, δίκτυα αισθητήρων, κλπ), σύντομη αναφορά στο μοντέλο αναφοράς ISO/OSI & Internet, Επίπεδα ζεύξης, δικτύου (IPv4, IPv6, προώθηση και δρομολόγηση), μεταφοράς (TCP, UDP), εφαρμογής (DNS, ΗΤΤP κ. ά.)",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hepatic cells simulation for medical education in world wide web",
            "Publication year": 2005,
            "Publication url": "http://b-dig.iie.org.mx/BibDig2/P11-0436/papers/502-364.pdf",
            "Abstract": "The enormous expansion of the World Wide Web and the recent advances in computer sciences have radically changed the traditional educational methods. In such a network-centric mode of education the presence of teachers and students in the same place or even at the same time is no longer prerequisite. These developments have also affected the education and training of medical students. Moreover, the combination of virtual reality with Internet technologies has enabled the development of advanced web-based medical simulations that can help students acquire the required experience and skills in a safe, realistic environment. This paper aims to survey the last advances on medical simulations on World Wide Web, as well as to demonstrate a new Web-based medical simulation called “Hepatic Cells Simulation”, which has been developed for being used as an educational tool for medical students and doctors. The simulation represents in 3D space the cellular structure of liver, as well as the deformation of hepatic cells resulting in the flow of bile in the blood (a pathological condition which is called Jaundice). This innovative application permits the active participation of students in the educational procedure enabling medical students not only to study the cellular structure of liver but also to interact with the simulation by changing the pressure applied on hepatic cells and performing actions that are not possible in real life.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security Modules for Access Control in Mobile Applications",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/52112106/Security_Modules_for_Access_Control_in_M20170311-9401-1607p3e.pdf",
            "Abstract": "A critical issue for the wide acceptance of mobile applications relies mainly on the protection of the data residing in mobile devices. In this paper we propose an access control solution for the enhancement of trust in wireless network environments. Taking into account the inherent problems of mobile devices with wireless communication capabilities and the adoption of an integrated access control approach that exploits different types of certificates based on public key technologies, we propose the use of security modules for storing sensitive security data on mobile devices. In addition, we distinguish between fixed and removable security modules, where in combination with the certificate types a flexible and effective access control mechanism can be employed, with the ability to support a variety of application and user operation scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An ICT security management framework",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5741649/",
            "Abstract": "Recently, organizations started to realize that managing information security is more than a software solution; it is a strategic discipline. This realization has emerged a major challenge in the business and technology field, the integration of all governance, risk, and compliance (GRC) activities to operate in synergy and balance in configuration with the business and security objectives. The goal of this paper is to develop a comprehensive ICT security management framework as a unified platform against the evolving GRC complexity. Considering the endemic nature of risk, the risk approach requires periodical rethinking in order to keep pace with security changes and prevent undesirable incidents while preserving the stakeholders' interests continuously. Such an approach depends on the risk management maturity level, and the portfolio of monitoring controls.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security policy verification for multi-domains in cloud systems. Int",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=17417390617586101564&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Managing Enterprise IT Risk through Automated Security Metrics, Handbook of research chapter in “Automated enterprise systems for maximizing business performance”",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=1256084296406957005&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:Y5dfb0dijaUC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Βασισμένος σε ρόλους έλεγχος πρόσβασης",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/533",
            "Abstract": "Παρουσίαση του τρόπου υλοποίησης του βασισμένου σε ρόλους ελέγχου πρόσβασης σε ένα σύστημα διαχείρισης βάσεων δεδομένων (π.χ. Oracle DBΜS) και διερεύνηση των δυνατοτήτων που παρέχει στη βάση πραγματικών σεναρίων, που συμπεριλαμβάνουν: Δημιουργία και διαχείριση ρόλων, Εκχώρηση και ανάκληση δικαιωμάτων πρόσβασης και ρόλων σε ρόλους, Ενεργοποίηση και απενεργοποίηση ρόλων, Διαχειριστικό έλεγχο συστήματος (review) κ.ά.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access control in the industrial internet of things",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-12330-7_5",
            "Abstract": "The Industrial Internet of Things (IIoT) is an ecosystem that consists of – among others – various networked sensors and actuators, achieving mainly advancements related with lowering production costs and providing workflow flexibility. Introducing access control in such environments is considered to be challenging, mainly due to the variety of technologies and protocols in IIoT devices and networks. Thus, various access control models and mechanisms should be examined, as well as the additional access control requirements posed by these industrial environments. To achieve these aims, we elaborate on existing state-of-the-art access control models and architectures and investigate access control requirements in IIoT, respectively. These steps provide valuable indications on what type of an access control model and architecture may be beneficial for application in the IIoT. We describe an access …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Practical Location Aware Access Control Solution for HTML Content in Wireless Networks",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of the small sample dichotomous IRT analysis in assessment calibration",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5628908/",
            "Abstract": "Item Response Theory (IRT) provides the accepted framework for examining student responses to individual test items so as to assess their quality. Moreover, IRT proves especially valuable in both improving items, which will be reused in future tests, and eliminating the ambiguous or misleading ones. However, to ensure all IRT parameters are correctly estimated, every single item needs to be tested on a large number of examinees to define its properties. As a result, IRT tends to be shunned by teaching staff who only have access to a relatively small number of students. Nevertheless, the accuracy of parameter estimates is of lesser importance in assessment calibration, when items whose parameters exceed a threshold value are flagged for revision. This study uses simulated data sets under various simulation conditions and introduces two new quality indices together with their respective IRT goodness-of-fit tests …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Voice capacity of IEEE 802.11 b WLANs",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Mavridis-2/publication/27384699_Voice_capacity_of_IEEE_80211b_WLANs/links/0fcfd50a60bbe2d0f0000000/Voice-capacity-of-IEEE-80211b-WLANs.pdf",
            "Abstract": "There is a tremendous growth in the deployment and usage of Wireless Local Area Networks (WLANs) in recent years. There is also an increasing interest in supporting voice applications over WLANs. In this paper we use analytical models presented in the literature for saturation throughput, average packet delay and packet drop probability and simulative results for jitter to evaluate voice traffic over WLANs. We propose a methodology that determines the voice capacity of WLANs and we examine the effect of packetization interval and transmission rate on voice capacity using G. 711 codec. Analytical results for voice capacity match simulative results presented in the literature using extensive simulations.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Voice capacity analysis of IEEE 802.11 Wireless LANs supporting VoIP",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=7473019827870967193&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identifying potentially flawed items in the context of small sample IRT analysis",
            "Publication year": 2011,
            "Publication url": "http://repository.uwl.ac.uk/id/eprint/446/",
            "Abstract": "Although Classical Test Theory has been used by the measurement community for almost a century, Item Response Theory has become commonplace for educational assessment development, evaluation and refinement in recent decades. Its potential for improving test items as well as eliminating the ambiguous or misleading ones is substantial. However, in order to estimate its parameters and produce reliable results, IRT requires a large sample size of examinees, thus limiting its use to large-scale testing programs. Nevertheless, the accuracy of parameter estimates becomes of lesser importance when trying to detect items whose parameters exceed a threshold value. Under this consideration, the present study investigates the application of IRT-based assessment evaluation to small sample sizes through a series of simulations. Additionally, it introduces a set of quality indices, which exhibit the success rate of identifying potentially flawed items in a way that test developers without a significant statistical background can easily comprehend and utilize.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:RHpTSmoSYBkC",
            "Publisher": "IARIA"
        },
        {
            "Title": "X-EDCA: A cross-layer MAC-centric mechanism for efficient multimedia transmission in congested IEEE 802.11 e infrastructure networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5982796/",
            "Abstract": "IEEE 802.11e is the indisputable standard for supporting multimedia traffic in modern Wireless Local Area Networks. However, it has been proven incapable of handling efficiently multimedia flows in congested networks. The main reason for this suboptimal behavior roots from the static nature of resource allocation specified in IEEE 802.11e. Dynamic tuning of the MAC parameters has demonstrated a beneficial performance in terms of application efficiency. Nevertheless, it is of great importance that this adaptation takes place by considering the multimedia traffic characteristics. In this paper, a cross-layer MAC-centric mechanism is introduced, under the name X-EDCA. The mechanism is designed to cope with high load situations in IEEE 802.11e wireless infrastructure networks by selectively prioritizing and protecting sensitive multimedia frames. The proposed scheme is evaluated and its effectiveness is proven by …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Artemis: protection from sexual exploitation attacks via SMS",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6377361/",
            "Abstract": "The increasing adoption of mobile communication through SMS (Short Message Service) messages by young people, has attracted pedophiles to perform sexual exploitation attacks. Artemis is an Android application that aims to protect minors by recognizing such attacks using advanced classification techniques. In case of high exploitation risk, a warning signal is sent to the designated parent who is responsible for further actions. The implementation results reveal sufficient and transparent operation of the application along with a significant reduction of the amount of transmitted traffic for application specific messages.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation and Enhancement of the Actionability of Publicly Available Cyber Threat Information in Digital Forensics",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9527934/",
            "Abstract": "Cyber threat information can be utilized to investigate incidents by leveraging threat-related knowledge from prior incidents with digital forensic techniques and tools. However, the actionability of cyber threat information in digital forensics has not yet been evaluated. Such evaluation is important to ascertain that cyber threat information is as actionable as it can be and to reveal areas of improvement. In this study, a dataset of cyber threat information products was created from well-known cyber threat information sources and its actionability in digital forensics was evaluated. The evaluation results showed a high level of cyber threat information actionability that still needs enhancements in supporting some widely present types of attacks. To further enhance the provision of actionable cyber threat information, the development of the new TREVItoSTIX Autopsy module is presented. TREVItoSTIX allows the expression of …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "H προστασία των προσωπικών δεδοµένων ενóψει της εφαρµογής της νέας τεχνολογίας της ταυτοποίησης µε ραδιοσυχνóτητες (RFID): Νοµική και τεχνολογική προσέγγιση",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Determining User Authorizations in Distributed Database Systems",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/49896488/Determining_User_Authorizations_in_Distr20161026-30736-19ukbl8.pdf",
            "Abstract": "In this paper, a differentiated authorisation mechanism is described, which is based on the user location control process, and exploits the interconnection between the hierarchies of user roles, data sets and user locations. User authorizations defined in this way permit the specification of different access rights depending on the set of user locations that may change dynamically. A static algorithm is presented that could be used for determining all location-dependent authorization rules in every administrative domain. It results however in a big number of entries. To overcome this problem, an alternative dynamic algorithm is proposed, which uses the authorization rules that are derived from a minimum number of initial entries. This dynamic approach results to a significant reduction of the required storage space for security metadata, a feature that is particularly useful when the resources of hosts are scarce, as for example in mobile computing environments.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Methodological Approach for Database Access Control Engineering",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Προγραμματισμός στο διαδίκτυο",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1028",
            "Abstract": "Βασικές και προαπαιτούμενες γνώσεις σε προγραμματισμό και πρωτόκολλα διαδικτυακών εφαρμογών, προκειμένου ο αναγνώστης να μπορεί να αντιληφθεί σε βάθος τα προβλήματα ασφάλειας που ανακύπτουν. Καλύπτονται οι κυριότερες τεχνολογίες εφαρμογών διαδικτύου (Javascript, jquery, css, html κ.ά.) καθώς και προγραμματιστικές τεχνικές που σήμερα εφαρμόζονται (php, asp κ.ά.).",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:eJXPG6dFmWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reasons for consuming in a workplace canteen, factors affecting meal choice, and the perceived value of additional information on workplace canteen meals",
            "Publication year": 2016,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-nutrition-society/article/reasons-for-consuming-in-a-workplace-canteen-factors-affecting-meal-choice-and-the-perceived-value-of-additional-information-on-workplace-canteen-meals/B05EE271C614CD4297B1C18791B8BAF4",
            "Abstract": "//static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS0029665116002408/resource/name/firstPage-S0029665116002408a.jpg",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:P5F9QuxV20EC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Ευελιξία της εργασίας και μερική απασχόληση: η ελληνική περίπτωση",
            "Publication year": 2018,
            "Publication url": "http://ejournals.lib.auth.gr/XVLaw/article/viewFile/6764/6519",
            "Abstract": "Ορισμός Μερική απασχόληση είναι η παροχή εργασίας σε χρόνο μικρότερο από τον κανονικό βάσει μιας συγκεκριμένης χρονικής μονάδας υπολογισμού (ημέρα, εβδομάδα, μήνας) με ανάλογα μειωμένες αποδοχές5. Από τον ως άνω ορισμό προκύπτει ένα θεμελιώδες εννοιολογικό στοιχείο της μερικής απασχολήσεως: η ποσοτική απόκλιση όσον αφορά το χρόνο εργασίας σε σχέση με το πλήρες (κανονικό) ωράριο. Εγείρεται λοιπόν εν συνεχεία το ερώτημα: ποιο είναι το πλήρες ωράριο; Πλήρες είναι το ωράριο (άρα πλήρης και η απασχόληση) όταν ο εργαζόμενος παρέχει εργασία σε χρόνο που εξαντλεί τα ανώτατα νόμιμα χρονικά όρια εργασίας. Φερειπείν, η ΥΑ 16182/1983 ορίζει ότι στις βιομηχανίες η πενθήμερη εβδομαδιαία εργασία δε ξεπερνά τις 40 ώρες. Άρα πλήρης για τους εργαζομένους σε βιομηχανίες θεωρείται το 40ωρο, ενώ οποιοδήποτε ωράριο το οποίο υπολείπεται αυτού, θεωρείται μερική απασχόληση. Η μερική λοιπόν απασχόληση είναι έννοια παντελώς εξαρτημένη από αυτήν της πλήρους απασχολήσεως, εφόσον όποιο ωράριο δεν εμπίπτει στην πλήρη, θεωρείται ότι θεμελιώνει μερική απασχόληση.Απαραίτητο είναι συνεπώς για τη διάγνωση του χαρακτήρα μίας συμβάσεως εργασίας ως πλήρους ή μερικής απασχολήσεως, η ανεύρεση του κανονικού ωραρίου εργασίας. Παρ’όλ’αυτά, καθίσταται εύληπτο στον καθένα, ότι δε νοείται για όλους τους εργαζομένους να ισχύει το ίδιο ωράριο, καθώς αυτό διαφοροποιείται ανάλογα με τις ιδιαιτερότητες και τις ανάγκες της εκάστοτε κατηγορίας εργασίας. Λόγου χάρη, διαφορετικό ωράριο ισχύει στους οδηγούς λεωφορείων, διαφορετικό στους ιατρούς εργαζόμενους σε κλινικές και διαφορετικό εν τέλει στις καθαρίστριες …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information and Security Systems Laboratory",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/525",
            "Abstract": "Διαδραστικές (τύπου hands-on ή demonstration) εργαστηριακές ασκήσεις με σκοπό την εφαρμογή από τον αναγνώστη των γνώσεων που αποκτά κατά τη μελέτη του κύριου συγγράμματος για το μάθημα Ασφάλεια Πληροφοριών και Συστημάτων. Ο φοιτητής θα μπορεί:(α) να βοηθηθεί στην πρακτική εφαρμογή των θεμελιωδών εννοιών και ζητημάτων της ασφάλειας πληροφοριών και συστημάτων,(β) να δεί στην πράξη την εφαρμογή όσων έχει αφομοιώσει μελετώντας το σχετικό θεωρητικό υπόβαθρο, όπως π. χ. οι πολιτικές και τα μοντέλα ασφάλειας,(γ) να αποκτήσει γνώσεις και εμπειρίες πάνω στις βασικές τεχνικές προστασίας και τις νέες κατευθύνσεις ανάπτυξης ασφαλών πληροφοριακών συστημάτων. Πέρα από το πρώτο κεφάλαιο, που αφορά την κατάλληλη προετοιμασία του εργαστηρίου, παρατίθενται δώδεκα (12) κεφάλαια, ένα για κάθε εργαστηριακό μάθημα.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An authentication architecture for healthcare information systems",
            "Publication year": 2002,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/146045820200800406",
            "Abstract": "The medical community is moving towards an environment where automated patient medical records and electronically interconnected healthcare facilities are prevalent. The primary reason is that the electronic healthcare record, coupled with the electronic networking of hospitals, can provide healthcare organizations with more efficient, seamless service, resulting in higher quality care and reduced costs. The information contained in electronic records is an important and valuable asset of a healthcare organization. Thus, it needs to be protected to ensure its confidentiality, integrity and availability. A critical point in security is to set up efficient and flexible access control policies and procedures for protecting information. However, user authentication remains a prerequisite for really secure information services especially in distributed systems. In this paper, an authentication architecture for healthcare environments …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:Zph67rFs4hoC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Towards differentiated utilization of attribute mutability for access control in ubiquitous computing",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600455/",
            "Abstract": "The operational characteristics of ubiquitous computing environments (UbiCom) generate new access control requirements which existing classical access control models fail to support efficiently. However, the Usage Control (UCON) family of models introduces components and mechanisms that seem to be able to partially match the specific requirements imposed by UbiCom environments. In this paper, an evaluation of current access control models based on a brief study of UbiCom access control requirements is presented. Then, a new access control approach that extends UCON towards a differentiated utilization of attribute mutability for easiness of administration, better performance and lower operational cost in UbiCom environments is proposed.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "D4I-Digital Forensics Framework for Investigating Cyber Attacks in Industrie 4.0",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=12057658229147839898&hl=en&oi=scholarr",
            "Abstract": "Many companies have cited lack of cyber-security as the main barrier to Industrie 4.0 or digitalization. Security functions include protection, detection, response and investigation. Cyber-attack investigation is important as it can support the mitigation of damages and maturing future prevention approaches. Nowadays, the investigation of cyber-attacks has evolved more than ever leveraging combinations of intelligent tools and digital forensics processes. Intelligent tools (such as YARA rules, and Indicators of Compromise) are effective only when there is prior knowledge about software and mechanisms used in the cyber-attack, ie, they are not attack-agnostic. Therefore, the effectiveness of these intelligent tools is inversely proportional to the number of the never-seen-before software and mechanisms utilized. Digital forensic processes, while not suffering from such issue, lack the ability to provide in-depth support to a …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Managing IT risk in the agriculture sector through automated security metrics",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=17399854411261942916&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Defining adaptive e-Learning courses in Semantic Web",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Mavridis-2/publication/27384724_Defining_adaptive_e-Learning_courses_in_Semantic_Web/links/5507496a0cf27e990e05991d/Defining-adaptive-e-Learning-courses-in-Semantic-Web.pdf",
            "Abstract": "Current e-Learning systems are usually based on the Web. However, driven by the current demands for lifelong learning, the offer of reliable, certified and adaptable to the trainee’s profile knowledge is acquired. Emerging technologies of the Semantic Web can subscribe to the satisfaction of these requirements. In this paper a functional framework that fully guides the automated combination and sharing of e-Learning material in order to define adaptive and personalized courses is proposed. Some of its main advantages are the incorporation of recent technologies of the Semantic Web borrowed from other researching fields, flexibility on the implementation of e-Learning systems based on it, adoption of newly proposed standards, as well as handling personalized, certified course, from which, depending on their evaluation, may derive a template available for future use in analogous cases.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ιδεατά Προσωπικά Δίκτυα-VPN",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1034",
            "Abstract": "Ζητήματα και μέθοδοι εξασφάλισης των βασικών ιδιοτήτων ασφάλειας πληροφοριών πάνω από ένα κοινό κανάλι επικοινωνίας. Ολοκλήρωση των γνώσεων από τα προηγούμενα κεφάλαια με τη μελέτη πρωτοκόλλων ασφάλειας για ασφαλή επικοινωνία μέσω διαδικτύου σε επίπεδο δικτύου. Ακόμη, θα παρουσιαστεί αναλυτικά το πρωτόκολλο ασφαλούς επικοινωνίας σε επίπεδο δικτύου: IPsec. Θα γίνει αναλυτική περιγραφή και μελέτη της λειτουργίας του με πραγματικά σενάρια εφαρμογής. Ενδεικτικά θα περιέχονται Virtual Private networks, Private Connections over Public Networks, IPSEC, LAN to LAN VPNs, Remote access VPNs, κ. ά.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ιδιωτικότητα στο Διαδίκτυο και Κυβερνοέγκλημα",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1037",
            "Abstract": "Περιγραφή των ζητημάτων και τρόποι αντιμετώπισης περιστατικών επιθέσεων που πραγματοποιούνται με τη χρήση ηλεκτρονικών μορφών επικοινωνίας. Κατηγοριοποίηση επιθέσεων (π.χ. Grooming, Cyberbullying-Cyberstalking, έκθεση ανηλίκου σε ακατάλληλο περιεχόμενο, κ.ά.) και μελέτη χαρακτηριστικών τους. Αναλυτική περιγραφή μεθόδων και τακτικών για τον εντοπισμό και κακοποίηση των θυμάτων κι οι επιπτώσεις που προκαλούν στα θύματα. Παρουσίαση τεχνικών επεξεργασίας κειμένου διαλόγων. Στη βάση πραγματικών σεναρίων θα γίνει ανάλυση διαλόγων με τη χρήση ειδικών εργαλείων και υπολογισμός επικινδυνότητας σε πραγματικό χρόνο.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Σύγχρονοι Κρυπτογραφικοί Αλγόριθμοι",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1031",
            "Abstract": "Αναλυτική παρουσίαση των κυριότερων κρυπτογραφικών αλγορίθμων συμμετρικής (π.χ. DES, AES κλπ) και ασύμμετρης κρυπτογραφίας (π.χ. RSA, ElGamal κλπ), των τρόπων λειτουργίας τους και των ζητημάτων ανθεκτικότητάς τους με την εξέταση κατάλληλων κρυπταναλυτικών τεχνικών. Ακόμη, θα συζητηθούν ζητήματα διαχείρισης κλειδιών και γενικότερης λειτουργικότητας.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the definition of access control requirements for grid and cloud computing systems",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11733-6_3",
            "Abstract": "The emergence of grid and cloud computing systems has introduced new security concepts, so it requires new access control approaches. Traditional systems engineering processes can be enriched with helper approaches that can facilitate the definition of access control requirements in such complex environments. Looking towards a holistic approach on the definition of access control requirements, we propose a four-layer conceptual categorization. In addition, an example is given so that to demonstrate the utilization of the proposed categorization in a grid scenario for defining access control requirements, and evaluate their fulfilment vis-à-vis contemporary employed access control approaches.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards new access control models for cloud computing systems",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=14669403348549777079&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conceptual framework for developing cyber security serious games",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8725061/",
            "Abstract": "Cyber security education is an emerging field facing many challenges, while demand in skilled cyber security personnel is rising. Serious games and game-based learning approaches constitute a promising opportunity for learning and training in cyber security. However, as game-based learning is a new field, cyber security game-based approaches lack common methodologies and design standards that will provide useful interpretations of the possibilities of such approaches. In this light, we present the Conceptual Framework for e-Learning and Training (COFELET), a framework for the design and implementation of cyber security serious games. The COFELET framework promotes game-based approaches that envisage the improvement of cyber security education pedagogical effectiveness by embracing modern learning theories and innovative teaching approaches. Moreover, the COFELET framework …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A paradigm for dynamic and decentralized administration of access control in workflow applications",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-33406-8_17",
            "Abstract": "The administration of authorizations in modern Web-based computing environments has become a primary concern. Application security is characterized by a significant complexity, due to the large number of variations and combinations of objects and operations to be protected. Thus, there is a need for data, processes and context parameters, like time and location, to be combined into a security model that ensures correct decision-making for access. Moreover, access control must often be based on dynamic functional requirements that are capable of embedding the required context information to express application-level access control policies in new application domains, as for example Internet workflow applications. In this work a new paradigm of dynamic and decentralized administration of access control that is based on the DARBAC model is presented. DARBAC concerns access control for a wide …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "A Learner-centered Semantic Web-based Architecture.",
            "Publication year": 2007,
            "Publication url": "https://www.scitepress.org/Papers/2007/12912/12912.pdf",
            "Abstract": "In this paper the architecture of a learner-centered e-Learning system, which aims to qualify and recommend learning material using semantic web technologies, is presented. In the proposed approach, the learner has a central role in the decision-making process of the distribution of learning material. The main idea relies on gathering appropriate reputation metadata from the learning material consumers. As a result of a proper material ranking, a better matching to future searches of learners having similar profile is anticipated. An experimental implementation of the presented architecture provided interesting results that better depict the applicability and usefulness of the proposals.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Contextualized Filtering for Shared Cyber Threat Information",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1424-8220/21/14/4890",
            "Abstract": "Cyber threat information sharing is an imperative process towards achieving collaborative security, but it poses several challenges. One crucial challenge is the plethora of shared threat information. Therefore, there is a need to advance filtering of such information. While the state-of-the-art in filtering relies primarily on keyword- and domain-based searching, these approaches require sizable human involvement and rarely available domain expertise. Recent research revealed the need for harvesting of business information to fill the gap in filtering, albeit it resulted in providing coarse-grained filtering based on the utilization of such information. This paper presents a novel contextualized filtering approach that exploits standardized and multi-level contextual information of business processes. The contextual information describes the conditions under which a given threat information is actionable from an organization perspective. Therefore, it can automate filtering by measuring the equivalence between the context of the shared threat information and the context of the consuming organization. The paper directly contributes to filtering challenge and indirectly to automated customized threat information sharing. Moreover, the paper proposes the architecture of a cyber threat information sharing ecosystem that operates according to the proposed filtering approach and defines the characteristics that are advantageous to filtering approaches. Implementation of the proposed approach can support compliance with the Special Publication 800-150 of the National Institute of Standards and Technology.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:j8SEvjWlNXcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A Virtual Reality and Web-Based Application for the Simulation of the Cellular Structure of Human Liver with 3D Surface Deformation",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting multimedia frame semantics and MAC-layer enhancements for QoS provisioning in IEEE 802.11 e congested networks",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.225.9951&rep=rep1&type=pdf#page=185",
            "Abstract": "Wireless Local Area Networks (WLANs) supporting modern streaming multimedia applications constitute a very challenging and rapidly changing field of research. Towards implementing effective multimedia wireless networks, the IEEE has published the “state of the art” IEEE 802.11 e standard, which introduced a QoS-aware MAC-layer along with a series of efficiency enhancements. However, it has been proven inadequate in handling multimedia traffic optimally in periods of congestion. For the efficient support of multimedia applications in high load situations, numerous mechanisms have emerged, most of them focusing on altering the static nature of resource allocation specified in IEEE 802.11 e. Nevertheless, traffic characteristics must be taken into consideration in order to achieve the highest gains. In this paper, an application-aware MAC-layer mechanism is developed that exploits multimedia frame semantics and existing MAC-layer enhancements to adequately cope with high congestion situations in IEEE 802.11 e infrastructure networks. The proposed algorithm makes use of existing acknowledgment policies and adaptive resource allocation techniques depending on multimedia frame significance. The effectiveness of the algorithm is proven by means of simulations, where its functionality is evaluated and compared with other existing schemes.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Κακόβουλο λογισμικό: δυναμική ανάλυση",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/bitstream/11419/535/1/05_chapter_10.pdf",
            "Abstract": "Παρουσίαση με επίδειξη (demonstration), λόγω αυξημένης επικινδυνότητας, τεχνικών δυναμικής ανάλυσης, όπως: Επίβλεψη διεργασιών, Σύγκριση μητρώου, Καταγραφή δικτυακής κίνησης, κ.ά.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards use-based usage control",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30436-1_53",
            "Abstract": "In this paper, a new Use-based usage CONtrol (UseCON) approach that supports recording of usages with the help of a new entity, named use, is presented. Uses provide information for the latest state (requested, active, denied, completed or terminated) of every usage and facilitate the fine-grained definition and proper association of attributes to various system entities. The proposed approach provides enhanced contextual information modeling, support of complicated access modes and an alternative approach in obligations modeling. Moreover, UseCON is characterized by high expressiveness and ability to define policy rules in almost natural language.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:k_IJM867U9cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Ασφάλεια πληροφοριακών συστημάτων και συστημάτων βάσεων δεδομένων σε περιβάλλον mobile computing",
            "Publication year": 2000,
            "Publication url": "https://www.didaktorika.gr/eadd/handle/10442/25608",
            "Abstract": "Ασφάλεια πληροφοριακών συστημάτων και συστημάτων βάσεων δεδομένων σε περιβάλλον \nmobile computing Αναζητήστε Σύνθετη Αναζήτηση no Αρχική no Πλοήγηση Επιστημονικό πεδίο \nΗμερομηνία Συγγραφέας Χώρα Γλώσσα Ίδρυμα no Ανοικτά Δεδομένα no Σχετικά με το ΕΑΔΔ \nno Κατάθεση Διατριβής no Συχνές Ερωτήσεις no Κέντρο Υποστήριξης Χρηστών no Επικοινωνία \nΕίσοδος Εγγραφή / Ξέχασα τον κωδικό Ασφάλεια πληροφοριακών συστημάτων και συστημάτων \nβάσεων δεδομένων σε περιβάλλον mobile computing Διαβάστε τη διατριβή (Online) Κατεβάστε \nτη διατριβή σε μορφή PDF (75.83 MB) (Η υπηρεσία είναι διαθέσιμη μετά από δωρεάν εγγραφή) \nOnline παραγγελία της διατριβής (σε έντυπη ή ψηφιακή μορφή) (Η υπηρεσία είναι διαθέσιμη \nμετά από δωρεάν εγγραφή) Πρέπει να είστε εγγεγραμένος χρήστης για έχετε πρόσβαση σε \nόλες τις υπηρεσίες του ΕΑΔΔ Είσοδος /Εγγραφή Όλα τα τεκμήρια στο ΕΑΔΔ από . http:/…",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identifying Inference Rules for Automatic Metadata Generation from Pre-existing Metadata of Related Resources",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-77745-0_15",
            "Abstract": "Manual indexing of learning resources according to metadata standards is a laborious task. The introduction of automatic metadata generation methods is a developing research field with diverse approaches, which appears as an option having the advantage of the economy of work for not having to manually create metadata. In this paper, a methodology for automatic generation of metadata which exploits relations between resources to be described is introduced and examples and empirical data on the application of the methodology to the LOM (Learning Object Metadata) standard are presented. The methodology comprises the execution of consecutive steps of actions aiming at identifying inference rules for automatic generation of a resource's metadata based on pre-existing metadata of its related resources.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "National Cybersecurity Strategy: A Conceptual Framework for Greece",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Important information for the selection of workplace canteen meals: A consumer segmentation study",
            "Publication year": 2016,
            "Publication url": "https://microsites.bournemouth.ac.uk/foodsmart/files/2017/03/FoodSmartNutSocposter2016.pdf",
            "Abstract": "The provision of nutritional information has been associated with improved intakes and dietary profiles (1, 2), but in a workplace canteen, consumers typically have very little information on the foods they are eating (3). Any provided information is also more likely to be used and valued, if consumers consider it to be relevant to them (2, 3).",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing a Public Key Infrastructure for a secure regional e-Health environment",
            "Publication year": 2002,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0038-1634371",
            "Abstract": " Objectives: Internet technologies provide an attractive infrastructure for efficient and low cost communications in regional health information networks. The advantages provided by the Internet come however with a significantly greater element of risk to the confidentiality and integrity of information. This is because the Internet has been designed primarily to optimize information sharing and interoperability, not security. The main objective of this paper is to propose the exploitation of public-key cryptography techniques to provide adequate security to enable secure healthcare Internet applications. Methods: Public-key cryptography techniques can provide the needed security infrastructure in regional health networks. In the regional health-care security framework presented in this paper, we propose the use of state-of-art Public Key Infrastructure (PKI) technology. Such an e-Health PKI consists of regional …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:2osOgNQ5qMEC",
            "Publisher": "Schattauer GmbH"
        },
        {
            "Title": "Towards dynamically administered role-based access control",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1232072/",
            "Abstract": "In digital business, the need for efficient frameworks to address the multifaceted security issues related to Web-based applications, has led to efforts towards the development of dynamically administered access control systems that implement robust access control models, to allow controlled access of information based on content or context of processing, and secure interoperation in a dynamic distributed enterprise environment. Pure RBAC seems to be suitable for function-oriented organization structures usually used in relatively stable environments. On the other hand, TBAC and TMAC provide a complementary support in environments that are based on process-oriented organization structures. However, current organizational alternatives lead to the combination of the above approaches, in the form of a matrix organization structure that maximizes the advantages of functional and process-oriented structures …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Περιφερειακή Πρόβλεψη Ηλιακής Και Αιολικής Ισχύος Στην Κρήτη",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=4226659632175876200&hl=en&oi=scholarr",
            "Abstract": "Τις τελευταίες δεκαετίες έχει παρατηρηθεί σημαντική ανάπτυξη στην τεχνολογία των ανανεώσιμων πηγών ενέργειας (ΑΠΕ), καθώς και στο βαθμό διείσδυσής τους στην παραγωγή ηλεκτρικής ενέργειας, με σκοπό τον περιορισμό της χρήσης συμβατικών πηγών και της ρύπανσης του περιβάλλοντος. Η ηλιακή και η αιολική ενέργεια είναι οι ευρύτερα χρησιμοποιούμενες εναλλακτικές μορφές ενέργειας, κάτι που επιβεβαιώνεται από τη διαρκή αύξηση της εγκατεστημένης τους ισχύος σε Ελλάδα και Ευρώπη, αλλά και παγκοσμίως. Ωστόσο, η διακοπτόμενη φύση και η έντονη μεταβλητότητα της ηλιακής και αιολικής παραγωγής καθιστούν δύσκολη την ενσωμάτωσή τους στα συστήματα ηλεκτρικής ενέργειας. Επομένως, η πρόβλεψη της ισχύος τους κρίνεται ως ένα ιδιαίτερα σημαντικό εργαλείο για τη διαχείριση και την ενσωμάτωσή τους στο δίκτυο. Στο πλαίσιο αυτό, έχει καταβληθεί ιδιαίτερη προσπάθεια για την ανάπτυξη μοντέλων πρόβλεψης και για τα δύο είδη ισχύος, απασχολώντας έντονα πολλούς επιστημονικούς κλάδους.Η πλειοψηφία των μοντέλων πρόβλεψης ισχύος δέχονται ως είσοδο δεδομένα από μοντέλα αριθμητικών προβλέψεων καιρού, τα οποία παρέχουν εκτιμήσεις για τις μελλοντικές τιμές των καιρικών μεταβλητών στο επίπεδο του ηλιακού ή αιολικού πάρκου. Αντίστοιχα, στην έξοδό τους εξάγουν προβλέψεις της ηλιακής ή της αιολικής παραγωγής για δεδομένο χρονικό ορίζοντα. Ωστόσο, δεδομένου ότι συνήθως η περιοχή ενδιαφέροντος σε ένα μοντέλο είναι μια ευρύτερη περιφέρεια και όχι ένα μεμονωμένο πάρκο, επιχειρείται η πραγματοποίηση προβλέψεων για όλα τα πάρκα της περιφέρειας συνδυαστικά. Με τον τρόπο αυτό, προκύπτει η περιφερειακή …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards an automated recognition system for chat-based social engineering attacks in enterprise environments",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3230833.3233277",
            "Abstract": "Increase in usage of electronic communication tools (email, IM, Skype, etc.) in enterprise environments has created new attack vectors for social engineers. Billions of people are now using electronic equipment in their everyday workflow which means billions of potential victims of Social Engineering (SE) attacks. Human is considered the weakest link in cybersecurity chain and breaking this defense is nowadays the most accessible route for malicious internal and external users. While several methods of protection have already been proposed and applied, none of these focuses on chat-based SE attacks while at the same time automation in the field is still missing. Social engineering is a complex phenomenon that requires interdisciplinary research combining technology, psychology, and linguistics. Attackers treat human personality traits as vulnerabilities and use the language as their weapon to deceive …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Προετοιμασία εργαστηρίου",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/526",
            "Abstract": "Εισαγωγή του αναγνώστη στη δομή και τη σημειολογία του οδηγού, καθώς και στις απαιτήσεις και τον τρόπο υλοποίησης των εργαστηριακών ασκήσεων (hands-on). Επιπλέον, θα υπάρχει οδηγός για την εγκατάσταση του απαιτούμενου ειδικού λογισμικού σε ιδιόκτητο υπολογιστή ή σε υπολογιστική πλατφόρμα, όπως o Okeanos. Ο οδηγός θα περιλαμβάνει όλα τα απαραίτητα (και πολυμεσικά) βοηθήματα έτσι ώστε ο φοιτητής να δημιουργήσει το περιβάλλον στο οποίο θα εργαστεί κατά τη διάρκεια των εργαστηριακών ασκήσεων που αναπτύσσονται στα επόμενα κεφάλαια.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Έλεγχος πρόσβασης με Firewall",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/538",
            "Abstract": "Εισαγωγή σε βασικές έννοιες αναxωμάτων ασφάλειας (φιλτράρισμα πακέτων, stateless/ stateful filtering, NAT). Διαμόρφωση κατάλληλης αρχιτεκτονικής αναχώματος ασφάλειας. Καθορισμός ενδεικτικών πολιτικών ελέγχου πρόσβασης. Υλοποίηση πολιτικών ελέγχου πρόσβασης σε firewall. Εγκατάσταση και ρύθμιση αναχώματος ασφάλειας iptables σε περιβάλλον GNU/Linux.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards risk based prevention of grooming attacks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5741645/",
            "Abstract": "The increasing incidents of children sexual exploitation through cyberspace demand for proper protection with technological defense mechanisms. This paper aims to present and evaluate methods and tools that are appropriate towards the prevention of child sexual abuse through Internet based communications. Attacking categories and strategies that predators follow are analyzed and modeled. Moreover, a comparative review of existing risk modeling methods, which is based on a set of proposed criteria, is presented. This comparison results in the conclusion that only two of the reviewed risk modeling methods can be adapted on the intended grooming attack detection system: Bayesian and Markovian. The proposed approach is concluded with a discussion on particular methods and tools for accurate attack probability calculation.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Programming a view-based active access-control system for healthcare environments",
            "Publication year": 2002,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/146045820200800405",
            "Abstract": "Modern healthcare information systems need active security mechanisms that are capable of controlling access to medical data, according to the current need-to-know requirements of users. An access-control model that fits the above requirements is the already known C-TMAC (Context-based Team Access Control) model, which incorporates active security features and provides tight and just-in-time management of user permissions. In this paper, an implementation approach of an access control system that is based on the C-TMAC model is proposed. To further enforce fine-grained access control, we adopt view-based protection that permits the use of flexible granularities to define the objects to be protected. For this purpose, a simple case in a healthcare environment is assumed and a detailed description of setting up the corresponding access rules in a view-based fashion is presented. An implementation …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:kNdYIx-mwKoC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Διαχείριση Ασφάλειας",
            "Publication year": 2015,
            "Publication url": "https://repository-web.kallipos.gr/handle/11419/1035",
            "Abstract": "Βασικοί ορισμοί, μέθοδοι και πρόσφατες προσεγγίσεις. Συστήματα αξιολόγησης ευπαθειών (ποσοτικά, ποιοτικά, υβριδικά). Αυτοματοποιημένη διαχείριση ασφάλειας στη βάση προτύπων.Υπολογισμός σπουδαιότητας ευπαθειών βάση μεθόδου (π.χ. CVSS). Ολιστική προσέγγιση με βάση το πρότυπο GRC. Αναγνώριση παραγόντων που συνθέτουν το πρότυπο GRC",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ανάλυση και Διαχείριση Επικινδυνότητας",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/536",
            "Abstract": "Στη βάση ενός σεναρίου εφαρμογής, θα επιδιωχθεί η ολοκλήρωση σημαντικού μέρους των μέχρι τώρα γνώσεων με την ανάλυση επικινδυνότητας (risk analysis) ενός ενδεικτικού πληροφοριακού συστήματος (ΠΣ), την αποτίμησή της με τη βοήθεια ενός ειδικού εργαλείου (π.χ. MSAT), τον καθορισμό απαιτήσεων ασφάλειας  ΠΣ, τη διαμόρφωση κατάλληλων πολιτικών ασφάλειας και την υλοποίηση μέρους αυτών με τη βοήθεια του λειτουργικού συστήματος Windows.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context-based humanized and authorized personalization in mobile commerce applications",
            "Publication year": 2005,
            "Publication url": "http://www.ijcis.info/international%20journal%20of%20computing%20and%20information%20sciences_files/SP_IWSAC/SPW1_9.pdf",
            "Abstract": "Given the existing limitations and advantages on the mobile Internet, the preferences of users for mobile commerce content and services are noticeably affected. Context-awareness of mobile devices emphasizes the importance of personalization technology. Personalization is more and more used as a way to accelerate the delivery of information to each user, making the site convenient and attractive to return to. A promising approach to maintain different (personalized) permissions for different users is to examine personalization considerations along with adequate security and privacy mechanisms (authorized personalization). We focus on how the various customization and authorization concepts influence specific user interface design elements, namely content, presentation, connection, communication, community and commerce. Adapting an appropriate context-sensitive model for authorizations, the overall …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context and role based hybrid access control for collaborative environments",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.16.277&rep=rep1&type=pdf",
            "Abstract": "Role-based mechanisms usually provide a sufficient way to establish access control in most information systems. Passive security permission assignment cannot however support efficiently the dynamic aspects of many modern information systems. Health Care information systems provide a good example of such an environment. In dynamically changing clinical workflow environments there is a need for active security permission activation. In order to address this problem we propose to utilize the concept of a clinical task, together with a number of factors that characterize clinical activities for particular patient cases. The specific values of those factors form a context that could identify particular clinical tasks. In every clinical task a number of users might be involved that collaborate for taking care of a particular patient. However, the assignment of a number of different contexts to each one user usually causes a significant administrative overhead. This could be eliminated by using the team concept in a similar way as roles. The participation of particular users in teams is based on their assigned roles already defined. The role-based permission set of a particular user is a combination of the permissions of all the roles activated by the users participating in the same team. The final permission set of the user is derived by applying the team context in order to filter the role-based permission set and let only the tuples of particular patients to be accessed during the execution of his task. Our approach is implemented as an extension to our existing eMEDAC security policy we have developed and implemented already for use in health care environments.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic web technologies anchored in learning styles as catalysts towards personalising the learning process",
            "Publication year": 2011,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJLIC.2011.039446",
            "Abstract": "The evolution of telecommunications, information and multimedia technologies compel for the design of platforms that support the e-learning processes in a multimodal variety. These platforms benefit from the web resources to enhance their courses. However, the structure of the web is labyrinthine and the facilitation of the learner to the personalised content retrieval in these complex information environments is of great significance. This paper submits a method emerging from the semantic web technologies, such as metadata and ontologies, which is embedded in a constructivist socio-psycho-pedagogical model. The method personalises material based on the alignment of properties of the learning resources and the profile of the e-learners, as derived from their learning style in conjunction with other personality and demographic characteristics. An application is described using an experimental case that …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:UebtZRa9Y70C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Food information presentation: consumer preferences when eating out",
            "Publication year": 2019,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/BFJ-09-2018-0605/full/html",
            "Abstract": "Advances have been made in the provision of nutritional and ingredient information on packaged food, however, there is a need to translate this to eating out reflecting consumer desire for greater transparency and knowledge of menu content. The purpose of this paper is to assess consumer’s preferences for food information presentation in four European countries (UK, Greece, Denmark and France) in a workplace dining setting.This study focusses on workplace canteens since the regularity in which they are used provides an important context and potential for behaviour change. An exploratory phase designed iteratively in collaboration with experts, end-users and researchers (qualitative) informed a survey (quantitative) conducted in four European countries. The survey was used to examine workplace diners’ preferences towards food information presentation …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:vRqMK49ujn8C",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Grid access control models and architectures",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/computational-data-grids/58746",
            "Abstract": "In recent years, grid computing has become the focal point of science and enterprise computer environments. Access control in grid computing systems is an active research area given the challenges and complex applications. First, a number of concepts and terminology related to the area of grid access control are provided. Next, an analysis of the Role Based Access Control (RBAC) and Usage Control ABC (UCONABC) models is given, due to their adaption from the grid computing systems. Additionally, a presentation of well known grid access control architectures illustrates how the theoretical access control models are implemented into mechanisms. In a comparative review of the examined access control models and mechanisms, their pros and cons are exposed. Apart from the mapping of the access control area in grid computer systems, the given comparison renders valuable information for further …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:IWHjjKOFINEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "How e-learning systems may benefit from ontologies and recommendation methods to efficiently personalise resources",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJKL.2009.031229",
            "Abstract": "Knowledge management systems suffer from the efficient management of the information they maintain. Current e-learning systems, is an application of a progressively more complex information domain, as they increasingly enhance their courses with the variety of web based resources to meet the educational needs of their participants. Thus, they face the problem of managing and personalising this knowledge. To confront this problem they already benefited from the semantic web technologies. Ontologies, a cardinal asset towards augmenting the interoperability among web applications, anticipate the accuracy of the retrieved data by means of effective matching of the user requirements. In this paper ontologies are explored to personalising resources. The framework of an e-learning system is described and a methodology is proposed applying recommendation algorithms. Personalisation is achieved via …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:LkGwnXOMwfcC",
            "Publisher": "Inderscience Enterprises Ltd"
        },
        {
            "Title": "Performance Measurements of a Wireless Classroom in a Simulated Environment",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards Colored Petri Net Modeling of Expanded C-TMAC",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33448-1_13",
            "Abstract": "Today advancements in information technology have led to multi-user information systems of high complexity, where users can group, collaborate and share resources. The variety of such systems include a wide range of applications such as collaborative document sharing and editing, social networks, work flow management systems, mobile location based applications etc. As those systems continue to evolve, additional requirements arise which need to be met, such as context inclusion in access control decision making and security policies that support grouping, collaboration and sharing. To address this need, we are working on expanding C-TMAC, a security model that intrinsically supports grouping, collaboration and context awareness. In this perspective, we utilize the mathematical modeling language of Colored Petri Nets, along with the CPNtools, in order to represent and analyze the basic …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:maZDTaKrznsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A conceptual framework for metadata quality assessment",
            "Publication year": 2008,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/32535/610315.pdf?sequence=1#page=120",
            "Abstract": "Metadata quality of digital resources in a repository is an issue directly associated with the repository’s efficiency and value. In this paper, the subject of metadata quality is approached by introducing a new conceptual framework that defines it in terms of its fundamental components. Additionally, a method for assessing these components by exploiting structural and semantic relations among the resources is presented. These relations can be used to generate implied logic rules, which include, impose or prohibit certain values in the fields of a metadata record. The use of such rules can serve as a tool for conducting quality control in the records, in order to diagnose deficiencies and errors.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Dublin Core Metadata Initiative"
        },
        {
            "Title": "Dynamic access control administration for collaborative applications",
            "Publication year": 2006,
            "Publication url": "http://www.wseas.us/e-library/conferences/2006cscc/papers/534-292.pdf",
            "Abstract": "Today’s web-based collaborative applications need new approaches to overcome the shortcomings of classical access control. The limitations on administrative aspects of the existing security models and the requirements for more efficient management of authorizations in order to provide fine-grained and just-in-time access control for collaborative applications are discussed in this paper. The proposed DARBAC (Dynamically Administering Role Based Access Control) model provides a new approach for the administration of access control in such environments, where often the security breaks. The DARBAC model provides fine-grained and dynamic administration of authorizations in RBAC-based access control for a wide-range of collaborative applications, usually set-up in Web-based environments. An experimental implementation of the DARBAC model confirmed a number of benefits related to the administration of RBAC in collaborative environments.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D4I-Digital forensics framework for reviewing and investigating cyber attacks",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2590005619300153",
            "Abstract": "Many companies have cited lack of cyber-security as the main barrier to Industrie 4.0 or digitalization. Security functions include protection, detection, response and investigation. Cyber-attack investigation is important as it can support the mitigation of damages and maturing future prevention approaches. Nowadays, the investigation of cyber-attacks has evolved more than ever leveraging combinations of intelligent tools and digital forensics processes. Intelligent tools (e.g., YARA rules and Indicators of Compromise) are effective only when there is prior knowledge about software and mechanisms used in the cyber-attack, i.e., they are not attack-agnostic. Therefore, the effectiveness of these intelligent tools is inversely proportional to the number of the never-seen-before software and mechanisms utilized. Digital forensic processes, while not suffering from such issue, lack the ability to provide in-depth support to a …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:dQ2og3OwTAUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Καταγραφή και Επίβλεψη Ενεργειών Χρήστη",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/bitstream/11419/529/1/05_chapter_04.pdf",
            "Abstract": "Αξιοποίηση των λογαριασμών χρηστών για την καταγραφή ενεργειών χρήστη, μετά την είσοδό τους στο σύστημα. Πoλιτικές επίβλεψης και διαχείριση ομάδων χρηστών.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementing context and team based access control in healthcare intranets",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/1463923021000042715",
            "Abstract": "The establishment of an efficient access control system in healthcare intranets is a critical security issue directly related to the protection of patients' privacy. Our C-TMAC (Context and Team-based Access Control) model is an active security access control model that layers dynamic access control concepts on top of RBAC (Role-based) and TMAC (Team-based) access control models. It also extends them in the sense that contextual information concerning collaborative activities is associated with teams of users and user permissions are dynamically filtered during runtime. These features of C-TMAC meet the specific security requirements of healthcare applications. In this paper, an experimental implementation of the C-TMAC model is described. More specifically, we present the operational architecture of the system that is used to implement C-TMAC security components in a healthcare intranet. Based on the …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:qjMakFHDy7sC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Healthcare teams over the Internet: programming a certificate-based approach",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1386505603000315",
            "Abstract": "Healthcare environments are a representative case of collaborative environments since individuals (e.g. doctors) in many cases collaborate in order to provide care to patients in a more proficient way. At the same time modern healthcare institutions are increasingly interested in sharing access of their information resources in the networked environment. Healthcare applications over the Internet offer an attractive communication infrastructure at worldwide level but with a noticeably great factor of risk. Security has, therefore, become a major concern. However, although an adequate level of security can be relied upon digital certificates, if an appropriate security model is used, additional security considerations are needed in order to deal efficiently with the above team-work concerns. The already known Hybrid Access Control (HAC) security model supports and handles efficiently healthcare teams with active security …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Information Systems Policy and Strategic Planning: The Alignment between Organizational Factors and ICT Security Management",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Shaping smarter consumer behaviour and food choice",
            "Publication year": 2016,
            "Publication url": "https://search.informit.org/doi/abs/10.3316/INFORMIT.911845844412603",
            "Abstract": "Audiovisual material available from this site has been copied and communicated to you under a Screenrights licence pursuant to Section 113P of the Copyright Act 1968 solely for the educational purposes of your institution. No other use is authorised. For more information please contact Screenrights at [email protected] or at www. screenrights. org.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:xtRiw3GOFMkC",
            "Publisher": "Blue Mountains International Hotel Management School"
        },
        {
            "Title": "Healthcare teams over the Internet: towards a certificate-based approach",
            "Publication year": 2002,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/20022",
            "Abstract": "Healthcare environments are a representative case of collaborative environments since individuals (eg doctors) in many cases collaborate in order to provide care to patients in a more proficient way. At the same time modern healthcare institutions are increasingly interested in sharing access of their information resources in the networked environment. Healthcare applications over the Internet offer an attractive communication infrastructure at worldwide level but with a noticeably great factor of risk. Security has therefore become a major concern for healthcare applications over the Internet. However, although an adequate level of security can be relied upon digital certificates, if an appropriate security policy is used, additional security considerations are needed in order to deal efficiently with the above team-work concerns. The already known Hybrid Access Control security model supports and handles efficiently …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:f2IySw72cVMC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Εισαγωγή στην κρυπτολογία",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1030",
            "Abstract": "Εισαγωγή στην κρυπτογραφία και τη στεγανογραφία. Παρουσίαση και εφαρμογή κλασσικών τεχνικών κρυπτογραφίας και στεγανογραφίας. Βασικές και προαπαιτούμενες έννοιες από τη θεωρία πληροφοριών. Η στεγανογραφία στη σύγχρονη μετάδοση πολυμεσικών μηνυμάτων. Ζητήματα κρυπτανάλυσης και επίδειξη γνωστών τεχνικών με αξιοποίηση εκπαιδευτικών εργαλείων (π.χ. Cryptool).",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Managing enterprise IT risks through automated security metrics",
            "Publication year": 2018,
            "Publication url": "https://www.igi-global.com/chapter/managing-enterprise-it-risks-through-automated-security-metrics/202278",
            "Abstract": "Information systems of modern enterprises are quite complex entities. This fact has influenced the overall information technology (IT) risk profile of the enterprise and it has become all the more critical now to have sound information systems that can maximize business performance of an enterprise. At this point, the practical challenge for enterprises is how to manage enterprise IT risks for persistent protection of business and security goals. This chapter covers different aspects of managing enterprise IT risks, providing solutions in terms of risk management methods, automated security metrics and vulnerability scoring methods. The purpose is to introduce an in-depth study on enterprise IT risks and add value to enterprise sustainability through an extensive analysis of methods and automated security specifications.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:EUQCXRtRnyEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Using digital certificates for access control in clinical intranet applications",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/366131.366157",
            "Abstract": "Using digital certificates for access control in clinical intranet applications | Technology and \nHealth Care ACM Digital Library home ACM home Google, Inc. (search) Advanced Search \nBrowse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs \nConferences People More Search ACM Digital Library SearchSearch Advanced Search \nTechnology and Health Care Periodical Home Latest Issue Archive Authors Affiliations Award \nWinners More HomeBrowse by TitlePeriodicalsTechnology and Health CareVol. , No. -4Using \ndigital certificates for access control in clinical intranet applications article Using digital certificates \nfor access control in clinical intranet applications Share on Authors: Ioannis K Mavridis profile \nimage I. Mavridis View Profile , Christos K. Georgiadis profile image C. Georgiadis View \nProfile , George I Pangalos profile image G. Pangalos View Profile , Marie Khair profile M-…",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:WF5omc3nYNoC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Exploiting security content to measure risk",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=11932750798130524049&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "FoodSMART: A mobile phone application to provide personalised information on the foods available in an eating out situation",
            "Publication year": 2018,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-nutrition-society/article/foodsmart-a-mobile-phone-application-to-provide-personalised-information-on-the-foods-available-in-an-eating-out-situation/EC03F6E443C1E7787A88F6701C2E7EE2",
            "Abstract": "//static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS0029665118001179/resource/name/firstPage-S0029665118001179a.jpg",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:738O_yMBCRsC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Αξιολόγηση Ασφάλειας με Common Criteria",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/537",
            "Abstract": "Παρουσίαση  του  διεθνώς αναγνωρισμένου συνόλου προτύπων ασφάλειας  Common Criteria (CC, ISO / IEC 15408), τα οποία προσφέρουν τη δυνατότητα αξιολόγησης και πιστοποίησης των ιδιοτήτων ασφάλειας για προϊόντα τεχνολογίας των πληροφοριών.  Ρύθμιση και διαχείριση Λ/Σ συστημάτων Microsoft ώστε να πληρούνται οι προϋποθέσεις συμβατότητας με τα CC. Κατανόηση προδιαγραφών  ελάχιστων απαιτούμενων χαρακτηριστικών  υλικού (hardware requirements), καταστάσεις λειτουργίας, σενάρια διαχείρισης κ.α",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access Control Administration in Healthcare Applications",
            "Publication year": 2002,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/20053",
            "Abstract": "The interconnection of information systems of different parties involved in healthcare applications leads to the need for information sharing across large-scale and highly distributed database systems. Applying appropriate access control policies in an effective and flexible way is a specific task for a number of local security officers that must operate according to a high-level access control administration system. The particular security requirements of healthcare information systems are reflected to the access control system, which must be flexible and dynamically adaptable to the daily activities. Decentralizing access control administration can be achieved in a uniform and consistent way when applying appropriate administrative rules and constraints. In this paper are presented the basic features of an access control administration model for interconnected information systems, as in the healthcare environment.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Περιορισμοί Ακεραιότητας Βάσεων Δεδομένων",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/531",
            "Abstract": "Διερεύνηση και εφαρμογή των περιορισμών ακεραιότητας με τη βοήθεια ενός συστήματος διαχείρισης βάσεων δεδομένων (π.χ. Οracle DBMS) με εφαρμογή πραγματικών σεναρίων δημιοουργίας και διαχείρισης μιας βάσης δεδομέων που θα συμπεριλαμβάνουν:Σύνδεση με τη ΒΔ, Δημιουργία αντικειμένων, Καθορισμό απλών και σύνθετων περιορισµών ακεραιότητας, Ενεργοποίηση και απενεργοποίηση περιορισµών, κ.ά.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Active Security Issues in Healthcare Information Systems",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Mavridis-2/publication/27384329_Active_Security_Issues_in_Healthcare_Information_Systems/links/550741f40cf26ff55f7c488c/Active-Security-Issues-in-Healthcare-Information-Systems.pdf",
            "Abstract": "Classical access control approaches are characterized as passive. In dynamically changing healthcare environments there is a need for active security to control permission activation according to the current need-to-know user requirements. To address this problem we exploit the use of context information that characterizes clinical activities for particular patient cases. The definition of context templates might be static. We propose to use the concept of teams as a means for reducing the context information that has to be entered for every user, as well as for determining the final set of activated role permissions.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conceptual analysis of cyber security education based on live competitions",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7942934/",
            "Abstract": "Live competitions, i.e. Capture the Flag, provide noteworthy experiences for the participants while offering both hands-on practice and entertainment. Aiming at performing a conceptual analysis as a basis for improving their pedagogical utilization, we investigate a number of live competition paradigms and analyse their structure by decomposing them into their respective elements and defining their relations. Moreover, we record the possible obstacles related to the pedagogical utilization of live competitions and group them into distinct categories. As a result, we construct a concept map of the technological and pedagogical characteristics of live competitions. Based on the proposed concept map and the recorded obstacles, we present a comparative evaluation scheme that we employ on three live competition approaches from the literature in order to reveal their value with respect to the educational impact. Finally …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Flexible team-based access control using contexts",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/373256.373259",
            "Abstract": "We discuss the integration of contextual information with team-based access control. The TMAC model was formulated by Thomas in [1] to provide access control for collaborative activity best accomplished by teams of users. In TMAC, access control revolves around teams, where a\" team\" is an abstraction that encapsulates a collection of users in specific roles and collaborating with the objective of accomplishing a specific task or goal. Users who belong to a team are given access to resources used by a team. However, the effective permissions of a user are always derived from permission types defined for roles that the user belongs to. TMAC is an example of what we call\" active security models\". These models are aware of the context associated with an ongoing activity in providing access control and thus distinguish the passive concept of permission assignment from the active concept of context-based …",
            "Abstract entirety": 0,
            "Author pub id": "l2FvCz8AAAAJ:u5HHmVD_uO8C",
            "Publisher": "ACM"
        },
        {
            "Title": "Ακεραιότητα και Αυθεντικότητα Μηνυμάτων",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1032",
            "Abstract": "Ζητήματα αυθεντικότητας πηγής και μηνυμάτων, διαφύλαξης της ακεραιότητας και γενικότερης λειτουργικότητας. Θα περιγραφούν αναλυτικά οι γνωστότερες τεχνικές δημιουργίας συνόψεων με συναρτήσεις κατακερματισμού (Hash functions), όπως οι md4, md5, sha-0, sha-1, κ.α., καθώς και τα ζητήματα ανθεκτικότητάς τους. Επιπλέον, θα μελετηθούν οι μέθοδοι υπολογισμού κώδικα αυθεντικοποίησης μηνύματος (MAC) και κώδικα ακεραιότητας μηνύματος (MIC) με χρήση κρυπτογραφίας και συναρτήσεων κατακερματισμού.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Βασικές έννοιες και ζητήματα ασφάλειας",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/1025",
            "Abstract": "Εισαγωγή στην αναγκαιότητα της ασφάλειας πληροφοριών στο διαδίκτυο. Βασικές αρχές και ορολογία της ασφάλειας πληροφοριών (εμπιστευτικότητα, ακεραιότητα, διαθεσιμότητα, αυθεντικότητα, μη-απάρνηση, εξουσιοδότηση, απειλες, ευπάθειες, επιθέσεις, επικινδυνότητα, κλπ). Ιστορικό επιθέσεων από τη βιβλιογραφία και κατηγοριοποίησή τους. Ξενάγηση στη διάρθρωση του βιβλίου.",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security Considerations in Designing Distributed Medical Databases",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "l2FvCz8AAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        }
    ]
}]