[{
    "name": "Ιωάννης Πρατικάκης",
    "romanize name": "Ioannis Pratikakis",
    "School-Department": "Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών",
    "University": "duth",
    "Rank": "Καθηγητής",
    "Apella_id": 17933,
    "Scholar name": "Ioannis Pratikakis",
    "Scholar id": "lCVokogAAAAJ",
    "Affiliation": "Professor, Democritus University of Thrace, Greece",
    "Citedby": 8584,
    "Interests": [
        "Computer Vision",
        "Machine Learning",
        "3D Shape analysis",
        "Document Image Analysis",
        "Medical Image Analysis"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=lCVokogAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A Web-based E-training Platform for biomedical engineering education",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6969889/",
            "Abstract": "This paper presents the results of the Leonardo da Vinci project (Transfer of Innovation), named “A Web-based E-Training Platform for Extended Human Motion Investigation in Orthopaedics”. The project addresses to medical and engineering professionals, proposing formation of specialists that will systematically apply the principles of medical and bioengineering sciences in finding solutions that will lead in improving health conditions. The main outcome of the project was a Virtual Training & Communication Centre ORTHO-eMAN for innovative education - on-line educational and training material accessed via a standard web browser, which provides an integrated on-line learning environment. Interactivity allows trainees to test their knowledge and provides immediate feedback using images and cases that they might encounter in clinical practice.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "KonstantinosNtirogiannis.\" ICFHR 2012 competition on handwritten document image binarization (H-DIBCO 2012).\" Frontiers in Handwriting Recognition (ICFHR)",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=723097223174729923&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:FAceZFleit8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spatially sensitive statistical shape analysis for pedestrian recognition from LIDAR data",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314218300766",
            "Abstract": "Range-based pedestrian recognition is instrumental towards the development of autonomous driving and driving assistance systems. This work introduces encoding methods for pedestrian recognition, based on statistical shape analysis of 3D LIDAR data. The proposed approach has two variants, based on the encoding of local shape descriptors either in a spatially agnostic or spatially sensitive fashion. The latter method derives more detailed cues, by enriching the ‘gross’ information reflected by overall statistics of local shape descriptors, with ‘fine-grained’ information reflected by statistics associated with spatial clusters. Experiments on artificial LIDAR datasets, which include challenging samples, as well as on a large scale dataset of real LIDAR data, lead to the conclusion that both variants of the proposed approach (i) obtain high recognition accuracy, (ii) are robust against low-resolution sampling, (iii) are …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:0N-VGjzr574C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Unsupervised region-based image retrieval",
            "Publication year": 2004,
            "Publication url": "https://researchportal.vub.be/en/publications/unsupervised-region-based-image-retrieval",
            "Abstract": "A novel unsupervised strategy for content-based image retrieval is presented. It is based on a meaningful segmentation procedure that can provide proper distributions for matching via the earth mover's distance as a similarity metric. The segmentation procedure is based on a hierarchical watershed-driven algorithm that extracts meaningful regions automatically. In this framework, the proposed robust feature extraction and the many-to-many region matching along with the novel region weighting for enhancing feature discrimination play a major role. Experimental results demonstrate the performance of the proposed strategy.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:DUooU5lO8OsC",
            "Publisher": "Institute of Electrical Engineers"
        },
        {
            "Title": "A robust spatio-temporal scheme for dynamic 3D facial expression retrieval",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-015-1142-7",
            "Abstract": "The problem of facial expression recognition in dynamic sequences of 3D face scans has received a significant amount of attention in the recent past whereas the problem of retrieval in this type of data has not. A novel retrieval scheme for such data is introduced in this paper. It is the first spatio-temporal retrieval scheme ever used for retrieval in dynamic sequences of 3D face scans. The proposed scheme automatically detects specific facial landmarks and uses them to create a spatio-temporal descriptor. At first, geometric as well as topological information of the 3D face scans is captured by using the detected landmarks. In the sequel, the aforementioned spatial information is filtered by using wavelet transformation, resulting to our final spatio-temporal descriptor. Our descriptor is invariant to the number of the 3D face scans of a facial expression sequence. The proposed retrieval scheme exploits the Square of …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "A modified adaptive logical level binarization technique for historical document images",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5277601/",
            "Abstract": "In this paper, a new document image binarization technique is presented, as an improved version of the state-of-the-art adaptive logical level technique (ALLT). The original ALLT depends on fixed windows to extract essential features such as the character stroke width. Since characters with several different stroke widths may exist within a region, this can lead to erroneous results. In our approach, we use local adaptive binarization as a guide to our adaptive stroke width detection. The skeleton and the contour points of the binarization output are combined to identify locally the stroke width. Additionally, we introduce an adaptive local parameter ldquobetardquo that enhances the characters and improves the overall performance. In this way, we achieve more accurate binarization results in both handwritten and printed documents with a particular focus on degraded historical documents. Experimental results prove …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distinction between handwritten and machine-printed text based on the bag of visual words model",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320313003774",
            "Abstract": "In a variety of documents, ranging from forms to archive documents and books with annotations, machine printed and handwritten text may coexist in the same document image, raising significant issues within the recognition pipeline. It is, therefore, necessary to separate the two types of text so that it becomes feasible to apply different recognition methodologies to each modality. In this paper, a new approach is proposed which strives towards identifying and separating handwritten from machine printed text using the Bag of Visual Words model (BoVW). Initially, blocks of interest are detected in the document image. For each block, a descriptor is calculated based on the BoVW. The final characterization of the blocks as Handwritten, Machine Printed or Noise is made by a decision scheme which relies upon the combination of binary SVM classifiers. The promising performance of the proposed approach is shown by …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "3D Object Recognition and Facial Identification Using Time-averaged Single-views from Time-of-flight 3D Depth-Camera",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Fabien-Moutarde/publication/47463090_3D_Object_Recognition_and_Facial_Identification_Using_Time-averaged_Single-views_from_Time-of-flight_3D_Depth-Camera/links/0deec53c67035b9347000000/3D-Object-Recognition-and-Facial-Identification-Using-Time-averaged-Single-views-from-Time-of-flight-3D-Depth-Camera.pdf",
            "Abstract": "We report here on feasibility evaluation experiments for 3D object recognition and person facial identification from single-view on real depth images acquired with an “off-the-shelf” 3D time-of-flight depth camera. Our methodology is the following: for each person or object, we perform 2 independent recordings, one used for learning and the other one for test purposes. For each recorded frame, a 3D-mesh is computed by simple triangulation from the filtered depth image. The feature we use for recognition is the normalized histogram of directions of normal vectors to the 3D-mesh facets. We consider each training frame as a separate example, and the training is done with a multilayer perceptron with 1 hidden layer. For our 3D person facial identification experiments, 3 different persons were used, and we obtain a global correct rank-1 recognition rate of up to 80%, measured on test frames from an independent 3D video. For our 3D object recognition experiment, we have considered 3 different objects, and obtain a correct single-frame recognition rate of 95%, and checked that the method is quite robust to variation of distance from depth camera to object. These first experiments show that 3D object recognition or 3D face identification, with a time-of-flight 3D camera, seems feasible, despite the high level of noise in the obtained real depth images.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Binarization of textual content in video frames",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065396/",
            "Abstract": "In this paper we present a binarization technique for textual content in video frames which can be applied in the resulting image of the text detection step aiming in an improved OCR performance. The proposed technique is based on the detection of the text baselines in order to define the main body of the text. The main body of the text is used to detect the stroke width of the characters which will address the two consecutive locally adaptive binarization steps that follow. At the first step, we use different valuation in parameters for the inside and outside area of the main body of the text. To include the thinned or broken binarized parts that may exist outside the main text body, convex hull analysis is performed so that the entire text body is considered. At the second step, binarization is performed with different valuation in parameters for the inside and outside area of the entire text body. The effectiveness of the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Segmentation based recovery of arbitrarily warped document images",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4377063/",
            "Abstract": "Non-linear warping appears in document images when captured by a digital camera or a scanner, especially in the case that these documents are digitized bounded volumes. Arbitrarily warped documents may have several slope changes along the text lines as well as along the words of the same text line. In this paper, a novel segmentation based technique for efficient restoration of arbitrarily warped document images is presented. The proposed technique recovers the documents relying upon (i) text lines and words detection using a novel segmentation technique appropriate for warped documents, (ii) a first draft binary image de-warping based on word rotation and translation according to upper and lower word baselines, and (Hi) a recovery of the original warped image guided by the draft binary image de-warping result. Experimental results on several arbitrarily warped documents prove the effectiveness of …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scale-Space Representations for Gray-Scale and Color Images",
            "Publication year": 2011,
            "Publication url": "https://researchportal.vub.be/en/publications/scale-space-representations-for-gray-scale-and-color-images",
            "Abstract": "The analysis of images depends on the scale of the objects of interest. The extent of each real world object is limited by two scales: the inner and outer scale [1]. The inner scale corresponds to the resolution which expresses the pixel size and is determined by the resolution of the sampling device. The outer scale of an object corresponds to the minimum size of a window that completely contains the object, and is consequently limited by the field of view. In controlled environment, these two scales are known",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Wiley VCH"
        },
        {
            "Title": "Hybrid off-line cursive handwriting word recognition",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1699375/",
            "Abstract": "In this paper, we present an off-line cursive word handwriting recognition methodology. This is based on an additive fusion resulted after a novel combination of two different modes of word image normalization and robust hybrid feature extraction. We employ two types of features in a hybrid fashion. The first one, divides the word image into a set of zones and calculates the density of the character pixels in each zone. In the second type of features, we calculate the area that is formed from the projections of the upper and lower profile of the word. The performance of the proposed methodology is demonstrated after testing with the reference IAM cursive handwriting database",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sketch-based 3D model retrieval by viewpoint entropy-based adaptive view clustering",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2601307.2601315",
            "Abstract": "Searching for relevant 3D models based on hand-drawn sketches is both intuitive and important for many applications, such as sketch-based 3D modeling and recognition. We propose a sketch-based 3D model retrieval algorithm by utilizing viewpoint entropy-based adaptive view clustering and shape context matching. Different models have different visual complexities, thus there is no need to keep the same number of representative views for each model. Motivated by this, we propose to measure the visual complexity of a 3D model by utilizing viewpoint entropy distribution of a set of sample views and based on the complexity value, we can adaptively decide the number of representative views. Finally, we perform Fuzzy C-Means based view clustering on the sample views based on their viewpoint entropy values. We test our algorithm on two latest sketch-based 3D model retrieval benchmarks and compare it …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Methodology for Semantics Extraction from Multimedia Content",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=18393523208757329283&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:IUKN3-7HHlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Text line and word segmentation of handwritten documents",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=735986166466177870&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present a segmentation methodology of handwritten documents in their distinct entities, namely, text lines and words. Text line segmentation is achieved by applying Hough transform on a subset of the document image connected components. A post-processing step includes the correction of possible false alarms, the detection of text lines that Hough transform failed to create and finally the efficient separation of vertically connected characters using a novel method based on skeletonization. Word segmentation is addressed as a two class problem. The distances between adjacent overlapped components in a text line are calculated using the combination of two distance metrics and each of them is categorized either as an inter- or an intra-word distance in a Gaussian mixture modeling framework. The performance of the proposed methodology is based on a consistent and concrete evaluation methodology that uses suitable performance measures in order to compare the text line segmentation and word segmentation results against the corresponding ground truth annotation. The efficiency of the proposed methodology is demonstrated by experimentation conducted on two different datasets: (a) on the test set of the ICDAR2007 handwriting segmentation competition and (b) on a set of historical handwritten documents.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Integrating segmentation information into CNN for breast cancer diagnosis of mammographic masses",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169260720317466",
            "Abstract": "Background and ObjectivesSegmentation of mammographic lesions has been proven to be a valuable source of information, as it can assist in both extracting shape-related features and providing accurate localization of the lesion. In this work, a methodology is proposed for integrating mammographic mass segmentation information into a convolutional neural network (CNN), aiming to improve the diagnosis of breast cancer in mammograms. MethodsThe proposed methodology involves modification of each convolutional layer of a CNN, so that information of not only the input image but also the corresponding segmentation map is considered. Furthermore, a new loss function is introduced, which adds an extra term to the standard cross-entropy, aiming to steer the attention of the network to the mass region, penalizing strong feature activations based on their location. The segmentation maps are acquired either …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:BJbdYPG6LGMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Relevance feedback in content-based 3D object retrieval a comparative study",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.3722/cadaps.2008.753-763",
            "Abstract": "In this paper, we present a comparative study that concerns relevance feedback (RF) algorithms in the context of content-based 3D object retrieval. In this study, we employ RF algorithms which range from query modification and multiple queries to one-class support vector machines (SVM). Furthermore, we employ pseudo relevance feedback (PRF) and show that it can considerably improve the performance of content-based retrieval. Our comparative study is based upon extensive experiments that take into account datasets containing generic as well as CAD models.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:_kc_bZDykSQC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Document Image Binarization Contest (ICDAR 2013)",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=1537112856664854996&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:0izLItjtcgwC",
            "Publisher": "ICDAR"
        },
        {
            "Title": "A Block-Based Hough Transform Mapping for Text Line Detection in Handwritten Documents",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=4856528546781553465&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present a new text line detection method for unconstrained handwritten documents. The proposed technique is based on a strategy that consists of three distinct steps. The first step includes preprocessing for image enhancement, connected component extraction and average character height estimation. In the second step, a block-based Hough transform is used for the detection of potential text lines while a third step is used to correct possible false alarms. The performance of the proposed methodology is based on a consistent and concrete evaluation technique that relies on the comparison between the text line detection result and the corresponding ground truth annotation.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deep learning for breast cancer diagnosis from mammograms—a comparative study",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/427012",
            "Abstract": "Deep convolutional neural networks (CNNs) are investigated in the context of computer-aided diagnosis (CADx) of breast cancer. State-of-the-art CNNs are trained and evaluated on two mammographic datasets, consisting of ROIs depicting benign or malignant mass lesions. The performance evaluation of each examined network is addressed in two training scenarios: the first involves initializing the network with pre-trained weights, while for the second the networks are initialized in a random fashion. Extensive experimental results show the superior performance achieved in the case of fine-tuning a pretrained network compared to training from scratch. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:HtS1dXgVpQUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A web-based 3D graphical model search engine",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Miltiadis-Koutsokeras/publication/263870501_A_web-based_3D_graphical_model_search_engine/links/5eb5c50f92851cd50da38c2b/A-web-based-3D-graphical-model-search-engine.pdf",
            "Abstract": "In this paper, we present a Web-based Search Engine for 3D models. Considering the huge amount of 3D models/scenes available in proprietary or public Webs, it is nearly impossible to create corresponding metadata with user annotation. Therefore, the development of a content-based search engine that permits queries of existing 3D models and supports a robust model representation based on content, can lead to an efficient solution regarding search and retrieval of 3D graphical models. Using off-the-shelf hardware as well as fast 3D feature extraction and matching algorithms, we present a robust content-based search engine for 3D models which can also be used via the Web.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning the compositional structure of man-made objects for 3d shape retrieval",
            "Publication year": 2010,
            "Publication url": "https://diglib.eg.org/xmlui/bitstream/handle/10.2312/3DOR.3DOR10.039-046/039-046.pdf?sequence=1",
            "Abstract": "While approaches based on local features play a more and more important role for 3D shape retrieval, the problems of feature selection and similarity measurement between sets of local features still remain open tasks. Common algorithms usually measure the similarity between two such sets by either establishing feature correspondences or by using Bag-of-Features (BoF) approaches. While establishing correspondences often involves a lot of manually chosen thresholds, BoF approaches can hardly model the spatial structure of the underlying 3D object. In this paper focusing on retrieval of 3D models representing man-made objects, we try to tackle both of these problems. Exploiting the fact that man-made objects usually consist of a small set of certain shape primitives, we propose a feature selection technique that decomposes 3D point clouds into sections that can be represented by a plane, a sphere, a …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Part-based 3D object retrieval via multi-label optimization",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314217300681",
            "Abstract": "This paper deals with the problem of 3D object retrieval using a part-based representation. The premise in this context is that similar objects will consist of similar parts. A part-based representation is proposed, where each object is segmented, and represented as a labeled graph, with nodes corresponding to parts, and edges connecting adjacent parts. The calculation of the distance between two segmented objects is formulated as a multi-label optimization problem, taking into account the aforementioned graphs. The proposed method achieves comparable performance to the state-of-the-art on several datasets, while it has a clear advantage in the case of articulated objects.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Erratum to: A survey on facial expression recognition in 3D video sequences",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Antonis-Danelakis/publication/271951893_Erratum_to_A_survey_on_facial_expression_recognition_in_3D_video_sequences/links/572b0a1c08ae057b0a08440a/Erratum-to-A-survey-on-facial-expression-recognition-in-3D-video-sequences.pdf",
            "Abstract": "The authors cited incorrect data in Tables 6, 7, and 9 in the paper entitled\" A survey on facial expression recognition in 3D video sequences\" by Antonios Danelakis, Theoharis Theoharis, Ioannis Pratikakis, published online first 1 February 2014. Additionally, every reference to\" László et al.\" should become\" Jeni et al.\". The authors apologize for these errors. In Table 6: In the row concerning Yin et al. and in the column titled\" Classification Accuracy\"(2nd column), the word'N/A'should be changed to'80.20%'.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:xtoqd-5pKcoC",
            "Publisher": "Springer Nature BV"
        },
        {
            "Title": "Detection of artificial and scene text in images and video frames",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-011-0237-7",
            "Abstract": "Textual information in images and video frames constitutes a valuable source of high-level semantics for multimedia indexing and retrieval systems. Text detection is the most crucial step in a multimedia text extraction system and although it has been extensively studied the past decade still, it does not exist a generic architecture that would work for artificial and scene text in multimedia content. In this paper we propose a system for text detection of both artificial and scene text in images and video frames. The system is based on a machine learning stage which uses an Random Forest classifier and a highly discriminative feature set produced by using a new texture operator called Multilevel Adaptive Color edge Local Binary Pattern (MACeLBP). MACeLBP describes the spatial distribution of color edges in multiple adaptive levels of contrast. Then, a gradient-based algorithm is applied to achieve distinction …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer London"
        },
        {
            "Title": "DIBCO 2009: document image binarization contest",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s10032-010-0115-7",
            "Abstract": "DIBCO 2009 is the first International Document Image Binarization Contest organized in the context of ICDAR 2009 conference. The general objective of the contest is to identify current advances in document image binarization using established evaluation performance measures. This paper describes the contest details including the evaluation measures used as well as the performance of the 43 submitted methods along with a short description of the top five algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:anf4URPfarAC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Microcalcification oriented content-based mammogram retrieval for breast cancer diagnosis",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6958484/",
            "Abstract": "Microcalcifications (MCs) provide a significant early indication of breast malignancy. This work introduces a supervised scheme for malignancy risk assessment of mammograms containing MCs. The proposed scheme employs shape and textural features as input to a support vector machine (SVM) ensemble, in order to perform content-based image retrieval (CBIR) of mammograms. The retrieval performance of the proposed scheme has been evaluated by taking into account the variation of MCs morphology as defined in BI-RADS. In our experiments, we use a set of 87 mammograms containing MCs, obtained from the widely adopted DDSM database for screening mammography. The experimental results demonstrate that the proposed supervised CBIR scheme addresses effective retrieval of MCs mammograms outperforming relevant unsupervised schemes.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Local Signature Quantization by Sparse Coding.",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/51039844/Local_Signature_Quantization_by_Sparse_C20161224-693-1pxesxp.pdf",
            "Abstract": "In 3D object retrieval it is very important to define reliable shape descriptors, which compactly characterize geometric properties of the underlying surface. To this aim two main approaches are considered: global, and local ones. Global approaches are effective in describing the whole object, while local ones are more suitable to characterize small parts of the shape. Some strategies to combine these two approaches have been proposed recently but still no consolidate work is available in this field. With this paper we address this problem and propose a new method based on sparse coding techniques. A set of local shape descriptors are collected from the shape. Then a dictionary is trained as generative model. In this fashion the dictionary is used as global shape descriptor for shape retrieval purposes. Preliminary experiments are performed on a standard dataset by showing a drastic improvement of the proposed method in comparison with well known local-to-global and global approaches.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient segmentation-free approach to assist old Greek handwritten manuscript OCR",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-005-0013-7",
            "Abstract": "Recognition of old Greek manuscripts is essential for quick and efficient content exploitation of the valuable old Greek historical collections. In this paper, we focus on the problem of recognizing early Christian Greek manuscripts written in lower case letters. Based on the existence of closed cavity regions in the majority of characters and character ligatures in these scripts, we propose a novel, segmentation-free, fast and efficient technique that assists the recognition procedure by tracing and recognizing the most frequently appearing characters or character ligatures. First, we detect closed cavities that exist in the character body. Then, the protrusions in the outer contour outline of the connected components that contain the character closed cavities are used for the classification of the area around closed cavities to a specific character or a character ligature. The proposed method gives highly accurate results …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "IIT/NCSR\" Demokritos\" at TRECVID 2006: Shot Boundary Detection.",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.189.1739&rep=rep1&type=pdf",
            "Abstract": "In this notebook paper, we summarize our results in the framework of TRECVID 2006 competition. In particular, we have produced results for the Shot Boundary detection task for which we will describe the submitted runs and analyze their performance. The applied methodology relies on spatial segmentation and a similarity measure based on Earth Mover’s Distance that produces signatures for a given spatio-temporal support. We have used alternative signatures for abrupt cuts and gradual transitions.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An old greek handwritten OCR system based on an efficient segmentation-free approach",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10032-006-0031-z.pdf",
            "Abstract": "Recognition of Old Greek Early Christian manuscripts is essential for efficient content exploitation of the valuable Old Greek Early Christian historical collections. In this paper, we focus on the problem of recognizing Old Greek manuscripts and propose a novel recognition technique that has been tested in a large number of important historical manuscript collections which are written in lowercase letters and originate from St. Catherine’s Mount Sinai Monastery. Based on an open and closed cavity character representation, we propose a novel, segmentation-free, fast and efficient technique for the detection and recognition of characters and character ligatures. First, we detect open and closed cavities that exist in the skeletonized character body. Then, the classification of a specific character or character ligature is based on the protrusible segments that appear in the topological description of the character …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "SHREC'08 Entry: 2D/3D Hybrid",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4547990/",
            "Abstract": "In this paper, we present an overview of the 3D object retrieval method that we employed in our participation to the generic models track of SHREC 2008 organized by the AIM@SHAPE network of excellence. The proposed methodology is detailed in [2]. Our method is based on a hybrid scheme where 2D features as well as 3D features are extracted from a 3D model which has been previously normalized for rotation using two alternative alignment techniques. The alignment methods that are used are CPCA and NPCA. The 2D features are Fourier coefficients extracted from a set of depth buffers and the 3D features are spherical harmonic coefficients extracted from a spherical function-based representation of a 3D model.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation methodology for historical document image binarization",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6305530/",
            "Abstract": "Document image binarization is of great importance in the document image analysis and recognition pipeline since it affects further stages of the recognition process. The evaluation of a binarization method aids in studying its algorithmic behavior, as well as verifying its effectiveness, by providing qualitative and quantitative indication of its performance. This paper addresses a pixel-based binarization evaluation methodology for historical handwritten/machine-printed document images. In the proposed evaluation scheme, the recall and precision evaluation measures are properly modified using a weighting scheme that diminishes any potential evaluation bias. Additional performance metrics of the proposed evaluation scheme consist of the percentage rates of broken and missed text, false alarms, background noise, character enlargement, and merging. Several experiments conducted in comparison with other …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ICFHR 2014 competition on handwritten keyword spotting (H-KWS 2014)",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6981121/",
            "Abstract": "H-KWS 2014 is the Handwritten Keyword Spotting Competition organized in conjunction with ICFHR 2014 conference. The main objective of the competition is to record current advances in keyword spotting algorithms using established performance evaluation measures frequently encountered in the information retrieval literature. The competition comprises two distinct tracks, namely, a segmentation-based and a segmentation-free track. Five (5) distinct research groups have participated in the competition with three (3) methods for the segmentation-based track and four (4) methods for the segmentation-free track. The benchmarking datasets that were used in the contest contain both historical and modern documents from multiple writers. In this paper, the contest details are reported including the evaluation measures and the performance of the submitted methods along with a short description of each method.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying conformal geometry for creating a 3d model spatial-consistent texture map",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7574914/",
            "Abstract": "The aim of this research is to achieve spatial consistency of the UV map. We present an approach to produce a fully spatially consistent UV mapping based on the planar parameterisation of the mesh. We apply our method on a 3D digital replica of an ancient Greek Lekythos vessel. We parameterise the mesh of a 3D model onto a unit square 2D plane using computational conformal geometry techniques. The proposed method is genus independent, due to an iterative 3D mesh cutting procedure. Having now the texture of a 3D model depicted on a spatially continuous two dimensional structure enables us to efficiently apply a vast range of image processing based techniques and algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:L7CI7m0gUJcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scale selection for compact scale-space representation of vector-valued images",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72823-8_4",
            "Abstract": "This paper investigates the scale selection problem for vector-valued nonlinear diffusion scale-spaces. We present a new approach for the localization scale selection, which aims at maximizing the image content’s presence by finding the scale having a maximum correlation with the noise-free image. For scale-space discretization, we propose to address an adaptation of the optimal diffusion stopping time criterion introduced by Mrázek and Navara [1], in such a way that it identifies multiple scales of importance.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Special Section on Eurographics Workshop on 3D Object Retrieval 2017",
            "Publication year": 2018,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02165264/",
            "Abstract": "Archive ouverte HAL - Special Section on Eurographics Workshop on 3D Object Retrieval \n2017 Accéder directement au contenu Accéder directement à la navigation Toggle navigation \nCCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation \nEpisciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil \nDépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de \npublication Par structure de recherche Les portails de l'archive Recherche Documentation \nhal-02165264, version 1 Direction d'ouvrage, Proceedings, Dossier Special Section on \nEurographics Workshop on 3D Object Retrieval 2017 Guillaume Lavoué 1 Ioannis Pratikakis \n2 Florent Dupont 1 Maks Ovsjanikov 3 Michela Spagnuolo 4 Détails 1 M2DisCo - Geometry \nProcessing and Constrained Optimization LIRIS - Laboratoire d'InfoRmatique en Image et d'2 '…",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:SpbeaW3--B0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICDAR 2009 document image binarization contest (DIBCO 2009)",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5277767/",
            "Abstract": "DIBCO 2009 is the first International Document Image Binarization Contest organized in the context of ICDAR 2009 conference. The general objective of the contest is to identify current advances in document image binarization using established evaluation performance measures. This paper describes the contest details including the evaluation measures used as well as the performance of the 43 submitted methods along with a short description of each method.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scale selection for compact scale-space representation of vector-valued images",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11263-008-0154-4.pdf",
            "Abstract": "This paper investigates the scale selection problem for nonlinear diffusion scale-spaces. This topic comprises the notions of localization scale selection and scale space discretization. For the former, we present a new approach. It aims at maximizing the image content’s presence by finding the scale that has a maximum correlation with the noise-free image. For the latter, we propose to adapt the optimal diffusion stopping time criterion of Mrázek and Navara in such a way that it may identify multiple scales of importance.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Multiscale gradient watersheds of color images",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1208310/",
            "Abstract": "We present a new framework for the hierarchical segmentation of color images. The proposed scheme comprises a nonlinear scale-space with vector-valued gradient watersheds. Our aim is to produce a meaningful hierarchy among the objects in the image using three image components of distinct perceptual significance for a human observer, namely strong edges, smooth segments and detailed segments. The scale-space is based on a vector-valued diffusion that uses the Additive Operator Splitting numerical scheme. Furthermore, we introduce the principle of the dynamics of contours in scale-space that combines scale and contrast information. The performance of the proposed segmentation scheme is presented via experimental results obtained with a wide range of images including natural and artificial scenes.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Refining shape correspondence for similar objects using strain",
            "Publication year": 2011,
            "Publication url": "https://diglib.cgv.tugraz.at/bitstream/handle/10.2312/3DOR.3DOR11.017-024/017-024.pdf",
            "Abstract": "Several applications-for example, study of biological tissue movement and organ growth-require shape correspondence with a physical basis, especially for shapes or regions lacking distinctive features. For this purpose, we propose the adaptation of mechanical strain, a well-established physical measure for deformation, to the problem of constructing shape correspondence and measuring similarity between non-rigid shapes. In this paper, we demonstrate how to calculate strain for a 2D surface embedded in 3D. We then adjust the correspondence between two surfaces so that the strain varies smoothly across the deformed surface (by minimizing the change in strain). The final strain on the deformed surface can be used as a measure of shape similarity.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:fbc8zXXH2BUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A convolutional recurrent neural network for the handwritten text recognition of historical greek manuscripts",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-68787-8_18",
            "Abstract": "In this paper, a Convolutional Recurrent Neural Network architecture for offline handwriting recognition is proposed. Specifically, a Convolutional Neural Network is used as an encoder for the input which is a textline image, while a Bidirectional Long Short-Term Memory (BLSTM) network followed by a fully connected neural network acts as the decoder for the prediction of a sequence of characters. This work was motivated by the need to transcribe historical Greek manuscripts that entail several challenges which have been extensively analysed. The proposed architecture has been tested for standard datasets, namely the IAM and RIMES, as well as for a newly created dataset, namely EPARCHOS, which contains historical Greek manuscripts and has been made publicly available for research purposes. Our experimental work relies upon a detailed ablation study which shows that the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:F1b5ZUV5XREC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Preface to special issue on 3DOR 2010",
            "Publication year": 2011,
            "Publication url": "http://kops.uni-konstanz.de/bitstream/handle/123456789/28000/Pratikakis_280001.pdf?sequence=1",
            "Abstract": "This special issue of The Visual Computer encompasses six papers that were selected among those presented at the 3rd Eurographics Workshop on 3D Object Retrieval (May 2, 2010, Norrköping, Sweden). The authors were invited to submit a revised and substantially extended version of their contribution to The Visual Computer journal which underwent a new review cycle.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transforming scholarship in the archives through handwritten text recognition: Transkribus as a case study",
            "Publication year": 2019,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/JD-07-2018-0114/full/",
            "Abstract": "PurposeAn overview of the current use of handwritten text recognition (HTR) on archival manuscript material, as provided by the EU H2020 funded Transkribus platform. It explains HTR, demonstrates Transkribus, gives examples of use cases, highlights the affect HTR may have on scholarship, and evidences this turning point of the advanced use of digitised heritage content. The paper aims to discuss these issues.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:rmuvC79q63oC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Three-Dimentional Multiscale watershed segmentation of MR images",
            "Publication year": 2005,
            "Publication url": "https://researchportal.vub.be/en/publications/three-dimentional-multiscale-watershed-segmentation-of-mr-images",
            "Abstract": "Three-Dimentional Multiscale watershed segmentation of MR images — Vrije Universiteit \nBrussel Skip to main navigation Skip to search Skip to main content Vrije Universiteit Brussel \nLogo Help & FAQ English Nederlands Home Research Units Profiles Projects Research output \nActivities Equipment Prizes Press / Media Student theses Impacts Search by expertise, name \nor affiliation Three-Dimentional Multiscale watershed segmentation of MR images Ioanis \nPratikakis, Hichem Sahli, Jan Cornelis Electronics and Informatics Vrije Universiteit Brussel \nResearch output: Chapter in Book/Report/Conference proceeding › Chapter Overview Original \nlanguage English Title of host publication Medical Image Analysis Methods Publisher Medical \nImage Analysis Methods, pp. -314. Pages 314 Number of pages 1 Publication status Published \n- 2005 Bibliographical note Medical Image Analysis Methods, pp. 271-314. Cite this RIS …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Medical Image Analysis Methods, pp. 271-314."
        },
        {
            "Title": "A 3D Pottery Content Based Retrieval Method",
            "Publication year": 2009,
            "Publication url": "http://www.ipet.gr/~chamzas/chamzas_pdfs/publications/200903_Eurographics.pdf",
            "Abstract": "Archaeology is a science that is based on perception and similarity comparisons and thus 3D content based retrieval can be used as a research tool. In this paper, we present a descriptor which can be used for content based retrieval of 3D pottery. The descriptor carries morphological features which are extracted from a set of sequential plane-based contours which are vertical to the vessel’s axis of symmetry. The feature extraction is performed after the completion of a pre-processing phase, which involves scale and pose normalisation of the vessel. The latter is a recursive algorithm that takes advantage of the rotational symmetry property found in vessels. We developed a software tool that implements the above and we performed initial testing on vessel’s main body shape matching using a 3D vessel database composed by both manually modelled and digitised 3D artefacts.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust volumetric shape descriptor",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2381147.2381149",
            "Abstract": "This paper introduces a volume-based shape descriptor that is robust with respect to changes in pose and topology. We use modified shape distributions of [OFCD02] in conjunction with the interior distances and barycentroid potential that are based on barycentric coordinates [RLF09]. In our approach, shape distributions are aggregated throughout the entire volume contained within the shape thus capturing information conveyed by the volumes of shapes. Since interior distances and barycentroid potential are practically insensitive to various poses/deformations and to non-pervasive topological changes (addition of small handles), our shape descriptor inherits such insensitivity as well. In addition, if any other modes of information (eg electrostatic potential within the protein volume) are available, they can be easily incorporated into the descriptor as additional dimensions in the histograms. Our descriptor has a …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:hMsQuOkrut0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Handwritting: keyword spotting The Query by Example (QbE) case",
            "Publication year": 2017,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11652",
            "Abstract": "The  traditional  approach  in  document  indexing  usually  involves  an  Optical  Character Recognition (OCR) step.  Although OCR performs well in modern printed documents and documents of high quality printing,  in the case of handwritten documents OCR, several factors affect the final performance like intense degradation, paper-positioning variations (skew, translations, etc.) and writing styles variety. Handwritten word spotting has attracted the attention of the research community in the field of document image analysis and recognition since it appears to be a feasible solution for indexing and retrieval of handwritten documents in the case that OCR-based methods fail to deliver satisfactory results. Handwritten keyword spotting (KWS) is the task of retrieving all instances of a given query word in handwritten document image collections without involving a traditional OCR step. There exist two basic variations for KWS approaches: (a) the Query by Example case (QbE) where the query is a word image and (b) the Query by String case (QbS) where, as the name implies, the query is a string.  The study presented in this chapter will focus on the QbE approach For a better understanding, QbE methods will be presented taking into account two different perspectives which relate to the use of segmentation and learning. The segmentation- based methods are divided into 2 subcategories based upon the segmented entity which could be either the word image or the textline.  They are strongly dependent on the segmentation  step,  so  that  to  compare  different  methods  regardless  of  segmentation  errors, many researchers do not implement a …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:LgRImbQfgY4C",
            "Publisher": "Nova Science Publishers, Inc"
        },
        {
            "Title": "A spatio-temporal descriptor for dynamic 3D facial expression retrieval and recognition",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2852282.2852296",
            "Abstract": "The recent availability of dynamic 3D facial scans has spawned research activity in recognition based on such data. However, the problem of facial expression retrieval based on dynamic 3D facial data has hardly been addressed and is the subject of this paper. A novel descriptor is created, capturing the spatio-temporal deformation of the 3D facial mesh sequence. Experiments have been implemented using the standard BU--4DFE dataset. The obtained retrieval results exceed the state-of-the-art results and the new descriptor is much more frugal in terms of space requirements. Furthermore, a methodology which exploits the retrieval results, in order to achieve unsupervised dynamic 3D facial expression recognition is presented, in order to directly compare the proposed descriptor against the wealth of works in recognition. The aforementioned unsupervised methodology outperforms the supervised dynamic 3D …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D object retrieval via range image queries in a bag-of-visual-words context",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-013-0876-3",
            "Abstract": "3D object retrieval based on range image queries that represent partial views of real 3D objects is presented. The complete 3D models of the database are described by a set of panoramic views, and a Bag-of-Visual-Words model is built using SIFT features extracted from them. To address the problem of partial matching, we suggest a histogram computation scheme, on the panoramic views, that represents local information by taking into account spatial context. Furthermore, a number of optimization techniques are applied throughout the process for enhancing the retrieval performance. Its superior performance is shown by evaluating it against state-of-the-art methods on standard datasets.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:eflP2zaiRacC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Hybrid off-line OCR for isolated handwritten Greek characters",
            "Publication year": 2007,
            "Publication url": "https://users.iit.demokritos.gr/~bgat/SPPRA_HOCR.pdf",
            "Abstract": "In this paper, we present an off-line OCR methodology for isolated handwritten Greek characters mainly based on a robust hybrid feature extraction scheme. First, image pre-processing is performed in order to normalize the character images as well as to correct character slant. At the next step, two types of features are combined in a hybrid fashion. The first one divides the character image into a set of zones and calculates the density of the character pixels in each zone. In the second type of features, the area that is formed from the projections of the upper and lower as well as of the left and right character profiles is calculated. For the classification step Support Vectors Machines (SVM) are used. The performance of the proposed methodology is demonstrated after testing with the CIL database (handwritten Greek character database), which was created from 100 different writers.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic Classification of Handwritten and Printed Text in ICR Boxes",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=8863566031847266787&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:jgBuDB5drN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "SjPerantonis.«",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=15950411536432262112&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:IRz6iEL74y4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comprehensive survey of LIDAR-based 3D object detection methods with Deep learning for autonomous driving",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0097849321001321",
            "Abstract": "LiDAR-based 3D object detection for autonomous driving has recently drawn the attention of both academia and industry since it relies upon a sensor that incorporates appealing features like insensitivity to light and capacity to capture the 3D spatial structure of an object along with the continuous reduction of its purchase cost.Furthermore, the emergence of Deep Learning as the means to boost performance in 3D data analysis stimulated the production of a multitude of solutions for LIDAR-based 3D object detection which followed different approaches in an effort to respond effectively to several challenges.In view of this, this paper presents a comprehensive survey of LIDAR-based 3D object detection methods wherein an analysis of existing methods is addressed by taking into account a new categorisation that relies upon a common operational pipeline which describes the end-to-end functionality of each method …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:LdasjJ6CEcoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Unsupervised human action retrieval using salient points in 3D mesh sequences",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-018-5855-2",
            "Abstract": "The problem of human action retrieval based on the representation of the human body as a 3D mesh is addressed. The proposed 3D mesh sequence descriptor is based on a set of trajectories of salient points of the human body: its centroid and its five protrusion ends. The extracted descriptor of the corresponding trajectories incorporates a set of significant features of human motion, such as velocity, total displacement from the initial position and direction. As distance measure, a variation of the Dynamic Time Warping (DTW) algorithm, combined with a k − means based method for multiple distance matrix fusion, is applied. The proposed method is fully unsupervised. Experimental evaluation has been performed on two artificial datasets, one of which is being made publicly available by the authors. The experimentation on these datasets shows that the proposed scheme achieves retrieval performance …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:XoXfffV-tXoC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Segmentation-based historical handwritten word spotting using document-specific local features",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6980989/",
            "Abstract": "Many word spotting strategies for the modern documents are not directly applicable to historical handwritten documents due to writing styles variety and intense degradation. In this paper, a new method that permits effective word spotting in handwritten documents is presented that relies upon document-specific local features which take into account texture information around representative key points. Experimental work on two historical handwritten datasets using standard evaluation measures shows the improved performance achieved by the proposed methodology.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A methodology for document image dewarping techniques performance evaluation",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5277561/",
            "Abstract": "One of the major challenges in camera document analysis is to deal with the page curl and perspective distortions. In spite of the prevalence of dewarping techniques, no standard for their performance evaluation method exists with most of the evaluation done to concentrate in visual pleasing impressions. This paper presents an objective evaluation methodology for document image dewarping techniques. First, manually selected sets of points of the initial warped image are matched with the corresponding points of the dewarping result using the scale invariant feature transform (SIFT). Each set corresponds to a representative text line of the image. Then, based on cubic polynomial curves that fit to the selected text lines, a comprehensive measure which reflects the entire performance of a dewarping technique in a concise quantitative manner is calculated. Experiments applying the proposed performance …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust multiscale deformable registration of 3D ultrasound images",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219467803001184",
            "Abstract": "In this paper, we embed the minimization scheme of an automatic 3D non-rigid registration method in a multiscale framework. The initial model formulation was expressed as a robust multiresolution and multigrid minimization scheme. At the finest level of the multiresolution pyramid, we introduce a focusing strategy from coarse-to-fine scales which leads to an improvement in the accuracy of the registration process. A focusing strategy has been tested for a linear and a non-linear scale-space. Results on real 3D ultrasound images are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:_FxGoFyzp5QC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Spatial sparsity-induced prediction (sip) for images and video: A simple way to reject structured interference",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5593881/",
            "Abstract": "We propose a prediction technique that is geared toward forming successful estimates of a signal based on a correlated anchor signal that is contaminated with complex interference. The corruption in the anchor signal involves intensity modulations, linear distortions, structured interference, clutter, and noise just to name a few. The proposed setup reflects nontrivial prediction scenarios involving images and video frames where statistically related data is rendered ineffective for traditional methods due to cross-fades, blends, clutter, brightness variations, focus changes, and other complex transitions. Rather than trying to solve a difficult estimation problem involving nonstationary signal statistics, we obtain simple predictors in linear transform domain where the underlying signals are assumed to be sparse. We show that these simple predictors achieve surprisingly good performance and seamlessly allow successful …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "H-DIBCO 2010-handwritten document image binarization competition",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5693650/",
            "Abstract": "H-DIBCO 2010 is the International Document Image Binarization Contest which is dedicated to handwritten document images organized in conjunction with ICFHR 2010 conference. The general objective of the contest is to identify current advances in handwritten document image binarization using meaningful evaluation performance measures. This paper reports on the contest details including the evaluation measures used as well as the performance of the 17 submitted methods along with a short description of each method.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:LO7wyVUgiFcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ICFHR2016 handwritten document image binarization contest (H-DIBCO 2016)",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7814134/",
            "Abstract": "H-DIBCO 2016 is the international Handwritten Document Image Binarization Contest organized in the context of ICFHR 2016 conference. The general objective of the contest is to identify current advances in document image binarization of handwritten document images using performance evaluation measures that are motivated by document image analysis and recognition requirements. This paper describes the contest details including the evaluation measures used as well as the performance of the 12 submitted methods along with a brief description of each method.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:gsN89kCJA0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Text line detection in handwritten documents",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320308001775",
            "Abstract": "In this paper, we present a new text line detection method for handwritten documents. The proposed technique is based on a strategy that consists of three distinct steps. The first step includes image binarization and enhancement, connected component extraction, partitioning of the connected component domain into three spatial sub-domains and average character height estimation. In the second step, a block-based Hough transform is used for the detection of potential text lines while a third step is used to correct possible splitting, to detect text lines that the previous step did not reveal and, finally, to separate vertically connected characters and assign them to text lines. The performance evaluation of the proposed approach is based on a consistent and concrete evaluation methodology.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Watershed-driven region-based image retrieval",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/1-4020-3443-1_19",
            "Abstract": "This paper presents a strategy for content-based image retrieval. It is based on a meaningful segmentation procedure that can provide proper distributions for matching via the Earth mover’s distance as a similarity metric. The segmentation procedure is based on a hierarchical watershed-driven algorithm that extracts automatically meaningful regions. In this framework, the proposed robust feature extraction plays a major role along with a novel region weighting for enhancing feature discrimination. Experimental results demonstrate the performance of the proposed strategy.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "A two-stage SVM-based mammographic CBIR for CADx",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Lazaros-Tsochatzidis/publication/292139533_A_two-stage_SVM-based_mammographic_CBIR_for_CADx/links/56a9dd5508aeaeb4cef9b048/A-two-stage-SVM-based-mammographic-CBIR-for-CADx.pdf",
            "Abstract": "In this work, a content-based image retrieval (CBIR)-computer aided diagnosis (CADx) scheme is proposed that aims to contribute on the decision-making process of a radiologist in the assessment of a mammographic case. The proposed scheme comprises two stages: The first one concerns a margin-specific CBIR scheme that utilizes a support vector machine (SVM) ensemble to produce vectors of likelihood for each margin type in a mass. In the second stage, a decision process is employed that is based on the top K retrieved images. Performance evaluation is addressed by using standard measures on a widely adopted digital database for screening mammography (DDSM).",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Querying 3D mesh sequences for human action retrieval",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7182714/",
            "Abstract": "In this paper, the unsupervised human action retrieval problem in 3D mesh sequences is addressed. An action is represented by a mesh sequence wherein each frame is represented by a static shape descriptor. Six state-of-the-art static descriptors are used to extract meaningful information of the mesh objects in the sequence. These descriptors are first examined in terms of similarity performance using Receiver Operating Characteristic (ROC) curves. Then, they are utilized in the action retrieval problem, where the query is a 3D mesh sequence. Each descriptor for an action, is considered as a multidimensional curve which traverses the corresponding points. The temporal similarity estimation is achieved by two variations of the descriptor's normalization in the context of Multidimensional Dynamic Time Warping. Experimental results are given for two standard datasets, one containing real data and another one …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:35r97b3x0nAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D object partial matching using panoramic views",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41190-8_19",
            "Abstract": "In this paper, a methodology for 3D object partial matching and retrieval based on range image queries is presented. The proposed methodology addresses the retrieval of complete 3D objects based on artificially created range image queries which represent partial views. The core methodology relies upon Dense SIFT descriptors computed on panoramic views. Performance evaluation builds upon the standard measures and a challenging 3D pottery dataset originated from the Hampson Archeological Museum collection.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multiresolution text detection in video frames.",
            "Publication year": 2007,
            "Publication url": "https://users.iit.demokritos.gr/~bgat/DIA_web/VISAPP_VOCR.pdf",
            "Abstract": "This paper proposes an algorithm for detecting artificial text in video frames using edge information. First, an edge map is created using the Canny edge detector. Then, morphological dilation and opening are used in order to connect the vertical edges and eliminate false alarms. Bounding boxes are determined for every non-zero valued connected component, consisting the initial candidate text areas. Finally, an edge projection analysis is applied, refining the result and splitting text areas in text lines. The whole algorithm is applied in different resolutions to ensure text detection with size variability. Experimental results prove that the method is highly effective and efficient for artificial text detection.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CIL3D: A content-based 3D model search engine",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1413634.1413737",
            "Abstract": "We present a prototype 3D model search engine called CIL3D (Computational Intelligence Laboratory 3D). CIL3D provides query-by-content 3D model search, by employing a state-of-the-art method [1] for the description of a 3D model, attaining top performance. The search engine is publicly accessible through the internet at: http://emedi3. emedi. iit. demokritos. gr/cil3d/.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accessing the content of greek historical documents",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1568296.1568307",
            "Abstract": "In this paper, we propose an alternative method for accessing the content of Greek historical documents printed during the 17th and 18th centuries by searching words directly in digitized documents based on word spotting, without the use of an optical character recognition engine. We describe a methodology according to which synthetic word images are created from keywords. These images are compared to all the words in the digitized documents while user feedback is used in order to refine the search procedure. In order to improve the efficiency of accessing and searching, we have used natural language processing techniques that comprise (i) a morphological generator for early Modern Greek which provides the users with the ability to search documents using only a word stem and locate all the corresponding inflected word forms and (ii) a synonym dictionary which facilitates access to the semantic context …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A word spotting framework for historical machineprinted documents, IJDAR",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=6778303864230717489&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:MpfHP-DdYjUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "ICFHR2016 handwritten keyword spotting competition (H-KWS 2016)",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7814133/",
            "Abstract": "The H-KWS 2016, organized in the context of the ICFHR 2016 conference aims at setting up an evaluation framework for benchmarking handwritten keyword spotting (KWS) examining both the Query by Example (QbE) and the Query by String (QbS) approaches. Both KWS approaches were hosted into two different tracks, which in turn were split into two distinct challenges, namely, a segmentation-based and a segmentation-free to accommodate different perspectives adopted by researchers in the KWS field. In addition, the competition aims to evaluate the submitted training-based methods under different amounts of training data. Four participants submitted at least one solution to one of the challenges, according to the capabilities and/or restrictions of their systems. The data used in the competition consisted of historical German and English documents with their own characteristics and complexities. This paper …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:kuK5TVdYjLIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Object-driven content-based image retrieval",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.77.8238&rep=rep1&type=pdf",
            "Abstract": "This paper presents a novel unsupervised strategy for content-based image retrieval. It is based on a meaningful segmentation procedure that can provide proper distributions for matching via the Earth mover's distance as a similarity metric. The segmentation procedure is based on a hierarchical watershed-driven algorithm that extracts meaningful regions automatically. In this framework, the proposed robust feature extraction and the many-to-many region matching along with the novel region weighting for enhancing feature discrimination play a major role. Experimental results demonstrate the performance of the proposed strategy.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:g5m5HwL7SMYC",
            "Publisher": "12th International Workshop on Systems, Signals and Image Processing (IWSSIP, pp. 189-193, Chalkida, Greece."
        },
        {
            "Title": "Towards Scientific Benchmarks: On Increasing the Credibility of Benchmarks",
            "Publication year": 2015,
            "Publication url": "https://diglib.eg.org/xmlui/bitstream/handle/10.2312/3dor.20151059.083-086/083-086.pdf?sequence=1",
            "Abstract": "Problem: Increasing the credibility of results from scientific benchmarks. Goal: Specify what exactly is required in order for a benchmark to be scientific. Contribution:(i) Specification of what it entails for a benchmark to be scientific,(ii) a metric for measuring the replicability of an experiment,(iii) a metric for measuring the replicability of a set of experiments, and (iv) Analysis of the replicability of SHREC 2015. Result: Replicability of SHREC 2015 can be increased by open sourcing the methods compared and improving documentation.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:fFSKOagxvKUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comprehensive overview of methodologies and performance evaluation frameworks in 3D mesh segmentation",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314215000028",
            "Abstract": "3D mesh segmentation has become a crucial part of many applications in 3D shape analysis. In this paper, a comprehensive survey on 3D mesh segmentation methods is presented. Analysis of the existing methodologies is addressed taking into account a new categorization along with the performance evaluation frameworks which aim to support meaningful benchmarks not only qualitatively but also in a quantitative manner. This survey aims to capture the essence of current trends in 3D mesh segmentation.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Non-rigid 3D object retrieval using topological information guided by conformal factors",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-012-0714-z",
            "Abstract": "Combining the properties of conformal geometry and graph-based topological information, a non-rigid 3D object retrieval methodology is proposed, which is both robust and efficient in terms of retrieval accuracy and computation speed. While graph-based methods are robust to non-rigid object deformations, they require intensive computation which can be reduced by the use of appropriate representations, addressed through geometry-based methods. In this respect, we present a 3D object retrieval methodology, which combines the above advantages in a unified manner. Furthermore, we propose a string matching strategy for the comparison of graphs which describe 3D objects.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Pratikakis,‖ A combined approach for the binarization of handwritten document images‖",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=1777496094562640312&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D-model retrieval using bag-of-features based on closed curves",
            "Publication year": 2013,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00806609/",
            "Abstract": "Bag-of-feature technique is a popular approach in areas of computer vision and pattern recognition. Recently, it plays an important role in shape analysis community and especially in 3D-model retrieval. We present our approach for partial 3D-model retrieval using this technique based on closed curves. We define an invariant scalar function on the surface based on the commute-time distance. Our mapping function respects important properties in order to compute robust closed curves. Each scale of our scalar function detects a small region. The form of these regions are encoded in the form of the closed curves. We generate a collection of closed curves from a source point detected automatically. Based on the collection of all closed curves extracted, we construct our bag-of-features. Then we cluster the bag-of-features in the sense in accurate categorization. The centres of classes are defined as keyshapes. This method is particularly interesting in the sense of quantifying the 3D-model by its keyshapes that are accumulated into an histogram. The results shows the robustness of our method (BOF) compared to a method based on indexed closed curves (ICC) on various 3D-models with different poses.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bag of words and local spectral descriptor for 3D partial shape retrieval",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.380.7984&rep=rep1&type=pdf",
            "Abstract": "This paper presents a 3D shape retrieval algorithm based on the Bag of Words (BoW) paradigm. For a given 3D shape, the proposed approach considers a set of feature points uniformly sampled on the surface and associated with local Fourier descriptors; this descriptor is computed in the neighborhood of each feature point by projecting the geometry onto the eigenvectors of the Laplace-Beltrami operator, it is highly discriminative, robust to connectivity and geometry changes and also fast to compute. In a preliminary step, a visual dictionary is built by clustering a large set of feature descriptors, then each 3D shape is described by an histogram of occurrences of these visual words. The performances of our approach have been compared against very recent state-of-theart methods on several different datasets. For global shape retrieval our approach is comparable to these recent works, however it clearly outperforms them in the case of partial shape retrieval.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pose normalization of 3D models via reflective symmetry on panoramic views",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-014-0935-4",
            "Abstract": "A novel pose normalization method, based on reflective symmetry computed on panoramic views, is presented. Qualitative and experimental investigation in 3D data-sets has led us to the observation that most objects possess a single plane of symmetry. Our approach is thus guided by this observation. Initially, through an iterative procedure, the symmetry plane of a 3D model is estimated, thus computing the first axis of the model. This is achieved by rotating the 3D model and computing reflective symmetry scores on panoramic view images. The other principal axes of the 3D model are estimated by computing the variance of the 3D model’s panoramic views. The proposed method is incorporated in a hybrid scheme, that serves as the pose normalization method in a state-of-the-art 3D object retrieval system. The effectiveness of this system, using the hybrid pose normalization scheme, is evaluated in terms …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:olpn-zPbct0C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Text line and word segmentation of handwritten documents",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320308005335",
            "Abstract": "In this paper, we present a segmentation methodology of handwritten documents in their distinct entities, namely, text lines and words. Text line segmentation is achieved by applying Hough transform on a subset of the document image connected components. A post-processing step includes the correction of possible false alarms, the detection of text lines that Hough transform failed to create and finally the efficient separation of vertically connected characters using a novel method based on skeletonization. Word segmentation is addressed as a two class problem. The distances between adjacent overlapped components in a text line are calculated using the combination of two distance metrics and each of them is categorized either as an inter- or an intra-word distance in a Gaussian mixture modeling framework. The performance of the proposed methodology is based on a consistent and concrete evaluation …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Learning kernels on extended Reeb graphs for 3D shape classification and retrieval",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2601307.2601312",
            "Abstract": "This paper addresses 3D shape classification and retrieval in terms of supervised selection of the most significant features in a space of attributed graphs encoding different shape characteristics. For this purpose, 3D models are represented as bags of shortest paths defined over well chosen Extended Reeb graphs, while the similarity between pairs of Extended Reeb graphs is addressed through kernels adapted to these descriptions. Given this set of kernels, a Multiple Kernel Learning algorithm is used to find an optimal linear combination of kernels for classification and retrieval purposes. Results are comparable with the best results of the literature, and the modularity and flexibility of the kernel learning ensure its applicability to a large set of methods.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nonlinear multiscale graph theory based segmentation of color images",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1699231/",
            "Abstract": "In this paper the issue of image segmentation within the framework of nonlinear multiscale watersheds in combination with graph theory based techniques is addressed. First, a graph is created which decomposes the image in scale and space using the concept of multiscale watersheds. In the subsequent step the obtained graph is partitioned using recursive graph cuts in a coarse to fine manner. In this way, we are able to combine scale and feature measures in a flexible way: the feature-set that is used to measure the dissimilarities may change as we progress in scale. We employ the earth mover's distance on a featureset that combines color, scale and contrast features to measure the dissimilarity between the nodes in the graph. Experimental results demonstrate the efficiency of the proposed method for natural scene images",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "自适应模糊文件图像的二值化",
            "Publication year": 2006,
            "Publication url": "http://www.cqvip.com/qk/95216x/200601/22352170.html",
            "Abstract": " 本文提出了一种新的自适应二值化方法,使模糊文件得到增强.这种方法不需要调整任何参数,它通过使用者及其对阴影,非均匀图像,低反差,大量的信号噪声,污点和变形等涉及的模糊情况,采用以下几个不同的步骤:低通Wiener滤波器的预处理,前景区域,背景表面的大致估算,背景表面与原始组合图像样本的组合计算以及最后的预处理过程,以改善文件的质量并保持笔划的连接.实验证明,本文的方法针对许多模糊图像具有优良的特性.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Content-based image retrieval via Multi-scale Graph-based Segmentation",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.127.1289&rep=rep1&type=pdf#page=46",
            "Abstract": "A region oriented strategy for content-based image retrieval is presented. It is based on a meaningful segmentation procedure that can provide proper distributions for matching through the Earth Mover’s Distance (EMD) as a similarity metric. The segmentation procedure is based on a multiscale watershed-driven algorithm which extracts meaningful regions using a graph-cut algorithm that operates on a multiscale region adjacency graph. In this framework, the proposed robust feature extraction and the many-to-many region matching along with the region weighting for enhancing feature discrimination play a major role. Experimental results demonstrate the performance of the proposed strategy.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effective descriptors for human action retrieval from 3D mesh sequences",
            "Publication year": 2019,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219467819500189",
            "Abstract": "Two novel methods for fully unsupervised human action retrieval using 3D mesh sequences are presented. The first achieves high accuracy but is suitable for sequences consisting of clean meshes, such as artificial sequences or highly post-processed real sequences, while the second one is robust and suitable for noisy meshes, such as those that often result from unprocessed scanning or 3D surface reconstruction errors. The first method uses a spatio-temporal descriptor based on the trajectories of 6 salient points of the human body (i.e. the centroid, the top of the head and the ends of the two upper and two lower limbs) from which a set of kinematic features are extracted. The resulting features are transformed using the wavelet transformation in different scales and a set of statistics are used to obtain the descriptor. An important characteristic of this descriptor is that its length is constant independent of the …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:ODE9OILHJdcC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "ICDAR2017 competition on document image binarization (DIBCO 2017)",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8270159/",
            "Abstract": "DIBCO 2017 is the international Competition on Document Image Binarization organized in conjunction with the ICDAR 2017 conference. The general objective of the contest is to identify current advances in document image binarization of machine-printed and handwritten document images using performance evaluation measures that are motivated by document image analysis and recognition requirements. This paper describes the competition details including the evaluation measures used as well as the performance of the 26 submitted methods along with a brief description of each method.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:q3CdL3IzO_QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantics extraction from images",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20795-2_3",
            "Abstract": "An overview of the state-of-the-art on semantics extraction from images is presented. In this survey, we present the relevant approaches in terms of content representation as well as in terms of knowledge representation. Knowledge can be represented in either implicit or explicit fashion while the image is represented in different levels, namely, low-level, intermediate and semantic level. For each combination of knowledge and image representation, a detailed discussion is addressed that leads to fruitful conclusions for the impact of each approach.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:GnPB-g6toBAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Automatic watershed segmentation of color images",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-306-47025-X_23",
            "Abstract": "This paper presents a fully automatic watershed color segmentation scheme which is an extension to color images of a previously reported approach dedicated to segmentation of scalar images. The importance of this extension lies mainly on its ability to automatically select an optimum result out of a hierarchical stack. This achievement is realized through the introduction of new evaluation methods for the segmentation quality of each level of the hierarchy which considers a tradeoff between the preservation of details and the suppression of heterogeneity. The first method estimates the local color error of the regions and combines it with the amount of regions. The second evaluates the contrast of the segmented image by combining a region uniformity with an inter-region contrast measure for all regions. These two methods are compared with respect to an existing one. Experimental results demonstrate the …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "ICDAR 2011 document image binarization contest",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=10450382492297539145&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:43bX7VzcjpAC",
            "Publisher": "ICDAR"
        },
        {
            "Title": "SSBC 2020: sclera segmentation benchmarking competition in the mobile environment",
            "Publication year": 2021,
            "Publication url": "http://dspace.iitrpr.ac.in:8080/xmlui/handle/123456789/1789",
            "Abstract": "The paper presents a summary of the 2020 Sclera Segmentation Benchmarking Competition (SSBC), the 7th in the series of group benchmarking efforts centred around the problem of sclera segmentation. Different from previous editions, the goal of SSBC 2020 was to evaluate the performance of sclera-segmentation models on images captured with mobile devices. The competition was used as a platform to assess the sensitivity of existing models to i) differences in mobile devices used for image capture and ii) changes in the ambient acquisition conditions. 26 research groups registered for SSBC 2020, out of which 13 groups took part in the final round and submitted a total of 16 segmentation models for scoring. These included a wide variety of deep-learning solutions as well as one approach based on standard image processing techniques. Experiments were conducted with three recent datasets. Most of the …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:4xDN1ZYqzskC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An objective evaluation methodology for document image binarization techniques",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4669964/",
            "Abstract": "Evaluation of document image binarization techniques is a tedious task that is mainly performedby a human expert or by involving an OCR engine. This paper presents an objective evaluation methodology for document image binarization techniques that aims to reduce the human involvement in the ground truth construction and consecutive testing. A skeletonized ground truth image is produced by the user following a semi-automatic procedure. The estimated ground truth image can aid in evaluating the binarization result in terms of recall and precision as well as to further analyze the result by calculating broken and missing text, deformations and false alarms. A detailed description of the methodology along with a benchmarking of the six (6) most promising state-of-the-art binarization algorithms based on the proposed methodology is presented.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Detecting text in video frames",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.76.3740&rep=rep1&type=pdf",
            "Abstract": "In this paper we propose an edge-based algorithm for artificial text detection in video frames. First, an edge map is created using the Canny edge detector. Then, morphological filtering is used, based on geometrical constraints, in order to connect the vertical edges and discard false alarms. A connected component analysis is performed to the filtered edge map in order to determine a bounding box for every candidate text area. Finally, horizontal and vertical projections are calculated on the edge map of every box and a threshold is applied, refining the result and splitting text areas in text lines. The whole algorithm is applied in multiresolution fashion to ensure text detection with size variability. Experimental results prove that the method is highly effective and efficient for artificial text detection.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Partial matching of 3D cultural heritage objects using panoramic views",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11042-014-2069-0.pdf",
            "Abstract": "In this paper, we present a method for partial matching and retrieval of 3D objects based on range image queries. The proposed methodology addresses the retrieval of complete 3D objects using range image queries that represent partial views. The core methodology relies upon Bag-of-Visual-Words modelling and enhanced Dense SIFT descriptor computed on panoramic views and range image queries. Performance evaluation builds upon standard measures and a challenging 3D pottery dataset originating from the Hampson Archaeological Museum collection.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "SHREC'08 Entry: Hybrid IIT-NCSR-Demokritos",
            "Publication year": 2008,
            "Publication url": "https://hal.inria.fr/hal-00759007/",
            "Abstract": "In this paper, we present an overview of the 3D object retrieval method that we employed in our participation to the Generic Models track of SHREC 2008 organized by the AIM@ SHAPE network of excellence. The proposed methodology is detailed in [2]. Our method is based on a hybrid scheme where 2D features as well as 3D features are extracted from a 3D model which has been previously normalized for rotation using two alternative alignment techniques. The alignment methods that are used are CPCA and NPCA. The 2D features are Fourier coefficients extracted from a set of depth buffers and the 3D features are spherical harmonic coefficients extracted from a spherical function-based representation of a 3D model.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:9pM33mqn1YgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An adaptive binarization technique for low quality historical documents",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-28640-0_10",
            "Abstract": "Historical document collections are a valuable resource for human history. This paper proposes a novel digital image binarization scheme for low quality historical documents allowing further content exploitation in an efficient way. The proposed scheme consists of five distinct steps: a pre-processing procedure using a low-pass Wiener filter, a rough estimation of foreground regions using Niblack’s approach, a background surface calculation by interpolating neighboring background intensities, a thresholding by combining the calculated background surface with the original image and finally a post-processing step in order to improve the quality of text regions and preserve stroke connectivity. The proposed methodology works with great success even in cases of historical manuscripts with poor quality, shadows, nonuniform illumination, low contrast, large signal- dependent noise, smear and strain. After …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Panorama: A 3d shape descriptor based on panoramic views for unsupervised 3d object retrieval",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11263-009-0281-6",
            "Abstract": "We present a novel 3D shape descriptor that uses a set of panoramic views of a 3D object which describe the position and orientation of the object’s surface in 3D space. We obtain a panoramic view of a 3D object by projecting it to the lateral surface of a cylinder parallel to one of its three principal axes and centered at the centroid of the object. The object is projected to three perpendicular cylinders, each one aligned with one of its principal axes in order to capture the global shape of the object. For each projection we compute the corresponding 2D Discrete Fourier Transform as well as 2D Discrete Wavelet Transform. We further increase the retrieval performance by employing a local (unsupervised) relevance feedback technique that shifts the descriptor of an object closer to its cluster centroid in feature space. The effectiveness of the proposed 3D object retrieval methodology is demonstrated via an …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "SHREC 2009-Shape Retrieval Contest.",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/51039841/SHREC_2009_-_Shape_Retrieval_Contest20161224-693-1q96mcz.pdf",
            "Abstract": "The general objective of the 3D Shape Retrieval Contest (see http://www. aimatshape. net/event/SHREC) is to evaluate the effectiveness of 3D-shape retrieval algorithms. After three years of success, the contest is now organized in conjunction with the Eurographics Workshop on 3D Object Retrieval, where the evaluation results are presented.Thanks to the effort of previous track organizers, SHREC already provides many resources to compare and evaluate 3D retrieval methods. For this year’s contest, we aimed at new and updated tracks. This time, three track were run: generic shape retrieval, querying with partial 3D models, and structural retrieval of watertight models.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An overview of partial 3D object retrieval methodologies",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-014-2267-9",
            "Abstract": "This work offers an overview of the state-of-the-art on the emerging area of 3D object retrieval based on partial queries. This research area is associated with several application domains, including face recognition and digital libraries of cultural heritage objects. The existing partial 3D object retrieval methods can be mainly classified as: i) view-based, ii) part-based, iii) bag of visual words (BoVW)-based, and iv) hybrid methods combining these three main paradigms or methods which cannot be straightforwardly classified. Several methodological aspects are identified, including the use of interest points and the exploitation of 2.5D projections, whereas the available evaluation datasets and campaigns are addressed. A thorough discussion follows, identifying advantages and limitations.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Local shape descriptors, a survey and evaluation",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2381170.2381180",
            "Abstract": "Local shape descriptors can be used for a variety of tasks, from registration to comparison to shape analysis and retrieval. There have been a variety of local shape descriptors developed for these tasks, which have been evaluated in isolation or in pairs, but not against each other. We provide a survey of existing descriptors and a framework for comparing them. We perform a detailed evaluation of the descriptors using real data sets from a variety of sources. We first evaluate how stable these metrics are under changes in mesh resolution, noise, and smoothing. We then analyze the discriminatory ability of the descriptors for the task of shape matching. Our conclusion is that sampling the normal distribution and the mean curvature, using 25 samples, and reducing this data to 5-10 samples via Principal Components Analysis provides robustness to noise and the best shape discrimination results.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Description and evaluation of tools for DIA HTR and KWS (M12)",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=1418072205478663406&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:7Hz3ACDFbsoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RETRIEVAL 3D: An On-line Content-Based Retrieval Per-formance Evaluation Tool",
            "Publication year": 2015,
            "Publication url": "http://diglib.eg.org/bitstream/handle/10.2312/3dor.20151062.095-098/095-098.pdf?sequence=1&isAllowed=y",
            "Abstract": "Performance benchmarking is an absolute necessity when attempting to objectively quantify the performance of content-based retrieval methods. For many years now, a number of plot-based and scalar-based measures in combination with benchmark datasets have already been used in order to provide objective results. In this work, we present the first version of an integrated on-line content-based retrieval evaluation tool, named RETRIEVAL3D, which can be used in order to quantify the performance of a retrieval method. The current version of the system offers a set of popular performance measures that can be accessed through a dynamic visualisation environment. The user is able to upload retrieval results using different input data structures (eg binary ranked lists, floating point ranked lists, dissimilarity matrices and groundtruth data) that are already encountered in the literature including the SHREC …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:8xutWZnSdmoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Segmentation-free word spotting in historical printed documents",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5277703/",
            "Abstract": "In this paper, a new efficient word spotting methodology is presented that can be applied to historical printed documents without requiring any previous block or word segmentation step. Our aim is to address a methodology which is segmentation-free since in many cases of historical documents, the segmentation process does not produce meaningful results due to unconstraint layout, several degradations or typesetting imperfections. The proposed method is based on block-based document image descriptors that are used at a template matching process satisfying invariance in terms of translation, rotation and scaling. Improvement in terms of time expense is obtained by applying the matching process only on salient regions of the image. Experimental results on a database with representative historical printed documents prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ensemble of PANORAMA-based convolutional neural networks for 3D model classification and retrieval",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0097849317301978",
            "Abstract": "A novel method for the classification and retrieval of 3D models is proposed; it exploits the 2D panoramic view representation of 3D models as input to an ensemble of convolutional neural networks which automatically compute the features. The first step of the proposed pipeline, pose normalization is performed using the SYMPAN method, which is also computed on the panoramic view representation. In the training phase, three panoramic views corresponding to the major axes, are used for the training of an ensemble of convolutional neural networks. the panoramic views consist of 3-channel images, containing the Spatial Distribution Map, the Normals’ Deviation Map and the magnitude of the Normals’ Devation Map Gradient Image. The proposed method aims at capturing feature continuity of 3D models, while simultaneously minimizing data preprocessing via the construction of an augmented image …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:i2xiXl-TujoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Knowledge acquisition from multimedia content using an evolution framework",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_65",
            "Abstract": "We propose an approach to knowledge acquisition, which uses multimedia ontologies for fused extraction of semantics from multiple modalities, and feeds back the extracted information, aiming to evolve knowledge representation. This paper presents the basic components of the proposed approach and discusses the open research issues focusing on the fused information extraction that will enable the development of scalable and precise knowledge acquisition technology.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Automatic table detection in document images",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11551188_67",
            "Abstract": "In this paper, we propose a novel technique for automatic table detection in document images. Lines and tables are among the most frequent graphic, non-textual entities in documents and their detection is directly related to the OCR performance as well as to the document layout description. We propose a workflow for table detection that comprises three distinct steps: (i) image pre-processing; (ii) horizontal and vertical line detection and (iii) table detection. The efficiency of the proposed method is demonstrated by using a performance evaluation scheme which considers a great variety of documents such as forms, newspapers/magazines, scientific journals, tickets/bank cheques, certificates and handwritten documents.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A multigrid method for motion estimation based on diffusion process",
            "Publication year": 2002,
            "Publication url": "https://researchportal.vub.be/en/publications/a-multigrid-method-for-motion-estimation-based-on-diffusion-proce",
            "Abstract": "A multigrid method for motion estimation based on diffusion process — Vrije Universiteit \nBrussel Skip to main navigation Skip to search Skip to main content Vrije Universiteit Brussel \nLogo Help & FAQ English Nederlands Home Research Units Profiles Projects Research output \nActivities Equipment Prizes Press / Media Student theses Impacts Search by expertise, name or \naffiliation A multigrid method for motion estimation based on diffusion process Lixin Yang, \nHichem Sahli, Ioanis Pratikakis Electronics and Informatics Vrije Universiteit Brussel Research \noutput: Chapter in Book/Report/Conference proceeding › Conference paper Overview Original \nlanguage English Title of host publication 6th World Multiconference on Systemics, Cybernetics \nand Informatics (SCI 2002) Publisher 6th World Multiconference on Systemics, Cybernetics \nand Informatics (SCI 2002), Vol. III, pp. -222, USA. Pages 222 Number of pages 1 - - : …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:2tRrZ1ZAMYUC",
            "Publisher": "6th World Multiconference on Systemics, Cybernetics and Informatics (SCI 2002), Vol. III, pp. 216-222, USA."
        },
        {
            "Title": "Text Detection on Natural Images Using Mnemonic Cellular Automata.",
            "Publication year": 2014,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=15575969&AN=98321902&h=ZOfGWE3b%2Bm3UwF351WmEjc6HBwmqFQtVMrLFPIsHl%2BFPYdcKBv6RKdJV6TariGsOwZcZP3o8yV2veiUq2AxfOA%3D%3D&crl=c",
            "Abstract": "Textual information that resides in natural images is an important knowledge for indexing and retrieval purposes. In this paper, a new approach is proposed using Mnemonic Cellular Automata (m-CA) which strives towards detecting scene text on natural images. Initially, an edge map is calculated and consequently binarized. Then, taking advantage of the Hybrid Cellular Automata (CA) flexibility, the transition rules are changed and are applied in different consecutive steps. Initially, its rules partially depend on Coordinating Logic Filters (CLF) and the majority state. Moreover, in the final steps of the m-CA evolution the update rules are modified as the history of past evolution steps is incorporated into each cell. Experimental work on the ICDAR 2011 Robust Reading Competition dataset shows improved performance.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On 3d object retrieval benchmarking",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/3DRes.04%282013%293",
            "Abstract": "The continuous evolution of 3D computer graphics and the progress of 3D digitization systems resulted in a continuous increase in the available 3D content. The widespread use of 3D objects in diverse domains contributed on forming 3D object retrieval as an active research field. In order to objectively evaluate the performance of retrieval methodologies there is a need for objective benchmarking schemes. In this work, we provide a comprehensive overview of the state-of-the-art evaluation methodologies including not only the performance measures but also the corresponding benchmark datasets. Meaningful benchmark datasets are discussed while a detailed list of publicly available 3D model repositories is given organized in terms of application domains, content magnitude and data types.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "An old greek handwritten OCR system based on an efficient segmentation-free approach",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/44158986/An_old_greek_handwritten_OCR_system_base20160327-30243-jc6gh9.pdf",
            "Abstract": "Recognition of Old Greek Early Christian manuscripts is essential for efficient content exploitation of the valuable Old Greek Early Christian historical collections. In this paper, we focus on the problem of recognizing Old Greek manuscripts and propose a novel recognition technique that has been tested in a large number of important historical manuscript collections which are written in lowercase letters and originate from St. Catherine’s Mount Sinai Monastery. Based on an open and closed cavity character representation, we propose a novel, segmentation-free, fast and efficient technique for the detection and recognition of characters and character ligatures. First, we detect open and closed cavities that exist in the skeletonized character body. Then, the classification of a specific character or",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:v1_lew4L6wgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A GPU based high-efficient and accurate optimal pose alignment approach of 3D objects",
            "Publication year": 2011,
            "Publication url": "http://diglib.eg.org/bitstream/handle/10.2312/3DOR.3DOR11.097-100/097-100.pdf",
            "Abstract": "In this paper we present a new method for alignment of 3D objects. This approach is based on the exhaustive optimization search in the 3D space using GPU based genetic algorithm. The descriptor of 3D object used as the objective function to be optimized is a newly developed pose-variant similarity measure, which is obtained directly from the voxelized model’s geometry and could be entirely implemented on the GPU. In order to reduce the traditional optimal algorithms’ large processing time, we exploit the GPU’s highly parallel architecture and transport our approach from CPU to GPU. Experimental results show that the proposed method is superior to existing normalization techniques such as PCA and provides a high degree of precision to align 3D objects.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ZzlSgRqYykMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting the PANORAMA Representation for Convolutional Neural Network Classification and Retrieval.",
            "Publication year": 2017,
            "Publication url": "https://www.academia.edu/download/53411434/PANORAMA-NN-3dor17-fin-DRAFT.pdf",
            "Abstract": "A novel 3D model classification and retrieval method, based on the PANORAMA representation and Convolutional Neural Networks, is presented. Initially, the 3D models are pose normalized using the SYMPAN method and consecutively the PANORAMA representation is extracted and used to train a convolutional neural network. The training is based on an augmented view of the extracted panoramic representation views. The proposed method is tested in terms of classification and retrieval accuracy on standard large scale datasets.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Word Spotting as a Service for Handwritten Documents",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9427583/",
            "Abstract": "In this paper, a segmentation-free and training-free word spotting method is proposed that allows mobile device users to search instances of a query word in handwritten document collections. The method is based on a document-oriented keypoint and feature extraction pipeline together with a fast feature matching method that permits the pipeline to be effectively employed in the cloud and to be introduced as a service in modern mobile device units. Evaluation results on two segmentation-free historical handwritten datasets show the efficiency of the proposed method in terms of matching accuracy along with its fast retrieval time.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:PVgj2kMGcgYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Locating text in historical collection manuscripts",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_50",
            "Abstract": "It is common that documents belonging to historical collections are poorly preserved and are prone to degradation processes. The aim of this work is to leverage state-of-the-art techniques in digital image binarization and text identification for digitized documents allowing further content exploitation in an efficient way. A novel methodology is proposed that leads to preservation of meaningful textual information in low quality historical documents. The method has been developed in the framework of the Hellenic GSRT- funded R&D project, D-SCRIBE, which aims at developing an integrated system for digitization and processing of old Hellenic manuscripts. After testing of the proposed method on numerous low quality historical manuscripts, it has turned out that our methodology performs better compared to current state-of- the-art adaptive thresholding techniques.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Template based shape descriptor",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2381128.2381130",
            "Abstract": "We introduce a new 3D shape descriptor which maps the surface features onto an arbitrary template surface using mean-value interpolation. A compact numerical shape descriptor is extracted using manifold harmonics on the template. We show that mean-value interpolation is a strong alternative to the often used projection. The utility of using different templates is established by showing that concatenating descriptors coming from different templates improves retrieval quality.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fisher encoding of differential fast point feature histograms for partial 3D object retrieval",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320316000595",
            "Abstract": "Partial 3D object retrieval has attracted intense research efforts due to its potential for a wide range of applications, such as 3D object repair and predictive digitization. This work introduces a partial 3D object retrieval method, applicable on both point clouds and structured 3D models, which is based on a shape matching scheme combining local shape descriptors with their Fisher encodings. Experiments on the SHREC 2013 large-scale benchmark dataset for partial object retrieval, as well as on the publicly available Hampson pottery dataset, demonstrate that the proposed method outperforms seven recently evaluated partial retrieval methods.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A two-stage scheme for text detection in video images",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0262885610000430",
            "Abstract": "This paper proposes a two-stage system for text detection in video images. In the first stage, text lines are detected based on the edge map of the image leading in a high recall rate with low computational time expenses. In the second stage, the result is refined using a sliding window and an SVM classifier trained on features obtained by a new Local Binary Pattern-based operator (eLBP) that describes the local edge distribution. The whole algorithm is used in a multiresolution fashion enabling detection of characters for a broad size range. Experimental results, based on a new evaluation methodology, show the promising overall performance of the system on a challenging corpus, and prove the superior discriminating ability of the proposed feature set against the best features reported in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:0EnyYjriUFMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "3D Object Retrieval using an Efﬁcient and Compact Hybrid Shape Descriptor",
            "Publication year": 2008,
            "Publication url": "https://hal.inria.fr/hal-00758995/",
            "Abstract": "We present a novel 3D object retrieval method that relies upon a hybrid descriptor which is composed of 2D features based on depth buffers and 3D features based on spherical harmonics. To compensate for rotation, two alignment methods, namely CPCA and NPCA, are used while compactness is supported via scalar feature quantization to a set of values that is further compressed using Huffman coding. The superior performance of the proposed retrieval methodology is demonstrated through an extensive comparison against state-of-the-art methods on standard datasets",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "emedi: Web-based e-training for multimodal breast imaging",
            "Publication year": 2007,
            "Publication url": "https://users.iit.demokritos.gr/~ipratika/publications/journals/IJBMS08.pdf",
            "Abstract": "In this paper, a Web-based e-Training platform that is dedicated to multimodal breast imaging is presented. The assets of this platform are summarised in (i) the efficient representation of the curriculum flow that will permit efficient training;(ii) efficient tagging of multimodal content appropriate for the completion of realistic cases and (iii) ubiquitous accessibility and platform independence via a web-based approach.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A review on 3D object retrieval methodologies using a part-based representation",
            "Publication year": 2014,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/16864360.2014.914385",
            "Abstract": "A comprehensive overview of 3D Object Retrieval methodologies that use a part-based representation is presented. Taking into account the typical operational pipeline we detail each distinct module and we provide a comparative study between the individual modules as well as the global methodologies. This study relies upon the 3D mesh segmentation scheme used, the feature extraction method chosen, as well as the selected graph matching methodology.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Document Image Binarization Contest",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=8718653722621107633&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:1lhNe0rCu4AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Handwritten and machine printed text separation in document images using the bag of visual words paradigm",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6424377/",
            "Abstract": "In a number of types of documents, ranging from forms to archive documents and books with annotations, machine printed and handwritten text may be present in the same document image, giving rise to significant issues within a digitisation and recognition pipeline. It is therefore necessary to separate the two types of text before applying different recognition methodologies to each. In this paper, a new approach is proposed which strives towards identifying and separating handwritten from machine printed text using the Bag of Visual Words paradigm (BoVW). Initially, blocks of interest are detected in the document image. For each block, a descriptor is calculated based on the BoVW. The final characterization of the blocks as Handwritten, Machine Printed or Noise is made by a Support Vector Machine classifier. The promising performance of the proposed approach is shown by using a consistent evaluation …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Visual vocabulary signature for 3D object retrieval and partial matching",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2381128.2381134",
            "Abstract": "In this paper a novel object signature is proposed for 3D object retrieval and partial matching. A part-based representation is obtained by partitioning the objects into subparts and by characterizing each segment with different geometric descriptors. Therefore, a Bag ofWords framework is introduced by clustering properly such descriptors in order to define the so called 3D visual vocabulary. In this fashion, the object signature is defined as a histogram of 3D visual word occurrences. Several examples on the [email protected] watertight dataset demonstrate the versatility of the proposed method in matching either 3D objects with articulated shape changes or partially occluded or compound objects. In particular, a comparison with the methods that participated to the Shape Retrieval contest 2007 (SHREC) reports satisfactory results for both object retrieval and partial matching.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D2. 1 methodology for semantics extraction from multimedia content",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/30675177/10.1.1.84.9929.pdf",
            "Abstract": "(for dissemination) This document outlines the “Methodology for Semantics Extraction from Multimedia Content” that will be followed in the framework of the BOEMIE project. The basic aim is to describe the architecture and methods that will be used in each particular modality (text, image, video-audio) for extracting semantics from multimedia content using an ontology-driven framework. Furthermore it aims at answering the key research questions that need to be addressed in order for ontology-driven semantics extraction from multimedia content to be possible. These key issues are:(a) how ontology guides the extraction process, and (b) how the multimedia information extraction provides the means for ontology population and enrichment.This document may not be copied, reproduced, or modified in whole or in part for any purpose, without written permission from the BOEMIE consortium. In addition to such written permission to copy, reproduce, or modify this document in whole or part, an acknowledgement of the authors of the document and all applicable portions of the copyright notice must be clearly referenced.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Frontmatter Eurographics 2015 Workshop on 3D Object Retrieval",
            "Publication year": 2015,
            "Publication url": "http://diglib.eg.org/handle/10.2312/3dor.20152006.3DOR2015_frontmatter",
            "Abstract": "Frontmatter Eurographics 2015 Workshop on 3D Object Retrieval Toggle navigation Login \nToggle navigation View Item Eurographics DL Home Eurographics Workshops and Symposia \n3DOR: Eurographics Workshop on 3D Object Retrieval 3DOR 15 View Item Eurographics DL \nHome Eurographics Workshops and Symposia 3DOR: Eurographics Workshop on 3D Object \nRetrieval 3DOR 15 View Item Frontmatter Eurographics 2015 Workshop on 3D Object Retrieval \nThumbnail View/Open 3DOR2015_frontmatter.pdf (407.2Kb) Date 2015 Author Pratikakis, \nIoannis Theoharis, Theoharis Spagnuolo, Michela Van Gool, Luc Veltkamp, Remco Godil, \nAfzal Pay-Per-View via TIB Hannover: Try if this item/paper is available. Metadata Show full \nitem record URI http://dx.doi.org/10.2312/3dor.Collections 3DOR 15 Eurographics Association \ncopyright © 2013 - 2021 Send Feedback | Contact - Imprint | Data Privacy Policy | Disable …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "The Eurographics Association"
        },
        {
            "Title": "Nickolas S, Sapidis",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=6322402969450451179&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:lgwcVrK6X84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A word spotting framework for historical machine-printed documents",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s10032-010-0134-4",
            "Abstract": "In this paper, we propose a word spotting framework for accessing the content of historical machine-printed documents without the use of an optical character recognition engine. A preprocessing step is performed in order to improve the quality of the document images, while word segmentation is accomplished with the use of two complementary segmentation methodologies. In the proposed methodology, synthetic word images are created from keywords, and these images are compared to all the words in the digitized documents. A user feedback process is used in order to refine the search procedure. The methodology has been evaluated in early Modern Greek documents printed during the seventeenth and eighteenth century. In order to improve the efficiency of accessing and search, natural language processing techniques have been addressed that comprise a morphological generator that enables …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A survey on facial expression recognition in 3D video sequences",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-014-1869-6",
            "Abstract": "Facial expression recognition constitutes an active research area due to its various applications. This survey addresses methodologies for 3D mesh video facial expression recognition. Recognition is, actually, a special case of intra-class retrieval. The approaches are analyzed and compared in detail. They are primarily categorized according to the 3D dynamic face analysis technique used. In addition, currently available datasets, used for 3D video facial expression analysis, are presented. Finally, future challenges that can be addressed in order for 3D video facial expression recognition field to be further improved, are extensively discussed.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:J-pR_7NvFogC",
            "Publisher": "Springer US"
        },
        {
            "Title": "In New Trends in Image Analysis and Processing–ICIAP 2013",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=2061427722045652522&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:mNrWkgRL2YcC",
            "Publisher": "Springer"
        },
        {
            "Title": "Text line detection in handwritten documents",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=194740801757705435&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present a new text line detection method for handwritten documents. The proposed technique is based on a strategy that consists of three distinct steps. The first step includes image binarization and enhancement, connected component extraction, partitioning of the connected component domain into three spatial sub-domains and average character height estimation. In the second step, a block-based Hough transform is used for the detection of potential text lines while a third step is used to correct possible splitting, to detect text lines that the previous step did not reveal and, finally, to separate vertically connected characters and assign them to text lines. The performance evaluation of the proposed approach is based on a consistent and concrete evaluation methodology.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "D5. 1.2: Description and evaluation of software for integrating interactive DIA, HTR, and KWS",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=17933771573288584669&hl=en&oi=scholarr",
            "Abstract": "This document describes work which is being carried out for the development of interactive approaches for HTR and related technologies (DIA and KWS). It also contains details about design of the tranScriptorium workbenchs.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:HIFyuExEbWQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Action unit detection in 3 D facial videos with application in facial expression retrieval and recognition",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-018-5699-9",
            "Abstract": "This work introduces a new scheme for action unit detection in 3D facial videos. Sets of features that define action unit activation in a robust manner are proposed. These features are computed based on eight detected facial landmarks on each facial mesh that involve angles, areas and distances. Support vector machine classifiers are then trained using the above features in order to perform action unit detection. The proposed AU detection scheme is used in a dynamic 3D facial expression retrieval and recognition pipeline, highlighting the most important AU s, in terms of providing facial expression information, and at the same time, resulting in better performance than state-of-the-art methodologies.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Springer US"
        },
        {
            "Title": "e-Medi: A Web-based e-Training Platform for Breast Imaging.",
            "Publication year": 2007,
            "Publication url": "https://www.scitepress.org/Papers/2007/12810/12810.pdf",
            "Abstract": "This paper concerns a Web-based e-Training platform that is dedicated to multimodal breast imaging. The assets of this platform are summarised in the following:(i) the efficient representation of the curriculum flow that will permit efficient training;(ii) efficient tagging of multimodal content appropriate for the completion of realistic cases and (iii) ubiquitous accessibility and platform independence via a web-based approach.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:sNmaIFBj_lkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Text detection in indoor/outdoor scene images",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/38302259/cbdar2005.pdf",
            "Abstract": "In this paper, we propose a novel methodology for text detection in indoor/outdoor scene images. The proposed methodology is based on an efficient binarization and enhancement technique followed by a suitable connected component analysis procedure. Image binarization successfully process indoor/outdoor scene images having shadows, non-uniform illumination, low contrast and large signal-depended noise. Connected component analysis is used to define the final binary images that mainly consist of text regions. The proposed methodology leads in increased success rates at commercial OCR engines. Experimental results based on the public database of the ICDAR2003 Robust Reading Competition prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-Time Semantic Image Segmentation with Deep Learning for Autonomous Driving: A Survey",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1280832",
            "Abstract": "Semantic image segmentation for autonomous driving is a challenging task due to its requirement for both effectiveness and efficiency. Recent developments in deep learning have demonstrated important performance boosting in terms of accuracy. In this paper, we present a comprehensive overview of the state-of-the-art semantic image segmentation methods using deep-learning techniques aiming to operate in real time so that can efficiently support an autonomous driving scenario. To this end, the presented overview puts a particular emphasis on the presentation of all those approaches which permit inference time reduction, while an analysis of the existing methods is addressed by taking into account their end-to-end functionality, as well as a comparative study that relies upon a consistent evaluation framework. Finally, a fruitful discussion is presented that provides key insights for the current trend and future research directions in real-time semantic image segmentation with deep learning for autonomous driving.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:nRpfm8aw39MC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Towards Free-Hand 3-D Ultrasound",
            "Publication year": 2002,
            "Publication url": "https://hal.inria.fr/inria-00072189/",
            "Abstract": "Motivated by a long term goal to develop a freehand 3-D ultrasound system which will be set up as a basic module in a neurosurgical environment we combined an existing tool which is dedicated to acquisition and visualizati- on of 3-D Ultrasound, the so-called with an optical tracker which is the most appropriate position tracker for such an environment. This report aims to transfer the experience that has been achieved during the construction of the freehand 3-D ultrasound set up and pinpoint crucial aspects which have been emerged during the period of experimenting in a clinical environment with cases which can be met in a daily routine. Our experimental results concern the examination of the transfontanelle of the brain and the carotid.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer-aided diagnosis of mammographic masses based on a supervised content-based image retrieval approach",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320317302194",
            "Abstract": "In this work, the incorporation of content-based image retrieval (CBIR) into computer aided diagnosis (CADx) is investigated, in order to contribute to the decision-making process of radiologists in the characterization of mammographic masses. The proposed scheme comprises two stages: A margin-specific supervised CBIR stage that retrieves images from reference cases along with a decision stage that is based on the retrieved items. The feature set utilized exploits state-of-the-art features along with a newly proposed texture descriptor, namely mHOG, targeted to capturing margin and core specific mass properties. Performance evaluation considers the CBIR and diagnosis stages separately and is addressed by using standard measures on an enhanced version of the widely adopted digital database for screening mammography (DDSM). The proposed scheme achieved improved performance of CADx of …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Improved document image binarization by using a combination of multiple binarization techniques and adapted edge information",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4761534/",
            "Abstract": "This paper presents a new adaptive approach for document image binarization. The proposed method is mainly based on the combination of several state- of-the-art binarization methodologies as well as on the efficient incorporation of the edge information of the gray scale source image. An enhancement step based on mathematical morphology operations is also involved in order to produce a high quality result while preserving stroke information. The proposed method demonstrated superior performance against six (6) well-known techniques on numerous degraded handwritten and machine- printed documents. The performance evaluation is based on visual criteria as well as on an objective evaluation methodology.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Geotopo: Dynamic 3D facial expression retrieval using topological and geometric information",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2854124.2854126",
            "Abstract": "Recently, a lot of research has been dedicated to address the problem of facial expression recognition in dynamic sequences of 3D face scans. On the contrary, no research has been conducted on facial expression retrieval using dynamic 3D face scans. This paper illustrates the first results on the area of dynamic 3D facial expression retrieval. To this end, a novel descriptor is created, namely GeoTopo, capturing the topological as well as the geometric information of the 3D face scans along time. Experiments have been implemented using the angry, happy and surprise expressions of the publicly available dataset BU--4DFE. The obtained retrieval results are very promising. Furthermore, a methodology which exploits the retrieval results, in order to achieve unsupervised dynamic 3D facial expression recognition, is presented. The aforementioned unsupervised methodology achieves classification accuracy …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Goal-oriented rectification of camera-based document images",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5585760/",
            "Abstract": "Document digitization with either flatbed scanners or camera-based systems results in document images which often suffer from warping and perspective distortions that deteriorate the performance of current OCR approaches. In this paper, we present a goal-oriented rectification methodology to compensate for undesirable document image distortions aiming to improve the OCR result. Our approach relies upon a coarse-to-fine strategy. First, a coarse rectification is accomplished with the aid of a computationally low cost transformation which addresses the projection of a curved surface to a 2-D rectangular area. The projection of the curved surface on the plane is guided only by the textual content's appearance in the document image while incorporating a transformation which does not depend on specific model primitives or camera setup parameters. Second, pose normalization is applied on the word level aiming …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unsupervised spectral mesh segmentation driven by heterogeneous graphs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7437462/",
            "Abstract": "A fully automatic mesh segmentation scheme using heterogeneous graphs is presented. We introduce a spectral framework where local geometry affinities are coupled with surface patch affinities. A heterogeneous graph is constructed combining two distinct graphs: a weighted graph based on adjacency of patches of an initial over-segmentation, and the weighted dual mesh graph. The partitioning relies on processing each eigenvector of the heterogeneous graph Laplacian individually, taking into account the nodal set and nodal domain theory. Experiments on standard datasets show that the proposed unsupervised approach outperforms the state-of-the-art unsupervised methodologies and is comparable to the best supervised approaches.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:epqYDVWIO7EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Greek Handwritten character recognition",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.81.7075&rep=rep1&type=pdf",
            "Abstract": "In this paper, we present a database and methods for off-line isolated Greek handwritten character recognition. The Computational Intelligence Laboratory (CIL) Database consists of 35,000 isolated and labelled Greek handwritten characters. This database was tested with an existing structural approach for Greek handwritten characters as well as with a novel approach based on a hybrid feature extraction scheme. According to this approach, two types of features are combined in a hybrid fashion. The first one divides the character image into a set of zones and calculates the density of the character pixels in each zone. In the second type of features, the area that is formed from the projections of the upper and lower as well as of the left and right character profiles is calculated. For the classification step, Support Vectors Machines (SVM) and Euclidean Minimum Distance Classifier (EMDC) are used.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A segmentation-free recognition technique to assist old Greek handwritten manuscript OCR",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-28640-0_7",
            "Abstract": "Recognition of old Greek manuscripts is essential for quick and efficient content exploitation of the valuable old Greek historical collections. In this paper, we focus on the problem of recognizing early Christian Greek manuscripts written in lower case letters. Based on the existence of hole regions in the majority of characters and character ligatures in these scripts, we propose a novel, segmentation-free, fast and efficient technique that assists the recognition procedure by tracing and recognizing the most frequently appearing characters or character ligatures. First, we detect hole regions that exist in the character body. Then, the protrusions in the outer contour outline of the connected components that contain the character hole regions are used for the classification of the area around holes to a specific character or a character ligature. The proposed method gives highly accurate results and offers great …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:HDshCWvjkbEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Scene text detection on images using cellular automata",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33350-7_53",
            "Abstract": "Textual information in images constitutes a very rich source of high-level semantics for retrieval and indexing. In this paper, a new approach is proposed using Cellular Automata (CA) which strives towards identifying scene text on natural images. Initially, a binary edge map is calculated. Then, taking advantage of the CA flexibility, the transition rules are changing and are applied in four consecutive steps resulting in four time steps CA evolution. Finally, a post-processing technique based on edge projection analysis is employed for high density edge images concerning the elimination of possible false positives. Evaluation results indicate considerable performance gains without sacrificing text detection accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:XiSMed-E-HIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Document Image Binarization Contest (ICDAR 2013), ICDAR 2013: 12th International Conference on Document Analysis and Recognition, USA, Washington, 25–28 August, 2013",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=9630489369038033284&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:9c2xU6iGI7YC",
            "Publisher": "Washington"
        },
        {
            "Title": "Efficient 3D shape matching and retrieval using a concrete radialized spherical projection representation",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320307000106",
            "Abstract": "We present a 3D shape retrieval methodology based on the theory of spherical harmonics. Using properties of spherical harmonics, scaling and axial flipping invariance is achieved. Rotation normalization is performed by employing the continuous principal component analysis along with a novel approach which applies PCA on the face normals of the model. The 3D model is decomposed into a set of spherical functions which represents not only the intersections of the corresponding surface with rays emanating from the origin but also points in the direction of each ray which are closer to the origin than the furthest intersection point. The superior performance of the proposed methodology is demonstrated through a comparison against state-of-the-art approaches on standard databases.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Int. Conf. on Document Analysis and Recognition",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=6339416161622686444&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ALROH1vI_8AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Heat diffusion approach for feature-based body scans analysis",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.409.5042&rep=rep1&type=pdf",
            "Abstract": "In this paper we propose the use of spectral shape analysis techniques for selection and classification of anthropometric points extracted from human-body scans. Few feature points are detected by exploiting the capability of heat diffusion process in capturing the extremities of surface protrusions which are often related to anthropometric landmarks. Then, a heat kernel signature is computed for each feature point which are associated to its semantic group by employing a learning-by-example procedure exploiting manual point labeling provided by an expert anthropometrist. Detected points are not clearly the same precise anatomical locations used in standard anthropometric procedures, but their matching can be useful for different applications like automatic model registration or simple body type evaluation. Experimental tests carried out on several subjects with different anthropometric characteristics show encouraging results demonstrating the potential usefulness of the approach as well as the necessity of further investigation on point description and matching.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Skeltre-fast skeletonisation for imperfect point cloud data of botanic trees",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.209.727&rep=rep1&type=pdf",
            "Abstract": "Terrestrial laser scanners capture 3D geometry as a point cloud. This paper reports on a new algorithm aiming at the skeletonisation of a laser scanner point cloud, representing a botanical tree without leafs. The resulting skeleton can subsequently be applied to obtain tree parameters like length and diameter of branches for botanic applications. Scanner-produced point cloud data are not only subject to noise, but also to undersampling and varying point densities, making it challenging to extract a topologically correct skeleton. The skeletonisation algorithm proposed in this paper consists of three steps:(i) extraction of a graph from an octree organization,(ii) reduction of the graph to the skeleton and (iii) embedding of the skeleton into the point cloud. The results are validated on laser scanner point clouds representing botanic trees. On a reference tree, the mean and maximal distance of the point cloud points to the …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:aqlVkmm33-oC",
            "Publisher": "Eurographics"
        },
        {
            "Title": "ROSy+: 3D object pose normalization based on PCA and reflective object symmetry with application in 3D object retrieval",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s11263-010-0395-x",
            "Abstract": "A novel pose normalization method based on 3D object reflective symmetry is presented. It is a general purpose global pose normalization method; in this paper it is used to enhance the performance of a 3D object retrieval pipeline. Initially, the axis-aligned minimum bounding box of a rigid 3D object is modified by requiring that the 3D object is also in minimum angular difference with respect to the normals to the faces of its bounding box. To estimate the modified axis-aligned bounding box, a set of predefined planes of symmetry are used and a combined spatial and angular distance, between the 3D object and its symmetric object, is calculated. By minimizing the combined distance, the 3D object fits inside its modified axis-aligned bounding box and alignment with the coordinate system is achieved. The proposed method is incorporated in a hybrid scheme, that serves as the alignment method in a 3D …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Randomized Sub-Volume Partitioning for Part-Based 3D Model Retrieval",
            "Publication year": 2015,
            "Publication url": "https://diglib.eg.org/bitstream/handle/10.2312/3dor.20151050.015-021/015-021.pdf?sequence=1",
            "Abstract": "Given a query that specifies partial shape, a Part-based 3D Model Retrieval (P3DMR) system would retrieve 3D models whose part (s) matches the query. Computationally, this is quite challenging; the query must be compared against parts of 3D models having unknown position, orientation, and scale. To our knowledge, no algorithm can perform P3DMR on a database having significant size (eg, 100K 3D models) that includes polygon soup and other not-so-well-defined shape representations. In this paper, we propose a scalable P3DMR algorithm called Part-based 3D model retrieval by Randomized Sub-Volume Partitioning, or P3D-RSVP. To match a partial query with a set of (whole) 3D models in the database, P3D-RSVP iteratively partitions a 3D model into a set of sub-volumes by using 3D grids having randomized intervals and orientations. To quickly compare the query with all the sub-volumes of all the …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:NJ774b8OgUMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IJCV Special Issue on 3D Object Retrieval",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11263-009-0309-y.pdf",
            "Abstract": "3D object representations have become an integral part of modern computer graphics applications, such as computeraided design, game development and film production. At the same time, 3D data have become very common in domains such as computer vision, computational geometry, molecular biology and medicine. The rapid evolution in graphics hardware and software development, in particular the availability of low cost 3D scanners, has greatly facilitated 3D model acquisition, creation and manipulation, giving the opportunity to experience applications using 3D models to a large user community. As the number of 3D models is rapidly growing, the development of efficient search mechanisms is required for the effective retrieval of 3D objects from large repositories, both of a single class (such as human faces) and across classes. As this field gains momentum, a number of dedicated events appear within …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Partial 3d object retrieval combining local shape descriptors with global fisher vectors",
            "Publication year": 2015,
            "Publication url": "http://diglib.eg.org/bitstream/handle/10.2312/3dor.20151051.023-030/023-030.pdf?sequence=1&isAllowed=y",
            "Abstract": "This work introduces a partial 3D object retrieval method, applicable on both meshes and point clouds, which is based on a hybrid shape matching scheme combining local shape descriptors with global Fisher vectors. The differential fast point feature histogram (dFPFH) is defined so as to extend the well-known FPFH descriptor in order to capture local geometry transitions. Local shape similarity is quantified by averaging the minimum weighted distances associated with pairs of dFPFH values calculated on the partial query and the target object. Global shape similarity is derived by means of a weighted distance of Fisher vectors. Local and global distances are derived for multiple scales and are being combined to obtain a ranked list of the most similar complete 3D objects. Experiments on the large-scale benchmark dataset for partial object retrieval of the shape retrieval contest (SHREC) 2013, as well as on the …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Text detection in natural images using bio-inspired models",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6628838/",
            "Abstract": "Textual information in images constitutes a very rich source of high-level semantics for multimedia indexing and retrieval. In this paper, a new approach is proposed for detecting text in natural images inspired by the properties of the Human Visual System (HVS). In particular, the detection is based upon the functionality of the OFF and ON center-surround cells of the HVS. Cells are combined at different scales to guide a both efficient and effective algorithm. Performance evaluation relies on the ICDAR 2011 Robust Reading Dataset.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiscale graph theory based color segmentation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4106643/",
            "Abstract": "In this paper, image segmentation is addressed within the framework of nonlinear multiscale watersheds in combination with graph theory. First, a graph is created which decomposes the image in scale and space using the concept of multiscale watersheds. In the subsequent step the obtained graph is partitioned using recursive graph cuts in a coarse to fine manner. In this way, we combine scale and feature measures in a flexible way. The dissimilarity between graph-nodes is estimated by using the Earth mover's distance on a featureset that combines color, scale and contrast. Experimental results demonstrate the efficiency of the proposed method for natural scene images.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive degraded document image binarization",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320305003821",
            "Abstract": "This paper presents a new adaptive approach for the binarization and enhancement of degraded documents. The proposed method does not require any parameter tuning by the user and can deal with degradations which occur due to shadows, non-uniform illumination, low contrast, large signal-dependent noise, smear and strain. We follow several distinct steps: a pre-processing procedure using a low-pass Wiener filter, a rough estimation of foreground regions, a background surface calculation by interpolating neighboring background intensities, a thresholding by combining the calculated background surface with the original image while incorporating image up-sampling and finally a post-processing step in order to improve the quality of text regions and preserve stroke connectivity. After extensive experiments, our method demonstrated superior performance against four (4) well-known techniques on …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Robust multi-scale non-rigid registration of 3D ultrasound images",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-47778-0_37",
            "Abstract": "In this paper, we embed the minimization scheme of an automatic 3D non-rigid registration method in a multi-scale framework. The initial model formulation was expressed as a robust multiresolution and multigrid minimization scheme. At the finest level of the multiresolution pyramid, we introduce a focusing strategy from coarse-to-fine scales which leads to an improvement of the accuracy in the registration process. A focusing strategy has been tested for a linear and a non-linear scale-space. Results on 3D Ultrasound images are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Accessing the content of Greek historical documents-Proceedings of The Third Workshop on AND'09",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=1325358818805476407&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:wMgC3FpKEyYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D mesh segmentation methodologies for CAD applications",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/16864360.2007.10738515",
            "Abstract": "3D mesh segmentation is a fundamental process for Digital Shape Reconstruction in a variety of applications including Reverse Engineering, Medical Imaging, etc. It is used to provide a high level representation of the raw 3D data which is required for CAD, CAM and CAE. In this paper, we present an exhaustive overview of 3D mesh segmentation methodologies examining their suitability for CAD models. In particular, a classification of the various methods is given based on their corresponding underlying fundamental methodology concept as well as on the distinct criteria and features used in the segmentation process.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:qjMakFHDy7sC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "A two-step dewarping of camera document images",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4669963/",
            "Abstract": "Dewarping of camera document images has attracted a lot of interest over the last few years since warping not only reduces the document readability but also affects the accuracy of an OCR application. In this paper, a two-step approach for efficient dewarping of camera document images is presented. At a first step, a coarse dewarping is accomplished with the help of a transformation model which maps the projection of a curved surface to a 2D rectangular area. The projection of the curved surface is delimited by the two curved lines which fit the top and bottom text lines along with the two straight lines which fit to the left and right text boundaries. At a second step, fine dewarping is achieved based on words detection. All words are pose normalized guided by the lower and upper word baselines. Experimental results on several camera document images demonstrate the robustness and effectiveness of the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:HtEfBTGE9r8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "I. and K. Ntirogiannis,“Icdar 2011 document image binarization contest (dibco 2011),”",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=15912034184421125857&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:DJbcl8HfkQkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SHREC’16 track: Partial shape queries for 3d object retrieval",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Paul-Rosin/publication/301484938_SHREC'16_Track_Partial_Shape_Queries_for_3D_Object_Retrieval/links/573b57fe08ae9ace840ea5aa/SHREC16-Track-Partial-Shape-Queries-for-3D-Object-Retrieval.pdf",
            "Abstract": "Despite numerous recent efforts, 3D object retrieval based on partial shape queries remains a challenging problem, far from being solved. The problem can be defined as: given a partial view of a shape as query, retrieve all partially similar 3D models from a repository. The objective of this track is to evaluate the performance of partial 3D object retrieval methods, for partial shape queries of various scan qualities and degrees of partiality. The retrieval problem is often found in cultural heritage applications, for which partial scans of objects query a dataset of geometrically distinct classes.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantics-driven approach for automatic selection of best views of 3D shapes",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/40323584/Semantics-Driven_Approach_for_Automatic_20151124-5979-crxqx1.pdf",
            "Abstract": "We introduce a new framework for the automatic selection of the best views of 3D models. The approach is based on the assumption that models belonging to the same class of shapes share the same salient features that discriminate them from the models of other classes. The main issue is learning these features. We propose a datadriven approach where the best view selection problem is formulated as a classification and feature selection problem; First a 3D model is described with a set of view-based descriptors, each one computed from a different viewpoint. Then a classifier is trained, in a supervised manner, on a collection of 3D models belonging to several shape categories. The classifier learns the set of 2D views that maximize the similarity between shapes of the same class and also the views that discriminate shapes of different classes. Our experiments using the LightField (LFD) descriptors and the Princeton Shape Benchmark demonstrate the performance of the approach and its suitability for classification and online visual browsing of 3D data collections.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D object retrieval via range image queries based on sift descriptors on panoramic views",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2381194.2381197",
            "Abstract": "The increasing availability of low-cost 3D scanners is resulting in the creation of large repositories of 3D models. Low-cost 3D range scanners in particular can also be used to capture partial views of real 3D objects which can then act as queries over 3D object repositories. This paper concerns a new methodology for 3D object retrieval based on range image queries which represent partial views of 3D objects. SIFT descriptors based on panoramic views are used to address this problem. The proposed method is evaluated against state-of-the-art works on a standard dataset.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Standard Database and Methods for Handwritten Greek Character Recognition",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=10747597220959279286&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:4hFrxpcac9AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multimodal e-learning environment for orthopedics: design and implementation challenges",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6689047/",
            "Abstract": "We present a Web-based multimedia e-learning platform used to train orthopedic doctors and medical engineers interested in human motion analysis. The platform has evolved from a previous e-learning environment used for e-learning related to breast pathology. We summarize the technological developments that allow for more flexibility and better user experience related to our previous work. We also report on the incorporation of best practices that lead to these desirable results. The architecture of the platform is described, along with its main modules, namely the LMS, the tool used for authoring the multimedia content and the training interactive multimedia environment. The e-learning environment, which is ubiquitously accessible via the web and platform independent, allows for the efficient coupling of medical and engineering theory with real clinical case studies and the multimedia content (images,videos …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fisher encoding of adaptive fast persistent feature histograms for partial retrieval of 3D pottery objects",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2854124.2854135",
            "Abstract": "Cultural heritage is a natural application domain for partial 3D object retrieval, since it usually involves objects that have only been partially preserved. This work introduces a method for the retrieval of 3D pottery objects, based on partial point cloud queries. The proposed method extracts fast persistent feature histograms calculated adaptively to the mean point distances of the point cloud query. The extracted set of vectors is refined by a de-noising component, which employs statistical filtering. The remaining vectors are further refined by a filtering component, which discards points surrounded by surfaces of extremely fine-grained irregularity, often associated with artefact damages. A bag of visual words scheme is used, which starts from the final set of persistent feature histogram vectors and estimates Gaussian mixture models by means of an expectation maximization algorithm. The resulting Gaussian mixture …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Unsupervised word spotting in historical handwritten document images using document-oriented local features",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7918622/",
            "Abstract": "Word spotting strategies employed in historical handwritten documents face many challenges due to variation in the writing style and intense degradation. In this paper, a new method that permits effective word spotting in handwritten documents is presented that it relies upon document-oriented local features, which take into account information around representative keypoints as well a matching process that incorporates spatial context in a local proximity search without using any training data. Experimental results on four historical handwritten data sets for two different scenarios (segmentation-based and segmentation-free) using standard evaluation measures show the improved performance achieved by the proposed methodology.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:LI9QrySNdTsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digitisation Processing and Recognition of Old Greek Manuscipts (the D-SCRIBE Project)",
            "Publication year": 2004,
            "Publication url": "http://sci-gems.math.bas.bg/jspui/handle/10525/871",
            "Abstract": "After many years of scholar study, manuscript collections continue to be an important source of novel  information for scholars, concerning both the history of  earlier times as well as the development of cultural  documentation over the centuries. D-SCRIBE project aims to support and facilitate current and future efforts in  manuscript digitization and processing. It strives toward the creation of a comprehensive software product, which  can assist the content holders in turning an archive of manuscripts into a digital collection using automated  methods. In this paper, we focus on the problem of recognizing early Christian Greek manuscripts. We propose a  novel digital image binarization scheme for low quality historical documents allowing further content exploitation in  an efficient way. Based on the existence of closed cavity regions in the majority of characters and character  ligatures in these scripts, we propose a novel, segmentation-free, fast and efficient technique that assists the  recognition procedure by tracing and recognizing the most frequently appearing characters or character ligatures.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:35N4QoGY0k4C",
            "Publisher": "Institute of Information Theories and Applications FOI ITHEA"
        },
        {
            "Title": "A combined approach for the binarization of handwritten document images",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016786551200311X",
            "Abstract": "There are many challenges addressed in handwritten document image binarization, such as faint characters, bleed-through and large background ink stains. Usually, binarization methods cannot deal with all the degradation types effectively. Motivated by the low detection rate of faint characters in binarization of handwritten document images, a combination of a global and a local adaptive binarization method at connected component level is proposed that aims in an improved overall performance. Initially, background estimation is applied along with image normalization based on background compensation. Afterwards, global binarization is performed on the normalized image. In the binarized image very small components are discarded and representative characteristics of a document image such as the stroke width and the contrast are computed. Furthermore, local adaptive binarization is performed on the …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:WbkHhVStYXYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Predictive digitisation of cultural heritage objects",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-017-4928-y",
            "Abstract": "3D digitisation has been instrumental in the cultural heritage domain for over a decade, contributing to the digital preservation and dissemination of cultural heritage. Still, the typical 3D acquisition workflow remains complex and time-consuming. This work presents the concept of predictive digitisation by means of a platform, aiming to speed-up and simplify 3D digitisation, exploiting similarities in digital repositories of Cultural Heritage objects.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:WZBGuue-350C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Ssbc 2020: Sclera segmentation benchmarking competition in the mobile environment",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9304881/",
            "Abstract": "The paper presents a summary of the 2020 Sclera Segmentation Benchmarking Competition (SSBC), the 7th in the series of group benchmarking efforts centred around the problem of sclera segmentation. Different from previous editions, the goal of SSBC 2020 was to evaluate the performance of sclera-segmentation models on images captured with mobile devices. The competition was used as a platform to assess the sensitivity of existing models to i) differences in mobile devices used for image capture and ii) changes in the ambient acquisition conditions. 26 research groups registered for SSBC 2020, out of which 13 took part in the final round and submitted a total of 16 segmentation models for scoring. These included a wide variety of deep-learning solutions as well as one approach based on standard image processing techniques. Experiments were conducted with three recent datasets. Most of the …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:Bg7qf7VwUHIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Preface to the special issue on 3DOR 2013",
            "Publication year": 2014,
            "Publication url": "https://graz.pure.elsevier.com/de/publications/preface-to-the-special-issue-on-3dor-2013",
            "Abstract": "Biasotti, S, Pratikakis, I, Castellani, U & Schreck, T 2014,'Preface to the special issue on 3DOR 2013', The Visual Computer, Jg. 30, Nr. 11, S. 1195-1195. https://doi. org/10.1007/s00371-014-1017-3",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:_Ybze24A_UAC",
            "Publisher": "Springer"
        },
        {
            "Title": "Hierarchical segmentation using dynamics of multiscale color gradient watersheds",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-47778-0_35",
            "Abstract": "In this paper, we describe and compare two multiscale color segmentation schemes basedon the Gaussian multiscale and the Perona and Malik anisotropic difusion. The proposed segmentation schemes consist of an extension to color images of an earlier multiscale hierarchical watershedsegm entation for scalar images. Our segmentation scheme constructs a hierarchy among the watershed regions using the principle of dynamics of contours in scale-space. Each contour is valuated by combining the dynamics of contours over the successive scales. We conduct experiments on the scale-space stacks created by the Gaussian scale-space and the Perona and Malik anisotropic difusion scheme. Our experimental results consist of the comparison of both schemes with respect to the following aspects: size andin formation reduction between successive levels of the hierarchical stack, dynamics of contours in …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:r0BpntZqJG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A concrete radialized spherical projection descriptor for 3D shape retrieval",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/42138593/A_Concrete_Radialized_Spherical_Projecti20160205-30232-v43nzv.pdf",
            "Abstract": "In this paper, we present a 3D shape retrieval methodology that relies upon a shape representation based on the theory of spherical harmonics. To alleviate the problem of rotation invariance, we invoke in a parallel fashion, the Continuous Principal Component Analysis along with a novel approach which applies PCA on the mesh normals. After translating to the model’s center of mass, the 3D model is decomposed into a set of spherical functions with increasing radius, which represent the intersections of the model’s surface with rays emanating from the origin and parts closer to the origin than the furthest intersection point at each ray. Properties of spherical harmonics are used to achieve scaling invariance and axial flipping invariance.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Document Image Binarization Contest (DIBCO 2011), ICDAR 2011: 11th International Conference on Document Analysis and Recognition, China, Beijing, 18–21 September, 2011",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=12041282772919345382&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:dBIO0h50nwkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of different strategies to optimize an HMM-based character recognition system",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5277474/",
            "Abstract": "Different strategies for combination of complementary features in an HMM-based method for handwritten character recognition are evaluated. In addition, a noise reduction method is proposed to deal with the negative impact of low probability symbols in the training database. New sequences of observations are generated based on the original ones, but considering a noise reduction process. The experimental results based on 52 classes of alphabetic characters and more than 23,000 samples have shown that the strategies proposed to optimize the HMM-based recognition method are very promising.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hybrid system for text detection in video frames",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4669972/",
            "Abstract": "This paper proposes a hybrid system for text detection in video frames. The system consists of two main stages. In the first stage text regions are detected based on the edge map of the image leading in a high recall rate with minimum computation requirements. In the sequel, a refinement stage uses an SVM classifier trained on features obtained by a new local binary pattern based operator which results in diminishing false alarms. Experimental results show the overall performance of the system that proves the discriminating ability of the proposed feature set.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A spatio-temporal wavelet-based descriptor for dynamic 3D facial expression retrieval and recognition",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-016-1243-y",
            "Abstract": "Human emotions are often expressed by facial expressions and are generated by facial muscle movements. In recent years, the analysis of facial expressions has emerged as an active research area due to its various applications such as human–computer interaction, human behavior understanding, biometrics, emotion recognition, computer graphics, driver fatigue detection, and psychology. A novel analysis of dynamic 3D facial expressions using the positional information of automatically detected facial landmarks and the wavelet transformation is presented, which results in the proposed spatio-temporal descriptor. This descriptor is employed within the current paper in a retrieval scheme for dynamic 3D facial expression datasets and is thoroughly evaluated. Experiments have been conducted using the six prototypical expressions of the publicly available BU-4DFE dataset as well as the eight …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:URolC5Kub84C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Stavros Perantonis and Theoharis Theoharis. Efficient 3D shape matching and retrieval using a concrete radialized spherical projection representation",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=591535859838380064&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:QD3KBmkZPeQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On 3D object retrieval benchmarking, 3D Research, v. 4 n. 4",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:8d8msizDQcsC",
            "Publisher": "December"
        },
        {
            "Title": "H-DIBCO 2014–Handwritten document image binarization competition",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=10073901040540097167&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:zCSUwVk65WsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Keyword-guided word spotting in historical printed documents using synthetic data and user feedback",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s10032-007-0042-4",
            "Abstract": "In this paper, we propose a novel technique for word spotting in historical printed documents combining synthetic data and user feedback. Our aim is to search for keywords typed by the user in a large collection of digitized printed historical documents. The proposed method consists of the following stages: (1) creation of synthetic image words; (2) word segmentation using dynamic parameters; (3) efficient feature extraction for each word image and (4) a retrieval procedure that is optimized by user feedback. Experimental results prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Performance evaluation methodology for document image dewarping techniques",
            "Publication year": 2012,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-ipr.2011.0208",
            "Abstract": "The performance evaluation of dewarping techniques is currently addressed by concentrating in visual pleasing impressions or by using optical character recognition (OCR) as a means for indirect evaluation. In this study, the authors present a performance evaluation methodology that calculates a comprehensive evaluation measure which reflects the entire performance of a dewarping technique in a concise quantitative manner. The proposed evaluation measure takes into account the deviation of the dewarped text lines from a horizontal straight reference which is considered to be the optimal result. This measure is expressed by the integral over the dewarped text line curves. To reduce the manual effort for identifying the text lines in the dewarped image, the authors propose a point-to-point matching procedure that finds the correspondence between the manually marked warped document image and the …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Protrusion-oriented 3D mesh segmentation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-009-0383-8",
            "Abstract": "In this paper, we present a segmentation algorithm which partitions a mesh based on the premise that a 3D object consists of a core body and its constituent protrusible parts. Our approach is based on prominent feature extraction and core approximation and segments the mesh into perceptually meaningful components. Based upon the aforementioned premise, we present a methodology to compute the prominent features of the mesh, to approximate the core of the mesh and finally to trace the partitioning boundaries which will be further refined using a minimum cut algorithm. Although the proposed methodology is aligned with a general framework introduced by Lin et al. (IEEE Trans. Multimedia 9(1):46–57, 2007), new approaches have been introduced for the implementation of distinct stages of the framework leading to improved efficiency and robustness. The evaluation of the proposed algorithm is …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "ICFHR2014 competition on handwritten document image binarization (H-DIBCO 2014)",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6981120/",
            "Abstract": "Document image binarization is an important step in the document image analysis and recognition pipeline. H-DIBCO 2014 is the International Document Image Binarization Competition which is dedicated to handwritten document images organized in conjunction with ICFHR 2014 conference. The objective of the contest is to identify current advances in handwritten document image binarization using meaningful evaluation performance measures. This paper reports on the contest details including the evaluation measures used as well as the performance of the 7 submitted methods along with a short description of each method.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RETRIEVAL—An Online Performance Evaluation Tool for Information Retrieval Methods",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7949020/",
            "Abstract": "Performance evaluation is one of the main research topics in information retrieval. Evaluation metrics are used to quantify various performance aspects of a retrieval method. These metrics assist in identifying the optimum method for a specific retrieval challenge but also to allow its parameters fine-tuning in order to achieve a robust operation for a given set of requirements specification. In this work, we present RETRIEVAL, a Web-based integrated information retrieval performance evaluation platform. It offers a number of metrics that are popular within the scientific community, so as to compose an efficient framework for implementing performance evaluation. We discuss the functionality of RETRIEVAL by citing important aspects such as the data input approaches, the user-level performance metrics parameterization, the evaluation scenarios, the interactive plots, and the performance reports repository that offers …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A block-based Hough transform mapping for text line detection in handwritten documents",
            "Publication year": 2006,
            "Publication url": "https://hal.inria.fr/inria-00112648/",
            "Abstract": "In this paper, we present a new text line detection method for unconstrained handwritten documents. The proposed technique is based on a strategy that consists of three distinct steps. The first step includes preprocessing for image enhancement, connected component extraction and average character height estimation. In the second step, a block-based Hough transform is used for the detection of potential text lines while a third step is used to correct possible false alarms. The performance of the proposed methodology is based on a consistent and concrete evaluation technique that relies on the comparison between the text line detection result and the corresponding ground truth annotation.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Suvisoft"
        },
        {
            "Title": "An adaptive binarization technique for low quality historical documents",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=11480384676478335400&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:U4n9YNQMCAIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using landmarks to establish a point-to-point correspondence between signatures",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1007/s100440050007",
            "Abstract": "This paper introduces a new approach for point-to-point correspondence finding, which can be used as pre-processing stage of a handwritten signature verification procedure. This approach provides a solid basis for comparing function features of two handwritten signatures. Corner points of the signatures are first extracted based on velocity information. The characteristics of curvilinear velocity and angular velocity are combined successfully by functions based on membership criteria. The signatures to be compared are then segmented at landmarks obtained by corner matching based on similarity measures. In the last step, the corresponding pairs of segments are mapped by a point-to-point matching algorithm, minimising a curve deformation energy. The techniques described were applied to a set of 188 signatures from 19 volunteers. The resulting point-to-point matching of signature pairs was …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A segmentation-free approach for keyword search in historical typewritten documents",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1575509/",
            "Abstract": "In this paper, we propose a novel segmentation-free approach for keyword search in historical typewritten documents combining image preprocessing, synthetic data creation, word spotting and user feedback technologies. Our aim is to search for keywords typed by the user in a large collection of digitized typewritten historical documents. The proposed method is based on: (i) image preprocessing for image binarization and enhancement, noisy border and frame removal, orientation and skew correction; (ii) creation of synthetic image words from keywords typed by the user; (Hi) word segmentation using dynamic parameters; (iv) efficient feature extraction for each image word and (v) a retrieval procedure that is optimized by user's feedback. Experimental results prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A holistic methodology for keyword search in historical typewritten documents",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_52",
            "Abstract": "In this paper, we propose a novel holistic methodology for keyword search in historical typewritten documents combining synthetic data and user’s feedback. The holistic approach treats the word as a single entity and entails the recognition of the whole word rather than of individual characters. Our aim is to search for keywords typed by the user in a large collection of digitized typewritten historical documents. The proposed method is based on: (i) creation of synthetic image words; (ii) word segmentation using dynamic parameters; (iii) efficient hybrid feature extraction for each image word and (iv) a retrieval procedure that is optimized by user’s feedback. Experimental results prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Special Issue on 3D Object Retrieval 2009 Preface",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=14635105056430706195&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:YohjEiUPhakC",
            "Publisher": "SPRINGER"
        },
        {
            "Title": "ICDAR 2013 document image binarization contest (DIBCO 2013)",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6628857/",
            "Abstract": "DIBCO 2013 is the international Document Image Binarization Contest organized in the context of ICDAR 2013 conference. The general objective of the contest is to identify current advances in document image binarization for both machine-printed and handwritten document images using evaluation performance measures that conform to document image analysis and recognition. This paper describes the contest details including the evaluation measures used as well as the performance of the 23 submitted methods along with a short description of each method.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for efficient transcription of historical documents using keyword spotting",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2809544.2809557",
            "Abstract": "Keyword spotting (KWS) has drawn the attention of the research community as the alternative means to solve hard cases of handwriting text recognition. In this paper, a framework is proposed that employs KWS to enhance the efficiency in the manual transcription process, thus, reducing drastically the cost of training data creation. The core principle relies upon the ability of robust document-specific descriptors to produce meaningful similarities between a chosen word image for transcription and the corresponding word images in the full dataset under consideration. In the proposed framework, KWS is coupled with a relevance feedback mechanism which further enhances retrieval performance while being independent to the chosen KWS algorithm. The efficiency of the proposed pipeline is showcased via a user-friendly web-based prototype.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:uWiczbcajpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Retrieval of 3D Articulated Objects Using a Graph-based Representation.",
            "Publication year": 2009,
            "Publication url": "http://diglib.eg.org/xmlui/bitstream/handle/10.2312/3DOR.3DOR09.029-036/029-036.pdf?sequence=1&isAllowed=y",
            "Abstract": "Most of the approaches which address the problem of 3D object retrieval, use global descriptors of the objects which fail to consistently compensate for the intra-class variability of articulated objects. In this paper, a retrieval methodology is presented which is based upon a graph-based object representation. This is composed of a meaningful new mesh segmentation along with a graph matching between the graph of the query object and each of the graphs that correspond to the objects of the 3D object database. The graph matching algorithm is based on the Earth Mover’s Distance (EMD) similarity measure which is calculated using a new ground distance assignment. The superior performance of the proposed methodology is shown after an extensive experimentation comprising alternative descriptors for the constituent components of the 3D object as well as comparison with state of the art retrieval algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Eurographics 2011 Workshop on 3D Object Retrieval (EG 3DOR’2011) in Cooperation with ACM SIGGRAPH Lluandudno, UK, April 10, 2011",
            "Publication year": 2011,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1467-8659.2011.01973.x",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:abG-DnoFyZgC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "An effective methodology for dynamic 3D facial expression retrieval",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003132031500391X",
            "Abstract": "The problem of facial expression recognition in dynamic sequences of 3D face scans has received a significant amount of attention in the recent past whereas the problem of retrieval in this type of data has not. A novel retrieval methodology for such data is introduced in this paper. The proposed methodology automatically detects specific facial landmarks and uses them to create a descriptor. This descriptor is the concatenation of three sub-descriptors which capture topological as well as geometric information of the 3D face scans. The motivation behind the proposed hybrid facial expression descriptor is the fact that some facial expressions, like happiness and surprise, are characterized by obvious changes in the mouth topology while others, like anger, fear and sadness, produce geometric but no significant topological changes. The proposed retrieval scheme exploits the Dynamic Time Warping technique in …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:fEOibwPWpKIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Sympan: 3d model pose normalization via panoramic views and reflective symmetry",
            "Publication year": 2013,
            "Publication url": "http://diglib.eg.org/bitstream/handle/10.2312/3DOR.3DOR13.041-048/041-048.pdf?sequence=1",
            "Abstract": "A novel pose normalization method, based on panoramic views and reflective symmetry, is presented. Initially, the surface of a 3D model is projected onto the lateral surface of a circumscribed cylinder, aligned with the primary principal axis of space. Based on this cylindrical projection, a normals’ deviation map is extracted and using an octree-based search strategy, the rotation which optimally aligns the primary principal axis of the 3D model and the cylinder’s axis is computed. The 3D model’s secondary principal axis is then aligned with the secondary principal axis of space in a similar manner. The proposed method is incorporated in a hybrid scheme, that serves as the pose normalization method in a state-of-the-art 3D model retrieval system. The effectiveness of this system, using the hybrid pose normalization scheme, is evaluated in terms of retrieval accuracy and the results clearly show improved performance …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICFHR 2012 competition on handwritten document image binarization (H-DIBCO 2012)",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6424498/",
            "Abstract": "H-DIBCO 2012 is the International Document Image Binarization Competition which is dedicated to handwritten document images organized in conjunction with ICFHR 2012 conference. The objective of the contest is to identify current advances in handwritten document image binarization using meaningful evaluation performance measures. This paper reports on the contest details including the evaluation measures used as well as the performance of the 24 submitted methods along with a short description of each method.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Foreword to the special section on 3D Object Retrieval 2020 workshop (3DOR2020)",
            "Publication year": 2020,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7579095/",
            "Abstract": "The aim of the 3D Object Retrieval (3DOR) Workshop series is 1 to provide a premier venue for research in 3D/4D visual con-2 tent search, exploration and understanding for researchers from 3 diverse fields such as Computer Vision, Computer Graphics, Ma-4 chine Learning, Cognitive Science and Human-Computer Interac-5 tion. In addition, the Shape Retrieval Contest (SHREC) is an estab-6 lished venue for benchmarking new and existing methods in shape 7 retrieval. SHREC and 3DOR have been running together since 2009 8 with SHREC being the benchmarking arm of 3DOR and 3DOR being 9 the dissemination and networking arm of SHREC. 10 3DOR 2020 was the 13th workshop in the 3DOR series. It took 11 place on the 4th and 5th of September 2020. The planned physical 12 venue was TU Graz, Austria, but due to the outbreak of COVID-19, 13 it was converted to a virtual event hosted by TU Graz …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:vDZJ-YLwNdEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Efficient binarization of historical and degraded document images",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4669993/",
            "Abstract": "This paper presents a new adaptive approach for the binarization and enhancement of historical and degraded documents. The proposed method is based on (i) efficient pre-processing; (ii) the combination of the results of several state-of-the-art binarization methodologies; (iii) the incorporation of edge information and (iv) the application of efficient image post-processing based on mathematical morphology for the enhancement of the final result. The proposed method demonstrated superior performance against six well-known techniques on numerous historical handwritten and machine-printed documents mainly from the Library of Congress of the United States archive. The performance evaluation was based on a consistent and concrete methodology.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D articulated object retrieval using a graph-based representation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-010-0523-1",
            "Abstract": "In this paper, a retrieval methodology for 3D articulated objects is presented that relies upon a graph-based object representation. The methodology is composed of a mesh segmentation stage which creates the Attributed Relation Graph (ARG) of the object along with a graph matching algorithm which matches two ARGs. The graph matching algorithm is based on the Earth Movers Distance (EMD) similarity measure calculated with a new ground distance assignment. The superior performance of the proposed retrieval methodology against state-of-the-art approaches is shown by extensive experimentation that comprise the application of various geometric descriptors representing the components of the 3D objects that become the node attributes of the ARGs as well as alternative mesh segmentation approaches for the extraction of the object parts. The performance evaluation is addressed in both …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Evaluation of 3D interest point detection techniques",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2381170.2381181",
            "Abstract": "In this paper, we compare the results of five 3D interest point detection techniques to the interest points marked by human subjects. This comparison is used to quantitatively evaluate the interest point detection algorithms. We asked human subjects to look at a number of 3D models, and mark interest points on the models via a web-based interface. We propose a voting-based method to construct ground truth out of humans' selections of interest points. Evaluation measures, namely False Positive and False Negative Errors, are then defined based on the geodesic distance between the interest points detected by a particular algorithm and the human-generated ground truth.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICFHR 2012 competition on handwritten document image binarization competition",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=4314969493587179038&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:_5tno0g5mFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICFHR2018 competition on handwritten document image binarization contest (H-DIBCO 2018)",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=8740115113912671211&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ubry08Y2EpUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hierarchical multiscale watershed segmentation of color images",
            "Publication year": 2000,
            "Publication url": "https://researchportal.vub.be/en/publications/hierarchical-multiscale-watershed-segmentation-of-color-images",
            "Abstract": "In this paper, we describe and compare two multiscale color segmentation schemes based on the Gaussian multiscale and the Perona and Malik anisotropic diffusion. The proposed segmentation schemes consist of an extension to color images of an earlier multiscale hierarchical watershed segmentation for scalar images. Our segmentation scheme constructs a hierarchy among the watershed regions using the principle of dynamics of contours in scale-space. Each contour is valuated by combining the dynamics of contours over the successive scales. We conduct experiments on the scale-space stacks created by the Gaussian scale-space and the Perona and Malik anisotropic diusion scheme. Our experimental results consist of the comparison of both schemes with respect to the following aspects: size and information reduction between successive levels of the hierarchical stack, dynamics of contours in scale space and computation time.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:iH-uZ7U-co4C",
            "Publisher": "First International Conference on Color in Graphics and Image Processing, 94-99, A. Tremeau, B. Laget."
        },
        {
            "Title": "On the retrieval of 3D mesh sequences of human actions",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11042-015-3137-9.pdf",
            "Abstract": "In this paper, the problem of unsupervised human action retrieval in 3D mesh sequences is addressed. An action is composed of a mesh sequence, wherein each frame is represented by a static shape descriptor. Six state-of-the-art static descriptors are used to extract meaningful information for each sequence. Firstly, these descriptors are examined in terms of frame-to-frame similarity by means of Receiver Operating Characteristic (ROC) curves. Then, they are utilized in the action retrieval problem, where the query is an entire 3D mesh sequence. Each action is a multidimensional curve which traverses the points defined by the vectors of each descriptor. The estimation of similarity between actions is achieved by calculating the Dynamic Time Warping (DTW) distance between the corresponding curves. The retrieval performance is further examined when the Sakoe band is used to constrain the search …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Efficient off-line cursive handwriting word recognition",
            "Publication year": 2006,
            "Publication url": "https://hal.inria.fr/inria-00104302/",
            "Abstract": "In this paper, we present an off-line cursive word handwriting recognition methodology. This is based on a novel combination of two different modes of word image normalization and robust hybrid feature extraction. Word image normalization is performed by using as a reference point the geometric center of the word image as well as by placing the baseline of the word in the center of a rectangular box. Additionally, image pre-processing is performed in order to correct word skew, word slant as well as to normalize the stroke thickness. At a next step, two types of features are combined in a hybrid fashion. The first one, divides the word image into a set of zones and calculates the density of the character pixels in each zone. In the second type of features, we calculate the area that is formed from the projections of the upper and lower profile of the word. The performance of the proposed methodology is demonstrated after testing with the reference IAM cursive handwriting database.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:4DMP91E08xMC",
            "Publisher": "Suvisoft"
        },
        {
            "Title": "Towards text recognition in natural scene images",
            "Publication year": 2005,
            "Publication url": "https://users.iit.demokritos.gr/~bgat/icta2005.pdf",
            "Abstract": "In this paper, we propose a novel methodology for text detection in natural scene images. The proposed methodology is based on an efficient binarization and enhancement technique followed by a suitable connected component analysis procedure. Image binarization successfully processes natural scene images having shadows, non-uniform illumination, low contrast and large signaldependent noise. Connected component analysis is used to define the final binary images that mainly consist of text regions. The proposed methodology results in increased success rates for commercial OCR engines. Experimental results based on a public database of natural scene images prove the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bag of spatio-visual words for context inference in scene classification",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003132031200341X",
            "Abstract": "In the “bag of visual words (BoVW)” representation each image is represented by an unordered set of visual words. In this paper, a novel approach to encode ordered spatial configurations of visual words in order to add context in the representation is presented. The proposed method introduces a bag of spatio-visual words representation (BoSVW) obtained by clustering of visual words' correlogram ensembles. Specifically, the spherical K-means clustering algorithm is employed accounting for the large dimensionality and the sparsity of the proposed spatio-visual descriptors. Experimental results on four standard datasets show that the proposed method significantly improves a state-of-the-art BoVW model and compares favorably to existing context-based scene classification approaches.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "SVM-based CBIR of breast masses on mammograms.",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.662.5463&rep=rep1&type=pdf#page=33",
            "Abstract": "Mammography is currently the dominant imaging modality for the early detection of breast cancer. However, its robustness in distinguishing malignancy is relatively low, resulting in a large number of unnecessary biopsies. A computer-aided diagnosis (CAD) scheme, capable of visually justifying its results, is expected to aid the decision made by radiologists. Content-based image retrieval (CBIR) accounts for a promising paradigm in this direction. Facing this challenge, we introduce a CBIR scheme that utilizes the extracted features as input to a support vector machine (SVM) ensemble. The final features used for CBIR comprise the participation value of each SVM. The retrieval performance of the proposed scheme has been evaluated quantitatively on the basis of the standard measures. In the experiments, a set of 90 mammograms is used, derived from a widely adopted digital database for screening mammography. The experimental results show the improved performance of the proposed scheme.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive Degraded Image Binarization",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=18325753916622072376&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:OTTXONDVkokC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Eurographics 2009 Workshop on 3D Object Retrieval (EG 3DOR’09) in Cooperation with ACM SIGGRAPH\u2028Munich, Germany\u2028March 29, 2009",
            "Publication year": 2010,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.wiley-cgf-v-29-i-1-cgf1589",
            "Abstract": "Eurographics 2009 Workshop on 3D Object Retrieval (EG 3DOR’09) in Cooperation with ACM \nSIGGRAPH Munich, Germany March 29, 2009 × Close The Infona portal uses cookies, ie \nstrings of text saved by a browser on the user's device. The portal can access those files and \nuse them to remember the user's data, such as their chosen settings (screen view, interface \nlanguage, etc.), or their login data. By using the Infona portal the user accepts automatic saving \nand using this information for portal operation purposes. More information on the subject can \nbe found in the Privacy Policy and Terms of Service. By closing this window the user confirms \nthat they have read the information on cookie usage, and they accept the privacy policy and \nthe way cookies are used by the portal. You can change the cookie settings in your browser. \nI accept Polski English Login or register account remember me Password recovery - × on ’…",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Selecting registration schemes in case of interstitial lung disease follow‐up in CT",
            "Publication year": 2015,
            "Publication url": "https://aapm.onlinelibrary.wiley.com/doi/abs/10.1118/1.4923170",
            "Abstract": "Primary goal of this study is to select optimal registration schemes in the framework of interstitial lung disease (ILD) follow‐up analysis in CT.A set of 128 multiresolution schemes composed of multiresolution nonrigid and combinations of rigid and nonrigid registration schemes are evaluated, utilizing ten artificially warped ILD follow‐up volumes, originating from ten clinical volumetric CT scans of ILD affected patients, to select candidate optimal schemes. Specifically, all combinations of four transformation models (three rigid: rigid, similarity, affine and one nonrigid: third order B‐spline), four cost functions (sum‐of‐square distances, normalized correlation coefficient, mutual information, and normalized mutual information), four gradient descent optimizers (standard, regular step, adaptive stochastic, and finite difference), and two types of pyramids (recursive and Gaussian‐smoothing) were …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:evX43VCCuoAC",
            "Publisher": "American Association of Physicists in Medicine"
        },
        {
            "Title": "A 3D shape benchmark for retrieval and automatic classification of architectural data",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2381128.2381141",
            "Abstract": "When drafting new buildings, architects make intensive use of existing 3D models including building elements, furnishing, and environment elements. These models are either directly included into the draft or serve as a source for inspiration. To allow efficient reuse of existing 3D models, shape retrieval methods considering the specific requirements of architects must be developed. Unfortunately, common 3D shape benchmarks which are used to evaluate the performance of retrieval algorithms are not well suited for architectural data. First, they incorporate models which are not related to this domain, and second and even more important, the provided classification schemes usually do not match an architect's intuition regarding their notion of design and function. To overcome these drawbacks, we present a freely downloadable shape benchmark especially designed for architectural 3D models. It currently contains …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Foreword to the special section on 3D object retrieval 2019",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=1119294329870250455&hl=en&oi=scholarr",
            "Abstract": "We are pleased to present this special section of Computers & Graphics (C&G), featuring the selected peer reviewed extended versions of the full papers presented at the 12th Eurographics Workshop on 3D Object Retrieval–3DOR 2019 (http://3dor2019. ge. imati. cnr. it/) which was held on May 5–6, 2019 in Genova, Italy.The aim of the 3DOR Workshop series is to stimulate researchers from different fields such as Computer Vision, Computer Graphics, Machine Learning, Cognitive Science and Human-Computer Interaction who are interested in 3D object retrieval, recognition and exploration, to present state-of-the-art work in the field or learn about it and participate in discussions. It provides a cross-fertilization that stimulate a broader forum of discussions on the next steps in this important research area.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:5icHVeHT4IsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Feature Template based 3D Model Retrieval",
            "Publication year": 2011,
            "Publication url": "http://diglib.eg.org/bitstream/handle/10.2312/3DOR.3DOR11.113-116/113-116.pdf?sequence=1&isAllowed=n",
            "Abstract": "3D model retrieval has attracted more and more research interests. Lots of shape descriptors have been proposed till now. But during the process of constructing these shape descriptors, feature correlation among models is not considered. In this paper, we propose a simple but very effective method in improving retrieving accuracy by employing correlative information, namely feature template. Feature template is designed to remove such small variation while remaining discriminative features by performing meaning operation of feature vectors. As a result, it makes the feature vector be more robust for better retrieving accuracy. In addition, the feature template can be regarded as a post-processing of existing shape descriptors. Therefore, the proposed method can be used to improve retrieving accuracy for any shape descriptors in the form of feature vector. In experiments, we test the proposed method for several …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:F9fV5C73w3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IEEE, ICFHR 2018 competition on handwritten document image binarization (H-DIBCO 2018)",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=6647798866768030156&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:7BrZ7Jt4UNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Line and word segmentation of handwritten documents",
            "Publication year": 2008,
            "Publication url": "http://www.iapr-tc11.org/archive/icfhr2008/Proceedings/papers/cr1115.pdf",
            "Abstract": "In this paper, we present a segmentation methodology of a handwritten document in its distinct entities namely text lines and words. Text line segmentation is achieved making use of the Hough Transform on a subset of the connected components of the document image. Also, a post-processing step includes the correction of possible false alarms, the creation of text lines that Hough Transform failed to create and finally the efficient separation of vertically connected characters using a novel method. Word segmentation is treated as a two class problem. The distances between adjacent overlapped components in a text line are calculated and each of these is categorized either as an inter-word or an intra-word distance after the comparison with a threshold. The performance of the proposed methodology is based on a consistent and concrete evaluation technique that relies on the comparison between the text line segmentation result and the corresponding ground truth annotation as well as the word segmentation result and the corresponding ground truth annotation.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:Ri6SYOTghG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Generative object definition and semantic recognition",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2381170.2381172",
            "Abstract": "''What is the difference between a cup and a door?''These kinds of questions have to be answered in the context of digital libraries. This semantic information, which describes an object on a high, abstract level, is needed in order to provide digital library services such as indexing, markup and retrieval. In this paper we present a new approach to encode and to extract such semantic information. We use generative modeling techniques to describe a class of objects: each class is represented by one algorithm; and each object is one set of high-level parameters, which reproduces the object if passed to the algorithm. Furthermore, the algorithm is annotated with semantic information, ie a human-readable description of the object class it represents. We use such an object description to recognize objects in real-world data eg laser scans. Using an algorithmic object description, we are able to identify 3D subparts, which …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel pseudonoise tester for transmission line fault location and identification using pseudorandom binary sequences",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6378228/",
            "Abstract": "A novel pulse echo test methodology, using PRBS excitation, is presented in this paper as an alternative to Time Domain Reflectometry (TDR) for transmission line fault location and identification. The essence of this scheme is the cross correlation (CCR) of the fault echo response with the input PRBS test perturbation which results in a unique signature for fault type identification, if any, or load termination present as well as its distance from the point of test stimulus injection. This fault location technique can used in a number of key industrial applications incorporating printed circuit boards, overhead transmission lines and underground cables in inaccessible locations which rely on a metallic conductor pathway for power transfer or signal propagation. As an improved method pseudonoise (PN) fault identification can be performed over several cycles at low amplitude levels online to reject normal signal traffic and …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:tuHXwOkdijsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An old Greek handwritten OCR system",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1575511/",
            "Abstract": "Recognition of handwritten manuscripts is essential for efficient content exploitation of the valuable old Greek historical collections. In this paper, we focus on the problem of recognizing old Greek handwritten manuscripts and propose a novel recognition technique that can be applied to a large number of important historical manuscript collections which are written in lower case letters and originate from St. Catherine's Mount Sinai Monastery. Based on an open and closed cavity character representation, we propose a novel, segmentation-free, fast and efficient technique for the detection and recognition of characters and character ligatures. First, we detect open and closed cavities that exist in the skeletonized character body. Then, the recognition of a specific character or character ligature is based on the protrusible segments that appear in the topological description of the character skeletons. Experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bio-inspired modeling for the enhancement of historical handwritten documents",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8269986/",
            "Abstract": "An important step for the document analysis and recognition pipeline is the document image binarization procedure. In the case of historical handwritten document images, the inherent degradation of the documents requires a preprocessing step aiming to enhance the image and improve the subsequent binarization step. To address this challenge a new document image enhancement method is proposed based on Bio-Inspired Models and especially on the OFF-center ganglion cells of the Human Vision System. Experimental results demonstrate the improvement of standard binarization methods when the proposed enhancement method is used.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:ruyezt5ZtCIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unsupervised watershed-driven region-based image retrieval",
            "Publication year": 2006,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-vis_20050061",
            "Abstract": "A novel unsupervised strategy for content-based image retrieval is presented. It is based on a meaningful segmentation procedure that can provide proper distributions for matching via the earth mover's distance as a similarity metric. The segmentation procedure is based on a hierarchical watershed-driven algorithm that extracts meaningful regions automatically. In this framework, the proposed robust feature extraction and the many-to-many region matching along with the novel region weighting for enhancing feature discrimination play a major role. Experimental results demonstrate the performance of the proposed strategy.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "RETRIEVAL3D an on-line content-based retrieval performance evaluation tool",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2852282.2852304",
            "Abstract": "Performance benchmarking is an absolute necessity when attempting to objectively quantify the performance of content-based retrieval methods. For many years now, a number of plot-based and scalar-based measures in combination with benchmark datasets have already been used in order to provide objective results. In this work, we present the first version of an integrated on-line content-based retrieval evaluation tool, named RETRIEVAL 3D, which can be used in order to quantify the performance of a retrieval method. The current version of the system offers a set of popular performance measures that can be accessed through a dynamic visualisation environment. The user is able to upload retrieval results using different input data structures (eg binary ranked lists, floating point ranked lists, dissimilarity matrices and groundtruth data) that are already encountered in the literature including the SHREC …",
            "Abstract entirety": 0,
            "Author pub id": "lCVokogAAAAJ:tKAzc9rXhukC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scene categorisation using lowlevel visual features",
            "Publication year": 2006,
            "Publication url": "https://users.iit.demokritos.gr/~bgat/DIA_web/D32.pdf",
            "Abstract": "In this paper, we have built two binary classifiers for indoor/outdoor and city/landscape categories, respectively. The proposed classifiers consist of robust visual feature extraction that feeds a support vector classification. In the case of indoor/outdoor classification, we combine color and texture information using the first three moments of RGB color space components and the low order statistics of the energy wavelet coefficients from a two-level wavelet pyramid. In the case of city/landscape classification, we combine the first three moments of L* a* b color space components and structural information (line segment orientation). Experimental results show that a high classification accuracy is achieved.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D Object Retrieval",
            "Publication year": 2010,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=22799658",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:KbBQZpvPDL4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid Method and System for Content-based 3D Model Search",
            "Publication year": 2009,
            "Publication url": "https://patents.google.com/patent/US20090157649A1/en",
            "Abstract": "The present disclosure concerns a hybrid content-based 3D model search and retrieval method for queries in generic 3D model datasets. The hybrid nature of the method is two-fold. First, a combination of 2D and 3D features is used as the shape descriptor of a 3D model and second, two alternative alignment techniques, CPCA and NPCA, are employed for rotation normalization. The 2D features are Fourier coefficients extracted from three pairs of depth buffers which are computed for each Cartesian plane capturing the model's thickness along each axis. The 3D features are spherical harmonic coefficients extracted from a spherical function based representation that captures the model's surface as well as volume information.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ConTopo: Non-Rigid 3D Object Retrieval using Topological Information guided by Conformal Factors.",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/42138970/ConTopo_Non-Rigid_3D_Object_Retrieval_us20160205-30232-1iyvxim.pdf",
            "Abstract": "Combining the properties of conformal geometry and graph-based topological information for 3D object retrieval, a non-rigid 3D object descriptor is proposed, which is both robust and efficient in terms of retrieval accuracy and computation speed. In previous works, graph-based methods for non-rigid 3D object retrieval, have shown high discriminative power and robustness, while geometry-based methods, have proven to be tolerant to noise and pose. In this work, we present a 3D object descriptor that combines the above advantages.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "BOEMIE: Bootstrapping ontology evolution with multimedia information extraction",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1576045/",
            "Abstract": "The BOEMIE project proposes a bootstrapping approach to knowledge acquisition, which uses multimedia ontologies for fused extraction of semantics from multiple modalities, and feeds back the extracted information, aiming to automate the ontology evolution process.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:RGFaLdJalmkC",
            "Publisher": "IET"
        },
        {
            "Title": "3d mesh video retrieval: A survey",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6365464/",
            "Abstract": "This survey addresses methodologies for 3D mesh video retrieval including 3D mesh video action/motion retrieval and 3D mesh video facial expression recognition. They all involve retrieval procedures and, consequently, classification methods in order to identify similar actions/motions and facial expressions. The approaches are primarily categorized according to the 3D model representation that they use and their feature extraction and classification methods. Comparative data for the most promising methods is given, mainly on publicly available datasets.",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "combined approach for the Binarization of handwritten document images Pattern Recognition Letters",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=15657301135083751440&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "lCVokogAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Elsevier"
        }
    ]
}]