[{
    "name": "Ιωάννης Θεοχάρης",
    "romanize name": "Ioannis Theocharis",
    "School-Department": "Ηλεκτρολόγων Μηχ και Μηχ Υπολογιστών",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 7754,
    "Scholar name": "Ioannis Theocharis",
    "Scholar id": "AbUzPocAAAAJ",
    "Affiliation": "University of Crete",
    "Citedby": 490,
    "Interests": [
        "Data management"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=AbUzPocAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "PoweRGen: A power-law based generator of RDFS schemas",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437911001141",
            "Abstract": "As the amount of RDF datasets available on the Web has grown significantly over the last years, scalability and performance of Semantic Web (SW) systems are gaining importance. Current RDF benchmarking efforts either consider schema-less RDF datasets or rely on fixed RDFS schemas. In this paper, we present the first RDFS schema generator, termed PoweRGen, which takes into account the features exhibited by real SW schemas. It considers the power-law functions involved in (a) the combined in-and out-degree distribution of the property graph (which captures the domains and ranges of the properties defined in a schema) and (b) the out-degree distribution of the transitive closure (TC) of the subsumption graph (which essentially captures the class hierarchy). The synthetic schemas generated by PoweRGen respect the power-law functions given as input with an accuracy ranging between 89 and 96%, as …",
            "Abstract entirety": 0,
            "Author pub id": "AbUzPocAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Mitos: Design and evaluation of a dbms-based web search engine",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4621536/",
            "Abstract": "Engineering a Web search engine offering effective and efficient information retrieval is a challenging task. Mitos is a recently developed search engine that offers a wide spectrum of functionalities. A rather unusual design choice is that its index is based on an object-relational database system, instead of the classical inverted file. This paper discusses the benefits and the drawbacks of this choice (compared to inverted files), proposes three different database representations, and reports comparative experimental results. Two of these representations are one order of magnitude more space economical and two orders of magnitude faster in query evaluation, than the plain relational representation.",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Object-relational database representations for text indexing",
            "Publication year": 2009,
            "Publication url": "https://arxiv.org/abs/0906.3112",
            "Abstract": "One of the distinctive features of Information Retrieval systems comparing to Database Management systems, is that they offer better compression for posting lists, resulting in better I/O performance and thus faster query evaluation. In this paper, we introduce database representations of the index that reduce the size (and thus the disk I/Os) of the posting lists. This is not achieved by redesigning the DBMS, but by exploiting the non 1NF features that existing Object-Relational DBM systems (ORDBMS) already offer. Specifically, four different database representations are described and detailed experimental results for one million pages are reported. Three of these representations are one order of magnitude more space efficient and faster (in query evaluation) than the plain relational representation.",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The anatomy of Mitos web search engine. CoRR",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=16622615301655720136&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On Ranking RDF Schema Elements (and its Application in Visualization).",
            "Publication year": 2007,
            "Publication url": "http://www.jucs.org/jucs_13_12/on_ranking_rdf_schema/jucs_13_12_1854_1880_tzitzikas.pdf",
            "Abstract": "Ranking is a ubiquitous requirement whenever we confront a large collection of atomic or interrelated artifacts. This paper elaborates on this issue for the case of RDF schemas. Specifically, several metrics for evaluating automatic methods for ranking schema elements are proposed and discussed. Subsequently the creation of a test collection for evaluating such methods is described, upon which several ranking methods (from simple to more sophisticated) for RDF schemas are evaluated. This formal way for evaluating ranking methods, apart from yielding credible and repeatable results, gave us some interesting insights to the problem. Finally, our experiences from exploiting these ranking methods for visualizing RDF schemas, specifically for deriving and visualizing top-k schema subgraphs, are reported.",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Benchmarking database representations of RDF/S stores",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11574620_49",
            "Abstract": "In this paper we benchmark three popular database representations of RDF/S schemata and data: (a) a schema-aware (i.e., one table per RDF/S class or property) with explicit (ISA) or implicit (NOISA) storage of subsumption relationships, (b) a schema-oblivious (i.e., a single table with triples of the form ), using (ID) or not (URI) identifiers to represent resources and (c) a hybrid of the schema-aware and schema-oblivious representations (i.e., one table per RDF/S meta-class by distinguishing also the range type of properties). Furthermore, we benchmark two common approaches for evaluating taxonomic queries either on-the-fly (ISA, NOISA, Hybrid), or by precomputing the transitive closure of subsumption relationships (MatView, URI, ID). The main conclusion drawn from our experiments is that the evaluation of taxonomic queries is most efficient over RDF/S stores utilizing the Hybrid and MatView …",
            "Abstract entirety": 0,
            "Author pub id": "AbUzPocAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On provenance of queries on semantic web data",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5601676/",
            "Abstract": "Capturing trustworthiness, reputation, and reliability of Semantic Web data manipulated by SPARQL requires researchers to represent adequate provenance information, usually modeled as source data annotations and propagated to query results along with a query evaluation. Alternatively, abstract provenance models can capture the relationship between query results and source data by taking into account the employed query operators. The authors argue the benefits of the latter for settings in which query results are materialized in several repositories and analyzed by multiple users. They also investigate how relational provenance models can be leveraged for SPARQL queries, and advocate for new provenance models.",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Naming functions for the vector space model",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-71496-5_58",
            "Abstract": "The Vector Space Model (VSM) is probably the most widely used model for retrieving information from text collections (and recently from over other kinds of corpi). Assuming this model, we study the problem of finding the best query that ”names” (or describes) a given (unordered or ordered) set of objects. We formulate several variations of this problem and we provide methods and algorithms for solving them.",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Capturing Provenance of RDF Triples through Colors",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.578.2947&rep=rep1&type=pdf",
            "Abstract": "Recently, the W3C Linking Open Data effort has boosted the publication and inter-linkage of large amounts of RDF datasets on the Semantic Web. Various ontologies and knowledge bases with millions of RDF triples from Wikipedia and other sources, mostly in e-science, have been created and are publicly available. Recording provenance information of RDF triples aggregated from different heterogeneous sources is crucial in order to effectively support trust mechanisms, digital rights and privacy policies. Managing provenance becomes even more important when we consider not only explicitly stated but also implicit triples (through RDFS inference rules) in conjunction with declarative languages for querying and updating RDF graphs. In this paper we rely on colored RDF triples represented as quadruples to capture and manipulate explicit provenance information.",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The anatomy of mitos web search engine",
            "Publication year": 2008,
            "Publication url": "https://arxiv.org/abs/0803.2220",
            "Abstract": "Engineering a Web search engine offering effective and efficient information retrieval is a challenging task. This document presents our experiences from designing and developing a Web search engine offering a wide spectrum of functionalities and we report some interesting experimental results. A rather peculiar design choice of the engine is that its index is based on a DBMS, while some of the distinctive functionalities that are offered include advanced Greek language stemming, real time result clustering, and advanced link analysis techniques (also for spam page detection).",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Coloring RDF triples to capture provenance",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04930-9_13",
            "Abstract": "Recently, the W3C Linking Open Data effort has boosted the publication and inter-linkage of large amounts of RDF datasets on the Semantic Web. Various ontologies and knowledge bases with millions of RDF triples from Wikipedia and other sources, mostly in e-science, have been created and are publicly available. Recording provenance information of RDF triples aggregated from different heterogeneous sources is crucial in order to effectively support trust mechanisms, digital rights and privacy policies. Managing provenance becomes even more important when we consider not only explicitly stated but also implicit triples (through RDFS inference rules) in conjunction with declarative languages for querying and updating RDF graphs. In this paper we rely on colored RDF triples represented as quadruples to capture and manipulate explicit provenance information.",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On Power Laws and the Semantic Web",
            "Publication year": 2007,
            "Publication url": "https://projects.ics.forth.gr/isl/RDF/publications/MasterThesisTheohari.pdf",
            "Abstract": "Semantic Web (as the WWW itself) can be seen as a decentralized system that self organizes and evolves, scaling to unforeseen conditions, features which are typical of complex systems. A big amount of Semantic Web (SW) schemas expressed in either RDFS [11] or OWL [18] has been developed during the last years [43]. In their majority, they are not specified at the same level of detail and hence, only few classes appear as domain/range of many properties, while most appear as domain/range of few or none. Furthermore, they usually form interconnected graphs as a result of a social collaboration process, which involves the reuse and extension of the classes and properties defined in different schemas. In this setting, it would be interesting to investigate to what extent graph features that emerge in social network analysis, such as power-law degree distributions and the small world phenomenon, could be used to grasp the morphology of existing SW schemas. The knowledge of these features is essential in several contexts. For instance, it can be exploited for selecting or devising efficient index structures and search algorithms [1] or it can be exploited for ontology visualization [50]. Furthermore, it can be useful for revealing emerging conceptual modeling habits. Finally, it can be used for guiding synthetic SW data generation in order to benchmark SW repositories and query languages implementations in a credible manner. For instance, for developing ontology-based repositories that will be able to cope with the expected size of the",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On storage policies for semantic web repositories that support versioning",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-68234-9_51",
            "Abstract": "This paper concerns versioning services over Semantic Web (SW) repositories. We propose a novel storage index (based on partial orders), called POI, that exploits the fact that RDF Knowledge Bases (KB) have not a unique serialization (as it happens with texts). POI can be used for storing several (version-related or not) SW KBs. We discuss the benefits and drawbacks of this approach in terms of storage space and efficiency both analytically and experimentally in comparison with the existing approaches (including the change-based approach). For the latter case we report experimental results over synthetic data sets. POI offers notable space saving as well as efficiency in various cross version operations. It is equipped with an efficient version insertion algorithm and could be also exploited in cases where the set of KBs does not fit in main memory.",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On graph features of semantic web schemas",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4407710/",
            "Abstract": "In this paper, we measure and analyze the graph features of semantic Web (SW) schemas with focus on power-law degree distributions. Our main finding is that the majority of SW schemas with a significant number of properties (respectively, classes) approximate a power law for total-degree (respectively, the number of subsumed classes) distribution. Moreover, our analysis revealed some emerging conceptual modeling practices of SW schema developers: (1) each schema has a few focal classes that have been analyzed in detail (that is, they have numerous properties and subclasses), which are further connected with focal classes defined in other schemas, (2) class subsumption hierarchies are mostly unbalanced (that is, some branches are deep and heavy, while others are shallow and light), (3) most properties have as domain/range classes that are located high at the class subsumption hierarchies, and (4 …",
            "Abstract entirety": 0,
            "Author pub id": "AbUzPocAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the synthetic generation of semantic web schemas",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-70960-2_6",
            "Abstract": "In order to cope with the expected size of the Semantic Web (SW) in the coming years, we need to benchmark existing SW tools (e.g., query language interpreters) in a credible manner. In this paper we present the first RDFS schema generator, termed PoweRGen, which takes into account the morphological features that schemas frequently exhibit in reality. In particular, we are interested in generating synthetically the two core components of an RDFS schema, namely the property (relationships between classes or attributes) and the subsumption (subsumption relationships among classes) graph. The total-degree distribution of the former, as well as the out-degree distribution of the Transitive Closure (TC) of the latter, usually follow a power-law. PoweRGen produces synthetic property and subsumption graphs whose distributions respect the power-law exponents given as input with a confidence ranging …",
            "Abstract entirety": 0,
            "Author pub id": "AbUzPocAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On Storage Policies for Semantic Web Repositories That Support Versioning. The Semantic Web: Research and Applications",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=10282285995093743069&hl=en&oi=scholarr",
            "Abstract": "We describe ViCoS, a tool for constructing and visualising conceptual spaces in the area of language documentation. ViCoS allows users to enrich existing lexical information about the words of a language with conceptual knowledge. Their work towards language-based, informal ontology building must be supported by easy-to-use workflows and supporting software, which we will demonstrate.",
            "Abstract entirety": 1,
            "Author pub id": "AbUzPocAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer"
        }
    ]
}]