[{
    "name": "Ιωάννης Δημόπουλος",
    "romanize name": "Ioannis Dimopoulos",
    "School-Department": "Πληροφορικής",
    "University": "University of Cyprus",
    "Rank": "Καθηγητής",
    "Apella_id": 1879,
    "Scholar name": "Ioannis Dimopoulos, Ioannis F. Dimopoulos, Yannis Dimopoulos",
    "Scholar id": "DWfINNgAAAAJ",
    "Affiliation": "University of Peloponnese",
    "Citedby": 3018,
    "Scholar url": "https://scholar.google.com/citations?user=DWfINNgAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A Web-GIS for socio-demographic and public health data mapping",
            "Publication year": 2017,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Association of the apoptotic marker APO1/Fas with children’s predisposing factors for metabolic syndrome and with mean platelet volume",
            "Publication year": 2021,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/jpem-2021-0352/html",
            "Abstract": "Apoptosis antigen 1/FAS receptor (APO1/Fas) signaling in endothelial cells plays a significant role in angiogenesis while increased mean platelet volume (MPV) is an important marker for platelet activation. We investigated the possible correlation between APO1/Fas and both metabolic parameters and platelet activity (indicated by the MPV) in a healthy pediatric population.One hundred and eighty-five children, aged 5–17 years old, were enrolled in the study. The participants were divided into subgroups according to their age and body mass index percentile (BMI%). APO1/Fas was measured by enzyme-linked immunosorbent assay (ELISA) and MPV by the MEK-6410K.Eighty-one children (43.8%) had excess weight, which was more prevalent in children ≤9 years of age. Sixty-five children (35.1%) exhibited a predisposition for metabolic syndrome. A negative correlation was found …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:RHpTSmoSYBkC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "An application of artificial neural network models to estimate air temperature data in areas with sparse network of meteorological stations",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10934520802507621",
            "Abstract": "In this work artificial neural network (ANN) models are developed to estimate meteorological data values in areas with sparse meteorological stations. A more traditional interpolation model (multiple regression model, MLR) is also used to compare model results and performance. The application site is a canyon in a National Forest located in southern Greece. Four meteorological stations were established in the canyon; the models were then applied to estimate air temperature values as a function of the corresponding values of one or more reference stations. The evaluation of the ANN model results showed that fair to very good air temperature estimations may be achieved depending on the number of the meteorological stations used as reference stations. In addition, the ANN model was found to have better performance than the MLR model: mean absolute error values were found to be in the range 0.82–1.72°C …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "The combined effect of micrometeorological parameters and the growth regulator paclobutrazol on gardenia plants (Gardenia jasminoides Ellis)",
            "Publication year": 2002,
            "Publication url": "https://ams.confex.com/ams/AFMAPUE/techprogram/paper_36136.htm",
            "Abstract": "Modern agricultural practices used in greenhouse production are designed to produce compact, attractive and marketable plants by using plant growth regulators. These substances in combination to micrometeorological parameters affect the growth of ornamental plants. A chemical growth regulator, paclobutrazol, controls shoot extension and internode length by inhibiting gibberellin biosynthesis. The purpose of this paper is twofold: to report on micrometeorological data and biometrical measurements of gardenia plants under different solar radiation regimes in a greenhouse; and to apply simple statistical models to a time series of the micrometeorological and biometrical data in order to evaluate the combined effect of micrometeorological parameters and the application of paclobutrazol on the gardenia plant size. The experimental plants were grown under two radiation levels of about 250 W/m2 in an unshaded main plot R1 and 90 W/m2 in the R2 main plot shaded by polyester and aluminum artificial cover (Model LS-16 Opal of Ludving Svenson Co., The Netherlands). The plants were pinched at the second internode from the tips. The triazole paclobutrazol was applied once as a soil drench at the concentrations of 0, 5, 10 and 20 mg/L on gardenia plants grown at both radiation levels four days after pinching. Results showed that during the first 20 days of growth period after the applications the size of gardenia plants grown at both radiation levels was affected by micrometeorological parameters while the action of paclobutrazol was not found to be important. However, from about the 21th to the 86th day the size of gardenia plants treated with …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Predicting length of stay in hospitalized patients using ssl algorithms",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3218585.3218588",
            "Abstract": "Length of stay in hospitalized patients is acknowledged as a critical factor for healthcare policy planning that consequently affects the available human, technical and financial resources as well as facilities occupation. Over recent years, data mining and machine learning led to the development of several efficient and accurate models for predicting of how long a patient will stay in the hospital and support healthcare policy planning. As an alternative to traditional classification methods, semi-supervised learning algorithms have become a hot topic of significant research which exhibit remarkable performance over labeled data but lack the ability to be applied on large amounts of unlabeled data. In this work, we evaluate the performance of semi-supervised methods in predicting the length of stay of hospitalized patients. Our reported experimental results illustrate that a good predictive accuracy can be achieved using …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An evaluation of the performance of the soil temperature simulation algorithms used in the PRZM model",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10934520701244458",
            "Abstract": "Soil temperature simulation is an important component in environmental modeling since it is involved in several aspects of pollutant transport and fate. This paper deals with the performance of the soil temperature simulation algorithms of the well-known environmental model PRZM. Model results are compared and evaluated based on the basis of its ability to predict in situ measured soil temperature profiles in an experimental plot during a 3-year monitoring study. The evaluation of the performance is based on linear regression statistics and typical model statistical errors such as the root mean square error (RMSE) and the normalized objective function (NOF). Results show that the model required minimal calibration to match the observed response of the system. Values of the determination coefficient R2 were found to be in all cases around the value of 0.98 indicating a very good agreement between …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:ufrVoPGSRksC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Decision support software for forecasting patient’s length of stay",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/376906",
            "Abstract": "Length of stay of hospitalized patients is generally considered to be a significant and critical factor for healthcare policy planning which consequently affects the hospital management plan and resources. Its reliable prediction in the preadmission stage could further assist in identifying abnormality or potential medical risks to trigger additional attention for individual cases. Recently, data mining and machine learning constitute significant tools in the healthcare domain. In this work, we introduce a new decision support software for the accurate prediction of hospitalized patients’ length of stay which incorporates a novel two-level classification algorithm. Our numerical experiments indicate that the proposed algorithm exhibits better classification performance than any examined single learning algorithm. The proposed software was developed to provide assistance to the hospital management and strengthen the service system by offering customized assistance according to patients’ predicted hospitalization time. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Emotional Intelligence scores in children and adolescents with subclinical hypothyroidism-correlation with serum serotonin and thyroid stimulating hormone (TSH) concentrations",
            "Publication year": 2021,
            "Publication url": "https://scholar.google.com/scholar?cluster=11087412567313217448&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:4JMBOYKVnBMC",
            "Publisher": "KARGER"
        },
        {
            "Title": "Correlation of Dietary Habits with Systolic Blood Pressure in Healthy Children",
            "Publication year": 2018,
            "Publication url": "https://abstracts.eurospe.org/hrp/0089/hrp0089p2-p162.htm",
            "Abstract": "Background: Pediatric hypertension is a risk factor for adult hypertension and cardiovascular disease which entails the necessity of early detection.Aim: To investigate how nutrition habits are correlated with systolic blood pressure (SBP) in health children and adolescent population.Methods: 1395 children and adolescents from Greece were enrolled to participate in the research. A specially designed questionnaire regarding to eating habits-on a weekly basis-was used. Blood pressure was measured twice for each child with a 10-minute interval between the measurements. The mean value was taken into consideration as the final. The percentile for blood pressure was calculated according to children’s age and height. Children had studied in 3 groups: group A were children< 9 years old (36.77%), group B were children≥ 9 and≤ 14 years old (36.06%) and group C were children children> 14 and< 17 years old …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:hC7cP41nSMkC",
            "Publisher": "Bioscientifica"
        },
        {
            "Title": "The roles of triglyceride/high-density lipoprotein cholesterol ratio and uric acid as predisposing factors for metabolic syndrome in healthy children",
            "Publication year": 2019,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc6790870/",
            "Abstract": "PurposeTo estimate the roles of triglyceride/high-density lipoprotein cholesterol (TG/HDL) ratio and uric acid in predisposition for metabolic syndrome (MetS) and its components in healthy children.MethodsAnthropometric and biochemical analyses were performed on 110 children, aged 5 to 12 years, from the Greek county of Laconia. The children were studied as a whole population and in separate groups according to age and predisposition to MetS after taking into consideration International Diabetes Federation criteria, body mass index, and lipid profile.ResultsSeventeen percent of children exhibited predisposition to MetS, while 39.1% had TG/HDL ratio> 1, and 3.64% had high level of uric acid. According to a receiver operating characteristic curve analysis, the relative probability for MetS predisposition sextupled when TG/HDL ratio was≥ 1 (odds ratio [OR], 5.986; 95% confidence interval [CI], 1.968–18.205 …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Επίδραση των μακροθρεπτικών στοιχείων ΝΡΚ στην ανάπτυξη και ριζοβολία των σπορόφυτων ιπποφαούς",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimating airborne pollutant concentrations in vegetated urban sites using statistical models with microclimate and urban geometry parameters as predictor variables: A case study in the city of Athens Greece",
            "Publication year": 2009,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10934520903263256",
            "Abstract": "The present study demonstrates the efficiency of applying statistical models to estimate airborne pollutant concentrations in urban vegetation by using as predictor variables readily available or easily accessible data. Results revealed that airborne cadmium concentrations in vegetation showed a predictable response to wind conditions and to various urban landscape features such as the distance between the vegetation and the adjacent street, the mean height of the adjacent buildings, the mean density of vegetation between vegetation and the adjacent street and the mean height of vegetation. An artificial neural network (ANN) model was found to have superiority in terms of accuracy with an R2 value on the order of 0.9. The lowest R2 value (on the order of 0.7) was associated with the linear model (SMLR model). The linear model with interactions (SMLRI model) and the tree regression (RTM) model gave similar …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:WF5omc3nYNoC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Review and comparison of methods to study the contribution of variables in artificial neural network models",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304380002002570",
            "Abstract": "Convinced by the predictive quality of artificial neural network (ANN) models in ecology, we have turned our interests to their explanatory capacities. Seven methods which can give the relative contribution and/or the contribution profile of the input factors were compared: (i) the ‘PaD’ (for Partial Derivatives) method consists in a calculation of the partial derivatives of the output according to the input variables; (ii) the ‘Weights’ method is a computation using the connection weights; (iii) the ‘Perturb’ method corresponds to a perturbation of the input variables; (iv) the ‘Profile’ method is a successive variation of one input variable while the others are kept constant at a fixed value; (v) the ‘classical stepwise’ method is an observation of the change in the error value when an adding (forward) or an elimination (backward) step of the input variables is operated; (vi) ‘Improved stepwise a’ uses the same principle as the classical …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Socio-demographic and health factors influencing to the number of admissions of Elderly",
            "Publication year": 2017,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Statistical Modeling to Estimate Spatial Distribution of Airborne Fluoride in Natural Vegetation Around an Industrial Point Emission Source",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A screening level assessment of air-surface exchange of mercury vapor over some terrestrial landscapes: results from environmental and statistical models",
            "Publication year": 2002,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The role of micrometeorological parameters and paclobutrazol in vegetative growth of Gardenia jasminoides Ellis under greenhouse conditions [Greece]",
            "Publication year": 2004,
            "Publication url": "https://agris.fao.org/agris-search/search.do?recordID=IT2006601538",
            "Abstract": "The effects of micrometeorological parameters and of the plant growth regulator paclobutrazol on potted gardenia (Gardenia jasminoides Ellis) plants were investigated under greenhouse conditions in Attica (37 deg 48 20\" N, 23 deg 57 48\" E), Greece, in Summer of 1994 and 1995. Gardenia plants were grown at three levels of solar irradiance (SI) achieved by shading materials and treated with paclobutrazol (0, 5, 10 and 20 mg lE-1) drenches after pinching. In addition, to assist in detecting certain trends in the micrometeorological and biometrical data, the cumulated function was used. Results showed that for the first 45 or 58 days after the applications with paclobutrazol, depending on SI level, the effect of paclobutrazol did not appear to be very pronounced, while the effect of micrometeorological parameters was found to be very important. On the other hand, results revealed that paclobutrazol was the predominant factor regulating plant height for the 45th-93rd day period and also for the 58th-116th day period, depending on SI level and for concentrations 5 mg lE-1. From the 93rd or 116th day, depending on SI level, up to the end of the experimental period, results showed that paclobutrazol and micrometeorological conditions are important for the vegetative growth of gardenia plants",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Two-way interaction of input variables in the sensitivity analysis of neural network models",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304380005005752",
            "Abstract": "The major shortcoming of artificial neural networks (ANN) is the difficulty of interpreting the knowledge gained by “black-box” type models. Several methods, commonly called sensitivity analysis, have been proposed to overcome this disadvantage. The relative importance of each input variable on the output can then be determined. One of the existing methods uses partial derivatives (PaD) to visualise the contribution of single variables. However, in ecology, relationships are the result of multivariate and non-linear conditions; phenomena are rarely due to a simple cause or to a unique perturbation. For these reasons, a modification of the PaD (PaD2) was implemented to analyse the contribution of all possible pair-wise combinations of input variables, taking into account the two-way interactions between variables.In the present study, the PaD2 was applied firstly on synthetically generated data in order to test the …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:qjMakFHDy7sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A preliminary study of the application of some predictive modeling techniques to assess atmospheric mercury emissions from terrestrial surfaces",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1081/ESE-120024441",
            "Abstract": "Predictive modeling techniques are applied to investigate their potential usefulness in providing first order estimates on atmospheric emission flux of gaseous soil mercury and in identifying those parameters most critical in controlling such emissions. Predicted data by simulation and statistical techniques are compared to previously published observational data. Results showed that simulation techniques using air/soil coupling may provide a plausible description of mercury flux trends with a RMSE of 24.4 ng m−2 h−1 and a mean absolute error of 10.2 ng m−2 h−1 or 11.9%. From the statistical models, two linear models showed the lowest predictive abilities (R2 = 0.76 and 0.84, respectively) while the Generalized Additive model showed the closest agreement between estimated and observational data (R2 = 0.93). Predicted values from a Neural Network model and the Locally Weighted Smoother model showed …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "An application of parametric and nonparametric models to the assessment of fluoride levels in vegetation exposed to stack emissions of an aluminum reduction plant in Greece",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10473289.2003.10466168",
            "Abstract": "Various statistical models were developed for assessing airborne fluoride (F) levels in natural vegetation near an aluminum reduction plant using as predictor variables the distance from the emission source, the predominating wind, and characteristic topography-geomorphology parameters. Results revealed that F concentrations in vegetation showed a predictable response to both wind conditions and landscape features. The linear model was found to give good estimations, taking advantage of the relatively strong linear correlation between concentration and distance. A nonlinear relationship between the F concentration in vegetation and the other variables was also found, while interactions between the variables were found to be non-first-order. The nonlinear relationship hypothesis was supported by the improved results of various nonlinear models that also indicated the importance of the area’s …",
            "Abstract entirety": 0,
            "Author pub id": "DWfINNgAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "An application of artificial neural network models for estimating values of meteorological and biometeorological parameters in the urban canopy layer",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of microclimatic data in remote mountainous areas using an artificial neural network model-based approach",
            "Publication year": 2010,
            "Publication url": "https://journal.gnest.org/sites/default/files/Journal%20Papers/384-389_667_Chronopoulos_12-4.pdf",
            "Abstract": "An artificial neural network (ANN) model-based approach was developed and applied to estimate values of air temperature and relative humidity in remote mountainous areas. The application site was the mountainous area of the Samaria National Forest canyon (Greece). Seven meteorological stations were established in the area and ANNs were developed to predict air temperature and relative humidity for the five most remote stations of the area using data only from two stations located in the two more easily accessed sites. Measured and model-estimated data were compared in terms of the determination coefficient (R2), the mean absolute error (MAE) and residuals normality. Results showed that R2 values range from 0.7 to 0.9 for air temperature and from 0.7 to 0.8 for relative humidity whereas MAE values range from 0.9 to 1.8 oC and 5 to 9%, for air temperature and relative humidity, respectively. In conclusion, the study demonstrated that ANNs, when adequately trained, could have a high applicability in estimating meteorological data values in remote mountainous areas with sparse network of meteorological stations, based on a series of relatively limited number of data values from nearby and easily accessed meteorological stations.",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identification of synchronous machine parameters using constrained optimization",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/964812/",
            "Abstract": "In order to investigate transient performance problems in isolated power systems an accurate system dynamic model is required. Real measurements, under specific system operational conditions, have been used for the identification of the conventional generator unknown parameters. Frequency and power variations, resulting from the formulation model using the estimated parameters, are compared with the frequency and power deviations, measured during the corresponding real operational conditions in order to demonstrate the successful performance of the proposed methodology.",
            "Abstract entirety": 1,
            "Author pub id": "DWfINNgAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        }
    ]
}]