[{
    "name": "Ιωάννης Δολόγλου",
    "romanize name": "Ioannis Dologlou",
    "School-Department": "Ινστιτούτο Επεξεργασίας του Λόγου",
    "University": "athena-innovation",
    "Rank": "Διευθυντής Ερευνών",
    "Apella_id": 17763,
    "Scholar name": "ioannis dologlou",
    "Scholar id": "gR1xCV8AAAAJ",
    "Affiliation": "Senior researcher Athena RC",
    "Citedby": 865,
    "Interests": [
        "Signal Processing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=gR1xCV8AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Emotion in speech: Towards an integration of linguistic, paralinguistic, and psychological analysis",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44989-2_134",
            "Abstract": "If speech analysis is to detect a speaker’s emotional state, it needs to derive information from both linguistic information, i.e., the qualitative targets that the speaker has attained (or approximated), conforming to the rules of language; and paralinguistic information, i.e., allowed variations in the way that qualitative linguistic targets are realised. It also needs an appropriate representation of emotional states. The ERMIS project addresses the integration problem that those requirements pose. It mainly comprises a paralinguistic analysis and a robust speech recognition module. Descriptions of emotionality are derived from these modules following psychological and linguistic research that indicates the information likely to be available. We argue that progress in registering emotional states depends on establishing an overall framework of at least this level of complexity.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A new approach for words reordering based on statistical language model",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.361.7423&rep=rep1&type=pdf",
            "Abstract": "There are multiple reasons to expect that detecting the word order errors in a text will be a difficult problem, and detection rates reported in the literature are in fact low. Although grammatical rules constructed by computer linguists improve the performance of grammar checker in word order diagnosis, the repairing task is still very difficult. This paper presents an approach for repairing word order errors in English text by reordering words in a sentence and choosing the version that maximizes the number of trigram hits according to a language model. The novelty of this method concerns the use of an efficient confusion matrix technique for reordering the words. The comparative advantage of this method is that works with a large set of words, and avoids the laborious and costly process of collecting word order errors for creating error patterns.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Αποδεκατισμός και ανάλυση ιδιαζουσών τιμών για την εκτίμηση των παραμέτρων εκθετικά αποσβεννύμενων ημιτόνων στην ποσοτική ανάλυση φασμάτων NMR",
            "Publication year": 2003,
            "Publication url": "http://archive.ilsp.gr/en/profile/research-departments/culturecreativeindustry?view=publication&task=show&id=646",
            "Abstract": "Στην παρούσα εργασία παρουσιάζεται η μέθοδος φασματικής ανάλυσης που βασίζεται στην προσέγγιση του χώρου καταστάσεων (state-space) και η οποία χρησιμοποιεί αποδεκατισμό (decimation) κατά παράγοντα 2 (ο βαθμός αποδεκατισμού γενικεύεται σε D), ενώ εκμεταλλεύεται το πλήρες σύνολο δεδομένων (βλ. και [Π1]). Η προτεινόμενη μέθοδος ονομάζεται DESE_D, και κάνει χρήση των αποδεκατισμένων πινάκων Hankel και της ανάλυσης ιδιαζουσών τιμών (Singular Value Decomposition) με στόχο την εκτίμηση της συχνότητας, του συντελεστή απόσβεσης, του πλάτους και της φάσης εκθετικά αποσβεννύμενων ημιτόνων σε παρουσία θορύβου. Mε την βοήθεια του αποδεκατισμού επιτυγχάνεται μία τεχνητή απομάκρυνση των πόλων, γεγονός που αυξάνει τη διακριτική ικανότητα της μεθόδου με βελτίωση των εκτιμώμενων παραμέτρων. Παρουσιάζεται επίσης και η εκδοχή της DESE_D, που ονομάζεται DESE_D_TLS, και …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The IMUTUS interactive music tuition system",
            "Publication year": 2002,
            "Publication url": "https://asa.scitation.org/doi/abs/10.1121/1.4777872",
            "Abstract": "This presentation focuses on the IMUTUS project, which concerns the creation of an innovative method for training users on traditional musical instruments with no MIDI (Musical Instrument Digital Interface) output. The entities collaborating in IMUTUS are ILSP (coordinator), EXODUS, SYSTEMA, DSI, SMF, GRAME, and KTH. The IMUTUS effectiveness is enhanced via an advanced user interface incorporating multimedia techniques. Internet plays a pivotal role during training, the student receiving guidance over the net from a specially created teacher group. Interactiveness is emphasized via automatic‐scoring tools, which provide fast yet accurate feedback to the user, while virtual reality methods assist the student in perfecting his technique. IMUTUS incorporates specialized recognition technology for the transformation of acoustic signals and music scores to MIDI format and incorporation in the training process …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:O3NaXMp0MMsC",
            "Publisher": "Acoustical Society of America"
        },
        {
            "Title": "Linear Discriminant Analysis Applied to the Detection of Allergic Rhinitis in Patients",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9458096/",
            "Abstract": "This paper presents a system to detect symptoms of allergic rhinitis remotely by using uttered speech and by exploiting its specific spectral characteristics. Based on the principles of adaptive modeling and fundamental frequency variations (jitter) as well as speech analysis by means of acoustic models, the proposed technique achieves an efficient classification of patients from uttered speech using a Linear Discriminant Analysis (LDA) algorithm. A Singular Value Decomposition (SVD) based iterative approach is used for the accurate estimation of the jitter and Hidden Markov Models (HMM) are implemented to model the 32 phonemes. The final decision is derived by optimally combining the individual estimates to form vectors that are processed by an LDA based iterative algorithm providing better clustering of healthy and allergic subjects.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating ASR confidence score performance in different noisy conditions",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.137.9031&rep=rep1&type=pdf",
            "Abstract": "This paper deals with the impact of a signal enhancement method on speech recognition confidence scores, in the presence of noise. The speech recognition confidence score reflects the reliability of correctness of the recogniser’s output. This is important since errors in the presence of noise are more frequent and tend to make applications, such as spoken dialogue systems, too cumbersome to use. By recognising enhanced signals not only the word error rate decreases but also the word-based confidence scores decline. Therefore, the role of speech recognition in spoken dialogue systems weakens. The experimentation involves input signal corrupted by coloured noise and cocktail party noise with varying Signal-to-Noise Ratio. A non-linear spectral subtraction method (NSS) will be used in conjunction with the Continuous Speech Recognition system developed for the ERMIS project (IST-2000-29319) to quantify the impact of speech enhancement on confidence score accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust Continuous Speech Recognition in the Presence of Coloured Noise",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=10996553085675625478&hl=en&oi=scholarr",
            "Abstract": "The present work discusses the problem of Automatic Speech Recognition (ASR) in the presence of coloured noise. The input signal is processed via a newly presented SVD based algorithm to reduce the noise level. The weak assumption that noise standard deviation is known to the user has been made. The method was evaluated by the means of the well-known HTK ASR system with continuous speech, speaker independent and context dependent task. The obtained results show that the proposed technique is very efficient allowing a considerable improvement of the performance of the recognizer in the presence of coloured noise.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interrelation of the equation of state of MgO and self diffusion coefficients",
            "Publication year": 2011,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3610411",
            "Abstract": "Here, we show that elastic and expansivity data can successfully reproduce the self diffusion coefficients of O and Mg in MgO from a single measurement, through a thermodynamic model that interrelates point defect parameters and bulk properties. The calculated self diffusion coefficients at pressure and temperature conditions prevailing in the lower earth’s mantle, although they cover a wide range of values (i.e., 20 orders of magnitude), compare favorably well with experimental Dexper ones when errors are considered.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:d1gkVwhDpl0C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "A comparative study of ASR performance in different emotional states",
            "Publication year": 2006,
            "Publication url": "http://archive.ilsp.gr/en/profile/research-departments?view=publication&task=show&id=664",
            "Abstract": "Emotional speech recognition rates reported in the literature are in fact low. Although knowledge in the area has been developing rapidly, it is still limited in fundamental ways. The first issue concerns that not much of the spectrum of emotionally coloured expressions has been studied. The second issue is that most research on speech and emotion has focused on recognising the emotion being expressed and not on the classic Automatic Speech Recognition (ASR) problem of recovering the verbal content of the speech. Read speech and non-read speech in a ‘careful’style can be recognized with accuracy higher than 95% using the state-of-the-art speech recognition technology. This paper investigates the recognition performance using spontaneous emotionally colored speech, produced by people holding conversations with Sensitive Artificial Listener (SAL), a simulated ‘chatbot’system.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recognising verbal content of emotionally coloured speech",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071201/",
            "Abstract": "Recognising the verbal content of emotional speech is a difficult problem, and recognition rates reported in the literature are in fact low. Although knowledge in the area has been developing rapidly, it is still limited in fundamental ways. The first issue concerns that not much of the spectrum of emotionally coloured expressions has been studied. The second issue is that most research on speech and emotion has focused on recognising the emotion being expressed and not on the classic Automatic Speech Recognition (ASR) problem of recovering the verbal content of the speech. Read speech and non-read speech in a `careful' style can be recognized with accuracy higher than 95% using the state-of-the-art speech recognition technology. Including information about prosody improves recognition rate for emotions simulated by actors, but its relevance to the freer patterns of spontaneous speech is unproven. This …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Signal Enhancement for Continuous Speech Recognition",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44989-2_133",
            "Abstract": "This paper presents a comparison between two parametric methods for Signal Enhancement in order to address the problem of robust Automatic Speech Recognition (ASR). An SVD–based technique (ISE) and a non-linear spectral subtraction method (NSS), have been evaluated by means of the Continuous Speech Recognition system that is used in the ERMIS project. The input signal is corrupted with coloured noise with variable signal-to-noise ratio. It was found that fine-tuning of the various parameters of the enhancement techniques is crucial for efficient optimisation of their performance. Both methods provide significant improvement of the speech recogniser performance in the presence of coloured noise, with the NSS method being slightly better.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Single channel SVD based noise reduction techniques",
            "Publication year": 2015,
            "Publication url": "http://hypatia.teiath.gr/xmlui/handle/11400/8480",
            "Abstract": "Υπατία - Single channel SVD based noise reduction techniques Toggle navigation ΤΕΙ \nΑθήνας Είσοδος Αρχική Σελίδα / Ακαδημαϊκή Έρευνα και Εκπαίδευση / Σχολή Διοίκησης και \nΟικονομίας / Τμήμα Βιβλιοθηκονομίας και Συστημάτων Πληροφόρησης / Δημοσιεύσεις / \nΕμφάνιση Τεκμηρίου Single channel SVD based noise reduction techniques Δενδρινός, \nΜάρκος Ν.; Μπακαμίδης, Στυλιανός; Δολόγλου, Ιωάννης; Καραγιάννης, Γεώργιος; Dendrinos, \nMarkos N.; Bakamidis, Stelios G.; Dologlou, Ioannis; Karagiannis, Georgios A. URI: http://hdl.handle.net/11400/8480 \nΗμερομηνία Δημοσίευσης: 2001-01 Τύπος Τεκμηρίου: Δημοσίευση σε συνέδριο Όνομα \nΣυνεδρίου: 4th European Conference on Noise Control EURONOISE 2001 Πηγή: http://www.ilsp.gr/en/research/publications?view=publication&task=show&id=770 \nΘέμα: Computer science, Acoustics, Πληροφορική, Ακουστική Εμφάνιση πλήρους εγγραφής \nΑρχεία σε αυτό το . …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the use of a decimative spectral estimation method based on eigenanalysis and SVD for formant and bandwidth tracking of speech signals",
            "Publication year": 2005,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/interspeech_2005/i05_0709.pdf",
            "Abstract": "In this paper, a Decimative Spectral estimation method based on Eigenanalysis and SVD (Singular Value Decomposition) is presented and applied to speech signals in order to estimate Formant/Bandwidth values. The underlying model decomposes a signal into complex damped sinusoids. The algorithm is applied not only on speech samples but on a small amount of the autocorrelation coefficients of a speech frame as well, for finer estimation. Correct estimation of Formant/Bandwidth values depend on the model order thus, the requested number of poles. Overall, experimentation results indicate that the proposed methodology successfully estimates formant trajectories and their respective bandwidths.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing Speech Recognition performance in the presence of MRI scanner noise",
            "Publication year": 2010,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSISE.2010.03689",
            "Abstract": "In this paper, two well-known speech enhancement techniques are compared in a Magnetic Resonance Imaging (MRI) scanner noise reduction scheme prior to speech recognition experiment. Our study deals with the comparison between the Non Linear Spectral Subtraction (NSS) with iterative overestimation and the Singular Value Decomposition (SVD)-based noise reduction techniques in enhancing medical content speech contaminated by MRI scanner noise. It is proven experimentally that both techniques can improve the recognition performance of voice commands in order to voice control a MRI scanner. Making one step ahead, the paper further investigates the performance of both signal enhancement techniques in the recognition of speech utterances with medical information. The recognition results show that each technique improved the recognition accuracy as it was expected, but the NSS …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:SeFeTyx0c_EC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Sentence-level Evaluation Using Co-occurences of N-grams",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87536-9_77",
            "Abstract": "This work presents an evaluation method of Greek sentences with respect to word order errors. The evaluation method is based on words’ reordering and choosing the version that maximizes the number of trigram hits according to a language model. The new parameter of the proposed technique concerns the incorporation of unigram probability. This probability corresponds to the frequency of each unigram to be posed in the first and in the last position of the training set sentences. The comparative advantage of this method is that it works with a large set of words, and avoids the laborious and costly process of collecting word order errors for creating error patterns.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A novel technique for words reordering based on n-grams",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4555284/",
            "Abstract": "This paper presents an approach for repairing word order errors in English text by reordering words in a sentence and choosing the version that maximizes the number of trigram hits according to a language model. The novelty of this method concerns the use of an efficient confusion matrix technique for reordering the words. For further reducing the number of permutations the use of unigramspsila probability is used. The comparative advantage of this method is that works with a large set of words, and avoids the laborious and costly process of collecting word order errors for creating error patterns.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the use of a decimative spectral estimation method based on eigenanalysis and svd for formant and bandwidth tracking of speech signals",
            "Publication year": 2015,
            "Publication url": "http://hypatia.teiath.gr/xmlui/handle/11400/9413",
            "Abstract": "In this paper, a Decimative Spectral estimation method based on Eigenanalysis and SVD (Singular Value Decomposition) is presented and applied to speech signals in order to estimate Formant/Bandwidth values. The underlying model decomposes a signal into complex damped sinusoids. The algorithm is applied not only on speech samples but on a small amount of the autocorrelation coefficients of a speech frame as well, for finer estimation. Correct estimation of Formant/Bandwidth values depend on the model order thus, the requested number of poles. Overall, experimentation results indicate that the proposed methodology successfully estimates formant trajectories and their respective bandwidths.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiresolution image compression using non linear transformations",
            "Publication year": 2014,
            "Publication url": "http://world-comp.org/preproc2014/IPC2863.pdf",
            "Abstract": "This paper presents a new non-linear algorithm for image compression operating at different resolution levels and exploiting the binary versions of the intermediate images. The decimation factor that applies between the resolution levels along with the efficient coding of the binary signals allow considerable compression rates while maintaining the image quality. Lossless compression algorithms based on arithmetic coding are used to compress the binary files that are created during the image decomposition. The method was compared experimentally against the existing standard JPEG using the well known reference image “lenna” and it was shown that for similar compression rates it is blocking artifact free, offering at the same time higher peak SNR.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:maZDTaKrznsC",
            "Publisher": "The Steering Committee of The World Congress in Computer Science, Computer Engineering and Applied Computing (WorldComp)"
        },
        {
            "Title": "Incorporating Speech Recognition Engine into an Intelligent Assistive Reading System for Dyslexic Students",
            "Publication year": 2011,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/interspeech_2011/i11_2993.pdf",
            "Abstract": "In this paper we present an approach for incorporating a state of the art speech recognition engine into a novel assistive reading system for Greek dyslexic students. This system is being developed in the framework of the AGENT-DYSL IST project, and facilitates dyslexic children in learning to read fluently. Unlike previously presented approaches, the aim of this system is to monitor the progress and perspectives of a dyslexic user and supply personalised help. The goal of this help is to gradually increase the reading capabilities of the user, gradually diminish the assistance provided, till he is able to read as a non-dyslexic reader.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Word reordering based on Statistical Language Model",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.995.3357&rep=rep1&type=pdf",
            "Abstract": "There are multiple reasons to expect that detecting the word order errors in a text will be a difficult problem, and detection rates reported in the literature are in fact low. Although grammatical rules constructed by computer linguists improve the performance of grammar checker in word order diagnosis, the repairing task is still very difficult. This paper presents an approach for repairing word order errors in English text by reordering words in a sentence and choosing the version that maximizes the number of trigram hits according to a language model. The novelty of this method concerns the use of an efficient confusion matrix technique for reordering the words. The comparative advantage of this method is that works with a large set of words, and avoids the laborious and costly process of collecting word order errors for creating error patterns.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reducing the cocktail party effect prior to Automatic Speech recognition",
            "Publication year": 2009,
            "Publication url": "http://archive.ilsp.gr/en/profile/staff?view=publication&task=show&id=762",
            "Abstract": "This work deals with signals impaired by white noise, coloured noise and cocktail party effect with varying Signal-to-Noise Ratio. A non-linear spectral subtraction method (NSS) will be used in conjunction with the Large Vocabulary Continuous Speech Recognition system developed for the HEARCOM project (004171) to quantify the impact of speech enhancement on speech recognition performance. It is shown that the impact of NSS depends on the type of noise.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formant estimation of speech signals using subspace-based spectral analysis",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071665/",
            "Abstract": "The objective of this paper is to propose a signal processing scheme that employs subspace-based spectral analysis for the purpose of formant estimation of speech signals. Specifically, the scheme is based on decimative spectral estimation that uses Eigenanalysis and SVD (Singular Value Decomposition). The underlying model assumes a decomposition of the processed signal into complex damped sinusoids. In the case of formant tracking, the algorithm is applied on a small amount of the autocorrelation coefficients of a speech frame. The proposed scheme is evaluated on both artificial and real speech utterances from the TIMIT database. For the first case, comparative results to standard methods are provided which indicate that the proposed methodology successfully estimates formant trajectories.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "N-grams: A Tool for Repairing Word Order Errors in ill-formed Texts",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.122.9022&rep=rep1&type=pdf",
            "Abstract": "This paper presents an approach for repairing word order errors in English text by reordering words in a sentence and choosing the version that maximizes the number of trigram hits according to a language model. A possible way for reordering the words is to use all the permutations. The problem is that for a sentence with length N words the number of all permutations is N!. The novelty of this method concerns the use of an efficient confusion matrix technique for reordering the words. The confusion matrix technique has been designed in order to reduce the search space among permuted sentences. The limitation of search space is succeeded using the statistical inference of N-grams. The results of this technique are very interesting and prove that the number of permuted sentences can be reduced by 98, 16%. For experimental purposes a test set of TOEFL sentences was used and the results show that more than 95% can be repaired using the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ASR for emotional speech: clarifying the issues and enhancing performance",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0893608005000419",
            "Abstract": "There are multiple reasons to expect that recognising the verbal content of emotional speech will be a difficult problem, and recognition rates reported in the literature are in fact low. Including information about prosody improves recognition rate for emotions simulated by actors, but its relevance to the freer patterns of spontaneous speech is unproven. This paper shows that recognition rate for spontaneous emotionally coloured speech can be improved by using a language model based on increased representation of emotional utterances. The models are derived by adapting an already existing corpus, the British National Corpus (BNC). An emotional lexicon is used to identify emotionally coloured words, and sentences containing these words are recombined with the BNC to form a corpus with a raised proportion of emotional material. Using a language model based on that technique improves recognition rate by …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:LkGwnXOMwfcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Automatic detection of allergic rhinitis in patients",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9070914/",
            "Abstract": "This paper presents a system to detect symptoms of allergic rhinitis remotely by using uttered speech and by exploiting its specific spectral characteristics. Based on the principles of adaptive modelling and fundamental frequency variations (jitter) as well as speech analysis by means of acoustic models, the proposed technique achieves an efficient classification of patients from uttered speech. A Singular Value Decomposition based iterative approach is used for the accurate estimation of the jitter and Hidden Markov Models are implemented to model the 32 phonemes. The final decision is derived by optimally combining the individual estimates providing a tool for the automatic diagnosis of allergic rhinitis.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Impact of Speech Enhancement on ASR time stamping",
            "Publication year": 2004,
            "Publication url": "http://archive.ilsp.gr/en/profile/research-departments/culturecreativeindustry?view=publication&task=show&id=10",
            "Abstract": "This paper discusses the improvement of speech recognition time stamping accuracy in the presence of noise, when a parametric method of signal enhancement is used. The more accurate time stamp of each recognised word enhances the performance of multimodal systems. The recognised word’s time stamp reflects how accurate the word’s boundaries are, along the recognised utterance. This is important since errors in the presence of noise are more frequent and tend to make applications, such as spoken dialogue systems, too cumbersome to use. The input signal is corrupted with coloured noise with varying signal-to-noise ratio. As noise levels increase not only the WER rises but also the word’s time stamp deteriorates. A non-linear spectral subtraction method (NSS) will be used in conjunction with the Continuous Speech Recognition system of the ERMIS project to quantify the impact of speech …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectral estimation based on the eigenanalysis of companion-like matrices",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/861936/",
            "Abstract": "This paper presents a new state-space method for spectral estimation based on a companion matrix technique in order to estimate frequency, damping factor, amplitude and phase of exponential sinusoids. The new method, called CSE (companion matrix based spectral estimation), is compared against a previously proposed method called HTLS which is based on the use of total least squares. The latter lies among the most promising methods in the field of spectroscopy where accuracy of parameter estimation is of utmost importance. Experiments performed on a simulated NMR signal prove CSE to be more robust in terms of failure rate, especially for low signal to noise ratio.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Decimation and SVD to estimate exponentially damped sinusoids in the presence of noise",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/940307/",
            "Abstract": "A new state-space method for spectral estimation that performs decimation by factor two while it makes use of the full set of data available is presented. The proposed method, called DESE2, is based on singular value decomposition in order to estimate frequency, damping factor, amplitude and phase of exponentially damped sinusoids in the presence of noise. The DESE2 method is compared against some previously proposed methods for spectral estimation that lie among the most promising methods in the field of spectroscopy, where accuracy of parameter estimation is of utmost importance. Experiments performed on a typical simulated NMR signal prove the new method to be more robust, especially for low signal to noise ratio. The new method outperforms the other two not only by presenting lower failure rates but also by incorporating enhanced discriminative analysis while at the same time it benefits from …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "User Evaluation of a novel technique for word-order error correction",
            "Publication year": 2007,
            "Publication url": "http://archive.ilsp.gr/en/profile/research-departments/culturecreativeindustry?view=publication&task=show&id=778",
            "Abstract": "This paper presents a user evaluation of a technique for repairing word order errors in Greek texts. This technique reorders words in a sentence and chooses the version that maximizes the number of trigram hits according to a language model. The novelty of this method consists in the use of an efficient confusion matrix technique for reordering the words. The comparative advantage of this method is that works with a large set of words, and avoids the laborious and costly process of collecting word order errors for creating error patterns. The experimental task concerns the collection of data from human participants when asked to reorder randomly presented words in order to form a meaningful sentence. The purpose of this experiment is to show the relation that exists between the sentences the users propose and the system's output.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personal Allergy Tracker (PAT): Description of a study protocol utilizing m-Health technology for monitoring allergic rhinitis. Can mobile technology improve control?",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=1390935953250252258&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "WILEY"
        },
        {
            "Title": "Detailed results for the work presented in’Decimative Spectral Estimation based on the eigenanalysis of Hankel matrices’ ILSP Internal Report, 2001",
            "Publication year": 2001,
            "Publication url": "http://archive.ilsp.gr/administrator/components/com_jresearch/files/publications/ILSP_REPORT_results_tables.pdf",
            "Abstract": "1-86 50 75 135 2-70 50 150 135 3-54 50 75 135 4 152 50 150 135 5 168 50 150 135 6 292 50 150 135 7 308 50 150 135 8 360 25 150 135 9 440 285.7 1400 135 10 490 25 60 135 11 530 200 500 135 caption {Exact parameter values of the eleven peak simulated 31P NMR signal.} label ref {11peaks31Psignal}",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving speech recognition performance in noisy environments",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.380.171&rep=rep1&type=pdf",
            "Abstract": "Speech recognition errors affect the performance of multimodal systems especially in noisy conditions. For that reason the use of speech recognition confidence score and time stamps is suggested. This paper deals with the impact of a signal enhancement method on these speech recognition’s parameters, in the presence of noise. By recognising noisy signals not only the word error rate (WER) increases but also the word-based confidence scores decline. Therefore, the role of speech recognition in multimodal systems weakens. The experimentation involves input signal corrupted by coloured noise with varying Signal-to-Noise Ratio. A non-linear spectral subtraction method (NSS) will be used in conjunction with the Continuous Speech Recognition system developed for the ERMIS project (IST-2000-29319) to quantify the impact of speech enhancement on speech recognition output.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Decimative Spectral Estimation with Unconstrained Model Order",
            "Publication year": 2012,
            "Publication url": "https://www.hindawi.com/journals/cmmm/2012/917695/",
            "Abstract": "This paper presents a new state-space method for spectral estimation that performs decimation by any factor, it  makes use of the full set of data and brings further apart the poles under consideration, while imposing almost no constraints to the size of the Hankel matrix (model order), as decimation increases. It is compared against two previously proposed techniques for spectral estimation (along with derived decimative versions), that lie among the most promising methods in the field of spectroscopy, where accuracy of parameter estimation is of utmost importance. Moreover, it is compared against a state-of-the-art purely decimative method proposed in literature. Experiments performed on simulated NMR signals prove the new method to be more robust, especially for low signal-to-noise ratio.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:_kc_bZDykSQC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "A new decimative spectral estimation method with unconstrained model order and decimation factor",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-3552-0_28",
            "Abstract": "This paper presents a new state-space method for spectral estimation that performs decimation by any factor D while it imposes no constraints to the model order with respect to D. The new method, called DESED, as well as its Total Least Squares version called DESED_TLS, makes use of the full data set available and is based on SVD in order to estimate frequency, damping factor, amplitude and phase of exponential sinusoids.The new methods are tested in the field of Nuclear Magnetic Resonance (NMR) spectroscopy, where accuracy of parameter estimation is of utmost importance. They are compared against HTLS -an existing method for spectral estimation- its decimative version HTLSD and against a purely decimative method (CONDED). Monte-Carlo based experiments performed on a typical simulated NMR signal prove the new methods to be more robust, especially for low signal to noise ratio.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Signal and Time Series Processing-Sentence-Level Evaluation Using Co-occurences of N-Grams",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=1987898198116639227&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Impact of MRI scanner noise on Speech Recognition confidence score",
            "Publication year": 2009,
            "Publication url": "http://archive.ilsp.gr/en/research/publications?view=publication&task=show&id=736",
            "Abstract": "This paper discusses the improvement of speech recognition confidence scores in the presence of Magnetic Resonance Imaging (MRI) scanner noise using two parametric methods of signal enhancement. Our study deals with the comparison between the Non Linear Spectral Subtraction (NSS) with iterative overestimation and the SVD-based noise reduction techniques in enhancing medical content speech contaminated by MRI scanner noise. A speech recognition confidence score reflects how confident the recogniser is for the recognised utterance. This is important since errors in the presence of noise are more frequent and tend to make applications too cumbersome to use. The input signal is corrupted with MRI noise with varying Signal-to-Noise Ratio. As noise levels increase not only the Word Error Rate (WER) deteriorates but also the confidence score for each word decreases. It is proven experimentally …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A corpus based technique for repairing ill-formed sentences with word order errors using co-occurrences of n-grams",
            "Publication year": 2011,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213011000218",
            "Abstract": "There are several reasons to expect that recognising word order errors in a text will be a difficult problem, and recognition rates reported in the literature are in fact low. Although grammatical rules constructed by computational linguists improve the performance of a grammar checker in word order diagnosis, the repairing task is still very difficult. This paper describes a method to repair any sentence with wrong word order using a statistical language model (LM). A good indicator of whether a person really knows a language is the ability to use the appropriate words in a sentence in correct word order. The \"scrambled\" words in a sentence produce a meaningless sentence. Most languages have a fairly fixed word order. This paper introduces a method, which is language independent, for repairing word order errors in sentences using the probabilities of most typical trigrams and bigrams extracted from a large text …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:M05iB0D1s5AC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "N-Grams: A Tool for Repairing Word Order Errors in Ill-formed Texts",
            "Publication year": 2007,
            "Publication url": "https://publications.waset.org/11328/n-grams-a-tool-for-repairing-word-order-errors-in-ill-formed-texts",
            "Abstract": "This paper presents an approach for repairing word order errors in English text by reordering words in a sentence and choosing the version that maximizes the number of trigram hits according to a language model. A possible way for reordering the words is to use all the permutations. The problem is that for a sentence with length N words the number of all permutations is N!. The novelty of this method concerns the use of an efficient confusion matrix technique for reordering the words. The confusion matrix technique has been designed in order to reduce the search space among permuted sentences. The limitation of search space is succeeded using the statistical inference of N-grams. The results of this technique are very interesting and prove that the number of permuted sentences can be reduced by 98, 16%. For experimental purposes a test set of TOEFL sentences was used and the results show that more than …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust Speech Recognition in the presence of noise using medical data",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4659999/",
            "Abstract": "This paper discusses the improvement of speech recognition in the presence of noise, when a parametric method of signal enhancement is used. The speech enhancement method improves the performance of voice control MRI. This is important since errors in the presence of noise are more frequent and tend to make applications, such as spoken dialogue systems, too cumbersome to use. The input signal is corrupted with MRI noise with varying signal-to-noise ratio. A non-linear spectral subtraction method (NSS) as well as an SVD based noise reduction techniques (ISE) are used in conjunction with the Speech Recognition system of the FAST project, to quantify the impact of speech enhancement.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Single channel SVD based noise reduction techniques",
            "Publication year": 2015,
            "Publication url": "http://hypatia.teiath.gr/xmlui/handle/11400/8480",
            "Abstract": "Υπατία - Single channel SVD based noise reduction techniques Toggle navigation ΤΕΙ \nΑθήνας Είσοδος Αρχική Σελίδα / Ακαδημαϊκή Έρευνα και Εκπαίδευση / Σχολή Διοίκησης και \nΟικονομίας / Τμήμα Βιβλιοθηκονομίας και Συστημάτων Πληροφόρησης / Δημοσιεύσεις / \nΕμφάνιση Τεκμηρίου Single channel SVD based noise reduction techniques Δενδρινός, \nΜάρκος Ν.; Μπακαμίδης, Στυλιανός; Δολόγλου, Ιωάννης; Καραγιάννης, Γεώργιος; Dendrinos, \nMarkos N.; Bakamidis, Stelios G.; Dologlou, Ioannis; Karagiannis, Georgios A. URI: http://hdl.handle.net/11400/8480 \nΗμερομηνία Δημοσίευσης: 2001-01 Τύπος Τεκμηρίου: Δημοσίευση σε συνέδριο Όνομα \nΣυνεδρίου: 4th European Conference on Noise Control EURONOISE 2001 Πηγή: http://www.ilsp.gr/en/research/publications?view=publication&task=show&id=770 \nΘέμα: Computer science, Acoustics, Πληροφορική, Ακουστική Εμφάνιση πλήρους εγγραφής \nΑρχεία σε αυτό το . …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formant estimation of speech signals using subspace-based spectral analysis",
            "Publication year": 2015,
            "Publication url": "http://hypatia.teiath.gr/xmlui/handle/11400/9403",
            "Abstract": "The objective of this paper is to propose a signal processing scheme that employs subspace-based spectral analysis for the purpose of formant estimation of speech signals. Specifically, the scheme is based on decimative spectral estimation that uses Eigenanalysis and SVD (Singular Value Decomposition). The underlying model assumes a decomposition of the processed signal into complex damped sinusoids. In the case of formant tracking, the algorithm is applied on a small amount of the autocorrelation coefficients of a speech frame. The proposed scheme is evaluated on both artificial and real speech utterances from the TIMIT database. For the first case, comparative results to standard methods are provided which indicate that the proposed methodology successfully estimates formant trajectories.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Word reordering based on Statistical Language Model",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.995.3357&rep=rep1&type=pdf",
            "Abstract": "There are multiple reasons to expect that detecting the word order errors in a text will be a difficult problem, and detection rates reported in the literature are in fact low. Although grammatical rules constructed by computer linguists improve the performance of grammar checker in word order diagnosis, the repairing task is still very difficult. This paper presents an approach for repairing word order errors in English text by reordering words in a sentence and choosing the version that maximizes the number of trigram hits according to a language model. The novelty of this method concerns the use of an efficient confusion matrix technique for reordering the words. The comparative advantage of this method is that works with a large set of words, and avoids the laborious and costly process of collecting word order errors for creating error patterns.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Statistical Method for Correcting Word Order Errors in Greek Texts",
            "Publication year": 2006,
            "Publication url": "https://www.actapress.com/Abstract.aspx?paperId=29125",
            "Abstract": "A STATISTICAL METHOD FOR CORRECTING WORD ORDER ERRORS IN GREEK TEXTS \nTheologos Athanaselis, Stelios Bakamidis, Ioannis Dologlou Institute for Language and \nSpeech Processing Artemidos 6 and Epidavrou, Maroussi, Athens, PC 15125 Greece {tathana;bakam;ydol}@ilsp.gr \nABSTRACT This paper presents an approach for correcting word order errors in Greek texts \nby reordering the words in a sentence and choosing the version that maximizes the number \nof trigram hits according to a language model. The novelty of this method concerns the use \nof an efficient confusion matrix technique for reordering the words. The comparative \nadvantage of this method is that works with a large set of words, and avoids the laborious \nand costly process of collecting word order errors for creating error patterns. KEY WORDS \nLanguage model, permutations filtering, confusion matrix, word order errors. 1. Automatic …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An automatic method for revising ill-formed sentences based on N-grams",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.495.1515&rep=rep1&type=pdf",
            "Abstract": "A good indicator of whether a person really knows the context of language is the ability to use in correct order the appropriate words in a sentence. The “scrambled” words cause a meaningless and ill formed sentences. Since the language model, is extracted from a large text corpus, it encodes the local dependencies of words. The word order errors usually violated the syntactic rules locally and therefore the N-grams can be used in order to fix ill-formed sentences. This paper presents an approach for repairing word order errors in text by reordering words in a sentence and choosing the version that maximizes the number of trigram hits according to a language model. The novelty of this method concerns the use of an efficient confusion matrix technique for reordering the words. The comparative advantage of this method is that works with a large set of words, and avoids the laborious and costly process of collecting …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Phonetic Search in Audio and video Recordings",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Irene_Gironacci/publication/320034397_Locale_an_Environment-Aware_Storytelling_Framework_Relying_on_Augmented_Reality/links/59f979e1aca272607e2f7f20/Locale-an-Environment-Aware-Storytelling-Framework-Relying-on-Augmented-Reality.pdf#page=12",
            "Abstract": "The major advantage of the new approach that makes it unbeatable compared to existing solutions is its ability to fully operate on any subject without any prior learning phase. Consequently it requires no overhead for customisation and/or installation and maintenance. More precisely, the system does not use any lexicon or database that will become outdated and need updating. Furthermore, it can cope with all kinds of words and terminology regardless of their frequency of use. The system has a very user-friendly interface with a comprehensive menu even for non-professionals. It can process all of the following formats: wav, wmv, wma, mp3, mpg, asf and avi.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new algorithm to design optimal Hidden Markov Models",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7075568/",
            "Abstract": "A new algorithm for the design of Hidden Markov Models (HMM) from observed symbol and bisymbol probabilities is presented. The algorithm provides a global optimum and makes use of linear vectorial models of sequences of probabilistic vectors estimated during an off-line learning process. Moreover, a method to enhance observed data so as to comply with the constraints of HMM strings is proposed. An optimal estimate of the number of states of the HMM for the given observed data is also provided.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Impact of the cocktail party effect on the confidence accuracy of emotional speech recogniser",
            "Publication year": 2006,
            "Publication url": "http://archive.ilsp.gr/en/contact/contactnumbers?view=publication&task=show&id=738",
            "Abstract": "This paper deals with the impact of a signal enhancement method on emotional speech recognition confidence scores, in the presence of noise. The emotional speech recognition confidence score reflects the reliability of correctness of the recogniser’s output. This is important since errors in the presence of noise are more frequent and tend to make applications, such as spoken dialogue systems, too cumbersome to use. By recognising impaired signals not only the word error rate decreases but also the word-based confidence scores decline. Therefore, the role of speech recognition in spoken dialogue systems weakens. The experimentation involves input signal corrupted by coloured noise and cocktail party noise with varying Signal-to-Noise Ratio. A non-linear spectral subtraction method (NSS) will be used in conjunction with the Continuous Speech Recognition system developed for the ERMIS project (IST …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectral Estimation for Speech Signals based on decimation and eigenanalysis",
            "Publication year": 2005,
            "Publication url": "http://archive.ilsp.gr/en/profile/research-departments/culturecreativeindustry?view=publication&task=show&id=612",
            "Abstract": "This paper details on the application of a Decimative Spectral estimation method to speech signals in order to perform spectral analysis and estimation of Formant/Bandwidth values. The method is based on Eigenanalysis and SVD (Singular Value Decomposition) and performs artificial decimation for increased accuracy while it exploits the full set of data samples. The underlying model decomposes a signal into complex damped sinusoids whose frequencies, amplitudes, phases and damping factors are estimated. Correct estimation of Formant/Bandwidth values depend on the model order, thus the requested number of poles. Additionally, some selection criteria are applied regarding finer tracking and estimation of speech formants and their relevant bandwidths.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using monolingual corpora for statistical machine translation: the METIS system",
            "Publication year": 2003,
            "Publication url": "https://www.aclweb.org/anthology/2003.eamt-1.7.pdf",
            "Abstract": "In this article the principles of the METIS Machine Translation system are presented. METIS employs an extensive tagged and lemmatised corpus of texts in the target language, coupled with bilingual lexica covering the desired pairs of source-target languages. To generate a high-quality translation, the METIS sys-tem is provided with statistical tools enabling it to extract linguistic knowledge from the annotated corpus of the target language. The advantage of this approach is that, although no grammars need to be provided explicitly, grammatical transla-tions are retrieved from the corpus by using pattern matching techniques.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new multi-resolution image compression system based on subband and binary coding",
            "Publication year": 2004,
            "Publication url": "http://archive.ilsp.gr/en/profile/research-departments/speechmediacontent?view=publication&task=show&id=697",
            "Abstract": "This paper presents a novel multi-resolution image compression scheme based on iterative subband and binary coding. The signal is split into a low frequency image and its high frequency complement. The first is compressed conventionally or by using adaptive sinusoidal models. The high frequency component is treated via a non-linear transformation that leads to a binary image and its complement that can be brought to lower resolution via filtering. The process is iterative and the number of iterations depends on the size of the image and the desired compression rate.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic recognition of emotionally coloured speech",
            "Publication year": 2007,
            "Publication url": "http://publications.waset.org/1891/automatic-recognition-of-emotionally-coloured-speech",
            "Abstract": "Emotion in speech is an issue that has been attracting the interest of the speech community for many years, both in the context of speech synthesis as well as in automatic speech recognition (ASR). In spite of the remarkable recent progress in Large Vocabulary Recognition (LVR), it is still far behind the ultimate goal of recognising free conversational speech uttered by any speaker in any environment. Current experimental tests prove that using state of the art large vocabulary recognition systems the error rate increases substantially when applied to spontaneous/emotional speech. This paper shows that recognition rate for emotionally coloured speech can be improved by using a language model based on increased representation of emotional utterances.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The IMUTUS interactive music tuition system",
            "Publication year": 2002,
            "Publication url": "https://asa.scitation.org/doi/abs/10.1121/1.4777872",
            "Abstract": "This presentation focuses on the IMUTUS project, which concerns the creation of an innovative method for training users on traditional musical instruments with no MIDI (Musical Instrument Digital Interface) output. The entities collaborating in IMUTUS are ILSP (coordinator), EXODUS, SYSTEMA, DSI, SMF, GRAME, and KTH. The IMUTUS effectiveness is enhanced via an advanced user interface incorporating multimedia techniques. Internet plays a pivotal role during training, the student receiving guidance over the net from a specially created teacher group. Interactiveness is emphasized via automatic‐scoring tools, which provide fast yet accurate feedback to the user, while virtual reality methods assist the student in perfecting his technique. IMUTUS incorporates specialized recognition technology for the transformation of acoustic signals and music scores to MIDI format and incorporation in the training process …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:ZHo1McVdvXMC",
            "Publisher": "Acoustical Society of America"
        },
        {
            "Title": "Making assistive reading tools user friendly: a new platform for Greek dyslexic students empowered by automatic speech recognition",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-012-1073-5",
            "Abstract": "This work presents our effort to incorporate a state of the art speech recognition engine into a new platform for assistive reading for improving reading ability of Greek dyslexic students. This platform was developed in the framework of the Agent-DYSL, IST project, and facilitates dyslexic children in learning to read fluently. Unlike previously presented approaches, the aim of the system is not only to enable access to the reading materials within an inclusive learning system but to promote the development of reading skills by adjusting and adapting in the light of feedback to the system. The idea is to improve speech recognition performance so that gradually increase the reading capabilities of the user, gradually diminish the assistance provided, till he is able to read as a non-dyslexic reader. The evaluation results show that both learners’ reading pace and learners’ reading accuracy were increased.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer US"
        },
        {
            "Title": "On the use of decimation for efficient spectral estimation",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.572.3536&rep=rep1&type=pdf",
            "Abstract": "This paper presents a new state-space method for spectral estimation that performs decimation by any factor and it is based on Singular Value Decomposition in order to estimate frequency, damping factor, amplitude and phase of complex damped sinusoids in the presence of noise. The new method, called DESE D, makes use of the full set of data and brings further apart the poles under consideration, while it imposes almost no constraints to the dimensions of the Hankel matrix, as decimation increases. It is compared against two previously proposed techniques for spectral estimation (along with derived decimative versions), that lie among the most promising methods in the field of spectroscopy, where accuracy of parameter estimation is of utmost importance. Moreover, it is compared against a state-of-the-art purely decimative method proposed in literature. Experiments performed on simulated NMR signals prove the new method to be more robust, especially for low signal to noise ratio.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance Evaluation of a Novel Technique for Word Order Errors Correction Applied to Non Native English Speakers’ Corpus",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-19437-5_33",
            "Abstract": "This work presents the evaluation results of a novel technique for word order errors correction, using non native English speakers’ corpus. This technique, which is language independent, repairs word order errors in sentences using the probabilities of most typical trigrams and bigrams extracted from a large text corpus such as the British National Corpus (BNC). A good indicator of whether a person really knows a language is the ability to use the appropriate words in a sentence in correct word order. The “scrambled” words in a sentence produce a meaningless sentence. Most languages have a fairly fixed word order. For non-native speakers and writers, word order errors are more frequent in English as a Second Language. These errors come from the student if he is translating (thinking in his/her native language and trying to translate it into English). For this reason, the experimentation task involves a test …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Perceptual Evaluation of a New Subband Low Bit Rate Speech Compression System based on Waveform Vector Quantization and SVD Postfiltering.",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.664.6956&rep=rep1&type=pdf",
            "Abstract": "This paper proposes a new low rate speech coding algorithm, based on a subband approach. At first, a frame of the incoming signal is fed to a low pass filter, thus yielding the low frequency (LF) part. By subtracting the latter from the incoming signal the high frequency (HF), non-smoothed part is obtained. The HF part is modeled using waveform vector quantisation (VQ), while the LF part is modeled using a spectral estimation method based on a Hankel matrix, its shift invariant property and SVD, called CSE. At the receiver side an adaptive postfiltering based on SVD is performed for the HF part, a simple resynthesis for the LF part, before the two components are added in order to produce the reconstructed signal. Progressive speech compression (variable degree of analysis/synthesis at transmitter/receiver) is thus possible resulting in a variable bit rate scheme. The new method is compared to the CELP algorithm at 4800 bps and is proven of similar quality, in terms of intelligibility and segmental SNR. Moreover, perceptual evaluation tests of the new method were conducted for different bit rates up to 1200 bps and the majority of the evaluators indicated that the technique provides intelligible reconstruction.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A fast algorithm for words reordering based on language model",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11840930_98",
            "Abstract": "What appears to be given in all languages is that words can not be randomly ordered in sentences, but that they must be arranged in certain ways, both globally and locally. The “scrambled” words into a sentence cause a meaningless sentence. Although the use of manually collected grammatical rules can boost the performance of grammar checker in word order diagnosis, the repairing task is still very difficult. This work proposes a method for repairing word order errors in English sentences by reordering words in a sentence and choosing the version that maximizes the number of trigram hits according to a language model. The novelty of this method concerns the use of a permutations’ filtering approach in order to reduce the search space among the possible sentences with reordered words. The filtering method is based on bigrams’ probabilities. In this work the search space is further reduced using a …",
            "Abstract entirety": 0,
            "Author pub id": "gR1xCV8AAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A vocal user Interface Plug-in for jMRUI",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548488/",
            "Abstract": "This paper presents a review of the necessary technology in order to develop a Vocal User interface to be integrated into the jMRUI. jMRUI allows magnetic resonance (MR) spectroscopists to easily perform time-domain analysis of in vivo MR Data and might in the future be used during intraoperative MRI scanning. An operation room with an MRI scanner is a highly noisy environment which degrades speech recognition. These specific circumstances must be taken in consideration and are described in this paper along with the structure of the vocal interface.",
            "Abstract entirety": 1,
            "Author pub id": "gR1xCV8AAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        }
    ]
}]