[{
    "name": "Ιωάννης  Καραφυλλίδης ",
    "romanize name": "Ioannis  Karafyllidis ",
    "School-Department": "Ηλεκτρολόγων Μηχ. & Μηχ. Υπολογιστών ",
    "University": "duth",
    "Rank": "Καθηγητής",
    "Apella_id": 18658,
    "Scholar name": "Ioannis Karafyllidis",
    "Scholar id": "WbkfjB4AAAAJ",
    "Affiliation": "Professor, Democritus University of Thrace",
    "Citedby": 3748,
    "Interests": [
        "Quantum Computing",
        "Nanoelectronics",
        "Systems Biology"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=WbkfjB4AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Fpga implementation of a bioinspired model for real-time traffic signals control",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.217.7242&rep=rep1&type=pdf",
            "Abstract": "During the last decades, traffic congestion in urban networks is getting worse affecting many aspects of the residents lives to an increasing extent. Traffic lights play a decisive role in the aforementioned traffic networks of modern metropolises, and the existing conditions of the corresponding vehicular traffic flows. In order to develop an efficient system dedicated to the real-time traffic signals control for which the hardware implementation will be straightforward, Cellular Automata (CAs) were chosen as the simulation and implementation method. Despite its ease of implementation and simplicity, CAs is a powerful tool that can generate realistic traffic models. In this paper, a Cellular Automaton (CA) model was implemented on a FPGA to take full advantage of the inherent parallelism of CAs and provide real-time traffic signals control in accordance with vehicular traffic flow. The proposed hardware was optimized and the resulting single FPGA processor can be finally considered as basic component of an advanced electronic system able to provide real time information concerning the traffic conditions in the under study intersections and thus to efficiently handle-control the traffic signals in real conditions.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:ns9cj8rnVeAC",
            "Publisher": "The Steering Committee of The World Congress in Computer Science, Computer Engineering and Applied Computing (WorldComp)"
        },
        {
            "Title": "Del Sorbo, MR 88, 343 Deng, X. 88, 16 De Wilde, P. 88, 127 Di Garbo, A. 88, 216",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=7516610309652055971&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantum Walks on Quantum Cellular Automata Lattices: Towards a New Model for Quantum Computation",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-99813-8_29",
            "Abstract": "Many physical problems cannot be easily formulated as quantum circuits, which are a successful universal model for quantum computation. Because of this, new models that are closer to the structure of physical systems must be developed. Discrete and continuous quantum walks have been proven to be a universal quantum computation model, but building quantum computing systems based on their structure is not straightforward. Although classical cellular automata are models of universal classical computation, this is not the case for their quantum counterpart, which is limited by the no-coning theorem and the no-go lemma. Here we combine quantum walks, which reproduce unitary evolution in space with quantum cellular automata, which reproduce unitary evolution in time, to form a new model of quantum computation. Our results show that such a model is possible.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:olpn-zPbct0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Mechanics and resonance of the cyanobacterial circadian oscillator",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0303264712000500",
            "Abstract": "Recent experiments elucidated the structure and function of the cyanobacterial circadian oscillator, which is driven by sunlight intensity variation and therefore by Earth's rotation. It is known that cyanobacteria appeared about 3.5 billion years ago and that Earth's rotational speed is continuously decreasing because of tidal friction. What is the effect of the continuous slowdown of Earth's rotation on the operation of the cyanobacterial oscillator? To answer this question we derived the oscillator's equation of motion directly from experimental data, coupled it with Earth's rotation and computed its natural periods and its resonance curve. The results show that there are two resonance peaks of the “cyanobacterial oscillator-rotating Earth” system, indicating that cyanobacteria used more efficiently the solar energy during the geological period in which the day length varied from about 11 to 15 h and make more efficient use of …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:35N4QoGY0k4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Automated design architecture for 1-d cellular automata using quantum cellular automata",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6945867/",
            "Abstract": "Cellular automata (CAs) have been widely used to model and simulate physical systems and processes. CAs have also been successfully used as a VLSI architecture that proved to be very efficient at least in terms of silicon-area utilization and clock-speed maximization. Quantum cellular automata (QCAs) as one of the promising emerging technologies for nanoscale and quantum computing circuit implementation, provides very high scale integration, very high switching frequency and extremely low power characteristics. In this paper we present a new automated design architecture and a tool, namely DATICAQ (Design Automation Tool of 1-D CAs using QCAs), that builds a bridge between 1-D CAs as models of physical systems and processes and 1-D QCAs as nanoelectronic architecture. The QCA implementation of CAs not only drives the already developed CAs circuits to the nanoelectronics era but improves …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power estimation of 1-d cellular automata circuits",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5547052/",
            "Abstract": "During the last decades Cellular Automata (CAs) have been extensively used as powerful computational tool able to represent phenomena of arbitrary complexity and at the same time can be simulated exactly by digital computers, because of their intrinsic discreteness. Furthermore, due to their simple, regular, modular and cascadable structure with local interconnections CAs algorithms are ideally suited for hardware implementation. On the other hand, power dissipation is recognized as a critical parameter in modern VLSI design field. In this paper a power estimation model based on CAs is proposed. With the help of this model the power consumption of 1-d CAs rules logic circuits is investigated in details. More specifically, CMOS power consumption estimation measurements for the entireness of 1-d CAs rules as well as entropy variation measurements were conducted based on the proposed model. The …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A methodology for modeling ecological systems based on cellular automata",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.522.7759&rep=rep1&type=pdf",
            "Abstract": "Ecological systems are generally considered among the most complex ones, because they are characterized by a large number of diverse components, nonlinear interactions, scale multiplicity, and spatial heterogeneity. In this paper a methodology for modeling ecological systems using cellular automata (CAs) is presented. The proposed methodology establishes the ability to capture the essential features-characteristics of the ecological system under consideration, and translate them into a suitable form, in order to obtain an effective CA model. The CA models obtained are of crucial importance in ecological engineering, and they could be used as decision support systems in environmental emergency response. Further, a complete description of the details of this methodology is specified, in order to help other researchers reproduce published simulation experiments. Forest fire spreading and oil slick movement and spreading are considered as possible applications of the proposed methodology. The models obtained can serve as a basis for the development of algorithms to simulate environmental and biological systems based on real data. Moreover, Application Specific Integrated Circuits (ASICs) that would execute and speed up the corresponding algorithms could be designed with the help of VHSIC Hardware Description Language (VHDL).",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantum mechanical model for information transfer from DNA to protein",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0303264708000713",
            "Abstract": "A model for the information transfer from DNA to protein using quantum information and computation techniques is presented. DNA is modeled as the sender and proteins are modeled as the receiver of this information. On the DNA side, a 64-dimensional Hilbert space is used to describe the information stored in DNA triplets (codons). A Hamiltonian matrix is constructed for this space, using the 64 possible codons as base states. The eigenvalues of this matrix are not degenerate. The genetic code is degenerate and proteins comprise only 20 different amino acids. Since information is conserved, the information on the protein side is also described by a 64-dimensional Hilbert space, but the eigenvalues of the corresponding Hamiltonian matrix are degenerate. Each amino acid is described by a Hilbert subspace. This change in Hilbert space structure reflects the nature of the processes involved in information transfer …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Κβαντική Τηλεμεταφορά",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/224",
            "Abstract": "Κβαντική τηλεμεταφορά (quantum teleportation) είναι η μεταφορά της κατάστασης ενός qubit ή ενός κβαντικού καταχωρητή χωρίς την ύπαρξη ενός κβαντικού καναλιού επικοινωνίας. Χρησιμοποιείται κυρίως στην κβαντική επικοινωνία και στην κβαντική κρυπτογραφία. Στο κεφάλαιο αυτό θα περιγραφεί ποιοτικά η κβαντική τηλεμεταφορά και θα δοθεί η φυσική της ερμηνεία. Στη συνέχεια θα περιγραφεί μαθηματικά η κβαντική τηλεμεταφορά και θα δοθεί το κβαντικό της κύκλωμα. Θα δοθούν αναλυτικά παραδείγματα εφαρμογής της κβαντικής τηλεμεταφοράς.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of Neural Networks Solar Radiation Prediction for Hybrid Renewable Energy Systems",
            "Publication year": 2014,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10008",
            "Abstract": "In this paper a Recurrent Neural Network (RNN) for solar radiation prediction is proposed for the enhancement of the Power Management Strategies (PMSs) of Hybrid Renewable Energy Systems (HYRES). The presented RNN can offer both daily and hourly prediction concerning solar irradiation forecasting. As a result, the proposed model can be used to predict the Photovoltaic Systems output of the HYRES and provide valuable feedback for PMSs of the understudy autonomous system. To do so a flexible network based design of the HYRES is used and, moreover, applied to a specific system located on Olvio, near Xanthi, Greece, as part of SYSTEMS SUNLIGHT S.A. facilities. As a result, the RNN after training with meteorological data of the aforementioned area is applied to the specific HYRES and successfully manages to enhance and optimize its PMS based on the provided solar radiation prediction.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:_B80troHkn4C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Design and simulation of a single-electron random-access memory array",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1031973/",
            "Abstract": "A single-electron random-access memory array is designed and its operation is analyzed using Monte Carlo simulation. This memory array utilizes a basic single-electron memory cell that has been recently fabricated. Bits of information are represented by the presence or absence of a single or a small number of electrons at conducting islands. Simulation shows that selective read and write operations can be performed in this memory array.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Plasma modified silicon nitride resistive switching memories",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9073660/",
            "Abstract": "In this article we present RRAM single-cells based on MIS devices utilizing LPCVD silicon nitride thin layer as resistive switching material. The thin SiN layer was modified by plasma in order to improve the switching characteristics and the overall performance of the memory cell. Extensive material and electronic device characterization are presented.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High Specific Energy Lithium Cells for Space Exploration",
            "Publication year": 2017,
            "Publication url": "https://www.e3s-conferences.org/articles/e3sconf/abs/2017/04/e3sconf_espc2017_08003/e3sconf_espc2017_08003.html",
            "Abstract": "The paper discusses development under an ESA TRP activity (Contract No. 4000109879/13/NL/LvH) with a target of high specific energy Lithium-ion cells, capable of operating under low temperature conditions, i.e. −40 °C. Such cells may be encountered in future exploration missions, which do not consider the use of Radioisotope Heater Units. During the activity, ≥1 Ah silicon-based high energy density prototype cells, following components characterization and optimization, were designed, developed, manufactured and tested under room and subzero temperature conditions down to −40 °C.The developed and tested prototype cells exhibited energy density of around 208 Wh/Kg at room temperature under C/10 charge-discharge rate within voltage range of 2.8 V and 4.1 V. Moreover, the prototype cells could retain and deliver more than 75% of their capacity at room temperature upon cycling at −40 °C …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Quantum game simulator, using the circuit model of quantum computation",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S001046550900160X",
            "Abstract": "We present a general two-player quantum game simulator that can simulate any two-player quantum game described by a 2× 2 payoff matrix (two strategy games). The user can determine the payoff matrices for both players, their strategies and the amount of entanglement between their initial strategies. The outputs of the simulator are the expected payoffs of each player as a function of the other player's strategy parameters and the amount of entanglement. The simulator also produces contour plots that divide the strategy spaces of the game in regions in which players can get larger payoffs if they choose to use a quantum strategy against any classical one. We also apply the simulator to two well-known quantum games, the Battle of Sexes and the Chicken game. Program summary Program title: Quantum Game Simulator (QGS) Catalogue identifier: AEED_v1_0 Program summary URL: http://cpc. cs. qub. ac. uk …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:ZHo1McVdvXMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Design and simulation of modular 2n to 1 quantum‐dot cellular automata (QCA) multiplexers",
            "Publication year": 2010,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cta.595",
            "Abstract": "In this paper a novel design of a quantum‐dot cellular automata (QCA) 2 to 1 multiplexer is presented. The QCA circuit is simulated and its operation is analyzed. A modular design and simulation methodology is developed, which can be used to design 2n to 1 QCA multiplexers using the 2 to 1 QCA multiplexer as a building block. The design methodology is formulated in order to increase the circuit stability. Copyright © 2009 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Understanding the role of defects in silicon nitride-based resistive switching memories through oxygen doping",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9403953/",
            "Abstract": "Resistive memories are promising candidates for replacing current nonvolatile memories and realize storage class memories. Moreover, they have memristive properties, with many discrete resistance levels and implement artificial synapses. The last years researchers have demonstrated RRAM chips used as accelerators in computing, following the new in-memory and neuromorphic computational approaches. Many different metal oxides have been used as resistance switching materials in MIM structures. Understanding of the switching mechanism is very critical for the modeling and the use of memristors in different applications. Here, we demonstrate the bipolar resistance switching of silicon nitride thin films using heavily doped Si and Cu as bottom and top-electrodes respectively. Next, we dope nitride with oxygen in order to introduce and modify the intrinsic nitride defects. Analysis of the current-voltage …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:JQOojiI6XY0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A fault-tolerant message passing algorithm and its hardware implementation",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S096599780400184X",
            "Abstract": "A message passing algorithm for processor arrays that can tolerate any number of faulty blocks, which form any shape, is presented. Each message is delivered to its destination, provided that the destination processor is not surrounded by faults. In this case the message is returned to its source processor. Only local knowledge of faults is demanded. The hardware implementation of this algorithm leads to a message passing coprocessor which is allocated at each processor of the array. No need for high silicon overhead is required for the implementation of the message passing coprocessor. This coprocessor executes only the fault tolerant message passing algorithm presented here. The usage of the proposed coprocessor improves the general processing efficiency, as well as, the performance reliability under faulty conditions.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:vV6vV6tmYwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Conductance Parametric Analysis of Graphene Nanoribbons With Magnetic Contacts",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9239987/",
            "Abstract": "Graphene nanoribbons with non-magnetic contacts have been extensively studied and are widely used in graphene based devices. In these devices, the nanoribbon conductance is modulated and controlled by applying potentials through top and back gates. Graphene nanoribbons with magnetic contacts have been studied and used as spin valves, mostly at liquid-helium temperatures. The operation of graphene nanoribbons with magnetic contacts at room temperature, where nanoelectronic devices and circuits are expected to operate, has received little attention. Here we study and simulate the operation of graphene nanoribbons with magnetic contacts using tight-binding Hamiltonians and the non-equilibrium Green's functions(NEGF) method, which we extend to incorporate the effect of magnetic contacts. Our results are in very good agreement with experimental measurements of the conductance of graphene …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Qantum-dot cellular automata RAM design using crossbar architecture",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8604370/",
            "Abstract": "In this paper, a new approach of RAM circuits, using Quantum-dot Cellular Automata (QCA), based on programmable crossbar architecture, is presented. In addition, a methodology for 2 n  bits RAMs is presented. Using the aforementioned methodology any designer can design a RAM regardless of its size. The proposed designs utilize the benefits of QCA programmable crossbar architecture. Namely, the RAM circuit is characterized by regularity and the ability of customization. The features that the proposed RAM design methodology has, allow the designers to use the available circuit area efficiently.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:Mojj43d5GZwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ο Κβαντιός Αλγόριθμος του Shor",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/223",
            "Abstract": "Ο κβαντικός αλγόριθμος του Shor μπορεί να αναλύσει γρήγορα και αποτελεσματικά έναν αριθμό σε γινόμενο πρώτων παραγόντων. Μπορεί να χρησιμοποιηθεί σε πολλές περιπτώσεις και κυρίως στην κβαντική κρυπτανάλυση. Μπορεί δηλαδή να χρησιμοποιηθεί για την εύρεση της περιόδου περιοδικών συναρτήσεων και στη συνέχεια στην ανάλυση ενός αριθμού σε γινόμενο πρώτων παραγόντων. Θεωρείται ότι μπορεί να προσβάλει αποτελεσματικά το κρυπτογραφικό σύστημα RSA. Στο κεφάλαιο αυτό θα περιγραφεί σύντομα το κρυπτογραφικό σύστημα RSA. Θα περιγραφεί ποιοτικά ο αλγόριθμος του Shor και θα δοθούν τα βήματά του. Στη συνέχεια θα περιγραφεί μαθηματικά ο κβαντικός αλγόριθμος. Θα δοθεί αναλυτικό παράδειγμα εφαρμογής του κβαντικού αλγορίθμου του Shor. Επίσης, με χρήση των φάσεων των κβαντικών καταχωρητών θα ερμηνευθεί ο τρόπος δράσης του αλγορίθμου αυτού.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling-A TCAD tool for the simulation of the CVD process based on cellular automata",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=10305896426653012760&hl=en&oi=scholarr",
            "Abstract": "The development of next-generation VLSI circuits with deep submicron technologies demands fundamental understanding of the wafer surface reaction kinetics. Technology computer-aided design (TCAD) is essential for modeling real fabrication processes accurately, and allowing predictive simulation during technology research and development. This paper describes a two-dimensional Chemical Vapor Deposition (CVD) process TCAD system based on cellular automata (CAs). The proposed TCAD system can handle the complicated boundary and initial conditions imposed by defects and provide SEM-like cross sectional views. The simulated profiles obtained are in very good agreement with experimental and simulation results found in the literature. Furthermore, au ser-friendly interface that enables easy and effective interaction between the user and the TCAD system has been developed.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:isC4tDSrTZIC",
            "Publisher": "Les Ulis: EDP Sciences, 1998-2006."
        },
        {
            "Title": "An algorithm for the study of DNA sequence evolution based on the genetic code",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0303264704000322",
            "Abstract": "Recent studies of the quantum-mechanical processes in the DNA molecule have seriously challenged the principle that mutations occur randomly. The proton tunneling mechanism causes tautomeric transitions in base pairs resulting in mutations during DNA replication. The meticulous study of the quantum-mechanical phenomena in DNA may reveal that the process of mutagenesis is not completely random. We are still far away from a complete quantum-mechanical model of DNA sequence mutagenesis because of the complexity of the processes and the complex three-dimensional structure of the molecule. In this paper we have developed a quantum-mechanical description of DNA evolution and, following its outline, we have constructed a classical model for DNA evolution assuming that some aspects of the quantum-mechanical processes have influenced the determination of the genetic code. Conversely, our …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:-f6ydRqryjwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Memristor Crossbar Design Framework for Quantum Computing",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9401581/",
            "Abstract": "Over the last years there has been significant progress in the development of quantum computers. It has been demonstrated that they can accelerate the solution of various problems exponentially compared to today’s classical computers, harnessing the properties of superposition and entanglement, two resources that have no classical analog. Since quantum computer platforms that are currently available comprise only a few tenths of qubits, as well as the access to a fabricated quantum computer is time limited for the majority of researchers, the use of quantum simulators is essential in developing and testing new quantum algorithms. Taking inspiration from previous work on developing a novel quantum simulator based on memristor crossbar circuits, in this work, a framework that automates the circuit design of emulated quantum gates is presented. The proposed design framework deals with the generation and …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quantum walks on graphene nanoribbons using quantum gates as coins",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877750315000861",
            "Abstract": "Both discrete and continuous quantum walks on graphs are universal for quantum computation. We define and use discrete quantum walks on the graphene honeycomb lattice to investigate the possibility of using graphene armchair and zigzag nanoribbons to implement quantum gates. The probability distribution of the quantum walker location represents the particle (electron) density distribution on the graphene lattice. We use a universal set of quantum gates as coins that drive the quantum walk and show that different quantum gates result in distinguishable particle distributions on the graphene lattice.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:SP6oXDckpogC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Model for Dielectric Breakdown in Integrated Circuits Using Cellular Automata",
            "Publication year": 2002,
            "Publication url": "http://iris.elf.stuba.sk/JEEEC/data/pdf/07-08_102-06.pdf",
            "Abstract": "A predictive model for the simulation of dielectric breakdown in integrated circuits, due to the effect of encapsulated contamination in the dielectric, is developed. The encapsulated contamination reduces locally the permittivity of the dielectric, resulting in an increase of the local electric field gradient. This increased field may accelerate the electrons sufficiently to produce impact ionization. The dielectric breakdown is modelled using Cellular Automata.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cellular automaton model for the study of DNA sequence evolution",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010482503000179",
            "Abstract": "Cellular automata are introduced as a model for DNA structure, function and evolution. DNA is modeled as a one-dimensional cellular automaton with four states per cell. These states are the four DNA bases A, C, T and G. The four states are represented by numbers of the quaternary number system. Linear evolution rules, represented by square matrices, are considered. Based on this model a simulator of DNA evolution is developed and simulation results are presented. This simulator has a user-friendly input interface and can be used for the study of DNA evolution.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Simulation of dye-sensitized solar cells based on a population dynamics model",
            "Publication year": 2012,
            "Publication url": "https://www.ingentaconnect.com/content/ben/cnano/2012/00000008/00000002/art00021",
            "Abstract": "Dye-sensitized solar cells are electrochemical devices with very interesting properties that provide an alternative to the conventional semiconductor solar cell technology. However, the details of the charge transport mechanisms, which include both electronic and ionic transport, are not yet fully understood. In this paper, we present a novel approach to dye-sensitized solar cell modeling and simulation which is based on population dynamics models that have recently been extensively used to model reactions between biological molecules. It is shown that the proposed model can be used to simulate the operation of dye-sensitized solar cells and produces I-V characteristics that are in qualitative agreement with the experimental ones. Furthermore, the model presented here can be used to optimize the characteristics and the design of dye-sensitized solar cells.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:vRqMK49ujn8C",
            "Publisher": "Bentham Science Publishers"
        },
        {
            "Title": "A cellular automaton model for the study of DNA sequence evolution.",
            "Publication year": 2003,
            "Publication url": "https://europepmc.org/article/med/12860467",
            "Abstract": "Cellular automata are introduced as a model for DNA structure, function and evolution. DNA is modeled as a one-dimensional cellular automaton with four states per cell. These states are the four DNA bases A, C, T and G. The four states are represented by numbers of the quaternary number system. Linear evolution rules, represented by square matrices, are considered. Based on this model a simulator of DNA evolution is developed and simulation results are presented. This simulator has a user-friendly input interface and can be used for the study of DNA evolution.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:PR6Y55bgFSsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and simulation of a nanoelectronic single-electron control—not gate",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269205001977",
            "Abstract": "A nanoelectronic single-electron Control–Not gate is presented in this paper. Bits of information are represented by the presence or absence of single electrons at conducting islands. The logic operation of the gate is verified using simulation, whereas the stability of its operation is analyzed using Monte-Carlo method.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Ο Προσομοιωτής Κβαντικού Υπολογιστή QSC",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/225",
            "Abstract": "Για να εξασφαλιστεί η μέγιστη δυνατή διαδραστικότητα στους χρήστες του προτεινόμενου Ηλεκτρονικού Συγγράμματος θα διατεθεί δωρεάν μέσω του kalipos.gr, ή με οποιονδήποτε άλλον τρόπο υποδειχθεί, ένας προσομοιωτής Κβαντικού Υπολογιστή (Quantum Computer Simulator, QCS) που έχει αναπτυχθεί από τον Κύριο Συγγραφέα. Με τον προσομοιωτή αυτόν, οι χρήστες θα μπορούν να επαναλάβουν όλους του κβαντικούς υπολογισμούς και κβαντικούς αλγορίθμους του Ηλεκτρονικού Συγγράμματος καθώς και να αναπτύξουν δικούς τους κβαντικούς υπολογισμούς και κβαντικούς αλγορίθμους. Στο κεφάλαιο αυτό θα δοθεί το εγχειρίδιο χρήσης (manual) του προσομοιωτή QCS και θα περιγραφεί η λειτουργία του. Θα δοθούν παραδείγματα χρήσης του προσομοιωτή QCS σε κβαντικούς υπολογισμούς και κβαντικούς αλγορίθμους.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Jung, IH 93, 240",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=11878569592566865745&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An automatic hybrid three-dimensional spatiotemporal model for earthquake activity by the dissociation of seismic data",
            "Publication year": 2010,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2010EGUGA..1210891S/abstract",
            "Abstract": "Physical processes in the earth's lithosphere compose a nonlinear complex system. Earthquake generation is part of this process. Till now, several computational geophysical models have been proposed in order to tackle complex problems associated with proper interpretation of the available seismicity information and the understanding of triggering mechanisms. In this study, an automatic, hybrid, 3-d cellular automaton model evolved both in space and time is proposed for the modelling of earthquake activity. The proposed model is further calibrated with the usage of reverse engineering in its attempt to close the loop from data collection to initial hypothesis model formation and revision. More specifically, the CA rules and the rest of the CA parameters are derived by the dissociation of real seismic data of the region under consideration as it was spatiotemporally evolved. As a result, our model not only …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of neural networks solar radiation prediction for hybrid renewable energy systems",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11071-4_13",
            "Abstract": "In this paper a Recurrent Neural Network (RNN) for solar radiation prediction is proposed for the enhancement of the Power Management Strategies (PMSs) of Hybrid Renewable Energy Systems (HYRES). The presented RNN can offer both daily and hourly prediction concerning solar irradiation forecasting. As a result, the proposed model can be used to predict the Photovoltaic Systems output of the HYRES and provide valuable feedback for PMSs of the understudy autonomous system. To do so a flexible network based design of the HYRES is used and, moreover, applied to a specific system located on Olvio, near Xanthi, Greece, as part of SYSTEMS SUNLIGHT S.A. facilities. As a result, the RNN after training with meteorological data of the aforementioned area is applied to the specific HYRES and successfully manages to enhance and optimize its PMS based on the provided solar radiation prediction.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Modeling the Effect of Tissue Displacement during Avascular Tumor Growth on Tumor Progression",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=8640265816403152052&hl=en&oi=scholarr",
            "Abstract": "We have developed a model for tissue displacement caused by early tumor growth (ie before the onset of angiogenesis) using cellular automata and solving diffusion equations on the cellular automaton lattice in order to compute the distribution of oxygen and glucose into the tumor. Tumor growth causes mechanical forces that displace the already existing vessels away from it, thus affecting the distribution of oxygen and glucose which in turn influence tumor growth. We simulated this growth process and we found that tissue displacement may affect tumor progression rate. We also found that the relative distance of the tumor initiation area from neighboring vessels influences its growth. The model and the simulation software we developed can be used to understand the dynamics of early tumor growth and to explore various hypotheses of tumor growth relevant to drug delivery in chemotherapy. Importantly, our approach highlights that vessel displacement should not be neglected in tumor growth models.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Early approach of qubit state representation with memristors",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8576702/",
            "Abstract": "In this paper we explore further the potential coupling of quantum computing with memristor technology. Taking the lead from co-authors' previous work, we are examining a number of memristor models and configurations corresponding to real memristor devices, aiming to the possible improvement of quantum bit (qubit) state representation with appropriate memristor states. Simulations results of the aforementioned models and configurations present in a qualitative and quantitative way the feasibility of this study in an efficient manner.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:WA5NYHcadZ8C",
            "Publisher": "VDE"
        },
        {
            "Title": "A single-electron half-adder",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269201001409",
            "Abstract": "A single-electron half-adder is presented in this paper. Bits of information are represented by the presence or absence of single electrons at conducting islands. The logic operation of the half-adder is verified using simulation, whereas the stability of its operation is analysed using the Monte Carlo method.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Nanoelectronic graphene devices",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8190069/",
            "Abstract": "Graphene is a carbon allotrope in which the atoms are arranged in a two-dimensional honeycomb lattice, which comprises two hexagonal sublattices. The existence of these two sublattices gives rise to the electron pseudospin and, along with the overlapping p z  orbitals, to the absence of back-scattering, which give to graphene high-quality transport properties. Graphene is a gapless material and currents in graphene nanoribbons cannot be effectively switched off. This is the most important obstacle for the use of graphene in the fabrication of integrated logic circuits. Recently, theoretical and experimental studies have shown that the conductance on graphene nanoribbons can be controlled in back and top gated graphene devices. Here we use tight-binding Hamiltonians and Non-equilibrium Green's Functions to design and simulate the operation of nanoelectronic graphene devices. We simulate the operation of …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Κβαντική Διερεύνηση-Κβαντικός Αλγόριθμος του Crover",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/221",
            "Abstract": "Στο κεφάλαιο αυτό θα περιγραφεί η έρευνα με την χρήση Κβαντικού Υπολογιστή σε αδόμητες βάσεις δεδομένων (quantum search). Ο κβαντικός αλγόριθμος που χρησιμοποιείται για την έρευνα αυτή είναι ο κβαντικός αλγόριθμος του Grover.  Θα γίνει πρώτα μία ποιοτική περιγραφή του κβαντικού αλγορίθμου και θα δοθούν αναλυτικά τα βήματά του. Στη συνέχεια ο κβαντικός αλγόριθμος του Grover θα περιγραφεί μαθηματικά και θα δοθεί το αντίστοιχο κβαντικό κύκλωμα. Θα δοθούν δύο ερμηνείες αυτού του κβαντικού αλγορίθμου. Η πρώτη θα είναι γεωμετρική και η δεύτερη θα ερμηνεύσει την κβαντική αναζήτηση  ως συνεχή «ενίσχυση» του πλάτους πιθανότητας. Τέλος, θα δοθεί ένα αναλυτικό παράδειγμα εφαρμογής του αλγορίθμου.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:eJXPG6dFmWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Versatile Filamentary Resistive Switching Model",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2008.07409",
            "Abstract": "Memristors as emergent nano-electronic devices have been successfully fabricated and used in non-conventional and neuromorphic computing systems in the last years. Several behavioral or physical based models have been developed to explain their operation and to optimize their fabrication parameters. All existing memristor models are trade-offs between accuracy, universality and realism, but, to the best of our knowledge, none of them is purely characterized as quantum mechanical, despite the fact that quantum mechanical processes are a major part of the memristor operation. In this paper, we employ quantum mechanical methods to develop a complete and accurate filamentary model for the resistance variation during memristor's operating cycle. More specifically, we apply quantum walks to model and compute the motion of atoms forming the filament, tight-binding Hamiltonians to capture the filament structure and the Non-Equilibrium Green's Function (NEGF) method to compute the conductance of the device. Furthermore, we proceeded with the parallelization of the overall model through Graphical Processing Units (GPUs) to accelerate our computations and enhance the model's performance adequately. Our simulation results successfully reproduce the resistive switching characteristics of memristors devices, match with existing fabricated devices experimental data, prove the efficacy and robustness of the proposed model in terms of multi-parameterization, and provide a new and useful insight into its operation.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effect of lattice defects on the transport properties of graphene nanoribbon",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9073648/",
            "Abstract": "Graphene nanoribbons are the most emerging graphene structures for electronic applications. Here, we present our calculation results on the impact of lattice defects on the transport properties of these structures. Preliminary results indicate that the maximum conductance is reduced significantly while the conductance quantization is lost even for a small number of defects.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Simulation of the dynamics of bacterial quorum sensing",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7008560/",
            "Abstract": "Quorum sensing (QS) is a signaling mechanism that pathogenic bacteria use to communicate and synchronize the production of exofactors to attack their hosts. Understanding and controlling QS is an important step towards a possible solution to the growing problem of antibiotic resistance. QS is a cooperative effort of a bacterial population in which some of the bacteria do not participate. This phenomenon is usually studied using game theory and the non-participating bacteria are modeled as cheaters that exploit the production of common goods (exofactors) by other bacteria. Here, we take a different approach to study the QS dynamics of a growing bacterial population. We model the bacterial population as a growing graph and use spectral graph theory to compute the evolution of its synchronizability. We also treat each bacterium as a source of signaling molecules and use the diffusion equation to compute the …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Arabidopsis mutant cev1 links cell wall signaling to jasmonate and ethylene responses.[Erratum: Aug 2002, v. 14 (8), p. 1981.]",
            "Publication year": 2002,
            "Publication url": "https://pubag.nal.usda.gov/catalog/672639",
            "Abstract": "Biotic and abiotic stresses stimulate the synthesis of jasmonates and ethylene, which, in turn, induce the expression of genes involved in stress response and enhance defense responses. The cev1 mutant has constitutive expression of stress response genes and has enhanced resistance to fungal pathogens. Here, we show that cev1 plants have increased production of jasmonate and ethylene and that its phenotype is suppressed by mutations that interrupt jasmonate and ethylene signaling. Genetic mapping, complementation analysis, and sequence analysis revealed that CEV1 is the cellulose synthase CeSA3. CEV1 was expressed predominantly in root tissues, and cev1 roots contained less cellulose than wild-type roots. Significantly, the cev1 mutant phenotype could be reproduced by treating wild-type plants with cellulose biosynthesis inhibitors, and the cellulose synthase mutant rsw1 also had constitutive expression of VSP. We propose that the cell wall can signal stress responses in plants.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simulation of entanglement generation and variation in quantum computation",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S002199910400172X",
            "Abstract": "Entanglement generation and variation in quantum computation is studied using a quantum computer simulator. The simulator is described and its block diagram is presented. The use of this simulator allows the study of entanglement manipulation in quantum computations that comprise more than two qubits and a variety of quantum gates such as Hadamard, Controlled-Not, Controlled-controlled-Not, Controlled-phase and Fredkin gates. Simulations of entanglement variation in four-qubit and six-qubit quantum Fourier transforms with entangled initial states is also studied.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:j3f4tGmQtD8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Quantum Mechanical Model for Filament Formation in Metal-Insulator-Metal Memristors",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9316152/",
            "Abstract": "Metal-Insulator-Metal type memristors as emergent nano-electronic devices have been successfully fabricated and used in non-conventional and neuromorphic computing systems in the last years. Several behavioral or physical based models have been developed to explain their operation and to optimize their fabrication parameters. Among them, the resistance switching of the insulating layer due to the formation of conductive filaments is the most well respected and experimentally proven. All  existing  memristor models are trade-offs between accuracy, universality and realism, but, to the best of our knowledge, none of them is purely characterized as quantum mechanical, despite the fact that quantum mechanical processes are a major part of the memristor operation. In this paper, we employ quantum mechanical methods to develop a complete and accurate filamentary model for the resistance variation during …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and simulation of modular quantum-dot cellular automata multiplexers for memory accessing",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218126610006104",
            "Abstract": "Multiplexers are extremely important parts of signal control systems. Some critical circuits of computing systems, like memories, use large multiplexers in order to present the value of a specific memory cell to their output. Several quantum-dot cellular automata (QCA) circuits have been designed and the need for a QCA memory access system becomes prominent. A modular 2n to 1 QCA multiplexer covering small area could reduce the size of such circuits and conclusively could increase circuit integration. In this paper we present a novel design of a small size, modular quantum-dot cellular automata (QCA) 2n to 1 multiplexer that can be used for memory addressing. The design objective is to develop a modular design methodology which can be used to implement 2n to 1 multiplexers using building blocks. For the QCA implementation a careful consideration is taken into account concerning the design in order to …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:maZDTaKrznsC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Quantum Game Simulator, Using the Circuit Model of Quantum",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5298376/",
            "Abstract": "We present a general two-player quantum game simulator that can simulate any two-player quantum game described by a 2times2 payoff matrix (two strategy games).The user can determine the payoff matrices for both players, their strategies and the amount of entanglement between their initial strategies. The outputs of the simulator are the expected payoffs of each player as a function of the other player's strategy parameters and the amount of entanglement. The simulator also produces contour plots that divide the strategy spaces of the game in regions in which players can get larger payoffs if they choose to use a quantum strategy against any classical one. We also apply the simulator to two well known quantum games, the Battle of Sexes and the Chicken game.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Study of the effect of non-planarity and defects on the geometrical accuracy of semiconductor surface structures using a CA_TCAD system",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510700005912",
            "Abstract": "As the integrated circuits (ICs) are pushed deeper into the submicrometer region, the presence of non-planarity and defects are becoming major yield detractors. In this work, we have studied these effects using a two-dimensional technology computer-aided design (TCAD) system based on cellular automata (CAs), which we have named CA_TCAD. It comprises a photolithography etching and a deposition simulator. The photolithography etching simulator has been tested, verified, and calibrated with a series of experiments with periodic and isolated lines on negative resist-coated Si wafers, using a stepper and a deep UV source at 248 nm. The deposition simulator can provide scanning electron microscopy (SEM)-like cross-sectional views, and the simulated profiles obtained are in very good agreement with experimental results found in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:RGFaLdJalmkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Future and emergent materials and devices for resistive switching",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8605885/",
            "Abstract": "During the last years, Resistive Random-Access Memories (ReRAMs or RRAMs) stimulated growing attention as promising non-volatile (NV) candidate memories to surpass existing storage devices while exhibiting excellent performance, reliability and low-energy operation and in the same time be utilized for unconventional computing paradigms such as neuromorphic and in-memory computation. In this paper, a brief review on the current state of the art for RRAMs is provided mainly focusing on the resistance switching mechanisms for various materials and corresponding devices. More specifically, we report on the switching mechanisms of RRAMs considering resistance bi-stability due to phase transformation, interfacial resistive switching, conductive filaments and thermochemical effects while the effect of environmental conditions like moisture and temperature is also analyzed. Finally, preliminary results …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:tkaPQYYpVKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and simulation of a single-electron full-adder",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/document/1214761/",
            "Abstract": "A single-electron full-adder is presented in which bits of information are represented by the presence or absence of single electrons at conducting islands. The logic operation of the full-adder is verified using simulation, and the stability of its operation is analysed using a Monte Carlo method.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:8k81kl-MbHgC",
            "Publisher": "IET"
        },
        {
            "Title": "A self-regulation mechanism of the resist development process in integrated circuit fabrication and its phase-space picture",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10820-005-0834-0.pdf",
            "Abstract": "Lithography is the most important process in integrated circuit fabrication. Lithographic profile defect simulator based on cellular automata revealed a self-regulation mechanism of the resist development process, which is expressed as a tendency of the etch-front to retain its parabolic shape. The phase-space picture of this mechanism is an attractor and it is certified that the resit-etchant system spends much time near the unperturbed state.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:70eg2SAEIzsC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A new 1P1R Image Sensor with In-Memory Computing Properties based on Silicon Nitride Devices",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9401586/",
            "Abstract": "Research progress in edge computing hardware, capable of demanding in-the-field processing tasks with simultaneous memory and low power properties, is leading the way towards a revolution in IoT hardware technology. Resistive random access memories (RRAM) are promising candidates for replacing current non-volatile memories and realize storage class memories, but also due to their memristive nature they are the perfect candidates for in-memory computing architectures. In this context, a CMOS compatible silicon nitride (SiN) device with memristive properties is presented accompanied by a data-fitted model extracted through analysis of measured resistance switching dynamics. Additionally, a new phototransistor-based image sensor architecture with integrated SiN memristor (1P1R) was presented. The in-memory computing capabilities of the 1P1R device were evaluated through SPICE-level circuit …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:uLbwQdceFCQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Universal cellular automaton cell using quantum cellular automata",
            "Publication year": 2009,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/el.2009.3693",
            "Abstract": "In recent years cellular automata (CAs) have been used widely to model and simulate physical systems and also to solve scientific problems. CAs have also been successfully used as a VLSI architecture and have proved to be very efficient at least in terms of silicon-area utilisation and clock-speed maximisation. Quantum cellullar automata (QCA) is one of the promising emerging technologies for nanoscale circuit implementation. QCA technology provides very high scale integration, very high switching frequency and very low power circuit characteristics. In the work reported here, a universal cellular automaton cell has been designed using QCA circuitry. The implementation of CAs using QCA nanoelectronic circuits not only drives the already developed systems based on CAs to the nanoelectronics era but improves their performance significantly.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:k_IJM867U9cC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Analysis of the jasmonic acid signalling pathway through the characterisation and isolation of novel Arabidopsis thaliana mutants",
            "Publication year": 2003,
            "Publication url": "https://ethos.bl.uk/OrderDetails.do?uin=uk.bl.ethos.273581",
            "Abstract": "British Library EThOS: Analysis of the jasmonic acid signalling pathway through the \ncharacterisation and isolation of novel Arabidopsis thaliana mutants New search | Advanced \nsearch | Search results Login / Register | About | Help | FAQ | Follow dividing line Use this URL \nto cite or link to this record in EThOS: https://ethos.bl.uk/OrderDetails.do?uin=uk.bl.ethos.273581 \nTitle: Analysis of the jasmonic acid signalling pathway through the characterisation and isolation \nof novel Arabidopsis thaliana mutants Author: Karafyllidis, Ioannis. ISNI: 0000 0001 3594 \n8318 Awarding Body: University of East Anglia Current Institution: University of East Anglia \nDate of Award: 2003 Availability of Full Text: Full text unavailable from EThOS. Please contact \nthe current institution’s library for further details. Abstract: No abstract available Supervisor: \nNot available Sponsor: Not available Qualification Name: Thesis (Ph.D.) Qualification Level: : .…",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiple quantum walkers on the line using hybrid coins: A possible tool for quantum search",
            "Publication year": 2014,
            "Publication url": "http://www.doiserbia.nb.rs/Article.aspx?id=0353-36701401103K",
            "Abstract": "In this paper discrete quantum walks with different coins used for odd and    even time steps are studied. These coins are called hybrid. The calculation    results are compared with the most frequently used coin, the Hadamard    transform. Furthermore, quantum walks on the line which involve two or more    quantum walkers with hybrid coins are studied. Quantum walks with entangled    walkers and hybrid coins are also studied. The results of these calculations    show that the proposed types of quantum walks can be used for quantum search,    because the walker can be directed towards preferred directions and can also    be confined in certain segments of the line.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantum computer simulator based on the circuit model of quantum computation",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1495725/",
            "Abstract": "A quantum computer simulator is presented. This simulator is an engineering work and no deep understanding of quantum mechanics is required from the user. The simulator is based on the circuit model of quantum computation in which quantum gates act on quantum registers which comprise a number of quantum bits (qubits). The inputs to the simulator are the initial states of the qubits that form a quantum register and the quantum gates applied at each computation step. The inputs are entered through a graphical user interface. The outputs of the simulator are the matrices that represent the quantum register state at each quantum computation step and graphical outputs that show the probability of measuring each one of the possible quantum register base states and the phase of each state at each computation step. The well-known Deutsch's algorithm and the quantum Fourier transform, which is the base of …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Programmable crossbar quantum-dot cellular automata circuits",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7600454/",
            "Abstract": "Quantum-dot fabrication and characterization is a well-established technology, which is used in photonics, quantum optics, and nanoelectronics. Four quantum-dots placed at the corners of a square form a unit cell, which can hold a bit of information and serve as a basis for quantum-dot cellular automata (QCA) nanoelectronic circuits. Although several basic QCA circuits have been designed, fabricated, and tested, proving that quantum-dots can form functional, fast and low-power nanoelectronic circuits, QCA nanoelectronics still remain at its infancy. One of the reasons for this is the lack of design automation tools, which will facilitate the systematic design of large QCA circuits that contemporary applications demand. Here we present novel, programmable QCA circuits, which are based on crossbar architecture. These circuits can be programmed to implement any Boolean function in analogy to CMOS field …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Periodicity in Quantum Cellular Automata",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33350-7_60",
            "Abstract": "Studies of quantum computer implementations suggest cellular quantum computer architectures. These architectures are based on the evolution of quantum cellular automata, which can possibly simulate both quantum and classical physical systems and processes. It is however known that except for the trivial case, unitary evolution of one-dimensional homogeneous quantum cellular automata with one quantum bit (qubit) per cell is not possible because of the no-go lemma. In this paper, we define quantum cellular automata that comprise two qubits per cell and study their evolution using a quantum computer simulator. The evolution is unitary and its linearity manifests itself as a periodic structure in the probability distribution patterns.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:a0OBvERweLwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Design and simulation of a nanoelectronic single electron 2–4 decoder using a novel simulator",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269207000249",
            "Abstract": "The design and simulation of a single-electron 2–4 decoder using a novel single electron circuit simulation tool named single-electron circuit simulator (SECS), is presented in this paper. In single electron circuits bits of information are represented by the presence or absence of single electrons at conducting or semiconducting islands. SECS utilizes the Monte Carlo method and the change in free-energy of the whole circuit determines the tunnel rates of possible tunnel events, providing thus a real time simulation of any arbitrary single-electron circuit. Furthermore, SECS is using the SPICE interface for schematic capture. SPICE models of single-electron circuit structures have been developed and, therefore, SECS can also be used for the design and simulation of hybrid microelectronic—single-electron circuits.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Τελεστές και Κβαντικές Πύλες",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/219",
            "Abstract": "Στο κεφάλαιο αυτό θα περιγραφούν όλες οι κβαντικές πύλες και η δράση τους σε qubits και κβαντικούς καταχωρητές. Θα περιγραφούν οι κβαντικές πύλες που δρουν σε ένα qubit: Χ, Ζ , Hadamard (H) και η κβαντική πύλη μετατόπισης φάσης. Θα περιγραφούν επίσης και οι πύλες που δρουν σε περισσότερα του ενός qubits: CNOT, CPh, CCNOT και Fredkin. Για όλες τις πύλες θα δοθούν τα σύμβολα, οι πίνακες που τις αναπαριστούν και θα περιγραφεί μαθηματικά η δράση τους σε qubits και κβαντικούς καταχωρητές. Θα περιγραφεί επίσης η αδυναμία αντιγραφής και διακλάδωσης στους κβαντικούς υπολογιστές και θα δοθεί η απόδειξη του θεωρήματος αδυναμίας διακλάδωσης (no cloning theorem).",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cellular automata on FPGA for real-time urban traffic signals control",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s11227-013-0952-5",
            "Abstract": "Among different traffic features, the urban traffic has received a lot of attention due to the ongoing traffic congestion as a result of increased car usage, population growth, and changes in population density. In urban networks, the vehicles flow differs when compared with highways flow because of the freeway’s low speed limit but mostly because of the traffic lights control. In this paper, a real-time hardware implemented bio-inspired model for traffic lights control is presented. The proposed model arrives from Cellular Automata (CAs), which have been proven very flexible and powerful computational traffic models, in that they are able to capture all previously mentioned basic phenomena that occur in traffic flows. The resulting CA model was hardware implemented on FPGA to take full advantage of the inherent parallelism of the CAs and to support the function of an advanced electronic system able to provide …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:g5m5HwL7SMYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Memristive quantum computing simulator",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8846603/",
            "Abstract": "One of the most promising and powerful candidates for future computing is the notion of universal quantum computer. A vital advance towards this direction is the development of quantum simulators and their possible implementation either as standalone quantum systems or as compatible software for classical computers with pros and cons. On the other hand, memristive computing has been proposed recently as a tentative unconventional computing scheme promoting the idea of information storage and processing in the same nanoelectronic device. In this paper we present a memristive quantum computing simulator by coupling quantum simulation principles with memristor aspects and enabling us to tackle the existing difficulties on qubit representation in conventional computing systems. For doing so, we utilize the memristances of identical memristors to represent in 3D the qubit state while its corresponding …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementation of Cellular Automata Using Graphene Nanoribbons with Magnetic Contacts",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-69480-7_17",
            "Abstract": "We propose a novel architecture for the implementation of Cellular Automata (CA). The novel architecture is based on graphene nanoribbons with magnetic contacts, which are used as building blocks. In this CA implementation, information processing is obtained through top-gates, back-gates and the angles and magnitudes of the polarizations of the magnetic contacts. We use tight-binding Hamiltonians and non-equilibrium Green’s functions to model and simulate the operation of the building blocks of the proposed CA implementation. Interconnections are local and CA cell states can be represented using top-gate and back-gate potentials, and the angles and magnitudes of the contact polarizations. We also describe the CA evolution rules. Our results showed that this CA implementation is capable of both digital and analog information processing. Furthermore, it can be effectively used for neuromorphic …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:dQ2og3OwTAUC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Design and simulation of a nanoelectronic single-electron universal Control–Control-Not gate",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269203003434",
            "Abstract": "A single-electron universal Control–Control-Not gate (CCN gate) is presented in this paper. Bits of information are represented by the presence or absence of single-electrons at conducting islands. The logic operation of the CCN gate as well as its XOR, AND, NAND and NOT operation is verified using simulation. The stability of its universal operation is analysed using a Monte Carlo method. Stability analysis using free energy diagrams and stability plots verify the correct and stable operation of the gate.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A single-electron three-input AND gate",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269201001513",
            "Abstract": "The design of a single-electron AND gate with three inputs is presented for the first time in this paper. The operation of this gate has been simulated using a well-known single-electron circuit simulator. Furthermore, the stability of its operation has been studied by constructing the free-energy history diagram, and by constructing and analyzing the corresponding three-dimensional stability plot, using Monte Carlo simulation. Simulation has verified the correct and stable operation of the gate.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:IWHjjKOFINEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Signal synchronization in large scale quantum-dot cellular automata circuits",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8604464/",
            "Abstract": "Quantum-dot fabrication is a well-established nanotechnology, which have many applications in many different scientific fields. By placing four quantum-dots on the corners of a square, a cell is formed, in which the digital information can be stored. This cell serves as the structural device of Quantum-dot Cellular Automata (QCA) circuits. After QCA presentation, several digital circuits and systems have been designed and proposed in the literature. However, one of the biggest problems QCA designers have to face to pave the successful design of functional and large scale QCA circuits is signal synchronization. In this paper, a novel approach of the aforementioned problem is presented. This approach is inspired by the well known computational problem of Firing Squad Synchronization (FSS). FSS problem has many similarities with large scale QCA circuits synchronization problem. In addition, FSS problem has …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reconstruction of DNA sequences using genetic algorithms and cellular automata: Towards mutation prediction?",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0303264707001815",
            "Abstract": "Change of DNA sequence that fuels evolution is, to a certain extent, a deterministic process because mutagenesis does not occur in an absolutely random manner. So far, it has not been possible to decipher the rules that govern DNA sequence evolution due to the extreme complexity of the entire process. In our attempt to approach this issue we focus solely on the mechanisms of mutagenesis and deliberately disregard the role of natural selection. Hence, in this analysis, evolution refers to the accumulation of genetic alterations that originate from mutations and are transmitted through generations without being subjected to natural selection. We have developed a software tool that allows modelling of a DNA sequence as a one-dimensional cellular automaton (CA) with four states per cell which correspond to the four DNA bases, i.e. A, C, T and G. The four states are represented by numbers of the quaternary …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Design of a dedicated parallel processor for the prediction of forest fire spreading using cellular automata and genetic algorithms",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0952197603001532",
            "Abstract": "Starting with a cellular automaton that predicts forest fire spreading, a genetic algorithm in used to design a dedicated parallel processor the results of which are as close as possible to the results of the cellular automaton. This processor can be used as a part of a decision support system.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:Y0pCki6q_DkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Quantum Computing",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/216",
            "Abstract": "Το ηλεκτρονικό αυτό βιβλίο έχει ως στόχο να δώσει στους αναγνώστες όλες τις απαραίτητες γνώσεις που αφορούν στην Κβαντική Υπολογιστική και στους Κβαντικούς Υπολογιστές χωρίς να απαιτούνται γνώσεις Κβαντικής Μηχανικής. Οι προπτυχιακοί και μεταπτυχιακοί φοιτητές θα βρουν στο βιβλίο αυτό έναν οδηγό που θα τους εισάγει και θα τους οδηγήσει βήμα-βήμα στο αντικείμενο αυτό. Όταν τελειώσουν το βιβλίο, θα μπορούν να κατανοήσουν ερευνητικές εργασίες με θέμα την Κβαντική Υπολογιστική. Η ύλη θα καλύπτει ένα εξαμηνιαίο μάθημα για προπτυχιακούς και μεταπτυχιακούς φοιτητές των Τμημάτων με αντικείμενο την Επιστήμη των Υπολογιστών, την Τεχνολογία των Υπολογιστών, την Πληροφορική ή τις Θετικές Επιστήμες. Θα δοθούν όλα τα απαραίτητα στοιχεία της Κβαντικής Μηχανικής και θα περιγραφεί η μονάδα της κβαντικής πληροφορίας, το qubit. Θα περιγραφούν οι κβαντικοί καταχωρητές, οι κβαντικές πύλες και το κυκλωματικό μοντέλο των κβαντικών υπολογισμών. Θα περιγραφούν αναλυτικά και διεξοδικά όλοι οι βασικοί κβαντικοί αλγόριθμοι. Στο βιβλίο θα υπάρχουν πολλά παραδείγματα κβαντικών υπολογισμών και εφαρμογής κβαντικών αλγορίθμων. Η μέγιστη διαδραστικότητα για αυτό το γνωστικό αντικείμενο θα εξασφαλιστεί ως εξής: Το βιβλίο θα συνοδεύεται από τον προσωμοιωτή κβαντικού υπολογιστή, QCS, ο οποίος έχει αναπτυχθεί από τον Κύριο Συγγραφέα [1]. Με τον προσομοιωτή αυτόν, οι χρήστες θα μπορούν να επαναλάβουν όλους τους κβαντικούς υπολογισμούς και αλγορίθμους του βιβλίου καθώς και να αναπτύξουν δικούς τους. Ο QCS περιλαμβάνει γραφικό interface και θα δοθεί με την μορφή πηγαίου κώδικα (Matlab). Με …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simulation of quantum key expansion using quantum cellular automata",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010465508003317",
            "Abstract": "Quantum cryptography has become reality nowadays and quantum key distribution systems are already in use. In classical cryptography, key expansion schemes are used to strengthen security. In this paper we present a quantum key expansion scheme, in which the key is expanded using a quantum cellular automaton. We also present the simulation of quantum key expansion using a quantum computer simulator. Using this scheme a 6-qubit key transmitted from the sender to the receiver, using one of the quantum key distribution protocols, can be expanded to a 24-qubit key without any further communication between them.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:O3NaXMp0MMsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Αποθήκευση της Κβαντικής Πληροφορίας",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/218",
            "Abstract": "Στο κεφάλαιο αυτό θα περιγραφεί η μονάδα της κβαντικής πληροφορίας που είναι το κβαντικό bit (quantum bit), το οποίο αναφέρεται για συντομία ως qubit. Θα περιγραφούν φυσικά συστήματα τα οποία μπορούν να χρησιμοποιηθούν ως qubits (π.χ. electron spins, quantum wells, photon polarization). Θα δοθεί η μαθηματική περιγραφή του qubit ως διανύσματος του χώρου Hilbert και η παράστασή του με χρήση της σφαίρας Bloch. Στη συνέχεια θα περιγραφεί ο τρόπος με τον οποίο πολλά qubits μπορούν να αποτελέσουν έναν κβαντικό καταχωρητή, όπου αποθηκεύεται η κβαντική πληροφορία. Θα δοθεί η μαθηματική περιγραφή των κβαντικών καταχωρητών ως διανυσμάτων στον χώρο Hilbert.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Graphene logic gates",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8383950/",
            "Abstract": "Graphene is a biocompatible material that can be incorporated safely into living tissue. This property makes graphene an ideal material for bioelectronics applications. The main obstacle for using graphene as a material for bioelectronic circuits is the lack of a bandgap, which results in noneffective current switching. Here, we use rectangular L-shaped graphene nanoribbons as a building block for graphene logic gates. Electrons are initially transported along the zigzag-edged nanoribbon and then the transport direction changes by 90°, resulting in transport along the armchair edge. Our computations showed that electron scattering because of this change in the direction causes the appearance of a pseudobandgap, which is large enough for logic operations. This pseudobandgap appears as a zero-conductance region for electron energies near the Fermi level. We propose an and, an or, and a not logic gate and …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling memory resources distribution on multicore processors using games on cellular automata lattices",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5470700/",
            "Abstract": "Nowadays, there is an increasingly recognized need for more computing power, which has led to multicore processors. However, this evolution is still restrained by the poor efficiency of memory chips. As a possible solution to the problem, this paper examines a model of re-distributing the memory resources assigned to the processor, especially the on-chip memory, in order to achieve higher performance. The proposed model uses the basic concepts of game theory applied to cellular automata lattices and the iterated spatial prisoner's dilemma game. A simulation was established in order to evaluate the performance of this model under different circumstances. Moreover, a corresponding FPGA logic circuit was designed as a part of an embedded, real-time co-circuit, aiming at memory resources fair distribution. The proposed FPGA implementation proved advantageous in terms of low-cost, high-speed …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A MODEL FOR DIELECTRIC BREAKDOWN IN INTEGRATED CIRCUITS USING CELLULAR AUTOMATA",
            "Publication year": 2002,
            "Publication url": "http://iris.elf.stuba.sk/cgi-bin/jeeec?act=abs&no=07-08_102&ttl=6",
            "Abstract": "A predictive model for the simulation of dielectric breakdown in integrated circuits, due to the effect of encapsulated contamination in the dielectric, is developed. The encapsulated contamination reduces locally the permittivity of the dielectric, resulting in an increase of the local electric field gradient. This increased field may accelerate the electrons sufficiently to produce impact ionization. The dielectric breakdown is modelled using Cellular Automata.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Arabidopsis Mutant cev1 Links Cell Wall Signaling to Jasmonate and Ethylene Responses",
            "Publication year": 2002,
            "Publication url": "https://academic.oup.com/plcell/article-abstract/14/7/1557/6009780",
            "Abstract": "Biotic and abiotic stresses stimulate the synthesis of jasmonates and ethylene, which, in turn, induce the expression of genes involved in stress response and enhance defense responses. The cev1 mutant has constitutive expression of stress response genes and has enhanced resistance to fungal pathogens. Here, we show that cev1 plants have increased production of jasmonate and ethylene and that its phenotype is suppressed by mutations that interrupt jasmonate and ethylene signaling. Genetic mapping, complementation analysis, and sequence analysis revealed that CEV1 is the cellulose synthase CeSA3. CEV1 was expressed predominantly in root tissues, and cev1 roots contained less cellulose than wild-type roots. Significantly, the cev1 mutant phenotype could be reproduced by treating wild-type plants with cellulose biosynthesis inhibitors, and the cellulose synthase mutant rsw1 also had …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:V3AGJWp-ZtQC",
            "Publisher": "American Society of Plant Biologists"
        },
        {
            "Title": "Multi-level resistance switching and random telegraph noise analysis of nitride based memristors",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2103.09931",
            "Abstract": "Resistance switching devices are of special importance because of their application in resistive memories (RRAM) which are promising candidates for replacing current nonvolatile memories and realize storage class memories. These devices exhibit usually memristive properties with many discrete resistance levels and implement artificial synapses. The last years, researchers have demonstrated memristive chips as accelerators in computing, following new in-memory and neuromorphic computational approaches. Many different metal oxides have been used as resistance switching materials in MIM or MIS structures. Understanding of the mechanism and the dynamics of resistance switching is very critical for the modeling and use of memristors in different applications. Here, we demonstrate the bipolar resistance switching of silicon nitride thin films using heavily doped Si and Cu as bottom and top-electrodes, respectively. Analysis of the current-voltage characteristics reveal that under space-charge limited conditions and appropriate current compliance setting, multi-level resistance operation can be achieved. Furthermore, a flexible tuning protocol for multi-level resistance switching was developed applying appropriate SET/RESET pulse sequences. Retention and random telegraph noise measurements performed at different resistance levels. The present results reveal the attractive properties of the examined devices.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-valued logic circuits on graphene quantum point contact devices",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3232195.3232214",
            "Abstract": "Graphene quantum point contacts (G-QPC) combine switching operations with quantized conductance, which can be modulated by top and back gates. Here we use the conductance quantization to design and simulate multi-valued logic (MVL) circuits and, more specifically an adder. The adder comprises two G-QPCs connected in parallel. We compute the conductance of the adder for various inputs and show that Graphene MVL circuits are feasible.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cellular automaton model for the effects of population movement and vaccination on epidemic propagation",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304380000002945",
            "Abstract": "A cellular automaton model for the effects of population movement and vaccination on epidemic propagation is presented. Each cellular automaton cell represents a part of the total population that may be found in one of three states: infected, immunized and susceptible. As parts of the population move randomly in the cellular automaton lattice, the disease spreads. We study the effect of two population movement parameters on the epidemic propagation: the distance of movement and the percentage of the population that moves. Furthermore, the model is extended to include the effect of the vaccination of some parts of the population on epidemic propagation. The model establishes the acceleration of the epidemic propagation because of the increment, of the percentage of the moving population, or of the maximum distance of population movement. On the contrary, the effect of population vaccination reduces the …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:u-x6o8ySG0sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Cellular Automata Model with Game Theory for Power Management of Hybrid Renewable Energy Smart Grids",
            "Publication year": 2014,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10013",
            "Abstract": "In recent years, control of smart grids that match electricity demand in different sites and forms with supply has been considered as one of the most difficult aspect of smart energy grids design. In this paper we present a Cellular Automata (CA) based approach combined with Game Theory for the enhancement of Power Management Strategies (PMSs) of multiple Hybrid Renewable Energy Systems (HYRES) that form a smart grid for the exchange of energy. More specifically, taking advantage of the local interactions of HYRES we coupled CA principles with Public Goods Game (PGG) for modeling. The presented CA model focuses on providing valuable feedback for PMSs of the understudy HYRES connected in a grid. In this manner, a flexible network based HYRES design is considered and applied to specific HYRESs located in Olvio, near Xanthi, Greece, part of SYSTEMS SUNLIGHT facilities. The proposed model can be applied to the understudy HYRESs grid management to enhance and optimize its PMS based on the provided energy prediction scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:eflP2zaiRacC",
            "Publisher": "Springer"
        },
        {
            "Title": "Visualization of the quantum Fourier transform using a quantum computer simulator",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/B:QINP.0000020076.36114.13",
            "Abstract": "The quantum Fourier transform (QFT) is a key subroutine of quantum algorithms for factoring and simulation and is the heart of the hidden-subgroup problem, the solution of which is expected to lead to the development of new quantum algorithms. The QFT acts on the Hilbert space and alters the quantum mechanical phases and probability amplitudes. Unlike its classical counterpart its schematic representation and visualization are very dif.cult. The aim of this work is to develop a schematic representation and visualization of the QFT by running it on a quantum computer simulator which has been constructed in the framework of this research. Base states, superpositions of base states and entangled states are transformed and the corresponding schematic representations are presented. The visualization of the QFT presented here and the quantum computer simulator developed for this purpose may become …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:YOwf2qJgpHMC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Enhancement of hybrid renewable energy systems control with neural networks applied to weather forecasting: the case of Olvio",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-015-2175-6",
            "Abstract": "In this paper, an intelligent forecasting model, a recurrent neural network (RNN) with nonlinear autoregressive architecture, for daily and hourly solar radiation and wind speed prediction is proposed for the enhancement of the power management strategies (PMSs) of hybrid renewable energy systems (HYRES). The presented model (RNN) is applicable to an autonomous HYRES, where its estimations can be used by a central control unit in order to create in real time the proper PMSs for the efficient subsystems’ utilization and overall process optimization. For this purpose, a flexible network-based design of the HYRES is used and, moreover, applied to a specific system located on Olvio, near Xanthi, Greece, as part of Systems Sunlight S.A. facilities. The simulation results indicated that RNN is capable of assimilating the given information and delivering some satisfactory future estimation achieving …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Regulating the quorum sensing signalling circuit to control bacterial virulence: in silico analysis",
            "Publication year": 2011,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-syb.2010.0018",
            "Abstract": "Pathogenic bacteria employ a communication mechanism, known as quorum sensing (QS), to obtain information about their cell density and to synchronise their behaviour. Most bacteria species use QS signalling circuits to optimise the secretion of virulence factors that damage their host. Recently, QS has been recognised as a target for antimicrobial drugs that can control bacterial infections. Here the QS process is modelled as a state transition graph with transitions depending on the diffusion and local concentration of the QS molecules (autoinducers). Based on this model a simulation tool has been developed to simulate the QS process in both open and confined spaces. Using this simulation tool a number of numerical experiments has been carried out with various strategies of QS circuit regulation. The results of these experiments showed that regulation of the QS signalling circuit can lead to significantly …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:bEWYMUwI8FkC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Quantum computers: Registers, gates and algorithms",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6222789/",
            "Abstract": "Quantum computing is a process that incorporates interacting physical systems that represent quantum bits and quantum gates. We present the quantum bit (qubit), the quantum register and the quantum gates. The qubit is described as a vector in a two-dimensional Hilbert space and the quantum register, which comprises a number of qubits, as a vector in a multidimensional Hilbert space. Quantum gates are Hilbert space operators that rotate the qubit or the quantum register vectors. Quantum computations are modeled and described using a quantum circuit model. We also present a quantum computer simulator based on the circuit model of quantum computation. In this model quantum computations and quantum algorithms are represented by circuits, which comprise quantum gates and quantum registers. The well-known Deutsch's algorithm is described and the corresponding quantum circuit is presented …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and simulation of graphene majority gate without back-gating",
            "Publication year": 2019,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2631-8695/ab390d/meta",
            "Abstract": "Graphene is a two-dimensional carbon allotrope with excellent biocompatibility allowing for safe integration in living tissue and is stable in harsh biological environments. Graphene has also very high electron mobilities and long carrier mean-free paths and is a very promising material for new nanoelectronic circuits. Here we present the design and simulation of a graphene Majority logic gate without back-gating, which can be fabricated on one side of the graphene sheet leaving the other free so that the gate can be brought into contact with biological tissue. Graphene majority gates can also operate as AND or OR gates giving rise to new carbon-based nanoelectronic devices for biomedical circuits.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:PELIpwtuRlgC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Microtubules as mechanical force sensors",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0303264706000943",
            "Abstract": "Microtubules are polymers of tubulin subunits (dimers) arranged on a hexagonal lattice. Each tubulin dimer comprises two monomers, the α-tubulin and β-tubulin, and can be found in two states. In the first state a mobile negative charge is located into the α-tubulin monomer and in the second into the β-tubulin monomer. Each tubulin dimer is modeled as an electrical dipole coupled to its neighbors by electrostatic forces. The location of the mobile charge in each dimer depends on the location of the charges in the dimer's neighborhood. Mechanical forces that act on the microtubule affect the distances between the dimers and alter the electrostatic potential. Changes in this potential affect the mobile negative charge location in each dimer and the charge distribution in the microtubule. The net effect is that mechanical forces affect the charge distribution in microtubules. We propose to exploit this effect and use …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A cellular automaton for the propagation of circular fronts and its applications",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0952197605000059",
            "Abstract": "Artificial intelligence techniques are widely used to solve complicated manufacturing and fabrication process problems in today's industrial world. Cellular automata (CAs) have been applied numerous times as an evolvable technique to the solution of some of the aforementioned complicated problems with great success due to their inherent parallelism, structural locality, regularity and modularity. One of the most difficult problems that CAs dealt with in several cases (i.e. integrated circuit fabrication, pattern recognition and classification, computer aided design, machine vision, etc.) is the identification and the reproduction of circular fronts and shapes. In this paper a CA is used to propagate circular fronts. This CA has an extended Moore neighborhood and a relatively simple local rule based on Boolean operators. Simulation results of an integrated circuit fabrication process, namely chemical vapor deposition based …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:7PzlFSSx8tAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Cellular automata coupled with memristor devices: A fine unconventional computing paradigm",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9051236/",
            "Abstract": "Cellular Automata (CAs), a ubiquitous computational tool proposed by John von Neumann, illustrate how great complexity emerges from simple rules of dynamical transitions between space and time interconnected simplistic entities. CAs perform as mathematical computation models, but also they are a powerful medium to model nature and natural systems. As a computational platform, CAs come with unified memory and computation in the same physical area, attributed as a strong candidate against the limitations of data transfer, known as the von Neumann bottleneck. On the other hand, Memristors with their inherent Computing-In-Memory compatibility, can be easily considered as appropriate nanoelectronic devices to be coupled with CAs towards an energy and time efficient computational paradigm. In particular, CA present a vast area of applications, comprising various NP-complete hard to be solved …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Simulation of space-charge effects in electrical tree propagation using cellular automata",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167577X02005128",
            "Abstract": "The effect of space charge in electrical tree propagation is studied in this paper. Electrical tree propagation in solid dielectrics containing space-charge distribution is simulated using cellular automata (CA). An explanation of the electrical tree form is also given.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Current switching in graphene quantum point contacts",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6815986/",
            "Abstract": "Graphene has high-quality transport properties, but currents in graphene ribbons cannot be switched OFF, because of the absence of a bandgap. This is the most important obstacle for the use of graphene in the fabrication of integrated logic circuits. Here, we study current switching in zigzag graphene quantum point contacts using tight-binding Hamiltonians and the nonequilibrium Green function method. The current in these quantum point contacts is controlled by a back-gate and a top-gate potential. Our results show that the current can be effectively switched OFF for a potential range of 0.6 V. We explain this effect by computing the energy-band structure corresponding to the various regions of the quantum point contact. We show that these regions do not have a common conducting channel in a sufficiently large energy range and this results in zero conductance for energies in this range.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementation of non-linear filters using nanoelectronic single-electron circuitry",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269204001181",
            "Abstract": "Non-linear filters are large family of filters used in signal and image processing. They have found numerous applications such as in digital image restoration, speech processing and coding, digital TV applications, etc. In this paper, two binary non-linear filters, the three-point median filter and the 2×2-pixel morphological opening filter are designed using nanoelectronic single-electron circuitry. In single-electron circuits bits of information are represented by the presence or absence of single electrons at conducting islands. The two nanoelectronic filters are simulated using a Monte Carlo technique and their correct and stable logical operation is confirmed.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:M3NEmzRMIkIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Power Consumption in Cellular Automata",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-73216-9_8",
            "Abstract": "Cellular Automata (CAs) have been established as one of the most intriguing and efficient computational tools of our era with unique properties to fit well with the most of the upcoming nanotechnological and parallel computation aspects. Algorithms based on CAs are ideally suited for hardware implementation, due to their discreteness and their simple, regular and modular structure with local interconnections. On the other hand, power dissipation                     is considered as a rather limiting parameter for the advancement of high performance hardware design         . In this chapter the undergoing relationship between CAs and the corresponding power consumption                     would be exploited as a matter of importance for their hardware design analysis with many promising aspects. First of all in order to establish a clear connection, a power estimation model                     for combinational logic circuits using …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:5ugPr518TE4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Electronic Properties of Graphene Nanoribbons With Defects",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9337210/",
            "Abstract": "Graphene nanoribbons (GNRs) are the most important emerging Graphene structures for nanoelectronic and sensor applications. GNRs with perfect lattices have been extensively studied, but fabricated GNRs contain lattice defects the effect of which on their electronic properties has not been studied extensively enough. In this paper, we apply the Non-Equilibrium Green's function (NEGF) method combined with tight-binding Hamiltonians to investigate the effect of lattice defects on the conductance of GNRs. We specifically study, butterfly shaped GNRs, which operate effectively as switches, and have been used in CMOS-like architectures. The cases of the most usual defects, namely the single and double vacancy have been analytically examined. The effect of these vacancies was computed by placing them in different regions and with various numbers on GNR nano-devices, namely edges, main body, contacts …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "QCS-ΠΡΟΣOΜΟΙΩΤΗΣ ΚΒΑΝΤΙΚΟΥ ΥΠΟΛΟΓΙΣΤΗ-ΠΛΗΡΗΣ",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/215",
            "Abstract": "Αποθετήριο Κάλλιπος: QCS-ΠΡΟΣOΜΟΙΩΤΗΣ ΚΒΑΝΤΙΚΟΥ ΥΠΟΛΟΓΙΣΤΗ - ΠΛΗΡΗΣ DSpace \nΑρχική Σύνθετη Αναζήτηση Ελ / Eng Πλοήγηση Συλλογές Σύγγραμμα Συγγραφέας Τύπος \nέκδοσης Τίτλος Είδος Τεκμηρίου Θέμα Σχολή/Τμήμα Πληροφορίες Τίτλου Τίτλος: QCS-ΠΡΟΣOΜΟΙΩΤΗΣ \nΚΒΑΝΤΙΚΟΥ ΥΠΟΛΟΓΙΣΤΗ - ΠΛΗΡΗΣ Συγγραφείς: Καραφυλλίδης, Ιωάννης Σχολές/Τμήματα: \nΤΜΗΜΑ ΗΛΕΚΤΡΟΛΟΓΩΝ ΜΗΧΑΝΙΚΩΝ & ΜΗΧΑΝΙΚΩΝ Η/Υ, ΔΗΜΟΚΡΙΤΕΙΟ ΠΑΝΕΠΙΣΤΗΜΙΟ \nΘΡΑΚΗΣ Θέμα: Υπολογιστική επιστήμη Αρχιτεκτονική και οργάνωση Αρχές ανάπτυξης λογισμικού \nYπεραγωγιμότητα Ηλεκτρονική φυσική - Στοιχεία και διατάξεις ημιαγωγών Νανοηλεκτρονικές \nδιατάξεις Λέξεις-κλειδιά: ΚΒΑΝΤΙΚΗ ΥΠΟΛΟΓΙΣΤΙΚΗ ΚΒΑΝΤΙΚΗ ΕΠΕΞΕΡΓΑΣΙΑ ΤΗΣ \nΠΛΗΡΟΦΟΡΙΑΣ ΝΑΝΟΗΛΕΚΤΡΟΝΙΚΗ ΚΒΑΝΤΙΚΟΙ ΥΠΟΛΟΓΙΣΤΕΣ Περιγραφή Ημερομηνία \nΔημιουργίας: 3-Νοέ-2015 Πληροφορίες Τεκμηρίου Είδος Τεκμηρίου: Αλγόριθμος : …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Definition and evolution of quantum cellular automata with two qubits per cell",
            "Publication year": 2004,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.70.044301",
            "Abstract": "Studies of quantum computer implementations suggest cellular quantum computer architectures. These architectures can simulate the evolution of quantum cellular automata, which can possibly simulate both quantum and classical physical systems and processes. It is however known that except for the trivial case, unitary evolution of one-dimensional homogeneous quantum cellular automata with one qubit per cell is not possible. Quantum cellular automata that comprise two qubits per cell are defined and their evolution is studied using a quantum computer simulator. The evolution is unitary and its linearity manifests itself as a periodic structure in the probability distribution patterns.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:M3ejUd6NZC8C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Η Κβαντική Διεπλοκή και o Κβαντικός Μετασχηματισμός Fourier",
            "Publication year": 2015,
            "Publication url": "https://repository.kallipos.gr/handle/11419/222",
            "Abstract": "Δύο κβαντικά συστήματα βρίσκονται σε κατάσταση κβαντικής διεμπλοκής (entanglement) όταν η μέτρηση της κατάστασης του ενός καθορίζει την κατάσταση του άλλου. Η κβαντική διεμπλοκή δεν έχει κλασικό αντίστοιχο και αποτελεί υπολογιστικό πόρο. Χρησιμοποιείται σε πολλούς κβαντικούς αλγορίθμους και στη κβαντική τηλεμεταφορά (qauntum teleportation). Θα περιγραφεί ποιοτικά και με μαθηματικό τρόπο η κβαντική διεμπλοκή μεταξύ κβαντικών συστημάτων. Θα δοθούν παραδείγματα και θα προσομοιωθούν τα κβαντικά κυκλώματα που φέρνουν σε κατάσταση διεμπλοκής qubits  και κβαντικούς καταχωρητές.  Στο κεφάλαιο αυτό θα περιγραφεί επίσης τόσο ποιοτικά όσο και μαθηματικά ο κβαντικός μετασχηματισμός Fourier που αποτελεί την βάση πολλών κβαντικών αλγορίθμων. Θα δοθούν αναλυτικά παραδείγματα εφαρμογής του καθώς και το κβαντικό κύκλωμα που τον εκτελεί.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Biological circuits for signaling and synchronization in bacterial populations",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6842086/",
            "Abstract": "To coordinate their behavior and virulence and to synchronize attacks against their hosts, bacteria communicate by producing and detecting signaling molecules (autoinducers). This communication is controlled by biological circuits called quorum sensing circuits. Recently quorum sensing circuits have been recognized as an alternative target for controlling bacterial virulence and infections without the use of antibiotics. Here we model the quorum sensing process as a state transition graph. Based on this model we develop a simulation tool for the quorum sensing process in open and confined spaces. We perform a number of numerical experiments with various strategies of quorum sensing circuit regulation and we study the effectiveness of quorum sensing inhibitors. We also use network graph theory to model the complete quorum sensing system of Pseudomonas aeruginosa and construct its state space, which …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Computational Intelligent Oxidation Process Model and Its VLSI Implementation.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=16049599533345931116&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SECS: A new single-electron-circuit simulator",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4468759/",
            "Abstract": "Downscaling of the devices of integrated circuits (ICs) has reached the verge of nanometer scale. On this scale, new phenomena of a quantum nature are starting to appear in ICs. The necessity of the development of new tools for studding the behavior of such circuits that take into account these phenomena is evident. For this reason, a new system for the design and simulation of single electron circuits called SECS has been developed. The operation of single electron circuits is based on the tunneling effect. The stochastic nature due to tunneling is incorporated in the simulation of single electron circuits using the Monte Carlo method. The novelty of the SECS system is that it provides the behavior of single electron circuits in an actual time scale, making thus easier and more complete the study of the phenomena that take place at an arbitrary single electron circuit.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Representation of qubit states using 3D memristance spaces: A first step towards a memristive quantum simulator",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8604413/",
            "Abstract": "Development of quantum simulators is a major step towards the universal quantum computer. Quantum simulators are quantum systems that can perform specific quantum computations, or software packages that can reproduce most of the aspects of a general universal quantum computer on a general purpose classical computer. Development of quantum simulators using digital circuits, such as FPGAs is very difficult, mainly because the unit of quantum information, the qubit, has an infinite number of states, whereas the classical bit has only two. On the other hand, analog circuits comprising R, L and C elements have no internal state variables that can be used to reproduce and store qubit states. Here we take the first step towards the development of a new quantum simulator using memristors. The qubit state is mapped to a 3D space spanned by the memristances of three identical memristors. The qubit state …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quantum mechanical tunnelling in nanoelectronic circuits: Design of a nanoelectronic single-electron RAM",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5490538/",
            "Abstract": "Single-electronics is a nanoelectronic technology that makes possible the control of transport and position of a single or a small number of electrons. The fundamental physical principles of single-electronics are the quantum mechanical tunnelling and the Coulomb blockade. Bits of information are represented by the presence or absence of a single or a small number of electrons in conducting islands. The design and operation of two basic single-electron gates and the basic memory cell are presented. Furthermore, a single-electron random-access memory array is designed and its operation is analyzed using Monte Carlo simulation. Simulation shows that selective read and write operations can be performed in this memory array.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Simulation and parametric analysis of graphene pn junctions with two rectangular top gates and a single back gate",
            "Publication year": 2018,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6463/aaa680/meta",
            "Abstract": "Graphene pn junctions could be the building blocks of future nanoelectronic circuits. While the conductance modulation of graphene pn junctions formed in devices with one bottom and one top gate have received much attention, there is comparatively little work done on devices with two top gates. Here, we employ tight-bind Hamiltonians and non-equilibrium Green function method to compute in a systematic way the dependence of the conductance of graphene pn junctions, formed in a device with two top gates, on the device parameters. We present our results in a compact and systematic way, so that the effect of each parameter is clearly shown. Our results show that the device conductance can be effectively modulated, and that graphene devices with two top gates may be used as basic elements in future carbon-based nanoelectronic circuits.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:wbdj-CoPYUoC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Constitutive activation of jasmonate signaling in an Arabidopsis mutant correlates with enhanced resistance to Erysiphe cichoracearum, Pseudomonas syringae, and Myzus persicae",
            "Publication year": 2002,
            "Publication url": "https://apsjournals.apsnet.org/doi/abs/10.1094/MPMI.2002.15.10.1025",
            "Abstract": "In Arabidopsis spp., the jasmonate (JA) response pathway generally is required for defenses against necrotrophic pathogens and chewing insects, while the salicylic acid (SA) response pathway is generally required for specific, resistance (R) gene-mediated defenses against both biotrophic and necrotrophic pathogens. For example, SA-dependent defenses are required for resistance to the biotrophic fungal pathogen Erysiphe cichoracearum UCSC1 and the bacterial pathogen Pseudomonas syringae pv. maculicola, and also are expressed during response to the green peach aphid Myzus persicae. However, recent evidence indicates that the expression of JA-dependent defenses also may confer resistance to E. cichoracearum. To confirm and to extend this observation, we have compared the disease and pest resistance of wild-type Arabidopsis plants with that of the mutants coi1, which is insensitive to JA, and …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:f2IySw72cVMC",
            "Publisher": "The American Phytopathological Society"
        },
        {
            "Title": "Cooperation in a power-aware embedded-system changing environment: Public goods games with variable multiplication factors",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6095651/",
            "Abstract": "Power is becoming a critical constraint for designing embedded applications because the amount of power available to these portable systems is limited due to battery life. On the other hand, many of the emerging real-time applications designed for battery-operated systems, such as wireless communication, and audio and video processing, tend to compete in order to gain a larger fraction of the energy provided by the common (public) source. It is known that both cooperation and competition are very important for every vivid system operation and evolution because cooperation leads to the formation of more complex systems and competition is crucial for the efficient operation, especially when common sources are used. In this paper, we study the cooperation between individuals, i.e., power-aware jobs, of a group, i.e., an embedded system, in a power-aware changing environment, using a variation of the public …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient photoresist development simulator based on cellular automata with experimental verification",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/827346/",
            "Abstract": "An efficient and practical photoresist development simulator based on cellular automata is presented. Image reversal and chemical amplification processes are also simulated using this simulator. To verify the simulator, a series of experiments have been designed and performed using the Shipley SNR-248 negative resist, a stepper, and a deep ultraviolet source at 248 nm. Experiments were performed for periodic and isolated lines with pitches 300, 400, 500, and 1000 nm, for exposure energy doses of 11, 13, 17, and 23 mJ/cm/sup 2/, and with developer temperatures of 0, 20, and 80/spl deg/C. In all cases, the simulator results were found to be in very good agreement with the corresponding experimental results. The simulator has also successfully reproduced the incomplete opening effect observed in the case of close-spaced parallel lines.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A methodology for VLSI implementation of cellular automata algorithms using VHDL",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0965997800000855",
            "Abstract": "A methodology for the VLSI implementation of Cellular Automata (CA) algorithms using the VHSIC Hardware Description Language (VHDL) is proposed for the first time. This methodology builds a bridge between the CAs as models of physical systems and processes and the CAs as a VLSI architecture. A translation algorithm is developed that has as input the CA algorithms that simulate physical systems and processes, and as output the corresponding VHDL code. The parameters of this translation algorithm are defined by the user and can be automatically mapped into synthesizable VHDL. An example, where this methodology is applied to the hardware implementation of a CA algorithm for automated visual inspection, is presented.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:0EnyYjriUFMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "DNA cellular automata",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-27270-2_21",
            "Abstract": "The elementary cellular automata (CA) evolution rule can be extracted from a given number of CA evolution patterns and this can also be applied to the CAs that model DNA sequences. We map DNA to CA in such manner that sugar-phosphate backbone of a DNA molecule corresponds to the CA lattice and the organic bases to the CA cells. At each position of the lattice one of the four bases A (Adenine), C (Cytosine), T (Thymine) and G (Guanine) of the DNA molecule may be allocated, corresponding to the four possible states of the CA cell.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Synchronization in Quantum-Dot Cellular Automata Circuits and Systems",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9273228/",
            "Abstract": "Signal synchronization of large scale Quantum-dot Cellular Automata (QCA) circuits is one of the most complex QCA design challenges. More specifically, the QCA circuits synchronization problem, especially in the large circuits, is characterized as rather complex due to technology constraints. In this paper, by extensively analyzing the most important properties of the signal synchronization problem in QCA circuits, we propose an efficient design methodology to tackle the problem, based on the well-known from computer science, Firing Squad Synchronization Problem (FSSP). Comparing FSSP with the QCA circuits synchronization problem many similarities can be found. Among the numerous FSSP's algorithmic solutions in literature, the Mazoyer algorithm has proven to be the most efficient one. In this paper, a novel design and implementation in QCA technology of this algorithm is presented. Moreover, by the …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and simulation of a nanoelectronic single-electron analog to digital converter",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269203001538",
            "Abstract": "The design of a nanoelectronic single-electron analog to digital (A to D) converter is presented. By taking advantage of the Coulomb blockade effect, the conversion of the analog input to a digital signal is obtained directly without the use of reference voltages, counters or other auxiliary circuitry. The operation of the A to D converter is simulated and the electron transport in the circuit is analyzed. The stability of the single-electron A to D converter circuit is studied and its stable operation is shown. The main result of this research work is that single-electron A to D converters are simple, stable and can be fabricated.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Cellular Automata and Power Consumption.",
            "Publication year": 2012,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=15575969&AN=76109640&h=lkOsClu9Mdm4Ypznwc50rqycezdlcFArJ2hwq7LAxvNbY%2BGEmu%2BenCLqcUjOMl03ep%2FklsjT7ZD1vnn1mnrr%2Fw%3D%3D&crl=c",
            "Abstract": "Cellular Automata (CAs) are a computational tool for modeling complex phenomena. CAs can be simulated exactly by computers and algorithms based on CAs are ideally suited for hardware implementation, due to their discreteness and their simple, regular and modular structure with local interconnections. On the other hand, power dissipation is recognized as a critical parameter in modern VLSI design field. As a result, the study of the undergoing relationship between CA algorithms and the corresponding power consumption could be considered as a matter of importance for their VLSI design analysis with many promising aspects. In this paper, different point of views on power consumption and CAs will be presented. First of all, a power estimation model for combinational logic circuits using CA and focused on glitching estimation is presented in order to elucidate the application of CA model to VLSI …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fundamental Building Blocks for The Design of A Single-electron Nanoelectronic Processor",
            "Publication year": 2007,
            "Publication url": "https://arxiv.org/abs/0708.1836",
            "Abstract": "A single-electron random access memory array (RAM) and a single-electron universal Fredkin gate are designed and simulated. The universality of the Fredkin gate in combination with the RAM gives the potential of the realization of an elementary single-electron nanoelectronic processor.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Boolean network model of the Pseudomonas aeruginosa quorum sensing circuits",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6881735/",
            "Abstract": "To coordinate their behavior and virulence and to synchronize attacks against their hosts, bacteria communicate by continuously producing signaling molecules (called autoinducers) and continuously monitoring the concentration of these molecules. This communication is controlled by biological circuits called quorum sensing (QS) circuits. Recently QS circuits and have been recognized as an alternative target for controlling bacterial virulence and infections without the use of antibiotics. Pseudomonas aeruginosa is a Gram-negative bacterium that infects insects, plants, animals and humans and can cause acute infections. This bacterium has three interconnected QS circuits that form a very complex and versatile QS system, the operation of which is still under investigation. Here we use Boolean networks to model the complete QS system of Pseudomonas aeruginosa and we simulate and analyze its operation in …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cellular automaton methodology for the simulation of integrated circuit fabrication processes",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X01000619",
            "Abstract": "This paper presents a methodology for the simulation of physical processes with local interactions using cellular automata. Such processes are common in integrated circuit fabrication, and their simulation presents one of the most difficult problems in developing technology computer aided design (TCAD) systems. The simulated integrated circuit fabrication processes considered are lithography, oxidation, and deposition processes. The proposed methodology establishes the ability to capture the essential features of these integrated circuit fabrication processes and to translate them into a suitable form, in order to obtain an effective cellular automaton model, for each process. Several numerical experiments were carried out, in this work, using the cellular automaton algorithms obtained, and their results were found to be in very good agreement with published experimental results. Furthermore, cellular automaton …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:RHpTSmoSYBkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Memristor hardware accelerator of quantum computations",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8965109/",
            "Abstract": "Quantum computing and quantum computers are a major part of the second quantum revolution. Existing quantum algorithms can natively solve complex problems, such as the prime number factorization and searching of unstructured databases, in a fast and efficient way. The main obstacle towards building large and efficient quantum computers is decoherence, which produces errors that have to be continuously corrected using quantum error correcting codes. Beyond the realisation of quantum computing systems with actual quantum hardware, quantum algorithms have been developed based on quantum logic gates that can be described and utilised by classical computers and proper interfaces based on linear algebra operations. Furthermore, memristive grids have been proposed as novel nanoscale and low-power hardware accelerators for the time-consuming matrix-vector multiplication and tensor products …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive reverse engineering of gene regulatory networks using genetic algorithms",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1629947/",
            "Abstract": "An increasingly popular model of regulation is to represent networks of genes as if they directly affect each other. Although such gene networks are phenomenological because they do not explicitly represent the proteins and metabolites that mediate cell interactions, they are a logical way of describing phenomena observed with transcription profiling. In this paper, we present a computational tool, based on genetic algorithms (GAs), which is able to predict with observed data the regulatory pathways that are represented as influence matrix. The ability to create gene networks from experimental data and use them to reason about their dynamics and design principles increase our understanding of cellular function",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A CAD system for the construction and VLSI implementation of cellular automata algorithms using VHDL",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933103001005",
            "Abstract": "Cellular Automata (CAs) are models of physical systems where space and time are discrete and interactions are only local. CAs are very effective in simulating physical systems and solving scientific problems, because they can capture the essential features of systems in which global behaviour arises from the collective effect of simple components which interact locally. CAs have been applied successfully to the simulation of several physical systems and processes, and have been extensively used as a very large-scale integrated (VLSI) architecture.We present a CAD system that builds a bridge between CAs as models of physical systems and processes, and CAs as a VLSI architecture. The inputs to our CAD system are the CA dimensionality, lattice size, local rule, and the initial and boundary conditions imposed by the particular problem. Our system produces as output the corresponding VHDL code, which leads …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:UeHWp8X0CEIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Design and simulation of graphene logic gates using graphene p–n junctions as building blocks",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s41127-021-00043-7",
            "Abstract": "Electrostatically doped graphene p–n junctions can modulate graphene nanoribbon conductance and can be indispensable parts of nanoelectronic graphene circuits. Much research has been conducted on such devices with one rectangular top gate and one back gate with very encouraging results. Recently, graphene p–n junctions with two rectangular top gates have been proposed and their study revealed a rich behaviour that allows their use in both analogue and digital nanoelectronic circuits. Here we study graphene p–n junctions with two trapezoid top gates and a common back gate with special focus to the effect of the angle and the distance between the two top gates. Furthermore, trapezoid top gates with angles of 45° make use of the Veselago lens effect, allowing an effective control by tuning density of states and carrier density. We simulated these devises using the non-equilibrium Green’s …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:W5xh706n7nkC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Η Αρχή της Κβαντικής Υπολογιστικής-Κβαντικός Αλγόριθμος του Deutsch",
            "Publication year": 2015,
            "Publication url": "https://repository-web.kallipos.gr/handle/11419/220",
            "Abstract": "Στο κεφάλαιο αυτό θα δοθεί τόσο με μαθηματική περιγραφή όσο και με αναλυτικά εφαρμοσμένα παραδείγματα η βασική αρχή της Κβαντικής Υπολογιστικής. Θα περιγραφεί πώς κάθε κβαντικός υπολογισμός και κάθε κβαντικός αλγόριθμος μπορεί να περιγραφεί πλήρως με την χρήση qubits, κβαντικών καταχωρητών και κβαντικών πυλών. Θα δοθεί το κυκλωματικό μοντέλο των κβαντικών υπολογισμών τόσο με μαθηματική περιγραφή όσο και σε μορφή flowcharts. Οι κβαντικοί υπολογισμοί θα παρουσιαστούν και με την χρήση του Προσομοιωτή Κβαντικού Υπολογιστή QCS, που θα έχουν στην διάθεσή τους οι αναγνώστες και θα περιγραφεί στο 9ο Κεφάλαιο. Τέλος, θα περιγραφεί ο πρώτος ιστορικά κβαντικός αλγόριθμος, ο αλγόριθμος του Deutsch, με μαθηματικό τρόπο και με τη χρήση του QCS. Θα δοθεί επίσης και η φυσική ερμηνεία της κβαντικής φάσης των qubits ως υπολογιστικού πόρου.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Στοιχεία Κβαντικής Μηχανικής",
            "Publication year": 2015,
            "Publication url": "https://repository-web.kallipos.gr/handle/11419/217",
            "Abstract": "Το βιβλίο αυτό θα γραφτεί με τέτοιον τρόπο ώστε να μην απαιτούνται από τον αναγνώστη γνώσεις Κβαντικής Μηχανικής. Στο κεφάλαιο αυτό θα δοθούν όλα τα βασικά στοιχεία της Κβαντικής Μηχανικής που χρειάζονται για την κατανόηση της Κβαντικής Υπολογιστικής. Θα περιγραφούν τα κβαντικά συστήματα δύο καταστάσεων, τα διανύσματα Bra και Ket και τα εσωτερικά και εξωτερικά τους γινόμενα. Θα δοθούν επίσης και όλες οι απαραίτητες γνώσεις των τελεστών και του τρόπου μεταβολής της κατάστασης των κβαντικών συστημάτων. Όλες οι γνώσεις που θα αποκτηθούν θα εφαρμοστούν σε ένα κβαντικό παίγνιο που έχει ως αντικείμενο την μεταβολή της κατάστασης ενός «κβαντικού κέρματος».",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:K3LRdlH-MEoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A CAD system for modeling and simulation of computer networks using cellular automata",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4444626/",
            "Abstract": "The increasing complexity of computer networks calls for the development of new models for their simulation. Cellular automata (CAs) are a well-known and successful model for complex systems. This paper presents a system for modeling and simulation of computer networks based on CAs. More specifically, a 2D NaSch CA computer network model has been developed, and several networks were simulated. Algorithms for connectivity evaluation, system reliability evaluation, and shortest path computation in a computer network have also been implemented. Our system, called Net_CA system, was designed and developed as an interactive tool that offers automated modeling with the assistance of a dynamic and user-friendly graphical environment. The proposed system also produces automatically synthesizable very high speed integrated circuits hardware description language code leading to the parallel …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quantum transport in the FMO photosynthetic light-harvesting complex",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10867-017-9449-4",
            "Abstract": "The very high light-harvesting efficiency of natural photosynthetic systems in conjunction with recent experiments, which showed quantum-coherent energy transfer in photosynthetic complexes, raised questions regarding the presence of non-trivial quantum effects in photosynthesis. Grover quantum search, quantum walks, and entanglement have been investigated as possible effects that lead to this efficiency. Here we explain the near-unit photosynthetic efficiency without invoking non-trivial quantum effects. Instead, we use non-equilibrium Green’s functions, a mesoscopic method used to study transport in nano-conductors to compute the transmission function of the Fenna–Matthews–Olson (FMO) complex using an experimentally derived exciton Hamiltonian. The chlorosome antenna and the reaction center play the role of input and output contacts, connected to the FMO complex. We show that there are …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "On graphene nanoribbon-based nanoelectronic circuits viability",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Sorin-Cotofana/publication/327792532_On_Graphene_Nanoribbon-based_Nanoelectronic_Circuits_Viability/links/5bca5fb6458515f7d9cb8f93/On-Graphene-Nanoribbon-based-Nanoelectronic-Circuits-Viability.pdf",
            "Abstract": "Graphene is a robust material with high electron mobility, ballistic transport, and high thermal conductance. However, it is generally assumed that its bandgap absence impedes Graphene Nanoribbons (GNRs) utilization as foundational elements for nanoelectronic circuits. In this paper we provide evidence against this belief and demonstrate that Graphene is indeed a strong post-Si nanoelectronics forerunner. In particular, we (i) reveal GNR’s conductance dependence on shape and external biasing and (ii) discuss the realization of multiple-contact GNRs, GNR-based switches, and Graphene pn junctions. Our results clearly indicate that GNR devices can potentially outperform state of the art Boolean circuits performance.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and simulation of a nanoelectronic single-electron universal Fredkin gate",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1364111/",
            "Abstract": "A single-electron universal Fredkin gate (F-gate) is presented in this paper. Bits of information are represented by the presence or absence of single electrons at conducting islands. The logic operation of the F-gate as well as its AND, OR, and NOT operation is verified using simulation. The stability of its universal operation is analyzed using a Monte Carlo method. Stability analysis using free-energy diagrams and stability plots verified the correct and stable gate operation. The operation temperature of the single-electron Fredkin is expected to rise as dimensions of the circuit's conducting islands are reduced.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quantum gate circuit model of signal integration in bacterial quorum sensing",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5959159/",
            "Abstract": "Bacteria evolved cell to cell communication processes to gain information about their environment and regulate gene expression. Quorum sensing is such a process in which signaling molecules, called autoinducers, are produced, secreted and detected. In several cases bacteria use more than one autoinducers and integrate the information conveyed by them. It has not yet been explained adequately why bacteria evolved such signal integration circuits and what can learn about their environments using more than one autoinducers since all signaling pathways merge in one. Here quantum information theory, which includes classical information theory as a special case, is used to construct a quantum gate circuit that reproduces recent experimental results. Although the conditions in which biosystems exist do not allow for the appearance of quantum mechanical phenomena, the powerful computation tools of …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A single-electron XOR gate",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269200001269",
            "Abstract": "A new single-electron circuit implementing the logic function XOR is presented in this paper. The logic gate proposed consists of five tunnel junctions, two capacitors and four islands. The operation of this gate is analysed using Monte Carlo simulation. The simulation results show that the gate operates in stable regions.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Conductance of L-shaped and T-shaped graphene nanoribbons",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269217306298",
            "Abstract": "Rectangular graphene nanoribbons with two contacts have been studied extensively as parts of several nanoelectronic devices. L-shaped and T-shaped graphene nanoribbons received a little or no attention until now. In this letter, we present computations of the conductance of L-shaped graphene nanoribbons with two contacts and of T-shaped graphene nanoribbons with tree contacts. We used tight-binding Hamiltonians and non-equilibrium Green's functions to compute their conductance. In L and T-shaped nanoribbons electrons are initially transported along a zigzag-edged nanoribbon, and then the direction of their motion changes by 90O and are transported along an armchair-edged nanoribbon. Our results show that this change in direction of motion results in a zero-conductance region that extents about 0.25 eV below and above the Fermi level. This zero conductance region is large enough to cause …",
            "Abstract entirety": 0,
            "Author pub id": "WbkfjB4AAAAJ:1qzjygNMrQYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Single-electron OR gate",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/document/840065/",
            "Abstract": "The design of a single-electron OR gate is presented. Bits of information are represented by the presence or absence of single electrons at a conducting island. The static operation and the stability of this gate are analysed using Monte Carlo simulation.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:_FxGoFyzp5QC",
            "Publisher": "IET"
        },
        {
            "Title": "Cellular quantum computer architecture",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0375960103016591",
            "Abstract": "A cellular quantum computer architecture with two qbits per cell is presented. The computation is performed at two repeated computation stages. At the first stage the states of all the control qbits are affected by the states of the neighboring data qbits. At the second stage a quantum gate acts on the tensor product of the data and control qbits in each cell. Quantum computations using this architecture are simulated and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:R3hNpaxXUhUC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Study of the effects of photoresist surface roughness and defects on developed profiles",
            "Publication year": 2000,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0268-1242/15/2/303/meta",
            "Abstract": "A tested, verified and calibrated lithography simulator was used to study phenomena whose effects are becoming more pronounced as integrated circuits are pushed deeper into the submicron region. Numerical experiments were carried out to elucidate the effect of defects located in the resist bulk, as well as the effect of the resist surface roughness, on the developed profiles.",
            "Abstract entirety": 1,
            "Author pub id": "WbkfjB4AAAAJ:r0BpntZqJG4C",
            "Publisher": "IOP Publishing"
        }
    ]
}]