[{
    "name": "Ιωάννης Αντωνίου",
    "romanize name": "Ioannis Antoniou",
    "School-Department": "Μαθηματικών",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 7651,
    "Scholar name": "Ioannis E. Antoniou",
    "Scholar id": "UMPx3MAAAAAJ",
    "Affiliation": "Professor of Mathematics, Aristotle University of Thessaloniki",
    "Citedby": 3479,
    "Interests": [
        "complex systems",
        "networks",
        "statistical mechanics",
        "dynamical systems",
        "chaos"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=UMPx3MAAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Towards a graph theoretical approach to study gender lateralization effect in mathematical thinking",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6399746/",
            "Abstract": "Gender differences in mathematical thinking is a common concern of scientists from different research fields. Both parents and teachers report that males seem to perform better in complex mathematics compared to females. This study comes to shed light in the different organization of the underlying functional networks, in order to investigate the aforementioned observation, without supporting or rejecting this statement. In this sense, it is generally accepted that females use their both hemispheres to accomplish a certain task, while males use mostly the hemisphere which is properly suited. For the purposes of the current analysis, electroencephalographic recordings were collected from 11 males and 11 females, during a difficult mathematical task. Then a previously proposed model was used in order to pass from the sensor level to the cortical one, in order to examine the networks formed among the cortical dipoles …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectral characterization of mixing evolutions in classical statistical physics",
            "Publication year": 2019,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9780429187810-25/spectral-characterization-mixing-evolutions-classical-statistical-physics-antoniou-suchanecki",
            "Abstract": "The decay of correlation functions, which is equivalent to mixing, qualifies physical systems approaching equilibrium and includes all types of chaotic behaviour. Although all ergodic properties have an equivalent description in terms of the spectra of the evolution operators in Hilbert space there is no necessary and sufficient spectral condition for mixing. The only sufficient condition known is that of absolutely continuous spectrum which guarantees mixing from the Riemann-Lebesgue Theorem.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:JV2RwH3_ST0C",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Non-locality and quantum nanostructures",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077902003521",
            "Abstract": "Hegerfeldt has shown that quantum systems with positive energy initially localized in a finite region, immediately develop infinite tails. We analyze Hegerfeldt’s theorem using quantum and classical wave packets and investigate the applicability of Hegerfeldts arguments on quantum non-locality in quantum electrodynamics. We demonstrate the appearance of non-local effects at the level of quantum states. We show, however that the expectation values of some observables spread causally. Therefore the measurement of the non-locality is questionable. We show that the classical measurement cannot detect the “acausal” effects of the non-locality. The possibility that quantum detectors may measure the effect should be investigated in the future.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "On the Hamiltonian description of fluid mechanics",
            "Publication year": 2001,
            "Publication url": "https://arxiv.org/abs/hep-th/0106119",
            "Abstract": "We suggest the Hamiltonian approach for fluid mechanics based on the dynamics, formulated in terms of Lagrangian variables. The construction of the canonical variables of the fluid sheds a light of the origin of Clebsh variables, introduced in the previous century. The developed formalism permits to relate the circulation conservation (Tompson theorem) with the invariance of the theory with respect to special diffiomorphisms and establish also the new conservation laws. We discuss also the difference of the Eulerian and Lagrangian description, pointing out the incompleteness of the first. The constructed formalism is also applicable for ideal plasma. We conclude with several remarks on the quantization of the fluid.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Financial time operator and the complexity of time",
            "Publication year": 2013,
            "Publication url": "https://www.ingentaconnect.com/content/imp/mm/2013/00000011/00000001/art00006",
            "Abstract": "The world's financial system exhibits all of the properties of a complex system: irreversibility, unpredictability, and innovations. Moreover, it implements an exquisite set of durations such as tick time, execute time, time slicing, time-weighted averaging, sampling time, trade duration, position-holding time, option termination time, among others. It is the purpose of this paper to construct a time operator in the sense of complex unstable dynamical system theory for the world financial system. As a consequence, we have opened up a new and much wider vista of extraordinarily complex systems possessing many internal times of great dynamic inter-importance. We believe more generally that the complexity of time as emphasized in this paper should become an essential part of future complex dynamical systems theory",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Imprint Academic"
        },
        {
            "Title": "Elastic neural net for the earthquake epicenter search",
            "Publication year": 2002,
            "Publication url": "https://www.hindawi.com/journals/ddns/2002/920136/",
            "Abstract": "Automatic processing of seismic data is today a key element in the efforts to achieve high quality seismic systems. Automated procedures for locating seismic events with a network including arrays and single element seismometers usually incorporate back-azimuth estimates, arrival-time data, and associated uncertainties into a least-squares-inverse location algorithm. Such an algorithm is quite cumbersome and requires expanding a set of non-linear equations in a Taylor series. Second-order terms usually not included in the algorithm can be important if the initial estimate is far from the solution.We propose to use elastic neural nets (ENN) to find the initial estimation in automated procedures of locating seismic events and discuss the results for simulated seismic events. The advantages of ENN are the simplicity of the algorithm, the fast convergence and the high efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "On the spectral properties of a Markov model for learning processes",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0129183100000201",
            "Abstract": "We study the spectral properties of the evolution operator of densities of the one-dimensional version of a Markov model for instrumental conditioning proposed by Bush and Mosteller in the early '50s. The model is a probabilistic combination of dynamical systems with phase space dependent probability distribution. The spectral properties are derived by restricting the stochastic operator in the space of analytic functions. The nonergodic properties of the model are demonstrated by the spectrum of the stochastic operator.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:P5F9QuxV20EC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "On the efficient resources distribution in economics based on entropy",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437103012329",
            "Abstract": "We generalize the approach developed in our previous work on the efficient resources distribution in economic systems with a small number of elements based on entropy. In order to take into account the asymmetric resources distribution, a new set of two-parameter interpolating functions is introduced. We demonstrate that the maximal value of entropy is reached only in case of asymmetric distribution of resources. First results on application of the generalized approach to the analysis of incomes distribution for Sweden and Russia populations have shown that the new scheme permits to estimate effectively the state of the analyzed system and control the resources distribution process.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:8k81kl-MbHgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Wavelet filtering of network traffic measurements",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437103000621",
            "Abstract": "The “Caterpillar”-SSA (Principal Components of Time Series: Caterpillar Method, St. Petersburg University Press, 1997; Analysis of Time Series Structure: SSA and Related Techiques, Chapman & Hall/CRC, London/Boca Raton, FL, 2001) and statistical analysis based on the joint utilization of χ2 and ω2 tests provided the possibility to divide the whole set of components into two classes (VIII International Workshop on Advanced Computing and Analysis Techniques in Physics Research, ACAT’2002, 24–28 June 2002, Moscow, Russia, Book of abstracts, p. 176 (submitted to Physica D)). The first class includes leading components responsible for the main contribution to network traffic (Physica D 167 (2002) 72), and the second class involves residual components that can be interpreted as noise. More detailed analysis of the boundary region between these two classes may give additional information on traffic …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:zA6iFVUQeVQC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Probabilistic control of chaos through small perturbations",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077998003063",
            "Abstract": "We study the method of probabilistic control of chaotic dynamics (I. Antoniou, V. Basios, F. Bosco, Int. J. Bif., Chaos 6 (1996) 1563; I. Antoniou, V. Basios, F. Bosco, Absolute controllability condition for probablistic control of Chaos, Int. J. Bif., Chaos 8(2) (1998) 409) in connection with small random perturbations of the map parameter. By constructing a probabilistic dynamical system equivalent to the perturbed chaotic map we calculate a characteristic exponent which gives controllability conditions in terms of the applied perturbations.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Providing insights on habitat connectivity for male brown bears: A combination of habitat suitability and landscape graph-based models",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304380014002142",
            "Abstract": "The combined study of movement patterns and habitat selection, behaviors that are affected by landscape structure, is of critical importance for effective conservation of wildlife. In the same context, maintaining connectivity is a key component for facilitating movement and ensuring species persistence. The brown bear is a wide-ranging predator that moves across large areas, crossing various habitats of different quality. Here, we provide a methodological framework that allowed us to explore the relative importance of habitat quality upon movement patterns and connectivity. First, we developed habitat-suitability models by using telemetry data of eight male brown bears (12,893 radio-locations) collected in Greece. Next, we combined habitat-suitability maps with real movement data to develop graph models that represent movement networks as inter-connected patches of different quality. Network analyses revealed …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:qUcmZB5y_30C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Competitive Conditions in Global Value Chain Networks: An Assessment Using Entropy and Network Analysis",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/836340",
            "Abstract": "We investigated competitive conditions in global value chains (GVCs) for a period of fifteen years (2000–2014), focusing on sector structure, countries’ dominance and diversification. For this purpose, we used data from the World Input–Output Database (WIOD) and examined GVCs as weighted directed networks, where countries are the nodes and value added flows are the edges. We compared the in-and out-weighted degree centralization of the sectoral GVC networks in order to detect the most centralized, on the import or export side, respectively (oligopsonies and oligopolies). Moreover, we examined the in-and out-weighted degree centrality and the in-and out-weight entropy in order to determine whether dominant countries are also diversified. The empirical results reveal that diversification (entropy) and dominance (degree) are not correlated. Dominant countries (rich) become more dominant (richer). Diversification is not conditioned by competitiveness. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:tH6gc1N1XXoC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Educational semantic wikis in the linked data age: the case of msc web science program at aristotle university of thessaloniki",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.369.2553&rep=rep1&type=pdf",
            "Abstract": "Wikis are nowadays a mature technology and further well established as successful eLearning approaches that promote collaboration, fulfill the requirements of new trends in education and follow the theory of constructivism. Semantic Wikis on the other hand, are not yet thoroughly explored, but differentiate by offering an increased overall added value to the educational procedure and the course management. Their recent integration with the Linked Data cloud exhibits a potential to exceed their usual contribution and to render them into powerful eLearning tools as they expand their potentialities to the newly created educational LOD. Web Science Semantic Wiki constitutes a prime attempt to evaluate this potential and the benefits that Semantic Web and linked data bring in the field of education.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:hkOj_22Ku90C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Unconventional Models of Computation, UMC’2K: Proceedings of the Second International Conference on Unconventional Models of Computation,(UMC’2K)",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=i0HtBwAAQBAJ&oi=fnd&pg=PA1&dq=info:4hZLAskdKQwJ:scholar.google.com&ots=0nI6FbTYHS&sig=C0g59a8_ezR461kK4h0XWTqV_WQ",
            "Abstract": "This book contains papers presented at the 2nd International Conference on Unconventional Models of Computation (UMCK'2K), which was held at Solvay Institutes, Brussels, Belgium, in December 2000. Computers as we know them may be getting better and cheaper, and doing more for us, but they are still unable to cope with many tasks of practical interest. Nature, though, has been'computing'with molecules and cells for billions of years, and these natural processes form the main motivation for the construction of radically new models of computation, the core theme of the papers in this volume. Unconventional Models of Computation, UMCK'2K covers all major areas of unconventional computation, including quantum computing, DNA-based computation, membrane computing and evolutionary algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:D03iK_w7-QYC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "On the quantum Liouville space",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=BQ1MPLxzR4AC&oi=fnd&pg=PA61&dq=info:Cs7DcGPibrEJ:scholar.google.com&ots=RPYus_FkCZ&sig=9vkp0YAp5nAO8TeEdvYWU3jK49A",
            "Abstract": "A pure state in quantum mechanics is represented by one dimensional projec-tions in the Hilbert Space of wavefunctions, being solutions of Schrödinger's equation. When information is distributed in an ensemble of pure states, the state is represented by a statistical mixture, ie a convex combination of pure states. In mathematical terms mixed states are bounded positive operators with trace one. The spectral representation of trace class operators (1) allows to express any mixed state as a mixture of pure states [2]. The set of state operators is a subset of the space of bounded operators. The Hilbert space spanned by state operators is called the Liouville space.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-factorizable extensions of the Liouville operator: the Friedrichs model",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077901000753",
            "Abstract": "We construct for the Friedrichs model extensions of the Liouville operator which do not reduce to any extension of the corresponding Hamilton operator. These extensions originate in the Brussels–Austin approach to irreversibility and acquire meaning in suitable rigged Hilbert spaces (RHS) associated with the Hilbert–Schmidt space, known as rigged Liouville space (RLS).",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Statistical analysis of weighted networks",
            "Publication year": 2008,
            "Publication url": "https://www.hindawi.com/journals/ddns/2008/375452/",
            "Abstract": "The purpose of this paper is to assess the statistical characterization of weighted networks in terms of the generalization of the relevant parameters, namely, average path length, degree distribution, and clustering coefficient. Although the degree distribution and the average path length admit straightforward generalizations, for the clustering coefficient several different definitions have been proposed in the literature. We examined the different definitions and identified the similarities and differences between them. In order to elucidate the significance of different definitions of the weighted clustering coefficient, we studied their dependence on the weights of the connections. For this purpose, we introduce the relative perturbation norm of the weights as an index to assess the weight distribution. This study revealed new interesting statistical regularities in terms of the relative perturbation norm useful for the statistical characterization of weighted graphs.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Agro-Semantics knowledge representation via Open Linked data (OLD) cloud: a case study in Integrated Crop Production",
            "Publication year": 2012,
            "Publication url": "http://prime.uth.gr/esdo_proceedings/2012/oral/Damos-oikonomou-bratsas-antoniou.pdf",
            "Abstract": "Crop Systems worldwide are increasing their use of integrated production systems in response to consumer preferences and environmental imperatives. In particular integrated crop production gives priority to environmental and human health safety in the production of high-quality crops. Although certification organizations are use integrated production systems at the crop level to make certification determinations for individual farms, the available information is either not shared or exposed in non exploitable formats. In this work a web-3 semantic framework is proposed based on OLD cloud to link available information, related to Integrated Crop Production, to facilitate development and evaluation of current integrated crop production systems in Greece. In the case study, we propose links as relationships anchors in hypertext documents written in HTML, for data between arbitrary things described by RDF. We further proposed URIs to identify any kind of object or concept related to integrated fruit production. Since typical network portals, related to integrated fruit production, do not provide links among available data, nor expose their information in a standard form, the proposed ontology based on Semantic Web technologies (RDF, OWL, SPARQL, etc.) provides an environment where application can query that data and draw inferences using related vocabulary. By providing those extra links (in terms of RDF triples) several applications for integrated crop production can be developed. In particular, by virtue of integrating facts from several datasets (cultivation type, productivity, pesticides applications) integrated crop production systems can be …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantum systems with fractal spectra",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077902000243",
            "Abstract": "We study Hamiltonians with singular spectra of Cantor type with a constant ratio of dissection and show strict connections between the decay properties of the states in the singular subspace and the algebraic number theory. More specifically, we study the decay properties of free n-particle systems and the computability of decaying and non-decaying states in the singular continuous subspace.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:XiSMed-E-HIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Time operators associated to dilations of Markov processes",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-0348-8085-5_2",
            "Abstract": "The original goal of dilation theory is to find a way to study general bounded operators through isometries or unitary operators (see [1] for an excellent treatment of the subject). This is moreover a natural framework to study the question whether a Markov process may arise as a projection of deterministic dynamical system. The latter question is closely related to the long standing problem of the relationship between deterministic laws of dynamics and probabilistic description of physical processes, known as theproblem of irreversibility. ",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Birkhäuser, Basel"
        },
        {
            "Title": "The Use of National Strategic Reference Framework Data in Knowledge Graphs and Data Mining to Identify Red Flags",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/949038",
            "Abstract": "Red Flags in fiscal projects are warning signs that may indicate underlying problems with their implementation. In this paper, we present how National Strategic Reference Framework Open Data can be used to take full advantage of semantic web technologies and data mining techniques to build a knowledge-based system that identifies Red Flags. We collected the data from the Open Data API provided by the Greek Ministry of Economy and Finance. Data modeling consist of two ontologies; the Vocabulary of Fiscal Projects, describing the fiscal projects and the National Strategic Reference Framework Greece Vocabulary, illustrating the Greek National Strategic Reference Framework data. We transformed the data into RDF triples and uploaded them onto an OpenLink Virtuoso Server, so that we could retrieve them via SPARQL queries. Performance indicators were defined to assess the state of the project and Density-Based Spatial Clustering of Applications with Noise,(DBSCAN) was used to identify Red Flags. User’s demands is that rejected projects should raise Red Flags, to avoid project failure and assist the auditor to organize the monitoring process efficiently, by avoiding to examine most of the non-problematic projects. We performed a use case scenario in which an auditor has to examine NSRF projects, approximately 12 months before the end of the programming period. The system retrieved the fiscal information, calculated the performance indicators and identified the Red Flags. The last update of the projects status after the end of the programming period was retrieved and extracted the number of rejected projects, to test whether …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:BJbdYPG6LGMC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Knowledge Networks and Statistical Analysis of Cinematography Linked Data.",
            "Publication year": 2016,
            "Publication url": "https://www.academia.edu/download/48783636/Knowledge_Networks_and_Statistical_Analysis_of_Cinematography_Linked_Data.pdf",
            "Abstract": "In this paper, we describe the methodology and the results of the statistical analysis, data mining, graph analysis and network analytics of cinematography data retrieved from the Linked Open Data cloud. The entire dataset was extracted with SPARQL queries, cleaned with Open Refine, and imported to R for data analysis. The methods applied were Cross Correlation, Mutual Information and Granger Causality. The results are visualized through an application that was created using R language’s library” shinydashboard”, giving the user the opportunity to view and edit the results with a set of widgets. This paper is a study that demonstrates the benefits of using Linked Open Data in Data Science and its methodology can be reused in many other multivariate Linked Open Data subjects.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Irreversibility, probability and complexity",
            "Publication year": 2001,
            "Publication url": "https://elibrary.ru/item.asp?id=767804",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Elsevier Science Publishing Company, Inc."
        },
        {
            "Title": "The Physics of Communication: Proceedings of the XXII Solvay Conference on Physics: Delphi Lamia, Greece, 24-29 November 2001",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=bfRgDQAAQBAJ&oi=fnd&pg=PR5&dq=info:9mV5e2GNPD8J:scholar.google.com&ots=eG8x2qsTpf&sig=rlkVeZ6_cEN2zAVNswIjCiLJlJU",
            "Abstract": "This volume presents the state of the art in the research on new possibilities for communication and computation based on quantum theory and nonlocality, as well as related directions and problems. It discusses challenging issues: decoherence and irreversibility; nonlocality and superluminosity; photonics; quantum information and communication; quantum computation.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:YFjsv_pBGBYC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "In Memorium",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812775382_0008",
            "Abstract": "The following sections are included:  Farewell to Ilya Prigogine   Curiculum Vitae of Ilya Prigogine  Born Nationality Married Children Title Awarded Education Activities Distinguished National Awards Memberships Prizes Honorary Degrees Monographs Publications Since 1964    Farewell to Ilya PrigogineCuriculum Vitae of Ilya Prigogine  Born Nationality Married Children Title Awarded Education Activities Distinguished National Awards Memberships Prizes Honorary Degrees Monographs Publications Since 1964  BornNationalityMarriedChildrenTitleAwardedEducationActivitiesDistinguished National AwardsMembershipsPrizesHonorary DegreesMonographsPublications Since 1964",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Alignment: a collaborative, system aided, interactive ontology matching platform",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-69548-8_22",
            "Abstract": "Ontology matching is a crucial problem in the world of Semantic Web and other distributed, open world applications. Diversity in tools, knowledge, habits, language, interests and usually level of detail may drive in heterogeneity. Thus, many automated applications have been developed, implementing a large variety of matching techniques and similarity measures, with impressive results. However, there are situations where this is not enough and there must be human decision in order to create a link. In this paper we present Alignment, a collaborative, system aided, interactive ontology matching platform. Alignment offers a simple GUI environment for matching two ontologies with aid of configurable similarity algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Communication policies in knowledge networks",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437117309706",
            "Abstract": "Faster knowledge attainment within organizations leads to improved innovation, and therefore competitive advantage. Interventions on the organizational network may be risky or costly or time-demanding. We investigate several communication policies in knowledge networks, which reduce the knowledge attainment time without interventions. We examine the resulting knowledge dynamics for real organizational networks, as well as for artificial networks. More specifically, we investigate the dependence of knowledge dynamics on: (1) the Selection Rule of agents for knowledge acquisition, and (2) the Order of implementation of “Selection” and “Filtering”. Significant decrease of the knowledge attainment time (up to −74%) can be achieved by: (1) selecting agents of both high knowledge level and high knowledge transfer efficiency, and (2) implementing “Selection” after “Filtering” in contrast to the converse, implicitly …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:roLk4NBRz8UC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Analytic perturbation techniques for the Friedrichs model revisited: intermediate operator",
            "Publication year": 2003,
            "Publication url": "https://www.math.auckland.ac.nz/Research/Reports/Series/505.pdf",
            "Abstract": "A techniques of an intermediate operator is developed for the Friedrichs model obtained as a finite-dimensional perturbation",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Univ., Department of Mathematics, School of Mathematical and Information Sciences"
        },
        {
            "Title": "Identification of discrete chaotic maps with singular points",
            "Publication year": 2001,
            "Publication url": "https://www.hindawi.com/journals/ddns/2001/584618/",
            "Abstract": "We investigate the ability of artificial neural networks to reconstruct discrete chaotic maps with singular points. We use as a simple test model the Cusp map. We compare the traditional Multilayer Perceptron, the Chebyshev Neural Network and the Wavelet Neural Network. The numerical scheme for the accurate determination of a singular point is also developed. We show that combining a neural network with the numerical algorithm for the determination of the singular point we are able to accurately approximate discrete chaotic maps with singularities.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:Mojj43d5GZwC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Quantum decay in Liouville space",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/pdf/10.1142/9789812793706#page=194",
            "Abstract": "The recent classification of the spectrum of the Liouville-von Neumann operator in connection with the spectrum of the Hamiltonian allows us to characterize completely the decaying pure states and mixtures. We see that the Liouville space, even in the conventional Hilbert-Schmidt formulation, has new possibilities not reducible to the wave-functions description.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:i2xiXl-TujoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Promoters versus Adversaries of Change: Agent-Based Modeling of Organizational Conflict in Co-Evolving Networks",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/2227-7390/8/12/2235",
            "Abstract": "The social adoption of change is usually hard because in reality, forces opposing the social adoption of change manifest. This situation of organizational conflict corresponds to the case where two competing groups of influential agents (“promoters” versus “adversaries” of change) operate concurrently within the same organizational network. We model and explore the co-evolution of interpersonal ties and attitudes in the presence of conflict, taking into account explicitly the microscopic “agent-to-agent” interactions. In this perspective, we propose a new ties-attitudes co-evolution model where the diffusion of attitudes depends on the weights and the evolution of weights is formulated as a “learning mechanism”(weight updates depend on the previous values of both weights and attitudes). As a result, the co-evolution is intrinsic/endogenous. We simulate representative scenarios of conflict in 4 real organizational networks. In order to formulate structural balance in directed networks, we extended Heider’s definition of balance considering directed triangles. The evolution of balance involves two stages: first, negative links pop up disorderly and destroy balance, but after some time, as new negative links are formed, a “new” balance is re-established. This “new” balance is emerging concurrently with the polarization of attitudes or domination of one attitude. Moreover, same-minded agents are positively linked and different-minded agents are negatively-linked. This macroscopic self-organization of the system is due only to agent-to-agent interactions, involving feedbacks on weight updates at the local microscopic level.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:artPoR2Yc-kC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "On a Binomial Model of Option Pricing",
            "Publication year": 2002,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm2-1-2-14",
            "Abstract": "The conventional models of option pricing are based on the artificial proposition of the market neutrality to the risk, which is equivalent to the assumption that the expected return μ, equals the risk-free return r. However, in real markets μ may significantly differ from r. This may lead to the noticeable difference between model and real values of option prices. We consider here a modification of the Cox-Ross-Rubenstein binomial model that takes into account the dependence of option prices on μ.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ye4kPcJQO24C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Statistical model of network traffic",
            "Publication year": 2004,
            "Publication url": "http://ayss.jinr.ru/publish/Pepan/2004-v35/v-35-4/pdf/v-35-4_05.pdf",
            "Abstract": "In [1Ä3] we systematically applied the nonlinear time series analysis approach [10] to the traffic measurements obtained at the input of the intermediate",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Woodbury, NY: American Institute of Physics, 1993-"
        },
        {
            "Title": "Burridge–Knopoff model and self-similarity",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077998002859",
            "Abstract": "Seismic processes are well known to be self-similar in both spatial and temporal behavior. At the same time, the Burridge–Knopoff (BK) model of earthquake fault dynamics, one of the basic models of theoretical seismicity, does not possess self-similarity. We present an extension of the BK model, based on the introduction of nonlinear terms for the inter-block springs of the BK model, which results in the self-similarity of earth crust elastic properties being accounted for directly. Phase space analysis of the model reveals the behavior of a system of randomly kicked coupled oscillators. The nonlinear stiffness terms cause synchronization of the collective motion and produce stronger seismic events.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:70eg2SAEIzsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Chaos Cryptography: Relation Of Entropy With Message Length and Period",
            "Publication year": 2013,
            "Publication url": "http://www.cmsim.eu/papers_pdf/october_2013_papers/9_CMSIM-Journal_2013_Makris_Antoniou_4_571-581.pdf",
            "Abstract": "Chaos cryptography is implemented by torus automorphisms with strictly positive entropy production. For any given entropy production 0 h> we explicitly construct integer valued automorphisms with entropy () S≥ h h. We identify compatibility conditions between the values of the entropy production and the lengths of the messages in terms of the grid size and we propose constructive ways to encrypt messages of arbitrary length in terms of torus automorphisms with any given desired entropy production. We moreover prove that the restrictions of chaotic maps with the same entropy have the same period for a fixed grid size.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Internet traffic dynamics: local area network study",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077902003582",
            "Abstract": "We applied a nonlinear time series analysis to the traffic measurements, obtained at the input of a medium size local area network. In order to reconstruct the underlying dynamical system, we estimated the correlation length τ and the embedding dimension dE of the traffic time series. In order to extract the regular part from traffic data, we filtered out the high frequency, “noisy” part. The reliable values of τ and dE permitted to apply a layered neural network for the identification and reconstruction of the underlying dynamical system.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Irreversibility, resonances and rigged Hilbert spaces",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44874-8_14",
            "Abstract": "Resonance processes are often considered to be a particular case of irreversible processes both at classical and quantum level. Based upon this idea, in this review we present different approaches to resonances in nonrelativistic Quantum Mechanics as well as the relations among them. In particular, we show how the properties of quantum resonance phenomena cannot be described in the framework of Hilbert space Quantum Mechanics, but instead, we need to enlarge the Hilbert space to the rigged Hilbert space, where important concepts like the Gamow vectors acquire meaning. We discuss the structure and properties of rigged Hilbert spaces and provide examples relevant for the description of resonances under our consideration. We describe types of resonances in nonrelativistic Quantum Mechanics: simple, degenerate and branch cut resonances. We present exactly soluble models in all the cases …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Decay spectrum and decay subspace of normal operators",
            "Publication year": 2001,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-royal-society-of-edinburgh-section-a-mathematics/article/decay-spectrum-and-decay-subspace-of-normal-operators/8DF9D66F6BDADE00C4E31737FA6F9861",
            "Abstract": "Let A be a self-adjoint operator on a Hilbert space. It is well known that A admits a unique decomposition into a direct sum of three self-adjoint operators Ap, Aac and Asc such that there exists an orthonormal basis of eigenvectors for the operator Ap, the operator Aac has purely absolutely continuous spectrum and the operator Asc has purely singular continuous spectrum. We show the existence of a natural further decomposition of the singular continuous component Asc into a direct sum of two self-adjoint operators and . The corresponding subspaces and spectra are called decaying and purely non-decaying singular subspaces and spectra. Similar decompositions are also shown for unitary operators and for general normal operators.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ldfaerwXgEUC",
            "Publisher": "Royal Society of Edinburgh Scotland Foundation"
        },
        {
            "Title": "DBpedia internationalization-a graphical tool for I18n infobox-to-ontology mappings",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/11239158/iswc11pd_submission_36.pdf",
            "Abstract": "During the past two decades, the use of the Web has spread across multiple countries and cultures. While the Semantic Web is already served in many languages, we are still facing challenges concerning its internationalization. The DBpedia project, a community effort to extract structured information from Wikipedia, is already supporting multiple languages. This paper presents a graphical tool for creating internationalized mappings for DBpedia.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time Operators Associated to Dilations",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=HuAFCAAAQBAJ&oi=fnd&pg=PA13&dq=info:9Lr9ZNOj5xgJ:scholar.google.com&ots=mjKzLtLMck&sig=y93B8XEhf-e_8RpaQHkZUVEOATg",
            "Abstract": "The original goal of dilation theory is to find a way to study general bounded operators through isometries or unitary operators (see [1] for an excellent treatment of the subject). This is moreover a natural framework to study the question whether a Markov process may arise as a projection of deterministic dynamical system. The latter question is closely related to the long standing problem of the relationship between deterministic laws of dynamics and probabilistic description of physical processes, known as the problem of irreversibility. In contrast to the usual coarse graining approach B. Misra, I. Prigogine and M. Courbage (2, 3] formulated the problem of irreversibility taking as a funda-mental physical principle the law of entropy increase. In this theory the problem of reconciling the dynamical evolution with the irreversible thermodynamical evolution is viewed in terms of establishing a non-unitary equivalence between the unitary dynamical group and probabilistic Markov processes. More explicitly, let {U) be a unitary group of evolution, which is induced by point dynamics {S} of the phase space, acting on the Hilbert space H spanned by the square integrable phase space functions. One considers now the possibility of relating the group {U) with a Markovian semigroup {Wi) through a non-unitary positivity preserving intertwining transformation A in such a way that",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:Zph67rFs4hoC",
            "Publisher": "Birkhäuser"
        },
        {
            "Title": "Unconventional Models of Computation, UMC’2K: Proceedings of the Second International Conference on Unconventional Models of Computation,(UMC’2K)",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=i0HtBwAAQBAJ&oi=fnd&pg=PA1&dq=info:4hZLAskdKQwJ:scholar.google.com&ots=0nI6FbTYHV&sig=hmk6Wj0ATXWZkmyBz1FXG7X_PgY",
            "Abstract": "This book contains papers presented at the 2nd International Conference on Unconventional Models of Computation (UMCK'2K), which was held at Solvay Institutes, Brussels, Belgium, in December 2000. Computers as we know them may be getting better and cheaper, and doing more for us, but they are still unable to cope with many tasks of practical interest. Nature, though, has been'computing'with molecules and cells for billions of years, and these natural processes form the main motivation for the construction of radically new models of computation, the core theme of the papers in this volume. Unconventional Models of Computation, UMCK'2K covers all major areas of unconventional computation, including quantum computing, DNA-based computation, membrane computing and evolutionary algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Decompositions of spaces of measures",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219025708003014",
            "Abstract": "Let 𝔐 be the Banach space of σ-additive complex-valued measures on an abstract measurable space. We prove that any closed, with respect to absolute continuity norm-closed, linear subspace L of 𝔐 is complemented and describe the unique complement, projection onto L along which has norm 1. Using this fact we prove a decomposition theorem, which includes the Jordan decomposition theorem, the generalized Radon–Nikodým theorem and the decomposition of measures into decaying and non-decaying components as particular cases. We also prove an analog of the Jessen–Wintner purity theorem for our decompositions.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:hMsQuOkrut0C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Time Operator, Innovation and Complexity (Draft)",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=1997336286055613605&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:M3ejUd6NZC8C",
            "Publisher": "John Wiley & Sons"
        },
        {
            "Title": "Relativity and irreversibility",
            "Publication year": 2004,
            "Publication url": "https://www.hindawi.com/journals/ddns/2004/968048/",
            "Abstract": "The Lorentz transformation is extended to the decaying states in a relativistic model of interacting fields. The nonlocal action is defined beyond the Hilbert space. This shows that irreversible extensions of dynamics of Poincaré nonintegrable systems are compatible with relativity.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:u9iWguZQMMsC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Computational Methods and Tools for Modeling and Analysis of Complex Processes",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4471-0313-4_2",
            "Abstract": "This review is devoted to the computational methods and tools for modeling and analysis of various complex processes in physics, medicine, social dynamics and nature. We consider: 1) the multivariate data analysis based on Ω                  n   k                -criteria and artificial neural networks (ANN), 2) the applications of neural networks for the function approximation and for the reconstruction and prediction of chaotic time series, and 3) the use of cellular automata (CA) in pattern recognition and in modeling of complex dynamical systems.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "The resonance spectrum of the cusp map in the space of analytic functions",
            "Publication year": 2002,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1483895",
            "Abstract": "We prove that the Frobenius–Perron operator U of the cusp map F:[−1,1]→[−1,1], F(x)=1−2|x| (which is an approximation of the Poincaré section of the Lorenz attractor) has no analytic eigenfunctions corresponding to eigenvalues different from 0 and 1. We also prove that for any q∈(0,1) the spectrum of U in the Hardy space in the disk {z∈C:|z−q|<1+q} is the union of the segment [0,1] and some finite or countably infinite set of isolated eigenvalues of finite multiplicity.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:TFP_iSt0sucC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Age and time operator of evolutionary processes",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-28675-4_5",
            "Abstract": "The Time Operator and Internal Age are intrinsic features of Entropy producing Innovation Processes. The innovation spaces at each stage are the eigenspaces of the Time Operator. The internal Age is the average innovation time, analogous to lifetime computation. Time Operators were originally introduced for Quantum Systems and highly unstable Dynamical Systems. The goal of this work is to present recent extensions of Time Operator theory to regular Markov Chains and Networks in a unified way and to illustrate the Non-Commutativity of Net Operations like Selection and Filtering in the context of Knowledge Networks.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Experts in knowledge networks: central positioning and intelligent selections",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437118307271",
            "Abstract": "We investigate the dependence of knowledge spread from the position of experts (highly knowledgeable agents) within networks. Moreover, we examine whether the influence of experts is conditioned by the way agents select other agents for knowledge acquisition. In this perspective, we compare the emerging knowledge spread for 5 representative policies for positioning experts, namely: random (at nodes selected with equal probability) and central (at nodes with high centrality: degree, closeness, betweenness, eigen-centrality). Each agent selects an in-neighbor for knowledge acquisition, excluding (filtering out) agents of lower knowledge. As “selections” may be implemented before or after “filtering”, we also compare the conventional wisdom of “Selection” before “Filtering” with the reverse order of “Selection” after “Filtering”. We perform simulations for the 5 policies of positioning experts in 3 representative …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:bKqednn6t2AC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Conditional entropy based retrieval model in patient-carer conversational cases",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8104260/",
            "Abstract": "Bot Assistants can be an efficient and low-cost solution to Patient Care. One important aspect of Assistant Bots is successful Communication and Socialization with the patient. A new Conditional Entropy Retrieval Based model is proposed and also an Attitude Modeling based on Popitz Powers. The algorithm successfully retrieves the suitable answer with a high success rate in the patient-Bot Assistant dialogue interaction. Moreover, the Conditional Entropy Model and the Popitz Attitude Model are combined in order to identify Attitude Changes in Dialogue Interactions between patients and doctors.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:mNrWkgRL2YcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Time operator of Markov chains and mixing times. Applications to financial data",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437114006700",
            "Abstract": "We extend the notion of Time Operator from Kolmogorov Dynamical Systems and Bernoulli processes to Markov processes. The general methodology is presented and illustrated in the simple case of binary processes. We present a method to compute the eigenfunctions of the Time Operator. Internal Ages are related to other characteristic times of Markov chains, namely the Kemeny time, the convergence rate and Goodman’s intrinsic time. We clarified the concept of mixing time by providing analytic formulas for two-state Markov chains. Explicit formulas for mixing times are presented for any two-state regular Markov chain. The mixing time of a Markov chain is determined also by the Time Operator of the Markov chain, within its Age computation. We illustrate these results in terms of two realistic examples: A Markov chain from US GNP data and a Markov chain from Dow Jones closing prices. We propose moreover …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:_kc_bZDykSQC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Quantum Zeno and anti-Zeno effects in the Friedrichs model",
            "Publication year": 2001,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.63.062110",
            "Abstract": "We analyze the short-time behavior of the survival probability in the frame of the Friedrichs model for different form factors. We have shown that this probability is not necessarily analytic at the time origin. The time when the quantum-Zeno effect could be observed is found to be much smaller than usually estimated. We have also studied the anti-Zeno period and have estimated its duration.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:geHnlv5EZngC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Proximity patterns in water buffaloes' activities on pasture",
            "Publication year": 2020,
            "Publication url": "https://aab.copernicus.org/articles/63/19/2020/",
            "Abstract": " Water buffaloes are considered social animals and perform several activities on pasture, such as grazing, moving, standing, ruminating, wallowing, lying, and drinking. However, the way these animals form their social structure in the herd during each one of these activities is still unknown. Literature for water buffaloes has focused mainly on their productive characteristics, impact of grazing on wetlands and behavior during grazing but failed to address the way these animals form their social organization during their activities on pasture. In this study, the tools of social network analysis are used to analyze, detect, and depict the proximity patterns in water buffaloes' activities on pasture and the effect of their age and gender on them. We describe and interpret a series of global and local network indices, and show that the water buffaloes differentiate their social structure in their activities on pasture and that the animals' age and gender affect their interacting patterns, and provide a framework for the application of social network analysis on grazing animals' social behavioral studies. We expect that this framework could be used in future research to provide information regarding the social structure of other kinds of animals that graze in different forage and climatic environments and help animal breeders to improve their management practices.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:5MTHONV0fEkC",
            "Publisher": "Copernicus GmbH"
        },
        {
            "Title": "Extended spectral decompositions of the Renyi map",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077998003099",
            "Abstract": "We present new general methods to obtain spectral decompositions of dynamical systems in rigged Hilbert spaces and investigate the existence of resonances and the completeness of the associated eigenfunctions. The results are illustrated explicitly for the simplest chaotic endomorphism, namely the Renyi map. This paper extends and completes our previous work.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:vDijr-p_gm4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "New technology for the control of narrow-gap semiconductors",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077902003442",
            "Abstract": "We present the results of the year work in the frame of the EU ESPRIT Project 28890 NTCONGS “New technology for the control of narrow-gap semiconductors”. This work has involved both theoretical and experimental study, as well as the development of new specific equipment, towards the creation of a new generation of nanoelectronic devices able to operate at 77 K and even at room temperature.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Identification of discrete chaotic maps with singular points",
            "Publication year": 2001,
            "Publication url": "https://www.hindawi.com/journals/ddns/2001/584618/",
            "Abstract": "We investigate the ability of artificial neural networks to reconstruct discrete chaotic maps with singular points. We use as a simple test model the Cusp map. We compare the traditional Multilayer Perceptron, the Chebyshev Neural Network and the Wavelet Neural Network. The numerical scheme for the accurate determination of a singular point is also developed. We show that combining a neural network with the numerical algorithm for the determination of the singular point we are able to accurately approximate discrete chaotic maps with singularities.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:t6usbXjVLHcC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Time operators, innovations and approximations",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077902003715",
            "Abstract": "We present a new approach to the spectral analysis and prediction of such complex systems for which the time evolution is described by a semigroup of operators. This approach is based on an extended concept of time operator and can be interpreted as a shift representation of dynamical systems. The time operator method includes the multiresolution analysis of wavelets as a particular case but can also be applied for a substantially larger class of dynamical systems. Among the examples where shift representation have been explicitly derived are exact endomorphisms, the diffusion equation, generalized shifts associated with the Haar or Faber–Schauder basis and some classes of stochastic processes.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:uWiczbcajpAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Decay measures on locally compact abelian topological groups",
            "Publication year": 2001,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-royal-society-of-edinburgh-section-a-mathematics/article/decay-measures-on-locally-compact-abelian-topological-groups/2F83B85EAF9190D4CFD650D3209A4283",
            "Abstract": "We show that the Banach space M of regular σ-additive finite Borel complex-valued measures on a non-discrete locally compact Hausdorff topological Abelian group is the direct sum of two linear closed subspaces MD and MND, where MD is the set of measures μ ∈ M whose Fourier transform vanishes at infinity and MND is the set of measures μ ∈ M such that ν ∉ MD for any ν ∈ M {0} absolutely continuous with respect to the variation |μ|. For any corresponding decomposition μ = μD + μND (μD ∈ MD and μND ∈ MND) there exist a Borel set A = A(μ) such that μD is the restriction of μ to A, therefore the measures μD and μND are singular with respect to each other. The measures μD and μND are real if μ is real and positive if μ is positive. In the case of singular continuous measures we have a refinement of Jordan's decomposition theorem. We provide series of examples of different behaviour of convolutions of …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Royal Society of Edinburgh Scotland Foundation"
        },
        {
            "Title": "Unconventional Models of Computation, UMC'2K: Proceedings of the Second International Conference on Unconventional Models of Computation,(UMC'2K)",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=13648440434043450414&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Springer"
        },
        {
            "Title": "New spectral representations of mixing dynamical systems",
            "Publication year": 2011,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9783110883237.2069/html",
            "Abstract": "Recent work of the Brussels-Austin groups has shown that Unstable Mixing Systems have spectral decompositions which include the decay rates and the Lyapunov times in the spectrum. These new spectral decompositions acquire meaning in suitable linear functional spaces beyond the conventional Hilbert space framework and they provide a naturell representation of the evolution of the system. In the case of invertible unstable systems, the extended evolution splits into two distinct semigroups. Irreversibility arises in a natural way as the selection of the semigroup associated with the future observations.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:5qfkUJPXOUwC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "B-1050 Bruxelles, Belgium",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=iBwGCAAAQBAJ&oi=fnd&pg=PA221&dq=info:2bYGm8kGlC8J:scholar.google.com&ots=qGwP2IyHIH&sig=EfFnyRPHSpTg_1yMO2_kfGimzQc",
            "Abstract": "Operational limitations in information processing give rise to realizations of unstable dynamical systems as Markov stochastic processes. Such exact constructions are possible for both conservative and dissipative dynamical systems with a certain kind of instability.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Fractal analysis of high burn-up structures in UO2",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077903001899",
            "Abstract": "The surface structure of UO2 at different cross-section average burn-ups was studied with fractal analysis methods. Micrographs of the surface, subjected to both “as-polished” and “as-etched” treatments, with a magnification of 1250× have been used to this end. It was shown that the fractal properties of the surface strongly depend on the radiation damage of the material. Some evidences for existence of self-organization processes in UO2 at high average burn-ups were obtained.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:D_sINldO8mEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Bringing mathematics to the web of data: the case of the mathematics subject classification",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30284-8_58",
            "Abstract": "The Mathematics Subject Classification (MSC), maintained by the American Mathematical Society’s Mathematical Reviews (MR) and FIZ Karlsruhe’s Zentralblatt für Mathematik (Zbl), is a scheme for classifying publications in mathematics. While it is widely used, its traditional, idiosyncratic conceptualization and representation did not encourage wide reuse on the Web, and it made the scheme hard to maintain. We have reimplemented its current version MSC2010 as a Linked Open Dataset using SKOS, and our focus is concentrated on turning it into the new MSC authority. This paper explains the motivation and details of our design considerations and how we realized them in the implementation, presents use cases, and future applications.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:tzM49s52ZIMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On Computability of Decaying and Nondecaying States in Quantum Systems with Cantor Spectra",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/B:IJTP.0000005957.63539.de",
            "Abstract": "We study Hamiltonians with singular spectra of Cantor type with a constant ratio of dissection. The decay properties of the states in such systems depend on the nature of the dissection rate that can be characterized in terms of the algebraic number theory. We show that in spite of simplicity of the considered model the computational modeling of nondecaying states is in general impossible.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:_xSYboBqXhAC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Unstable relativistic quantum fields: two models",
            "Publication year": 2003,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0305-4470/36/48/013/meta",
            "Abstract": "We present two models of relativistic interactions in quantum mechanics that produce resonances. In both cases, these resonances are described by poles of the analytic continuations of Green functions in terms of the variable energy. We develop the first model in detail and motivate and describe the second one. We compare the common features between these two models. The analysis is made in the context of quantum field theory.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:_Ybze24A_UAC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Christoph Lange1, 2, 3, Patrick Ion4, 5, Anastasia Dimou5, Charalampos Bratsas5",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=0Iq6BQAAQBAJ&oi=fnd&pg=PA458&dq=info:m4m99Pe748YJ:scholar.google.com&ots=_wVPonL8sx&sig=pm9S_s5fokrNl3BTxpoGIISB7ls",
            "Abstract": "The Mathematics Subject Classification (MSC) is a widely used scheme for classifying documents in mathematics by subject. Its traditional, idiosyncratic conceptualization and representation makes the scheme hard to maintain and requires custom implementations of search, query and annotation support. This limits uptake eg in semantic web technologies in general and the creation and exploration of connections between mathematics and related domains (eg science) in particular. This paper presents the new official implementation of the MSC2010 as a Linked Open Dataset, building on SKOS (Simple Knowledge Organization System). We provide a brief overview of the dataset’s structure, its available implementations, and first applications.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:35r97b3x0nAC",
            "Publisher": "Springer"
        },
        {
            "Title": "On the log-normal distribution of network traffic",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278902004311",
            "Abstract": "A detailed analysis of traffic measurements shows that the aggregation of these measurements forms a statistical distribution, which is approximated with high accuracy by the log-normal distribution. The inter-arrival times and packet sizes, contributing to the formation of network traffic, can be considered as independent. Applying the wavelet transform to traffic measurements, we demonstrate the multiplicative character of traffic series. This result confirms that the scheme, developed by Kolmogorov [Dokl. Akad. Nauk SSSR 31 (1941) 99] for the homogeneous fragmentation of grains, applies also to network traffic.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:olpn-zPbct0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Intelligent Agents in Co-Evolving Knowledge Networks",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/950114",
            "Abstract": "We extend the agent-based models for knowledge diffusion in networks, restricted to random mindless interactions and to “frozen”(static) networks, in order to take into account intelligent agents and network co-evolution. Intelligent agents make decisions under bounded rationality. This is the key distinction of intelligent interacting agents compared to mindless colliding molecules, involved in the usual diffusion mechanism resulting from accidental collisions. The co-evolution of link weights and knowledge levels is modeled at the local microscopic level of “agent-to-agent” interaction. Our network co-evolution model is actually a “learning mechanism”, where weight updates depend on the previous values of both weights and knowledge levels. The goal of our work is to explore the impact of (a) the intelligence of the agents, modeled by the selection-decision rule for knowledge acquisition,(b) the innovation rate of the agents,(c) the number of “top innovators” and (d) the network size. We find that rational intelligent agents transform the network into a “centralized world”, reducing the entropy of their selections-decisions for knowledge acquisition. In addition, we find that the average knowledge, as well as the “knowledge inequality”, grow exponentially. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:vDZJ-YLwNdEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Identification and prediction of discrete chaotic maps applying a Chebyshev neural network",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077998003026",
            "Abstract": "A new approach to reconstructing and predicting discrete chaotic maps is developed. It is based on the feed-forward neural network which decomposes the analyzed chaotic map in orthogonal Chebyshev polynomials. We show that the Chebyshev neural network (CNN) significantly exceeds the traditional multi-layer perceptron (MLP) in learning rate and in the accuracy of approximating an unknown map.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Positive dilations of piecewise monotonic Markov maps",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219025704001608",
            "Abstract": "We provide an explicit formula which gives natural extensions of piecewise monotonic Markov maps defined on an interval of the real line. These maps are exact endomorphisms and define chaotic discrete dynamical systems.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:5nxA0vEk-isC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Resonances of the cusp family",
            "Publication year": 2002,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0305-4470/35/12/308/meta",
            "Abstract": "We study a family of chaotic maps with limit cases—the tent map and the cusp map (the cusp family). We discuss the spectral properties of the corresponding Frobenius–Perron operator in different function spaces including spaces of analytical functions and study numerically the eigenvalues and eigenfunctions.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Jump-start in the analytic perturbation procedure for the Friedrichs model",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0305-4470/38/22/006/meta",
            "Abstract": "For the Friedrichs model, obtained as a one-dimensional ε-perturbation {\\cal P} _ {{\\varepsilon}} of the orthogonal sum of the momentum {\\cal P}={\\rm i}\\frac {{\\rm d}}{{\\rm d} x} and a finite Hermitian matrix: P\\oplus A\\longrightarrow {\\cal P} _ {{\\varepsilon}}, the scattering matrix is presented as S ε (p)=[I+ iεM (p)]− 1 [I− iεM (p)]. The rational Nevanlinna-class Krein–Weyl function M is associated with the operator A and has poles at the eigenvalues of A. It is proven that for any eigenvalue α 0 of A there exists an intermediate operator {\\cal P} _ {{0}}^{{\\varepsilon}}, which is constructed as a one-dimensional perturbation {\\cal P}^{{0}} _ {{\\varepsilon}} of the orthogonal sum {\\cal P}\\oplus A^{{\\varepsilon}} _ {{0}} of the momentum and an appropriate one-dimensional operator—a solvable model, which plays the role of an intermediate operator in the scattering problem to the pair ({\\cal P} _ {{\\varepsilon}},{\\cal P}). The scattering …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:Fu2w8maKXqMC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Proximity patterns in water buffaloes’ activities on pasture Proximity patterns in water buffaloes’ activities on pasture Proximity patterns in water buffaloes’ activities on pasture",
            "Publication year": 2020,
            "Publication url": "http://ikee.lib.auth.gr/record/316012",
            "Abstract": "Water buffaloes are considered social animals and perform several activities on pasture, such as grazing, moving, standing, ruminating, wallowing, lying, and drinking. However, the way these animals form their social structure in the herd during each one of these activities is still unknown. Literature for water buffaloes has focused mainly on their productive characteristics, impact of grazing on wetlands and behavior during grazing but failed to address the way these animals form their social organization during their activities on pasture. In this study, the tools of social network analysis are used to analyze, detect, and depict the proximity patterns in water buffaloes’ activities on pasture and the effect of their age and gender on them. We describe and interpret a series of global and local network indices, and show that the water buffaloes differentiate their social structure in their activities on pasture and that the animals …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:nVrZBo8bIpAC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Entropy, age and time operator",
            "Publication year": 2015,
            "Publication url": "https://www.mdpi.com/89768",
            "Abstract": "The time operator and internal age are intrinsic features of entropy producing innovation processes. The innovation spaces at each stage are the eigenspaces of the time operator. The internal age is the average innovation time, analogous to lifetime computation. Time operators were originally introduced for quantum systems and highly unstable dynamical systems. Extending the time operator theory to regular Markov chains allows one to relate internal age with norm distances from equilibrium. The goal of this work is to express the evolution of internal age in terms of Lyapunov functionals constructed from entropies. We selected the Boltzmann–Gibbs–Shannon entropy and more general entropy functions, namely the Tsallis entropies and the Kaniadakis entropies. Moreover, we compare the evolution of the distance of initial distributions from equilibrium to the evolution of the Lyapunov functionals constructed from norms with the evolution of Lyapunov functionals constructed from entropies. It is remarkable that the entropy functionals evolve, violating the second law of thermodynamics, while the norm functionals evolve thermodynamically. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Forecasting Power Output of Photovoltaic Systems Using Linear, Non-Linear and Enhanced Models",
            "Publication year": 2017,
            "Publication url": "http://ikee.lib.auth.gr/record/304656",
            "Abstract": "Accurate power output forecasting is a critical credibility factor for both conventional and renewable modern power systems. Renewable power systems, like photovoltaic (PV) systems, could be severely affected by alternating weather conditions, and this is an important issue relative to accurate fore-casts. In this paper a comparative analysis between modern linear and non-linear methods for energy forecasting is provided. In particular, the Autoregressive Integrated Moving Average (ARIMA) model is used as a linear method and an Artificial Neural Network (ANN) as a non-linear one. Moreover, enhanced models that incorporate, apart from the energy, meteorological variables as explanatory variables in both linear and non-linear models is presented. Preliminary results, through experimentation on real data from a photovoltaic park in Crete, Greece indicate increased forecasting accuracy of the enhanced …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:8xutWZnSdmoC",
            "Publisher": "Springer"
        },
        {
            "Title": "Alignment: a hybrid, interactive and collaborative ontology and entity matching service",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/365966",
            "Abstract": "Ontology matching is an essential problem in the world of Semantic Web and other distributed, open world applications. Heterogeneity occurs as a result of diversity in tools, knowledge, habits, language, interests and usually the level of detail. Automated applications have been developed, implementing diverse aligning techniques and similarity measures, with outstanding performance. However, there are use cases where automated linking fails and there must be involvement of the human factor in order to create, or not create, a link. In this paper we present Alignment, a collaborative, system aided, interactive ontology matching platform. Alignment offers a user-friendly environment for matching two ontologies with the aid of configurable similarity algorithms. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:OR75R8vi5nAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Embedding the torus automorphisms to Hamiltonian flows",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077901000959",
            "Abstract": "We study two Hamiltonian flows, one resulting from the embedding of the torus automorphisms into R 2 and the other restricted on the torus.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Decomposition of singular measures",
            "Publication year": 2000,
            "Publication url": "https://elibrary.ru/item.asp?id=13346648",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Pleiades Publishing, Ltd.(Плеадес Паблишинг, Лтд)"
        },
        {
            "Title": "The Hamiltonian formalism in fluid dynamics",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:TAMP.0000049761.77390.e4",
            "Abstract": "We propose a Hamiltonian approach to fluid mechanics based on the dynamics formulated in terms of Lagrangian variables. The construction of the canonical variables of the fluid elucidates the origin of the Clebsch variables, introduced in the 19th century. The developed formalism permits relating the circulation conservation law (Thompson theorem) to the invariance of the theory under special diffeomorphisms and also establishing new conservation laws. We also discuss the difference between the Eulerian and the Lagrangian descriptions, pointing out the incompleteness of the former. The constructed formalism is also applicable to an ideal plasma. We conclude with several remarks about quantizing the fluid.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Gamov algebras",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077901000893",
            "Abstract": "We introduce the extended algebra of observables associated with the Rigged Fock Space in order to make a new step towards the description of unstable quantum systems. In particular, we study three exactly solvable models in second quantization representation, namely the standard Friedrichs model, the Friedrichs model with virtual transitions and a relativistic model of two interacting fields and provide a mathematical formalism for their description. This is a first step towards a new generalization of the algebra of observables corresponding to the non-factorizable extensions of Liouville evolution.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Towards Linked Data Internationalization",
            "Publication year": 2011,
            "Publication url": "http://ikee.lib.auth.gr/record/220825",
            "Abstract": "The 3rd International Web Science Conference has continued to address the full scope of socio-technical relationships that are engaged in the World Wide Web, based on the notion that understanding the Web involves not only an analysis of its architecture and applications, but also insight into the people, organisations, policies, and economics that are affected by and subsumed within it. This is the first conference of the series to be sponsored by ACM, through the Special Interest Group on Hypertext, Hypermedia and the Web (SIGWEB), and is also supported by the International Communication Association (ICA). The conference is unique in the manner in which it brings multiple disciplines together in creative and critical dialogue.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:fbc8zXXH2BUC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Probabilistic control and collective properties of a system of interacting multiagents",
            "Publication year": 2000,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1291297",
            "Abstract": "The basic ideas of probabilistic control of chaotic dynamics is presented. In this method the strategy is reduced to a stationary probability law for the perturbations that stabilizes the dynamics. Based on this idea we present a model of interacting multiagents in a 2-D domain. The system may develop a dynamically coherent behavior depending on the adjustment of the system parameters.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:j8SEvjWlNXcC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "DBpedia Spotlight Internationalization using the DBpedia in Greek as a Case Study–Realizing the Greek DBpedia Spotlight",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Avraam/publication/271419179_DBpedia_Spotlight_internationalization_using_the_DBpedia_in_Greek_as_a_case_study-realizing_the_Greek_DBpedia_Spotlight/links/5c8b69e1a6fdcc381754341a/DBpedia-Spotlight-internationalization-using-the-DBpedia-in-Greek-as-a-case-study-realizing-the-Greek-DBpedia-Spotlight.pdf",
            "Abstract": "We identify and explore the incompatibility of the application DBpedia Spotlight with languages with non-Latin alphabets such as the Greek language. After exploring the technical issues, we provide a series of solutions. We also present a fully functional realization of the Greek DBpedia Spotlight. Our modifications revealed the modularity and scalability of this powerful tool and its high potential for languages with non-Latin alphabets. These results are especially significant for Linked Data technologies where several incompatibilities and difficulties with such languages are often the case.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:0N-VGjzr574C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Farewell to Ilya Prigogine. Memorial address",
            "Publication year": 2003,
            "Publication url": "https://www.persee.fr/doc/barb_0001-4141_2003_num_14_1_39226",
            "Abstract": "This moment was certain, but not predictable when I joined your group, 21 years ago. Just like atomic transitions that excited you so much. Every week you gathered us in your office to discuss different problems. Those who actively engaged them¬ selves in the issue were the authors of the papers. Self Organized Delegation. You always tried to get the best from people, delib¬ erately ignoring the irrelevant and the destructive, never losing the vision and the goal.After my PhD, I was advised by other senior scientists to stay away from your group because it could be too risky for the career a young researcher to deal with exotic unclear subjects, far from the mainstream. I was desperate, so I decided to get your reaction. Quite unexpectedly you told me:«They are right. Mainstream research is safe, but you should not expect to get results of great significance. Outside the mainstream you may get something really …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:gVv57TyPmFsC",
            "Publisher": "Persée-Portail des revues scientifiques en SHS"
        },
        {
            "Title": "Semantic Web game based learning: An i18n approach with Greek DBpedia",
            "Publication year": 2012,
            "Publication url": "https://openreview.net/pdf?id=SJEsFM-_WH",
            "Abstract": "Recent web advances and progress in technology enhanced pedagogies have outlined the important role of gaming within education. The advent of Semantic Web and Linked Data, as well as, the availability of initiatives and infrastructures like that of DBpedia have facilitated the incorporation of gaming within educational knowledge bases. This paper presents a web game that uses datasets derived from Greek DBpedia. It is consisted of several different quiz types and it is used for educational purposes in native speakers. The application has a preliminary evaluation in primary education settings in north Greece. The evaluation results indicated its potential in the learning process.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Resonances and time operator for the cusp map",
            "Publication year": 2003,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2003CSF....17..445A/abstract",
            "Abstract": "In the present paper we consider the so-called cusp map S:[-1, 1]→[-1, 1], S (x)= 1-2| x|, which is the Poincare section of the Lorentz attractor.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic web game based learning",
            "Publication year": 2012,
            "Publication url": "http://ikee.lib.auth.gr/record/304668",
            "Abstract": "Recent web advances and progress in technology enhanced pedagogies have outlined the important role of gaming within education. The advent of SemanticWeb and Linked Data, as well as, the availability of initiatives and infrastructures like that of DBpedia have facilitated the incorporation of gaming within educational knowledge bases. This paper presents a web game that uses datasets derived from Greek DBpedia. It is consisted of several different quiz types and it is used for educational purposes in native speakers. The application has a preliminary evaluation in primary education settings in north Greece. The evaluation results indicated its potential in the learning process.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ZzlSgRqYykMC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Entropy and network centralities as intelligent tools for the investigation of terrorist organizations",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1310752",
            "Abstract": "In recent years, law enforcement authorities have increasingly used mathematical tools to support criminal investigations, such as those related to terrorism. In this work, two relevant questions are discussed: “How can the different roles of members of a terrorist organization be recognized?” and “are there early signs of impending terrorist acts?” These questions are addressed using the tools of entropy and network theory, more specifically centralities (degree, betweenness, clustering) and their entropies. These tools were applied to data (physical contacts) of four real terrorist networks from different countries. The different roles of the members are clearly recognized from the values of the selected centralities. An early sign of impending terrorist acts is the evolutionary pattern of the values of the entropies of the selected centralities. These results have been confirmed in all four terrorist networks. The conclusion is expected to be useful to law enforcement authorities to identify the roles of the members of terrorist organizations as the members with high centrality and to anticipate when a terrorist attack is imminent, by observing the evolution of the entropies of the centralities.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:uDGL6kOW6j0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Analysis of resources distribution in economics based on entropy",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437101005751",
            "Abstract": "We propose a new approach to the problem of efficient resources distribution in different types of economic systems. We also propose to use entropy as an indicator of the efficiency of resources distribution. Our approach is based on methods of statistical physics in which the states of economic systems are described in terms of the density functions ρ (g, α) of the variable g parametrized by α. The parameter α plays a role of the integral characteristic of the state of the economic system. Having the density function ρ (g, α) we can use the corresponding entropy to evaluate the efficiency of the resources distribution. Our theoretical study have been tested on real data related to the portfolio investment.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:uWQEDVKXjbEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Change agents and internal communications in organizational networks",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437119308039",
            "Abstract": "The adoption of change in organizational networks is conditioned by the engagement of the so-called “change agents” initiating “cascades of change”, as well as by the internal communication among the members of the network. We investigate how the dynamics of the adoption of change is influenced by the engagement policy of the change agents and by the internal communication. In this perspective, we compare central engagements (high degree, high closeness, high betweenness, high eigen-centrality) with random engagement. We also compare three selection rules for communication, namely: selection by randomness, selection by high link weight, and selection by high link weight and degree centrality. The dynamics of change adoption is modeled by generalizing the discrete diffusion equation in order to incorporate both the engagement policies of the change agents and the internal communication rules …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:a3BOlSfXSfwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "The sixth-century plague, Its repeated appearance until 746 AD and the explosion of the Rabaul Volcano",
            "Publication year": 2005,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/BYZS.2005.1/html",
            "Abstract": "The plague of 541–542 ad started in Pelusium, a town in Egypt, and reached Constantinople in 542 ad. The following series summarizes the event and its repeated appearance until 746 ad.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Walter de Gruyter GmbH & Co. KG"
        },
        {
            "Title": "\" Πάντων νους κρατεί\" με ανοικτά δεδομένα: Το ίδρυμα Ανοικτής Γνώσης Ελλάδας στον ελληνικό νου",
            "Publication year": 2013,
            "Publication url": "http://helios-eie.ekt.gr/EIE/bitstream/10442/13586/1/VESKOUKIS%20-%20OKF(GR).pdf",
            "Abstract": "Βασίλειος Βεσκούκης,“‘Πάντων νους κρατεί’με ανοικτά δεδομένα: Το ίδρυμα Ανοικτής Γνώσης Ελλάδας στον ελληνικό νου,” presented at the Διεθνές συνέδριο: Ανοικτή πρόσβαση@ ΕΚΤ: Αναπτύσσοντας κοινές ευρωπαϊκές πολιτικές για την καινοτόμο χρήση της δημόσιας και επιστημονικής πληροφορίας, Εθνικό Κέντρο Τεκμηρίωσης (ΕΚΤ), 16-Oct-2013.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:tKAzc9rXhukC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Chaos Cryptography with prescribed Entropy Production",
            "Publication year": 2015,
            "Publication url": "https://sciforum.net/manuscripts/3263/manuscript.pdf",
            "Abstract": "Chaos was used as a mechanism for Cryptography by Shannon in his classic 1949 paper, without mentioning of course the word chaos. This idea has been extended and realized by Chaotic ie Entropy producing Torus Automorphisms. The corresponding algorithms and the software have been developed for any Torus Automorphism, adapted to be applicable for encryption in real time. We may select and combine in an arbitrary way several chaotic maps, creating in this way an infinite number of keys. Decryption is simply the reverse application of the selected maps. Therefore, the cryptography is effectively symmetric. The novelties of our work are summarized as follows: i) The possibility to design classes of chaotic Torus maps with any desirable Entropy Production. The Torus parameters are computed as functions of the selected Entropy Production. Moreover, we design Torus Automorphisms with integer parameters determined from the Entropy Production, in order to apply the designed Torus Automorphisms to cryptography of images or texts. The general construction is also applied to Torus Automorphisms constructed from the Fibonacci sequence. ii) The Encryption Mechanisms are designed and implemented by selecting and combining the Torus Maps in an arbitrary way. These Encryptions are in fact new classes and examples of MonoBlock Ciphers. iii) The application to content involving text and images.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Topic detection using the DBSCAN-Martingale and the time operator",
            "Publication year": 2017,
            "Publication url": "https://repositori.upf.edu/handle/10230/32762",
            "Abstract": "Topic detection is usually considered as a decision process implemented in some relevant context, for example clustering. In this case, clusters correspond to topics that should be identifed. Density-based clustering, for example, uses only a density level E and a lower bound for the number of points in a cluster. As the density level is hard to be estimated, a stochastic process, called the DBSCANMartingale, is constructed for the combination of several outputs of DBSCAN for various randomly selected values of E in a predefned closed interval [0; Emax] from the uniform distribution. We have observed that most of the clusters are extracted in the interval [0; Emax=2], and moreover in the interval [Emax=2; Emax] the DBSCANMartingale stochastic process is less innovative, i.e. extracts only a few or no clusters. Therefore, non-symmetric skewed distributions are needed to generate density levels for the extraction of all clusters in a fast way. In this work we show that skewed distributions may be used instead of the uniform, so as to extract all clusters as quickly as possible. Experiments on real datasets show that the average innovation time of the DBSCAN-Martingale stochastic process is reduced when skewed distributions are employed, so less time is needed to extract all clusters.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:-FonjvnnhkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experts in Knowledge Networks",
            "Publication year": 2018,
            "Publication url": "http://ikee.lib.auth.gr/record/313946",
            "Abstract": "We investigate the dependence of knowledge spread from the position of experts (highly knowledgeable agents) within networks. Moreover, we examine whether the influence of experts is conditioned by the way agents select other agents for knowledge acquisition. In this perspective, we compare the emerging knowledge spread for 5 representative policies for positioning experts, namely: random (at nodes selected with equal probability) and central (at nodes with high centrality: degree, closeness, betweenness, eigen-centrality). Each agent selects an in-neighbor for knowledge acquisition, excluding (filtering out) agents of lower knowledge. As “selections” may be implemented before or after “filtering”, we also compare the conventional wisdom of “Selection” before “Filtering” with the reverse order of “Selection” after “Filtering”. We perform simulations for the 5 policies of positioning experts in 3 representative …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:lvd772isFD0C",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Probability from chaos",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/qua.10869",
            "Abstract": "Chaos is argued to lie at the origin of probability in nature. This is supported by several results: natural probabilistic processes are components of Markov processes; and Markov processes arise as projections of chaotic dynamics. We also discuss the quantum analogue of the latter. No quantum analogue of the former has yet been found. © 2004 Wiley Periodicals, Inc. Int J Quantum Chem, 2004",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Greek Open Data in the Age of Linked Data",
            "Publication year": 2011,
            "Publication url": "http://ikee.lib.auth.gr/record/220462",
            "Abstract": "The 3rd International Web Science Conference has continued to address the full scope of socio-technical relationships that are engaged in the World Wide Web, based on the notion that understanding the Web involves not only an analysis of its architecture and applications, but also insight into the people, organisations, policies, and economics that are affected by and subsumed within it. This is the first conference of the series to be sponsored by ACM, through the Special Interest Group on Hypertext, Hypermedia and the Web (SIGWEB), and is also supported by the International Communication Association (ICA). The conference is unique in the manner in which it brings multiple disciplines together in creative and critical dialogue.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:Aul-kAQHnToC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Ilya Prigogine and the International Solvay lnstitutes for Physics and Chemistry",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812775382_0001",
            "Abstract": "Please refer to full text.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Complexity: Microscopic and macroscopic aspects-Foreword",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4058086506206472261&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:fFSKOagxvKUC",
            "Publisher": "JOHN WILEY & SONS INC"
        },
        {
            "Title": "Poincare-Hilbert series, PI, and Noetherianity of the enveloping of the RIT algebra",
            "Publication year": 2001,
            "Publication url": "https://pure.qub.ac.uk/en/publications/poincare-hilbert-series-pi-and-noetherianity-of-the-enveloping-of",
            "Abstract": "Poincare-Hilbert series, PI, and Noetherianity of the enveloping of the RIT algebra — Queen's \nUniversity Belfast Skip to main navigation Skip to search Skip to main content Queen's University \nBelfast Logo Help & FAQ Home Profiles Organisations Research output Projects Impact \nDatasets Activities Prizes Press / Media Student theses Facilities Search by expertise, name \nor affiliation Poincare-Hilbert series, PI, and Noetherianity of the enveloping of the RIT algebra \nNatalia Iyudu, IE Antoniou School of Mathematics and Physics Research output: Contribution \nto journal › Article › peer-review 4 Citations (Scopus) Overview Original language English \nPages (from-to) 4183-4196 Number of pages 14 Journal Communications in Algebra Volume \n29 Issue number 9 DOIs https://doi.org/10.1081/AGB-100105995 Publication status Published \n- Jul 2001 ASJC Scopus subject areas Algebra and Number Theory Access to 10.1081/…",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:J-pR_7NvFogC",
            "Publisher": "Taylor and Francis Ltd."
        },
        {
            "Title": "Towards linked data internationalization-realizing the greek dbpedia",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/42895403/98_paper.pdf",
            "Abstract": "This paper describes the realization of the Greek DBpedia as part of the DBpedia Internationalization proccess.“I18n filters” are proposed as pluggable components of the DBpedia Information Extraction Framework, in order to address issues concerning covering more knowledge from non-English Wikipedia’s and International Resource Identifier (IRI) support. Moreover, a new extractor is introduced that uses the Wikipedia Interlanguage Links to connect international DB-pedia’s and transitively to the LOD Cloud. Finally, the paper illustrates the first international project which provides Transparent Content Negotiation (TCN) rules for International Resource Identifier’s (IRI’s) for de-referencing purposes. This work could serve as a guide not only for other multilingual DBpedias, but for publishing linked data in languages based on non-Latin character sets as well.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gamow Vectors in Exactly Solvable Models.",
            "Publication year": 2003,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=00207748&AN=16822241&h=AlOimJcLViXUOjofHH%2FhYBM9KxtYdrOB8fu%2Bm2gRu5jy3AErZROGncxA5s8P6seDdfrHJDkYkkNPJIluwO8kFQ%3D%3D&crl=c",
            "Abstract": "Through two examples: the Friedrichs model and a particular case of central potential scattering, we illustrate the way of constructing Gamow vectors.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The period doubling route to chaos of the electrical conductivity in excited photoconductors",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077901000698",
            "Abstract": "In the present report the generation of sinusoidal signals in a photoconductor subject only to dc excitations is considered. For this purpose the model of an n-type photosensitive semiconductor containing two localized levels in its energy gap is examined. For suitable constant illumination and constant applied electric field the semiconductor is exhibiting periodic or chaotic conductivity, if the two levels are sufficiently closed to each other. As the levels move apart the signal experiences the period doubling route to chaos.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:5ugPr518TE4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "On Serre's Problem for RIT Algebras",
            "Publication year": 2003,
            "Publication url": "https://pure.qub.ac.uk/en/publications/on-serres-problem-for-rit-algebras",
            "Abstract": "Iyudu, N, Antoniou, IE & Wisbauer, R 2003,'On Serre's Problem for RIT Algebras', Communications in Algebra, vol. 31, no. 12, pp. 6037-6050. https://doi. org/10.1081/AGB-120024865",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:epqYDVWIO7EC",
            "Publisher": "Taylor and Francis Ltd."
        },
        {
            "Title": "Integrability and chaos in discrete systems.",
            "Publication year": 2000,
            "Publication url": "https://researchportal.vub.be/en/publications/integrability-and-chaos-in-discrete-systems",
            "Abstract": "Integrability and chaos in discrete systems. — Vrije Universiteit Brussel Skip to main navigation \nSkip to search Skip to main content Vrije Universiteit Brussel Logo Help & FAQ English \nNederlands Home Research Units Profiles Projects Research output Activities Equipment \nPrizes Press / Media Student theses Impacts Search by expertise, name or affiliation Integrability \nand chaos in discrete systems. Franklin Lambert, Ioannis Antoniou Theoretical Physics Vrije \nUniversiteit Brussel Research output: Other contribution 14 Citations (Scopus) Overview \nOriginal language English Publisher Chaos, Solitons and Fractals 11, 1-3, pp. -463. Publication \nstatus Published - 2000 Bibliographical note Chaos, Solitons and Fractals 11, 1-3, pp. 1-463. \nCite this APA Author BIBTEX Harvard Standard RIS Vancouver Lambert, F., & Antoniou, I. \n(2000). Integrability and chaos in discrete systems. Chaos, Solitons and Fractals 11, 1-3, pp. 1-. …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:4X0JR2_MtJMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On a statistical model of network traffic",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168900203005771",
            "Abstract": "A nonlinear analysis of traffic measurements involving a layered neural network (NN) (used for reconstruction of underlying process) has shown that the NN trained on a traffic series reproduces the packet size distribution of real data, which fits the lognormal form. The detailed analysis of the traffic measurements has shown that the reason for appearance of this distribution is a simple aggregation of real data. Applying the principal component analysis, the wavelet filtering, Fourier analysis, and statistical criteria we demonstrated that a few leading components form the main part of network traffic, while residual components play the role of small irregular variations that can be interpreted to be a stochastic noise.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:hCrLmN-GePgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "The art of living in Heraclitus’ philosophy",
            "Publication year": 2014,
            "Publication url": "https://www.pdcnet.org/philinquiry/content/philinquiry_2014_0038_41702_0091_0105",
            "Abstract": "Nehamas’ The art of living is a thorough study of philosophy not only as a academic discipline, but also as a way of life, an art of living. Nehamas considered Socrates as the first to have practiced the art of living during all his life, even when he decided to stay in Athens and accept his death sentence. We shall argue that Philosophy as art of living was moreover the keynote of Heraclitus’ thinking. Heraclitus, a hundred years before Socrates, despite known as the philosopher of change, was involved to a great extent with issues concerning the human condition which was inseparable from cosmology, as it is evident from the surviving fragments of his work. After presenting the key ideas of Nehamas on the art of living in section 2, we summarize Heraclitus recommendations for proper apprehension as statements (H1) to (H17) in section 3, and his recommendations for avoiding misapprehension as statements (H18) to …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:FPJr55Dyh1AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bergsonian time and system maturation",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-4285-8_17",
            "Abstract": "Time plays a strange role in Newtonian physics, and also in ordinary quantum physics. Whereas an object’s position and momentum, and functions of these two, such as energy or angular momentum, are considered to be “observable”, time enters as a “parameter”.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Time operator for diffusion",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077999000521",
            "Abstract": "We extend the concept of time operator for general semigroups and construct a non-self-adjoint time operator for the diffusion equation which is intertwined with the unilateral shift. We obtain the spectral resolution, the age eigenstates and a new shift representation of the solution of the diffusion equation. Based on previous work we obtain similarly a self-adjoint time operator for Relativistic Diffusion.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Optimising the Workflow for Fish Detection in DIDSON (Dual-Frequency IDentification SONar) Data with the Use of Optical Flow and a Genetic Algorithm",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1100348",
            "Abstract": "DIDSON acoustic cameras provide a way to collect temporally dense, high-resolution imaging data, similar to videos. Detection of fish targets on those videos takes place in a manual or semi-automated manner, typically assisted by specialised software. Exploiting the visual nature of the recordings, tools and techniques from the field of computer vision can be applied in order to facilitate the relatively involved workflows. Furthermore, machine learning techniques can be used to minimise user intervention and optimise for specific detection and tracking scenarios. This study explored the feasibility of combining optical flow with a genetic algorithm, with the aim of automating motion detection and optimising target-to-background segmentation (masking) under custom criteria, expressed in terms of the result. A 1000-frame video sequence sample with sparse, smoothly moving targets, reconstructed from a 125 s DIDSON recording, was analysed under two distinct scenarios, and an elementary detection method was used to assess and compare the resulting foreground (target) masks. The results indicate a high sensitivity to motion, as well as to the visual characteristics of targets, with the resulting foreground masks generally capturing fish targets on the majority of frames, potentially with small gaps of undetected targets, lasting for no more than a few frames. Despite the high computational overhead, implementation refinements could increase computational feasibility, while an extension of the algorithms, in order to include the steps of target detection and tracking, could further improve automation and potentially provide an efficient tool for the …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:2tRrZ1ZAMYUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Gamow vectors for barrier wells",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077901000868",
            "Abstract": "We study four examples of Gamow vectors in one-dimensional potential barriers, namely square barriers and delta barriers. We show that resonances appear when the potential has at least two relative maxima and investigate the emergence of double resonances given rise to Gamow–Jordan vectors as well.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Probabilistic density-based estimation of the number of clusters using the DBSCAN-martingale process",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865519300844",
            "Abstract": "Density-based clustering is an effective clustering approach that groups together dense patterns in low- and high-dimensional vectors, especially when the number of clusters is unknown. Such vectors are obtained for example when computer scientists represent unstructured data and then groups them into clusters in an unsupervised way. Another facet of clustering similar artifacts is the detection of densely connected nodes in network structures, where communities of nodes are formulated and need to be identified. To that end, we propose a new DBSCAN algorithm for estimating the number of clusters by optimizing a probabilistic process, namely DBSCAN-Martingale, which involves randomness in the selection of density parameter. We minimize the number of iterations required to extract all clusters by the DBSCAN-Martingale process, by providing an analytic formula. Experiments on spatial, textual and visual …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:yqoGN6RLRZoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A Graph Theoretical Approach to Study the Organization of the Cortical Networks",
            "Publication year": 2013,
            "Publication url": "https://pdfs.semanticscholar.org/0d95/68d04e499d05504c0b1365c2b750f58f7f30.pdf",
            "Abstract": "The two core systems of mathematical processing (subitizing and retrieval) as well as their functionality are already known and published. In this study we have used graph theory to compare the brain network organization of these two core systems in the cortical layer during difficult calculations. We have examined separately all the EEG frequency bands in healthy young individuals and we found that the network organization at rest, as well as during mathematical tasks has the characteristics of Small World Networks for all the bands, which is the optimum organization required for efficient information processing. The different mathematical stimuli provoked changes in the graph parameters of different frequency bands, especially the low frequency bands. More specific, in Delta band the induced network increases it’s local and global efficiency during the transition from subitizing to retrieval system, while results suggest that difficult mathematics provoke networks with higher cliquish organization due to more specific demands. The network of the Theta band follows the same pattern as before, having high nodal and remote organization during difficult mathematics. Also the spatial distribution of the network’s weights revealed more prominent connections in frontoparietal regions, revealing the working memory load due to the engagement of the retrieval system. The cortical networks of the alpha brainwaves were also more efficient, both locally and globally, during difficult mathematics, while the fact that alpha’s network was more dense on the frontparietal regions as well, reveals the engagement of the retrieval system again. Concluding, this study …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:OP4eGU-M3BUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time operator and innovation. applications to financial data",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Teresa-Oliveira-4/publication/306057342_Stochastic_Modeling_Data_Analysis_and_Statistical_Applications/links/57acac3d08ae0932c974a46f/Stochastic-Modeling-Data-Analysis-and-Statistical-Applications.pdf#page=28",
            "Abstract": "The theory of Time Operators has recently been applied into real life problems with the estimation of innovation probabilities. Based on the assumption that the asset values follow Geometric Brownian Motion with constant variance within each trading day, the internal Age of an asset turns out to be a new statistical index, assessing the average innovations. Moreover, the unpredictability of the t-th observation Xt is estimated by the distribution of innovations of Xt. The innovation probabilities and internal Age are estimated using nonlinear stochastic variance models.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:86PQX7AUzd4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-Locality in electrodynamics",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1012646900393",
            "Abstract": "We investigate the applicability of Hegerfeldts arguments on Quantum nonlocality in Quantum Electrodynamics following the work of Prigogine, Pronko, Petrosky, Ordonez and Karpov. We demonstrate the appearance of nonlocal effects at the level of quantum states. We show, however that the expectation values of some observables spread causally. Therefore the measurement of the nonlocality is questionable. We investigate an approach to classical measurement and conclude that the classical measurement cannot detect the “acausal” effects of the non-locality.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Internal time and innovation",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-010-0155-7_20",
            "Abstract": "Consider a physical system that may be observed through time-varying quantities x  t , where t stands for time that may be discrete or continuous. The set x  t  may be a realization of a deterministic system, e.g. a unique solution of a differential equation, or a stochastic process. In the latter case each x  t  is a random variable. We are interested in the global evolution of the system, not particular realizations x  t , from the point of view of innovation. We call the evolution innovative if the dynamics of the system is such that there is a gain of information about the system as time increases. Our purpose is to associate the concept of internal time with such systems. The internal time will reflect the stage of evolution of the system.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Time asymmetric extensions of dynamics with resonances",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=-WG1DwAAQBAJ&oi=fnd&pg=PA37&dq=info:4IwejHPu3SgJ:scholar.google.com&ots=zowwoinhvq&sig=EYLHRyC1cGN7dxTpScNetXqrBaw",
            "Abstract": "Is there a reason for time symmetry breaking at the fundamental level? As the loss of dynamical information due to measurements or approximations is neither a reason nor an explanation, one has to search for the qualitative properties of dynamics which give rise to time asymmetry. Following the pioneering work of Ilya Prigogine and Arno Bohm, one can simply discover the following fact of life: when dynamics (classical or quantum) have resonances due to nonintegrability or instability, there are extensions (of the domain of the evolution operators) of dynamics which are intrinsically irreversible, ie the extended evolution group splits into two distinct semigroups. We shall present selected results of the Brussels-Austin-Thessaloniki groups during the last years.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:P7Ujq4OLJYoC",
            "Publisher": "Philadelphia; Institute of Physics; 1999"
        },
        {
            "Title": "False beliefs in unreliable knowledge networks",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437116308767",
            "Abstract": "The aims of this work are:(1) to extend knowledge dynamics analysis in order to assess the influence of false beliefs and unreliable communication channels,(2) to investigate the impact of selection rule-policy for knowledge acquisition,(3) to investigate the impact of targeted link attacks (“breaks” or “infections”) of certain “healthy” communication channels. We examine the knowledge dynamics analytically, as well as by simulations on both artificial and real organizational knowledge networks. The main findings are:(1) False beliefs have no significant influence on knowledge dynamics, while unreliable communication channels result in non-monotonic knowledge updates (“wild” knowledge fluctuations may appear) and in significant elongation of knowledge attainment. Moreover, false beliefs may emerge during knowledge evolution, due to the presence of unreliable communication channels, even if they were not …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:rO6llkc54NcC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Quantum Interference Processes on One‐Dimensional Arrays",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/1521-3951(200106)225:2%3C317::AID-PSSB317%3E3.0.CO;2-R",
            "Abstract": "The quantum interference properties of simple model systems of arrays of barriers are considered. We discuss the capabilities for realizing new nanodevices based on the constructive interference for coding and decoding signals.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:WqliGbK-hY8C",
            "Publisher": "WILEY‐VCH Verlag Berlin GmbH"
        },
        {
            "Title": "Analyticity of smooth eigenfunctions and spectral analysis of the Gauss map",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1022217410549",
            "Abstract": "We provide a sufficient condition of analyticity of infinitely differentiable eigenfunctions of operators of the form Uf(x)=∫a(x,y)f(b(x,y))μ(dy) acting on functions  $$f:[u,\\user1{v}] \\to \\mathbb{C}$$  (evolution operators of one-dimensional dynamical systems and Markov processes have this form). We estimate from below the region of analyticity of the eigenfunctions and apply these results for studying the spectral properties of the Frobenius–Perron operator of the continuous fraction Gauss map. We prove that any infinitely differentiable eigenfunction f of this Frobenius–Perron operator, corresponding to a non-zero eigenvalue admits a (unique) analytic extension to the set   . Analyzing the spectrum of the Frobenius–Perron operator in spaces of smooth functions, we extend significantly the domain of validity of the Mayer and Röpstorff asymptotic formula for the decay of correlations of the Gauss map.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Educational Semantic Wikis in the Linked Data Age",
            "Publication year": 2011,
            "Publication url": "http://ikee.lib.auth.gr/record/304663",
            "Abstract": "Wikis are nowadays a mature technology and further well established as successful eLearning approaches that promote collaboration, fulfill the requirements of new trends in education and follow the theory of constructivism. Semantic Wikis on the other hand, are not yet thoroughly explored, but differentiate by offering an increased overall added value to the educational procedure and the course management. Their recent integration with the Linked Data cloud exhibits a potential to exceed their usual contribution and to render them into powerful eLearning tools as they expand their potentialities to the newly created educational LOD. Web Science Semantic Wiki constitutes a prime attempt to evaluate this potential and the benefits that Semantic Web and linked data bring in the field of education.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:_OXeSy2IsFwC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Reimplementing the mathematics subject classification (msc) as a linked open dataset",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-31374-5_36",
            "Abstract": "The Mathematics Subject Classification (MSC) is a widely used scheme for classifying documents in mathematics by subject. Its traditional, idiosyncratic conceptualization and representation makes the scheme hard to maintain and requires custom implementations of search, query and annotation support. This limits uptake e.g. in semantic web technologies in general and the creation and exploration of connections between mathematics and related domains (e.g. science) in particular.This paper presents the new official implementation of the MSC2010 as a Linked Open Dataset, building on SKOS (Simple Knowledge Organization System). We provide a brief overview of the dataset’s structure, its available implementations, and first applications.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:fEOibwPWpKIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Geriatric depression symptoms coexisting with cognitive decline: a comparison of classification methodologies",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S174680941500172X",
            "Abstract": "Geriatric depression is a pathological process that causes a great number of symptoms resulting in limited mental and physical functionality. The computation of oscillatory and synchronization patterns in certain brain areas may facilitate the early and robust identification of depressive symptoms. In this study electroencephalographic (EEG) data were recorded from 34 participants suffering from both cognitive impairment and geriatric depression (mean age 69.81) and 32 control subjects (mean age 70.33). Both groups were matched according to their cognitive status. The study aims at evaluating neurophysiological features of elderly participants suffering from depression and neurodegeneration. The current work focuses on the identification of depression symptoms that coexist with cognitive decline, the correlation of the examined neurophysiological features with geriatric depression combined with cognitive …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Greek open data in the age of linked data: A demonstration of lod internationalization",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/67138636/102_paper.pdf",
            "Abstract": "This paper presents the first steps towards a Greek Linked Open Data (LOD) cloud, initially as a collection of exposed interlinked datasets and a Greek dbpedia core hub. It is a joint effort to become part of the wider, global linked data cloud and aims to contribute in the overall cloud informational value. During the project and while forming and enriching the cloud we actually addressed effectively the wider issue of non-Latin language characters both in resource naming and in SPARQL queries. We propose a method to resolve that issue which is applicable to all Languages with Non-Latin characters",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:vbGhcppDl1QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On a kinetic model of the internet traffic",
            "Publication year": 2004,
            "Publication url": "https://www.hindawi.com/journals/ddns/2004/139354/",
            "Abstract": "We present the modification of the Prigogine-Herman kinetic equation related to the network traffic. We discuss a solution of this equation for homogeneous time-independent situations and for the lognormal desired speed distribution function, obtained from the traffic measurements. This solution clearly shows two modes corresponding to individual flow patterns (low concentration mode) and to collective flow patterns (traffic jam mode). For situations with low concentration, there is almost a linear dependence of the information flow versus the concentration and the higher the average speed the lower the concentration at which the optimum flow takes place. When approaching the critical concentration, there are no essential differences in the flow for different average speeds, whereas for the individual flow regions there are dramatic differences.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Non-uniform time operator, chaos and wavelets on the interval",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077998003105",
            "Abstract": "An internal time operator is introduced for exact systems being typical examples of chaos and explicitly constructed for the Renyi map. The complete family of eigenvectors (age eigenfunctions) is explicitly presented. We prove that the time operator can be obtained as the orthogonal projection of the uniform time operator for the baker transformation. We also showed that the eigenspaces of the time operator coincide with the multiresolution analysis corresponding to the Haar wavelet on the unit interval.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "In memory of Ilya Prigogine",
            "Publication year": 2004,
            "Publication url": "https://www.hindawi.com/journals/ddns/2004/513894/",
            "Abstract": "Prigogine’s fundamental contributions to nonequilibrium physics and complexity not only shaped the views of twentieth century science but also opened pathways for the twenty-first century research. The science of complexity emerged as a new paradigm and has caught the attention of numerous scientists all over the world in the last few decades. Prigogine led us to an understanding of the physical conditions underlying the emergence of complex structures and self organization. This is the law of order through fluctuations far from equilibrium. Already a Nobel Laureate, he was one of the first to understand and accept the extreme importance of this new field of studies. He proposed revolutionary ideas about discrete time, space, and the new laws of physics underlying self organization and the interdependence of complex systems. It is never easy to be the first and it is always extremely complicated to change the opinions and established views of scientists, especially in physics. However, he succeeded in doing so, and that is why we all appreciate and admire him. He had a unique scientific vision and intuition, which gave him the force to develop the understanding of issues such as deterministic chaos, discrete time and space, irreversibility and nonintegrability. Prigogine took special care to share his knowledge not only with his students and colleagues, but also with the general public. His scientific results and views have been formulated in brilliant papers and books. Until the very moment he passed away, Ilya Prigogine was working on finding new laws of physics, laws which will provide understanding of complex, living and thinking systems …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Forecasting financial derivative prices",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077998002860",
            "Abstract": "In this paper we consider the problem of forecasting the prices of financial market derivatives. A model of changing the underlying asset prices in the form of general Ito stochastic process is developed. The derivative prices can be obtained from the solution of the reverse Cauchy problem for appropriate parabolic equations on the basis of the reverse Kolmogorov equation. We present here the numerical scheme for solving the reverse Cauchy problem for call option and put option prices based on the implicit finite element difference method.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Integrability and Chaos in Discrete Systems Proceedings of the Brussels Meeting II 2-6 July 1997",
            "Publication year": 2000,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2000CSF....11....1A/abstract",
            "Abstract": "Among the physicists and mathematicians active in the field of\" nonlinear science\" there are three large communities concerned with the study of finite or infinite dimensional dynamical systems. On the one hand there are researchers interested in coherence properties, integrability concepts and solitons. They are concerned with\" integrable\" systems. Physical systems, however, are generally not integrable. Yet, integrable models are important to the physicist as\" building blocks\" around which perturbation theories can be developed. The investigation of discrete integrable systems (nonlinear lattices, difference-difference equations, ultra discrete systems...) has recently become a major research activity within this community. On the other hand there are researchers interested in chaos, decoherence, complexity and irreversibility, which are aspects of nonlinear dynamics associated with the breakdown of integrability …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:Dip1O2bNi0gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nonlinear analysis of network traffic",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077901002533",
            "Abstract": "We applied a nonlinear time series analysis approach to the traffic measurements obtained at the input of a medium size local area network. In order to reconstruct the underlying dynamical system, we estimated the correlation length and the embedding dimension of the traffic series. The estimated embedding dimension, based on the Grassberger–Procaccia algorithm, is high. In order to extract the regular part from traffic data and to decrease the system's dimension, we filtered out a high-frequency, “noisy” part, applying the wavelet filtering. Using the principal components analysis (PCA), we estimated the number of feature components in the traffic series. The reliable values of the correlation length and the embedding dimension provided the application of a layered neural network for identification and reconstruction of the dynamical system. We have found that the trained neural network reproduces the statistical …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The time operator of the cusp map",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077900001703",
            "Abstract": "We construct the natural time operator for the discrete dynamical system generated by the cusp map and give explicitly the age eigenfunctions which provide a shift representation of the evolution allowing for probabilistic prediction. In contradistinction, the construction of the spectral decomposition of the cusp map is not an easy problem.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Elastic neural nets for the traveling salesman problem",
            "Publication year": 2002,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm2-1-2-15",
            "Abstract": "In order to speed up the standard Elastic Neural Net (ENN)[1] and make it robust against local minima problem, we present three variants of the ENN, namely, the Modified ENN, the Double ENN and the Smooth ENN. The efficiency of the new algorithms is demonstrated and compared with some well-known classical algorithms on collections of cities with known optimal tours.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Decoherence and Zeno time in quantum computations",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077902003594",
            "Abstract": "We analyze the short-time behaviour of the survival probability in the frame of the Friedrichs model for different formfactors. We have shown that the probability may not be quadratic for the short times while the quantum Zeno effect (QZE) still exists in this case. We have found that the time when the QZE could be observed is much smaller than usually assumed. We have studied the anti-Zeno era and have estimated its duration. Related decoherence processes are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Social network analysis of sheep grazing different plant functional groups",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/gfs.12398",
            "Abstract": "Social Network Analysis (SNA) is used for the first time to investigate the relations between plant functional groups and social structure of grazing sheep. The research was conducted on a grassland in Crete's island Lefka Ori, Greece during 2016. A flock of 20 sheep of Sfakion race was analysed as a network and the sheep as nodes. The focal sampling technique was applied during four experimental periods of four consecutive days × eight hours/day. The plant species selected by sheep during grazing were categorized into four functional groups (grasses, broad‐leaved forbs, shrubs and trees), and the proximity and conflict relations that were developed among the flock members were recorded. The tools of SNA were defined and interpreted in the sheep flock, and the Visone software is used to calculate the network variables of proximity and conflicts relations of nodes. Correlations between the plant functional …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:3htObqc8RwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ANALyZING THE COMPETITION IN PuBLIC PROCuREMENT PROCEDuRES uSING GRAPH ANALyTICS",
            "Publication year": 2021,
            "Publication url": "https://www.researchgate.net/profile/Brunilda-Subashi/publication/350312802_Conference_proceedings_-_ISBN_978-5-7014-0987-1/data/605b6215299bf17367684bd9/Conference-proceedings.pdf#page=108",
            "Abstract": "The aim of this work was the analysis of the competition in public procurement procedures for a specific group of health goods with network analysis. By using graph analytics, the presented work intends to support the better understanding of the market function. The data were retrieved from the platform “Opentender” for the period 2009–2019 from 33 EU countries and institutions. Graph indicators as network’s density, centrality, entropy and conditional entropy were used to assess the competition on the part of the buyer and the sellers also. Net analysis contributes to the exploration of possible existence of oligopolies at the specific market and focuses on the big buyers’ behavior. The data visualization explains the role that economic operators and hospitals play in the market. This methodology presents for the first time how the oligopsony, the monopsony interacts with the oligopoly, the monopoly or the competition in a specific market sector. Using real data, the whole methodology is presented in order to identify further or lost opportunities for economic operators, or situations in which the public sector should intervene to regulate competition issues. The results revealed heterogeneity in the behavior of contracting authorities and in the behavior of economic operators, which is not proportionally related to the economic value of the products to be supplied. The study of competition, which is the main concern of the present, leads us to a similar conclusion. On the part of sellers, there has been a decrease in weighted entropy in the recent years indicating that companies choose to conclude contracts with less randomness than the contracting …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:F1b5ZUV5XREC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantum Zeno effect",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812704634_0014",
            "Abstract": "No abstract received.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Poincare-Hilbert series, PI, and noetherianity of the enveloping of the RIT algebra",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1081/AGB-100105995",
            "Abstract": "We investigate some properties, such as Poincaré–Hilbert series, growth, Noetherianity of the Relativistic Internal Time (RIT) Lie algebra which appears in non-equilibrium physics and its enveloping algebra U(RIT), using, in particular, the Groebner basis technique.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Steganography Based on Chaotic Torus Automorphisms",
            "Publication year": 2015,
            "Publication url": "http://45.113.122.54/pdfs/ijsimr/v3-i9/8.pdf",
            "Abstract": "Secure transmission of information is one of the big challenges of knowledge society. Steganography is the transmission of secret messages embedded within other covering messages which conceal the existence of underlying messages (steganosis). In cryptography however, the presence of secret messages is known. We develop a new Steganography method based on Chaos, for concealing texts or images embedded within other transmitted images. Chaotic Torus Automorphisms are employed as mathematical randomization mechanisms for: i) the selection of the cover image pixels where the initial message (text or image) is inserted, ii) the encryption of the initial message (text or image). We have developed the software for efficient implementation of the algorithms in real-time.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:rmuvC79q63oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Unsupervised keyword extraction using the GoW model and centrality scores",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-70284-1_26",
            "Abstract": "Nowadays, a large amount of text documents are produced on a daily basis, so we need efficient and effective access to their content. News articles, blogs and technical reports are often lengthy, so the reader needs a quick overview of the underlying content. To that end we present graph-based models for keyword extraction, in order to compare the Bag of Words model with the Graph of Words model in the keyword extraction problem. We compare their performance in two publicly available datasets using the evaluation measures Precision@10, mean Average Precision and Jaccard coefficient. The methods we have selected for comparison are grouped into two main categories. On the one hand, centrality measures on the formulated Graph-of-Words (GoW) are able to rank all words in a document from the most central to the less central, according to their score in the GoW representation. On the other …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:_B80troHkn4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Internationalization of linked data: The case of the greek dbpedia edition",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570826812000030",
            "Abstract": "This paper describes the deployment of the Greek DBpedia and the contribution to the DBpedia information extraction framework with regard to internationalization (I18n) and multilingual support. I18n filters are proposed as pluggable components in order to address issues when extracting knowledge from non-English Wikipedia editions. We report on our strategy for supporting the International Resource Identifier (IRI) and introduce two new extractors to complement the I18n filters. Additionally, the paper discusses the definition of Transparent Content Negotiation (TCN) rules for IRIs to address de-referencing and IRI serialization problems. The aim of this research is to establish best practices (complemented by software) to allow the DBpedia community to easily generate, maintain and properly interlink language-specific DBpedia editions. Furthermore, these best practices can be applied for the publication of …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Coarse graining: lessons from simple examples",
            "Publication year": 2001,
            "Publication url": "https://arxiv.org/abs/physics/0101077",
            "Abstract": "We assess Coarse Graining by studying different partitions of the phase space of the Baker transformation and the periodic torus automorphisms. It turns out that the shape of autocorrelation functions for the Baker transformation is more or less reproduced. However, for certain partitions the decay rates turn out to be irrelevant, even decay may stop in a finite time. For the periodic torus automorphisms, Coarse Graining introduces artificial dumping.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the log-normal distribution of stock market data",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437103008987",
            "Abstract": "We present our recent studies on the development of a statistical model of stock market data. For some stock market data, the statistical distribution of closing prices normalized by the corresponding traded volumes, fits well a log-normal law. For other stocks, the log-normal law is obtained after application of a detrending procedure. Different schemes for the trend determination are considered.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:GnPB-g6toBAC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Quantum Zeno effect for N-level Friedrichs model",
            "Publication year": 2003,
            "Publication url": "https://inis.iaea.org/search/search.aspx?orig_q=RN:35005629",
            "Abstract": "We study the short-time behaviour of the survival probability in the framework of the TV-level Friedrichs model. We show that depending on initial conditions the decay can be considerably slowed down or even stopped. By choosing proper parameters of the system, the Zeno time can also be considerably extended.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:blknAaTinKkC",
            "Publisher": "Joint Institute for Nuclear Research"
        },
        {
            "Title": "Farewell to Ilya Prigogine",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/qua.10881",
            "Abstract": "This moment was certain—but not predict-able—when I joined Professor Prigogine’s group, 21 years ago, just like the atomic transitions that excited you so much. Every week you gathered us in your office to discuss different problems. Those who actively engaged themselves in the issue were credited as the authors of the papers.“Selforganized delegation.” You always tried to get the best from people, deliberately ignoring the irrelevant and the destructive, never losing the vision and the goal.After earning my PhD, I was advised by other senior scientists to stay away from your group, because it could be too risky for the career of a young researcher to deal with exotic unclear subjects, far from the mainstream. I was desperate, so I decided to get your reaction. Quite unexpectedly, you told me,“They are right. Mainstream research is safe, but you should not expect to get results of great significance. Outside the …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Greek open data in the age of linked data: A demonstration of lod internationalization",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/67138636/102_paper.pdf",
            "Abstract": "This paper presents the first steps towards a Greek Linked Open Data (LOD) cloud, initially as a collection of exposed interlinked datasets and a Greek dbpedia core hub. It is a joint effort to become part of the wider, global linked data cloud and aims to contribute in the overall cloud informational value. During the project and while forming and enriching the cloud we actually addressed effectively the wider issue of non-Latin language characters both in resource naming and in SPARQL queries. We propose a method to resolve that issue which is applicable to all Languages with Non-Latin characters",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:URolC5Kub84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling Web Evolution",
            "Publication year": 2010,
            "Publication url": "https://arxiv.org/abs/1001.2778",
            "Abstract": "The Web is the largest human information construct in history transforming our society. How can we understand, measure and model the Web evolution in order to design effective policies and optimize its social benefit? Early measurements of the Internet traffic and the Web graph indicated the scale-free structure of the Web and other Complex Networks. Going a step further Kouroupas, Koutsoupias, Papadimitriou and Sideri (KKPS) presented an economic-inspired model which explains the scale-free behavior as the interaction of Documents, Users and Search engines. The purpose of this paper is to clarify the open issues arising within the KKPS model through analysis and simulations and to highlight future research developments in Web modeling, which is the backbone of Web Science.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "First International Conference on Modern Trends in Computational Physics (MTCP 98), Dubna, 15–20 June 1998",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=3332814645834272112&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gamow vectors for an unstable relativistic quantum field",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S096007790100087X",
            "Abstract": "We study a model of cubic interaction between two scalar fields with a scattering resonance. The resonance manifests as two poles of the analytic continuations of the Green function with respect to energy. The Gamow vectors associated to these resonances acquire meaning in suitable rigged Fock spaces. Finally, we discuss some properties of the S-matrix for unstable fields.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Fiscal Knowledge discovery in Municipalities of Athens and Thessaloniki via Linked Open Data",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7753405/",
            "Abstract": "Data Mining and Knowledge discovery in Databases (KDD) is the process that includes data selection, pre-processing, transformation, data mining, evaluation and interpretation of the solutions from the observed results in order to discover useful knowledge from a collection of data. Semantic web and Open Linked Data can provide a higher level quality in Data Mining tasks using additional and linked information from various sources. There are many data models and different approaches that have been proposed in this area combining different aspects of Open Linked Data and Data Mining processes. OpenBudgets.eu meets this concept by modelling Open Budget data from Municipalities of Europe. This paper presents KDD process using the data model of OpenBudgets.eu in order to extract new knowledge from the budget and transaction data of Municipalities of Athens and Thessaloniki. We explored through …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Studying functional brain networks to understand mathematical thinking: A graph-theoretical approach",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-00846-2_194",
            "Abstract": "Brain function during mathematical thinking is a common concern of scientists from different research fields. The study of functional brain networks extracted from electroencephalographic (EEG) signals using graph theory seems to meet the challenge of neuroscience to understand brain functioning in terms of dynamic flow of information among brain regions. Some studies have found differences between the basic arithmetic operations among brain regions; however, they have not explained the brain function during difficult mathematical tasks and complex mathematical processing. This study investigates the changes of the functional networks’ organization among different mathematical tasks. To this end, EEG data from 10 subjects were recorded during three different tasks, Number Looking which was served as the control situation, Simple Addition which refers to the addition of single-digit numbers and …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:NJ774b8OgUMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Semantic CMS and wikis as platforms for Linked Learning",
            "Publication year": 2012,
            "Publication url": "https://openreview.net/pdf?id=HkNs_ZZubB",
            "Abstract": "Although interoperability has always been a priority in e-learning, conventional Learning Management Systems are mostly geared towards the Standards for Learning Objects exchange and the integration among systems. The contingency for integration with other web applications and data is hardly foreseen. This prevents them, nowadays, from being flexible to adapt to the Linked Data standards emergence and the advent of Semantic Web in general, unless they radically change orientation. In contrast, Wikis, followed by Content Management Systems, proved to be more versatile in complying with the Semantic Web and Linked Data standards. These advancements, together with their modular architecture, turn Wikis and CMSs into a decent choice for modern e-learning solutions. MediaWiki and Drupal were customized and deployed in the Aristotle University of Thessaloniki to assess their potential in exposing the University’s learning resources on the Web of Linked Data, in accordance with the Linked Universities Initiative. On the occasion of these two deployments, a thorough comparison of their platforms’ potentials to function as Learning Management Systems took place and is presented on this paper.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementability of Liouville evolution, Koopman and Banach-Lamperti theorems in classical and quantum dynamics",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1021853716478",
            "Abstract": "We extend the concept of implementability of semigroups of evolution operators associated with dynamical systems to quantum case. We show that such an extension can be properly formulated in terms of Jordan morphisms and isometries on non-commutative L p spaces. We focus our attention on a non-commutative analog of the Banach-Lamperti theorem.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "The information society as a complex system",
            "Publication year": 2000,
            "Publication url": "http://www.jucs.org/jucs_6_3/the_information_society_as/Antoniou_I.pdf",
            "Abstract": "We are all very conscious of living through a revolution—one in which the industrial society is being superseded by the information society. Every day brings new evidence of the breakneck pace of the changes that are currently underway. But while broad awareness may be unavoidable, understanding is not so easy. Both the pace of the revolution and its multi-faceted nature make it difficult to gain a clear perspective. But here the new science of complexity can perhaps help. It provides a coherent theory that is directly applicable to the emerging society, potentially providing new insights and new understanding. This paper examines several facets of the current revolution from a complexity perspective, and suggests that the relationship between the emerging science and the emerging society will be a rich one.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Author reply to``Comments onGeneralized spectral decomposition and intrinsic irreversibility of the Arnold Cat Map'''",
            "Publication year": 2000,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2000CSF....11.1475A/abstract",
            "Abstract": "The impression of incorrectness of the generalized spectral decomposition of the Arnold Cat Map by Pattanayak, Brumer and Wilkie is due to a misprint in formulae (28)-(31)[\\overlineD i were printed as\\overline∆ i]. In our earlier correspondence with Professors Pattanayak, Brumer and Wilkie we pointed out this misprint.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Principal component analysis of network traffic measurements: The® caterpillar-ssa approach",
            "Publication year": 2002,
            "Publication url": "http://www1.jinr.ru/publish/Pepan_letters/panl_4_2004/10_anton.pdf",
            "Abstract": "We applied [3] a nonlinear time series analysis [4] to the traffic measurements obtained at the input of the intermediate-size Local Area Network (LAN). We have demonstrated that nonlinear techniques can be successfully used for a deeper understanding of main features of the traffic data. At the same time, we found that due to a very complicated character of traffic series the traditional algorithms of nonlinear analysis do not give reliable estimations of the analyzed time series. For instance, the GrassbergerÄProcaccia algorithm gives a very high dimension for original traffic measurements. However, after filtering out a high-frequency component, which can be considered as a noise, we obtained a more realistic result for the embedding dimension of the underlying process. This result has been confirmed independently by the Principal Component Analysis (PCA) method [3] in the framework of the® CaterpillarÄ Singular Spectrum Analysis (SSA) approach [1, 2]. The Principal Component Analysis is a well-known technique in multivariate data analysis [5Ä9]. The PCA method consists in applying a linear transformation of the original data",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Rh\\K| i es of С] о тш> иГгГ\\| c/aìt io/n",
            "Publication year": 2003,
            "Publication url": "http://www.ba.infn.it/~pascazio/publications/solvay22.pdf",
            "Abstract": "The quantum Zeno effect has a curious history. It was first understood by von Neumann, in 1932 x: while analyzing the thermodynamic features of quantum ensembles, at page 195 of his book on the Mathematical Foundations of QuantumMechanics (page 366 of the English translation), von Neumann proved that any given state ф of a quantum mechanical system can be\" steered\" into any other state ф of the same Hilbert space, by performing a series of very frequent measurements. If ф and ф coincide (modulo a phase factor), the evolution is\" frozen\" and, in modern language, a quantum Zeno effect takes place. This remarkable observation did not trigger much interest, neither in the mathematical, nor in the physical literature. It took 35 years before Beskow and Nilsson 2 applied the same ideas to a rather concrete physical problem (a particle in a bubble chamber) and wondered whether it is possible to influence …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Age, innovations and time operator of networks",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437115002794",
            "Abstract": "We extend the Time Operator and Age to Network Evolution models. Internal Age formulas and the distribution of innovations are computed for Erdős–Rényi Random Networks, for Markov Networks and Barabási–Albert preferential Attachment Networks. The innovation probabilities are found to be proportional to the quadratic entropy (which coincides with the Tsallis entropy for entropic index q= 2) in all Markov networks, as well as in the linear growth mechanism. The distribution of innovations in the Barabási–Albert model is a new probability distribution of the logarithmic type.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:KxtntwgDAa4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Cellular Automata Modelling and Fractal Analysis of High Burn-up Structures in UO2",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.525.9862&rep=rep1&type=pdf",
            "Abstract": "A new, based on the cellular automata (CA), approach for processing and modelling the structure dynamics of nuclear fuel at different burn-ups is proposed. Some evidences for existence of self-organization processes in the fuel at high burn-ups were established. It was found that the fractal dimension of the surface structures strongly depends on the radiation damage of the material.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The connection between the rigged Hilbert space and the complex scaling approaches for resonances. The Friedrichs model",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077901000820",
            "Abstract": "The rigged Hilbert space approach and the complex scaling method are compared for the Friedrichs model. It is shown that they define the same resonance pole. The choice of the test space for the rigged Hilbert space approach is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Zeno era and non-decaying subspaces for multilevel Friedrichs model",
            "Publication year": 2004,
            "Publication url": "https://arxiv.org/abs/quant-ph/0402210",
            "Abstract": "We study the short-time and medium-time behavior of the survival probability of decaying states in the framework of the -level Friedrichs model. The degenerated and nearly degenerated systems are discussed in detail. We show that in these systems decay can be considerably slowed down or even stopped by appropriate choice of initial conditions. We analyze the behaviour of the multilevel system within the so-called Zeno era. We examine and compare two different definitions of the Zeno time. We demonstrate that the Zeno era can be considerably enlarged by proper choice of the system parameters.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Feynman and Wiener Path Integrals Representations of the Liouville Evolution",
            "Publication year": 2019,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9780429187810-24/feynman-wiener-path-integrals-representations-liouville-evolution-antoniou-smolyanov",
            "Abstract": "We show that the Liouville equation for any Hamiltonian system can be identified with the Schrödinger equation obtained by the Schrödinger-Dirac quantization of some “extended” Hamiltonian system whose phase space is the product of two copies of the initial phase space and hence whose configuration space coincides with the initial phase space. This identification allows us to represent some solutions of the Cauchy problem for the Liouville equation by Feynman path integrals [1] over trajectories in the phase space of the extended Hamiltonian systems.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:eMMeJKvmdy0C",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Robust methods for stock market data analysis",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378437103012330",
            "Abstract": "We consider the problem of extraction of trend and chaotic components from irregular stock market time series. The proposed methods also permit to extract a part of chaotic component, the so-called anomalous term, caused by the transient short-time surges with high amplitudes. This provides more accurate determination of the trend component. The methods are based on the M-evaluation with decision functions of Huber and Tukey type. The iterative numerical schemes for determination of trend and chaotic components are briefly presented, resulting in an acceptable solution within a finite number of iterations. The optimal level for extraction of the chaotic component is determined by a new numerical scheme based on the fractal dimension of the chaotic component of the analyzed series. Forecasting from the realized part of the analyzed series and a priori expert information is also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:Se3iqnhoufwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "The Use of National Strategic Reference Framework Data in Knowledge Graphs and Data Mining to Identify Red Flags. Data 2021, 6, 2",
            "Publication year": 2021,
            "Publication url": "http://ikee.lib.auth.gr/record/326142/files/Bratsas%20et%20al.pdf",
            "Abstract": "Red Flags in fiscal projects are warning signs that may indicate underlying problems with their implementation. In this paper, we present how National Strategic Reference Framework Open Data can be used to take full advantage of semantic web technologies and data mining techniques to build a knowledge-based system that identifies Red Flags. We collected the data from the Open Data API provided by the Greek Ministry of Economy and Finance. Data modeling consist of two ontologies; the Vocabulary of Fiscal Projects, describing the fiscal projects and the National Strategic Reference Framework Greece Vocabulary, illustrating the Greek National Strategic Reference Framework data. We transformed the data into RDF triples and uploaded them onto an OpenLink Virtuoso Server, so that we could retrieve them via SPARQL queries. Performance indicators were defined to assess the state of the project and Density-Based Spatial Clustering of Applications with Noise,(DBSCAN) was used to identify Red Flags. User’s demands is that rejected projects should raise Red Flags, to avoid project failure and assist the auditor to organize the monitoring process efficiently, by avoiding to examine most of the non-problematic projects. We performed a use case scenario in which an auditor has to examine NSRF projects, approximately 12 months before the end of the programming period. The system retrieved the fiscal information, calculated the performance indicators and identified the Red Flags. The last update of the projects status after the end of the programming period was retrieved and extracted the number of rejected projects, to test whether …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:LgRImbQfgY4C",
            "Publisher": "s Note: MDPI stays neu-tral with regard to jurisdictional claims in published maps and institutional affiliations."
        },
        {
            "Title": "Cellular automata study of high burn-up structures",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077903000791",
            "Abstract": "We propose a new approach, based on the cellular automata, for processing and modeling the structure dynamics of UO2 at different cross-section averaged burn-ups. Micrographs of the material surface, subjected to both “as-polished” and “as-etched” treatments, with a magnification of 1250× have been used in our study. It has been shown that this approach provides efficient tools for investigation of the surface structure dynamics both at local and global levels.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Internationalization of linked data: The case of the greek dbpedia edition",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570826812000030",
            "Abstract": "This paper describes the deployment of the Greek DBpedia and the contribution to the DBpedia information extraction framework with regard to internationalization (I18n) and multilingual support. I18n filters are proposed as pluggable components in order to address issues when extracting knowledge from non-English Wikipedia editions. We report on our strategy for supporting the International Resource Identifier (IRI) and introduce two new extractors to complement the I18n filters. Additionally, the paper discusses the definition of Transparent Content Negotiation (TCN) rules for IRIs to address de-referencing and IRI serialization problems. The aim of this research is to establish best practices (complemented by software) to allow the DBpedia community to easily generate, maintain and properly interlink language-specific DBpedia editions. Furthermore, these best practices can be applied for the publication of …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:4TOpqqG69KYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Quantum systems with diagonal singularity",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=cjgltcT5XhEC&oi=fnd&pg=PA299&dq=info:iJwVDN6G4igJ:scholar.google.com&ots=MzeiswhzUO&sig=pJa3qe02VRTbp3SxJAy0DryPQYI",
            "Abstract": "I. Introduction 11. Complete Systems of Commuting Observables and Common Eigenvectors III. Operators with Diagonal Singularity IV. States with Diagonal Singularity V. Operations on States and Observables—Superoperators VI. Time Evolution",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identification of discrete chaotic maps with singular points",
            "Publication year": 2001,
            "Publication url": "https://researchportal.vub.be/en/publications/identification-of-discrete-chaotic-maps-with-singular-points",
            "Abstract": "Identification of discrete chaotic maps with singular points — Vrije Universiteit Brussel Skip to \nmain navigation Skip to search Skip to main content Vrije Universiteit Brussel Logo Help & FAQ \nEnglish Nederlands Home Research Units Profiles Projects Research output Activities \nEquipment Prizes Press / Media Student theses Impacts Search by expertise, name or affiliation \nIdentification of discrete chaotic maps with singular points Ioannis Antoniou Theoretical Physics \nResearch output: Contribution to journal › Article Overview Original language English Journal \nDISCRETE DYNAMICS IN NATURE AND SOCIETY Volume: 6 Issue: 3 Pages: 147-+ \nPublished: 2001 Publication status Published - 2001 Cite this APA Author BIBTEX Harvard \nStandard RIS Vancouver Antoniou, I. (2001). Identification of discrete chaotic maps with singular \npoints. DISCRETE DYNAMICS IN NATURE AND SOCIETY Volume: 6 Issue: 3 Pages: 147…",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:sJsF-0ZLhtgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the torus automorphisms: analytic solution, computability and quantization",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077901000947",
            "Abstract": "The exact solution of the classical torus automorphism, which partial case is Arnold Cat map is obtained and compared with the numerical solution. The torus, considered as the classical phase space admits the quantization in terms of the Weyl pair. The remarkable fact is that quantum map, as the evolution with respect to the discrete time, preserves the Weyl commutation relation. We have obtained also the operator solution of this quantum torus automorphism.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:UHK10RUVsp4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Barashenkov, IV and EV Zemlyanaya, Oscillatory instabilities of gap solitons: a numerical study 126 (2000) 22 Barashenkov, VS, Monte Carlo simulation of ionization and nuclear processes initiated by hadron and ion beams in media 126 (2000) 28 Blaha, P., see Petersen, M. 126 (2000) 294",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=2862460384692358409&hl=en&oi=scholarr",
            "Abstract": "Cao, L., J. Zhu and P. Cinnella, An efficient computational method for simulations of reaction-diffusion processes 126 (2000) 41 Caron, CFR and RM Potvliege, propBG: A program for calculating the intensity and the far-field profile of harmonics emitted by a dilute gas irradiated by an intense Gaussian or Bessel–Gauss laser beam 126 (2000) 269 Carpentier, M., see Lima, PM 126 (2000) 114 Chekanov, NA, VA Rostovtsev, Y. Uwano and SI Vinitsky, GITA− 1: A symbolic computing program for an inverse problem of the Birkhoff–Gustavson normal form expansion 126 (2000) 47",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Harmonic analysis of unstable systems",
            "Publication year": 2002,
            "Publication url": "http://213.230.96.51:8090/files/ebooks/Fizika/Antoniou%20I.%20(ed.)%20Dynamical%20systems%20and%20irreversibility..%20Proc.%20XXI%20Solvay%20congress%20in%20physics%20(Special%20issue%20Adv.Chem.Phys.122,%20Wiley,%202002)(378s).pdf#page=56",
            "Abstract": "A. The Renyi Maps B. The Tent Maps C. The Logistic Map D. The Baker’s Transformations III. Time Operator and Shift Representation of the Evolution A. Time Operator for the Renyi Map B. Time Operator for the Cusp Map Acknowledgments References",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:r_AWSJRzSzQC",
            "Publisher": "JOHN WILEY & SONS LTD"
        },
        {
            "Title": "Complexity: Microscopic and macroscopic aspects: Workshop in Honor of Ilya Prigogine on the occasion of his 85th birthday",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/qua.10882",
            "Abstract": "This special issue contains contributions presented to the workshop “Complexity: Microscopic and Macroscopic Aspects,” in honor of Professor Ilya Prigogine on the occasion of his 85th birthday. The participants were former students and/or collaborators of Ilya Prigogine within the broad spectrum of activities around his ideas. Ilya Prigogine opened the workshop on Tuesday, 9 July 2002, with a review of the milestones that led him from the study of open systems far from equilibrium to the dynamical basis of irreversibility in terms of nonintegrable ala Poincaré systems. The current work is presented in the joint paper with E. Karpov, G. Ordonez, and T. Petrosky.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:HtS1dXgVpQUC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Library linked data: the case of public library of Veroia",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7753403/",
            "Abstract": "We describe the Public Library of Veroia dataset. This dataset was created by transforming the bibliographic records of the Public Library of Veroia catalogue into Linked Open Data. We present the data model that is used, consisting of a mix of well-established vocabularies such as BIBO, RDA, DC, FOAF between others. We developed a new tool for the transformation process which implies simple configuration for the end user and rich data extraction. Silk Link Discovery Framework was used to make connections with other datasets like DBpedia. Finally, we developed a new service for author profiling using enriched information gathered from the Linked Open Data Cloud.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:WZBGuue-350C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A graph theoretical approach to study the organization of the cortical networks during different mathematical tasks",
            "Publication year": 2013,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0071800",
            "Abstract": "The two core systems of mathematical processing (subitizing and retrieval) as well as their functionality are already known and published. In this study we have used graph theory to compare the brain network organization of these two core systems in the cortical layer during difficult calculations. We have examined separately all the EEG frequency bands in healthy young individuals and we found that the network organization at rest, as well as during mathematical tasks has the characteristics of Small World Networks for all the bands, which is the optimum organization required for efficient information processing. The different mathematical stimuli provoked changes in the graph parameters of different frequency bands, especially the low frequency bands. More specific, in Delta band the induced network increases it’s local and global efficiency during the transition from subitizing to retrieval system, while results suggest that difficult mathematics provoke networks with higher cliquish organization due to more specific demands. The network of the Theta band follows the same pattern as before, having high nodal and remote organization during difficult mathematics. Also the spatial distribution of the network’s weights revealed more prominent connections in frontoparietal regions, revealing the working memory load due to the engagement of the retrieval system. The cortical networks of the alpha brainwaves were also more efficient, both locally and globally, during difficult mathematics, while the fact that alpha’s network was more dense on the frontparietal regions as well, reveals the engagement of the retrieval system again. Concluding, this study …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:k_IJM867U9cC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Solitons and chaos",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=oyHrCAAAQBAJ&oi=fnd&pg=PA3&dq=info:KAI9O7L-jUAJ:scholar.google.com&ots=_5hpd_whsK&sig=9Y0RVK__59qPQS9_iLc0M5eYbXY",
            "Abstract": "\" Solitons and Chaos\" is a response to the growing interest in systems exhibiting these two complementary manifestations of nonlinearity. The papers cover a wide range of topics but share common mathematical notions and investigation techniques. An introductory note on eight concepts of integrability has been added as a guide for the uninitiated reader. Both specialists and graduate students will find this update on the state ofthe art useful. Key points: chaos vs. integrability; solitons: theory and applications; dissipative systems; Hamiltonian systems; maps and cascades; direct vs. inverse methods; higher dimensions; Lie groups, Painleve analysis, numerical algorithms; pertubation methods.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Stochastic filtering of digital images of skin micro-structure",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010465599004762",
            "Abstract": "We propose a new filter for images, obtained from optical coherence tomography, based on a stochastic assessment of the chaotic scattering of light by the skin tissue. The algorithms are applicable to smooth images as well as to discontinuous images with sharp changes of intensity. The effectiveness of the algorithms is demonstrated on test examples. The results for images of the human skin micro-structure are presented.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:-_dYPAW6P2MC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Kinetic model of network traffic",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S037843710200585X",
            "Abstract": "We present the first results on the application of the Prigogine–Herman kinetic approach (Kinetic Theory of Vehicular Traffic, American Elsevier Publishing Company, Inc., New York, 1971) to the network traffic. We discuss the solution of the kinetic equation for homogeneous time-independent situations and for the desired speed distribution function, obtained from traffic measurements analysis. For the log-normal desired speed distribution function the solution clearly shows two modes corresponding to individual flow patterns (low-concentration mode) and to collective flow patterns (traffic jam mode). For low-concentration situations we found almost linear dependence of the information flow versus the concentration and that the higher the average speed the lower the concentration at which the optimum flow takes place. When approaching the critical concentration there are no essential differences in the flow for …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:abG-DnoFyZgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "The time operator of wavelets",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077998003129",
            "Abstract": "This paper establishes an interesting new and general connection between the wavelet theory of harmonic analysis and the Time operator theory of statistical physics. In particular, it will be shown that an arbitrary wavelet multiresolution analysis (MRA) defines a Time operator T whose age eigenspaces are the wavelet detail subspaces W n. Extension of this result to the continuous parameter case induces a new notion of continuous wavelet multiresolution analysis. The Time operator T incorporates and exhibits in a natural way all five fundamental properties of a wavelet multiresolution analysis.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Analytic perturbation techniques for the Friedrichs model: Intermediate Operator",
            "Publication year": 2003,
            "Publication url": "https://researchspace.auckland.ac.nz/bitstream/handle/2292/5120/505.pdf?sequence=1&isAllowed=y",
            "Abstract": "A techniques of an intermediate operator is developed for the Friedrichs model obtained as a finite-dimensional perturbation [ {cal P} longrightarrow {cal P}_{_{varepsilon}} = {cal P} + varepsilon A ] of the momentum operator ${cal P} = frac{1}{i},,frac{d}{dx}$, defined by the corresponding operator-extension procedure. This technique permits to observe a creation of the resonance at the given point $k_{_{0}}$ via presenting the Scattering matrix for the above pair as a product of the non-analytic at $left(varepsilon,,kright) = left(0,,k_{_0}right)$ factor $S^{^{varepsilon}}_{_{0}} left(k right) $ which is the Scattering matrix to the pair $ left{{cal P}^{^{varepsilon}}_{_{0}},,{cal P}right}$ of the momentum with a local intermediate operator $ {cal P}^{^{varepsilon}}_{_{0}}$, and an analytic factor $ Sleft({cal P} + varepsilon A,,{cal P}^{^{varepsilon}}_{_{ 0}} right) $ of both variables $left(varepsilon,, kright)$ near the point $left(0,, k_{_0}right)$ which is the Scattering matrix of the pair $left({cal P}_{_{varepsilon}},{cal P}^{^{varepsilon}}_{_{ 0}}right)$. The corresponding representation is valid also for eigenfunctions of the perturbed operator.} vskip",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Department of Mathematics, The University of Auckland, New Zealand"
        },
        {
            "Title": "Examples of Gamow vectors",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077901000856",
            "Abstract": "We present three selected physical examples of Gamow vectors to illustrate their physical significance, namely, central potential scattering, one-dimensional lattice with impurities in electric field (Stark) and a simple model for unstable elementary particles (Friedrichs).",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Creating and using sports linked data",
            "Publication year": 2015,
            "Publication url": "http://ikee.lib.auth.gr/record/294439",
            "Abstract": "Linked data have made significant progress over the last few years and many kinds of datasets are transformed into this format at a highly increasing rate, contributing to the openness, connectivity and re-use of web data. However, this progress is not the case for a popular sport like basketball, at least as far as the raw statistics is concerned. This kind of data contains valuable information that can be used by fans, teams and coaches, statisticians and other scientists. In this work, statistical data from Euroleague are transformed into linked data, thereby filling the relevant gap in the LOD Cloud, while ways of exploitation of them are presented, from fascinating applications for the fans, like the Euroleague Timeline, to cases of complex processing, analysis and visualization of data through software like R.Subject: Veterinary Science",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:u-coK7KVo8oC",
            "Publisher": "CEUR-WS"
        },
        {
            "Title": "Oscillating decay of an unstable system",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/B:IJTP.0000005966.53444.b8",
            "Abstract": "We study the medium-time behavior of the survival probability in the frame of the N-level Friedrichs model. The time evolution of an arbitrary unstable initial state is determined. We show that the survival probability may oscillate significantly during the so-called exponential era. This result explains qualitatively the experimental observations of the NaI decay. The Gamow states for N-level Friedrichs model are constructed. The time evolution in terms of the complex spectral representation including the Gamow states is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Intelligent Agents in Co‑Evolving Knowledge Networks. Mathematics 2021, 9, 103",
            "Publication year": 2021,
            "Publication url": "http://ikee.lib.auth.gr/record/326144/files/Ioannidis%20et%20al.pdf",
            "Abstract": "We extend the agent‑based models for knowledge diffusion in networks, restricted to ran‑dom mindless interactions and to “frozen”(static) networks, in order to take into account intelligent agents and network co‑evolution. Intelligent agents make decisions under bounded rationality. This is the key distinction of intelligent interacting agents compared to mindless colliding molecules, involved in the usual diffusion mechanism resulting from accidental collisions. The co‑evolution of link weights and knowledge levels is modeled at the local microscopic level of “agent‑to‑agent” interaction. Our network co‑evolution model is actually a “learning mechanism”, where weight updates depend on the previ‑ous values of both weights and knowledge levels. The goal of our work is to explore the impact of (a) the intelligence of the agents, modeled by the selection‑decision rule for knowledge acquisition,(b) the innovation rate of the agents,(c) the number of “top innovators” and (d) the network size. We find that rational intelligent agents transform the network into a “centralized world”, reducing the entropy of their selections‑decisions for knowledge acquisition. In addition, we find that the average knowledge, as well as the “knowledge inequality”, grow exponentially.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:Bg7qf7VwUHIC",
            "Publisher": "s Note: MDPI stays neu‑tral with regard to jurisdictional clai‑ms in published maps and institutio‑nal affiliations."
        },
        {
            "Title": "Laws of Nature and Time Symmetry Breaking",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812775382_0003",
            "Abstract": "The following sections are included:  INTRODUCTION: IRREVERSIBLE PROCESSES IN NATURE   LAWS OF CLASSICAL AND QUANTUM MECHANICS   DETERMINISTIC CHAOS: THE BAKER TRANSFORMATION   POINCARÉ INTEGRABILITY   THERMODYNAMIC SYSTEMS   DYNAMICS OF LARGE POINCARÉ SYSTEMS   PARTICLES, FIELDS, AND IRREVERSIBILITY   FROM BEING TO BECOMING   ACKNOWLEDGMENTS   REFERENCES   APPENDIX  INTRODUCTION: IRREVERSIBLE PROCESSES IN NATURELAWS OF CLASSICAL AND QUANTUM MECHANICSDETERMINISTIC CHAOS: THE BAKER TRANSFORMATIONPOINCARÉ INTEGRABILITYTHERMODYNAMIC SYSTEMSDYNAMICS OF LARGE POINCARÉ SYSTEMSPARTICLES, FIELDS, AND IRREVERSIBILITYFROM BEING TO BECOMINGACKNOWLEDGMENTSREFERENCESAPPENDIX",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cryptography with chaos",
            "Publication year": 2012,
            "Publication url": "http://www.cmsim.eu/papers_pdf/january_2013_papers/17_CMSIM_2013_Makris_Antoniou_1_169-178.pdf",
            "Abstract": "We implement Cryptography with Chaos following and extending the original program of Shannon with 3 selected Torus Automorphisms, namely the Baker Map, the Horseshoe Map and the Cat Map. The corresponding algorithms and the software (chaos_cryptography) were developed and applied to the encryption of picture as well as text in real time. The maps and algorithms may be combined as desired, creating keys as complicated as desired. Decryption requires the reverse application of the algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-Sample Stochastic Filtering of OCT Skin Images",
            "Publication year": 2002,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm2-1-2-16",
            "Abstract": "In order to suppress the noise due to chaotic scattering and improve the quality of the optical tomography image (OCT), we propose an improvement of our previous filter. The main idea of the new filter is based on the use of several images obtained by the OCT probing head from the same location on the skin surface. The efficiency of the multi-sample filtering algorithm is demonstrated on test examples and on real OCT images.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "On Serre's problem for RIT algebras",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1081/AGB-120024865",
            "Abstract": "We construct a counterexample to Serre's problem for over a RIT algebra, which is a noncommutative quadratic algebra, given by quadratic relations, more general than the relations of the Weyl algebra and of a universal enveloping of finite dimensional Lie algebra.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Linked Open Lexical Resources for the Greek Language",
            "Publication year": 2016,
            "Publication url": "http://pstorage-zenodo-6467619457.s3.amazonaws.com/14196017/LREC2016WorkshopLDL2016_Proceedings.pdf#page=93",
            "Abstract": "The continuous rise of information technology has led to a remarkable quantity of linguistic data that are accessible on the Web. Linguistic resources are more useful when linked but their distribution on the Web in various or closed formats makes it difficult to interlink with one another. So, they often end up restricted in data” silos”. To overcome this problem Linked Data offers a way of publishing data using Web technologies in order to make feasible the connection of data coming from different sources. This paper presents how Greek WordNet was converted and published using a Resource Description Framework (RDF) model in order to expose as Linked Open Data.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:gKiMpY-AVTkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Financial Time Operator for random walk markets",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077913001690",
            "Abstract": "Based on previous work on non-equilibrium statistical mechanics, and the recent extensions of Time Operators to observations and financial processes, we construct a general Time Operator for non-stationary Bernoulli Processes. The Age and the innovation probabilities are defined and discussed in detail and a formula is presented for the special case of random walks. The formulas reduce the computations to variance estimations. Assuming that a stock market price evolves according to a random walk, we illustrate a financial application. We provide an Age estimator from historical stock market data. As an illustration we compute the Age of Greek financial market during elections and we compare with the Age of another period with less irregular events. The Age of a process is a new statistical index, assessing the average level of innovations during the observation period, resulting from the underlying complexity …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:EkHepimYqZsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Caratheodory and the foundations of thermodynamics and statistical physics",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1015040501205",
            "Abstract": "Constantin Caratheodory offered the first systematic and contradiction free formulation of thermodynamics on the basis of his mathematical work on Pfaff forms. Moreover, his work on measure theory provided the basis for later improved formulations of thermodynamics and physics of continua where extensive variables are measures and intensive variables are densities. Caratheodory was the first to see that measure theory and not topology is the natural tool to understand the difficulties (ergodicity, approach to equilibrium, irreversibility) in the Foundations of Statistical Physics. He gave a measure-theoretic proof of Poincaré's recurrence theorem in 1919. This work paved the way for Birkhoff to identify later ergodicity as metric transitivity and for Koopman and von Neumann to introduce spectral analysis of dynamical systems in Hilbert spaces. Mixing provided an explanation of the approach to equilibrium but …",
            "Abstract entirety": 0,
            "Author pub id": "UMPx3MAAAAAJ:IWHjjKOFINEC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "The Physics of Communication: Proceedings of the XXII Solvay Conference on Physics: Delphi Lamia, Greece, 24-29 November 2001",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=bfRgDQAAQBAJ&oi=fnd&pg=PR5&dq=info:9mV5e2GNPD8J:scholar.google.com&ots=eG8x2qsTre&sig=naYiNKO_1fJsJ_g--2HxOOxcttI",
            "Abstract": "This volume presents the state of the art in the research on new possibilities for communication and computation based on quantum theory and nonlocality, as well as related directions and problems. It discusses challenging issues: decoherence and irreversibility; nonlocality and superluminosity; photonics; quantum information and communication; quantum computation.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:BqipwSGYUEgC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Decay and Computability",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4757-3741-7_1",
            "Abstract": "We study Hamiltonians with singular spectra of Cantor type with a constant ratio of dissection and present strict connections between the decay properties of states and the algebraic number theory as well as the computability of decaying and non decaying states.",
            "Abstract entirety": 1,
            "Author pub id": "UMPx3MAAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Springer, Boston, MA"
        }
    ]
}]