[{
    "name": "Ιωάννης Ζάννος ",
    "romanize name": "Ioannis Zannos ",
    "School-Department": "Τεχνών Ήχου και Εικόνας",
    "University": "ionio",
    "Rank": "Καθηγητής",
    "Apella_id": 11497,
    "Scholar name": "Iannis Zannos",
    "Scholar id": "I-UWrxUAAAAJ",
    "Affiliation": "Professor of Computer Music, Ionian University",
    "Citedby": 112,
    "Interests": [
        "Computer Music",
        "Media Art",
        "Interactive Art"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=I-UWrxUAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Tangibility, presence, materiality, reality in artistic creation with digital technology",
            "Publication year": 2014,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01085958/",
            "Abstract": "The democratization of Computer Arts and Computer Music has, due to dematerialization (virtualization) consequence of digital technologies, considerably widened the boundaries of creativity. As we are now entering a second phase that has been labeled “post-digital”, we are called to reconcile this openness with notions such as embodiment, presence, enaction and tangibility. These notions are in our view inherently linked to creativity. Here we outline some approaches to this problem under development within the “European Art-Science-Technology Network” (EASTN). Several areas of artistic creation are represented (Music, Animation, Multi-sensory Arts, Architecture, Fine Arts, Graphic communication, etc.). A main objective of this network is to establish common grounds through collaborative reflection and work on the above notions, using the concept of tangibility as a focal point. In this paper we describe several different approaches to the tangibility, in relation to concepts such as reality, materiality, objectivity, presence, concreteness, etc. and their antonyms. Our objective is to open a debate on tangibility, in the belief that it has a strong unifying potential but is also at the same time presents challenging and difficult to define. Here we present some initial thoughts on this topic in a first effort to bring together the approaches that arise from the different practices and projects developed within the partner institutions involved in the EASTN network.",
            "Abstract entirety": 1,
            "Author pub id": "I-UWrxUAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CREATE 2003 Studio Report",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/31800017/03_15_CREATE2003StudioReport.pdf",
            "Abstract": "The Center for Research in Electronic Art Technology (CREATE) is situated within the Department of Music at the University of California, Santa Barbara (UCSB). JoAnn Kuchera-Morin founded CREATE in 1986 and serves as its director. The senior staff consists of Curtis Roads, Ioannis Zannos, and Stephen T. Pope. This studio report surveys the main activities at CREATE in the period from 2001 through 2003. The presentation will include numerous audio and visual examples of our recent output.",
            "Abstract entirety": 1,
            "Author pub id": "I-UWrxUAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An interactive windscape",
            "Publication year": 2012,
            "Publication url": "https://www.ingentaconnect.com/content/intellect/ta/2012/00000009/f0020002/art00010",
            "Abstract": "The main object of this project is how it can become possible to sense an invisible element such as the air. An installation will be created that will aim to provide a sensorial way of dealing with the air and the wind – that is air in motion – with the help of a computer-assisted environment. The objective is to engage the spectator in the navigation of semantic and sensual space that has its own quasi-mythical structure. The attention is focused on the cognition dimension of the human body and senses and the enlargement of perception through the application of new technologies. The wind is a highly abstract phenomenon, with many physical and metaphysical aspects and is one of the basic elements of the physical universe. At the same time, the wind has an enormous impact on our lives, which we perceive, visually and acoustically only through its effects. That is why it has provided material for mythology and art …",
            "Abstract entirety": 0,
            "Author pub id": "I-UWrxUAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Intellect"
        },
        {
            "Title": "Programming in SuperCollider",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ar34DwAAQBAJ&oi=fnd&pg=PA127&dq=info:qIs-2cId7m8J:scholar.google.com&ots=5UeocgeoD0&sig=yA7U-dtTMuKtT5v1KxuD8S2PMzk",
            "Abstract": "This chapter provides an introduction to the SuperCollider programming language from a more technical viewpoint than David Cottle's beginner's tutorial (chapter 1). Some material presented there and elsewhere in this book is also covered here, but in a more methodical and exhaustive manner. Although I try to convey programming skills without presupposing any previous knowledge of programming languages and compiler technology, some of the more advanced programming concepts in this chapter can take a little getting used to. The explanations provided here aim to be complete within the space allowed, but readers new to object-oriented programming may wish to seek out a good general introductory text to accompany their explorations (< http://en. wikipedia. org/wiki/Object-oriented_programming> isn't bad!). Musicians new to computer music may prefer to start earlier in the book and return here only once they have acquired some basic familiarity with the language; for experienced computer musicians new to SuperCollider, or experienced programmers new to audio, this chapter may be the preferred entry route. For everyone, it should provide a useful reference on the SuperCollider language. Mechanisms underlying the interpretation and execution of programs and the programming concepts of SuperCollider will be explained. This will serve as a basis for understanding how to write and debug effectively in SuperCollider. We will consider the following questions:",
            "Abstract entirety": 1,
            "Author pub id": "I-UWrxUAAAAJ:UeHWp8X0CEIC",
            "Publisher": "MIT Press"
        },
        {
            "Title": "The Role of Tangible Interaction in Children’s Cognitive Development through Music Composition and Performance",
            "Publication year": 2018,
            "Publication url": "https://proa.ua.pt/index.php/musichildren/article/view/1231",
            "Abstract": "Tangible user interfaces (TUIs) empower artists, boost their creative expression and enhance their performing art. However, most of them are designed to work with a set of rules, many of which require advanced skills and target users above a certain age. Here we present a comparative and quantitative study of using TUIs as an alternative teaching tool in experimenting with and creating soundscapes with children. We describe an informal interactive workshop involving schoolchildren. We focus on the development of playful uses of technology to help children empirically understand basic techniques of audio feature extraction. We promote tangible interaction as an alternative learning method in the creation of synthetic soundscape based on sounds recorded in a natural outdoor environment as main sources of sound. We investigate how schoolchildren perceive natural sources of sound and explore practices that reuse prerecorded material through a tangible interactive controller. We discuss the potential benefits of using TUIs as an alternative empirical method for tangible learning and interaction design, and its impact on encouraging and motivating creativity in children. We summarize our findings and review children’s behavioural indicators of engagement and enjoyment in order to provide insight to the design of TUIs based on user experience.",
            "Abstract entirety": 1,
            "Author pub id": "I-UWrxUAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-Time Control of Greek Chant Synthesis",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03013690/",
            "Abstract": "This paper we report on an interdisciplinary project for modeling Greek chant with real-time vocal synthesis. Building on previous research, we employ a hybrid musical instrument: Phonodeon (Georgaki et al. 2005), consisting of a MIDI-accordeon coupled to a real-time algorithmic interaction and vocal synthesis engine. The synthesis is based on data provided by the AOIDOS program developed in the Department of the Computer science of the University of Athens, investigating Greek liturgical chant compared to bel canto singing. Phonodeon controls expressive vocal synthesis models based on formant synthesis and concatenated filtered samples. Its bellows serve as hardware control device that is physically analogous to the human breathing mechanism [georgaki, 1998a], while the buttons of the right hand can serve multiple functions. On the level of pitch structure, this paper focuses on a particular aspect of control, namely that of playing in the traditional non-tempered and flexible interval structure of Greek modes (ήχοι: echoi) while using the 12-semitone piano-type keyboard of the left hand. This enables the musical exploration of the relationship between the spectral structure of the vocal timbre of Greek chant and characteristic intervals occuring in the modal structure of the chant. To implement that, we developed techniques for superimposing interval patterns of the modes on the keyboard of the phonodeon. The work is the first comprehensive interactive model of antique, medieval and modern near-eastern tunings. The techniques developed can be combined with techniques for other control aspects, such as timbre and vocal expression …",
            "Abstract entirety": 0,
            "Author pub id": "I-UWrxUAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms and language concepts in coded art",
            "Publication year": 2011,
            "Publication url": "https://www.ingentaconnect.com/content/intellect/ta/2012/00000009/f0020002/art00022",
            "Abstract": "The present article reports several applied experiments in the generation of aesthetic forms from algorithms and data. In these experiments algorithms and data are the driving morphogenetic force to such an extent that the role of the human creator must be reexamined case-by-case. Artists that program the graphics or sound generating algorithms may in turn be said to be programmed perceptually by the resulting artworks, in the sense that they must adapt their perception in a conscious or involuntary effort to detect or project meaning in their form. While forms generated by algorithms or data are to a large extent unpredictable, an intimate relationship between programmer, performer/listener/viewer and the piece is created through instinctive, empirical familiarity with the tools and the creative process, which is afforded by the immediate and highly interactive nature of the frameworks employed. A simple iterative …",
            "Abstract entirety": 0,
            "Author pub id": "I-UWrxUAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Intellect"
        },
        {
            "Title": "Multi-Platform Development of Audiovisual and Kinetic Installations.",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/49031771/Database_and_Mapping_Design_for_Audiovis20160922-30750-1xyhmno.pdf#page=279",
            "Abstract": "In this paper, we describe the development of multi-platform tools for Audiovisual and Kinetic installations. These involve the connection of three development environments: Python, SuperCollider and Processing, in order to drive kinetic art installations and to combine these with digital synthesis of sound and image in real time. By connecting these three platforms via the OSC protocol, we enable the control in real time of analog physical media (a device that draws figures on sand), sound synthesis and image synthesis. We worked on the development of algorithms for drawing figures and synthesizing images and sound on all three platforms and experimented with various mechanisms for coordinating synthesis and rendering in different media. Several problems were addressed: How to coordinate the timing between different platforms? What configuration to use? Clientserver (who is the client who the server?), equal partners, mixed configurations. A library was developed in SuperCollider to enable the packaging of algorithms into modules with automatic generation of GUI from specifications, and the saving of configurations of modules into session files as scripts in SuperCollider code. The application of this library as a framework for both driving graphic synthesis in Processing and receiving control data from it resulted in an environment for experimentation that is also being used successfully in teaching interactive audiovisual media.",
            "Abstract entirety": 1,
            "Author pub id": "I-UWrxUAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tangibility and Low-Level Live Coding",
            "Publication year": 2014,
            "Publication url": "http://speech.di.uoa.gr/ICMC-SMC-2014/images/VOL_1/0440.pdf",
            "Abstract": "Current advances in digital fabrication are accompanied by efforts to bring about increased facility in the fabrication of digital circuits. In this context, tangibility can apply to the intimate contact with objects as programmable entities forming part of the human-material loop in the sense of physical computing. In this paper, we explore the possibilities of making music with very simple circuits, using an equally minimal interface for live interaction with the hardware.Our aim is to find new ways for experiencing the behavior of circuits and for navigating inside the data space of generative algorithms with musical devices by using minimal interfaces, while involving both human and machine in the perception of the musical output. In our experiment we have focused on the lowest level of the machine language [1], that of manipulating bits in real-time. Furthermore, we attempt to tighten the loop between human and machine by introducing a machine listening component which processes the output of the human-machine interaction. This splits the perceptual feedback loop into a human and a machine part, and makes the final output a joint outcome of both.",
            "Abstract entirety": 1,
            "Author pub id": "I-UWrxUAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gestus: teaching soundscape composition and performance with a tangible interface.",
            "Publication year": 2017,
            "Publication url": "https://www.academia.edu/download/53475466/NIME2017_Paper0064.pdf",
            "Abstract": "Tangible user interfaces empower artists, boost their creative expression and enhance performing art. However, most of them are designed to work with a set of rules, many of which require advanced skills and target users above a certain age. Here we present a comparative and quantitative study of using TUIs as an alternative teaching tool in experimenting with and creating soundscapes with children. We describe an informal interactive workshop involving schoolchildren. We focus on the development of playful uses of technology to help children empirically understand audio feature extraction basic techniques. We promote tangible interaction as an alternative learning method in the creation of synthetic soundscape based on sounds recorded in a natural outdoor environment as main sources of sound. We investigate how schoolchildren perceive natural sources of sound and explore practices that reuse prerecorded material through a tangible interactive controller. We discuss the potential benefits of using TUIs as an alternative empirical method for tangible learning and interaction design, and its impact on encouraging and motivating creativity in children. We summarize our findings and review children’s biehavioural indicators of engagement and enjoyment in order to provide insight to the design of TUIs based on user experience.",
            "Abstract entirety": 1,
            "Author pub id": "I-UWrxUAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        }
    ]
}]