[{
    "name": "Ιωάννης Καραγιάννης",
    "romanize name": "Ioannis Karagiannis",
    "School-Department": "Μηχ. Η/Υ & Πληροφορικής",
    "University": "upatras",
    "Rank": " Καθηγητής",
    "Apella_id": 18311,
    "Scholar name": "Ioannis Caragiannis",
    "Scholar id": "FSIQi4IAAAAJ",
    "Affiliation": "Professor, Aarhus University",
    "Citedby": 3699,
    "Interests": [
        "Theoretical Computer Science",
        "Algorithms",
        "Artificial Intelligence",
        "Algorithmic Game Theory",
        "Computational Social Choice"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=FSIQi4IAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Impartial selection with prior information",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2102.09002",
            "Abstract": "We study the problem of {\\em impartial selection}, a topic that lies at the intersection of computational social choice and mechanism design. The goal is to select the most popular individual among a set of community members. The input can be modeled as a directed graph, where each node represents an individual, and a directed edge indicates nomination or approval of a community member to another. An {\\em impartial mechanism} is robust to potential selfish behavior of the individuals and provides appropriate incentives to voters to report their true preferences by ensuring that the chance of a node to become a winner does not depend on its outgoing edges. The goal is to design impartial mechanisms that select a node with an in-degree that is as close as possible to the highest in-degree. We measure the efficiency of such a mechanism by the difference of these in-degrees, known as its {\\em additive} approximation. In particular, we study the extent to which prior information on voters' preferences could be useful in the design of efficient deterministic impartial selection mechanisms with good additive approximation guarantees. We consider three models of prior information, which we call the {\\em opinion poll}, the {\\em a prior popularity}, and the {\\em uniform} model. We analyze the performance of a natural selection mechanism that we call {\\em approval voting with default} (AVD) and show that it achieves a  additive guarantee for opinion poll and a  for a priori popularity inputs, where  is the number of individuals. We consider this polylogarithmic bound as our main technical contribution. We complement this last result by …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:anf4URPfarAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Communication in wireless networks with directional antennas",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1378533.1378592",
            "Abstract": "We study the problem of maintaining connectivity in a wireless network where the network nodes are equipped with directional antennas. Nodes correspond to points on the plane and each uses a directional antenna modeled by a sector with a given angle and radius. The connectivity problem is to decide whether or not it is possible to orient the antennas so that the directed graph induced by the node transmissions is strongly connected. We present algorithms for simple polynomial-time-solvable cases of the problem, show that the problem is NP-complete in the -dimensional case when the sector angle is small, and present algorithms that approximate the minimum radius to achieve connectivity for sectors with a given angle. We also discuss several extensions to related problems. To the best of our knowledge, the problem has not been studied before in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scheduling to maximize participation",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397508003502",
            "Abstract": "We study a problem of scheduling client requests to servers. Each client has a particular latency requirement at each server and may choose either to be assigned to some server in order to get serviced provided that her latency requirement is met, or not to participate in the assignment at all. From a global perspective, in order to optimize the performance of such a system, one would aim to maximize the number of clients that participate in the assignment. However, clients may behave selfishly in the sense that, each of them simply aims to participate in an assignment and get serviced by some server where her latency requirement is met with no regard to overall system performance. We model this selfish behavior as a strategic game, show how to compute pure Nash equilibria efficiently, and assess the impact of selfishness on system performance. We also show that the problem of optimizing performance is …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Tight approximation bounds for greedy frugal coverage algorithms",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21204-8_22",
            "Abstract": "We consider the frugal coverage problem, an interesting variation of set cover defined as follows. Instances of the problem consist of a universe of elements and a collection of sets over these elements; the objective is to compute a subcollection of sets so that the number of elements it covers plus the number of sets not chosen is maximized. The problem was introduced and studied by Huang and Svitkina [7] due to its connections to the donation center location problem. We prove that the greedy algorithm has approximation ratio at least 0.782, improving a previous bound of 0.731 in [7]. We also present a further improvement that is obtained by adding a simple corrective phase at the end of the execution of the greedy algorithm. The approximation ratio achieved in this way is at least 0.806. Our analysis is based on the use of linear programs which capture the behavior of the algorithms in worst-case …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "How bad is selfish voting?",
            "Publication year": 2013,
            "Publication url": "https://www.aaai.org/ocs/index.php/AAAI/AAAI13/paper/viewPaper/6433",
            "Abstract": "It is well known that strategic behavior in elections is essentially unavoidable; we therefore ask: how bad can the rational outcome be? We answer this question via the notion of the price of anarchy, using the scores of alternatives as a proxy for their quality and bounding the ratio between the score of the optimal alternative and the score of the winning alternative in Nash equilibrium. Specifically, we are interested in Nash equilibria that are obtained via sequences of rational strategic moves. Focusing on three common voting rules—plurality, veto, and Borda—we provide very positive results for plurality and very negative results for Borda, and place veto in the middle of this spectrum.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bounding the inefficiency of compromise in opinion formation",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1702.07309",
            "Abstract": "Social networks on the Internet have seen an enormous growth recently and play a crucial role in different aspects of today's life. They have facilitated information dissemination in ways that have been beneficial for their users but they are often used strategically in order to spread information that only serves the objectives of particular users. These properties have inspired a revision of classical opinion formation models from sociology using game-theoretic notions and tools. We follow the same modeling approach, focusing on scenarios where the opinion expressed by each user is a compromise between her internal belief and the opinions of a small number of neighbors among her social acquaintances. We formulate simple games that capture this behavior and quantify the inefficiency of equilibria using the well-known notion of the price of anarchy. Our results indicate that compromise comes at a cost that strongly depends on the neighborhood size.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tight bounds for selfish and greedy load balancing",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-010-9427-8",
            "Abstract": "We study the load balancing problem in the context of a set of clients each wishing to run a job on a server selected among a subset of permissible servers for the particular client. We consider two different scenarios. In selfish load balancing, each client is selfish in the sense that it chooses, among its permissible servers, to run its job on the server having the smallest latency given the assignments of the jobs of other clients to servers. In online load balancing, clients appear online and, when a client appears, it has to make an irrevocable decision and assign its job to one of its permissible servers. Here, we assume that the clients aim to optimize some global criterion but in an online fashion. A natural local optimization criterion that can be used by each client when making its decision is to assign its job to that server that gives the minimum increase of the global objective. This gives rise to greedy online …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Energy-efficient wireless network design",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-005-1204-8",
            "Abstract": "A crucial issue in wireless networks is to  support efficiently communication patterns that are typical in traditional (wired) networks. These include broadcasting, multicasting, and gossiping (all-to-all communication). In this work we study such problems in static ad hoc networks. Since, in ad hoc networks, energy is a scarce resource, the important engineering question to be solved is to guarantee a desired communication pattern minimizing the total energy consumption. Motivated by this question, we study a series of wireless network design problems and present new approximation algorithms and inapproximability results.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Fractional path coloring on bounded degree trees",
            "Publication year": 2001,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00429854/document",
            "Abstract": "This paper addresses the natural relaxation of the path coloring problem, in which one needs to color directed paths on a symmetric directed graph with a minimum number of colors, in such a way that paths using the same arc of the graph have different colors. This classic combinatorial problem finds applications in the minimization of the number of wavelengths in wavelength division multiplexing (wdm) all-optical networks.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An almost ideal coordination mechanism for unrelated machine scheduling",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-018-9857-2",
            "Abstract": "Coordination mechanisms aim to mitigate the impact of selfishness when scheduling jobs to different machines. Such a mechanism defines a scheduling policy within each machine and naturally induces a game among the selfish job owners. The desirable properties of a coordination mechanism includes simplicity in its definition and efficiency of the outcomes of the induced game. We present a broad class of coordination mechanisms for unrelated machine scheduling that are simple to define and we identify one of its members (mechanism DCOORD) that is superior to all known mechanisms. In particular, DCOORD induces potential games with logarithmic price of anarchy and only constant price of stability. Both bounds are almost optimal.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:tKAzc9rXhukC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Socially desirable approximations for Dodgson’s voting rule",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2556950",
            "Abstract": "In 1876, Charles Lutwidge Dodgson suggested the intriguing voting rule that today bears his name. Although Dodgson’s rule is one of the most well-studied voting rules, it suffers from serious deficiencies, both from the computational point of view—it is NP-hard even to approximate the Dodgson score within sublogarithmic factors—and from the social choice point of view—it fails basic social choice desiderata such as monotonicity and homogeneity. However, this does not preclude the existence of approximation algorithms for Dodgson that are monotonic or homogeneous, and indeed it is natural to ask whether such algorithms exist.In this article, we give definitive answers to these questions. We design a monotonic exponential-time algorithm that yields a 2-approximation to the Dodgson score, while matching this result with a tight lower bound. We also present a monotonic polynomial-time O(log m …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:0EnyYjriUFMC",
            "Publisher": "ACM"
        },
        {
            "Title": "Truthful univariate estimators",
            "Publication year": 2016,
            "Publication url": "http://proceedings.mlr.press/v48/caragiannis16.html",
            "Abstract": "We revisit the classic problem of estimating the population mean of an unknown single-dimensional distribution from samples, taking a game-theoretic viewpoint. In our setting, samples are supplied by strategic agents, who wish to pull the estimate as close as possible to their own value. In this setting, the sample mean gives rise to manipulation opportunities, whereas the sample median does not. Our key question is whether the sample median is the best (in terms of mean squared error) truthful estimator of the population mean. We show that when the underlying distribution is symmetric, there are truthful estimators that dominate the median. Our main result is a characterization of worst-case optimal truthful estimators, which provably outperform the median, for possibly asymmetric distributions with bounded support.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:W5xh706n7nkC",
            "Publisher": "PMLR"
        },
        {
            "Title": "Limitations of deterministic auction design for correlated bidders",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2934309",
            "Abstract": "The seminal work of Myerson (Mathematics of OR ’81) characterizes incentive-compatible single-item auctions among bidders with independent valuations. In this setting, relatively simple deterministic auction mechanisms achieve revenue optimality. When bidders have correlated valuations, designing the revenue-optimal deterministic auction is a computationally demanding problem; indeed, Papadimitriou and Pierrakos (STOC ’11) proved that it is APX-hard, obtaining an explicit inapproximability factor of 1999/2000 = 99.95%. In the current article, we strengthen this inapproximability factor to 63/64 ≈ 98.5%. Our proof is based on a gap-preserving reduction from the Max-NM 3SAT problem; a variant of the maximum satisfiability problem where each clause has exactly three literals and no clause contains both negated and unnegated literals. We furthermore show that the gap between the revenue of deterministic …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:abG-DnoFyZgC",
            "Publisher": "ACM"
        },
        {
            "Title": "New Results for Energy-Efficient Broadcasting",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=17658919411890804555&hl=en&oi=scholarr",
            "Abstract": "Motivated by the problem of supporting energy-efficient broadcasting in ad hoc wireless networks, we study the Minimum Energy",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:sNmaIFBj_lkC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "The unreasonable fairness of maximum Nash welfare",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3355902",
            "Abstract": "The maximum Nash welfare (MNW) solution—which selects an allocation that maximizes the product of utilities—is known to provide outstanding fairness guarantees when allocating divisible goods. And while it seems to lose its luster when applied to indivisible goods, we show that, in fact, the MNW solution is strikingly fair even in that setting. In particular, we prove that it selects allocations that are envy-free up to one good—a compelling notion that is quite elusive when coupled with economic efficiency. We also establish that the MNW solution provides a good approximation to another popular (yet possibly infeasible) fairness property, the maximin share guarantee, in theory and—even more so—in practice. While finding the MNW solution is computationally hard, we develop a nontrivial implementation and demonstrate that it scales well on real data. These results establish MNW as a compelling solution for …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:ZuybSZzF8UAC",
            "Publisher": "ACM"
        },
        {
            "Title": "Wavelength management in WDM rings to maximize the number of connections",
            "Publication year": 2009,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/06067660X",
            "Abstract": "We study computationally hard combinatorial problems arising from the important engineering question of how to maximize the number of connections that can be simultaneously served in a wavelength division ultiplexing (WDM) optical network. In such networks, WDM technology can satisfy a set of connections by computing a route and assigning a wavelength to each connection so that no two connections routed through the same fiber are assigned the same wavelength. Each fiber supports a limited number of w wavelengths and in order to fully exploit the parallelism provided by the technology, one should select a set of connections of maximum cardinality which can be satisfied using the available wavelengths. This is known as the maximum routing and path coloring (maxRPC) problem. Our main contribution is a general analysis method for a class of iterative algorithms for a more general coloring problem. A lower bound on the …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:TQgYirikUcIC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "New bounds on the size of the minimum feedback vertex set in meshes and butterflies",
            "Publication year": 2002,
            "Publication url": "https://tildeweb.au.dk/au121/alcom-ft/TR/ALCOMFT-TR-01-182.ps.gz",
            "Abstract": "Given a graph G=(V; E), the minimum feedback vertex set S is a subset of vertices of minimum size, whose removal induces an acyclic subgraph G0=(V nS; E0). The problem of nding S is NP {complete in general graphs, although polynomial time solutions exist for particular classes of graphs. In this paper we present upper and lower bounds on the size of the minimum feedback vertex set in meshes and butter ies improving results of Luccio 10].",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier Science"
        },
        {
            "Title": "Tight approximation bounds for combinatorial frugal coverage algorithms",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10878-012-9464-0.pdf",
            "Abstract": "We consider the frugal coverage problem, an interesting variation of set cover defined as follows. Instances of the problem consist of a universe of elements and a collection of sets over these elements; the objective is to compute a subcollection of sets so that the number of elements it covers plus the number of sets not chosen is maximized. The problem was introduced and studied by Huang and Svitkina (Proceedings of the 29th IARCS annual conference on foundations of software technology and theoretical computer science (FSTTCS), pp. 227–238, 2009) due to its connections to the donation center location problem. We prove that the greedy algorithm has approximation ratio at least 0.782, improving a previous bound of 0.731 in Huang and Svitkina (Proceedings of the 29th IARCS annual conference on foundations of software technology and theoretical computer science (FSTTCS), pp. 227–238, 2009 …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Geometric Clustering to Minimize",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=142085662543270127&hl=en&oi=scholarr",
            "Abstract": "We study geometric versions of the min-size k-clustering problem, a clustering problem which generalizes clustering to minimize the sum of cluster radii and has important applications. We prove that the problem can be solved in polynomial time when the points to be clustered are located on a line. For Euclidean spaces of higher dimensions, we show that the problem is NP-hard and present polynomial time approximation schemes. The latter result yields an improved approximation algorithm for the related problem of k-clustering to minimize the sum of cluster diameters.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A logarithmic approximation algorithm for the minimum energy consumption broadcast subgraph problem",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020019002004842",
            "Abstract": "Motivated by the problem of supporting energy-efficient broadcasting in ad hoc wireless networks, we study the Minimum Energy Consumption Broadcast Subgraph (MECBS) problem. We present the first logarithmic approximation algorithm for the problem which uses an interesting reduction to Node-Weighted Connected Dominating Set.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An exponential improvement on the MST heuristic for minimum energy broadcasting in ad hoc wireless networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6353616/",
            "Abstract": "We present a new approximation algorithm for the Minimum Energy Broadcast Routing (MEBR) problem in ad hoc wireless networks that achieves an exponentially better approximation factor compared to the well-known Minimum Spanning Tree (MST) heuristic. Namely, for any instance where a minimum spanning tree of the set of stations is guaranteed to cost at most ρ ≥ 2 times the cost of an optimal solution for MEBR, we prove that our algorithm achieves an approximation ratio bounded by 2lnρ-2 ln 2 + 2. This result is particularly relevant for its consequences on Euclidean instances where we significantly improve previous results. In this respect, our experimental analysis confirms the better performance of the algorithm also in practice.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Complexity of Learning Approval-Based Multiwinner Voting Rules",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.00254",
            "Abstract": "We study the PAC learnability of multiwinner voting, focusing on the class of approval-based committee scoring (ABCS) rules. These are voting rules applied on profiles with approval ballots, where each voter approves some of the candidates. ABCS rules adapt positional scoring rules in single-winner voting by assuming that each committee of  candidates collects from each voter a score, that depends on the size of the voter's ballot and on the size of its intersection with the committee. Then, committees of maximum score are the winning ones. Our goal is to learn a target rule (i.e., to learn the corresponding scoring function) using information about the winning committees of a small number of sampled profiles. Despite the existence of exponentially many outcomes compared to single-winner elections, we show that the sample complexity is still low: a polynomial number of samples carries enough information for learning the target committee with high confidence and accuracy. Unfortunately, even simple tasks that need to be solved for learning from these samples are intractable. We prove that deciding whether there exists some ABCS rule that makes a given committee winning in a given profile is a computationally hard problem. Our results extend to the class of sequential Thiele rules, which have received attention due to their simplicity.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Truthful mechanisms for ownership transfer with expert advice",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Alexandros-Voudouris/publication/322950351_Truthful_mechanisms_for_ownership_transfer_with_expert_advice/links/5ae98679aca2725dabb5c0bd/Truthful-mechanisms-for-ownership-transfer-with-expert-advice.pdf",
            "Abstract": "When a company undergoes a merger or transfer of its ownership, the existing governing body has an opinion on which buyer should take over as the new owner. Similar situations occur while assigning the host of big sports tournaments, eg, the World Cup or the Olympics. In all these settings, the values of the external bidders are as important as the internal experts’ opinions. Motivated by such questions, we consider a social welfare maximizing approach to design and analyze truthful mechanisms in these settings. We consider the problem with one expert and two bidders and provide tight approximation guarantees of the optimal social welfare. Since this problem is a combination of mechanism design with and without monetary transfers (payments can be imposed to the bidders but not to the expert), classical solutions like VCG cannot be applied, making this a unique mechanism design problem. We distinguish between mechanisms that use ordinal and cardinal information, as well as between mechanisms that base their decisions on one of the two sides (either the bidders or the expert) or both. Our analysis shows that the cardinal setting is quite rich and admits several nontrivial randomized truthful mechanisms, and also allows for closer-to-optimal-welfare guarantees.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information retention in heterogeneous majority dynamics",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-71924-5_3",
            "Abstract": "A dynamics retains a specific information about the starting state of a networked multi-player system if this information can be computed from the state of the system also after several rounds of the dynamics. Information retention has been studied for the function that returns the majority of the states in systems in which players have states in  and the system evolves according to the majority dynamics: each player repeatedly updates its state to match the local majority among neighbors only. Positive and negative results have been given for probabilistic settings in which the initial states of the players are chosen at random and in worst-case settings in which the initial state is chosen non-deterministically.In this paper, we study the (lack of) retention of information on the majority state (that is, which states appear in more players) for a generalization of the majority dynamics that we call heterogeneous majority …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:yB1At4FlUx8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Optimal social choice functions: A utilitarian view",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370215000892",
            "Abstract": "We adopt a utilitarian perspective on social choice, assuming that agents have (possibly latent) utility functions over some space of alternatives. For many reasons one might consider mechanisms, or social choice functions, that only have access to the ordinal rankings of alternatives by the individual agents rather than their utility functions. In this context, one possible objective for a social choice function is the maximization of (expected) social welfare relative to the information contained in these rankings. We study such optimal social choice functions under three different models, and underscore the important role played by scoring functions. In our worst-case model, no assumptions are made about the underlying distribution and we analyze the worst-case distortion—or degree to which the selected alternative does not maximize social welfare—of optimal (randomized) social choice functions. In our average-case …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:rO6llkc54NcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fair allocation of indivisible goods and chores",
            "Publication year": 2022,
            "Publication url": "https://link.springer.com/article/10.1007/s10458-021-09532-8",
            "Abstract": "We consider the problem of fairly dividing a set of indivisible items. Much of the fair division literature assumes that the items are “goods” that yield positive utility for the agents. There is also some work in which the items are “chores” that yield negative utility for the agents. In this paper, we consider a more general scenario in which an agent may have positive or negative utility for each item. This framework captures, e.g., fair task assignment, where agents can experience both positive and negative utility for each task. We demonstrate that whereas some of the positive axiomatic and computational results extend to this more general setting, others do not. We present several new and efficient algorithms for finding fair allocations in this general setting. We also point out several gaps in the literature regarding the existence of allocations that satisfy certain fairness and efficiency properties and examine the …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:DUooU5lO8OsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A tight bound for online colouring of disk graphs",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397507003295",
            "Abstract": "We present an improved upper bound on the competitiveness of the online colouring algorithm First-Fit in disk graphs, which are graphs representing overlaps of disks on the plane. We also show that this bound is best possible for deterministic online colouring algorithms that do not use the disk representation of the input graph. We also present a related new lower bound for unit disk graphs.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Taxes for linear atomic congestion games",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1868237.1868251",
            "Abstract": "We study congestion games where players aim to access a set of resources. Each player has a set of possible strategies and each resource has a function associating the latency it incurs to the players using it. Players are non--cooperative and each wishes to follow a strategy that minimizes her own latency with no regard to the global optimum. Previous work has studied the impact of this selfish behavior on system performance. In this article, we study the question of how much the performance can be improved if players are forced to pay taxes for using resources. Our objective is to extend the original game so that selfish behavior does not deteriorate performance. We consider atomic congestion games with linear latency functions and present both negative and positive results. Our negative results show that optimal system performance cannot be achieved even in very simple games. On the positive side, we …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:p2g8aNsByqUC",
            "Publisher": "ACM"
        },
        {
            "Title": "Wavelength Routing in All {Optical Tree Networks: A Survey",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Caragiannis/publication/220106561_Wavelength_Routing_in_All-Optical_Tree_Networks_A_Survey/links/54731f880cf24bc8ea19b492/Wavelength-Routing-in-All-Optical-Tree-Networks-A-Survey.pdf",
            "Abstract": "We study the problem of allocating optical bandwidth to sets of communication requests in all {optical networks that utilize Wavelength Division Multiplexing (WDM). WDM technology establishes communication between pairs of network nodes by establishing transmitter {receiver paths and assigning wavelengths to each path so that no two paths going through the same ber link use the same wavelength. Optical bandwidth is the number of distinct wavelengths. Since state {of {the {art technology allows for a limited number of wavelengths, the engineering problem to be solved is to establish communication between pairs of nodes so that the total number of wavelengths used is minimized; this is known as the wavelength routing problem. In this paper, we survey recent advances in bandwidth allocation in tree {shaped WDM all {optical networks:",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:-FonjvnnhkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Approximation Algorithms for Path Coloring in Trees. Chapter in Efficient Approximation and Online Algorithms, LNCS 3484",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=1940434556770395033&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Better bounds for online load balancing on unrelated machines",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.110.436&rep=rep1&type=pdf",
            "Abstract": "We study the problem of scheduling permanent jobs on unrelated machines when the objective is to minimize the Lp norm of the machine loads. The problem is known as load balancing under the Lp norm. We present an improved upper bound for the greedy algorithm through simple analysis; this bound is also shown to be best possible within the class of deterministic online algorithms for the problem. We also address the question whether randomization helps online load balancing under Lp norms on unrelated machines; this is a challenging question which is open for more than a decade even for the L2 norm. We provide a positive answer to this question by presenting the first randomized online algorithms which outperform deterministic ones under any (integral) Lp norm for p= 2,..., 137. Our algorithms essentially compute in an online manner a fractional solution to the problem and use the fractional values to make random choices. The local optimization criterion used at each step is novel and rather counterintuitive: the values of the fractional variables for each job correspond to flows at an approximate Wardrop equilibrium for an appropriately defined non-atomic congestion game. As corollaries of our analysis and by exploiting the relation between the Lp norm and the makespan of machine loads, we obtain new competitive algorithms for online makespan minimization, making progress in another longstanding open problem.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simple greedy algorithms for fundamental multidimensional graph problems",
            "Publication year": 2017,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02089412/",
            "Abstract": "We revisit fundamental problems in undirected and directed graphs, such as the problems of computing spanning trees, shortest paths, steiner trees, and spanning arborescences of minimum cost. We assume that there are d different cost functions associated with the edges of the input graph and seek for solutions to the resulting multidimensional graph problems so that the p - norm of the different costs of the solution is minimized. We present combinatorial algorithms that achieve very good approximations for this objective. The main advantage of our algorithms is their simplicity: they are as simple as classical combinatorial graph algorithms of Dijkstra and Kruskal, or the greedy algorithm for matroids.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Voting almost maximizes social welfare despite limited communication",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370211000506",
            "Abstract": "In cooperative multiagent systems an alternative that maximizes the social welfare—the sum of utilities—can only be selected if each agent reports its full utility function. This may be infeasible in environments where communication is restricted. Employing a voting rule to choose an alternative greatly reduces the communication burden, but leads to a possible gap between the social welfare of the optimal alternative and the social welfare of the one that is ultimately elected. Procaccia and Rosenschein (2006) [13] have introduced the concept of distortion to quantify this gap.In this paper, we present the notion of embeddings into voting rules: functions that receive an agentʼs utility function and return the agentʼs vote. We establish that very low distortion can be obtained using randomized embeddings, especially when the number of agents is large compared to the number of alternatives. We investigate our ideas in …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:maZDTaKrznsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Envy-freeness up to any item with high Nash welfare: The virtue of donating items",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3328526.3329574",
            "Abstract": "Several fairness concepts have been proposed recently in attempts to approximate envy-freeness in settings with indivisible goods. Among them, the concept of envy-freeness up to any item (EFX) is arguably the closest to envy-freeness. Unfortunately, EFX allocations are not known to exist except in a few special cases. We make significant progress in this direction. We show that for every instance with additive valuations, there is an EFX allocation of a subset of items with a Nash welfare that is at least half of the maximum possible Nash welfare for the original set of items. That is, after donating some items to a charity, one can distribute the remaining items in a fair way with high efficiency. This bound is proved to be best possible. Our proof is constructive and highlights the importance of maximum Nash welfare allocation. Starting with such an allocation, our algorithm decides which items to donate and redistributes …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:Dip1O2bNi0gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Workshop on Resiliency in High Performance Computing (Resilience) in Clusters, Clouds, and Grids",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=9AW7BQAAQBAJ&oi=fnd&pg=PA461&dq=info:ZX2qedX_swEJ:scholar.google.com&ots=6jfwysEBHv&sig=clZgMSmHMMnT1N99c9Uy5KMz7eM",
            "Abstract": "Clusters, Clouds, and Grids are three different computational paradigms with the intent or potential to support High Performance Computing (HPC). Currently, they consist of hardware, management, and usage models particular to different computational regimes, eg, high performance cluster systems designed to support tightly coupled scientific simulation codes typically utilize high-speed interconnects and commercial cloud systems designed to support software as a service (SAS) do not. However, in order to support HPC, all must at least utilize large numbers of resources and hence effective HPC in any of these paradigms must address the issue of resiliency at large-scale. Recent trends in HPC systems have clearly indicated that future increases in performance, in excess of those resulting from improvements in single-processor performance, will be achieved through corresponding increases in system scale, ie, using a significantly larger component count. As the raw computational performance of these HPC systems increases from today’s tera-and petascale to next-generation multi peta-scale capability and beyond, their number of computational, networking, and storage components will grow from the ten-toone-hundred thousand compute nodes of today’s systems to several hundreds of thousands of compute nodes and more in the foreseeable future. This substantial growth in system scale, and the resulting component count, poses a challenge for HPC system and application software with respect to fault tolerance and resilience.Furthermore, recent experiences on extreme-scale HPC systems with nonrecoverable soft errors, ie, bit flips in …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:q3CdL3IzO_QC",
            "Publisher": "Springer"
        },
        {
            "Title": "Efficient coordination mechanisms for unrelated machine scheduling",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-012-9650-6",
            "Abstract": "We present three new coordination mechanisms for scheduling n selfish jobs on m unrelated machines. A coordination mechanism aims to mitigate the impact of selfishness of jobs on the efficiency of schedules by defining a local scheduling policy on each machine. The scheduling policies induce a game among the jobs and each job prefers to be scheduled on a machine so that its completion time is minimum given the assignments of the other jobs. We consider the maximum completion time among all jobs as the measure of the efficiency of schedules. The approximation ratio of a coordination mechanism quantifies the efficiency of pure Nash equilibria (price of anarchy) of the induced game.Our mechanisms are deterministic, local, and preemptive in the sense that the scheduling policy does not necessarily process the jobs in an uninterrupted way and may introduce some idle time. Our first …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Analysis of approximation algorithms for k-set cover using factor-revealing linear programs",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-008-9112-3",
            "Abstract": "We present new combinatorial approximation algorithms for the k-set cover problem. Previous approaches are based on extending the greedy algorithm by efficiently handling small sets. The new algorithms further extend these approaches by utilizing the natural idea of computing large packings of elements into sets of large size. Our results improve the previously best approximation bounds for the k-set cover problem for all values of k≥6. The analysis technique used could be of independent interest; the upper bound on the approximation factor is obtained by bounding the objective value of a factor-revealing linear program.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Aggregating partial rankings with applications to peer grading in massive online open courses",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1411.4619",
            "Abstract": "We investigate the potential of using ordinal peer grading for the evaluation of students in massive online open courses (MOOCs). According to such grading schemes, each student receives a few assignments (by other students) which she has to rank. Then, a global ranking (possibly translated into numerical scores) is produced by combining the individual ones. This is a novel application area for social choice concepts and methods where the important problem to be solved is as follows: how should the assignments be distributed so that the collected individual rankings can be easily merged into a global one that is as close as possible to the ranking that represents the relative performance of the students in the assignment? Our main theoretical result suggests that using very simple ways to distribute the assignments so that each student has to rank only  of them, a Borda-like aggregation method can recover a  fraction of the true ranking when each student correctly ranks the assignments she receives. Experimental results strengthen our analysis further and also demonstrate that the same method is extremely robust even when students have imperfect capabilities as graders. We believe that our results provide strong evidence that ordinal peer grading can be a highly effective and scalable solution for evaluation in MOOCs.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dodgson's Rule and Young's Rule.",
            "Publication year": 2016,
            "Publication url": "https://cs.au.dk/~iannis/publ/B8-comsoc-chapter5.pdf",
            "Abstract": "Dodgson’s and Young’s election systems, dating from 1876 and 1977, are beautiful, historically resonant election systems. Surprisingly, both of these systems turn out to have highly intractable winner-determination problems: The winner problems of these systems are complete for parallel access to NP. This chapter discusses both the complexity of these winner-determination problems and approaches—through heuristic algorithms, fixed-parameter algorithms, and approximation algorithms—to circumventing that complexity.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:p__nRnzSRKYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New results for energy-efficient broadcasting in wireless networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36136-7_30",
            "Abstract": "Motivated by the problem of supporting energy-efficient broadcasting in ad hoc wireless networks, we study the Minimum Energy Consumption Broadcast Subgraph (MECBS) problem. We present the first logarithmic approximation algorithm for the problem which uses an interesting reduction to Node-Weighted Connected Dominating Set. We also show that an important special instance of the problem can be solved in polynomial time, solving an open problem of Clementi et al. [2].",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Bounding the inefficiency of outcomes in generalized second price auctions",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022053114000647",
            "Abstract": "The Generalized Second Price (GSP) auction is the primary auction used for monetizing the use of the Internet. It is well-known that truthtelling is not a dominant strategy in this auction and that inefficient equilibria can arise. Edelman et al. (2007) [11] and Varian (2007) [36] show that an efficient equilibrium always exists in the full information setting. Their results, however, do not extend to the case with uncertainty, where efficient equilibria might not exist.In this paper we study the space of equilibria in GSP, and quantify the efficiency loss that can arise in equilibria under a wide range of sources of uncertainty, as well as in the full information setting. The traditional Bayesian game models uncertainty in the valuations (types) of the participants. The Generalized Second Price (GSP) auction gives rise to a further form of uncertainty: the selection of quality factors resulting in uncertainty about the behavior of the underlying …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:eflP2zaiRacC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Near-optimal asymmetric binary matrix partitions",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-016-0238-4",
            "Abstract": "We study the asymmetric binary matrix partition problem that was recently introduced by Alon et al. (Proceedings of the 9th Conference on Web and Internet Economics (WINE), pp 1–14, 2013). Instances of the problem consist of an  binary matrix A and a probability distribution over its columns. A partition scheme  consists of a partition  for each row i of A. The partition  acts as a smoothing operator on row i that distributes the expected value of each partition subset proportionally to all its entries. Given a scheme B that induces a smooth matrix , the partition value is the expected maximum column entry of . The objective is to find a partition scheme such that the resulting partition value is maximized. We present a 9/10-approximation algorithm for the case where the probability distribution is uniform and a -approximation algorithm for non-uniform distributions, significantly …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Impartial selection with additive approximation guarantees",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-30473-7_18",
            "Abstract": " Impartial selection has recently received much attention within the multi-agent systems community. The task is, given a directed graph representing nominations to the members of a community by other members, to select the member with the highest number of nominations. This seemingly trivial goal becomes challenging when there is an additional impartiality constraint, requiring that no single member can influence her chance of being selected. Recent progress has identified impartial selection rules with optimal approximation ratios. Moreover, it was noted that worst-case instances are graphs with few vertices. Motivated by this fact, we propose the study of additive approximation, the difference between the highest number of nominations and the number of nominations of the selected member, as an alternative measure of the quality of impartial selection.Our positive results include two randomized impartial selection …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:hCrLmN-GePgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Power consumption problems in ad-hoc wireless networks",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24592-6_21",
            "Abstract": "Wireless networks have received significant attention during the recent years. Especially, ad hoc wireless networks emerged due to their potential applications in battlefield, emergency disaster relief, etc. [13]. Unlike traditional wired networks or cellular wireless networks, no wired backbone infrastructure is installed for ad hoc wireless networks.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "co-rank: An online tool for collectively deciding efficient rankings among peers",
            "Publication year": 2016,
            "Publication url": "https://www.aaai.org/ocs/index.php/AAAI/AAAI16/paper/download/12043/12287",
            "Abstract": "Our aim with co-rank is to facilitate the grading of exams or assignments in massive open online courses (MOOCs).",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimental comparison of algorithms for energy-efficient multicasting in ad hoc networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-28634-9_15",
            "Abstract": "Energy is a scarce resource in ad hoc wireless networks and it is of paramount importance to use it efficiently when establishing communication patterns. In this work we study algorithms for computing energy-efficient multicast trees in ad hoc wireless networks. Such algorithms either start with an empty solution which is gradually augmented to a multicast tree (augmentation algorithms) or take as input an initial multicast tree and ’walk’ on different multicast trees for a finite number of steps until some acceptable decrease in energy consumption is achieved (local search algorithms).We mainly focus on augmentation algorithms and in particular we have implemented a long list of existing such algorithms in the literature and new ones. We experimentally compare all these algorithms on random geometric instances of the problem and obtain results in terms of the energy efficiency of the solutions …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Sparse and limited wavelength conversion in all-optical tree networks",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397500004011",
            "Abstract": "We study the problem of assigning a minimum number of colors to directed paths (dipaths) of a tree, so that any two dipaths that share a directed edge of the tree are not assigned the same color. The problem has applications to wavelength routing in WDM all-optical tree networks, an important engineering problem. Dipaths represent communication requests, while colors correspond to wavelengths that must be assigned to requests so that multiple users can communicate simultaneously through the same optical fiber. Recent work on wavelength routing in trees has studied a special class of algorithms which are called greedy. Although these algorithms are simple and implementable in a distributed setting, it has been proved that there are cases where a bandwidth utilization of 100% is not possible. Thus, in this work, we relax the constraints of the original engineering problem and use devices called wavelength …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Opting into optimal matchings",
            "Publication year": 2017,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611974782.155",
            "Abstract": "We revisit the problem of designing optimal, individually rational matching mechanisms (in a general sense, allowing for cycles in directed graphs), where each player—who is associated with a subset of vertices—matches as many of his own vertices when he opts into the matching mechanism as when he opts out. We offer a new perspective on this problem by considering an arbitrary graph, but assuming that vertices are associated with players at random. Our main result asserts that, under certain conditions, any fixed optimal matching is likely to be individually rational up to lower-order terms. We also show that a simple and practical mechanism is (fully) individually rational, and likely to be optimal up to lower-order terms. We discuss the implications of our results for market design in general, and kidney exchange in particular.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:evX43VCCuoAC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Mechanism design: from partial to probabilistic verification",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2229012.2229035",
            "Abstract": "Algorithmic mechanism design is concerned with designing algorithms for settings where inputs are controlled by selfish agents, and the center needs to motivate the agents to report their true values. In this paper, we study scenarios where the center may be able to verify whether the agents report their preferences (types) truthfully. We first consider the standard model of mechanism design with partial verification, where the set of types that an agent can report is a function of his true type. We explore inherent limitations of this model; in particular, we show that the famous Gibbard--Satterthwaite impossibility result holds even if a manipulator can only lie by swapping two adjacent alternatives in his vote. Motivated by these negative results, we then introduce a richer model of verification, which we term mechanism design with probabilistic verification. In our model, an agent may report any type, but will be caught with …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On Interim Envy-Free Allocation Lotteries",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2102.07839",
            "Abstract": "With very few exceptions, recent research in fair division has mostly focused on deterministic allocations. Deviating from this trend, we study the fairness notion of interim envy-freeness (iEF) for lotteries over allocations, which serves as a sweet spot between the too stringent notion of ex-post envy-freeness and the very weak notion of ex-ante envy-freeness. iEF is a natural generalization of envy-freeness to random allocations in the sense that a deterministic envy-free allocation is iEF (when viewed as a degenerate lottery). It is also certainly meaningful as it allows for a richer solution space, which includes solutions that are provably better than envy-freeness according to several criteria. Our analysis relates iEF to other fairness notions as well, and reveals tradeoffs between iEF and efficiency. Even though several of our results apply to general fair division problems, we are particularly interested in instances with equal numbers of agents and items where allocations are perfect matchings of the items to the agents. Envy-freeness can be trivially decided and (when it can be achieved, it) implies full efficiency in this setting. Although computing iEF allocations in matching allocation instances is considerably more challenging, we show how to compute them in polynomial time, while also maximizing several efficiency objectives. Our algorithms use the ellipsoid method for linear programming and efficient solutions to a novel variant of the bipartite matching problem as a separation oracle. We also study the extension of interim envy-freeness notion when payments to or from the agents are allowed. We present a series of results on two optimization …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Randomized on-line algorithms and lower bounds for computing large independent sets in disk graphs",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0166218X06002204",
            "Abstract": "We study the on-line version of the maximum independent set problem, for the case of disk graphs which are graphs resulting from intersections of disks on the plane. In particular, we investigate whether randomization can be used to break known lower bounds for deterministic on-line independent set algorithms and present new upper and lower bounds.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Evaluating approval-based multiwinner voting in terms of robustness to noise",
            "Publication year": 2022,
            "Publication url": "https://link.springer.com/article/10.1007/s10458-021-09530-w",
            "Abstract": "Approval-based multiwinner voting rules have recently received much attention in the Computational Social Choice literature. Such rules aggregate approval ballots and determine a winning committee of alternatives. To assess effectiveness, we propose to employ new noise models that are specifically tailored for approval votes and committees. These models take as input a ground truth committee and return random approval votes to be thought of as noisy estimates of the ground truth. A minimum robustness requirement for an approval-based multiwinner voting rule is to return the ground truth when applied to profiles with sufficiently many noisy votes. Our results indicate that approval-based multiwinner voting can indeed be robust to reasonable noise. We further refine this finding by presenting a hierarchy of rules in terms of how robust to noise they are.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:kh2fBNsKQNwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Symmetric communication in all-optical tree networks",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0129626400000299",
            "Abstract": "We address the problem of allocating optical bandwidth to a set of communication requests in a tree-shaped all-optical network that utilizes Wavelength Division Multiplexing (WDM) technology. WDM technology establishes communication between pairs of nodes of the network by establishing tranceiver–receiver paths and assigning wavelengths to each path so that no two paths going through the same link use the same wavelength. Optical bandwidth is the number of distinct wavelengths. The important engineering problem to be solved is to establish communication between pairs of nodes so that the total number of wavelengths used is minimized.In this paper, we focus on a special case of the problem considering patterns of requests that are symmetric, i.e. for any transmitter–receiver pair of nodes (v1, v2) there also exists its symmetric (v2, v1). Our motivation lies in the fact that many services that are …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:4DMP91E08xMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "The impact of altruism on the efficiency of atomic congestion games",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15640-3_12",
            "Abstract": "We study the effect of combining selfishness and altruism in atomic congestion games. We allow players to be partially altruistic and partially selfish and determine the impact of this behavior on the overall system performance. Surprisingly, our results indicate that, in general, by allowing players to be (even partially) altruistic, the overall system performance deteriorates. Instead, for the class of symmetric load balancing games, a balance between selfish and altruistic behavior improves system performance to optimality.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Scheduling to maximize participation",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75336-0_14",
            "Abstract": "We study a problem of scheduling client requests to servers. Each client has a particular latency requirement at each server and may choose either to be assigned to some server in order to get serviced provided that her latency requirement is met or not to participate in the assignment at all. From a global perspective, in order to optimize the performance of such a system, one would aim to maximize the number of clients that participate in the assignment. However, clients may behave selfishly in the sense that each of them simply aims to participate in an assignment and get serviced by some server where her latency requirement is met with no regard to the overall system performance. We model this selfish behavior as a strategic game, show how to compute equilibria efficiently, and assess the impact of selfishness on system performance. We also show that the problem of optimizing performance is …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Efficient computation of approximate pure Nash equilibria in congestion games",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6108214/",
            "Abstract": "Congestion games constitute an important class of games in which computing an exact or even approximate pure Nash equilibrium is in general PLS-complete. We present a surprisingly simple polynomial-time algorithm that computes O(1)-approximate Nash equilibria in these games. In particular, for congestion games with linear latency functions, our algorithm computes (2 +ε)-approximate pure Nash equilibria in time polynomial in the number of players, the number of resources and 1/ε. It also applies to games with polynomial latency functions with constant maximum degree d: there, the approximation guarantee is d o(d) . The algorithm essentially identifies a polynomially long sequence of best-response moves that lead to an approximate equilibrium; the existence of such short sequences is interesting in itself. These are the first positive algorithmic results for approximate equilibria in non-symmetric congestion …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An improved approximation bound for spanning star forest and color saving",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03816-7_9",
            "Abstract": "We present a simple algorithm for the maximum spanning star forest problem. We take advantage of the fact that the problem is a special case of complementary set cover and we adapt an algorithm of Duh and Fürer in order to solve it. We prove that this algorithm computes 193/240 ≈ 0.804-approximate spanning star forests; this result improves a previous lower bound of 0.71 by Chen et al. Although the algorithm is purely combinatorial, our analysis defines a linear program that uses a parameter f and which is feasible for values of the parameter f not smaller than the approximation ratio of the algorithm. The analysis is tight and, interestingly, it also applies to complementary versions of set cover such as color saving; it yields the same approximation guarantee of 193/240 that marginally improves the previously known upper bound of Duh and Fürer. We also show that, in general, a natural class of local …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Recent advances in large-scale peer grading",
            "Publication year": 2017,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=0qY8DwAAQBAJ&oi=fnd&pg=PA327&dq=info:eDgkg918_k8J:scholar.google.com&ots=s3Shjhimx-&sig=8PQce8MFjZIGlcV5nK4GrSCToRE",
            "Abstract": "Peer grading is the standard practice for evaluating research work and has recently become a necessity in online education. Examples include a program committee that has to decide on the papers that will be accepted for presentation at a scientific conference, the members of a professional society that wish to single out a member that should be given an award, or an instructor of an online course who outsources the evaluation of an exam to the students themselves. In all these cases, the individual inputs provided by each program committee member, society member, or student have to be aggregated in order to get the final result.The challenge that needs to be addressed is to guarantee an as high as possible level of effectiveness in the evaluation outcome, given that the individual inputs will be, in general, partial and inaccurate. Typically, the number of submissions in a big scientific conference is a few thousand (eg, more than 2,000 papers were submitted in the last AAAI and IJCAI conferences). Of course, there is no single program committee member that has a complete view of all submitted papers. Instead, each PC member is given very few papers for review. The source of inaccuracy should be clear in the case of students who grade their peers in an online course but it can be a severe problem even among experts. In a recent experiment, 1 the organizers of the NIPS 2014 conference formed two independent program committees. Among the approximately 900 submitted papers, most were assigned to a single PC, but 166 submissions were reviewed by both committees. This let them observe how consistent the two committees were on …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Lulu. com"
        },
        {
            "Title": "Improved lower bounds on the price of stability of undirected network design games",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-012-9411-6",
            "Abstract": "Bounding the price of stability of undirected network design games with fair cost allocation is a challenging open problem in the Algorithmic Game Theory research agenda. Even though the generalization of such games in directed networks is well understood in terms of the price of stability (it is exactly H  n , the n-th harmonic number, for games with n players), far less is known for network design games in undirected networks. The upper bound carries over to this case as well while the best known lower bound is 42/23≈1.826. For more restricted but interesting variants of such games such as broadcast and multicast games, sublogarithmic upper bounds are known while the best known lower bound is 12/7≈1.714. In the current paper, we improve the lower bounds as follows. We break the psychological barrier of 2 by showing that the price of stability of undirected network …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Improving the efficiency of load balancing games through taxes",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-92185-1_43",
            "Abstract": "In load balancing games, there is a set of available servers and a set of clients; each client wishes to run her job on some server. Clients are selfish and each of them selects a server that, given an assignment of the other clients to servers, minimizes the latency she experiences with no regard to the global optimum. In order to mitigate the effect of selfishness on the efficiency, we assign taxes to the servers. In this way, we obtain a new game where each client aims to minimize the sum of the latency she experiences and the tax she pays. Our objective is to find taxes so that the worst equilibrium of the new game is as efficient as possible. We present new results concerning the impact of taxes on the efficiency of equilibria, with respect to the total latency of all clients and the maximum latency (makespan).",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Deanonymizing Social Networks Using Structural Information.",
            "Publication year": 2019,
            "Publication url": "https://tildeweb.au.dk/au655526/publ/C97-ijcai19a.pdf",
            "Abstract": "We study the following fundamental graph problem that models the important task of deanonymizing social networks. We are given a graph representing an eponymous social network and another graph, representing an anonymous social network, which has been produced by the original one after removing some of its nodes and adding some noise on the links. Our objective is to correctly associate as many nodes of the anonymous network as possible to their corresponding node in the eponymous network. We present two algorithms that attack the problem by exploiting only the structure of the two graphs. The first one exploits bipartite matching computations and is relatively fast. The second one is a local search heuristic which can use the outcome of our first algorithm as an initial solution and further improve it. We have applied our algorithms on inputs that have been produced by well-known random models for the generation of social networks as well as on inputs that use real social networks. Our algorithms can tolerate noise at the level of up to 10%. Interestingly, our results provide further evidence to which graph generation models are most suitable for modeling social networks and distinguish them from unrealistic ones.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimizing positional scoring rules for rank aggregation",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370218306672",
            "Abstract": "Nowadays, several crowdsourcing projects exploit social choice methods for computing an aggregate ranking of alternatives given individual rankings provided by workers. Motivated by such systems, we consider a setting where each worker is asked to rank a fixed (small) number of alternatives and, then, a positional scoring rule is used to compute the aggregate ranking. Among the apparently infinite such rules, what is the best one to use? To answer this question, we assume that we have partial access to an underlying true ranking. Then, the important optimization problem to be solved is to compute the positional scoring rule whose outcome, when applied to the profile of individual rankings, is as close as possible to the part of the underlying true ranking we know. We study this fundamental problem from a theoretical viewpoint and present positive and negative complexity results and, furthermore, complement …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:35r97b3x0nAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Approximate path coloring with applications to wavelength assignment in WDM optical networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24749-4_23",
            "Abstract": "Motivated by the wavelength assignment problem in WDM optical networks, we study path coloring problems in graphs. Given a set of paths P on a graph G, the path coloring problem is to color the paths of P so that no two paths traversing the same edge of G are assigned the same color and the total number of colors used is minimized. The problem has been proved to be NP-hard even for trees and rings.Using optimal solutions to fractional path coloring, a natural relaxation of path coloring, on which we apply a randomized rounding technique combined with existing coloring algorithms, we obtain new upper bounds on the minimum number of colors sufficient to color any set of paths on any graph. The upper bounds are either existential or constructive.The existential upper bounds significantly improve existing ones provided that the cost of the optimal fractional path coloring is sufficiently …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Randomized path coloring on binary trees",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44436-X_8",
            "Abstract": "Motivated by the problem of WDM routing in all-optical networks, we study the following NP-hard problem. We are given a directed binary tree T and a set R of directed paths on T. We wish to assign colors to paths in R, in such a way that no two paths that share a directed arc of T are assigned the same color and that the total number of colors used is minimized. Our results are expressed in terms of the depth of the tree and the maximum load l of R, i.e., the maximum number of paths that go through a directed arc of T. So far, only deterministic greedy algorithms have been presented for the problem. The best known algorithm colors any set R of maximum load l using at most 5l/3 colors. Alternatively, we say that this algorithm has performance ratio 5/3. It is also known that no deterministic greedy algorithm can achieve a performance ratio better than 5/3. In this paper we define the class of greedy algorithms …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An algorithmic framework for strategic fair division",
            "Publication year": 2016,
            "Publication url": "https://www.aaai.org/ocs/index.php/AAAI/AAAI16/paper/viewPaper/12294",
            "Abstract": "We study the paradigmatic fair division problem of fairly allocating a divisible good among agents with heterogeneous preferences, commonly known as cake cutting. Classic cake cutting protocols are susceptible to manipulation. Do their strategic outcomes still guarantee fairness? To address this question we adopt a novel algorithmic approach, proposing a concrete computational model and reasoning about the game-theoretic properties of algorithms that operate in this model. Specifically, we show that each protocol in the class of generalized cut and choose (GCC) protocols---which includes the most important discrete cake cutting protocols---is guaranteed to have approximate subgame perfect Nash equilibria, or even exact equilibria if the protocol's tie-breaking rule is flexible. We further observe that the (approximate) equilibria of proportional protocols---which guarantee each of the n agents a 1/n-fraction of the cake---must be (approximately) proportional, thereby answering the above question in the positive (at least for one common notion of fairness).",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Euro-Par 2012: Parallel Processing Workshops: BDMC, CGWS, HeteroPar, HiBB, OMHI, Paraphrase, PROPER, Resilience, UCHPC, VHPC, Rhodes Island, Greece, August 27-31, 2012. Revised Selected Papers",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=9AW7BQAAQBAJ&oi=fnd&pg=PR2&dq=info:_Nvj9TbuvwkJ:scholar.google.com&ots=6jfwysEBHy&sig=zr1JO7ubrRJ6M0b6DgLzLPLnud0",
            "Abstract": "This book constitutes thoroughly refereed post-conference proceedings of the workshops of the 18th International Conference on Parallel Computing, Euro-Par 2012, held in Rhodes Islands, Greece, in August 2012. The papers of these 10 workshops BDMC, CGWS, HeteroPar, HiBB, OMHI, Paraphrase, PROPER, UCHPC, VHPC focus on promotion and advancement of all aspects of parallel and distributed computing.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:5ugPr518TE4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Fractional path coloring with applications to WDM networks",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-48224-5_60",
            "Abstract": "This paper addresses the natural relaxation of the path coloring problem, in which one needs to color directed paths on a symmetric directed graph with a minimum number of colors, in such a way that paths using the same arc of the graph have different colors. This classic combinatorial problem finds applications in the minimization of the number of wavelengths in wavelength division multiplexing (wdm) all-optical networks.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Truthful ownership transfer with expert advice: Blending mechanism design with and without money",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1802.01308",
            "Abstract": "When a company undergoes a merger or transfers its ownership, the existing governing body has an opinion on which buyer should take over as the new owner. Similar situations occur while assigning the host of big sports tournaments, like the World Cup or the Olympics. In all these settings, the values of the external bidders are as important as the opinions of the internal experts. Motivated by such scenarios, we consider a social welfare maximizing approach to design and analyze truthful mechanisms in {\\em hybrid social choice} settings, where payments can be imposed to the bidders, but not to the experts. Since this problem is a combination of mechanism design with and without monetary transfers, classical solutions like VCG cannot be applied, making this a novel mechanism design problem. We consider the simple but fundamental scenario with one expert and two bidders, and provide tight approximation guarantees of the optimal social welfare. We distinguish between mechanisms that use ordinal and cardinal information, as well as between mechanisms that base their decisions on one of the two sides (either the bidders or the expert) or both. Our analysis shows that the cardinal setting is quite rich and admits several non-trivial randomized truthful mechanisms, and also allows for closer-to-optimal welfare guarantees.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:rmuvC79q63oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interim envy-freeness: A new fairness concept for random allocations",
            "Publication year": 2021,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2021arXiv210207839C/abstract",
            "Abstract": "With very few exceptions, research in fair division has mostly focused on deterministic allocations. Deviating from this trend, we define and study the novel notion of interim envy-freeness (iEF) for lotteries over allocations, which aims to serve as a sweet spot between the too stringent notion of ex-post envy-freeness and the very weak notion of ex-ante envy-freeness. Our new fairness notion is a natural generalization of envy-freeness to random allocations in the sense that a deterministic envy-free allocation is iEF (when viewed as a degenerate lottery). It is also certainly meaningful as it allows for a richer solution space, which includes solutions that are provably better than envy-freeness according to several criteria. Our analysis relates iEF to other fairness notions as well, and reveals tradeoffs between iEF and efficiency. Even though several of our results apply to general fair division problems, we are particularly …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:LO7wyVUgiFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Achieving proportional representation in conference programs",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=3845655491946033471&hl=en&oi=scholarr",
            "Abstract": "We study the optimization problem of designing the program of a conference with parallel sessions, so that the intended participants are as happy as possible from the talks they can attend. Interestingly, this can be thought of as a two-dimensional extension of a scheme proposed by Chamberlin and Courant [1983] for achieving proportional representation in multi-winner elections. We show that different variations of the problem are computationally hard by exploiting relations of the problem with well-known hard graph problems. On the positive side, we present polynomial-time algorithms that compute conference programs that have a social utility that is provably close to the optimal one (within constant factors). Our algorithms are either combinatorial or based on linear programming and randomized rounding.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computing approximate pure Nash equilibria in congestion games",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2325713.2325718",
            "Abstract": "Among other solution concepts, the notion of the pure Nash equilibrium plays a central role in Game Theory. Pure Nash equilibria in a game characterize situations with non-cooperative deterministic players in which no player has any incentive to unilaterally deviate from the current situation in order to achieve a higher payoff. Unfortunately, it is well known that there are games that do not have pure Nash equilibria. Furhermore, even in games where the existence of equilibria is guaranteed, their computation can be a computationally hard task. Such negative results significantly question the importance of pure Nash equilibria as solution concepts that characterize the behavior of rational players. Approximate pure Nash equilibria, which characterize situations where no player can significantly improve her payoff by unilaterally deviating from her current strategy, could serve as alternative solution concepts provided …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:fPk4N6BV_jEC",
            "Publisher": "ACM"
        },
        {
            "Title": "Modal ranking: A uniquely robust voting rule",
            "Publication year": 2014,
            "Publication url": "https://www.aaai.org/ocs/index.php/AAAI/AAAI14/paper/viewPaper/8409",
            "Abstract": "Motivated by applications to crowdsourcing, we study voting rules that output a correct ranking of alternatives by quality from a large collection of noisy input rankings. We seek voting rules that are supremely robust to noise, in the sense of being correct in the face of any\" reasonable\" type of noise. We show that there is such a voting rule, which we call the modal ranking rule. Moreover, we establish that the modal ranking rule is the unique rule with the preceding robustness property within a large family of voting rules, which includes a slew of well-studied rules.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Approximate pure Nash equilibria in weighted congestion games: existence, efficient computation, and structure",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2614687",
            "Abstract": "We consider structural and algorithmic questions related to the Nash dynamics of weighted congestion games. In weighted congestion games with linear latency functions, the existence of pure Nash equilibria is guaranteed by a potential function argument. Unfortunately, this proof of existence is inefficient and computing pure Nash equilibria in such games is a PLS-hard problem even when all players have unit weights. The situation gets worse when superlinear (e.g., quadratic) latency functions come into play; in this case, the Nash dynamics of the game may contain cycles and pure Nash equilibria may not even exist. Given these obstacles, we consider approximate pure Nash equilibria as alternative solution concepts. A ρ--approximate pure Nash equilibrium is a state of a (weighted congestion) game from which no player has any incentive to deviate in order to improve her cost by a multiplicative factor higher …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:3s1wT3WcHBgC",
            "Publisher": "ACM"
        },
        {
            "Title": "Experimental Evaluation of Hot—Potato Routing Algorithms on 2—Dimensional Processor Arrays",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44520-X_122",
            "Abstract": "In this paper we consider the problem of routing packets in two-dimensional torus-connected processor arrays. We consider four algorithms which are either greedy in the sense that packets try to move towards their destination by adaptively using a shortest path, or have the property that the path traversed by any packet approximates the path traversed by the greedy routing algorithm in the store-and-forward model. In our experiments, we consider the static case of the routing problem where we study permutation and random destination input instances as well as the dynamic case of the problem under the stochastic model for the continuous generation of packets.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Coordination mechanisms, cost-sharing, and approximation algorithms for scheduling",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-71924-5_6",
            "Abstract": "We reveal a connection between coordination mechanisms for unrelated machine scheduling and cost-sharing protocols. Using this connection, we interpret three coordination mechanisms from the recent literature as Shapley-value-based cost-sharing protocols, thus providing a unifying justification regarding why these mechanisms induce potential games. More importantly, this connection provides a template for designing novel coordination mechanisms, as well as approximation algorithms for the underlying optimization problem. The designer need only decide the total cost to be suffered on each machine, and then the Shapley value can be used to induce games guaranteed to possess a potential function; these games can, in turn, be used to design algorithms. To verify the power of this approach, we design a combinatorial algorithm that achieves an approximation guarantee of 1.81 for the problem of …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Online call admission control in wireless cellular networks",
            "Publication year": 2007,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420011296-47/online-call-admission-control-wireless-cellular-networks-ioannis-caragiannis-christos-kaklamanis-evi-papaioannou-38-1",
            "Abstract": "We study frequency spectrum management issues in wireless cellular networks where base stations connected through a high-speed network are used to build the required communication infrastructure. A geographical area in which communication takes place is divided into regions. Each region is the calling area of a base station. In such systems, communication is established in the following way. When a user A wishes to communicate with some other user B, a path must be established between the base stations of the regions where users A and B are located. Then communication is performed in three steps:(i) wireless communication between A and its base station,(ii) communication between the base stations, and (iii) wireless communication between B and its base station. At least one base station is involved in the communication even if both users are located in the same region or only one of the two users …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:JQOojiI6XY0C",
            "Publisher": "Chapman and Hall/CRC"
        },
        {
            "Title": "Approximation algorithms and mechanism design for minimax approval voting",
            "Publication year": 2010,
            "Publication url": "https://ojs.aaai.org/index.php/AAAI/article/view/7615",
            "Abstract": "We consider approval voting elections in which each voter votes for a (possibly empty) set of candidates and the outcome consists of a set of k candidates for some parameter k, eg, committee elections. We are interested in the minimax approval voting rule in which the outcome represents a compromise among the voters, in the sense that the maximum distance between the preference of any voter and the outcome is as small as possible. This voting rule has two main drawbacks. First, computing an outcome that minimizes the maximum distance is computationally hard. Furthermore, any algorithm that always returns such an outcome provides incentives to voters to misreport their true preferences. In order to circumvent these drawbacks, we consider approximation algorithms, ie, algorithms that produce an outcome that approximates the minimax distance for any given instance. Such algorithms can be considered as alternative voting rules. We present a polynomial-time 2-approximation algorithm that uses a natural linear programming relaxation for the underlying optimization problem and deterministically rounds the fractional solution in order to compute the outcome; this result improves upon the previously best known algorithm that has an approximation ratio of 3. We are furthermore interested in approximation algorithms that are resistant to manipulation by (coalitions of) voters, ie, algorithms that do not motivate voters to misreport their true preferences in order to improve their distance from the outcome. We complement previous results in the literature with new upper and lower bounds on strategyproof and group-strategyproof algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On approximate pure Nash equilibria in weighted congestion games with polynomial latencies",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022000020301008",
            "Abstract": "We consider weighted congestion games with polynomial latency functions of maximum degree d≥ 1. For these games, we investigate the existence and efficiency of approximate pure Nash equilibria which are obtained through sequences of unilateral improvement moves by the players. By exploiting a simple technique, we firstly show that these games admit an infinite set of d-approximate potential functions. This implies that there always exists a d-approximate pure Nash equilibrium which can be reached through any sequence of d-approximate improvement moves by the players. As a corollary, we also obtain that, under mild assumptions on the structure of the players' strategies, these games also admit a constant approximate potential function. Secondly, using a simple potential function argument, we are able to show that a (d+ δ)-approximate pure Nash equilibrium of cost at most (d+ 1)/(d+ δ) times the cost …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:HbR8gkJAVGIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Geometric clustering to minimize the sum of cluster sizes",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11561071_42",
            "Abstract": "We study geometric versions of the min-size k -clustering problem, a clustering problem which generalizes clustering to minimize the sum of cluster radii and has important applications. We prove that the problem can be solved in polynomial time when the points to be clustered are located on a line. For Euclidean spaces of higher dimensions, we show that the problem is NP-hard and present polynomial time approximation schemes. The latter result yields an improved approximation algorithm for the related problem of k-clustering to minimize the sum of cluster diameters.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Fractional and integral coloring of locally-symmetric sets of paths on binary trees",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24592-6_7",
            "Abstract": "Motivated by the problem of allocating optical bandwidth in tree–shaped WDM networks, we study the fractional path coloring problem in trees. We consider the class of locally-symmetric sets of paths on binary trees and prove that any such set of paths has a fractional coloring of cost at most 1.367L, where L denotes the load of the set of paths. Using this result, we obtain a randomized algorithm that colors any locally-symmetric set of paths of load L on a binary tree (with reasonable restrictions on its depth) using at most 1.367L+o(L) colors, with high probability.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Efficient on-line frequency allocation and call control in cellular networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-002-1003-4",
            "Abstract": " In this paper we consider communication issues arising in cellular (mobile) networks that utilize frequency division multiplexing (FDM) technology. In such networks, many users within the same geographical region can communicate simultaneously with other users of the network using distinct frequencies. The spectrum of available frequencies is limited; thus, efficient solutions to the frequency-allocation and the call-control problems are essential. In the frequency-allocation problem, given users that wish to communicate, the objective is to minimize the required spectrum of frequencies so that communication can be established without signal interference. The objective of the call-control problem is, given a spectrum of available frequencies and users that wish to communicate, to maximize the number of users served. We consider cellular, planar, and arbitrary network topologies. In particular, we …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Energy-efficient communication in multi-interface wireless networks",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-012-9384-5",
            "Abstract": "We study communication problems in wireless networks supporting multiple interfaces. In such networks, two nodes can communicate if they are close enough and share a common interface. The activation of each interface has a cost reflecting the energy consumed when a node uses this interface. We distinguish between the homogeneous and heterogeneous case, depending on whether all nodes have the same activation cost for each interface or not. For the homogeneous case, we present a (3/2+ϵ)-approximation algorithm for the problem of achieving connectivity with minimum activation cost, improving a previous bound of 2. For the heterogeneous case, we show that the connectivity problem is not approximable within a sublogarithmic factor in the number of nodes and present a logarithmic approximation algorithm for a more general problem that models group communication.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "When do noisy votes reveal the truth?",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2482540.2482570",
            "Abstract": "A well-studied approach to the design of voting rules views them as maximum likelihood estimators; given votes that are seen as noisy estimates of a true ranking of the alternatives, the rule must reconstruct the most likely true ranking. We argue that this is too stringent a requirement, and instead ask: How many votes does a voting rule need to reconstruct the true ranking? We define the family of pairwise-majority consistent rules, and show that for all rules in this family the number of samples required from the Mallows noise model is logarithmic in the number of alternatives, and that no rule can do asymptotically better (while some rules like plurality do much worse). Taking a more normative point of view, we consider voting rules that surely return the true ranking as the number of samples tends to infinity (we call this property accuracy in the limit); this allows us to move to a higher level of abstraction. We study …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:Fu2w8maKXqMC",
            "Publisher": "ACM"
        },
        {
            "Title": "Wavelength routing in all-optical tree networks: A survey",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.28.8125",
            "Abstract": "We study the problem of allocating optical bandwidth to sets of communication requests in all--optical networks that utilize Wavelength Division Multiplexing (WDM). WDM technology establishes communication between pairs of network nodes by establishing transmitter--receiver paths and assigning wavelengths to each path so that no two paths going through the same fiber link use the same wavelength. Optical bandwidth is the number of distinct wavelengths. Since state--of--the--art technology allows for a limited number of wavelengths, the engineering problem to be solved is to establish communication between pairs of nodes so that the total number of wavelengths used is minimized; this is known as the wavelength routing problem. In this paper, we survey recent advances in bandwidth allocation in tree--shaped WDM all--optical networks:--We present hardness results and lower bounds for the general problem and the special case of symmetric communication.--We give the main ideas of deterministic greedy algorithms and study their limitations.--We demonstrate how we can achieve optimal and nearly--optimal bandwidth utilization in networks with wavelength converters using simple algorithms.--We also present recent results about the use of randomization for wavelength routing. 1",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards more expressive cake cutting",
            "Publication year": 2011,
            "Publication url": "https://www.aaai.org/ocs/index.php/IJCAI/IJCAI11/paper/viewPaper/3057",
            "Abstract": "Cake cutting is a playful name for the problem of fairly dividing a heterogeneous divisible good among a set of agents. The agent valuations for different pieces of cake are typically assumed to be additive. However, in certain practical settings this assumption is invalid because agents may not have positive value for arbitrarily small\" crumbs\" of cake. In this paper, we propose a new, more expressive model of agent valuations that captures this feature. We present an approximately proportional algorithm for any number of agents that have such expressive valuations. The algorithm is optimal in the sense that no other algorithm can guarantee a greater worst-case degree of proportionality. We also design an optimal approximately proportional and fully envy-free algorithm for two agents.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On low-envy truthful allocations",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04428-1_10",
            "Abstract": "We study the problem of allocating a set of indivisible items to players having additive utility functions over the items. We consider allocations in which no player envies the bundle of items allocated to the other players too much. We present a simple proof that deterministic truthful allocations do not minimize envy by characterizing the truthful mechanisms for two players and two items. Also, we present an analysis for uniformly random allocations which are naturally truthful in expectation. These results simplify or improve previous results of Lipton et al.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Subset selection via implicit utilitarian voting",
            "Publication year": 2017,
            "Publication url": "https://www.jair.org/index.php/jair/article/view/11040",
            "Abstract": "How should one aggregate ordinal preferences expressed by voters into a measurably superior social choice? A well-established approach -- which we refer to as implicit utilitarian voting -- assumes that voters have latent utility functions that induce the reported rankings, and seeks voting rules that approximately maximize utilitarian social welfare. We extend this approach to the design of rules that select a subset of alternatives. We derive analytical bounds on the performance of optimal (deterministic as well as randomized) rules in terms of two measures, distortion and regret. Empirical results show that regret-based rules are more compelling than distortion-based rules, leading us to focus on developing a scalable implementation for the optimal (deterministic) regret-based rule. Our methods underlie the design and implementation of RoboVote.org, a not-for-profit website that helps users make group decisions via AI-driven voting methods.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web and Internet Economics: 15th International Conference, WINE 2019, New York, NY, USA, December 10–12, 2019, Proceedings",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=qMC_DwAAQBAJ&oi=fnd&pg=PP6&dq=info:kQHS36f5sFkJ:scholar.google.com&ots=_mpN_aPQ9j&sig=HfaOQ9B-ZT9N6xjqk-v-XxD2XO8",
            "Abstract": "This book constitutes the proceedings of the 14th International Conference on Web and Internet Economics, WINE 2019, held in New York City, USA, in December 2019. The 23 revised full papers presented were carefully reviewed and selected from 111 submissions. T The papers reflect the work of researchers in theoretical computer science, artificial intelligence, and microeconomics who have joined forces to tackle problems at the intersection of computation, game theory and economics.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:GtLg2Ama23sC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Welfare guarantees for proportional allocations",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-016-9674-4",
            "Abstract": "According to the proportional allocation mechanism from the network optimization literature, users compete for a divisible resource – such as bandwidth – by submitting bids. The mechanism allocates to each user a fraction of the resource that is proportional to her bid and collects an amount equal to her bid as payment. Since users act as utility-maximizers, this naturally defines a proportional allocation game. Syrgkanis and Tardos (STOC 2013) quantified the inefficiency of equilibria in this game with respect to the social welfare and presented a lower bound of 26.8 % on the price of anarchy over coarse-correlated and Bayes-Nash equilibria in the full and incomplete information settings, respectively. In this paper, we improve this bound to 50 % over both equilibrium concepts. Our analysis is simpler and, furthermore, we argue that it cannot be improved by arguments that do not take the equilibrium structure …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Minority becomes majority in social networks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-48995-6_6",
            "Abstract": "It is often observed that agents tend to imitate the behavior of their neighbors in a social network. This imitating behavior might lead to the strategic decision of adopting a public behavior that differs from what the agent believes is the right one and this can subvert the behavior of the population as a whole.In this paper, we consider the case in which agents express preferences over two alternatives and model social pressure with the majority dynamics: at each step an agent is selected and its preference is replaced by the majority of the preferences of her neighbors. In case of a tie, the agent does not change her current preference. A profile of the agents’ preferences is stable if the each agent’s preference coincides with the preference of at least half of the neighbors (thus, the system is in equilibrium).We ask whether there are network topologies that are robust to social pressure. That is, we ask …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Space lower bounds for low-stretch greedy embeddings",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397515001000",
            "Abstract": "Greedy (geometric) routing is an important paradigm for routing in communication networks. It uses an embedding of the nodes of a network into points of a space (eg, R d) equipped with a distance function (eg, the Euclidean distance ℓ 2) and uses as address of each node the coordinates of the corresponding point. The embedding has particular properties so that the routing decision for a packet is taken greedily based only on the addresses of the current node, its neighbors, and the destination node and the distances of the corresponding points. In this way, there is no need to keep extensive routing information (eg, routing tables) at the nodes. Embeddings that allow for this functionality are called greedy embeddings. Even though greedy embeddings do exist for several spaces and distance functions, they usually result in paths of high stretch, ie, significantly longer than the corresponding shortest paths. In this …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Greedy dynamic hot-potato routing on arrays",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/900283/",
            "Abstract": "We consider the problem of routing packets in two-dimensional torus-connected processor arrays. Motivated by theoretical work on dynamic routing, we address the dynamic case where packets are continuously injected into the network. We describe three greedy hot-potato routing algorithms and present simulation experiments on tori of several sizes using four well-known greedy (also known as work-conserving) protocols (namely FIFO, LIFO, FTG, and NTG) for the implementation of injection buffers. Our results demonstrate that there exists a greedy hot-potato routing algorithm that is stable for all greedy injection queueing protocols for injection rates very close to 100% of the network capacity. Furthermore, according to the algorithms we studied, we can claim that the one-pass property is not appropriate for the dynamic case, since the system cannot achieve stability at high injection rates.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An exponential improvement on the MST heuristic for the Minimum Energy Broadcasting problem",
            "Publication year": 2013,
            "Publication url": "http://www-sop.inria.fr/mascotte/Events/WorkshopScheduling/Slides/moscaredelli.pdf",
            "Abstract": "Given a set of stations S, let G (S) be the complete weighted graph in which the weight w (x, y) of each edge between stations x and y is the power consumption needed for a communication between x and y. A power assignment for S is a function p: S→ IR+ assigning a transmission power p (x) to every station in S. The total cost of a power assignment is cost (p)=∑ x∈ S p (x).",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:FAceZFleit8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Competitive algorithms and lower bounds for online randomized call control in cellular networks",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/net.20244",
            "Abstract": "We address an important communication issue arising in wireless cellular networks that utilize frequency division multiplexing (FDM) technology. In such networks, many users within the same geographical region (cell) can communicate simultaneously with other users of the network using distinct frequencies. The spectrum of the available frequencies is limited; thus, efficient solutions to the call control problem are essential. The objective of the call control problem is, given a spectrum of available frequencies and users that wish to communicate, to maximize the benefit, i.e., the number of users that communicate without signal interference. We consider cellular networks of reuse distance k ≥ 2 and we study the online version of the problem using competitive analysis. In cellular networks of reuse distance 2, the previously best known algorithm that beats the lower bound of 3 on the competitiveness of deterministic …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:r0BpntZqJG4C",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Approximate constrained bipartite edge coloring",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0166218X04000071",
            "Abstract": "We study the following Constrained Bipartite Edge Coloring problem: We are given a bipartite graph G=(U, V, E) of maximum degree l with n vertices, in which some of the edges have been legally colored with c colors. We wish to complete the coloring of the edges of G minimizing the total number of colors used. The problem has been proved to be NP-hard even for bipartite graphs of maximum degree three. Two special cases of the problem have been previously considered and tight upper and ower bounds on the optimal number of colors were proved. The upper bounds led to 3 2-approximation algorithms for both problems. In this paper we present a randomized (1.37+ o (1))-approximation algorithm for the general problem in the case where max {l, c}= ω (ln n). Our techniques are motivated by recent works on the Circular Arc Coloring problem and are essentially different and simpler than the existing ones.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:4JMBOYKVnBMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A Contribution to the Critique of Liquid Democracy.",
            "Publication year": 2019,
            "Publication url": "https://www.ijcai.org/Proceedings/2019/0017.pdf",
            "Abstract": "Liquid democracy, which combines features of direct and representative democracy has been proposed as a modern practice for collective decision making. Its advocates support that by allowing voters to delegate their vote to more informed voters can result in better decisions. In an attempt to evaluate the validity of such claims, we study liquid democracy as a means to discover an underlying ground truth. We revisit a recent model by Kahng et al.[2018] and conclude with three negative results, criticizing an important assumption of their modeling, as well as liquid democracy more generally. In particular, we first identify cases where natural local mechanisms are much worse than either direct voting or the other extreme of full delegation to a common dictator. We then show that delegating to less informed voters may considerably increase the chance of discovering the ground truth. Finally, we show that deciding delegations that maximize the probability to find the ground truth is a computationally hard problem.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:FPJr55Dyh1AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Short sequences of improvement moves lead to approximate equilibria in constraint satisfaction games",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00453-016-0143-x.pdf",
            "Abstract": "We present an algorithm that computes approximate pure Nash equilibria in a broad class of constraint satisfaction games that generalize the well-known cut and party affiliation games. Our results improve previous ones by Bhalgat et al. (EC 10) in terms of the obtained approximation guarantee. More importantly, our algorithm identifies a polynomially-long sequence of improvement moves from any initial state to an approximate equilibrium in these games. The existence of such short sequences is an interesting structural property which, to the best of our knowledge, was not known before. Our techniques adapt and extend our previous work for congestion games (FOCS 11) but the current analysis is considerably simpler.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Fractional Path Coloring in Bounded Degree Trees with Applications",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-009-9278-3",
            "Abstract": "This paper studies the natural linear programming relaxation of the path coloring problem. We prove constructively that finding an optimal fractional path coloring is Fixed Parameter Tractable (FPT), with the degree of the tree as parameter: the fractional coloring of paths in a bounded degree trees can be done in a time which is linear in the size of the tree, quadratic in the load of the set of paths, while exponential in the degree of the tree. We give an algorithm based on the generation of an efficient polynomial size linear program. Our algorithm is able to explore in polynomial time the exponential number of different fractional colorings, thanks to the notion of trace of a coloring that we introduce. We further give an upper bound on the cost of such a coloring in binary trees and extend this algorithm to bounded degree graphs with bounded treewidth. Finally, we also show some relationships between the …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Computing envy-freeable allocations with limited subsidies",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2002.02789",
            "Abstract": "Fair division has emerged as a very hot topic in multiagent systems, and envy-freeness is among the most compelling fairness concepts. An allocation of indivisible items to agents is envy-free if no agent prefers the bundle of any other agent to his own in terms of value. As envy-freeness is rarely a feasible goal, there is a recent focus on relaxations of its definition. An approach in this direction is to complement allocations with payments (or subsidies) to the agents. A feasible goal then is to achieve envy-freeness in terms of the total value an agent gets from the allocation and the subsidies. We consider the natural optimization problem of computing allocations that are {\\em envy-freeable} using the minimum amount of subsidies. As the problem is NP-hard, we focus on the design of approximation algorithms. On the positive side, we present an algorithm that, for a constant number of agents, approximates the minimum amount of subsidies within any required accuracy, at the expense of a graceful increase in the running time. On the negative side, we show that, for a super-constant number of agents, the problem of minimizing subsidies for envy-freeness is not only hard to compute exactly (as a folklore argument shows) but also, more importantly, hard to approximate.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Some simple scoring voting rules that are hard to bribe",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=4715677656689998403&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:g3aElNc5_aQC",
            "Publisher": "Manuscript"
        },
        {
            "Title": "The efficiency of resource allocation mechanisms for budget-constrained users",
            "Publication year": 2021,
            "Publication url": "https://pubsonline.informs.org/doi/abs/10.1287/moor.2020.1070",
            "Abstract": "We study the efficiency of mechanisms for allocating a divisible resource. Given scalar signals submitted by all users, such a mechanism decides the fraction of the resource that each user will receive and a payment that will be collected from her. Users are self-interested and aim to maximize their utility (defined as their value for the resource fraction they receive minus their payment). Starting with the seminal work of Johari and Tsitsiklis, a long list of papers studied the price of anarchy (in terms of the social welfare—the total users’ value) of resource allocation mechanisms for a variety of allocation and payment rules. Here, we further assume that each user has a budget constraint that invalidates strategies that yield a payment that is higher than the user’s budget. This subtle assumption, which is arguably more realistic, constitutes the traditional price of anarchy analysis meaningless as the set of equilibria may …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "INFORMS"
        },
        {
            "Title": "Revenue guarantees in the generalized second price auction",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2663497",
            "Abstract": "Sponsored search auctions are the main source of revenue for search engines. In such an auction, a set of utility maximizing advertisers competes for a set of ad slots. The assignment of advertisers to slots depends on the bids they submit; these bids may be different than the true valuations of the advertisers for the slots. Variants of the celebrated VCG auction mechanism guarantee that advertisers act truthfully and, under some assumptions, lead to revenue or social welfare maximization. Still, the sponsored search industry mostly uses generalized second price (GSP) auctions; these auctions are known to be nontruthful and suboptimal in terms of social welfare and revenue. In an attempt to explain this tradition, we study a Bayesian setting wherein the valuations of advertisers are drawn independently from a common regular probability distribution. In this setting, it is well known from the work of Myerson [1981] that …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:1qzjygNMrQYC",
            "Publisher": "ACM"
        },
        {
            "Title": "Minimum Energy Communication in Ad Hoc Wireless Networks",
            "Publication year": 2007,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420011296-48/minimum-energy-communication-ad-hoc-wireless-networks-ioannis-caragiannis-christos-kaklamanis-panagiotis-kanellopoulos-39-1",
            "Abstract": "Wireless networks have received significant attention during the recent years. Especially, ad hoc wireless networks emerged owing to their potential applications in environmental monitoring, sensing, specialized ad hoc distributed computations, emergency disaster relief, battlefield situations, and so forth [37, 41]. Unlike traditional wired networks or cellular wireless networks, no wired backbone infrastructure is installed for ad hoc networks.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:UHK10RUVsp4C",
            "Publisher": "Chapman and Hall/CRC"
        },
        {
            "Title": "Fractional and Integral Coloring of Locally-Symmetric Sets of Paths",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=14537293941308886713&hl=en&oi=scholarr",
            "Abstract": "Motivated by the problem of allocating optical bandwidth in tree-shaped WDM networks, we study the fractional path coloring problem in trees. We consider the class of locally-symmetric sets of paths on binary trees and prove that any such set of paths has a fractional coloring of cost at most 1.367L, where L denotes the load of the set of paths. Using this result, we obtain a randomized algorithm that colors any locally-symmetric set of paths of load L on a binary tree (with reasonable restrictions on its depth) using at most 1.367L+ 0 (L) colors, with high probability.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Springer"
        },
        {
            "Title": "A 6/5-approximation algorithm for the maximum 3-cover problem",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10878-011-9417-z",
            "Abstract": "In the maximum cover problem, we are given a collection of sets over a ground set of elements and a positive integer w, and we are asked to compute a collection of at most w sets whose union contains the maximum number of elements from the ground set. This is a fundamental combinatorial optimization problem with applications to resource allocation. We study the simplest APX-hard variant of the problem where all sets are of size at most 3 and we present a 6/5-approximation algorithm, improving the previously best known approximation guarantee. Our algorithm is based on the idea of first computing a large packing of disjoint sets of size 3 and then augmenting it by performing simple local improvements.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Edge coloring of bipartite graphs with constraints",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S030439750000400X",
            "Abstract": "A classical result from graph theory states that the edges of an l-regular bipartite graph can be colored using exactly l colors so that edges that share an endpoint are assigned different colors. In this paper, we study two constrained versions of the bipartite edge coloring problem.–Some of the edges adjacent to a specific pair of opposite vertices of an l-regular bipartite graph are already colored with S colors that appear only on one edge (single colors) and D colors that appear on two edges (double colors). We show that the rest of the edges can be colored using at most max {min {l+ D, 3l/2}, l+ (S+ D)/2} total colors. We also show that this bound is tight by constructing instances in which max {min {l+ D, 3l/2}, l+ (S+ D)/2} colors are indeed necessary.–Some of the edges of an l-regular bipartite graph are already colored with S colors that appear only on one edge. We show that the rest of the edges can be colored …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Network load games",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11602613_81",
            "Abstract": "We study network load games, a class of routing games in networks which generalize selfish routing games on networks consisting of parallel links. In these games, each user aims to route some traffic from a source to a destination so that the maximum load she experiences in the links of the network she occupies is minimum given the routing decisions of other users. We present results related to the existence, complexity, and price of anarchy of Pure Nash Equilibria for several network load games. As corollaries, we present interesting new statements related to the complexity of computing equilibria for selfish routing games in networks of restricted parallel links.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Randomized call control in sparse wireless cellular networks",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.8.105&rep=rep1&type=pdf",
            "Abstract": "We address an important communication issue arising in wireless cellular networks that utilize Frequency Division Multiplexing (FDM) technology. In such networks, many users within the same geographical region (cell) can communicate simultaneously with other users of the network using distinct frequencies. The spectrum of the available frequencies is limited; thus, e cient solutions to the call control problem are essential. The objective of the call control problem is, given a spectrum of available frequencies and users that wish to communicate, to maximize the bene t, ie, the number of users that communicate without signal interference. In previous work 4, 5], the authors study the performance of algorithm p {Random; an intuitive on-line randomized call control algorithm for wireless cellular networks where each cell is a regular hexagon. In practice, however, at least parts of the network are expected to be sparser and irregular. In the present work, we extend previous work on randomized call-control focusing on sparse wireless networks with irregular cell shape and small degree (three or four). We prove analytical upper bounds on the competitive ratio (de ned as the maximum over all possible sequences of calls of the ratio of the bene t of the algorithm over the ratio of the optimal o-line algorithm) of algorithm p {Random against oblivious adversaries as a function of the parameter p. Optimizing the upper bound function, we prove that algorithm p {Random is 9= 4 {and 2: 651 {competitive on sparse wireless cellular networks supporting one frequency of degree three and four, respectively. Our algorithms extend to networks with many frequencies.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:LI9QrySNdTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Generalized Discrete Preference Games.",
            "Publication year": 2016,
            "Publication url": "https://cs.au.dk/~iannis/publ/C76-ijcai16b.pdf",
            "Abstract": "Recently, much attention has been devoted to discrete preference games to model the formation of opinions in social networks. More specifically, these games model the agents’ strategic decision of expressing publicly an opinion, which is a result of an interplay between the agent’s private belief and the social pressure. However, these games have very limited expressive power; they can model only very simple social relations and they assume that all the agents respond to social pressure in the same way. In this paper, we define and study the novel class of generalized discrete preference games. These games have additional characteristics that can model social relations to allies or competitors and complex relations among more than two agents. Moreover, they introduce different levels of strength for each relation, and they personalize the dependence of each agent to her neighborhood. We show that these novel games admit generalized ordinal potential functions and, more importantly, that every two-strategy game that admits a generalized ordinal potential function is structurally equivalent to a generalized discrete preference game. This implies that the games in this novel class capture the full generality of two-strategy games in which the existence of (pure) equilibria is guaranteed by topological arguments.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Portioning using ordinal preferences: Fairness and efficiency",
            "Publication year": 2019,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02410292/",
            "Abstract": "A public divisible resource is to be divided among projects. We study rules that decide on a distribution of the budget when voters have ordinal preference rankings over projects. Examples of such portioning problems are participatory budgeting, time shares, and parliament elections. We introduce a family of rules for portioning, inspired by positional scoring rules. Rules in this family are given by a scoring vector (such as plurality or Borda) associating a positive value with each rank in a vote, and an aggregation function such as leximin or the Nash product. Our family contains well-studied rules, but most are new. We discuss computational and normative properties of our rules. We focus on fairness, and introduce the SD-core, a group fairness notion. Our Nash rules are in the SD-core, and the leximin rules satisfy individual fairness properties. Both are Pareto-efficient.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An improved 2-agent kidney exchange mechanism",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-25510-6_4",
            "Abstract": "We study a mechanism design version of matching computation in graphs that models the game played by hospitals participating in pairwise kidney exchange programs. We present a new randomized matching mechanism for two agents which is truthful in expectation and has an approximation ratio of 3/2 to the maximum cardinality matching. This is an improvement over a recent upper bound of 2 [Ashlagi et al., EC 2010] and, furthermore, our mechanism beats for the first time the lower bound on the approximation ratio of deterministic truthful mechanisms. We complement our positive result with new lower bounds. Among other statements, we prove that the weaker incentive compatibility property of truthfulness in expectation in our mechanism is necessary; universally truthful mechanisms that have an inclusion-maximality property have an approximation ratio of at least 2.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Enforcing efficient equilibria in network design games via subsidies",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-013-9845-5",
            "Abstract": "The efficient design of networks has been an important engineering task that involves challenging combinatorial optimization problems. Typically, a network designer has to select among several alternatives which links to establish so that the resulting network satisfies a given set of connectivity requirements and the cost of establishing the network links is as low as possible. The Minimum Spanning Tree problem, which is well-understood, is a nice example. In this paper, we consider the natural scenario in which the connectivity requirements are posed by selfish users who have agreed to share the cost of the network to be established according to a well-defined rule. The design proposed by the network designer should now be consistent not only with the connectivity requirements but also with the selfishness of the users. Essentially, the users are players in a so-called network design game and the network …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Approximate Path Coloring with Applications to Wavelength Assignment in WDM Optical",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=16414673317378061618&hl=en&oi=scholarr",
            "Abstract": "Motivated by the wavelength assignment problem in WDM optical networks, we study path coloring problems in graphs. Given a set of paths P on a graph G, the path coloring problem is to color the paths of P so that no two paths traversing the same edge of G are assigned the same color and the total number of colors used is minimized. The problem has been proved to be NP-hard even for trees and rings. Using optimal solutions to fractional path coloring, a natural relaxation of path coloring, on which we apply a randomized rounding technique combined with existing coloring algorithms, we obtain new upper bounds on the minimum number of colors sufficient to color any set of paths on any graph. The upper bounds are either existential or constructive. The existential upper bounds significantly improve existing ones provided that the cost of the optimal fractional path coloring is sufficiently large and the dilation of the set of paths is small. Our algorithmic results include improved approximation algorithms for path coloring in rings and in bidirected trees. Our results extend to variations of the original path coloring problem arizing in multifiber WDM optical networks.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:umqufdRvDiIC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Space lower bounds for low-stretch greedy embeddings",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-31104-8_1",
            "Abstract": "Greedy (geometric) routing is an important paradigm for routing in communication networks. It uses an embedding of the nodes of the network into points of a metric space (eg,) equipped with a distance function (eg, the Euclidean distance ℓ 2) and uses as address of each node the coordinates of the corresponding point. The embedding has particular properties so that the routing decision for a packet is taken greedily based only on the addresses of the current node, its neighbors, and the destination node and the distances of the corresponding points. In this way, there is no need to keep routing tables at the nodes. Embeddings that allow for this functionality are called greedy embeddings. Even though greedy embeddings do exist for several metric spaces and distance functions, they usually result in paths of high stretch, ie, significantly longer than the corresponding shortest paths. In this paper, we show that …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Energy consumption minimization in ad hoc wireless and multi-interface networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02250-0_13",
            "Abstract": "This chapter deals with energy consumption issues in wireless networks. In such networks, energy is a scarce resource and, hence, it must be used efficiently. Under these circumstances, we consider two interesting combinatorial optimization problems: Minimum Energy Broadcast Routing and Cost Minimization in Multi-interface Networks. The goal of the first problem is to perform broadcasting from a given source while minimizing the overall energy required for communication. The second problem refers to the choice of activating a set of available communication interfaces at the network nodes in order to satisfy the required connections in a wireless multi-interface network with minimum total cost. While Minimum Energy Broadcast Routing                  has been studied extensively during recent years, Cost Minimization in Multi-interface Networks                                     is rather new. For both problems we …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Stable fractional matchings",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S000437022030165X",
            "Abstract": "We study a generalization of the classical stable matching problem that allows for cardinal preferences (as opposed to ordinal) and fractional matchings (as opposed to integral). In this cardinal setting, stable fractional matchings can have much larger social welfare than stable integral ones. Our goal is to understand the computational complexity of finding an optimal (i.e., welfare-maximizing) stable fractional matching. We consider both exact and approximate stability notions, and provide simple approximation algorithms with weak welfare guarantees. Our main result is that, somewhat surprisingly, achieving better approximations is computationally hard. To the best of our knowledge, these are the first computational complexity results for stable fractional matchings in the cardinal model. En route to these results, we provide a number of structural observations that could be of independent interest.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:xtoqd-5pKcoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Robustness in discrete preference games",
            "Publication year": 2017,
            "Publication url": "http://www.ifaamas.org/Proceedings/aamas2017/pdfs/p1314.pdf",
            "Abstract": "In a discrete preference game, each agent is equipped with an internal belief and declares her preference from a discrete set of alternatives. The payoff of an agent depends on whether the declared preference agrees with the belief of the agent and on the coordination with the preferences declared by the neighbors of the agent in the underlying social network. These games have been used to model the formation of opinions and the adoption of innovations in social networks. Recently, researchers have obtained bounds on the Price of Anarchy and on the Price of Stability of discrete preference games and they have studied to which extent the winning preference reached via best-response dynamics disagrees with the majority of beliefs. In this work, we investigate the robustness of these results to variants of the model. Our starting point is the observation that bounds on the Price of Anarchy and Stability can be very dependent on the way the quality of an equilibrium is measured. On the other side, results about the disagreement between majority at equilibria and majority among beliefs continue to hold even if we consider different classes of dynamics, such as noworse-response dynamics, best response with multiple players updating at the same time, or with weighted neighbors.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Almost envy-free allocations with connected bundles",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1808.09406",
            "Abstract": "We study the existence of allocations of indivisible goods that are envy-free up to one good (EF1), under the additional constraint that each bundle needs to be connected in an underlying item graph G. When the items are arranged in a path, we show that EF1 allocations are guaranteed to exist for arbitrary monotonic utility functions over bundles, provided that either there are at most four agents, or there are any number of agents but they all have identical utility functions. Our existence proofs are based on classical arguments from the divisible cake-cutting setting, and involve discrete analogues of cut-and-choose, of Stromquist's moving-knife protocol, and of the Su-Simmons argument based on Sperner's lemma. Sperner's lemma can also be used to show that on a path, an EF2 allocation exists for any number of agents. Except for the results using Sperner's lemma, all of our procedures can be implemented by efficient algorithms. Our positive results for paths imply the existence of connected EF1 or EF2 allocations whenever G is traceable, i.e., contains a Hamiltonian path. For the case of two agents, we completely characterize the class of graphs  that guarantee the existence of EF1 allocations as the class of graphs whose biconnected components are arranged in a path. This class is strictly larger than the class of traceable graphs; one can be check in linear time whether a graph belongs to this class, and if so return an EF1 allocation.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:4MWp96NkSFoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Topic 12: Theory and Algorithms for Parallel Computation",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-85451-7_93",
            "Abstract": "Parallelism permeates all levels of current computing systems, from single CPU machines to large server farms. Effective use of parallelism relies crucially on the availability of suitable models of computation for algorithm design and analysis, and of efficient strategies for the solution of key computational problems on prominent classes of platforms, as well as of good models of the way the different components are interconnected. With the advent of multicore parallel machines, new models and paradigms are needed to allow parallel programming to advance into mainstream computing. Topic 12 focuses on contibutions providing new results on foundational issues of parallelism in computing and/or proposing improved approaches for the solution of specific algorithmic problems.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:vDijr-p_gm4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Learning a Ground Truth Ranking Using Noisy Approval Votes.",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Caragiannis/publication/318829589_Learning_a_Ground_Truth_Ranking_Using_Noisy_Approval_Votes/links/59ad05c4aca272f8a15c6e21/Learning-a-Ground-Truth-Ranking-Using-Noisy-Approval-Votes.pdf",
            "Abstract": "We consider a voting scenario where agents have opinions that are estimates of an underlying common ground truth ranking of the available alternatives, and each agent is asked to approve a set with her most preferred alternatives. We assume that estimates are implicitly formed using the well-known Mallows model for generating random rankings. We show that k-approval voting—where all agents are asked to approve the same number k of alternatives and the outcome is obtained by sorting the alternatives in terms of their number of approvals—has exponential sample complexity for all values of k. This negative result suggests that an exponential (in terms of the number of alternatives m) number of agents is always necessary in order to recover the ground truth ranking with high probability. In contrast, by just asking each agent to approve a random number of alternatives, the sample complexity improves dramatically: it now depends only polynomially on m. Our results may have implications on the effectiveness of crowdsourcing applications that ask workers to provide their input by approving sets of available alternatives.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Truthful Facility Assignment with Resource Augmentation: An Exact Analysis of Serial Dictatorship",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=zzayDQAAQBAJ&oi=fnd&pg=PA236&dq=info:mMBo3wfOE5EJ:scholar.google.com&ots=kwU6xdF2BH&sig=JD2_UbSMx5T9gRjdCMiqRhBdFhE",
            "Abstract": "We study the truthful facility assignment problem, where a set of agents with private most-preferred points on a metric space are assigned to facilities that lie on the metric space, under capacity constraints on the facilities. The goal is to produce such an assignment that minimizes the social cost, ie, the total distance between the mostpreferred points of the agents and their corresponding facilities in the assignment, under the constraint of truthfulness, which ensures that agents do not misreport their most-preferred points. We propose a resource augmentation framework, where a truthful mechanism is evaluated by its worst-case performance on an instance with enhanced facility capacities against the optimal mechanism on the same instance with the original capacities. We study a well-known mechanism, Serial Dictatorship, and provide an exact analysis of its performance. Among other results, we prove that Serial Dictatorship has approximation ratio g/(g− 2) when the capacities are multiplied by any integer g≥ 3. Our results suggest that even a limited augmentation of the resources can have wondrous effects on the performance of the mechanism and in particular, the approximation ratio goes to 1 as the augmentation factor becomes large. We complement our results",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:_axFR9aDTf0C",
            "Publisher": "Springer"
        },
        {
            "Title": "Truthful facility assignment with resource augmentation: An exact analysis of serial dictatorship",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-662-54110-4_17.pdf",
            "Abstract": "We study the truthful facility assignment problem, where a set of agents with private most-preferred points on a metric space are assigned to facilities that lie on the metric space, under capacity constraints on the facilities. The goal is to produce such an assignment that minimizes the social cost, i.e., the total distance between the most-preferred points of the agents and their corresponding facilities in the assignment, under the constraint of truthfulness, which ensures that agents do not misreport their most-preferred points.We propose a resource augmentation framework, where a truthful mechanism is evaluated by its worst-case performance on an instance with enhanced facility capacities against the optimal mechanism on the same instance with the original capacities. We study a well-known mechanism, Serial Dictatorship, and provide an exact analysis of its performance. Among other results, we prove that …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Biased games",
            "Publication year": 2014,
            "Publication url": "https://ojs.aaai.org/index.php/AAAI/article/view/8831",
            "Abstract": "We present a novel extension of normal form games that we call biased games. In these games, a player's utility is influenced by the distance between his mixed strategy and a given base strategy. We argue that biased games capture important aspects of the interaction between software agents. Our main result is that biased games satisfying certain mild conditions always admit an equilibrium. We also tackle the computation of equilibria in biased games.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ioannis Caragiannis, Christos Kaklamanis, and Pino Perisano. Randomized path coloring on binary tree",
            "Publication year": 2000,
            "Publication url": "https://ci.nii.ac.jp/naid/10015326299/",
            "Abstract": "CiNii 論文 - Ioannis Caragiannis, Christos Kaklamanis, and Pino Perisano. Randomized path \ncoloring on binary tree CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 \n出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について Ioannis Caragiannis, Christos \nKaklamanis, and Pino Perisano. Randomized path coloring on binary tree AULETTA Vincenzo \n被引用文献: 1件 著者 AULETTA Vincenzo 収録刊行物 Proceedings of the 3rd International \nWorkship on Aproximation Algorihtms for Combinatorial Optimization, September 2000 \nProceedings of the 3rd International Workship on Aproximation Algorihtms for Combinatorial \nOptimization, September 2000, 2000 被引用文献: 1件中 1-1件を 表示 1 2-パス光最適, . (…",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:e_rmSamDkqQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The efficiency of fair division",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s00224-011-9359-y",
            "Abstract": "In this paper we study the impact of fairness on the efficiency of allocations. We consider three different notions of fairness, namely proportionality, envy-freeness, and equitability for allocations of divisible and indivisible goods and chores. We present a series of results on the price of fairness under the three different notions that quantify the efficiency loss in fair allocations compared to optimal ones. Most of our bounds are either exact or tight within constant factors. Our study is of an optimistic nature and aims to identify the potential of fairness in allocations.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Simple posted pricing mechanisms for selling a divisible item",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2007.08246",
            "Abstract": "We study the problem of selling a divisible item to agents who have concave valuation functions for fractions of the item. This is a fundamental problem with apparent applications to pricing communication bandwidth or cloud computing services. We focus on simple sequential posted pricing mechanisms that use linear pricing, i.e., a fixed price for the whole item and proportional prices for fractions of it. We present results of the following form that can be thought of as analogs of the well-known prophet inequality of Samuel-Cahn (1984). For , if there is a linear pricing so that sequential posted pricing sells a -fraction of the item, this results in a -approximation of the optimal social welfare. The value of  can be improved to approximately  if sequential posted pricing considers the agents in random order. We also show that the best linear pricing yields an expected revenue that is at most  times smaller than the optimal one, where  is a bound on the curvature of the valuation functions. The proof extends and exploits the approach of Alaei et al. (2019) and bounds the revenue gap by the objective value of a mathematical program. The dependence of the revenue gap on  is unavoidable as a lower bound of  indicates.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Basic computations in wireless networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11602613_54",
            "Abstract": "In this paper we address the problem of estimating the number of stations in a wireless network. Under the assumption that each station can detect collisions, we show that it is possible to estimate the number stations in the network within a factor 2 from the correct value in time O(log n log log n). We further show that if no station can detect collisions, the same task can be accomplished within a factor of 3 in time O(log2 n) and maximum energy O(log n) per node, with high probability. Finally, we present an algorithm that computes the minimum value held by the stations in the wireless network in time O(log2 n).",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Simple On-Line Algorithms for Call Control",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=7453100600597921340&hl=en&oi=scholarr",
            "Abstract": "We address an important communication issue in wireless cellular networks that utilize Frequency Division Multiplexing (FDM) technology. In such networks, many users within the same geographical region (cell) can communicate simultaneously with other users of the network using distinct frequencies. The spectrum of the available fre-quencies is limited; thus, efficient solutions to the call control problem are essential. The objective of the call control problem is, given a spectrum of available frequencies and users that wish to communicate, to maximize the number of users that communicate without signal inter-ference. We consider cellular networks of reuse distance k> 2 and we study the on-line version of the problem using competitive analysis. In cellular networks of reuse distance 2, the previously best known algorithm that beats the lower bound of 3 on the competitiveness of de-terministic algorithms works on networks with one frequency, achieves a competitive ratio against oblivious adversaries which is between 2.469 and 2.651, and uses a number of random bits at least proportional to the size of the network. We significantly improve this result by presenting a series of simple randomized algorithms that have competitive ratios smaller than 3, work on networks with arbitrarily many frequencies, and use only a constant number of random bits or a comparable weak random source. The best competitiveness upper bound we obtain is 7/3.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:4hFrxpcac9AC",
            "Publisher": "Springer"
        },
        {
            "Title": "Computing approximate pure Nash equilibria in weighted congestion games with polynomial latency functions",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Angelo-Fanelli/publication/51951260_Approximate_Pure_Nash_Equilibria_in_Weighted_Congestion_GamesExistence_Efficient_Computation_and_Structure/links/09e41509b8192345bf000000/Approximate-Pure-Nash-Equilibria-in-Weighted-Congestion-Games-Existence-Efficient-Computation-and-Structure.pdf",
            "Abstract": "We present an efficient algorithm for computing O (1)-approximate pure Nash equilibria in weighted congestion games with polynomial latency functions of constant maximum degree. For games with linear latency functions, the approximation guarantee is 3+√ 5",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Competitive analysis of on-line randomized call control in cellular networks",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/924944/",
            "Abstract": "In this paper we address an important communication issue arising in cellular (mobile) networks that utilize Frequency Division Multiplexing (FDM) technology. In such networks, many users within the same geographical region can communicate simultaneously with other users of the network using distinct frequencies. The spectrum of the available frequencies is limited; thus, efficient solutions to the call control problem are essential. The objective of the call control problem is, given a spectrum of available frequencies and users that wish to communicate, to maximize the number of users that communicate without signal interference. Using competitive analysis, we study the performance of algorithm p-RANDOM; an intuitive on-line randomized call control algorithm proposed previously for cellular networks. We give upper and lower bounds of its competitive ratio against oblivious adversaries as a function of the …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:WZBGuue-350C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficiency and complexity of price competition among single-product vendors",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370217300292",
            "Abstract": "Motivated by recent progress on pricing in the AI literature, we study marketplaces that contain multiple vendors offering identical or similar products and unit-demand buyers with different valuations on these vendors. The objective of each vendor is to set the price of its product to a fixed value so that its profit is maximized. The profit depends on the vendor's price itself and the total volume of buyers that find the particular price more attractive than the price of the vendor's competitors. We model the behavior of buyers and vendors as a two-stage full-information game and study a series of questions related to the existence, efficiency (price of anarchy) and computational complexity of equilibria in this game. To overcome situations where equilibria do not exist or exist but are highly inefficient, we consider the scenario where some of the vendors are subsidized in order to keep prices low and buyers highly satisfied.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A 6/5-approximation algorithm for the maximum 3-cover problem",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-85238-4_16",
            "Abstract": "In the maximum cover problem, we are given a collection of sets over a ground set of elements and a positive integer w, and we are asked to compute a collection of at most w sets whose union contains the maximum number of elements from the ground set. This is a fundamental combinatorial optimization problem with applications to resource allocation. We study the simplest APX-hard variant of the problem where all sets are of size at most 3 and we present a 6/5-approximation algorithm, improving the previously best known approximation guarantee. Our algorithm is based on the idea of first computing a large packing of disjoint sets of size 3 and then augmenting it by performing simple local improvements.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Euro-Par 2013: Parallel Processing Workshops: BigDataCloud, DIHC, FedICI, HeteroPar, HiBB, LSDVE, MHPC, OMHI, PADABS, PROPER, Resilience, ROME, UCHPC 2013, Aachen, Germany, August 26-30, 2013. Revised Selected Papers",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=C825BQAAQBAJ&oi=fnd&pg=PR6&dq=info:5TCtSvRXH8EJ:scholar.google.com&ots=DlozQ857jR&sig=Ht92ErWVpMRqOs1lOcOWjWmsSxU",
            "Abstract": "This book constitutes thoroughly refereed post-conference proceedings of the workshops of the 19th International Conference on Parallel Computing, Euro-Par 2013, held in Aachen, Germany in August 2013. The 99 papers presented were carefully reviewed and selected from 145 submissions. The papers include seven workshops that have been co-located with Euro-Par in the previous years:-Big Data Cloud (Second Workshop on Big Data Management in Clouds)-Hetero Par (11th Workshop on Algorithms, Models and Tools for Parallel Computing on Heterogeneous Platforms)-HiBB (Fourth Workshop on High Performance Bioinformatics and Biomedicine)-OMHI (Second Workshop on On-chip Memory Hierarchies and Interconnects)-PROPER (Sixth Workshop on Productivity and Performance)-Resilience (Sixth Workshop on Resiliency in High Performance Computing with Clusters, Clouds, and Grids)-UCHPC (Sixth Workshop on Un Conventional High Performance Computing) as well as six newcomers:-DIHC (First Workshop on Dependability and Interoperability in Heterogeneous Clouds)-Fed ICI (First Workshop on Federative and Interoperable Cloud Infrastructures)-LSDVE (First Workshop on Large Scale Distributed Virtual Environments on Clouds and P2P)-MHPC (Workshop on Middleware for HPC and Big Data Systems)-PADABS (First Workshop on Parallel and Distributed Agent Based Simulations)-ROME (First Workshop on Runtime and Operating Systems for the Many core Era) All these workshops focus on promotion and advancement of all aspects of parallel and distributed computing.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:XoXfffV-tXoC",
            "Publisher": "Springer"
        },
        {
            "Title": "Game-theoretic approaches to optimization problems in communication networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02250-0_9",
            "Abstract": "In this chapter we consider fundamental optimization problems arising in communication networks. We consider scenarios where there is no central authority that coordinates the network users in order to achieve efficient solutions. Instead, the users act in an uncoordinated and selfish manner and reach solutions to the above problems that are consistent only with their selfishness. In this sense, the users act aiming to optimize their own objectives with no regard to the globally optimum system performance. Such a behavior poses several intriguing questions ranging from the definition of reasonable and practical models for studying it to the quantification of the efficiency loss due to the lack of users’ cooperation. We present several results we achieved recently in this research area and propose interesting future research directions.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Knowledge, fairness, and social constraints",
            "Publication year": 2018,
            "Publication url": "https://ojs.aaai.org/index.php/AAAI/article/view/11590",
            "Abstract": "In the context of fair allocation of indivisible items, fairness concepts often compare the satisfaction of an agent to the satisfaction she would have from items that are not allocated to her: in particular, envy-freeness requires that no agent prefers the share of someone else to her own share. We argue that these notions could also be defined relative to the knowledge that an agent has on how the items that she does not receive are distributed among other agents. We define a family of epistemic notions of envy-freeness, parameterized by a social graph, where an agent observes the share of her neighbours but not of her non-neighbours. We also define an intermediate notion between envy-freeness and proportionality, also parameterized by a social graph. These weaker notions of envy-freeness are useful when seeking a fair allocation, since envy-freeness is often too strong. We position these notions with respect to known ones, thus revealing new rich hierarchies of fairness concepts. Finally, we present a very general framework that covers all the existing and many new fairness concepts.",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Limitations of deterministic auction design for correlated bidders",
            "Publication year": 2016,
            "Publication url": "https://ora.ox.ac.uk/objects/uuid:abc35962-faf2-4545-af52-cefe3a82d404",
            "Abstract": "The seminal work of Myerson (Mathematics of OR ’81) characterizes incentive-compatible single-item auctions among bidders with independent valuations. In this setting, relatively simple deterministic auction mechanisms achieve revenue optimality. When bidders have correlated valuations, designing the revenue-optimal deterministic auction is a computationally demanding problem; indeed, Papadimitriou and Pierrakos (STOC ’11) proved that it is APX-hard, obtaining an explicit inapproximability factor of 1999/2000 = 99.95%. In the current paper, we strengthen this inapproximability factor to 63/64 ≈ 98.5%. Our proof is based on a gap-preserving reduction from the Max-NM 3SAT problem; a variant of the maximum satisfiability problem where each clause has exactly 3 literals and no clause contains both negated and unnegated literals. We furthermore show that the gap between the revenue of deterministic and randomized auctions can be as low as 13/14 ≈ 92.9%, improving an explicit gap of 947/948 ≈ 99.9% by Dobzinski, Fu, and Kleinberg (STOC ’11).",
            "Abstract entirety": 1,
            "Author pub id": "FSIQi4IAAAAJ:8d8msizDQcsC",
            "Publisher": "Association for Computing Machinery"
        },
        {
            "Title": "How effective can simple ordinal peer grading be?",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2940716.2940748",
            "Abstract": "Ordinal peer grading has been proposed as a simple and scalable solution for computing reliable information about student performance in massive open online courses. The idea is to outsource the grading task to the students themselves as follows. After the end of an exam, each student is asked to rank---in terms of quality---a bundle of exam papers by fellow students. An aggregation rule will then combine the individual rankings into a global one that contains all students. We define a broad class of simple aggregation rules and present a theoretical framework for assessing their effectiveness. When statistical information about the grading behaviour of students is available, the framework can be used to compute the optimal rule from this class with respect to a series of performance objectives. For example, a natural rule known as Borda is proved to be optimal when students grade correctly. In addition, we …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the approximability of Dodgson and Young elections",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370212000434",
            "Abstract": "The voting rules proposed by Dodgson and Young are both designed to find an alternative closest to being a Condorcet winner, according to two different notions of proximity; the score of a given alternative is known to be hard to compute under either rule. In this paper, we put forward two algorithms for approximating the Dodgson score: a combinatorial, greedy algorithm and an LP-based algorithm, both of which yield an approximation ratio of H m− 1, where m is the number of alternatives and H m− 1 is the (m− 1) st harmonic number. We also prove that our algorithms are optimal within a factor of 2, unless problems in NP have quasi-polynomial-time algorithms. Despite the intuitive appeal of the greedy algorithm, we argue that the LP-based algorithm has an advantage from a social choice point of view. Further, we demonstrate that computing any reasonable approximation of the ranking produced by Dodgsonʼs …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Power Consumption Problems",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=4672143635413636864&hl=en&oi=scholarr",
            "Abstract": "A node (or station) in these networks is equipped with an omnidirectional antenna which is responsible for sending and receiving signals. Communication is established by assigning to each station a transmitting power. In the most common power attenuation model (13), the signal power falls as 1/ra, where r is the distance from the transmitter and a is a constant which depends on the wireless environment (typical values of a are between 1 and 6). So, a transmitter can send a signal to a receiver if 26.6 a> y where P, is the power of the transmitting signal, d (s, t) is the Euclidean distance between the transmitter and the receiver, and y is the receiver's power threshold for signal detection which is usually normalized to 1. So, communication from a node s to another node t may be established either directly if the two nodes are close enough and s uses adequate transmitting power, or by using intermediate nodes. Observe that due to the nonlinear power attenuation, relaying the signal between intermediate nodes may result in smaller power consumption. A crucial issue in ad hoc wireless networks is to support communication pat-terns that are typical in traditional networks. These include broadcasting, multicasting, and gossiping (all-to-all communication). Since establishing a commu-nication pattern strongly depends on the power levels, the important engineering question to be solved is to guarantee a desired communication pattern minimiz-ing the total power consumption. In this work, we consider a series of power consumption problems which we formulate below. Consider a complete directed graph G=(V, E), where IV= n, with a nonnegative …",
            "Abstract entirety": 0,
            "Author pub id": "FSIQi4IAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Springer"
        }
    ]
}]