[{
    "name": "Ιωάννης Τόλλης",
    "romanize name": "Ioannis Tollis",
    "School-Department": "Επιστήμης Υπολογιστών",
    "University": "uoc",
    "Rank": "Καθηγητής",
    "Apella_id": 18418,
    "Scholar name": "Ioannis G. Tollis",
    "Scholar id": "KmWfVqoAAAAJ",
    "Affiliation": "Professor of Computer Science, Univ. of Crete",
    "Citedby": 9942,
    "Interests": [
        "Graph Drawing",
        "Network Visualization",
        "Graph Analytics",
        "Graph Algorithms",
        "Algorithm Engineering"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=KmWfVqoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Constant-Time Reachability in DAGs Using Multidimensional Dominance Drawings",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s42979-021-00713-6",
            "Abstract": "Answering reachability queries in directed acyclic graphs is an operation required by many applications. In this paper, we present efficient algorithms to construct and search a space-efficient data structure in the k-dimensional space that is based on Graph Dominance Drawing. Our algorithms construct this data structure in O (km) time, while it can be stored in O (kn) space. Any reachability query is answered in constant time, since no “falsely implied paths (fips)” are introduced. We also present experimental results that show that the number of dimensions, k, in the solutions produced by our techniques is low. Additionally, we present a new method for constructing random DAGs with prespecified structure and density. The analysis of our experimental results reveals an interesting interplay between density and structure.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:HJSXoJQnj-YC",
            "Publisher": "Springer Singapore"
        },
        {
            "Title": "Effective graph visualization via node grouping",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:PVgj2kMGcgYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "GraphBook: Making Graph Paging Real⋆",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-662-45803-7.pdf#page=527",
            "Abstract": "In the last years we observed an impressive growth of different mobile devices, like tablets and smartphones, that allow people to access and share a large variety of contents. These devices are often used to access social networks, route networks, or other kinds of networks that for example may deal with the job of the user. Although designing drawing algorithms and visualization systems tailored for mobile devices would be the best choice in this case (see, eg,[1]), this is often not possible, as for example the drawing of the network might be computed by some diagram server in a collaborative environment, or attached to an e-mail, or returned by a web application that does not consider limited display capabilities. We present a system whose goal is to facilitate the reading of a given drawing on a mobile device by exploiting an analogy with electronic books 1. It takes as input a drawing Γ of a graph G=(V, E) and …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms and bounds for L-drawings of directed graphs",
            "Publication year": 2018,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0129054118410010",
            "Abstract": "We introduce L-drawings, a novel paradigm for representing directed graphs aiming at combining the readability features of orthogonal drawings with the expressive power of adjacency matrix representations. In an L-drawing, vertices have exclusive - and -coordinates and edges consist of two segments, one exiting the source vertically and one entering the destination horizontally.We study the problem of computing L-drawings using minimum ink. We prove its NP-hardness and provide a heuristic based on a polynomial-time algorithm that adds a vertex to a drawing using the minimum additional ink. We performed an experimental analysis of the heuristic which confirms its effectiveness.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:jU7OWUQzBzMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "SYMBIOmatics: Synergies in Medical Informatics and Bioinformatics–exploring current scientific literature for emerging topics",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2105-8-S1-S18",
            "Abstract": "The SYMBIOmatics Specific Support Action (SSA) is \"an information gathering and dissemination activity\" that seeks \"to identify synergies between the bioinformatics and the medical informatics\" domain to improve collaborative progress between both domains (ref. to                      http://www.symbiomatics.org                                        ). As part of the project experts in both research fields will be identified and approached through a survey. To provide input to the survey, the scientific literature was analysed to extract topics relevant to both medical informatics and bioinformatics. This paper presents results of a systematic analysis of the scientific literature from medical informatics research and bioinformatics research. In the analysis pairs of words (bigrams) from the leading bioinformatics and medical informatics journals have been used as indication of existing and emerging technologies and topics over the period 2000 …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:-f6ydRqryjwC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "On the complexity of the Edge Label Placement problem☆☆ Research supported in part by NIST, Advanced Technology Program grant number 70NANB5H1162.",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925772100000250",
            "Abstract": "Let G (V, E) be a graph, and let Γ be a drawing of G in the plane. We consider the problem of positioning text or symbol labels corresponding to edges of G, called the Edge Label Placement (ELP) problem. The goal is to convey the information associated with each edge (that a label for that edge describes) in the best possible way, by positioning each label in the most appropriate place. In this paper we consider the issues involved with the automatic placement of edge labels and present a model for the ELP problem. Also, we investigate the computational complexity of the ELP problem and prove that various forms of the ELP problem are NP-hard.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:j7_hQOaDUrUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Weak dominance drawings and linear extension diameter",
            "Publication year": 2011,
            "Publication url": "https://arxiv.org/abs/1108.1439",
            "Abstract": "We introduce the problem of Weak Dominance Drawing for general directed acyclic graphs and we show the connection with the linear extension diameter of a partial order P. We present complexity results and bounds.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:HhcuHIWmDEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms for the multiple label placement problem",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925772106000344",
            "Abstract": "We consider the problem of positioning text or symbol labels associated with graphical features of two dimensional maps (geographical or technical) or drawings. In many practical applications each graphical feature may have more than one label. The need for assigning multiple labels is necessary to display different attributes of an object. Even though many algorithms exist for the labeling problem, very little work has been directed towards positioning multiple labels per graphical feature in a map or drawing. We refer to this problem as the Multiple Label Placement (MLP) problem. In this paper we present a model and expand the rules that govern a good assignment of several labels per graphical feature. In addition we introduce techniques to solve this problem. We have applied these techniques to drawings of graphs, and we present very encouraging experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "L-Drawings of Directed Graphs",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-662-49192-8.pdf#page=145",
            "Abstract": "We introduce L-drawings, a novel paradigm for representing directed graphs aiming at combining the readability features of orthogonal drawings with the expressive power of matrix representations. In an L-drawing, vertices have exclusive x-and y-coordinates and edges consist of two segments, one exiting the source vertically and one entering the destination horizontally.We study the problem of computing L-drawings using minimum ink. We prove its NP-completeness and provide a heuristic based on a polynomial-time algorithm that adds a vertex to a drawing using the minimum additional ink. We performed an experimental analysis of the heuristic which confirms its effectiveness.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:8xutWZnSdmoC",
            "Publisher": "Springer"
        },
        {
            "Title": "A unified approach to automatic label placement",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218195903001062",
            "Abstract": "The automatic placement of text or symbol labels corresponding to graphical features is critical in several application areas such as cartography, geographical information systems, and graph drawing. In this paper we present a general framework for solving the problem of assigning text or symbol labels to a set of graphical features in two dimensional drawings or maps. Our approach does not favor the labeling of one type of graphical feature (such as a node, edge, or area) over another. Additionally, the labels are allowed to have arbitrary size and orientation. We also present a fast and simple technique, based on the general framework, for assigning labels to edges of graph drawings. We have implemented our techniques and have performed extensive experimentation on hierarchical and orthogonal drawings of graphs. The resulting label assignments are very practical and indicate the effectiveness of our …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:HGTzPopzzJcC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Planar drawings of fixed-mobile bigraphs",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-73915-1_33",
            "Abstract": "A fixed-mobile bigraph G is a bipartite graph such that the vertices of one partition set are given with fixed positions in the plane and the mobile vertices of the other part, together with the edges, must be added to the drawing. We assume that G is planar and study the problem of finding, for a given , a planar poly-line drawing of G with at most k bends per edge. In the most general case, we show NP-hardness. For  and under additional constraints on the positions of the fixed or mobile vertices, we either prove that the problem is polynomial-time solvable or prove that it belongs to NP. Finally, we present a polynomial-time testing algorithm for a certain type of “layered” 1-bend drawings.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:LdasjJ6CEcoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Graph Drawing: 16th International Symposium, GD 2008, Heraklion, Crete, Greece, September 21-24, 2008. Revised Papers",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=WBZrCQAAQBAJ&oi=fnd&pg=PP2&dq=info:tj0nuGn-9DoJ:scholar.google.com&ots=hYLpW39YXr&sig=LqALn0NM6vQzpuYgPTHuP-GpgWs",
            "Abstract": "The 16th International Symposium on Graph Drawing (GD 2008) was held in Hersonissos, near Heraklion, Crete, Greece, September 21-24, 2008, and was attended by 91 participants from 19 countries. In response to the call for papers the Program Committee received 83 s-missions, eachdescribing originalresearchand/or a systemdemonstration. Each submissionwasreviewedbyatleastthreeProgramCommitteemembersandthe reviewer’s comments were returned to the authors. Following extensive disc-sions, the committee accepted 31 long papers and 8 short papers. In addition, 10 posters were accepted and displayed at the conference site. Each poster was granted a two-page description in the conference proceedings. Two invited speakers, Jesper Tegn ́ er from Karolinska Institute (Monday) and Roberto Tamassia from Brown University (Tuesday), gave fascinating talks during the conference. Professor Tegn ́ er focused on the challenges and oppor-nities posed by the discovery, analysis, and interpretation of biological networks to information visualization, while Prof. Tamassia showed how graph drawing techniques can be used as an e? ective tool in computer security and pointed to future research directions in this area. Following what is now a tradition, the 15th Annual Graph Drawing Contest was held during the conference, also including a Graph Drawing Challenge to the conference attendees. A report is included in the conference proceedings.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:PyEswDtIyv0C",
            "Publisher": "Springer"
        },
        {
            "Title": "3D visualization of semantic metadata models and ontologies",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-31843-9_38",
            "Abstract": "We propose an algorithm for the 3D visualization of general ontology models used in many applications, such as semantic web, entity-relationship diagrams and other database models. The visualization places entities in the 3D space. Previous techniques produce drawings that are 2-dimensional, which are often complicated and hard to comprehend. Our technique uses the third dimension almost exclusively for the display of the isa relationships (links) while the property relationships (links) are placed on some layer (plane). Thus the semantic difference between isa links and property links, which should be as vertical or as horizontal as possible respectively, is emphasized. Special reference is made on a certain model, the CIDOC Conceptual Reference Model.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The Three-Phase Method: A Unified Approach to Orthogonal Graph Drawing",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218195900000310",
            "Abstract": "In this paper, we study orthogonal graph drawings from a practical point of view. Most previously existing algorithms restricted the attention to graphs of maximum degree four. Here we study orthogonal drawing algorithms that work for any input graph, and discuss different models for such drawings. Then we introduce the three-phase method, a generic technique to create high-degree orthogonal drawings. This approach simplifies the description and implementation of orthogonal graph drawing, and can be applied to global as well as interactive and incremental settings.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:An6A6Jpfc1oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applications of Parameterized st-Orientations.",
            "Publication year": 2010,
            "Publication url": "https://www.csd.uoc.gr/~hy583/papers/2010-JGAA.pdf",
            "Abstract": "An st-orientation of a biconnected undirected graph defines a directed graph with no cycles, a single source s and a single sink t. Given an undirected graph G as input, linear-time algorithms have been proposed for computing an st-orientation of G. Such an orientation is useful especially in graph drawing algorithms which use it at their first stage [23]. Namely, before they process the original undirected graph they receive as input, they transform it into an st-DAG, by computing an st-orientation of it. In this paper we observe that using st-orientations of different longest path lengths in various applications can result in different solutions, each one having its own merit. Guided by this intuition, we present results concerning applications of proposed algorithms for longest path parameterized st-orientations. Specifically, we show how to achieve considerable space savings (eg, O (n)) for visibility representations of planar graphs by using st-orientations computed by algorithms that can control the length of the longest path. Also, we apply our results to the graph coloring problem, where we use an st-orientation as an intermediate step to compute a good coloring of a graph, and to other problems, such as computing space-efficient orthogonal drawings and longest paths.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modelling the Pathophysiological Human Brain Function",
            "Publication year": 2007,
            "Publication url": "https://projects.ics.forth.gr/_pdf/brochures/EN69-2.pdf",
            "Abstract": "Recent research has exploited graph theory in the development and implementation of an advanced electroencephalogram (EEG) analysis framework for modelling and visualizing cognitive brain functions under normal or pathological conditions. There is special interest in using graph theory to study brain networks, since it offers a unique perspective to the study of local and distributed brain interactions.Most brain disorders and cognitive brain functions remain largely unresolved. Imaging modalities like positron emission tomography (PET) and functional magnetic resonance imaging (fMRI) are valuable tools in identifying activations localized to specific brain regions (lobes). However, in comparison to classical electrophysiological techniques like the EEG, which capture the electrical activity that define neuronal communication, they represent indirect measures of neural activity and are characterized by rather poor temporal responses. All of these approaches focus on identifying the exact location of activations in the brain, which is a vital step towards understanding the brain’s internal function. Modelling dynamic and synchronization phenomena in the brain will hopefully explain ‘how’psychological mechanisms function.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multidimensional dominance drawings",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1906.09224",
            "Abstract": "Let  be a DAG with  vertices and  edges. Two vertices  are incomparable if  doesn't reach  and vice versa. We denote by \\emph{width} of a DAG , , the maximum size of a set of incomparable vertices of . In this paper we present an algorithm that computes a dominance drawing of a DAG G in  dimensions, where . The time required by the algorithm is , with a precomputation time of , needed to compute a \\emph{compressed transitive closure} of , and extra  or  time, if we want . Our algorithm gives a tighter bound to the dominance dimension of a DAG. As corollaries, a new family of graphs having a 2-dimensional dominance drawing and a new upper bound to the dimension of a partial order are obtained. We also introduce the concept of transitive module and dimensional neck, , of a DAG  and we show how to improve the results given previously using these concepts.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:Ade32sEp0pkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Low ink drawings of dense graphs",
            "Publication year": 2020,
            "Publication url": "https://patents.google.com/patent/US20200387546A1/en",
            "Abstract": "A computer-implemented method of drawing an undirected graph in which multiple nodes are connected by multiple edges is provided using a computer system in which a computer is coupled to the computer display. The computer includes a processor and memory. A representation is received of a graph having multiple nodes and multiple edges, in which positions of the nodes relative to one another have been previously determined. The representation is modified so as to: 1) preserve the positions of the nodes relative to one another; and 2) simplify the visual representation of the graph by sharing drawn lines between different distinct edges in such a way as to enable the different distinct edges, despite such sharing, to still be recognized by a user. In one embodiment, the processor places the nodes in unique positions with integer coordinates.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:ziOE8S1-AIUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "and Data Structures, WADS 2001",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=wa3KCgAAQBAJ&oi=fnd&pg=PA101&dq=info:vV3zHP1a940J:scholar.google.com&ots=WdIN9kzqQ6&sig=kASPWhqXfh5PfTxtxvSKzsbODJo",
            "Abstract": "This Special Issue brings together papers based on work presented at the Sev-enth International Workshop on Algorithms and Data Structures (WADS 2001) which was held August 8–10, 2001, at Brown University Providence, USA. Preliminary versions of the results presented at WADS 2001 have appeared in the conference proceedings published by Springer-Verlag, Lecture Notes in Computer Science, volume 2125.As editors of this JGAA special issue, we chose to invite papers from WADS 2001 that reflect the broad nature of the workshop, which showcase theoretical contributions as well as experimental work in the field of algorithms and data structures. The issue collects six papers. The first three papers present new algorithms that either revisit basic graph algorithms within new realistic models of computation or that deal with fundamental questions about the combinatorial nature of graphs. The remaining three papers are devoted to the growing area of graph drawing and collect results that have a variety of applications from Web searching to Software Engineering.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:B3FOqHPlNUQC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Circular Drawing Algorithms.",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=4544578900440473553&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:rHJHxKgnXwkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational identification of bacterial communities",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30822189/10.1.1.193.6476.pdf",
            "Abstract": "Stable bacterial polymorphism on a single limiting resource may appear if between the evolved strains metabolic interactions take place that allow the exchange of essential nutrients [8]. Towards an attempt to predict the possible outcome of longrunning evolution experiments, a network based on the metabolic capabilities of homogeneous populations of every single gene knockout strain (nodes) of the bacterium E. coli is reconstructed. Potential metabolic interactions (edges) are allowed only between strains of different metabolic capabilities. Bacterial communities are determined by finding cliques in this network. Growth of the emerged hypothetical bacterial communities is simulated by extending the metabolic flux balance analysis model of Varma et al [2] to embody heterogeneous cell population growth in a mutual environment.Results from aerobic growth on 10 different carbon sources are presented. The upper bounds of the diversity that can emerge from single-cloned populations of E. coli such as the number of strains that appears to metabolically differ from most strains (highly connected nodes), the maximum clique size as well as the number of all the possible communities are determined. Certain single gene deletions are identified to consistently participate in our hypothetical bacterial communities under most environmental conditions implying a pattern of growth-condition-invariant strains with similar metabolic effects. Moreover, evaluation of all the hypothetical bacterial communities under growth on pyruvate reveals heterogeneous populations that can exhibit superior growth performance when compared to the performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ViSta: a tool suite for the visualization of behavioral requirements",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121201001376",
            "Abstract": "ViSta is a tool suite designed to support the requirements specification phase of reactive systems. It enables the user to prepare and analyze a diagrammatic description of requirements using the statechart notation. ViSta includes a template wizard, a graphical editor and a statechart visualization tool. The template wizard guides the user through the steps necessary for the extraction of relevant information from a textual description of requirements. This information is stored in a database that is used by the statechart visualization tool to automatically generate statechart layouts. The statechart visualization tool offers a framework that combines hierarchical drawing, labeling, and floorplanning techniques. Hence, the automatically produced drawings enjoy several important aesthetic properties: they emphasize the natural hierarchical decomposition of states into substates; they have a low number of edge crossings …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:maZDTaKrznsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Planar Drawings of Fixed-Mobile Bigraphs",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=v-xIDwAAQBAJ&oi=fnd&pg=PA426&dq=info:-tplQDryEVcJ:scholar.google.com&ots=-A9QiUxfET&sig=33f2LT5Ms1IpZRx3GNJSQVtWYkQ",
            "Abstract": "A fixed-mobile bigraph G is a bipartite graph such that the vertices of one partition set are given with fixed positions in the plane and the mobile vertices of the other part, together with the edges, must be added to the drawing. We assume that G is planar and study the problem of finding, for a given k≥ 0, a planar poly-line drawing of G with at most k bends per edge. In the most general case, we show NP-hardness. For k= 0 and under additional constraints on the positions of the fixed or mobile vertices, we either prove that the problem is polynomial-time solvable or prove that it belongs to NP. Finally, we present a polynomialtime testing algorithm for a certain type of “layered” 1-bend drawings.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:kw52XkFRtyQC",
            "Publisher": "Springer"
        },
        {
            "Title": "A vision and strategy for the VPH: 2012",
            "Publication year": 2013,
            "Publication url": "https://re.public.polimi.it/handle/11311/762313",
            "Abstract": "European funding under Framework 7 (FP7) for the virtual physiological human (VPH) project has been in place now for 5 years. The VPH Network of Excellence (NoE) has been set up to help develop common standards, open source software, freely accessible data and model repositories, and various training and dissemination activities for the project. It is also working to coordinate the many clinically targeted projects that have been funded under the FP7 calls. An initial vision for the VPH was defined by the FP6 STEP project in 2006. In 2010, we wrote an assessment of the accomplishments of the first two years of the VPH in which we considered the biomedical science, healthcare and information and communications technology challenges facing the project (Hunter et al. 2010 Phil. Trans. R. Soc. A 368, 2595–2614 (doi:10.1098/rsta.2010.0048)). We proposed that a not-for-profit professional umbrella organization, the VPH Institute, should be established as a means of sustaining the VPH vision beyond the time-frame of the NoE. Here, we update and extend this assessment and in particular address the following issues raised in response to Hunter et al.: (i) a vision for the VPH updated in the light of progress made so far, (ii) biomedical science and healthcare challenges that the VPH initiative can address while also providing innovation opportunities for the European industry, and (iii) external changes needed in regulatory policy and business models to realize the full potential that the VPH has to offer to industry, clinics and society generally.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:LPtt_HFRSbwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DAGmap View",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00219-9_50",
            "Abstract": "DAGmap view is a program written in Java that draws directed acyclic graphs using space filling techniques. In DAGmap view the layout function and the hierarchy presentation function have been decomposed to improve the stability of the layout during navigation and zooming.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computing handbook: Computer science and software engineering",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vMqSAwAAQBAJ&oi=fnd&pg=PP1&dq=info:vs8LP5A6lOsJ:scholar.google.com&ots=vrUKngb0zn&sig=HjM6PpIn99XDtguHjjIbPfrQWck",
            "Abstract": "Computing Handbook, Third Edition: Computer Science and Software Engineering mirrors the modern taxonomy of computer science and software engineering as described by the Association for Computing Machinery (ACM) and the IEEE Computer Society (IEEE-CS). Written by established leading experts and influential young researchers, the first volume of this popular handbook examines the elements involved in designing and implementing software, new areas in which computers are being used, and ways to solve computing problems. The book also explores our current understanding of software engineering and its effect on the practice of software development and the education of software professionals. Like the second volume, this first volume describes what occurs in research laboratories, educational institutions, and public and private organizations to advance the effective development and use of computers and computing in today’s world. Research-level survey articles provide deep insights into the computing discipline, enabling readers to understand the principles and practices that drive computing education, research, and development in the twenty-first century.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:WAzi4Gm8nLoC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "A User Study on the Visualization of Directed Graphs⋆",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-662-45803-7.pdf#page=525",
            "Abstract": "In a node-link visualization of a directed acyclic graph it is desirable that edges flow in a common direction (say upward) according to their orientations, as in Hierarchical Drawings (HD)(see, eg,[3]). More general requirements are that the number of edge crossings, the number of edge bends, the drawing area, etc., are kept low. These are well addressed by Orthogonal Drawings (OD), where edges are chains of horizontal and vertical segments (see, eg,[4]). Unfortunately, OD algorithms do not control the flow of the edges in a desired direction. Overloaded Orthogonal Drawing (OOD) is a recent visualization paradigm conceived for drawing directed graphs, that merges and enforces the benefits of HD and of OD [2]. Indeed, edges are still represented using only horizontal and vertical segments, and if the digraph is acyclic, any directed edge (u, v) is drawn as an upward-rightward polyline consisting of one bend point …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effective graph visualization via node grouping",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:sJsF-0ZLhtgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A unified approach to automatic label placement",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218195903001062",
            "Abstract": "The automatic placement of text or symbol labels corresponding to graphical features is critical in several application areas such as cartography, geographical information systems, and graph drawing. In this paper we present a general framework for solving the problem of assigning text or symbol labels to a set of graphical features in two dimensional drawings or maps. Our approach does not favor the labeling of one type of graphical feature (such as a node, edge, or area) over another. Additionally, the labels are allowed to have arbitrary size and orientation. We also present a fast and simple technique, based on the general framework, for assigning labels to edges of graph drawings. We have implemented our techniques and have performed extensive experimentation on hierarchical and orthogonal drawings of graphs. The resulting label assignments are very practical and indicate the effectiveness of our …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:QIV2ME_5wuYC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Graph Algorithms and Applications 2",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3PNBnl3m3fwC&oi=fnd&pg=PP10&dq=info:EvXVkS11GcMJ:scholar.google.com&ots=z8UbZ0Ph7R&sig=eXaqqYWb2KaRgfR_lfVl6kosvyU",
            "Abstract": "This book contains Volumes 4 and 5 of the Journal of Graph Algorithms and Applications (JGAA). The first book of this series, Graph Algorithms and Applications 1, published in March 2002, contains Volumes 1OCo3 of JGAA. JGAA is a peer-reviewed scientific journal devoted to the publication of high-quality research papers on the analysis, design, implementation, and applications of graph algorithms. Areas of interest include computational biology, computational geometry, computer graphics, computer-aided design, computer and interconnection networks, constraint systems, databases, graph drawing, graph embedding and layout, knowledge representation, multimedia, software engineering, telecommunications networks, user interfaces and visualization, and VLSI circuit design. The journal is supported by distinguished advisory and editorial boards, has high scientific standards, and takes advantage of current electronic document technology. The electronic version of JGAA is available on the Web at http://jgaa. info/. Graph Algorithms and Applications 2 presents contributions from prominent authors and includes selected papers from the Dagstuhl Seminar on Graph Algorithms and Applications and the Symposium on Graph Drawing in 1998. All papers in the book have extensive diagrams and offer a unique treatment of graph algorithms focusing on the important applications. Contents: Approximations of Weighted Independent Set and Hereditary Subset Problems (MM Halldrsson); Approximation Algorithms for Some Graph Partitioning Problems (G He et al.); Geometric Thickness of Complete Graphs (MB Dillencourt et al.); Techniques for …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Effective graph visualization via node grouping",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-0457-3_14",
            "Abstract": "Software engineering often employs graphs to aid design. For example, graphs are used to model architectures, data-flow, process, requirements, state charts. There are many more examples. However, the information structures needed to model today’s software systems are becoming increasingly large and complex. Although many graph drawing techniques [7,8] exist to embed these structures nicely onto a two or three dimensional surface, the resulting drawings can overwhelm the viewers’ senses with the enormity of the information structure. After studying many drawings, we noticed that small, complete subgraphs (K  3 , K  4 , K  5 ) or almost complete subgraphs appeared often in the typical structures laid out by graph visualization tools. It became quite clear that the abstraction of these small node-disjoint groups would …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:DBa1UEJaJKAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A visualization framework and user studies for overloaded orthogonal drawings",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/cgf.13266",
            "Abstract": "Overloaded orthogonal drawing (OOD) is a recent graph visualization style specifically conceived for directed graphs. It merges the advantages of some popular drawing conventions like layered drawings and orthogonal drawings, and provides additional support for some common analysis tasks. We present a visualization framework called DAGView, which implements algorithms and graphical features for the OOD style. Besides the algorithm for acyclic digraphs, the DAGView framework implements extensions to visualize both digraphs with cycles and undirected graphs, with the additional possibility of taking into account user preferences and constraints. It also supports an interactive visualization of clustered digraphs, based on the use of strongly connected components. Moreover, we describe an experimental user study, aimed to investigate the usability of OOD within the DAGView framework. The results of …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:7Hz3ACDFbsoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Graph analysis and visualization for brain function characterization using EEG data",
            "Publication year": 2010,
            "Publication url": "https://www.hindawi.com/journals/jhe/2010/707290/",
            "Abstract": "Over the past few years, there has been an increased interest in studying the underlying neural mechanism of cognitive brain activity as well as in diagnosing certain pathologies. Noninvasive imaging modalities such as functional magnetic resonance imaging (fMRI), positron emission tomography (PET), and dynamic signal acquisition techniques such as quantitative electroencephalography (EEG) have been vastly used to estimate cortical connectivity and identify functional interdependencies among synchronized brain lobes. In this area, graph-theoretic concepts and tools are used to describe large scale brain networks while performing cognitive tasks or to characterize certain neuropathologies. Such tools can be of particular value in basic neuroscience and can be potential candidates for future inclusion in a clinical setting. This paper discusses the application of the high time resolution EEG to resolve interdependence patterns using both linear and nonlinear techniques. The network formed by the statistical dependencies between the activations of distinct and often well separated neuronal populations is further analyzed using a number of graph theoretic measures capable of capturing and quantifying its structure and summarizing the information that it contains. Finally, graph visualization reveals the hidden structure of the networks and amplifies human understanding. A number of possible applications of the graph theoretic approach are also listed. A freely available standalone brain visualization tool to benefit the healthcare engineering community is also provided (http://www.ics.forth.gr/bmi/tools.html).",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "The Impact of Systems Biology on the Digital Patient",
            "Publication year": 2007,
            "Publication url": "https://projects.ics.forth.gr/_pdf/brochures/EN69-5.pdf",
            "Abstract": "Substantial advances in predictive, preventive and personalized (PPP) medicine are starting to emerge from computational simulations of complex networked models of metabolism ranging to the molecular level of detail. From the systems biology perspective of the digital patient, diseases are perturbations of biological networks through defective genes or environmental stimuli, and therapies are the interventions needed to restore these networks to their normal states. The Bioinformatics group at FORTH Heraklion is developing novel computational methods for identifying new parts of these networks both from genomic sequences and from metabolite time-series, and to generate meaningful visualizations of them.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal brain network synchrony visualization: Application in an alcoholism paradigm",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4353283/",
            "Abstract": "Although electroencephalographic (EEG) signal synchronization studies have been a topic of increasing interest lately, there is no similar effort in the visualization of such measures. In this direction a graph-theoretic approach devised to study and stress the coupling dynamics of task-performing dynamical networks is proposed. Both linear and nonlinear interdependence measures are investigated in an alcoholism paradigm during mental rehearsal of pictures, which is known to reflect synchronization impairment. More specifically, the widely used magnitude squared coherence; phase synchronization and a robust nonlinear state-space generalized synchronization assessment method are investigated. This paper mostly focuses on a signal-based technique of selecting the optimal visualization threshold using surrogate datasets to correctly identify the most significant correlation patterns. Furthermore, a graph …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fan-planarity: Properties and complexity",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397515003515",
            "Abstract": "In a fan-planar drawing of a graph an edge can cross only edges with a common end-vertex. Fan-planar drawings have been recently introduced by Kaufmann and Ueckerdt [35], who proved that every n-vertex fan-planar drawing has at most 5 n− 10 edges, and that this bound is tight for n≥ 20. We extend their result from both the combinatorial and the algorithmic point of view. We prove tight bounds on the density of constrained versions of fan-planar drawings and study the relationship between fan-planarity and k-planarity. Also, we prove that testing fan-planarity in the variable embedding setting is NP-complete.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:4hFrxpcac9AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Algorithms and bounds for overloaded orthogonal drawings",
            "Publication year": 2016,
            "Publication url": "http://www.jgaa.info/accepted/2016/KornaropoulosTollis2016.20.2.pdf",
            "Abstract": "Orthogonal drawings are widely used for graph visualization due to their high clarity and ease of representation. But when it comes to highdegree and massive graphs, even orthogonal drawings have difficulties producing a clean and simple visualization. In this paper we present a technique called Overloaded Orthogonal Drawing that greatly improves the readability by proposing a new vertex placement and reframing the orthogonal edge routing approach. We first place the vertices on grid points following a relaxed version of dominance drawing, called weak dominance condition. Edge routing is implied automatically by the vertex coordinates. In order to simplify these drawings we use an overloading technique of the edges. All algorithms are simple and easy to implement and can be applied to directed acyclic graphs, planar, non-planar and undirected graphs. We also present bounds on the number of bends and the area. Overloaded orthogonal drawings present several interesting properties such as efficient visual edge confirmation as well as clarity of the drawing.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:-7ulzOJl1JYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms and Experiments Comparing Two Hierarchical Drawing Frameworks",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2011.12155",
            "Abstract": "We present algorithms that extend the path-based hierarchical drawing framework and give experimental results. Our algorithms run in  time, where  is the number of paths and  is the number of edges of the graph, and provide better upper bounds than the original path based framework: e.g., the height of the resulting drawings is equal to the length of the longest path of , instead of , where  is the number of nodes. Additionally, we extend this framework, by bundling and drawing all the edges of the DAG in  time, using minimum extra width per path. We also provide some comparison to a well known hierarchical drawing framework, widely known as the Sugiyama framework, as a proof of concept. The experimental results show that our algorithms produce drawings that are better in area and number of bends, but worse for crossings in sparse graphs. Hence, our technique offers an interesting alternative for drawing hierarchical graphs. Finally, we present an  time algorithm that computes a specific order of the paths in order to reduce the total edge length and number of crossings and bends.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:w0F2JDEymm0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms and Characterizations for 2-Layer Fan-planarity: From Caterpillar to Stegosaurus.",
            "Publication year": 2017,
            "Publication url": "https://www.emis.de/journals/JGAA/accepted/2017/Binucci+2017.21.1.pdf",
            "Abstract": "In a fan-planar drawing of a graph there is no edge that crosses two other independent edges. We study 2-layer fan-planar drawings, ie, fanplanar drawings such that the vertices are restricted to two distinct horizontal layers and edges are straight-line segments that connect vertices of different layers. We characterize 2-layer fan-planar drawable graphs and describe a linear-time testing and embedding algorithm for biconnected graphs. We also study the relationship between 2-layer fan-planar graphs and 2-layer right-angle crossing graphs.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:48xauSegjOkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visualization of functional aspects of microRNA regulatory networks using the gene ontology",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11946465_2",
            "Abstract": "The post-transcriptional regulation of genes by microRNAs (miRNAs) is a recently discovered mechanism of growing importance. To uncover functional relations between genes regulated by the same miRNA or groups of miRNAs we suggest the simultaneous visualization of the miRNA regulatory network and the Gene Ontology (GO) categories of the targeted genes. The miRNA regulatory network is shown using circular drawings and the GO is visualized using treemaps. The GO categories of the genes targeted by user-selected miRNAs are highlighted in the treemap showing the complete GO hierarchy or selected branches of it. With this visualization method patterns of reoccurring categories can easily identified supporting the discovery of the functional role of miRNAs. Executables for MS-Windows are available under www.ics.forth.gr/~reczko/isbmda06 ",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "BrainNetVis: an open-access tool to effectively quantify and visualize brain networks",
            "Publication year": 2011,
            "Publication url": "https://www.hindawi.com/journals/cin/2011/747290/",
            "Abstract": "This paper presents BrainNetVis, a tool which serves brain network modelling and visualization, by providing both quantitative and qualitative network measures of brain interconnectivity. It emphasizes the needs that led to the creation of this tool by presenting similar works in the field and by describing how our tool contributes to the existing scenery. It also describes the methods used for the calculation of the graph metrics (global network metrics and vertex metrics), which carry the brain network information. To make the methods clear and understandable, we use an exemplar dataset throughout the paper, on which the calculations and the visualizations are performed. This dataset consists of an alcoholic and a control group of subjects.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Automatic layout of statecharts",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/spe.418",
            "Abstract": "Graphical notations are widely used for system specification. The usefulness of these notations depends primarily on their readability. Hence, automatic methods are needed to obtain efficient and understandable graphical representations of requirements. In this paper, we present an algorithm that automatically generates layouts of statecharts. We assume that relevant information is stored in a structure that we call a decomposition tree, and we draw the graph that models a statechart in a hierarchical fashion. Our approach excludes diagrams with inter‐level transitions. Copyright © 2001 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:r0BpntZqJG4C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "The Three-Phase Method: A Unified Approach to Orthogonal Graph Drawing",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218195900000310",
            "Abstract": "In this paper, we study orthogonal graph drawings from a practical point of view. Most previously existing algorithms restricted the attention to graphs of maximum degree four. Here we study orthogonal drawing algorithms that work for any input graph, and discuss different models for such drawings. Then we introduce the three-phase method, a generic technique to create high-degree orthogonal drawings. This approach simplifies the description and implementation of orthogonal graph drawing, and can be applied to global as well as interactive and incremental settings.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:EPG8bYD4jVwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cubic graphs have bounded slope parameter",
            "Publication year": 2009,
            "Publication url": "https://infoscience.epfl.ch/record/152987",
            "Abstract": "Cubic graphs have bounded slope parameter - Infoscience English Français login Home > \nCubic graphs have bounded slope parameter Infoscience Information Usage statistics Files \nCubic graphs have bounded slope parameter Tollis, IG ; Patrignani, M. ; Keszegh, B. ; Pach, J. ; \nPalvolgyi, D. ; Toth, G. Published in: Graph Drawing, 50-60 Presented at: Graph Drawing 2008 \nYear: 2009 Publisher: Berlin, Springer-Verlag DOI: 10.1007/978-3-642-00219-9_6 Laboratories: \nDCG Record appears in: Scientific production and competences > SB - School of Basic \nSciences > MATH - Institute of Mathematics > DCG - Chair of Combinatorial Geometry Scientific \nproduction and competences > SB - School of Basic Sciences > Mathematics Conference \nPapers Work produced at EPFL Published Export as: BibTeX | MARC | MARCXML | DC | \nEndNote | NLM | RefWorks | RIS View as: MARC | MARCXML | DC Add to your basket: Back -…",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:CdxZDUztZiMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Adaptive threshold QRS detector with best channel selection based on a noise rating system",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4745445/",
            "Abstract": "QRS detection performance can depend on the type of noise present in each lead involved in the overall processing. A common approach to QRS detection is based on a QRS enhanced signal obtained from the derivatives of the pre-filtered leads. However, the signal pre-filtering cannot be able to perform a complete noise rejection and the use of derivatives can enhance the noise as well. In many cases the noise occurs only on one lead and the addition of a noisy lead to the QRS enhanced signal decreases the overall detection performances of the QRS detector. For this reason the noise estimation on each channel, providing information for the channel inclusion or rejection in building the QRS enhanced signal, can improve the overall performances of the QRS detector. The results have been evaluated on the 48 records of the MIT-BIH Arrhythmia Database where each ECG record is composed by 2 leads …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using treemaps to visualize phylogenetic trees",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573067_29",
            "Abstract": "Over recent years the field of phylogenetics has witnessed significant algorithmic and technical progress. A new class of efficient phylogeny programs allows for computation of large evolutionary trees comprising 500–1.000 organisms within a couple of hours on a single CPU under elaborate optimization criteria. However, it is difficult to extract the valuable information contained in those large trees without appropriate visualization tools. As potential solution we propose the application of treemaps to visualize large phylogenies (evolutionary trees) and improve knowledge-retrieval. In addition, we propose a hybrid tree/treemap representation which provides a detailed view of subtrees via treemaps while maintaining a contextual view of the entire topology at the same time. Moreover, we demonstrate how it can be deployed to visualize an evolutionary tree comprising 2.415 mammals. The respective software …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "DAGView: an approach for visualizing large graphs",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-36763-2_44",
            "Abstract": "In this paper, we propose a novel visualization framework called DAGView. The aim of DAGView is to produce clear visualizations of directed acyclic graphs in which every edge and the potential existence of a path can be immediately spotted by the user. Several criteria that users identified as important in a layout are met, such as underlying grid, crossings and bends that appear perpendicular. The main algorithm is based on the layout of directed acyclic graphs but can be extended to handle directed graphs with cycles and undirected graphs, taking into account user preferences and/or constraints. Important tasks that are used in user studies are performed efficiently within the DAGView framework.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:eflP2zaiRacC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Brainnetvis: Analysis and visualization of brain functional networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5334489/",
            "Abstract": "BrainNetVis is an application, written in Java, that displays and analyzes synchronization networks from brain signals. The program implements a number of network indices and visualization techniques. We demonstrate its use through a case study of left hand and foot motor imagery. The data sets were provided by the Berlin BCI group. Using this program we managed to find differences between the average left hand and foot synchronization networks by comparing them with the average idle state synchronization network.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A New Framework for Hierarchical Drawings.",
            "Publication year": 2019,
            "Publication url": "http://jgaa.info/accepted/2019/502.pdf",
            "Abstract": "We present a new approach to visualize directed graphs and their hierarchies that departs from the classical four-phase framework of Sugiyama and computes readable hierarchical visualizations that focus on the reachability information of a directed acyclic graph. Additionally, our approach has the feature that a few transitive edges are not drawn in the drawing, thus reducing the visual complexity of the resulting drawing. Furthermore, the problems involved in our framework require only polynomial time. The channel decomposition is a partition of the vertex set of the graph into channels, where a channel is a relaxed path. Our framework offers a suite of solutions depending upon the requirements, and it consists of only two steps:(a) the cycle removal step (if the directed graph contains cycles) and (b) the channel decomposition and hierarchical drawing step. Our framework does not introduce any dummy vertices and it keeps the vertices of a path/channel vertically aligned. The time complexity of the main drawing algorithms of our framework is O (km), where k is the number of paths/channels, typically much smaller than n (the number of vertices).",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:AXkvAH5U_nMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A vision and strategy for the virtual physiological human: 2012 update",
            "Publication year": 2013,
            "Publication url": "https://royalsocietypublishing.org/doi/abs/10.1098/rsfs.2013.0004",
            "Abstract": "European funding under Framework 7 (FP7) for the virtual physiological human (VPH) project has been in place now for 5 years. The VPH Network of Excellence (NoE) has been set up to help develop common standards, open source software, freely accessible data and model repositories, and various training and dissemination activities for the project. It is also working to coordinate the many clinically targeted projects that have been funded under the FP7 calls. An initial vision for the VPH was defined by the FP6 STEP project in 2006. In 2010, we wrote an assessment of the accomplishments of the first two years of the VPH in which we considered the biomedical science, healthcare and information and communications technology challenges facing the project (Hunter et al. 2010 Phil. Trans. R. Soc. A 368, 2595–2614 (doi:10.1098/rsta.2010.0048)). We proposed that a not-for-profit professional umbrella …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:ye4kPcJQO24C",
            "Publisher": "The Royal Society"
        },
        {
            "Title": "Graph-theoretic indices of evaluating brain network synchronization: Application in an alcoholism paradigm",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/7657_2013_62.pdf",
            "Abstract": "Electroencephalographic signal synchronization studies have been a topic of increasing interest lately, using both linear and nonlinear formulations. In this direction a graph-theoretic approach devised to study and stress the coupling dynamics of task-performing dynamical networks is proposed in this communication. Graph theoretical measures and visualization provide the tools to visualize and characterize the topology of a brain network as in an alcoholism paradigm during mental rehearsal of pictures, which is known to reflect synchronization impairment. More specifically, in this chapter the synchronization between all pairs of channels is calculated using (a) the magnitude squared coherence, (b) an estimation of phase synchronization, and (c) a robust nonlinear state-space generalized synchronization assessment method. Synchronization matrices define graphs whose topological structure and …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:edDO8Oi4QzsC",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "How to visualize directed graphs: A user study",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6878777/",
            "Abstract": "Overloaded Orthogonal Drawing is a recent graph visualization paradigm that resembles classical orthogonal drawings, but is specifically tailored to directed graphs of arbitrary vertex degree. Its properties suggest that it can be applied to perform visualization-based tasks more effectively than other related paradigms. In this paper we investigate the usability of Overloaded Orthogonal Drawings against classical Orthogonal Drawings, Hierarchical Drawings, and Matrix-based Representations. All four paradigms are applied to visualize directed graphs. The results reveal a clear advantage in using Overloaded Orthogonal Drawings based on a set of common user's tasks, and most of the results are statistically significant. More in general, we observed that node-link representations outperform matrix-based representations for most of the proposed tasks on the given set of instances.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:Ri6SYOTghG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Visualizing Statecharts with ViSta",
            "Publication year": 2003,
            "Publication url": "https://repositorio.tec.mx/bitstream/handle/11285/574081/DocsTec_5519.pdf?sequence=1#page=36",
            "Abstract": "Statecharts are widely used for the requirements specification of reactive systems. This notation captures the requirements attributes that are concerned with the behavioral features of a system, and models these features in terms of a hierarchy of diagrams and states. The usefulness of statecharts depends primarily on their readability, that is the capability of the drawing to convey the meaning quickly and clearly. Several visualization tools for the specification of reactive systems are available in the market [14, 25, 23, 33]. Even though these tools are helpful in organizing designers' thoughts, they are mostly sophisticated small scale graphical editors, and therefore are inadequate for the modeling of complex reactive systems. Specifically, hand made diagrams quickly become unreadable when the specification complexity and size increase. Therefore computer assistance is of paramount importance for the graphical representation of complex reactive systems.In this chapter we present a tool suite for the static and interactive visualization of statechart diagrams. We proceed in two steps: we manually extract behavioral information from a textual description, and store it into interactive templates; then we automatically genérate graphs that model statecharts in a hierarchical fashion. The resulting drawings enjoy several properties: they have a low number of are crossings; they emphasize the natural hierarchical decomposition of states into substates; and they have a good aspect ratio.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:CaZNVDsoPx4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ViSta—Visualizing Statecharts",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-18638-7_14",
            "Abstract": "Statecharts are widely used for the requirements specification of reactive systems. This notation captures the requirements attributes that are concerned with the behavioral features of a system, and models these features in terms of a hierarchy of diagrams and states. The usefulness of statecharts depends primarily on their readability, that is the capability of the drawing to convey the meaning quickly and clearly. Several visualization tools for the specification of reactive systems are available in the market [15],[26],[24],[1]. Even though these tools are helpful in organizing designers’ thoughts, they are mostly sophisticated small scale graphical editors, and therefore are inadequate for the modeling of complex reactive systems. Specifically, hand made diagrams quickly become unreadable when the specification complexity and size increase. Therefore computer assistance is of paramount importance for the …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:O0nohqN1r9EC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Efficient orthogonal drawings of high degree graphs",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1007/s004539910006",
            "Abstract": " Most of the work that appears in the two-dimensional orthogonal graph drawing literature deals with graphs whose maximum degree is four. In this paper we present an algorithm for orthogonal drawings of simple graphs with degree higher than four. Vertices are represented by rectangular boxes of perimeter less than twice the degree of the vertex. Our algorithm is based on creating groups / pairs of vertices of the graph. The orthogonal drawings produced by our algorithm have area at most (m-1)  ( m / 2 +2) . Two important properties of our algorithm are that the drawings exhibit a small total number of bends (less than m ), and that there is at most one bend per edge.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Algorithms for visualizing phylogenetic networks",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397520303303",
            "Abstract": "We study the problem of visualizing phylogenetic networks, which are extensions of the Tree of Life in biology. We use a space filling visualization method, called DAGmaps, in order to obtain clear visualizations using limited space. In this paper, we first show that the general problem of drawing galled networks as DAGmaps is NP-complete. Next, we restrict our attention to galled trees and planar galled networks and present linear time algorithms for visualizing them as DAGmaps. Finally, we explore whether these graphs can be visualized using One-Dimensional DAGmaps.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:ALROH1vI_8AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multi-level analysis and information extraction considerations for validating 4D models of human function",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73321-8_81",
            "Abstract": "Recent research trends focus on how multiscale biomedical information can be modeled and transformed into knowledge, in order to lead to a less interfering but also more individualized diagnosis and therapy. In order to assess the clinical importance of models of human pathology (e.g. cancer), it is necessary to validate them with prior and post treatment clinical data which in turn requires the determination of the tumor size and shape with high resolution, accuracy and precision, as well as structural and physiological information. This paper discusses some of the most important image analysis challenges in order to define an optimal method for extracting more accurate and precise anatomical and functional information related to the underlying pathology, which can be used for initializing and validating models of pathophysiology as well as simulations/predictions of the response to therapeutical regimes.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Algorithms and bounds for drawing non-planar graphs with crossing-free subgraphs",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925772115000632",
            "Abstract": "We initiate the study of the following problem: Given a non-planar graph G and a planar subgraph S of G, does there exist a straight-line drawing Γ of G in the plane such that the edges of S are not crossed in Γ by any edge of G? We give positive and negative results for different kinds of connected spanning subgraphs S of G. Moreover, in order to enlarge the subset of instances that admit a solution, we consider the possibility of bending the edges of G not in S; in this setting we discuss different trade-offs between the number of bends and the required drawing area.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:9c2xU6iGI7YC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Automated visualization of process diagrams",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45848-4_4",
            "Abstract": "In this paper, we explore the problem of producing process diagrams and introduce a linear time technique for creating them. Each edge has at most 3 bends and portions of the edge routing have optimal height. While developing a solution, we explore the subproblems of determining the order of the layers in the diagram, assigning x and y coordinates to nodes, and routing the edges.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "L-drawings of directed graphs",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-49192-8_11",
            "Abstract": "We introduce L-drawings, a novel paradigm for representing directed graphs aiming at combining the readability features of orthogonal drawings with the expressive power of matrix representations. In an L-drawing, vertices have exclusive x- and y-coordinates and edges consist of two segments, one exiting the source vertically and one entering the destination horizontally.We study the problem of computing L-drawings using minimum ink. We prove its NP-completeness and provide a heuristic based on a polynomial-time algorithm that adds a vertex to a drawing using the minimum additional ink. We performed an experimental analysis of the heuristic which confirms its effectiveness.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:QYdC8u9Cj1oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Planar L-drawings of directed graphs",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-73915-1_36",
            "Abstract": "We study planar drawings of directed graphs in the L-drawing standard. We provide necessary conditions for the existence of these drawings and show that testing for the existence of a planar L-drawing is an NP-complete problem. Motivated by this result, we focus on upward-planar L-drawings. We show that directed st-graphs admitting an upward- (resp. upward-rightward-) planar L-drawing are exactly those admitting a bitonic (resp. monotonically increasing) st-ordering. We give a linear-time algorithm that computes a bitonic (resp. monotonically increasing) st-ordering of a planar st-graph or reports that there exists none.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:MpfHP-DdYjUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Placing edge labels by modifying an orthogonal graph drawing",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-18469-7_39",
            "Abstract": "In this paper we investigate how one can modify an orthogonal graph drawing to accommodate the placement of overlap-free labels with the minimum cost. We present a polynomial time algorithm that finds the minimum increase of space in one direction, needed to resolve overlaps, while preserving the orthogonal representation of the drawing.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Time-significant wavelet coherence for the evaluation of schizophrenic brain activity using a graph theory approach",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4462743/",
            "Abstract": "Among the various frameworks in which electroencephalographic (EEG) signal synchronization has been traditionally formulated, the most widely studied and used is the coherence that is entirely based on frequency analysis. However, at present time it is possible to capture information about the temporal profile of coherence, which is particularly helpful in studying non-stationary time-varying brain dynamics, like the wavelet coherence (WC). In this paper we propose a new approach of studying brain synchronization dynamics by extending the use of WC to include certain statistically significant (in terms of signal coherence) time segments, to study and characterize any disturbances present in the functional connectivity network of schizophrenia patients. Graph theoretical measures and visualization provide the tools to study the \"disconnection syndrome\" as proposed for schizophrenia. Specifically, we analyzed …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Graph Algorithms and Applications I",
            "Publication year": 2002,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=K-gCFv-OIL4C&oi=fnd&pg=PR9&dq=info:HfWkpy8ccWIJ:scholar.google.com&ots=4LHOxrtIyb&sig=0WDfJ-4gQ_Sqotzkbe9ZyuXojsw",
            "Abstract": "This book contains volumes 1OCo3 of the Journal of Graph Algorithms and Applications (JGAA). Topics of interest include design and analysis of graph algorithms, experiences with graph algorithms, and applications of graph algorithms. JGAA is supported by distinguished advisory and editorial boards, has high scientific standards, and takes advantage of current electronic document technology. The electronic version of JGAA is available on the Web at http://www. cs. brown. edu/publications/jgaa/. Contents: Volume 1: 2-Layer Straightline Crossing Minimization: Performance of Exact and Heuristic Algorithms (M Jnger & P Mutzel); Optimal Algorithms to Embed Trees in a Point Set (P Bose et al.); Low-degree Graph Partitioning via Local Search with Applications to Constraint Satisfaction, Max Cut, and Coloring (MM Halldrsson & HC Lau); Volume 2: Algorithms for Cluster Busting in Anchored Graph Drawing (KA Lyons et al.); A Broadcasting Algorithm with Time and Message Optimum on Arrangement Graphs (L Bai et al.); A Visibility Representation for Graphs in Three Dimensions (P Bose et al.); Scheduled Hot-Potato Routing (J Naor et al.); Treewidth and Minimum Fill-in on d-trapezoid Graphs (HL Bodlaender et al.); Memory Paging for Connectivity and Path Problems in Graphs (E Feuerstein & A Marchetti-Spaccamela); New Lower Bounds for Orthogonal Drawings (TC Biedl); Rectangle-visibility Layouts of Unions and Products of Trees (AM Dean & JP Hutchinson); Volume 3: Edge-Coloring and f-Coloring for Various Classes of Graphs (X Zhou & T Nishizeki); Experimental Comparison of Graph Drawing Algorithms for Cubic Graphs (T …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:p2g8aNsByqUC",
            "Publisher": "World scientific"
        },
        {
            "Title": "A vision and strategy for the virtual physiological human in 2010 and beyond",
            "Publication year": 2010,
            "Publication url": "https://royalsocietypublishing.org/doi/abs/10.1098/rsta.2010.0048",
            "Abstract": "European funding under framework 7 (FP7) for the virtual physiological human (VPH) project has been in place now for nearly 2 years. The VPH network of excellence (NoE) is helping in the development of common standards, open-source software, freely accessible data and model repositories, and various training and dissemination activities for the project. It is also helping to coordinate the many clinically targeted projects that have been funded under the FP7 calls. An initial vision for the VPH was defined by framework 6 strategy for a European physiome (STEP) project in 2006. It is now time to assess the accomplishments of the last 2 years and update the STEP vision for the VPH. We consider the biomedical science, healthcare and information and communications technology challenges facing the project and we propose the VPH Institute as a means of sustaining the vision of VPH beyond the time frame of …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:SdhP9T11ey4C",
            "Publisher": "The Royal Society Publishing"
        },
        {
            "Title": "Algorithms and bounds for drawing directed graphs",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-04414-5_41",
            "Abstract": "In this paper we present a new approach to visualize directed graphs and their hierarchies that completely departs from the classical four-phase framework of Sugiyama and computes readable hierarchical visualizations that contain the complete reachability information of a graph. Additionally, our approach has the advantage that only the necessary edges are drawn in the drawing, thus reducing the visual complexity of the resulting drawing. Furthermore, most problems involved in our framework require only polynomial time. Our framework offers a suite of solutions depending upon the requirements, and it consists of only two steps: (a) the cycle removal step (if the graph contains cycles) and (b) the channel decomposition and hierarchical drawing step. Our framework does not introduce any dummy vertices and it keeps the vertices of a channel vertically aligned. The time complexity of the main drawing …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:prdVHNxh-e8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Searching and visualizing brain networks in Schizophrenia",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11946465_16",
            "Abstract": "There has been special interest lately in using graph theory to study brain networks, as it provides the theoretic and visualization means to study the ”disconnection syndrome” for schizophrenia. In this work we try to visualize the graphs derived from electroencephalografic (EEG) signals using several graph drawing techniques and incorporate them smoothly into an easy-to-use framework. The aim is to reveal and evaluate important properties of brain networks.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Algorithms for computing a parameterized st-orientation",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397508005653",
            "Abstract": "s t-orientations (s t-numberings) or bipolar orientations of undirected graphs are central to many graph algorithms and applications. Several algorithms have been proposed in the past to compute an s t-orientation of a biconnected graph. In this paper, we present new algorithms that compute such orientations with certain (parameterized) characteristics in the final s t-oriented graph, such as the length of the longest path. This work has many applications, including Graph Drawing and Network Routing, where the length of the longest path is vital in deciding certain features of the final solution. This work applies to other difficult problems as well, such as graph coloring and of course longest path. We present extended theoretical and experimental results which show that our technique is efficient and performs well in practice.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Techniques for the refinement of orthogonal graph drawings",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Techniques for edge stratification of complex graph drawings",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1045926X14000482",
            "Abstract": "We propose an approach that allows a user (e.g., an analyst) to explore a layout produced by any graph drawing algorithm, in order to reduce the visual complexity and clarify its presentation. Our approach is based on stratifying the drawing into layers with desired properties; to this aim, heuristics are presented. The produced layers can be explored and combined by the user to gradually acquire details. We present a user study to test the effectiveness of our approach. Furthermore, we performed an experimental analysis on popular force-directed graph drawing algorithms, in order to evaluate what is the algorithm that produces the smallest number of layers and if there is any correlation between the number of crossings and the number of layers of a graph layout. The proposed approach is useful to explore graph layouts, as confirmed by the presented user study. Furthermore, interesting considerations arise from …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:FPJr55Dyh1AC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Labeling Algorithms",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:kzcSZmkxUKAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Breast Cancer and Biomedical Informatics: The PrognoChip Project",
            "Publication year": 2005,
            "Publication url": "https://www.imbb.forth.gr/imbb-people/images/Kafetzopoulos/pdf/Conference_Proceedings/10.pdf",
            "Abstract": "Breast cancer is the most common malignancy affecting women, the life time risk being approximately 10%. Breast cancer is both genetically and histopathologically heterogeneous, and the underling development mechanisms remain largely unknown. Global expression analysis using microarrays offers unprecedented opportunities to obtain molecular signatures of the state of activity of diseased cells and patient samples. The predictive power of this approach is much greater than that of currently used approaches, but remains to be validated in prospective clinical studies. The PrognoChip project is based on the synergy between Bioinformatics and Medical Informatics, following the lines of the new raising discipline of Biomedical Informatics. In this context we are moving towards the specification and creation of an Integrated Clinico-Genomics Information Technology Environment (ICG-ITE) where, the smooth integration between the clinical and the genomics worlds as well as the intelligent processing of the underlying data, enables the identification of reliable and clinically valid (ie, in terms of prognosis) molecular (gene) markers.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adventures in abstraction: Reachability in hierarchical drawings",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1907.11662",
            "Abstract": "We present algorithms and experiments for the visualization of directed graphs that focus on displaying their reachability information. Our algorithms are based on the concepts of the path and channel decomposition as proposed in the framework presented in GD 2018 (pp. 579-592) and focus on showing the existence of paths clearly. In this paper we customize these concepts and present experimental results that clearly show the interplay between bends, crossings and clarity. Additionally, our algorithms have direct applications to the important problem of showing and storing transitivity information of very large graphs and databases. Only a subset of the edges is drawn, thus reducing the visual complexity of the resulting drawing, and the memory requirements for storing the transitivity information. Our algorithms require almost linear time, , where  is the number of paths/channels,  and  is the number of vertices and edges, respectively. They produce progressively more abstract drawings of the input graph. No dummy vertices are introduced and the vertices of each path/channel are vertically aligned.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:q-HalDI95KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DAGmaps and ε-visibility representations of DAGs",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11805-0_34",
            "Abstract": "DAGmaps are space filling visualizations of DAGs that generalize treemaps. Deciding whether or not a DAG admits a DAGmap is NP-complete. Recently we defined a special case called one-dimensional DAGmap where the admissibility is decided in linear time. However there is no complete characterization of the class of DAGs that admit a one-dimensional DAGmap. In this paper we prove that a DAG admits a one-dimensional DAGmap if and only if it admits a directed ε-visibility representation. Then we give a characterization of the DAGs that admit directed ε-visibility representations. Finally we show that a DAGmap defines a directed three-dimensional ε-visibility representation of a DAG.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:abG-DnoFyZgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Drawing non-planar graphs with crossing-free subgraphs",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-03841-4_26",
            "Abstract": "We initiate the study of the following problem: Given a non-planar graph G and a planar subgraph S of G, does there exist a straight-line drawing Γ of G in the plane such that the edges of S are not crossed in Γ? We give positive and negative results for different kinds of spanning subgraphs S of G. Moreover, in order to enlarge the subset of instances that admit a solution, we consider the possibility of bending the edges of G ∖ S; in this setting different trade-offs between number of bends and drawing area are given.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Medical informatics and bioinformatics: a bibliometric study",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4167896/",
            "Abstract": "This paper reports on an analysis of the bioinformatics and medical informatics literature with the objective to identify upcoming trends that are shared among both research fields to derive benefits from potential collaborative initiatives for their future. Our results present the main characteristics of the two fields and show that these domains are still relatively separated",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Weak dominance drawings for directed acyclic graphs",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-36763-2_52",
            "Abstract": "The dominance drawing method has many important aesthetic properties, including small number of bends, good vertex placement, and symmetry display [1]. Furthermore, it encapsulates the aspect of characterizing the transitive closure of the digraph by means of a geometric dominance relation among the vertices. A dominance drawing Γ of a planar st-graph G is a drawing, such that for any two vertices u and v there is a directed path from u to v in G if and only if X(u) ≤ X(v) and Y(u) ≤ Y(v) in Γ [1]. Here we study weak dominance drawings where for any two vertices u and v if there is a directed path from u to v in G then X(u) ≤ X(v) and Y(u) ≤ Y(v) in Γ.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Labeling graphical features of drawings",
            "Publication year": 2000,
            "Publication url": "https://patents.google.com/patent/US6091424A/en",
            "Abstract": "A method is provided for automated placement of labels for a given graph layout or map. Even though in practice a label is usually associated with a line (edge), point (node) or area, this method can be extended to produce labeling solution for any graphical feature with explicit geometric representation (in two or three dimensions). This method first finds a labeling solution for a set of graphical features G by eliminating a subset of the set of potential label placements for any member of G, and reducing the labeling problem to a maximum matching problem of a bipartite graph. Next, if there are graphical features in G that have no label placement assigned to them yet, a backtracking algorithm may be used to improve the space available for the labeled graphical features. It may be shown that the labeling problem is NP-hard if any graphical feature in G is a line or point. As a result, the GFLP problem cannot be solved in …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Treemaps for directed acyclic graphs",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-77537-9_37",
            "Abstract": "Gene Ontology information related to the biological role of genes is organized in a hierarchical manner that can be represented by a directed acyclic graph (DAG). Treemaps graphically represent hierarchical information via a two-dimensional rectangular map. They efficiently display large trees in limited screen space. Treemaps have been used to visualize the Gene Ontology by first transforming the DAG into a tree. However this transformation has several undesirable effects such as producing trees with a large number of nodes and scattering the rectangles associated with the duplicates of a node around the screen. In this paper we introduce the problem of visualizing a DAG as a treemap, we present two special cases, and we discuss complexity results.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "http://jgaa.. info",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=VpxKi9WTLtQC&oi=fnd&pg=PA313&dq=info:_FYaRocOmk4J:scholar.google.com&ots=ZfOR0o4AQs&sig=XPEJVTraQUwEGp5rkI0nGhIkVBE",
            "Abstract": "We present a framework for the automatic generation of layouts of statechart diagrams. Statecharts (16) are widely used for the requirements specification of reactive systems. Our framework is based on several techniques that include hierarchical drawing, labeling, and floorplanning, designed to work in a cooperative environment. Therefore, the resulting drawings enjoy several important properties: they emphasize the natural hierarchical decomposition of states into substates; they have a low number of edge crossings; they have good aspect ratio; and require a small area. We also present techniques for interactive operations. We have im-plemented our framework and obtained drawings for several statechart examples.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:RoXSNcbkSzsC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Algorithms for incremental orthogonal graph drawing in three dimensions",
            "Publication year": 2002,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812777638_0019",
            "Abstract": "We present two algorithms for orthogonal graph drawing in three dimensional space. For a graph with  vertices of maximum degree six, the 3-D drawing is produced in linear time, has volume at most 4.63n3 and has at most three bends per edge. If the degree of the graph is arbitrary, the vertices are represented by solid 3-D boxes whose surface is proportional to their degree. The produced drawing has two bends per edge. Both algorithms guarantee no crossings and can be used under an interactive setting (i.e., vertices arrive and enter the drawing on-line), as well.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Graphs with Obstacle Number Greater than One.",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1606.03782",
            "Abstract": "An \\emph{obstacle representation} of a graph  is a straight-line drawing of  in the plane together with a collection of connected subsets of the plane, called \\emph{obstacles}, that block all non-edges of  while not blocking any of the edges of . The \\emph{obstacle number} obs is the minimum number of obstacles required to represent . We study the structure of graphs with obstacle number greater than one. We show that the icosahedron has obstacle number , thus answering a question of Alpert, Koch, \\& Laison asking whether all planar graphs have obstacle number at most . We also show that the -skeleton of a related polyhedron, the \\emph{gyroelongated -dipyramid}, has obstacle number . The order of this graph is , which is also the order of the smallest known graph with obstacle number . Some of our methods involve instances of the Satisfiability problem, we make use of various \"SAT solvers\" in order to produce computer-assisted proofs.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:F1b5ZUV5XREC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Graph Drawing",
            "Publication year": 2009,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2009LNCS.5417.....T/abstract",
            "Abstract": "Graph Drawing - NASA/ADS Now on home page ads icon ads Enable full ADS view NASA/ADS \nGraph Drawing Tollis, Ioannis G. ; Patrignani, Maurizio Abstract Publication: Lecture Notes in \nComputer Science Pub Date: 2009 DOI: 10.1007/978-3-642-00219-9 Bibcode: 2009LNCS......T \nKeywords: Computer Science; Discrete Mathematics in Computer Science; Algorithm Analysis \nand Problem Complexity; Computer Graphics; Data Structures full text sources Publisher | © \nThe SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated \nby the Smithsonian Astrophysical Observatory under NASA Cooperative Agreement \nNNX16AC86A NASA logo Smithsonian logo Resources About ADS ADS Help What's New \nCareers@ADS Social @adsabs ADS Blog Project Switch to full ADS Is ADS down? (or is \nit just me...) Smithsonian Institution Smithsonian Privacy Notice Smithsonian Terms of Use …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:GFxP56DSvIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning causal structure from overlapping variable sets",
            "Publication year": 2010,
            "Publication url": "http://proceedings.mlr.press/v9/triantafillou10a.html",
            "Abstract": "We present an algorithm name cSAT+ for learning the causal structure in a domain from datasets measuring different variables sets. The algorithm outputs a graph with edges corresponding to all possible pairwise causal relations between two variables, named Pairwise Causal Graph (PCG). Examples of interesting inferences include the induction of the absence or presence of some causal relation between two variables never measured together. cSAT+ converts the problem to a series of SAT problems, obtaining leverage from the efficiency of state-of-the-art solvers. In our empirical evaluation, it is shown to outperform ION, the first algorithm solving a similar but more general problem, by two orders of magnitude.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:JV2RwH3_ST0C",
            "Publisher": "JMLR Workshop and Conference Proceedings"
        },
        {
            "Title": "ViSta",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45848-4_56",
            "Abstract": "ViSta is a tool suite designed to support the requirements specification phase of reactive systems. It includes a template wizard, a graphical editor and a statechart visualization tool. The template wizard guides the user through the steps necessary for the extraction of relevant information from a textual description of requirements. This information is stored in a database that is used by the statechart visualization tool to automatically generate statechart layouts. The statechart visualization tool offers a framework that combines hierarchical drawing, labeling, and floorplanning techniques.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:mUJArPsKIAAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A framework and algorithms for circular drawings of graphs",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570866705000031",
            "Abstract": "In this paper, we present a framework and two linear time algorithms for obtaining circular drawings of graphs. The first technique produces circular drawings of biconnected graphs and finds a zero crossing circular drawing if one exists. The second technique finds multiple embedding circle drawings. Techniques for the reduction of edge crossings are also discussed. Results of experimental studies are included.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:jFemdcug13IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the topologies of local minimum spanning trees",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11922377_4",
            "Abstract": "This paper is devoted to study the combinatorial properties of Local Minimum Spanning Trees (LMSTs), a geometric structure that is attracting increasing research interest in the wireless sensor networks community. Namely, we study which topologies are allowed for a sensor network that uses, for supporting connectivity, a local minimum spanning tree approach. First, we refine the current definition of LMST realizability, focusing on the role of the power of transmission (i.e., of the radius of the covered area). Second, we show simple planar, connected, and triangle-free graphs with maximum degree 3 that cannot be represented as an LMST. Third, we present several families of graphs that can be represented as LMSTs. Then, we show a relationship between planar graphs and their representability as LMSTs based on homeomorphism. Finally, we show that the general problem of determining whether a …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:XiSMed-E-HIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Algorithms for visualizing phylogenetic networks",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-50106-2_15.pdf",
            "Abstract": "We study the problem of visualizing phylogenetic networks, which are extensions of the Tree of Life in biology. We use a space filling visualization method, called DAGmaps, in order to obtain clear visualizations using limited space. In this paper, we restrict our attention to galled trees and galled networks and present linear time algorithms for visualizing them as DAGmaps.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:SGW5VrABaM0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "2-Layer Fan-Planarity: From Caterpillar to Stegosaurus",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-27261-0_24",
            "Abstract": "In a fan-planar drawing of a graph there is no edge that crosses two other independent edges. We study 2-layer fan-planar drawings, i.e., fan-planar drawings such that the vertices are assigned to two distinct horizontal layers and edges are straight-line segments that connect vertices of different layers. We characterize 2-layer fan-planar drawable graphs and describe a linear-time testing and embedding algorithm for biconnected graphs. We also study the relationship between 2-layer fan-planar graphs and 2-layer right-angle crossing graphs.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:nZcligLrVowC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "in Graph Drawing Algorithms",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=15183761852192262490&hl=en&oi=scholarr",
            "Abstract": "Many graph drawing algorithms use st-numberings (st-orien-tations or bipolar orientations) as a first step. An st-numbering of a bi-connected undirected graph defines a directed graph with no cycles, one single source s and one single sink t. As there exist exponentially many st-numberings that correspond to a certain undirected graph G, using different st-numberings in various graph drawing algorithms can result in aesthetically different drawings with different area bounds. In this paper, we present results concerning new algorithms for parameterized st-orientations, their impact on graph drawing algorithms and especially in visibility representations.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:QUX0mv85b1cC",
            "Publisher": "Springer,."
        },
        {
            "Title": "1 Short Description",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/3-540-45848-4.pdf#page=495",
            "Abstract": "ViSta is a tool suite designed to support the requirements specification phase of reactive systems. It includes a template wizard, a graphical editor and a statechart visualization tool. The template wizard guides the user through the steps necessary for the extraction of relevant information from a textual description of requirements. This information is stored in a database that is used by the statechart visualization tool to automatically generate statechart layouts. The statechart visualization tool offers a framework that combines hierarchical drawing, labeling, and floorplanning techniques.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:HE397vMXCloC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "DAGmaps and dominance relationships",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11805-0_46",
            "Abstract": "In [2] we use the term DAGmap to describe space filling visualizations of DAGs according to constraints that generalize treemaps and we show that deciding whether or not a DAG admits a DAGmap drawing is NP-complete. Let G = (V,E) be a DAG with a single source s. A component st-graph G  u,v  of G is a subgraph of G with a single source u and a single sink v that contains at least two edges and that is connected with the rest of G through vertex u and/or vertex v. A vertex w dominates a vertex v if every path from s to v passes through w. The dominance relation in G can be represented in compact form as a tree T, called the dominator tree of G, in which the dominators of a vertex v are its ancestors. Vertex w is the immediate dominator of v if w is the parent of v in T. A simple and fast algorithm to compute T has been proposed by Cooper et al. [1]. The post …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Circular drawings of telecommunication networks",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812793928_0028",
            "Abstract": "Visualizations of networks which show the inherent strengths and weaknesses of structures with clustered views are advantageous additions to many telecommunication network design tools. In this paper we introduce linear time techniques to produce circular visualizations of trees and other nonbiconnected telecommunication networks on a single embedding circle. Furthermore, the drawings produced by these techniques clearly show the biconnectivity structure of the given networks.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic placement of labels in maps and drawings",
            "Publication year": 2018,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781351235426-7/automatic-placement-labels-maps-drawings-konstantinos-kakoulis-ioannis-tollis",
            "Abstract": "Traditionally, the placement of labels has been central in the framework of cartography. Today, due to the significant growth in the area of information visualization the placement of labels may be seen through a wider scope. Labels are textual descriptions, and thus another means to convey information or clarify the meaning of complex structures. The problem of automatic label placement is important [1], and has applications in many areas including information visualization [2], cartography [3], geographic information science (GIS)[4], and graph drawing [5, 6].",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:7H_MAutzIkAC",
            "Publisher": "Chapman and Hall/CRC"
        },
        {
            "Title": "Morphological classification of heartbeats using similarity features and a two-phase decision tree",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4749175/",
            "Abstract": "Significant clinical information can be obtained from the analysis of the dominant beat morphology. In such respect, the identification of the dominant beats and their averaging can be very helpful, allowing clinicians to perform the measurement of amplitudes and intervals on a beat much cleaner from noise than a generic beat selected from the entire ECG recording. In this paper an algorithm for the morphological classification of heartbeats based on a two-phase decision tree is described. Similarity features extracted from every beat are used in the decision trees for the identification of different morphological classes for the beats of the ECG signal. The results, in terms of dominant beat discrimination, have been evaluated on all annotated beats of the MIT-BIH arrhythmia database with sensitivity = 99.05%, specificity = 93.94%, positive predictive value (PPV) = 99.32% and negative predictive value (NPV) = 91.69 …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handbook of Approximation Algorithms and Metaheuristics: Contemporary and Emerging Applications, Volume 2",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=PEkPEAAAQBAJ&oi=fnd&pg=PP1&dq=info:KIHmfwe5KfYJ:scholar.google.com&ots=6ce3Hforqt&sig=Gu-RAh_5Tp6dDZdgYK33f5-B9-s",
            "Abstract": "Handbook of Approximation Algorithms and Metaheuristics, Second Edition reflects the tremendous growth in the field, over the past two decades. Through contributions from leading experts, this handbook provides a comprehensive introduction to the underlying theory and methodologies, as well as the various applications of approximation algorithms and metaheuristics. Volume 1 of this two-volume set deals primarily with methodologies and traditional applications. It includes restriction, relaxation, local ratio, approximation schemes, randomization, tabu search, evolutionary computation, local search, neural networks, and other metaheuristics. It also explores multi-objective optimization, reoptimization, sensitivity analysis, and stability. Traditional applications covered include: bin packing, multi-dimensional packing, Steiner trees, traveling salesperson, scheduling, and related problems. Volume 2 focuses on the contemporary and emerging applications of methodologies to problems in combinatorial optimization, computational geometry and graphs problems, as well as in large-scale and emerging application areas. It includes approximation algorithms and heuristics for clustering, networks (sensor and wireless), communication, bioinformatics search, streams, virtual communities, and more. About the Editor Teofilo F. Gonzalez is a professor emeritus of computer science at the University of California, Santa Barbara. He completed his Ph. D. in 1975 from the University of Minnesota. He taught at the University of Oklahoma, the Pennsylvania State University, and the University of Texas at Dallas, before joining the UCSB computer science faculty …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:kF1pexMAQbMC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Analysis and visualization of metabolic pathways and networks: A hypegraph approach",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6864316/",
            "Abstract": "Metabolic pathways are series of chemical reactions occurring in a cell. Various graph-based models are used to represent metabolic data. However, diverse problems may arise from adopting these models. A more accurate modeling framework can be offered by hypergraphs. In this paper, a new technique for visualizing hypergraphs using common graph drawing techniques is proposed. This method is implemented in VisBolic, a case tool for the analysis and visualization of metabolic pathways; several examples are presented.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:rmuvC79q63oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring complex drawings via edge stratification",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-03841-4_27",
            "Abstract": "We propose an approach that allows a user to explore a layout produced by any graph drawing algorithm, in order to reduce the visual complexity and clarify its presentation. Our approach is based on stratifying the drawing into layers with desired properties; layers can be explored and combined by the user to gradually acquire details. We present stratification heuristics, a user study, and an experimental analysis that evaluates how our stratification heuristics behave on the drawings computed by a variety of popular force-directed algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On labeling in graph visualization",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020025507000412",
            "Abstract": "When visualizing graphs, it is essential to communicate the meaning of each graph object via text or graphical labels. Automatic placement of labels in a graph is an NP-Hard problem, for which efficient heuristic solutions have been recently developed. In this paper, we describe a general framework for modeling, drawing, editing, and automatic placement of labels respecting user constraints. In addition, we present the interface and the basic engine of the Graph Editor Toolkit – a family of portable graph visualization libraries designed for integration into graphical user interface application programs. This toolkit produces a high quality automated placement of labels in a graph using our framework. A brief survey of automatic label placement algorithms is also presented. Finally we describe extensions to certain existing automatic label placement algorithms, allowing their integration into this visualization tool.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:IWHjjKOFINEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "DAGmaps and ε-Visibility Representations for DAGs: Algorithms and Characterizations.",
            "Publication year": 2012,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.261.1228&rep=rep1&type=pdf",
            "Abstract": "DAGmaps are space filling visualizations of DAGs that generalize treemaps. Deciding whether or not a DAG admits a DAGmap is NP-complete. Although any layered planar DAG admits a one-dimensional DAGmap there was no complete characterization of the class of DAGs that admit a one-dimensional DAGmap. In this paper we prove that a DAG admits a one-dimensional DAGmap if and only if it admits a directed ε-visibility representation. Then we characterize the class of DAGs that admit directed ε-visibility representations. This class consists of the DAGs that admit a downward planar straight-line drawing such that all source and sink vertices are assigned to the external face. Finally we show that a DAGmap defines a directed three-dimensional ε-visibility representation of a DAG.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Validating 4D Models of Human Pathophysiology.",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=8125076043888261817&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DAGmaps: Space Filling Visualization of Directed Acyclic Graphs.",
            "Publication year": 2009,
            "Publication url": "https://www.emis.de/journals/JGAA/accepted/2009/TsiarasTriantafilouTollis2009.13.3.pdf",
            "Abstract": "Gene Ontology information related to the biological role of genes is organized in a hierarchical manner that can be represented by a directed acyclic graph (DAG). Space filling visualizations, such as the treemaps, have the capacity to display thousands of items legibly in limited space via a two-dimensional rectangular map. Treemaps have been used to visualize the Gene Ontology by first transforming the DAG into a tree. However this transformation has several undesirable effects such as producing trees with a large number of nodes and scattering the rectangles associated with the duplicates of a node around the display rectangle. In this paper we introduce the problem of visualizing a DAG with space filling techniques without converting it to a tree first, we present two special cases of the problem, and we discuss complexity issues.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modifying orthogonal drawings for label placement",
            "Publication year": 2016,
            "Publication url": "https://www.mdpi.com/133254",
            "Abstract": "In this paper, we investigate how one can modify an orthogonal graph drawing to accommodate the placement of overlap-free labels with the minimum cost (ie, minimum increase of the area and preservation of the quality of the drawing). We investigate computational complexity issues of variations of that problem, and we present polynomial time algorithms that find the minimum increase of space in one direction, needed to resolve overlaps, while preserving the orthogonal representation of the orthogonal drawing when objects have a predefined partial order. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:uDGL6kOW6j0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A framework for the static and interactive visualization of statecharts",
            "Publication year": 2002,
            "Publication url": "http://ftp.gwdg.de/pub/misc/EMIS/journals/JGAA/accepted/02/CastelloMiliTollis02.6.3.pdf",
            "Abstract": "We present a framework for the automatic generation of layouts of statechart diagrams. Statecharts [16] are widely used for the requirements specification of reactive systems. Our framework is based on several techniques that include hierarchical drawing, labeling, and floorplanning, designed to work in a cooperative environment. Therefore, the resulting drawings enjoy several important properties: they emphasize the natural hierarchical decomposition of states into substates; they have a low number of edge crossings; they have good aspect ratio; and require a small area. We also present techniques for interactive operations. We have implemented our framework and obtained drawings for several statechart examples.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "page 3",
            "Publication year": 2001,
            "Publication url": "http://www.nzdl.org/cgi-bin/library?e=d-00000-00---off-0cstr--00-0----0-10-0---0---0direct-10---4-------0-1l--11-en-50---20-about---00-0-1-00-0--4----0-0-11-10-0utfZz-8-00&cl=CL1.87&d=HASHc8b195981a148898162e6a.3&hl=0&gc=0&gt=2",
            "Abstract": "Drawing graphs is an important problem that combines flavors of computational geometry and graph theory. Applications can be found in a variety of areas including circuit layout, network management, software engineering, and graphics.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:wvYxNZNCP7wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visualization of biological information with circular drawings",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30547-7_47",
            "Abstract": "Being able to clearly visualize clusters of genes provided by gene expressions over a set of samples is of high importance. It gives researchers the ability to create an image of the structure, and connections of the information examined. In this paper we present a tool for visualizing such information, with respect to clusters trying to produce an aesthetic, Symmetrie image, which allows the user to interact with the application and query for specific information.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Parallel algorithm for planar orthogonal grid drawings",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0129626400000147",
            "Abstract": "In this paper we consider the problem of constructing planar orthogonal grid drawings (or more simply, layouts) of graphs, with the goal of minimizing the number of bends along the edges. We present optimal parallel algorithms that construct graph layouts with O(n) maximum edge length, O(n2) area, and at most 2n+4 bends (for biconnected graphs) and 2.4n+2 bends (for simply connected graphs). All three of these quality measures for the layouts are optimal in the worst case for biconnected graphs. The algorithm runs on a CREW PRAM in O(log n) time with n/log n processors, thus achieving optimal time and processor utilization. Applications include VLSI layout, graph drawing, and wireless communication.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:EUQCXRtRnyEC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Planar L-Drawings of Directed Graphs",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=v-xIDwAAQBAJ&oi=fnd&pg=PA465&dq=info:RXvBgXlUQpIJ:scholar.google.com&ots=-A9QiUxfFQ&sig=ilwcGR0O9EZorGw32-f5WQi8bms",
            "Abstract": "We study planar drawings of directed graphs in the L-drawing standard. We provide necessary conditions for the existence of these drawings and show that testing for the existence of a planar L-drawing is an NP-complete problem. Motivated by this result, we focus on upward-planar L-drawings. We show that directed st-graphs admitting an upward-(resp. upward-rightward-) planar L-drawing are exactly those admitting a bitonic (resp. monotonically increasing) st-ordering. We give a linear-time algorithm that computes a bitonic (resp. monotonically increasing) st-ordering of a planar st-graph or reports that there exists none.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:MhiOAD_qIWkC",
            "Publisher": "Springer"
        },
        {
            "Title": "A computational exploration of bacterial metabolic diversity identifying metabolic interactions and growth-efficient strain communities",
            "Publication year": 2011,
            "Publication url": "https://bmcsystbiol.biomedcentral.com/articles/10.1186/1752-0509-5-167",
            "Abstract": "Metabolic interactions involve the exchange of metabolic products among microbial species. Most microbes live in communities and usually rely on metabolic interactions to increase their supply for nutrients and better exploit a given environment. Constraint-based models have successfully analyzed cellular metabolism and described genotype-phenotype relations. However, there are only a few studies of genome-scale multi-species interactions. Based on genome-scale approaches, we present a graph-theoretic approach together with a metabolic model in order to explore the metabolic variability among bacterial strains and identify and describe metabolically interacting strain communities in a batch culture consisting of two or more strains. We demonstrate the applicability of our approach to the bacterium E. coli across different single-carbon-source conditions. A different diversity graph is constructed for each growth condition. The graph-theoretic properties of the constructed graphs reflect the inherent high metabolic redundancy of the cell to single-gene knockouts, reveal mutant-hubs of unique metabolic capabilities regarding by-production, demonstrate consistent metabolic behaviors across conditions and show an evolutionary difficulty towards the establishment of polymorphism, while suggesting that communities consisting of strains specifically adapted to a given condition are more likely to evolve. We reveal several strain communities of improved growth relative to corresponding monocultures, even though strain communities are not modeled to operate towards a collective goal, such as the community growth and we identify the range …",
            "Abstract entirety": 0,
            "Author pub id": "KmWfVqoAAAAJ:J_g5lzvAfSwC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Properties and Complexity of Fan-Planarity",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1406.5299",
            "Abstract": "In a \\emph{fan-planar drawing} of a graph an edge can cross only edges with a common end-vertex. Fan-planar drawings have been recently introduced by Kaufmann and Ueckerdt, who proved that every -vertex fan-planar drawing has at most  edges, and that this bound is tight for . We extend their result, both from the combinatorial and the algorithmic point of view. We prove tight bounds on the density of constrained versions of fan-planar drawings and study the relationship between fan-planarity and -planarity. Furthermore, we prove that deciding whether a graph admits a fan-planar drawing in the variable embedding setting is NP-complete.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:86PQX7AUzd4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Brain Network Analyzer",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00219-9_51",
            "Abstract": "Brain Network Analyzer is an application, written in Java, that displays and analyzes synchronization networks from brain signals. The program implements a number of network indices and visualization techniques. The program has been used to analyze networks produced by electroencephalogram data of alcoholic and control patients.",
            "Abstract entirety": 1,
            "Author pub id": "KmWfVqoAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]