[{
    "name": "Ιωάννης Τιγκελης ",
    "romanize name": "Ioannis Tigkelis ",
    "School-Department": "Φυσικής",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 18131,
    "Scholar name": "Ioannis Tigelis",
    "Scholar id": "9CBNSZsAAAAJ",
    "Affiliation": "National and Kapodistrian University of Athens",
    "Citedby": 1108,
    "Interests": [
        "Microwave Sources",
        "Applied Electromagnetism"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=9CBNSZsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Towards a 1.5 MW, 140 GHz gyrotron for the upgraded ECRH system at W7-X",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920379620307213",
            "Abstract": "For the required upgrades of the Electron Cyclotron Resonance Heating system at the stellarator Wendelstein 7-X, the development of a 1.5 MW 140 GHz Continuous Wave (CW) prototype gyrotron has started. KIT has been responsible to deliver the scientific design of the tube (i.e. the electron optics design and the RF design), with contributions from NKUA and IPP. The prototype gyrotron has been ordered at the industrial partner, Thales, France, and is expected to be delivered in 2021. In parallel, a short-pulse pre-prototype gyrotron has been developed at KIT, to provide the means for a first experimental validation of the scientific design in ms pulses, prior to the construction of the CW prototype. This paper reports on the status of the 1.5 MW CW gyrotron development, focusing on the scientific design and its numerical and experimental validation.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:dTyEYWd-f8wC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Scattering of Radio Frequency Waves by Density Fluctuations in Tokamak Plasmas",
            "Publication year": 2016,
            "Publication url": "http://library.psfc.mit.edu/catalog/reports/2010/16ja/16ja037/16ja037_full.pdf",
            "Abstract": "In tokamak fusion plasmas, coherent fluctuations in the form of blobs or filaments and incoherent fluctuations due to turbulence are routinely observed in the scrape-off layer. Radio frequency (RF) electromagnetic waves, excited by antenna structures placed near the wall of a tokamak, have to propagate through the scrape-off layer before reaching the core of the plasma. RF waves in the electron cyclotron and lower hybrid range of frequencies are commonly used to modify the current profile. In the International Thermonuclear Experimental Reactor (ITER), electron cyclotron waves are expected to stabilize the neoclassical tearing mode by providing current in the island region. While the effect of fluctuations on RF waves has not been quantified experimentally, there are telltale signs, arising from differences between results from simulations and from experiments, that fluctuations can modify the spectrum of RF waves. Consequently, pioneering theoretical studies and complementary computer simulations have been pursued to elucidate the impact of fluctuations on RF waves. These studies, using the full complement of Maxwell’s equations for a cold, magnetized plasma, show that the Poynting flux in the wake of the filament develops spatial structure due to diffraction and shadowing. The uniformity of power flow into the plasma is affected by side-scattering, modifications to the wave spectrum, and coupling to plasma waves other than the incident RF wave. The Snell’s law and the Fresnel equations have been reformulated within the context of magnetized plasmas. These are distinctly different from their counterparts in scalar dielectric media, and …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Progress of The Experiments With the European 1Mw, 170Ghz Industrial Cw Prototype Gyrotron For Iter",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8496136/",
            "Abstract": "The first series of experiments with the EU 1 MW, 170 GHz CW industrial prototype gyrotron 1  for ITER have been completed at the KIT test facility at the end of 2016. Depressed collector operation with 180s pulses (pulse length limited by the HV power supply at KIT) at the Low Voltage Operating Point (I b ~45 A, V acc ~71 kV) resulted in 0.8 MW RF output power with 37 % total efficiency. Similar results were obtained for the High Voltage Operating Point (I b ~40 A, V acc ~80 kV) also. The experiments on the CW gyrotron with pulse duration of up to 1 hour will be continued in 2017 at SPC, Lausanne. In parallel, further experiments with the almost identical, modular short-pulse (SP) version of the gyrotron 2 , which delivered more than 1.2 MW, are currently ongoing at KIT in order to identify ways to further improve the performance of the CW prototype.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recent progress in the development of the european 1 MW, 170 GHz cw gyrotron for ITER",
            "Publication year": 2018,
            "Publication url": "https://nucleus.iaea.org/sites/fusionportal/Shared%20Documents/FEC%202018/fec2018-preprints/preprint0192.pdf",
            "Abstract": "The EU 1 MW gyrotron for the ITER Electron Cyclotron Heating and Current Drive (EC H&CD) system has been developed in coordinated efforts from several EU institutions (EGYC) and with support of F4E. In a first experimental campaign the tube has been optimized in short pulse operation and has been conditioned for long pulse operation at the KIT teststand up to 180 s. In a second experimental campaign the tube has been transferred to SPC, EPFL, for operation in a dedicated super-conducting magnet at increased pulse length. This paper presents the main experimental results of the prototype tube achieved at KIT.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reflectivity properties of an anisotropic slab waveguide with isolated substrate",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-24-2-493",
            "Abstract": "The scattering properties for both TE and TM modes of an abruptly ended two-layered slab waveguide with anisotropic core and isolated substrate are examined by an improved iteration technique, which is based on the integral equation method with accelerating parameters. The relative dielectric constants of the core for the three Cartesian directions are considered to be different, but cases with isotropic core are also considered. The electric field distribution on the terminal plane and the reflection coefficients of the dominant TE and TM guided modes, as well as the near-field distribution and the far-field radiation pattern, are computed, while numerical results are presented for several cases of the core anisotropy.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:IWHjjKOFINEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Numerical analysis of radiation modes of planar waveguides",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=656899399098425898&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "SCRIPTA TECHNICA, INC."
        },
        {
            "Title": "Dispersion characteristics of a rectangular waveguide grating",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1240060/",
            "Abstract": "We study the dispersion characteristics of a rectangular waveguide grating for microwave amplifier applications. The Floquet theorem and an appropriate standing waves expansion is employed to express the fields in the vacuum region and inside the grooves, respectively. The application of the boundary conditions leads to an infinite system of equations, which is solved numerically by truncation. The main advantage of the procedure employed is that it gives directly and with a few spatial harmonics the dispersion relation. Furthermore, an adequate procedure (simulation tool) has been introduced in order to distinguish the real roots from spurious solutions and it has been found to work effectively for all cases presented in this work. Numerical results are presented for both shallow and deep grooves and comparison with previously published works is made.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tests and developments of a long-pulse high-power 170 GHz absorbing matched load",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920379618307270",
            "Abstract": "The future EC systems will consist of several gyrotron sources providing MW-level millimeter wave power at a frequency around or above 170 GHz. The development of matched loads is necessary to test the new sources, the components for the transmission lines and the launchers, and must ensure high qualification for compatibility with the nuclear environment. The development at IFP-CNR and LTC of several compact high-power prototypes during the last decade led to a refinement of the overall design, resulting in the present low-reflectivity vacuum-compatible loads. The activity on loads is supported by F4E in view of the development of the EU gyrotron for ITER and required high-power tests at QST (Naka, Japan). Qualification is now supported by new tests at SPC (Lausanne, Switzerland) using the FALCON test-bed designed to test components and the EU gyrotron prototype for the EC system of ITER …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:eJXPG6dFmWUC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Investigations on parasitic oscillations in megawatt gyrotrons",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5324775/",
            "Abstract": "Recently megawatt gyrotrons are found to suffer from parasitic oscillations induced by the electron beam prior to the desired interaction zone (the cavity). This paper describes experimental and theoretical investigations on both high and low frequency parasitic oscillations. A new measurement method is introduced to determine and characterize these undesired oscillations, and a dedicated experimental study is presented.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Numerical investigations on the effects of electron beam misalignment on beam-wave interaction in a high-power coaxial gyrotron",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6665425/",
            "Abstract": "We investigate, by numerical simulations, the effects of a misaligned (i.e. shifted with respect to the resonator axis) electron beam on the beam-wave interaction in a 170 GHz, 2 MW coaxial gyrotron. The correlation of the simulations results with the experimental findings, which motivated the present study, is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Linear and non-linear inserts for genuinely wideband continuous frequency tunable coaxial gyrotron cavities",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s10762-008-9336-y",
            "Abstract": "We consider two continuous frequency tunable CW coaxial gyrotron oscillators, one 330 GHz with 3 GHz bandwidth and output power 50 – 400 W for scientific applications and one 30 GHz with 0.4 GHz bandwidth and output power 40 – 140 kW for industrial applications. The continuous tuning of both gyrotrons is achieved by moving the linearly tapered inner conductor in the axial direction in combination with the proper adjustment of the operating magnetic field. We consider also a non-linear tapering, which makes it possible to reduce the length of the insert and to improve efficiency of the device.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer US"
        },
        {
            "Title": "EU DEMO EC equatorial launcher pre-conceptual performance studies",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920379620301423",
            "Abstract": "The preliminary conceptual design for the Electron Cyclotron (EC) system of the future European DEMOnstration fusion power plant is ongoing in the EUROfusion Consortium. This represents one of the key aspects in order to assess the performances and the integration capabilities of such a system in EU DEMO as well as in the alternative reactor configuration Flexi-DEMO. Different options for the antenna, namely remote steering antenna (RSA), open ended waveguides (OEWG) and the front steering antenna (FSA) later on renamed in mid steering antenna (MSA) to notify that the MSA is protected behind the breeding blanket (BB) in DEMO, are investigated, analyzing their performance for several injection angles and launch points. This activity considers the constraints given by physics and engineering requirements, as for example the maximum power per port and the necessary local current drive to stabilize …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:olpn-zPbct0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "From W7-X towards ITER and beyond: Status and progress in EU fusion gyrotron developments",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7223795/",
            "Abstract": "In Europe, significant progress in gyrotron research, development and manufacturing has been made in 2014, starting from the successful continuation of the 1 MW, 140 GHz gyrotron production for the stellarator Wendelstein 7-X (W7-X) at Greifswald, Germany and the accelerated development of the EU 1 MW, 170 GHz conventional cavity gyrotron for the ITER tokamak at Cadarache, France. Based on that, a physical design activity was started which shall lead to a dual frequency gyrotron for TCV, Lausanne, Switzerland. Within the European fusion development consortium (EUROfusion), advanced gyrotron research and development has started towards a future gyrotron design which shall fulfil the needs of DEMO, the nuclear fusion demonstration power plant that will follow ITER. Within that research and development, the development of advanced design tools, components, and proper test environment is …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Numerical studies on the parasitic modes in gyrotron beam tunnels",
            "Publication year": 2011,
            "Publication url": "http://moag.phys.uoa.gr/moag_gr/posters/ICOPS2011b.pdf",
            "Abstract": "Megawatt gyrotrons are found to suffer from various RF oscillations in the beam tunnel prior to the desired interaction zone (the cavity). The development of such parasitic oscillations degrades the beam quality reducing the efficiency of the cyclotron interaction and the overall produced power. Furthermore, it affects the stability of operation1-3. Several design approaches have been implemented in order to suppress the parasitic modes; most of them involve the increase of the dissipation in the beam tunnel by means of lossy ceramic materials. However, despite the increased losses, parasitic oscillations still appear in most new designs, especially when the produced power and/or operating frequency is increased4. In this work, we employ the numerical code FISHBONE5, in order to study the parasitic modes which may appear in a gyrotron beam tunnel. Furthermore, the effect of the geometry of the structure as well as the various design parameters on the parasitic modes is studied, in order to identify the origin and properties of the parasitic oscillations.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scattering of radio frequency waves by cylindrical blobs in the plasma edge in tokamaks",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1801.01713",
            "Abstract": "Radio frequency waves are routinely used in tokamak fusion plasmas for plasma heating, current control, and as well as in diagnostics. These waves are excited by antenna structures placed near the tokamak's wall and they have to propagate through a turbulent layer known as scrape-off layer, before reaching the core plasma (which is their target). This layer exhibits coherent density fluctuations in the form of blobs and filaments. The scattering processes of RF plane waves by single blob is studied, with the assumption that the blob has cylindrical shape and infinite length. The axis of the blob is not necessarily aligned with the externally applied magnetic field in the case of plane waves. The investigation concerns the case of Electron Cyclotron (EC) waves ($f_0$=170 $GHz$) for ITER-like and Medium Size Tokamak applications (such as TCV, ASDEX-U, DIII-D, etc) as well as the case of Low Hybrid (LH) waves ($f_0$=4.6 $GHz$) for ALCATOR C-MOD Tokamak device. The study covers for a variety of density contrasts between the blobs and the ambient plasma and a wide range of blob radii.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EU gyrotron development for ITER: Recent achievements and experimental results of the coaxial 2 MW gyrotron",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6383938/",
            "Abstract": "The European Gyrotron Consortium (EGYC) is responsible for developing one set of 170 GHz mm-wave sources, in support of Europe's contribution to ITER 1 . The original plan of targeting a 2 MW coaxial gyrotron is currently under discussion, in view of essential delays and damages. This paper reports on the latest results and plans with regard to the 2 MW gyrotron prototypes.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Propagation Characteristics of Periodic Azimuthally Corrugated Waveguides Derived by the FDTD Code COCHLEA",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8873988/",
            "Abstract": "Azimuthal indentations have been proposed as an additional means to suppress the parasitic oscillations in the gyrotron stacked beam-tunnel. As a first step, a smooth waveguide with azimuthal indentations has been studied using COCHLEA code to identify their influence on the propagation characteristics. The - parameters have been calculated on the input and the output of the structure by decomposing the fields into several modes. It has been found that by increasing the indentations depth the field distributions change significantly and resonant effects are observed.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Radiation characteristics of a semi-infinite fiber waveguide for the case of transverse magnetic waves",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/027263401750158234",
            "Abstract": "We deal with the scattering phenomenon from an abruptly ended fiber waveguide by means of an integral equation appropriate for the boundary-value problem of the transverse magnetic (TM) waves. This equation is solved by applying an iterative procedure, which converges very fast, especially when the weak guidance condition is valid. The transverse electric-field distribution at the terminal plane, the reflection coefficient of the first TM guided mode, and the far-field radiation pattern are computed. Several numerical computations are performed and presented for various cases of abruptly ended fiber waveguides. The contribution of the radiation modes of the fiber waveguide to the electric-field distribution is estimated and special attention is given to the rotation of the far-field radiation pattern.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Informa UK Ltd"
        },
        {
            "Title": "European research activities towards a future DEMO gyrotron",
            "Publication year": 2017,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2017/18/epjconf_smp2017_04007/epjconf_smp2017_04007.html",
            "Abstract": "Coordinated by the EUROfusion Consortium, several European research institutes are working on fusion technologies towards options for a European DEMOnstration Fusion Power Plant (FPP), as a single step between ITER and a commercial FPP, to deliver net electricity by mid of this century. One of the focus areas is the research on a proper Electron Cyclotron Resonance Heating (ECRH) and Current Drive (ECCD) system for which the fusion gyrotron is one of its major key components [1]. A future FPP will probably require an ECCD operating frequency ranging from 170 GHz up to 240 GHz depending on the DEMO baseline. An RF output power of significantly higher than 1 MW (target: 2 MW) and a total gyrotron efficiency better than 60% are required. Multi-purpose operation at multiples of the λ/2-resonance frequency of the vacuum window of the gyrotron, hence in leaps of about 30 GHz (eg 170/204/238 …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:SP6oXDckpogC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Simulations of dynamic after-cavity interaction in gyrotrons",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=16347787077646389593&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scattering from an abruptly terminated planar metamaterial waveguide",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11141-010-9218-8.pdf",
            "Abstract": "We use a variational method to study the problem of reflection of a guided mode from an abruptly terminated planar dielectric waveguide made of a metamaterial. The theory is illustrated by problems of abruptly terminated three-layer waveguides with piecewise-constant and variable permittivity profiles. Differences in the scattering characteristics for systems with metamaterials and conventional media are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Effects of metal irises on the guided-mode properties in asymmetrical slab waveguides",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401807002167",
            "Abstract": "The diffraction phenomenon caused by metal transverse irises placed into an asymmetrical slab waveguide is examined by using the integral equation method. We concentrate on the possibility of controlling the radiation characteristics of the structure by changing the irises positions and the slab waveguide asymmetry. The aperture electric-field distribution is expressed in terms of a finite series of Chebyshev polynomials. The dominant TE guided-mode reflection and transmission coefficients, the near-field distribution and the far-field radiation pattern are calculated, while numerical results are presented for several cases of asymmetrical slab waveguides and different irises’ positions.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:4JMBOYKVnBMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "CW experiments with the EU 1-MW, 170-GHz industrial prototype gyrotron for ITER at KIT",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7997735/",
            "Abstract": "The European 1-MW, 170-GHz continuous wave industrial prototype gyrotron for electron cyclotron resonance heating and current drive on international thermonuclear experimental reactor was during 2016 under test at the Karlsruhe Institute of Technology (KIT) test facility. In order to optimize the gyrotron operation, the tube was at first thoroughly tested in the short-pulse regime, with pulses that did not exceed 10 ms, for a wide range of operational parameters. Then, and after proper conditioning of the tube, the operation was extended to longer pulses with duration up to 180 s, which is the maximum pulselength possible at the KIT test facility. In this paper, we present in detail the achievements of the long-pulse experimental campaign.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling of parasitic oscillations in smooth-wall circular symmetric dielectric-loaded gyrotron beam ducts",
            "Publication year": 2019,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5130637",
            "Abstract": "The self-consistent simulation of the electron beam interaction was performed in the presence of a lossy dielectric layer in the smooth-wall beam duct of a gyrotron oscillator. For this purpose, the linear and spectral code TWANGlinspec was extended. In this code, the local transverse structure of the TE mode is adapted to the solution of the complex cold dispersion relation of an infinite, homogeneous, dielectric coated cylindrical waveguide. Before considering the realistic situation, the validity of the TE pure mode (Ez = 0) assumed in TWANGlinspec had to be assessed for SiC or BeOSiC materials. The effect of the dielectric layer on the parasitic starting current is large for parasitic oscillations localized at the end of the beam duct and in the so-called spacer region. For the realistic case, the geometry of the dual frequency gyrotron for the Tokamak à Configuration Variable was considered, and the effect of a …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:AXPGKjj_ei8C",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "EU DEMO EC system preliminary conceptual design",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920379618303922",
            "Abstract": "The engineering design and R&D of auxiliary heating systems and their sub-systems are a key activities in the frame of the present conceptual design phase for a first of a kind DEMOnstration Fusion Power Plant in order to develop a system capable of achieving and controlling burning plasmas. In the frame of the EU DEMO reference design, the R&D activities consider the injection of about 50 MW of Electron Cyclotron (EC) power to support and assist different plasma phases. As the project is still in the conceptual phase, a range of options for gyrotrons, transmission lines and antennas is under assessment taking into account the guidelines for the integration of the EC system in a nuclear reactor and a maximal achievable reliability and availability of the EC power during operation.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:tS2w5q8j5-wC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Experimental verification of the European 1 MW, 170 GHz industrial CW prototype gyrotron for ITER",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920379617301047",
            "Abstract": "The EU 1 MW, 170 GHz gyrotron with hollow cylindrical cavity have been designed within the European GYrotron Consortium (EGYC) in collaboration with the industrial partner Thales Electron Devices (TED) and under the coordination of Fusion for Energy (F4E). In the frame of the EU program, the short-pulse (SP) version of this tube was designed and manufactured by KIT in collaboration with TED. The experimental verification of the SP gyrotron prototype was successfully completed in 2015. The achieved experimental results show a very stable gyrotron operation with RF output power above 1 MW at good cavity interaction efficiency around 35%. The gyrotron was operated up to 10 ms pulse length; the nominal cavity mode TE32,9 has been excited at the frequency 170.1 GHz in agreement with the corresponding ITER specification. The Gaussian mode content of the output RF beam was about 98% and the …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "2018 Status of Gyrotron R&D for W7-X, TCV, ITER and EU DEMO within Europe",
            "Publication year": 2018,
            "Publication url": "https://pure.mpg.de/pubman/faces/ViewItemOverviewPage.jsp?itemId=item_2639859",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Status of the development of the EU 170 GHz/1 MW/CW gyrotron",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920379615001416",
            "Abstract": "The progress in the development of the European 170 GHz, 1 MW/CW gyrotron for electron cyclotron heating & current drive (ECH&CD) on ITER is reported. A continuous wave (CW) prototype is being manufactured by Thales Electron Devices (TED), France, while a short-pulse (SP) prototype gyrotron is in parallel under manufacture at Karlsruhe Institute of Technology (KIT), with the purpose of validating the design of the CW industrial prototype components. The fabrication of most of the sub-assemblies of the SP prototype has been completed. In a first step, an existing magnetron injection gun (MIG) available at KIT was used. Despite this non-ideal configuration, the experiments provided a validation of the design, substantiated by an excellent agreement with numerical simulations. The tube, operated without a depressed collector, is able to produce more than 1 MW of output power with efficiency in excess of 30 …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:yD5IFk8b50cC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Increasing the diffraction losses in gyrotron beam tunnels for improved suppression of parasitic oscillations",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8874402/",
            "Abstract": "High-power gyrotrons often suffer from parasitic oscillations in the compression region (beam tunnel) prior to the interaction cavity. A possible way to suppress the parasitic oscillations is to raise their starting currents by increasing the losses of the structure. In the present contribution we focus on the diffraction losses of the stacked copper-ceramic beam-tunnel geometry. Parametric simulations show that the diffraction losses can be significantly increased by optimizing the geometric characteristics of the structure.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:HE397vMXCloC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Influence of the refractive index core profile on modal scattering of terminated two-dimensional waveguides",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-24-6-1752",
            "Abstract": "We examine the influence of the refractive index core profile on the modal scattering of abruptly terminated slab waveguides. The analysis is based on the integral equation method with accelerating parameters, while for the field description in the waveguide core, an appropriate Lanczos-Fourier expansion is employed. The electric-field distribution on the terminal plane, the reflection and transformation coefficient of the TE guided modes, and the far-field radiation pattern are computed. Numerical results are presented for slab waveguides with step, linear, and parabolic refractive index profiles of the core. Finally, several approximate analytical solutions are derived to study the problem in question and to explain the results obtained.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:maZDTaKrznsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Recent Development of a 1.5 MW, 140 GHz Continuous-Wave Gyrotron for the Upgraded ECRH System at W7-X",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9370666/",
            "Abstract": "To increase the total injected Electron Cyclotron Resonance Heating (ECRH) power in the plasma of the nuclear fusion experiment Wendelstein 7-X (W7-X), an upgrade of the existing gyrotron installation is in progress. The existing ECRH system, currently equipped with ten one-MW-class, 140 GHz continuous wave (CW) gyrotrons, will be augmented by enhanced 1.5 MW tubes, which are based on the successful existing 1 MW gyrotron design.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "From W7-X Towards ITER and Beyond: 2019 Status on EU Fusion Gyrotron Developments",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8744989/",
            "Abstract": "In Europe, the research and development with main focus on achieving robust industrial designs of series gyrotrons for electron cyclotron heating and current drive of today's nuclear fusion experiments and towards a future DEMOnstration fusion power plant is constantly progressing. The R&D is following two different paths. Both are complementing each other: Firstly, it is the adaption of the physical design and basic mechanical construction of the reliably operating 140 GHz, 1 MW CW (spec.: 920 kW, 1800 s) gyrotron of the stellarator Wendelstein 7-X (W7-X), Greifswald, Germany. With regards to time and costs it is the target to perform reliable developments of fusion gyrotrons with advanced specifications for today's plasma fusion experiments. Main focus is on the development of the first EU 170 GHz, 1 MW CW (3600 s) gyrotron for the installation in ITER, Cadarache, France. Another adaption is the dual …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Calculation of Electron Beam Properties under the Presence of an Axially Varying Magnetostatic Field by Using the FDTD Code COCHLEA",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9017745/",
            "Abstract": "The in-house FDTD code COCHLEA was upgraded to study the trajectory of a relativistic electron beam by developing a trajectory solver. To verify its results the electron beam properties were calculated for the test case of the motion of the beam in an axially varying magnetostatic field. For the case considered, the numerical results were compared to the analytical calculated ones presenting a very good agreement. This is an intermediate, albeit important step towards the upgrade of the code to study self-consistently the beam-wave interaction.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integration concept of an Electron Cyclotron System in DEMO",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920379621004294",
            "Abstract": "The pre-conceptual layout for an electron cyclotron system (ECS) in DEMO is described. The present DEMO ECS considers only equatorial ports for both plasma heating and neoclassical tearing mode (NTM) control. This differs from ITER, where four launchers in upper oblique ports are dedicated to NTM control and one equatorial EC port for heating and current drive (H&CD) purposes as basic configuration. Rather than upper oblique ports, DEMO has upper vertical ports to allow the vertical removal of the large breeding blanket segments. While ITER is using front steering antennas for NTM control, in DEMO the antennas are recessed behind the breeding blanket and called mid-steering antennas, referred to the radially recessed position to the breeding blanket.In the DEMO pre-conceptual design phase two variants are studied to integrate the ECS in equatorial ports. The first option integrates waveguide …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:SdhP9T11ey4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "The eddy current effect on the transversal sweeping system of a gyrotron collector",
            "Publication year": 2012,
            "Publication url": "http://moag.phys.uoa.gr/moag_gr/posters/ICOPS2012a.pdf",
            "Abstract": "Conclusion Introduction Sweeping systems comparison TFSS Attenuation and Phase Shift ZC Ioannidis1, IG Tigelis1, I. Gr. Pag",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improved suppression of parasitic oscillations in gyrotron beam tunnels by proper selection of the lossy ceramic material",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8246705/",
            "Abstract": "Lossy dielectric materials are used in gyrotron beam tunnels to suppress possible parasitic oscillations by raising their starting currents. The dependence of the overall losses of the structure on the dielectric properties of the material is theoretically and numerically investigated and it is shown that materials with high values of the loss tangent are not suitable for the suppression of the parasitics. The beam tunnel is studied parametrically with a full-wave code, which calculates the diffraction and dielectric losses of the cold-cavity modes. A simplified geometry involving analytic relations is used to verify the results and investigate the underlying physics. It is shown that the proper selection of the material properties and its radial thickness can improve the absorption of the fields significantly.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The contribution of higher-order spatial harmonics in eigenvalues and ohmic losses calculations in coaxial corrugated cavities",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5612398/",
            "Abstract": "The Spatial Harmonics Method has been used to study TE modes in a coaxial corrugated cavity. A numerical code has been developed to calculate eigenvalues, fields and ohmic losses on the walls. Numerical results are presented to clarify the influence of the higher-order spatial harmonics to these calculations.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Eigenvalue spectrum of coaxial cavities with corrugations on the inner and the outer wall",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6665655/",
            "Abstract": "The Spatial Harmonics Method (SHM) has been employed to study TE modes in a coaxial cavity with corrugations both on the inner and the outer wall. Such cavities seem to have the potential for superior mode-selectivity and could be employed for the development of multi-MW gyrotrons above 200 GHz.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FDTD simulation of a cylindrical waveguide using longitudinal current distribution as an excitation scheme",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Dimitrios-Peponis/publication/280034681_FDTD_Simulation_of_a_Cylindrical_Waveguide_Using_Longitudinal_Current_Distribution_as_an_Excitation_Scheme/links/55b09ea508ae11d31039c1f9/FDTD-Simulation-of-a-Cylindrical-Waveguide-Using-Longitudinal-Current-Distribution-as-an-Excitation-Scheme.pdf",
            "Abstract": "In this work a numerical code based on the FDTD method is presented, developed in the cylindrical coordinate system. In order to verify the code, a case of a cylindrical waveguide excited by an axial current distribution is presented. The waveguide is terminated using a CFSPML layer in order to absorb the excited waves in the structure. Moreover, the behaviour of the CFS-PML is examined in such geometries.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Calculation of the electromagnetic waves in nonperiodic corrugated waveguides with dielectric loading",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1321294/",
            "Abstract": "We present the mathematical analysis, based on an eigenfunction expansion, and the main steps of the corresponding numerical code developed to calculate the dispersion relation and the field distributions for all kind of waves, which can propagate in a nonperiodic circumferentially corrugated circular waveguide with losses. The code offers fast computations with accuracy, which can be chosen by the user. Numerical results are given for several geometries and comparison with already established codes is made.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Selectivity properties of coaxial gyrotron cavities with mode converting corrugations",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7393536/",
            "Abstract": "Longitudinally corrugated inserts have been proposed as an additional mean to enhance the selectivity properties of coaxial gyrotron cavities. However, when increasing the frequency and the output power, the corrugated insert may not be sufficient to ensure mode stability. Vane loaded cavities with corrugated inserts seem to have the potential for superior mode selectivity and could be employed to facilitate the development of multimegawatt gyrotrons. In this paper, a numerical code based on the spatial harmonics method is used to study the spectrum rearrangement of a typical coaxial cavity with corrugated insert in which additional wedge-shaped corrugations are introduced on the outer wall. A general design procedure for the upgrade of the mode selectivity is presented. Its merits are demonstrated for a 140-GHz gyrotron cavity.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Calculating the reflection of surface modes from the end of a planar nonsymmetrical waveguide by the method of accelerated iterations",
            "Publication year": 2001,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=14129208",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Improved Diagnostic Device for Magnetron Injection Guns of High-Power Gyrotrons",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8278852/",
            "Abstract": "The quality of the electron beam generated by a magnetron injection gun (MIG) is crucial for the performance of high-power high-frequency gyrotrons. The measurement of the electron properties would be very important for interpreting the experimental results and for improving the design of the gyrotron. Considering the increased power of the electron beam, this is a quite challenging procedure. In this paper, we study a diagnostic device based on the retarding field method for the measurement of the beam properties of an MIG. The influence of several factors on the measurement, such as the relativistic properties of the electrons, the magnetic field compression, and the voltage depression are theoretically and numerically investigated. In addition, the possibility to accurately extrapolate the properties of a high-power electron beam based on low-power beam measurements is studied in detail. In this way, an …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scattering of modes by the end of a diaphragm-loaded planar dielectric waveguide",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1134/S1064226914060138",
            "Abstract": "A planar dielectric waveguide loaded with an infinitely thin perfectly conducting diaphragm is considered. The problem of the guided mode reflection from the end of such a waveguide is analyzed with the help of the integral equation method and the variational method. Dependences of the fundamental mode reflection coefficient on the waveguide parameters and on the dimension of the aperture are calculated.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:rO6llkc54NcC",
            "Publisher": "Pleiades Publishing"
        },
        {
            "Title": "EU DEMO EC system preliminary conceptual design",
            "Publication year": 2017,
            "Publication url": "https://scipub.euro-fusion.org/wp-content/uploads/eurofusion/WPHCDCPR17_17463_submitted-4.pdf",
            "Abstract": "The engineering design and R&D of auxiliary heating systems and their sub-systems is a key activity in the frame of the present conceptual design phase for a first of a kind DEMOnstration Fusion Power Plant in order to develop a system capable of achieving and controlling burning plasmas. In the frame of the EU DEMO reference design, the R&D activities consider the injection of about 50 MW of Electron Cyclotron (EC) power to support and assist different plasma phases. As the project is still in the conceptual phase, a range of options for gyrotrons, transmission lines and antennas is under assessment taking into account the guidelines for the integration of EC system in a nuclear reactor and a maximal achievable reliability and availability of the EC power during operation.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Progress in Stable Operation of High Power Gyrotrons",
            "Publication year": 2011,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814340274_0047",
            "Abstract": "The following sections are included:  Introduction   Experimental Set-up and Measurement System   Experimental Results with Reference Beam Tunnel   Analysis using the Brillouin-Diagram   Experimental Results with Improved Corrugated Beam Tunnel   Conclusions   References  IntroductionExperimental Set-up and Measurement SystemExperimental Results with Reference Beam TunnelAnalysis using the Brillouin-DiagramExperimental Results with Improved Corrugated Beam TunnelConclusionsReferences",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Eigenvalues and ohmic losses in coaxial gyrotron cavity",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1673564/",
            "Abstract": "The authors present the mathematical analysis for the calculation of the dispersion relation, the field distributions, and the ohmic losses for TE m,p  modes in an infinite coaxial waveguide with a longitudinally corrugated insert. The method employed is based on an appropriate eigenfunction expansion, and its main advantage is the very fast convergence with a few spatial harmonics. The analysis is properly extended to include tapered cavities with varying, in respect to the z-coordinate, outer and/or inner radius. Numerical results are presented for several tapered cavity geometries and compared with already published methods",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Review of the European programme for the development of the gyrotron for ITER",
            "Publication year": 2009,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812814647_0058",
            "Abstract": "The EU programme for the development of the gyrotron for ITER, carried out in cooperation between European laboratories and industrial partners, consists of (i) the manufacturing and testing the 2 MW, CW coaxial cavity gyrotron at 170 GHz meeting both technological constraints and ITER specifications. This goal will be conducted in three different steps: 1 s, 60 s and CW; (ii) in parallel, the development and improvement of critical components for the coaxial concept will continue. While the coaxial concept provides substantial advantages in terms of cost and EC power available for the ITER system with respect to the 1 MW cylindrical cavity gyrotron, the development programme entails additional risks due to both the relatively tight schedule and the developments still required. A fall back option consisting in a more traditional 1 MW gyrotron is foreseen in case of major difficulties in the development of the 2 MW …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Axisymmetric waves in re-entrant cavities",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/B:RAQE.0000028578.55830.00",
            "Abstract": "We employ a well-established method to determine the dispersion properties of transverse magnetic and transverse electric waves in re-entrant cavities. We assume that the waveguide structure consists of a large number of identical cavities in order that the Floquet theorem could be applied to describe the electromagnetic field in an empty cylinder. Furthermore, we describe the electromagnetic field in each cavity region by an eigenfunction expansion for standing waves. Inferring boundary conditions leads to a system of two infinite sets of equations, which is solved numerically by truncation. A numerical code has been developed to calculate the dispersion relation and the electromagnetic field components. Numerical results are presented for several waveguide geometries, including the case of the real gyrotron beam-tunnel geometry. A comparison with already established codes is made.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "TM modes in coaxial cavities with inner surface corrugations",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4663140/",
            "Abstract": "We present the mathematical formulation and numerical results for the resonance characteristics of the TM mp  modes in a coaxial cavity with a longitudinally corrugated insert. Based on the spatial harmonics method, the eigenvalues of the transverse plane are calculated, and then, the Vlasov approximation is used to calculate the resonance frequency, diffractive quality factor, and longitudinal field profile of every mode. The numerical results are presented and compared with those found in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "2019 Status and Focus Areas in the Development of an Advanced Gyrotron for EU DEMO",
            "Publication year": 2019,
            "Publication url": "https://publikationen.bibliothek.kit.edu/1000099922",
            "Abstract": "This presentation reports on the 2019 status and focus areas in the development of an advanced gyrotron for the European DEMOnstration Fusion Power Plant (EU DEMO). As specified within the EUROfusion Work Package Heating and Current Drive (WP HCD), the requirements for the gyrotron are as follows: (i) ≥ 2 MW of RF output power at frequencies ≥ 200 GHz; (ii) a total efficiency ≥ 60 %; (iii) the options for multiple-purpose/multi-frequency operation and fast frequency step-tunability within a limited bandwidth of approximately ± 10 GHz. To meet those targets, the R&D activities are organized in five main branches: (1) the experimental verification of the advanced coaxial-cavity gyrotron technology at long pulses; (2) the development of an advanced coaxial-cavity gyrotron that meets the EU DEMO requirements; (3) the fundamental research on multi-stage depressed collectors for enhanced energy recovery …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conceptual design of the EU DEMO EC-system: main developments and R&D achievements",
            "Publication year": 2017,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1741-4326/aa7b15/meta",
            "Abstract": "For the development of a DEMOnstration Fusion Power Plant the design of auxiliary heating systems is a key activity in order to achieve controlled burning plasma. The present heating mix considers electron cyclotron resonance heating (ECRH), neutral beam injection (NBI) and ion cyclotron resonance heating (ICRH) with a target power to the plasma of about 50 MW for each system. The main tasks assigned to the EC system are plasma breakdown and assisted start-up, heating to LH transition and plasma current ramp up to burn, MHD stability control and assistance in plasma current ramp down. The consequent requirements are used for the conceptual design of the EC system, from the RF source to the launcher, with an extensive R&D program focused on relevant technologies to be developed. Gyrotron: the R&D and Advanced Developments on EC RF sources are targeting for gyrotrons operating at 240 GHz …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:KxtntwgDAa4C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A comparative study on the modeling of dynamic after-cavity interaction in gyrotrons",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4919924",
            "Abstract": "There are cases where gyrotron interaction simulations predict dynamic After-Cavity Interaction (ACI). In dynamic ACI, a mode is excited by the electron beam at a dominant frequency in the gyrotron cavity and, at the same time, this mode is also interacting with the beam at a different frequency in the non-linear uptaper after the cavity. In favor of dynamic ACI being a real physical effect, there are some experimental findings that could be attributed to it, as well as some physical rationale indicating the possibility of a mode being resonant with the beam at different frequencies in different regions. However, the interaction codes used in dynamic ACI prediction up to now are based on simplifications that put questions on their capability of correctly simulating this effect. In this work, the shortcomings of the usual simplifications with respect to dynamic ACI modeling, namely, the trajectory approach and the single-frequency …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:a0OBvERweLwC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Parametric study on the effect of the dielectric and geometry properties on the parasitics in gyrotron beam tunnels",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5612591/",
            "Abstract": "Using the numerical code Fishbone, developed to study the parasitic oscillations in gyrotron beam tunnels, a parametric study is performed on the effect of the dielectric material as well as of the slot geometry on the growth rate of the excited parasitic modes.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "High power gyrotron development for advanced fusion devices",
            "Publication year": 2021,
            "Publication url": "https://conferences.iaea.org/event/214/contributions/17576/attachments/9924/13950/Poster_1142_Gantenbein.pdf",
            "Abstract": "This work has been carried out within the framework of the EUROfusion Consortium and has received funding from the Euratom research and training programme 2014-2018 and 2019-2020 under grant agreement No 633053. The views and opinions expressed herein do not necessarily reflect those of the European Commission. Part of the simulations was performed on the EUROfusion High Performance Computer (Marconi-Fusion).",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Azimuthal mode coupling in coaxial waveguides and cavities with longitudinally corrugated insert",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5729835/",
            "Abstract": "Coaxial resonant cavities with longitudinal corrugations on the inner conductor are used in high-frequency high-power gyrotrons as means to reduce the number of possible competing modes. For a sufficiently large number of corrugations, the analytical approach usually treats the surface corrugation as a homogeneous surface impedance to obtain simple formulas for the characteristic equation and field components. These formulas can be introduced to interaction codes in a quite straightforward way. Full-wave approaches that account for the azimuthal periodicity of the structure and consider azimuthal spatial harmonics to describe the field distributions have been also employed, increasing though the complexity of the solution and the effort given in numerical calculations. In this paper, a full-wave code is used in an attempt to identify the way that the azimuthal spatial terms contribute to the reformation of the …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dispersion properties of rectangularly-corrugated waveguide structures by the in-house 3D FDTD code COCHLEA in cylindrical coordinates",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/document/8611529/",
            "Abstract": "An in-house full-wave numerical code COCHLEA based on the Finite Difference in Time Domain (FDTD) method has been developed and used to study the dispersion properties of corrugated waveguide structures. The mathematical formulation of the corresponding electromagnetic problem is presented in detail. Numerical results are derived for axially corrugated waveguides similar to those appeared in gyrotron stacked beam tunnels and are compared with those obtained by the in-house semi-analytical numerical code FISHBONE.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:sSrBHYA8nusC",
            "Publisher": "IET"
        },
        {
            "Title": "Scattering of radio frequency waves by cylindrical filaments with general orientation relative to the magnetic field",
            "Publication year": 2018,
            "Publication url": "https://www.cambridge.org/core/journals/journal-of-plasma-physics/article/scattering-of-radio-frequency-waves-by-cylindrical-filaments-with-general-orientation-relative-to-the-magnetic-field/48A1831BA1E99EA2002E3B16677605B3",
            "Abstract": "Radio frequency (RF) waves are routinely used in tokamak fusion plasmas for plasma heating, current control, as well as in diagnostics. These waves are excited by antenna structures placed near the tokamak’s wall and they have to propagate through a turbulent layer known as the scrape-off layer, before reaching the core plasma (which is their target). This layer exhibits coherent density fluctuations in the form of filaments and blobs. The scattering processes of RF plane waves by a single filament is studied with the assumption that the filament has a cylindrical shape and infinite length. Furthermore, besides the major toroidal component of the externally imposed magnetic field, there is also a small poloidal magnetic field component. Considering also that the cylindrical filament’s axis is not necessarily aligned with the toroidal direction, the total magnetic field is in general neither aligned with the axis of the …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "On the existence of localized states in quantum pillars",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0749603613001742",
            "Abstract": "We have investigated the localization of electrons in quantum pillars, i.e. in nanometric structures in which electrons are confined by 5 sides, but are free to communicate with a bulk substrate of the same material through the 6th side and hence can be considered as open from this side. All nanopillars produced by an etching top-down process conform to this physical model. At first sight, electrons in such structures should have an equal probability of being everywhere, so confinement effects and consequently band-gap changes should not be present. However, experimentally, confinement effects are observed. We show, by a proper effective mass equation analysis of the combined pillars and substrate system, that eigenstates with a high degree of localization exist in the pillars – irrespective of the height of the pillar. Moreover, the eigenenergies of these states are extremely close to the energies of the quantum …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:70eg2SAEIzsC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "The effect of the lossy material on the modes in a smooth metallic dielectric loaded gyrotron beam tunnel",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8873724/",
            "Abstract": "In this work, we have studied the effect of the dielectric material on the properties of the modes in a smooth metallic gyrotron beam tunnel partially filled with a lossy dielectric material. Two kinds of modes have been identified, one located inside the empty region and the other inside the dielectric material. It has been seen that these kinds are not equally affected by the changes in the geometry and dielectric characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dispersion characteristics of TE waves in beam-loaded corrugated waveguides with losses",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4516684/",
            "Abstract": "A universal method based on an eigenfunction expansion and the linearized Vlasov equation is used to study the dispersion relation and the field distributions of TE modes for beam-loaded circumferentially corrugated waveguides at the small-signal regime. The possible interaction regions are studied and the growth rate of the emerging modes is presented for geometries with and without losses. The effect of the losses is examined, whereas the possibility of the evolution of TE modes in a lossy structure like a gyrotron beam tunnel is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "THEORETICAL AND COMPUTATIONAL STUDIES ON THE SCATTERING OF RADIO FREQUENCY WAVES BY FLUCTUATIONS",
            "Publication year": 2018,
            "Publication url": "http://library.psfc.mit.edu/catalog/reports/2010/18ja/18ja041/18ja041_full.pdf",
            "Abstract": "The practical and economic viability of tokamak fusion reactors depends, in a significant way, on the efficiency of radio frequency (RF) waves to deliver energy and momentum to the plasma in the core of the reactor. Among the various attributes of RF waves is their ability to heat magnetically confined plasmas, induce plasma currents in an effort to achieve steady state, and modify the current profile so as to control plasma instabilities like the neoclassical tearing modes. The RF electromagnetic waves, excited by antenna structures placed near the wall of a tokamak, have to propagate through the turbulent plasma in the scrape-off layer (SOL) along their path to the core plasma. While the propagation and damping of RF waves in the core is reasonably well understood, the same is not true for RF propagation through the SOL. In present day fusion devices, the radial width of the SOL is of the order of a few centimeters. In ITER and in future fusion reactors this width will be of the order of tens of centimeters. Any deleterious effects on RF waves due to plasma turbulence in the SOL has to be properly understood in order to optimize the delivery of RF energy and momentum into the core. This paper is on a multi-pronged approach that is being pursued to quantify the effect of SOL plasma on RF waves. The SOL is composed of coherent filamentary, or blob like, structures and incoherent fluctuations. For coherent structures a full-wave theoretical model has been developed. This model is used to benchmark computational codes that are subsequently used to study general distribution of filaments, thereby extending the range of the theoretical formulation …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The impact of fluctuations on the propagation of radio frequency waves",
            "Publication year": 2018,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2018APS..DPPB11079R/abstract",
            "Abstract": "In fusion devices, radio frequency (RF) electromagnetic waves encounter turbulent plasmas in the edge region as they propagate from the excitation structures to the core of the device. In order to optimize heating and current drive by RF waves, it is necessary to understand the effect of turbulence on the propagation characteristics of the waves. A common approach towards quantifying the effects of turbulence on RF waves is the Kirchhoff technique. The wave fields and their normal derivatives are evaluated at a surface, separating two different densities, using physical optics. The fields at any point on this surface are approximated to be the same as the fields on a tangent plane at that point. The results from this theoretical analysis are compared with full-wave numerical simulations. A complementary set of studies is to construct the effective permittivity of turbulent plasmas that are a mix of coherent (blobs and …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Operations with spherical calorimetric loads in different configurations at gyrotron test stands at EPFL and QST",
            "Publication year": 2020,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/5.0013651",
            "Abstract": "A research activity in the Institute for Plasma Science and Technology of National Research Council (ISTP-CNR, Italy, former IFP-CNR) and in L.T. Calcoli (LTC, Italy) is aimed at the design and construction of calorimetric loads for absorption and measurement of high power millimeter-waves in the electron cyclotron frequency range. Recently, two CW 170 GHz loads, one for the European ITER gyrotron test facility and the other for the FALCON test- bed, have been installed at the Swiss Plasma Center (SPC, Switzerland). One short pulse (2 s) load for 1 MW, designed and optimised to operate at two different frequencies (84 GHz and 126 GHz), was provided for testing and conditioning two new dual-frequency gyrotrons for the Tokamak à Configuration Variable (TCV, Switzerland). Two additional CW loads, designed for absorbing powers higher than 1 MW, have been delivered to the National Institutes for …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:PELIpwtuRlgC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Calculation of radiation modes by the Lanczos–Fourier expansion",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-21-9-1740",
            "Abstract": "For construction of the TE radiation modes of planar waveguides several methods are employed that are based on collocation techniques. The field representation in the core is based on the Lanczos–Fourier sinusoidal series. The numerical codes are very simple and give accurate results. The validity of these methods is checked for constant refractive-index profiles, while numerical results are also given for parabolic profiles. Furthermore, the validity of the orthogonality condition between the guided and the radiation modes is checked. These methods are demonstrated to be effective and can also be employed to study the TM case and waveguides of lossy media, as well as anisotropic and chiral structures.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:Se3iqnhoufwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Status and experimental results of the European 1 MW, 170 GHz industrial CW prototype gyrotron for ITER",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7758398/",
            "Abstract": "In the frame of a collaborative effort between the European GYrotron Consortium (EGYC), the European domestic agency Fusion for Energy (F4E) and the Industrial partner Thales Electron Devices (TED), the first continuous wave (CW) prototype of the EU gyrotron for the ITER Electron Cyclotron Heating system has been manufactured by TED and delivered to the Karlsruhe Institute of Technology (KIT) by end of 2015, where it will be tested up to pulse lengths of 180 s before being studied up to CW operation at Swiss Plasma Center (SPC, formerly CRPP) in Lausanne. The experimental campaign started early 2016. So far, the tube has been operated in ms pulses, allowing a detailed characterization and an extensive parametric study. It has been shown that the tube operates stably in the design mode up to the MW level and that the output beam profile has a high Gaussian content, compliant with the ITER …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Ieee"
        },
        {
            "Title": "Experimental results and recent developments on the EU 2 MW 170 GHz coaxial cavity gyrotron for ITER",
            "Publication year": 2012,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2012/14/epjconf_ec2012_04009/epjconf_ec2012_04009.html",
            "Abstract": "The European Gyrotron Consortium (EGYC) is responsible for developing one set of 170 GHz mm-wave sources, in support of Europe’s contribution to ITER. The original plan of targeting a 2 MW coaxial gyrotron is currently under discussion, in view of essential delays and damages. This paper reports on the latest results and plans with regard to the two 2 MW gyrotron prototypes, the industrial prototype at CRPP’s CW test stand and a modular pre-prototype at KIT. The industrial prototype was delivered to CRPP end of September 2011 and reached an output power of 2 MW at an efficiency of 45 % and with good RF beam pattern, in only four days of short pulse RF test. These results validated all design changes made in reaction to the results of the experiments in 2008. On the fifth experimental day, an internal absorber broke, terminating any further experiment with this tube. In parallel, design and experimental …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:R3hNpaxXUhUC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Overview of recent gyrotron R&D towards DEMO within EUROfusion work package heating and current drive",
            "Publication year": 2019,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1741-4326/ab12f9/meta",
            "Abstract": "Gyrotron R&D within the EUROfusion Work Package Heating and Current Drive (WPHCD) is addressing the challenging requirements posed on gyrotrons by the European concept for a demonstration fusion power plant (EU DEMO). These requirements, as specified within WPHCD, ask for highly reliable and robust long-pulse operation of the gyrotron, delivering 2 MW of microwave power at frequencies above 200 GHz with a high overall efficiency above 60% and the option for fast frequency step-tunability. To meet these targets, which are clearly beyond today's state-of-the-art, the R&D activities within WPHCD are organized in five main branches: these are the experimental verification of the advanced coaxial gyrotron technology at long pulses, the development of a coaxial gyrotron meeting the EU DEMO requirements, the development of multi-stage depressed collectors for enhanced energy recovery, the …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:J-pR_7NvFogC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Investigation of Cylindrical Waveguides with Periodic Wedge-Shaped Azimuthal Corrugations Excited by TE Modes Using the FDTD Method",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10762-021-00809-3",
            "Abstract": "Modern gyrotron beam tunnels are rather complicated structures designed to enhance the suppression of the parasitic oscillations, which may be excited there. In some beam tunnel designs, azimuthal corrugations are engraved on their walls to further improve the suppression of these oscillations. In this work, we investigate the effect of the geometrical properties of the corrugations on the propagation characteristics of TE modes for the simplified model of a smooth waveguide with an azimuthally corrugated region. For this structure, the scattering parameters are calculated and the mode conversion is investigated with the in-house FDTD code COCHLEA.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:WqliGbK-hY8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "EU DEMO EC Equatorial Launcher Pre-Conceptual Performance Studies",
            "Publication year": 2019,
            "Publication url": "https://pure.mpg.de/pubman/faces/ViewItemOverviewPage.jsp?itemId=item_3165901",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RF beam scattering by cylindrical filaments and interfacial density fluctuations",
            "Publication year": 2018,
            "Publication url": "http://library.psfc.mit.edu/catalog/reports/2010/18ja/18ja053/18ja053_full.pdf",
            "Abstract": "Radio Frequency (RF) waves are routinely used in tokamaks for heating, current drive, NTM control, as well as for diagnostics purposes. Frequently, RF waves, aiming towards the plasma core, propagate through a turbulent environment. The latter can exhibit strong coherent density fluctuations as well as filamentary structures mainly (though, not perfectly) aligned along the local magnetic field lines. The scattering process of RF waves by these structures is studied both analytically and numerically. RF waves can be either single plane waves or spatially confined beams. For that purpose, the filaments are considered to have cylindrical shape with infinite length with the cylinder axis not aligned with the local magnetic field and the results are compared to the ones from the study of the aligned case [1, 2]. On the other hand, the interfacial density fluctuations are considered periodic with spatial periods larger, smaller or of the same order of the wavelength of the incident RF waves. The frequency range of the RF waves studied is mainly in the Electron Cyclotron (EC) range of frequencies for ITER-like and Medium Size Tokamak applications. Furthermore, the study covers a variety of density contrasts, filament sizes and fluctuation strengths.(a) Main assumptions and the geometry",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational studies on the suppression of parasitic oscillations in gyrotron beam tunnels",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8374087/",
            "Abstract": "Parasitic oscillations frequently appear in several modern gyrotron beam tunnels. In this paper, the CST Studio Suite is used to study the performance of dielectric-loaded beam tunnel designs in attenuating the spurious modes. Two common designs are considered and the effect of the ceramic material's dielectric constant on the beam tunnel's performance is studied. For this purpose, the ohmic quality factor Q ohm  and the normalized shunt impedance R/Q are calculated to measure this performance. These studies focus on the backward propagating axisymmetric parasitic modes.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dispersion characteristics of arbitrary periodic structures with rectangular grooves",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s10762-008-9338-9",
            "Abstract": "The dispersion characteristics of a circular cylindrical waveguide with periodic surface corrugations consisting of rectangular grooves with smoothing are examined using the Space Harmonic Method (SHM). The whole structure is divided into two regions, one describing the propagation volume and one inside the grooves. In the first region, the Floquet theorem is applicable and the field distribution is expressed as a summation of spatial Bloch components, whereas in the second one an appropriate Fourier expansion of standing waves is used. Applying the boundary conditions an infinite system of equations is obtained, which is solved numerically by truncation. Several cases are considered, including the limiting cases of a sinusoidal and a rectangular corrugation profile, to check the accuracy of the method proposed as well as its dependence on the corrugation profile. Numerical results are presented …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:4TOpqqG69KYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Report of recent experiments with the European 1 MW, 170 GHz CW and SP prototype gyrotrons for ITER",
            "Publication year": 2019,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2019/08/epjconf_ec2018_04006/epjconf_ec2018_04006.html",
            "Abstract": "The European 1 MW, 170 GHz industrial CW prototype gyrotron has been designed within EGYC (European GYrotron Consortium) in collaboration with the industrial partner Thales Electron Devices (TED) and under the coordination of Fusion for Energy (F4E). This is a conventional (hollow) cavity gyrotron that is based on the 1 MW, 170 GHz short-pulse (SP) modular gyrotron, which has been designed and manufactured by KIT in collaboration with TED. The SP prototype has been tested in multiple experimental campaigns since 2015 and the nominal cavity mode TE32,9 is exited at 170.1 GHz, producing RF power above 1 MW with 35 % interaction efficiency. The first phase of the experiments with the CW industrial gyrotron was successfully completed at KIT in 2016, verifying most of the ITER specifications. Short pulses (<10ms) deliver RF power higher than 0.9 MW with a total efficiency of 26 % (in non …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:1qzjygNMrQYC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Wideband continuous frequency tunable coaxial gyrotron oscillators",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4516639/",
            "Abstract": "We present the design of two continuous tunable CW coaxial cavity gyrotron oscillators, one of 330 GHz - 200 W with a bandwidth of 3 GHz for scientific applications and one of 30 GHz-150 kW with a bandwidth 0.4 GHz for industrial applications. The tuning of both gyrotrons is achieved by moving the tapered inner conductor in the axial direction and by adjusting the operating magnetic field.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design considerations for future DEMO gyrotrons: A review on related gyrotron activities within EUROfusion",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920379617300686",
            "Abstract": "Long-term options for a steady-state DEMOnstration power plant may require the availability of gyrotrons with an operating frequency significantly above 200 GHz together with an RF output power of more than 1 MW and a total gyrotron efficiency of better than 60%. Frequency tuning in steps of around 2–3 GHz might be needed for control of plasma stability. Multi-purpose operation at frequencies with leaps of about 30 GHz might be considered for plasma start-up, heating and current drive at different operation scenarios. The combination of those requirements clearly challenges present-day technological limits. The R&D work within the EUROfusion WP HCD EC Gyrotron R&D and Advanced Developments is focusing on named targets. In particular, a centre frequency of around 240 GHz is under investigation. The coaxial-cavity gyrotron technology, and, as a possible fallback solution, the conventional hollow …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:UxriW0iASnsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Reflectivity of buried slab waveguides",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-21-10-2009",
            "Abstract": "The scattering properties of an abruptly ended buried slab waveguide for both TE and TM modes are examined by an improved iteration technique that is based on the integral equation method with “accelerating” parameters. The waveguide is considered a symmetrical slab, for which the weakly guiding conditions are invalid, and it is embedded in a different dielectric material. The tangential electric field distribution on the terminal plane, the reflection coefficient of the first TE and TM guided modes, and the far-field radiation pattern are computed. Numerical results are presented for several ended waveguides, while special attention is given to the far-field radiation pattern rotation and the terminal field distributions.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Numerical simulation of parasitic gyro-BWO interaction in a gyrotron beam tunnel",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6104925/",
            "Abstract": "A numerical study of unwanted oscillations occurring due to interaction of the annular helical electron beam with azimuthally symmetric TE 0,n  modes in the absorbing section of a gyrotron is performed using the BOR FDTD - particle-in-cell (PIC) code newly developed at IHM. Strong dependence of the appearance of the parasitic interaction and its amplitude on the spread of the pitch factor of quasi particles is observed.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Study of parasitic oscillations in gyrotron beam tunnels",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7758501/",
            "Abstract": "The possible parasitic oscillations, which frequently appear in several modern gyrotron beam tunnels, are identified and studied using the commercial simulation package CST Studio Suite. This study is based on the calculation of the Ohmic quality factor and the normalized shunt impedance R/Q and focuses on the backward propagating axisymmetric TE modes.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scattering of radio frequency waves by density fluctuations",
            "Publication year": 2015,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2015APS..DPPN12061R/abstract",
            "Abstract": "The scattering of radio frequency waves by density fluctuations in magnetized fusion plasmas is studied theoretically and computationally. For coherent fluctuations, such as filaments in the edge region, we use a full-wave model for which the theory is similar to that for Mie scattering of electromagnetic waves by dielectric objects. The filaments are considered to be cylindrical with their axes aligned along the magnetic field. The results from the theoretical model are compared with numerical simulations using COMSOL. The simulations are extended to plasma conditions that are beyond the scope of the theoretical model, eg, multiple filaments and filaments with density gradients. For incoherent planar fluctuations, which can be either in the core of the plasma or in the edge region, our theory is based on the Kirchhoff approach in tandem with Huygen's principle. The coherent and incoherent fluctuations scatter the …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parametric study of a coaxial gyrotron stacked beam tunnel",
            "Publication year": 2010,
            "Publication url": "http://moag.phys.uoa.gr/moag_en/posters/ICOPS2012b.pdf",
            "Abstract": "ConclusionThe azimuthal symmetric TE modes (waveguide modes of the corresponding smooth structure) are the most dangerous source of parasitic oscillations, while the ΤΜ modes are adequately attenuated. Moreover, for TE modes further modification of the geometry does not strongly affect the excitation of the parasitic modes. The effect of the losses reaches a saturation level, while the beam radial position in combination with the structure mode field determines whether a parasitic mode will be excited or not.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Metal iris influence on guided-mode diffraction",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-23-6-1333",
            "Abstract": "The effects of the presence of metal irises on guided-mode propagation through a symmetrical three-layer slab waveguide are examined by using the integral equation method. The aperture electric field distribution is expressed in terms of a finite series of Chebyshev polynomials. The modal reflection and transmission coefficients, the near-field structure, and the far-field radiation pattern are calculated, while numerical results are presented for several iris apertures.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Open-ended coaxial cavities with corrugated inner and outer walls",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10762-015-0152-x?sa_campaign=email/event/articleAuthor/onlineFirst&error=cookies_not_supported&code=67c3115c-33e7-49b5-b0cd-790aa5df6415",
            "Abstract": "In this work an open-ended coaxial cavity with a corrugated insert and a relatively small number of corrugations on the outer wall is studied. In particular, the Spatial Harmonics Method (SHM) is employed in order to derive the TE modes characteristic equation, which is then solved by truncation for the calculation of the corresponding eigenvalues. Special care is given in the expansion functions used in order to avoid numerical instabilities in the calculation of high-order spatial terms. Various cases of outer wall corrugations are studied numerically in order to identify the effect of the outer corrugations and understand the mode coupling mechanism.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "The EC-system of EU DEMO: concepts for a reactor heating system",
            "Publication year": 2017,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/pdf/2017/18/epjconf_smp2017_03003.pdf",
            "Abstract": "In the frame of the project for a European DEMOnstration Fusion Power Plant (FPP), the design of the auxiliary heating systems is one of the keys to heat and control the burning plasma (ie a plasma in reactor producing electricity to the grid from fusion reactions). The heating mix considered in EU DEMO bases on Electron Cyclotron Resonance Heating and Current Drive (ECRH&CD), Neutral Beam Injection (NBI) and Ion Cyclotron Resonance Heating (ICRH). In this first phase of the design process (called Pre-Conceptual phase) each system is under study with 50 MW as a reference power to the plasma [1]. The main tasks assigned to the EC system are reported in the Table 1, assuming the full use of the 50 MW:",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Guided-mode analysis by the Lanczos–Fourier expansion",
            "Publication year": 2002,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-19-11-2293",
            "Abstract": "The Lanczos–Fourier series expansion is employed to analyze the guided-mode field in an asymmetrical slab waveguide, the core of which has an anisotropic and inhomogeneous dielectric permittivity. A system of linear homogeneous equations is derived by the collocation technique with consideration of the wave equation and the appropriate boundary conditions at the interfaces between the core and cladding media. The propagation constants are found from a determinant equation that ensures the existence of a nontrivial solution of the system. Numerical results are presented for several cases of dielectric permittivity, including the constant, parabolic, linear, and anisotropic cases. This approach is found to converge reasonably fast, and Richardson’s extrapolation technique is applied to accelerate the convergence further. The approach can be easily generalized from the scalar to the vector equation, and, as …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Electrodynamics and Wave Propagation-Calculating the Reflection of Surface Modes from the End of a Planar Nonsymmetrical Waveguide by the Method of Accelerated Iterations",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=10839527589826221688&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Silver Spring, Md.: Scripta Technica, Inc., c1993-"
        },
        {
            "Title": "Experimental investigations and analysis of parasitic RF oscillations in high-power gyrotrons",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5439699/",
            "Abstract": "Megawatt gyrotrons are found to suffer from various parasitic oscillations, in particular, RF oscillations in the beam tunnel prior to the desired interaction zone (the cavity). This paper describes the experimental results from a gyrotron experiment which was dedicated to investigate parasitic oscillations in the beam tunnel and to verify improved beam-tunnel structures. A system for improved spectral measurements and a new analysis method are presented. The results verify theoretical predictions on the parasitic oscillations, and in effect validate the corresponding improved beam-tunnel structure. In addition, other types of parasitic oscillations were observed and explained.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Progress on the development of the EU-1 MW gyrotron for ITER",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7012314/",
            "Abstract": "Summary form only given. EU is presently developing a 1 MW, 170 GHz cylindrical cavity gyrotron for ITER. This activity was initiated in 2008 as a risk mitigation measure in parallel with the development of a 2 MW coaxial-cavity gyrotron, and in 2012 became the main line. In the previous year, the scientific designs of the 1 MW gyrotron components, such as the electron gun, beam tunnel, cavity, quasi-optical output coupler and single-stage depressed collector have been finalized. In addition, in collaboration with the European industrial partner Thales Electron Devices (TED), after completion of the industrial design of the technological parts of the gyrotron, the procurement and manufacturing of subassemblies for a 1 MW CW prototype will start in 2014. Its specifications correspond to the ITER requirements.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental results of the EU ITER prototype gyrotrons",
            "Publication year": 2017,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2017/26/epjconf_rfppc2017_03016/epjconf_rfppc2017_03016.html",
            "Abstract": "The European 1 MW, 170 GHz CW industrial prototype gyrotron for ECRH&CD on ITER was under test at the KIT test facility during 2016. In order to optimize the gyrotron operation, the tube was thoroughly tested in the short-pulse regime, with pulse lengths below 10 ms, for a wide range of operational parameters. The operation was extended to longer pulses with a duration of up to 180 s. In this work we present in detail the achievements and the challenges that were faced during the long-pulse experimental campaign.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:Tiz5es2fbqcC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Progress in the Development of a 1.5 MW, 140 GHz Gyrotron for the Upgrade of the ECRH System at W7-X",
            "Publication year": 2019,
            "Publication url": "https://publikationen.bibliothek.kit.edu/1000097205",
            "Abstract": "Following the outstanding results from the first experimental period (OP1) of the stellarator Wendelstein 7-X [1-6], and in view of the second experimental period (OP2; planned to begin in 2021), an upgrade of the Electron Cyclotron Resonance Heating (ECRH) installation is underway. A major target of the upgrade is to increase the installed microwave power. To this end, a prototype Continuous-Wave (CW) 1.5 MW, 140 GHz gyrotron is under development, which is planned to be followed by two additional series tubes. In order to keep the risk and cost of the development as low as possible, the design of the 1.5 MW gyrotron is regarded as an upgrade of the successful design of the existing 1 MW, 140 GHz gyrotrons at W7-X [7]. The scientific design of the 1.5 MW tube has been realized by KIT with contributions from IPP and NKUA. The design will be provided to the industrial partner, in order to fully develop and …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TE waves in arbitrary periodic slow-wave structures with rectangular grooves",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10762-009-9532-4.pdf",
            "Abstract": "The dispersion characteristics of the transverse electric modes in a waveguide with circular cross-section and periodic rectangular surface corrugations with smoothed edges are examined by the space harmonic method. The whole structure is divided into two regions, one in the propagation area and one inside the grooves. In the first region, the Floquet theorem is applied and the field distribution is expressed as a summation of spatial Bloch components, while an appropriate Fourier expansion of standing waves is used inside the grooves. Applying the appropriate interface conditions, an infinite system of equations is obtained, which is solved numerically by truncation. Numerical results are presented for several cases to check the convergence and the accuracy of the method, as well as its dependence on the corrugation profile. This formalism could be easily expanded to include all kind of waves that can …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Design of the EU-1MW gyrotron for ITER",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6571106/",
            "Abstract": "EU is developing a 1 MW cylindrical cavity gyrotron. In the last year the design of the components of the new gyrotron has been finalized while the technological design of the new tube has been defined. In the present paper, the main characteristics of the new EU gyrotron for ITER are presented.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "First cw experiments with the EU ITER 1 MW, 170 GHz industrial prototype gyrotron",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8289742/",
            "Abstract": "The EU 1 MW, 170 GHz gyrotron for ECH&CD on ITER has been developed by EGYC (European GYrotron Consortium) under the coordination of Fusion for Energy (F4E) and in cooperation with the industrial partner Thales Electron Devices (TED). The manufacturing of the first industrial continuous-wave (CW) prototype gyrotron, has been completed in November 2015 at TED. The tube was delivered to KIT and the experimental verification started in February 2016 in the short-pulse (SP) regime. Since October 2016 the gyrotron is in CW operation. In this work, details regarding the experiments at the KIT test-stand with pulses up to 180 s are presented.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dispersion characteristics of hybrid waves in beam-loaded corrugated waveguides with losses",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4591046/",
            "Abstract": "This paper investigates a universal method based on an eigenfunction expansion and the linearized Vlasov equation which is used to study the dispersion relation and the field distributions of asymmetric (hybrid) modes for beam-loaded corrugated waveguides. The possible interaction regions are studied and the growth rate of the emerging modes is presented for various geometries with and without losses. The effect of the beam parameters, as well as of the losses is examined, whereas the possibility of the development of hybrid parasitic modes in gyrotron beam tunnel is studied.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Calculations on the beam–wave interactions in coaxial gyrotron beam tunnels",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5447649/",
            "Abstract": "We present the mathematical formulation and numerical results for the beam-wave interaction in a coaxial waveguide with rectangular slots filled with a lossy dielectric material. The formalism is based on a full-wave analysis and the linearized Vlasov equation. Numerical results are given for all kinds of modes in simplified gyrotron beam tunnels, and the effect of the losses to the parasitic oscillations is examined and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sensitivity analysis of a 140-GHz coaxial gyrotron cavity with corrugations on the inner and outer walls",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7758522/",
            "Abstract": "Coaxial cavities with corrugated inserts and additional corrugations on the outer wall seem to have the potential for superior mode-selectivity and could be used to facilitate the development of multi-MW gyrotrons. This concept is used in this work to upgrade the design of an already manufactured 140-GHz coaxial gyrotron. A detailed sensitivity parametric study is performed to ensure mode stability. All calculations have been performed with a full-wave numerical code based on the Spatial Harmonics Method.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Radiation properties of a semi-infinite slab waveguide for the case of odd transverse electric guided waves",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/027263402753427637",
            "Abstract": "We examine the radiation properties of an abruptly ended symmetric slab waveguide for the case of transverse electric (TE) guided modes with odd symmetry of the electric-field distribution by employing the integral equation method. This method converges very fast, especially in the case of small relative difference j 12 between the refractive indices of the core and cladding regions of the slab waveguide. The electric-field distribution at the terminal plane, the reflection coefficient of the first odd TE guided mode, and the far-field radiation pattern are computed. We present numerical results for several cases of abruptly ended waveguides and we examine the influence of the value of j 12 on the guided-mode reflectivity, on the electric-field distribution at the terminal plane, as well as on the angle of the maximum value (elevation angle) and on the beamwidth of the far-field radiation pattern.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Informa UK Ltd"
        },
        {
            "Title": "Analysis of mode scattering from an abruptly ended dielectric slab waveguide by an accelerated iteration technique",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-17-12-2249",
            "Abstract": "A new modification of the integral equation method using an iteration technique with “accelerating” parameters is presented to solve the problem of guided-mode scattering from an abruptly ended asymmetrical slab waveguide. The optimal choice of the parameters is shown to be closely connected with the variational principle. The electric-field distribution at the terminal plane, the reflection coefficient of the guided mode, and the far-field radiation pattern are computed. Numerical results are presented for several cases of abruptly ended waveguides, including the systems with constant and variable profiles of the refractive indices. The phenomenon of the radiation pattern rotation is examined in detail.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Towards Advanced Fusion Gyrotrons: 2018 Update on Activities within EUROfusion",
            "Publication year": 2019,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2019/08/epjconf_ec2018_04007/epjconf_ec2018_04007.html",
            "Abstract": "During the ongoing pre-concept phase (2014 – 2020) for a possible future European DEMOnstration Fusion Power Plant (DEMO) the activities within EUROfusion WP HCD EC Gyrotron R&D and Advanced Developments are focusing on options for near-term solutions, and, at the same time, on long-term even more advanced options. The near-term target for DEMO is to realize pulsed operation. According to the current baseline it will probably use an EC system operating at 170 GHz and 204 GHz is being assessed, whereas the long-term target aims for steady-state operation and frequencies for current drive up to 240 GHz. Common targets for both are an RF output power per unit of significantly above 1 MW (target: 2 MW) and a total gyrotron efficiency of significantly higher than 60 %. Frequency step-tunability and multi-purpose/multi-frequency operation have to be considered. Those targets shall be achieved by …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Computational studies on scattering of radio frequency waves by density filaments in fusion plasmas",
            "Publication year": 2017,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4992032",
            "Abstract": "In modern magnetic fusion devices, such as tokamaks and stellarators, radio frequency (RF) waves are commonly used for plasma heating and current profile control, as well as for certain diagnostics. The frequencies of the RF waves range from ion cyclotron frequency to the electron cyclotron frequency. The RF waves are launched from structures, like waveguides and current straps, placed near the wall in a very low density, tenuous plasma region of a fusion device. The RF electromagnetic fields have to propagate through this scrape-off layer before coupling power to the core of the plasma. The scrape-off layer is characterized by turbulent plasmas fluctuations and by blobs and filaments. The variations in the edge density due to these fluctuations and filaments can affect the propagation characteristics of the RF waves—changes in density leading to regions with differing plasma permittivity. Analytical full-wave …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:XiSMed-E-HIC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Scattering of radio frequency waves by plasma turbulence",
            "Publication year": 2019,
            "Publication url": "http://ocs.ciemat.es/EPS2019PAP/pdf/P2.1087.pdf",
            "Abstract": "Kirchhoff tangent plane approximation The theoretical model we use for studying the scattering of electromagnetic waves from turbulent plasma is based on the Kirchhoff approximation that is commonly used to study the scattering of waves from rough surfaces [1, 2]. The basis of the Kirchhoff approximation, also",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:wbdj-CoPYUoC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "The European 2 MW Gyrotron for Iter",
            "Publication year": 2011,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814340274_0045",
            "Abstract": "Europe is developing a gyrotron capable of delivering 2 MW RF power at 170 GHz in continuous operation (CW) for the ITER EC H&CD system. This paper discusses the advantages and risks of the 2 MW project, the status of the development, and the expected results from the tests planned to start during the 2nd half of 2010 on the industrial gyrotron prototype, which will provide essential elements for the decision between the 2 MW (coaxial cavity) and 1 MW (cylindrical cavity) gyrotron option placed along the track of the European project plan.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The development of the European 1 MW, 170 GHz CW gyrotron for the ITER electron cyclotron heating system",
            "Publication year": 2018,
            "Publication url": "https://inis.iaea.org/search/search.aspx?orig_q=RN:50008572",
            "Abstract": "[en] Full text: The EU gyrotron for the ITER electron cyclotron heating system has been developed in coordinated efforts from several EU institutions (organized in the EGYC European Gyrotron Consortium, TED and F4E) and under the supervision of ITER Organization central team. The design of the ITER gyrotron is based on the EU expertise in the series production of high power and long pulse gyrotrons for the W7-X stellarator, and incorporates key improvements recently validated to enhance the quality of the electron beam at the cavity and the output RF beam at the window. Following a risk-reducing staged approach, the design was first verified in 2015 with tests on a short pulse prototype, showing> 1 MW of output RF power at the right frequency (∼ 170.1 GHz) in stable and reproducible conditions. The electronic efficiency (∼ 35%) obtained with the short pulse gyrotron was consistent with an∼ 50% output efficiency in voltage depression and in a CW electrostatic configuration. No parasitic oscillations were observed and a high quality of the output RF beam was measured (TEM 00∼ 98%). A CW gyrotron prototype was then produced with the same design of the internal RF and electronic components. The CW prototype was delivered in November 2015 to the KIT gyrotron test facility, where it will be tested in 2016. This paper presents the main experimental results from the main prototyping and qualification activities aiming to demonstrate compliance with the ITER specifications and reduce the technical risks during the series production phase.(author)",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dependence of parasitic modes on geometry and attenuation in gyrotron beam tunnels",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6179552/",
            "Abstract": "Recent high-power gyrotrons, capable of producing radio-frequency power above 1 MW, often suffer from parasitic oscillations in the beam tunnel, despite the presence of dielectric loading materials intended to prevent the growth of such modes. Such oscillations affect the operation and the efficiency of these devices significantly. Lately, a variety of dielectric materials have been used, with limited success, in ring-loaded beam tunnels to suppress unwanted oscillations. In this paper, we perform an extended parametric study of the effects of beam-tunnel geometry and lossy material properties on the damping of such oscillations.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Propagation of radio frequency waves through density fluctuations",
            "Publication year": 2017,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2017APS..DPPT11056V/abstract",
            "Abstract": "On their way to the core of a tokamak plasma, radio frequency (RF) waves, excited in the vacuum region, have to propagate through a variety of density fluctuations in the edge region. These fluctuations include coherent structures, like blobs that can be field aligned or not, as well as turbulent and filamentary structures. We have been studying the effect of fluctuations on RF propagation using both theoretical (analytical) and computational models. The theoretical results are being compared with those obtained by two different numerical codes``a Finite Difference Frequency Domain code and the commercial COMSOL package. For plasmas with arbitrary distribution of coherent and turbulent fluctuations, we have formulated an effective dielectric permittivity of the edge plasma. This permittivity tensor is then used in numerical simulations to study the effect of multi-scale turbulence on RF waves. We not only consider …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SPECIAL ISSUE PAPERS-Microfabrication Techniques, Components, and Supporting Technology-Calculation of the Electromagnetic Waves in Nonperiodic Corrugated Waveguides With Dielectric Loading",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=16150926390514526465&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:NaGl4SEjCO4C",
            "Publisher": "New York: Institute of Electrical and Electronics Engineers, c1973-"
        },
        {
            "Title": "Metal iris influence on guided-mode diffraction: errata",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-24-6-1808",
            "Abstract": "We correct some errors in math notation in our previous paper [J. Opt. Soc. Am. A23, 1333 (2006)].",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:blknAaTinKkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Beam–wave interaction in corrugated structures in the small-signal regime",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5272422/",
            "Abstract": "A method based on an eigenfunction expansion and the linearized Vlasov equation to study the beam-wave interaction in cylindrical surface corrugated waveguides with losses is presented. The mathematical formulation is described in detail, and numerical results are given in comparison with the literature.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dispersion characteristics of beam-loaded corrugated waveguides",
            "Publication year": 2006,
            "Publication url": "http://heliotopos.conferences.gr/fileadmin/dtemplates/ec14/pdf/Presentations/7_Latsas_G_P.pdf",
            "Abstract": "DISPERSION CHARACTERISTICS OF BEAM-LOADED CORRUGATED WAVEGUIDES Page 1 \nNATIONAL KAPODISTRIAN UNIVERSITY OF ATHENS PHYSICS DEPARTMENT ELECTRONICS \nLABORATORY DISPERSION CHARACTERISTICS OF BEAM-LOADED CORRUGATED \nWAVEGUIDES GP Latsas1, M. Dehler2, JL Vomvoridis3, IG Tigelis1, G. Alexakis1 1 University \nof Athens, Department of Physics, Applied Physics Division, Electronics Laboratory, Building \nV, Zografou, 157 84 Athens, Greece 2 Paul Scherrer Institut (PSI), CH-5232 Villigen, \nSwitzerland 3 National Technical University of Athens, Department of Electrical and Computer \nEngineering, Electroscience Division, 9 Iroon Polytechniou Str. Zografou, 15773 Athens, \nGreece EC-14 SANTORINI, 9-12 MAY 2006 Page 2 NATIONAL KAPODISTRIAN UNIVERSITY \nOF ATHENS PHYSICS DEPARTMENT ELECTRONICS LABORATORY EC-14 SANTORINI, -…",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Status of Europe’s contribution to the ITER EC system",
            "Publication year": 2015,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2015/06/epjconf_ec2015_04004/epjconf_ec2015_04004.html",
            "Abstract": "The electron cyclotron (EC) system of ITER for the initial configuration is designed to provide 20MW of RF power into the plasma during 3600s and a duty cycle of up to 25% for heating and (co and counter) non-inductive current drive, also used to control the MHD plasma instabilities. The EC system is being procured by 5 domestic agencies plus the ITER Organization (IO). F4E has the largest fraction of the EC procurements, which includes 8 high voltage power supplies (HVPS), 6 gyrotrons, the ex-vessel waveguides (includes isolation valves and diamond windows) for all launchers, 4 upper launchers and the main control system. F4E is working with IO to improve the overall design of the EC system by integrating consolidated technological advances, simplifying the interfaces, and doing global engineering analysis and assessments of EC heating and current drive physics and technology capabilities. Examples …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "“The European Joint Undertaking for ITER and the Development of Fusion Energy, C/Josep Pla 2, 08019 Barcelona",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=-0VkDQAAQBAJ&oi=fnd&pg=PA415&dq=info:TrRPk8iHZroJ:scholar.google.com&ots=9W_oLhga57&sig=A2iNru32Frdg-puvVGsmBO7xKhw",
            "Abstract": "The EU programme for the development of the gyrotron for ITER, carried out in cooperation between European laboratories and industrial partners, consists of (i) the manufacturing and testing the 2 MW, CW coaxial cavity gyrotron at 170 GHz meeting both technological constraints and ITER specifications. This goal will be conducted in three different steps: 1 s, 60 s and CW;(ii) in parallel, the development and improvement of critical components for the coaxial concept will continue. While the coaxial concept provides substantial advantages in terms of cost and EC power available for the ITER system with respect to the 1 MW cylindrical cavity gyrotron, the development programme entails additional risks due to both the relatively tight schedule and the developments still required. A fall back option consisting in a more traditional 1 MW gyrotron is foreseen in case of major difficulties in the development of the 2 MW coaxial cavity gyrotron. This alternative development is expected to benefit from the successful development of the 140 GHz gyrotron for W7-X;(iii) a Test Facility for testing at high power, CW the prototype gyrotrons and other EC H&CD system components has been established at the CRPP, in Lausanne. The tests with the first prototype of coaxial gyrotron are currently progressing. A decision point between the coaxial and cylindrical cavity concept is expected by the end of 2009 when the tests with the first and refurbished prototype will be available.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:abG-DnoFyZgC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Recent experiments with the European 1MW, 170GHz industrial CW and short-pulse gyrotrons for ITER",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920379618308299",
            "Abstract": "The European Gyrotron Consortium (EGYC) is developing the European 1 MW, 170 GHz Continuous Wave (CW) industrial prototype gyrotron for ITER in cooperation with Thales Electron Devices (TED) and Fusion for Energy (F4E). This conventional, hollow-cavity gyrotron, is based on the 1 MW, 170 GHz Short-Pulse (SP) modular gyrotron that has been designed and manufactured by the Karlsruhe Institute of Technology (KIT) in collaboration with TED. Both gyrotrons have been tested successfully in multiple experiments. In this work we briefly report on the results with the CW gyrotron at KIT and we focus at the experiments at the Swiss Plasma Center (SPC). In addition, we present preliminary results from various upgrades of the SP tube that are currently tested at KIT.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:q3oQSFYPqjQC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Metrology techniques for the verification of the alignment of the EU gyrotron prototype for ITER",
            "Publication year": 2019,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2019/08/epjconf_ec2018_04015/epjconf_ec2018_04015.html",
            "Abstract": "The EU gyrotron for the ITER Electron Cyclotron (EC) heating system has been developed in coordinated efforts of the EGYC Consortium, Thales ED (TED) and Fusion for Energy (F4E) and under the supervision of ITER Organization Central Team. After the successful verification of the design of the 1MW, 170 GHz hollow cylindrical cavity gyrotron operating at the nominal TE32,9 mode with a short pulse gyrotron prototype at KIT, an industrial CW gyrotron prototype was manufactured by TED and tested at ~0.8 MW output power and 180 s pulse duration, which is the limit of the HV power supply currently available at KIT. The experiments are being continued at SPC in 2018 to extend further the pulse duration, taking advantage of the existing CW full-power capabilities of the gyrotron test facility recently upgraded for the FALCON project. The gyrotron cavity interaction is very sensitive to the alignment of the internal …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "From series production of gyrotrons for W7-X toward EU-1 MW gyrotrons for ITER",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6740075/",
            "Abstract": "Europe is devoting significant joint efforts to develop and to manufacture MW-level gyrotrons for electron cyclotron heating and current drive of future plasma experiments. The two most important ones are the stellarator Wendelstein W7-X at Greifswald and the Tokamak ITER at Cadarache. While the series production of the 140 GHz, 1 MW, CW gyrotrons for the 10-MW electron cyclotron resonance heating system of stellarator W7-X is proceeding, the European GYrotron Consortium is presently developing the EU-1 MW, 170 GHz, CW gyrotron for ITER. The initial design had already been initiated in 2007, as a risk mitigation measure during the development of the advanced ITER EU-2-MW coaxial-cavity gyrotron. The target of the ITER EU-1-MW conventional-cavity design is to benefit as much as possible from the experiences made during the development and series production of the W7-X gyrotron and of the …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reflectivity properties of an abruptly ended asymmetrical slab waveguide for the case of transverse magnetic modes",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JOSAA-17-1-162",
            "Abstract": "We deal with the scattering phenomenon from an abruptly terminated asymmetrical slab waveguide for the case of transverse magnetic (TM) modes. The analysis uses both the integral equation method and the variational technique. The reflection coefficient of the dominant TM guided mode and the far-field radiation pattern are computed, and the discontinuity of the electric field distribution on the core–clad interface is exhibited. Numerical results are presented for several cases of abruptly ended waveguides, including the three-layer slab guide and the structure with variable profile of the refractive index.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:WF5omc3nYNoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Conceptual design studies of the Electron Cyclotron launcher for DEMO reactor",
            "Publication year": 2017,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2017/26/epjconf_rfppc2017_03036/epjconf_rfppc2017_03036.html",
            "Abstract": "A demonstration fusion power plant (DEMO) producing electricity for the grid at the level of a few hundred megawatts is included in the European Roadmap [1]. The engineering design and R&D for the electron cyclotron (EC), ion cyclotron and neutral beam systems for the DEMO reactor is being performed by Work Package Heating and Current Drive (WPHCD) in the framework of EUROfusion Consortium activities. The EC target power to the plasma is about 50 MW, in which the required power for NTM control and burn control is included. EC launcher conceptual design studies are here presented, showing how the main design drivers of the system have been taken into account (physics requirements, reactor relevant operations, issues related to its integration as in-vessel components). Different options for the antenna are studied in a parameters space including a selection of frequencies, injection angles and …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:p2g8aNsByqUC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "2.4: Investigations on parasitic oscillations in megawatt gyrotrons",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5503618/",
            "Abstract": "Recently megawatt gyrotrons are found to suffer from various parasitic oscillations, particularly RF oscillations in the beam tunnel induced by the electron beam prior to the desired interaction zone (cavity). The paper describes experimental and theoretical investigations on both high and low frequency parasitic oscillations, employing a special measurement system as well as a novel analysis method to determine and characterize these undesired oscillations. The results of extensive experimental investigations on two different beam tunnel setups verify theoretical predictions on the parasitic oscillations being gyro-backward wave interactions excited in the beam tunnel. In addition, other types of parasitic oscillations were observed and explained. An improved beam tunnel designed to suppress the parasitic RF oscillations, was validated by further experiments with a conventional and a coaxial-cavity gyrotron.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimized 90 polarization shift step twists for Ku, K and Ka bands",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s10762-007-9209-9",
            "Abstract": "Optimized models for 90° polarization shift step twists for Ku, K and Ka bands are presented. The cross-section of the waveguide employed is similar to that of a rectangular one, with the difference that the walls of the shorter side are part of a circular one with the proper diameter. The optimized models have been found using the CST Microwave Studio simulation tool and in all cases the return loss is kept below -20 dB for a wide range of frequency spectrum. Two examples are given, one for Ku band and the other for K and Ka ones.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Studies of the Electromagnetic Spectrum of Corrugated Waveguides",
            "Publication year": 2006,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2158786",
            "Abstract": "A method based on the Floquet‐Bloch theorem is employed to determine the propagation characteristics of electromagnetic waves in waveguides with surface corrugations. Several cases are considered, including circular cylindrical and coaxial waveguides. For each case a numerical code has been developed to calculate the dispersion relation and the field distributions.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Scattering of the transverse magnetic modes from an abruptly ended strongly asymmetrical slab waveguide by an accelerated integral equation technique",
            "Publication year": 2001,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-18-12-3110",
            "Abstract": "We study the problem of the scattering of the first TM guided mode from an abruptly ended strongly asymmetrical slab waveguide by an improved iteration technique, which is based on the integral equation method with “accelerating” parameters. We demonstrate that the values of these parameters are related to the variational principle, and we save approximately 1–2 iterations compared with the case in which these parameters are not employed. The tangential electric-field distribution on the terminal plane, the reflection coefficient of the first TM guided mode, and the far-field radiation pattern are computed. Furthermore, a simple technique based on the Aitken extrapolation procedure is employed for faster computation of the higher-order solutions of the reflection coefficient. Numerical results are presented for several cases of abruptly ended waveguides, including systems with variational profile, while special …",
            "Abstract entirety": 0,
            "Author pub id": "9CBNSZsAAAAJ:5nxA0vEk-isC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Parasitic oscillations in coaxial gyrotron beam tunnels",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6471798/",
            "Abstract": "High-power high-frequency gyrotrons are required for several applications, including plasma heating, current drive, and plasmas stabilization for controlled thermonuclear fusion. Despite the use of dumping dielectric material in these gyrotrons, parasitic oscillations often appear, which significantly affect their operation and efficiency. In this paper, we perform an extended parametric study on the effect of the beam-tunnel characteristics, i.e., the outer radius of the inner waveguide and the width of the grooves, as well as the lossy material properties and the beam-radial position on the dumping of these oscillations.",
            "Abstract entirety": 1,
            "Author pub id": "9CBNSZsAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        }
    ]
}]