[{
    "name": "Ιωάννης Στρατής",
    "romanize name": "Ioannis Stratis",
    "School-Department": "Μαθηματικών",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 18095,
    "Scholar name": "IOANNIS G. STRATIS",
    "Scholar id": "hlS6MNcAAAAJ",
    "Affiliation": "Professor, Department of Mathematics, National and Kapodistrian University of Athens, Greece",
    "Citedby": 1069,
    "Interests": [
        "Differential Equations",
        "Dynamical Systems",
        "Applied Mathematics",
        "Waves in Linear or Nonlinear",
        "Deterministic or Stochastic Media"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=hlS6MNcAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Boundary integral equation methods in the theory of elasticity of hemitropic materials: A brief review",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S037704270900483X",
            "Abstract": "The theory of elasticity of hemitropic materials has recently been the object of rigorous mathematical analysis. In particular, the potential method and the theory of pseudodifferential equations have been used in studying the solvability in various function spaces of the main boundary value and transmission problems, in smooth and in Lipschitz domains. The main features and results of this boundary integral equations approach are briefly reviewed here.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:j3f4tGmQtD8C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Backmatter",
            "Publication year": 2012,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9781400842650.bm/html",
            "Abstract": "You currently have no access to view or download this content. Please log in with your institutional or personal account if you should have access to this content through either of these. Showing a limited preview of this publication:",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:eflP2zaiRacC",
            "Publisher": "Princeton University Press"
        },
        {
            "Title": "ON THE SCATTERING OF SPHERICAL ELECTROMAGNETIC WAVES BY A PENETRABLE",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=GoLSQN2jlFwC&oi=fnd&pg=PA34&dq=info:yBiwlnrFk6UJ:scholar.google.com&ots=CkBnXYlP1X&sig=TmBs9o1-xogMQ7ISu8ExCOGxsUY",
            "Abstract": "The problem of scattering of spherical electromagnetic waves by a bounded chiral obstacle is considered. General scattering theorems, relating the far-field patterns due to scattering of waves from a point source put in any two different locations (the reciprocity principle, the optical theorem, etc), and mixed scattering relations (relating the scattered fields due to a point source and a plane wave) are established. Further, in the case of a spherical chiral scatterer, the exact Green's function and the electric far-field pattern of the problem are constructed.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:BrmTIyaxlBUC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Electromagnetic scattering by a perfectly conducting obstacle in a homogeneous chiral environment: solvability and low‐frequency theory",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.321",
            "Abstract": "The scattering of plane time‐harmonic electromagnetic waves propagating in a homogeneous isotropic chiral environment by a bounded perfectly conducting obstacle is studied. The unique solvability of the arising exterior boundary value problem is established by a boundary integral method. Integral representations of the total exterior field, as well as of the left and right electric far‐field patterns are derived. A low‐frequency theory for the approximation of the solution to the above problem, and the derivation of the far‐field patterns is also presented. Copyright © 2002 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "On the controllability of time-harmonic electromagnetic fields in chiral media",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Stratis/publication/257141574_On_the_controllability_of_time_harmonic_Electromagnetic_fields_in_chiral_media/links/0deec52795be8991dd000000/On-the-controllability-of-time-harmonic-Electromagnetic-fields-in-chiral-media.pdf",
            "Abstract": "We study the problem of controllability of time-harmonic electromagnetic fields in a regular chiral body by means of control currents on its boundary. We prove some partial observability results that ensures the unique determination of the electromagnetic field.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:abG-DnoFyZgC",
            "Publisher": "MARUZEN CO. LTD"
        },
        {
            "Title": "Spatiotemporal algebraically localized waveforms for a nonlinear Schrödinger model with gain and loss",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278917301227",
            "Abstract": "We consider the asymptotic behavior of the solutions of a nonlinear Schrödinger (NLS) model incorporating linear and nonlinear gain/loss. First, we describe analytically the dynamical regimes (depending on the gain/loss strengths), for finite-time collapse, decay, and global existence of solutions. Then, for all the above parametric regimes, we use direct numerical simulations to study the dynamics corresponding to algebraically decaying initial data. We identify crucial differences between the dynamics of vanishing initial conditions, and those converging to a finite constant background: in the former (latter) case we find strong (weak) collapse or decay, when the gain/loss parameters are selected from the relevant regimes. One of our main results, is that in all the above regimes, non-vanishing initial data transition through spatiotemporal, algebraically decaying waveforms. While the system is nonintegrable, the …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:b0M2c_1WBrUC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Wave scattering by an elastic obstacle with interior cuts",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mana.200510531",
            "Abstract": "We consider the direct interaction problem describing the scattering of acoustic waves by an elastic obstacle with interior cracks. By the potential method we reduce the problem to an equivalent system of integral (pseudodifferential) equations and study its solvability. In particular, we formulate necessary and sufficient conditions for the solvability in terms of the so‐called Jones modes. We show that the direct scattering problem is solvable for arbitrary values of the frequency parameter and for arbitrary incident wave functions if the crack surface is traction free. We also investigate the regularity of the displacement field, and analyze the stress singularities at the crack edge. (© 2007 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:JV2RwH3_ST0C",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "A quantitative approach on the solvability of evolution problems in open sets of certain geometries",
            "Publication year": 2022,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022247X21007423",
            "Abstract": "We study the engagement of the boundary data in solving certain evolution problems–that incorporate the standard second order, symmetric, uniformly elliptic operators–in arbitrary open sets. We extend the range of the open sets considered, by proposing a unified approach for both bounded and unbounded sets. The core behind this approach is a revision of (i) the extension operator theory and (ii) the elliptic regularity theory. We illustrate the abstract results for the case of the non vanishing, non linear Schrödinger equation (NLSE) with the defocusing pure power non linearity.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Electromagnetic fields in chiral media",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Stratis/publication/258606166_Electromagnetic_fields_in_chiral_media/links/02e7e528b4fa348dfd000000/Electromagnetic-fields-in-chiral-media.pdf",
            "Abstract": "We present some results of the rigorous mathematical theory regarding scattering and propagation problems in chiral media, both in the frequency and the time domain.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Eptalofos Publications"
        },
        {
            "Title": "A TIME-DOMAIN ANALYSIS OF WAVE PROPAGATION IN CHIRAL MEDIA IN THE OPTICAL RESPONSE REGION",
            "Publication year": 2002,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812777140_0014",
            "Abstract": "We consider a time-domain analysis of the equations governing wave propagation in a homogeneous, three-dimensional, unbounded chiral medium, in the optical response region. Two solution methods, one of which does not involve the computation of an associated spectral family, are presented.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the scattering of point‐generated electromagnetic waves by a perfectly conducting sphere, and related near‐field inverse problems",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/zamm.200310012",
            "Abstract": "A spherical electromagnetic wave is scattered by a bounded perfectly conducting obstacle. A generalization of the plane‐wave optical theorem is established. For a spherical scatterer, low frequency results are obtained by approximating the known exact solution (separation of variables). In particular, a closed‐form approximation of the scattered wavefield at the source of the incident spherical wave is obtained. This leads to the solution of a near‐field inverse problem, where both the source and coincident receiver are located at several points in the vicinity of a small sphere. The same inverse problem is also treated from the knowledge of the leading order term in the low‐frequency asymptotic expansion of the scattering cross‐section.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:UeHWp8X0CEIC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "On some properties of Beltrami fields in chiral media",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0034487700890369",
            "Abstract": "Bohren's decomposition of the electric and magnetic fields into suitable Beltrami fields, is very important in the study of electromagnetics of chiral media. Integral representations for Beltrami fields are established, from first principles, in this work, along with the uniqueness results of Rellich's type. Applications to transmission problems for chiral media are also included.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Department of Mathematics, University of Ioannina, 451 10 Ioannina, Greece E-mail: gbarbatić). cc. uoi. gr",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=R7zICgAAQBAJ&oi=fnd&pg=PA94&dq=info:cGyrTovuF-YJ:scholar.google.com&ots=d0PdReH9jp&sig=oIk8yFzijPo_aKg1IWHxe0aqnLA",
            "Abstract": "We study the perodic homogenization problem for the elasticity theory of linear chiral materials. We establish the weak convergence of the solutions we corresponding to the material of period e> 0 to a limit u0 which we identify as the solution corresponding to an analogous' limit'homogeneous problem. We describe explicitly the coefficients of chiral elasticity of the limit problem in terms of an auxiliary cell problem.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:yD5IFk8b50cC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "A TIME DOMAIN ANALYSIS FOR CHIRAL DETERMINISTIC AND RANDOM MEDIA IN ELECTROMAGNETICS",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812814852_0019",
            "Abstract": "In this work we present some results on deterministic and stochastic models for chiral media in the time domain. We examine mild, strong and classical well posedness for the Cauchy problem of the integrodifferential equation that arises from Maxwell's equations under the full constitutive relations for chiral media. A stochastic model with multiplicative noise for this Cauchy problem is studied and mild and strong well posedness results are established. Further, we examine the well posedness for a widely used, local in time, approximation of the full constitutive relations, namely the DBF model.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A boundary integral equations approach for mixed impedance problems in elasticity",
            "Publication year": 2011,
            "Publication url": "https://www.jstor.org/stable/26163695",
            "Abstract": "Direct scattering problems for partially coated obstacles in linear elasticity lead to interior and exterior mixed impedance boundary value problems for the equations of steady-state elastic oscillations. We employ the potential method and reduce the mixed impedance problems to equivalent boundary pseudodifferential equations for arbitrary values of the oscillation parameter. We give a detailed analysis of the corresponding pseudodifferential equations which live on a proper submanifold of the boundary of the elastic body and establish uniqueness and existence results for the original mixed impedance problems for arbitrary values of the oscillation parameter; this is crucial in the study of inverse elastic scattering problems for partially coated obstacles. We also investigate regularity properties of solutions near the curves where the boundary conditions change and establish almost best Hölder smoothness results.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:maZDTaKrznsC",
            "Publisher": "The Rocky Mountain Mathematics Consortium"
        },
        {
            "Title": "Machine Learning Approaches on High Throughput NGS Data to Unveil Mechanisms of Function in Biology and Disease",
            "Publication year": 2021,
            "Publication url": "https://cgp.iiarjournals.org/content/18/5/605.abstract",
            "Abstract": "In this review, the fundamental basis of machine learning (ML) and data mining (DM) are summarized together with the techniques for distilling knowledge from state-of-the-art omics experiments. This includes an introduction to the basic mathematical principles of unsupervised/supervised learning methods, dimensionality reduction techniques, deep neural networks architectures and the applications of these in bioinformatics. Several case studies under evaluation mainly involve next generation sequencing (NGS) experiments, like deciphering gene expression from total and single cell (scRNA-seq) analysis; for the latter, a description of all recent artificial intelligence (AI) methods for the investigation of cell sub-types, biomarkers and imputation techniques are described. Other areas of interest where various ML schemes have been investigated are for providing information regarding transcription factors (TF …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "International Institute of Anticancer Research"
        },
        {
            "Title": "Mixed impedance transmission problems for vibrating layered elastic bodies",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.3295",
            "Abstract": "Direct scattering problems for partially coated piecewise homogenous and inhomogeneous layered obstacles in linear elasticity lead to mixed impedance transmission problems for the steady‐state elastic oscillation equations. For a piecewise homogenous isotropic composite body, we employ the potential method and reduce the mixed impedance transmission problem to an equivalent system of boundary pseudodifferential equations. We give a detailed analysis of the corresponding pseudodifferential operators, which live on the interface between the layers and on a proper submanifold of the boundary of the composite elastic body, and establish uniqueness and existence results for the original mixed impedance transmission problem for arbitrary values of the oscillation frequency parameter; this is crucial in the study of inverse elastic scattering problems for partially coated layered obstacles. We also investigate …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electromagnetic wave propagation in dispersive bianisotropic media",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702593_0031",
            "Abstract": "In this paper we treat the solvability of a general problem of linear electromagnetics. More precisely, we study the propagation (in the time domain) of electromagnetic fields in a bianisotropic medium, which presents dispersion. This is modeled by linear constitutive relations containing convolution terms. So the problem is represented by an integrodifferential equation in some appropriate Hilbert space and then is treated with the use of the vector-valued Laplace transform.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stochastic PDE models for chiral media: Well posedness, singular limits and a priori estimates for their validity",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Stratis/publication/257141737_Stochastic_PDE_models_for_chiral_media_well_posedeness_singular_limits_and_a_priori_estimates_for_their_validity/links/004635273bc2e55e46000000/Stochastic-PDE-models-for-chiral-media-well-posedeness-singular-limits-and-a-priori-estimates-for-their-validity.pdf",
            "Abstract": "In the present work we consider the problem of evolution of electromagnetic fields in a random chiral medium, with random external excitations. We establish the well posedness of the resulting stochastic model with additive noise, based on the Maxwell equations with nonlocal in time linear constitutive relations, as well as of a singular limit (local in time) approximative model which formally resembles the Drude-Born-Fedorov constitutive relations for chiral media. We also provide a priori estimates of the difference of the fields as predicted by both models, depending on properties of the stochastic term, the time horizon, properties of the domain, properties of the random initial data and source terms and the chirality measure of the approximative model.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Chapter Six. Scattering Problems: A Variety of Topics",
            "Publication year": 2012,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9781400842650.112/html",
            "Abstract": "In this chapter we continue our study of scattering problems in the case where the considered fields have harmonic time dependence and the involved chiral media are homogeneous. For the reader’s convenience we start with a section (Section 6.2) containing various important concepts of scattering theory; for simplicity, the presentation is done for the relatively simple case of the scalar Helmholtz equation, whose vector analogue is strongly related to the Maxwell equations. In the following sections we present a variety of topics. In particular, Section 6.3 deals with the establishment of the reciprocity principle, the general scattering theorem and the optical theorem for the chiral obstacle in an achiral environment problem; moreover, a study of the spectrum of the far-field operator and its relation to that of the T-matrix is included. Next, in Section 6.3. 2 we consider the chiral obstacle in an achiral environment scattering …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:LPZeul_q3PIC",
            "Publisher": "Princeton University Press"
        },
        {
            "Title": "Nonvanishing at spatial extremity solutions of the defocusing nonlinear Schrödinger equation",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.5074",
            "Abstract": "We show local existence of certain type of solutions for the Cauchy problem of the defocusing nonlinear Schrödinger equation with pure power nonlinearity, in various cases of open sets, unbounded or bounded. These solutions do not vanish at the boundary or at infinity. We also show, in certain cases, that these solutions are unique and global.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Inverse problems, tomography, and image processing",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=Wx8MCAAAQBAJ&oi=fnd&pg=PA1&dq=info:IZ03rW-ItmEJ:scholar.google.com&ots=phIj7PHqAv&sig=qDAHyqt3RaSUFG8H_lOtrgovZ2A",
            "Abstract": "Proceedings of Sessions from the First Congress of the International Society for Analysis, Applications, and Computind held in Newark, Delaware, June 2-6, 1997",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "On the scattering of two-dimensional elastic point sources and related near-field inverse problems for small discs",
            "Publication year": 2009,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-royal-society-of-edinburgh-section-a-mathematics/article/on-the-scattering-of-twodimensional-elastic-point-sources-and-related-nearfield-inverse-problems-for-small-discs/EC28081CD3D62F5406A89A001AE56D6C",
            "Abstract": "The problem of scattering of a point-generated elastic dyadic field by a bounded obstacle or a penetrable body in two dimensions is considered. The direct scattering problem for each case is formulated in a dyadic form. For two point sources, dyadic far-field pattern generators are defined and general scattering theorems and mixed scattering relations are presented. The direct scattering problem for a rigid circular disc is considered, and the exact Green function and the elastic far-field patterns of the radiating solution in the form of infinite series are obtained. Under the low-frequency assumption, approximations for the longitudinal and transverse far-field patterns of the scattered field are obtained, in addition to an asymptotic expansion for the corresponding scattering cross-section. A simple inversion scheme that locates the radius and the position of a rigid circular disc, which is based on a closed-form …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:TFP_iSt0sucC",
            "Publisher": "Royal Society of Edinburgh Scotland Foundation"
        },
        {
            "Title": "Homogenization of Maxwell's equations in bianisotropic materials",
            "Publication year": 2016,
            "Publication url": "http://repository.edulll.gr/edulll/bitstream/10795/2968/2/2968_1.109_%CE%91%CE%9D_14_11_13.pdf",
            "Abstract": "Purpose: The study of the E/H field which is the solution of problem (1) when the domain Ω is filled with a material whose periodic microstructure is described by the matrices A, Gd.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A model for the outbreak of COVID-19: Vaccine effectiveness in a case study of Italy",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2008.00828",
            "Abstract": "We present a compartmental mathematical model with demography for the spread of the COVID-19 disease, considering also asymptomatic infectious individuals. We compute the basic reproductive ratio of the model and study the local and global stability for it. We solve the model numerically based on the case of Italy. We propose a vaccination model and we derive threshold conditions for preventing infection spread in the case of imperfect vaccines.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interface crack problems for metallic–piezoelectric composite structures",
            "Publication year": 2010,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.1216",
            "Abstract": "We investigate three‐dimensional interface crack problems (ICP) for metallic–piezoelectric composite bodies. We give a mathematical formulation of the physical problem when the metallic and piezoelectric bodies are bonded along some proper part of their boundaries where an interface crack occurs. By potential methods the ICP is reduced to an equivalent strongly elliptic system of pseudodifferential equations on manifolds with boundary. We study the solvability of this system in different function spaces and prove uniqueness and existence theorems for the original ICP. We analyse the regularity properties of the corresponding electric and mechanical fields near the crack edges and near the curves where the boundary conditions change. In particular, we characterize the stress singularity exponents and show that they can be explicitly calculated with the help of the principal homogeneous symbol matrices of …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Bright–Dark Vector Solitons in Chiral Media",
            "Publication year": 2002,
            "Publication url": "https://iopscience.iop.org/article/10.1238/Physica.Regular.066a00280/meta",
            "Abstract": "We study wave propagation in nonlinear chiral media. In the weak dispersion, low chirality limit the dynamics of the waves are reduced to the dynamics of a set of coupled partial differential equations of the NLS type. Using reductive perturbation theory we show the existence of bright–dark chiral vector solitons.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Stochastic differential equations of Sobolev type in infinite dimensional Hilbert spaces",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812773197_0020",
            "Abstract": "In this work we present some results on the Cauchy problem for a general class of linear equations of Sobolev type with additive noise. We prove existence and uniqueness of mild and strong solutions using semigroup theory and properties of the stochastic convolution of a uniformly continuous semigroup generated by a linear and bounded operator. We also prove existence and uniqueness of mild and strong solutions for a perturbed Cauchy problem of Sobolev type and we investigate the continuity of the solution with respect to a small parameter . As examples we study the standard Sobolev equation in bounded and unbounded domains, and a perturbed Cauchy problem for the heat equation.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mathematical problems of the theory of elasticity of chiral materials for Lipschitz domains",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.696",
            "Abstract": "By the potential method, we investigate the Dirichlet and Neumann boundary value problems of the elasticity theory of hemitropic (chiral) materials in the case of Lipschitz domains. We study properties of the single‐ and double‐layer potentials and of certain, generated by them, boundary integral operators. These results are applied to reduce the boundary value problems to the equivalent first and the second kind integral equations and the uniqueness and existence theorems are proved in various function spaces. Copyright © 2005 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:W7OEmFMy1HYC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Chapter Four. Well Posedness",
            "Publication year": 2012,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9781400842650.61/html",
            "Abstract": "Time-harmonic problems constitute an important class within the theory of electromagnetics in complex media. In treating such problems we assume that the temporal evolution of these fields is periodic, with a fixed and prescribed period ϖ. This class covers a variety of important applications, such as wave guide problems, scattering problems, etc. Under the assumption of temporally periodic fields we may use the constitutive relations introduced in Section 2.3. 3, which do not contain the convolution terms. The absence of the convolution terms simplifies the treatment of the Maxwell equations,(PDEs) which in this case become partial differential equations depending only on the spatial variables. As we shall see in this chapter, these differential equations, after proper reductions, can lead to problems that can be treated using the theory of variational PDEs, and methods akin to those used in elliptic problems.In this …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Princeton University Press"
        },
        {
            "Title": "On the analysis of the exterior Calderón operator for a non-spherical geometry",
            "Publication year": 2017,
            "Publication url": "https://portal.research.lu.se/portal/files/24799921/Kristensson.pdf",
            "Abstract": "General rights Unless other specific re-use rights are stated the following general rights apply: Copyright and moral rights for the publications made accessible in the public portal are retained by the authors and/or other copyright owners and it is a condition of accessing publications that users recognise and abide by the legal requirements associated with these rights.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the controllability of Maxwell's equation involving nonlocal constitutive relations",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00096182/",
            "Abstract": "Archive ouverte HAL - On the controllability of Maxwell's equation involving nonlocal constitutive \nrelations Accéder directement au contenu Accéder directement à la navigation Toggle navigation \nCCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation \nEpisciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal \nAccueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par \nannée de publication Par structure de recherche Les portails de l'archive Recherche \nDocumentation hal-00096182, version 1 Autre publication On the controllability of Maxwell's \nequation involving nonlocal constitutive relations P. Courilleau 1 T. Horsin I. Stratis Détails 1 \nAGM - UMR 8088 - Analyse, Géométrie et Modélisation Type de document : Autre publication \nListe complète des métadonnées Voir https://hal.archives-ouvertes.fr/hal-00096182 : Amina <…",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Homogenization of Maxwell's equations in dissipative bianisotropic media",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.420",
            "Abstract": "We study the periodic homogenization of Maxwell's equations for dissipative bianisotropic media in the time domain, both in R3 and in a bounded domain with the perfect conductor boundary condition. We consider both local with respect to time (optical response region) and non‐local in time (allowing dispersive effects) constitutive laws; in the non‐local case the explicit description of the homogenized coefficients is given in terms of the Laplace transform. The principal result of this work is the description of the asymptotic behaviour of the solutions of the considered problems as the period of the electromagnetic parameters tends to zero. Copyright © 2003 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:WF5omc3nYNoC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Homogenization of Maxwell’s equations in linear dispersive bianisotropic media",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=GoLSQN2jlFwC&oi=fnd&pg=PA196&dq=info:IjA5XqNGPTEJ:scholar.google.com&ots=CkBnXYlP1Z&sig=opypptyChcc-UZb6auO5l4Lx4ho",
            "Abstract": "The functions n'(x), 5*(x), &*(x), 4 (x) as well as the functions må (x, t), Si (x, t), Ei (x, t), Hi (x, t) are periodic in x of period ey, where Y CR3 is a parallelepiped which is fixed throughout this paper. Equivalently, the susceptibility (block) matrices A'(x) and KⓇ(x, t) have the form",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On spherical‐wave scattering by a spherical scatterer and related near‐field inverse problems",
            "Publication year": 2001,
            "Publication url": "https://academic.oup.com/imamat/article-abstract/66/6/539/677859",
            "Abstract": "A spherical acoustic wave is scattered by a bounded obstacle. A generalization of the ‘optical theorem’ (which relates the scattering cross‐section to the far‐field pattern in the forward direction for an incident plane wave) is proved. For a spherical scatterer, low‐frequency results are obtained by approximating the known exact solution (separation of variables). In particular, a closed‐form approximation for the scattered wavefield at the source of the incident spherical wave is obtained. This leads to the explicit solution of some simple near‐field inverse problems, where both the source and coincident receiver are located at several points in the vicinity of a small sphere.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Regularity of nonvanishing–at infinity or at the boundary–solutions of the defocusing nonlinear Schrödinger equation",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03605302.2020.1839762",
            "Abstract": "Considering the defocusing nonlinear Schrödinger equation (NLSE) in generic (bounded or unbounded) open sets  for n = 1, 2, and 3, we prove the regularity of weak, non-vanishing solutions at infinity or at the boundary of U. Our approach is based on suitably defined extension operators, along with a priori estimates for regular functions, under certain assumptions on the smoothness of the boundary. The results cover physically significant classes of solutions, as dark-solitons and compacton waveforms, when the notion of such solutions is extended in higher-dimensional set-ups.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Some remarks on a class of inverse problems related to the parabolic approximation to the Maxwell equations: a controllability approach",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.3323",
            "Abstract": "We consider a class of inverse source problems for the parabolic approximation to the Maxwell equations.We relate this to an exact controllability problem; the regularisation of the considered source problems is studied with an optimal control method. Copyright © 2014 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The exterior Calderón operator and its spectrum",
            "Publication year": 2019,
            "Publication url": "https://portal.research.lu.se/portal/en/publications/the-exterior-calderon-operator-and-its-spectrum(1295a0eb-b7cb-413a-aefc-f4956e33eb11).html",
            "Abstract": "The exterior Calderón operator and its spectrum - Lund University Accessibility statement Login \nfor staff Lund University IN ENGLISH PÅ SVENSKA Research Portal Find researchers, research \noutputs (eg publications), projects, infrastructures and units at Lund University People Research \nOutputs Projects Infrastructure Organisation HomeResearch Outputs The exterior Calderón \noperator and its spectrum The exterior Calderón operator and its spectrum Research output: \nContribution to conference › Abstract Overview Cite Details Authors Gerhard Kristensson \nIoannis Stratis Niklas Wellander Athanasios Yannacopoulos Organisations Electromagnetic \nTheory External organisations National and Kapodistrian University of Athens Swedish \nDefense Research Agency Athens University of Economics and Business Research areas \nand keywords Subject classification (UKÄ) – MANDATORY Other Electrical Engineering, , - -:…",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D elastic scattering theorems for point‐generated dyadic fields",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.964",
            "Abstract": "The problem of scattering of elastic spherical waves by a rigid body, cavity or a penetrable obstacle in 3D linear elasticity is considered. For two point sources, dyadic far‐field pattern generators are defined, which are used for the formulation of a general scattering theorem. The main reciprocity principle and mixed scattering relations are also established. We provide the necessary energy considerations, presenting relative energy functionals and expressions for the differential and the scattering cross section due to point‐source dyadic incidence. Finally, an application of the general scattering theorem for appropriate locations of the point source leads to an optical theorem. Copyright © 2007 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:5nxA0vEk-isC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Dyadic Elastic Scattering by Point Sources: Direct and Inverse Problems",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-8176-4899-2_3",
            "Abstract": "This chapter is concerned with the scattering of elastic point sources by a bounded obstacle, as well as with a related near-field inverse problem for small scatterers. We consider the Dirichlet problem, where the displacement field is vanishing on the surface of the scatterer. A dyadic formulation for the aforementioned scattering problem is considered in order to gain the symmetry–compactness of the dyadic analysis [TAI94].For acoustic and electromagnetic scattering, results on incident waves generated by a point source appear in [DK00], [AMS02]; see also references therein. In all these studies, scattering relations by point sources are established; related simple inversion algorithms for small scatterers can be found in [AMS01]. For elasticity, related problems such as the location and identification of a small three-dimensional elastic inclusion, using arrays of elastic source transmitters and receivers, are …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Birkhäuser Boston"
        },
        {
            "Title": "Chapter Twelve. Well Posedness",
            "Publication year": 2012,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9781400842650.247/html",
            "Abstract": "The aim of this part of the book is to examine the effects of randomness on the evolution and behaviour of electromagnetic fields in chiral media. Since our basic interest is the development of a mathematically rigorous framework for the study of this problem, our approach is to model random effects through the introduction of a general class of random fields1 into the system of equations that governs the evolution of the electromagnetic fields. We do not take up the question of self-consistent mathematical modelling of the random effects, starting from the starting point of first principles physical theory. Such a task, although extremely interesting and important, is well beyond the scope of this work. Instead, we assume that the randomness follows some rather general and reasonable qualitative assumptions, eg, Gaussian behaviour, etc., and use a well-founded mathematical model for it, in terms of the Wiener process …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Princeton University Press"
        },
        {
            "Title": "Stochastic integrodifferential equations in Hilbert spaces with applications in electromagnetics",
            "Publication year": 2010,
            "Publication url": "https://www.jstor.org/stable/26163703",
            "Abstract": "In this work we present some results on deterministic and stochastic integrodifferential equations in Hilbert spaces, motivated from and applied to problems arising from the mathematical modeling of electromagnetics fields in complex random media. We examine the mild, strong and classical well posedness for the Cauchy problem of the integrodifferential equation which describes Maxwell's equations complemented with the general (and therefore nonlocal in time) linear constitutive relations describing such media, with either additive or multiplicative noise.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:4DMP91E08xMC",
            "Publisher": "The Rocky Mountain Mathematics Consortium"
        },
        {
            "Title": "A time domain analysis of wave motions in chiral materials",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mana.200310018",
            "Abstract": "A time domain analysis of the equations governing wave propagation in an unbounded chiral medium is presented by a spectral family approach and by a direct eigenfunction expansion using Beltrami–Moses fields.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:2osOgNQ5qMEC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Chirality notions and electromagnetic scattering: a mini review",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/17476933.2021.1953491",
            "Abstract": "We review mathematical results on the interaction of time-harmonic electromagnetic waves with ‘geometric’ and ‘electromagnetic’ chiral objects and discuss the relation between these two notions.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Linear stochastic degenerate Sobolev equations and applications†",
            "Publication year": 2015,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207179.2015.1048482",
            "Abstract": "In this paper, a general class of linear stochastic degenerate Sobolev equations with additive noise is considered. This class of systems is the infinite-dimensional analogue of linear descriptor systems in finite dimensions. Under appropriate assumptions, the mild and strong well-posedness for the initial value problem are studied using elements of the semigroup theory and properties of the stochastic convolution. The final value problem is also examined and it is proved that this is uniquely strongly solvable and the solution is continuously dependent on the final data. Based on the results of the forward and backward problem, the conditions for the exact controllability are investigated for a special but important class of these equations. The abstract results are illustrated by applications in complex media electromagnetics, in the one-dimensional stochastic Dirac equation in the non-relativistic limit and in a potential …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Transmission problems in the theory of elastic hemitropic materials",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00036810701714198",
            "Abstract": "The purpose of this article is to investigate mixed transmission-boundary value problems for the differential equations of the theory of hemitropic (chiral) elastic materials. We consider the differential equations corresponding to the time harmonic dependent case, the so called pseudo-oscillation equations. Applying the potential method and the theory of pseudodifferential equations we prove uniqueness and existence theorems of solutions to the Dirichlet, Neumann and mixed transmission-boundary value problems for piecewise homogeneous hemitropic composite bodies and analyze their regularity properties. We investigate also interface crack problems and establish almost best regularity results.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:UebtZRa9Y70C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "On generalized linear singular delay systems",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022247X00967611",
            "Abstract": "In this paper we study generalized linear singular delay systems. Such a system is reduced to a suitable homogeneous one. Using the Kronecker canonical form, the latter is decomposed into five subsystems, whose solutions are obtained. Moreover, the form of the initial function is given, so that the corresponding initial value problem is considered.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Mathematical analysis of deterministic and stochastic problems in complex media electromagnetics",
            "Publication year": 2012,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9781400842650/html",
            "Abstract": "Writing a book is an adventure. To begin with, it is a toy and an amusement; then it becomes a mistress, and then it becomes a master, and then a tyrant. The last phase is that just as you are about to be reconciled to your servitude, you kill the monster, and fling him out to the public.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Princeton University Press"
        },
        {
            "Title": "Transmission problems in contrasting chiral media",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0034487704900092",
            "Abstract": "Time harmonic electromagnetic waves are scattered by a homogeneous chiral obstacle embedded in a homogeneous chiral environment. The corresponding transmission problem is reduced, with the use of Beltrami fields, to an integral equation over the interface between the obstacle and the surrounding medium. This integral equation is known to be weakly uniquely solvable except for a discrete set of electromagnetic parameters of the obstacle. We establish classical solvability, and in some interesting cases (mirror conjugated and isoimpedant chiral media) it is shown that unique solvability is established without the exception of any set of electromagnetic parameters.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Point-source elastic scattering by a nested piecewise homogeneous obstacle in an elastic environment",
            "Publication year": 2010,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1081286508102048",
            "Abstract": "A nested piecewise homogeneous elastic scatterer is embedded in a homogeneous elastic environment. The scatterer’s core may be rigid, cavity, Robin, or lossy penetrable. A 2D or 3D incident elastic field, generated by a point-source located in the homogeneous environment, impinges on the scatterer. The scattering problem is formulated in a dyadic form. The main purpose of this paper is to establish scattering relations for the elastic point-source excitation of a nested piecewise homogeneous scatterer. To this direction, we establish reciprocity principles and general scattering theorems relating the scattered fields with the corresponding far-field patterns. Furthermore, for a scatterer excited by a point-source and a plane wave, mixed scattering relations are derived. The optical theorem, relating the scattering cross-section with the field at the point-source’s location a is recovered as a corollary of the general …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "On an interior Calderón operator and a related Steklov eigenproblem for Maxwell's equations",
            "Publication year": 2020,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2020arXiv200710765D/abstract",
            "Abstract": "We discuss a Steklov-type problem for Maxwell's equations which is related to an interior Calderón operator and an appropriate Dirichlet-to-Neumann type map. The corresponding Neumann-to-Dirichlet map turns out to be compact and this provides a Fourier basis of Steklov eigenfunctions for the associated energy spaces. With an approach similar to that developed by Auchmuty for the Laplace operator, we provide natural spectral representations for the appropriate trace spaces, for the Calderón operator itself and for the solutions of the corresponding boundary value problems subject to electric or magnetic boundary conditions on a cavity.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the scattering of spherical electromagnetic waves by a penetrable chiral obstacle",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702593_0004",
            "Abstract": "The problem of scattering of spherical electromagnetic waves by a bounded chiral obstacle is considered. General scattering theorems, relating the far–field patterns due to scattering of waves from a point source put in any two different locations (the reciprocity principle, the optical theorem, etc), and mixed scattering relations (relating the scattered fields due to a point source and a plane wave) are established. Further, in the case of a spherical chiral scatterer, the exact Green's function and the electric far–field pattern of the problem are constructed.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Chapter Two. The Maxwell Equations and Constitutive Relations",
            "Publication year": 2012,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9781400842650.9/html",
            "Abstract": "The aim of this chapter is twofold: first, to introduce the constitutive relations which are commonly used in electromagnetic theory for the mathematical modelling of complex electromagnetic media. In the context of the present work these constitutive relations are to be understood as operators connecting the electric flux density and the magnetic flux density with the electric and the magnetic fields. These relations are considered as formal expressions of the physical laws that govern the electromagnetics of complex media. When they are introduced into the Maxwell equations, we obtain differential equations (PDEs) that govern the evolution of the electromagnetic fields; the treatment of these equations, in the rigorous mathematical sense, is the main object of this monograph. Through the treatment of these evolution equations we may model, understand and predict qualitative and quantitative phenomena related to …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Princeton University Press"
        },
        {
            "Title": "Linear stochastic degenerate Sobolev equations: well posedness and exact controllability.",
            "Publication year": 2016,
            "Publication url": "https://livrepository.liverpool.ac.uk/3001845/1/stochastic%20degenerate%20sobolev%20L-P-S-2_20150807.pdf",
            "Abstract": "In this paper, we revisit our recently proposed results for a general class of linear stochastic degenerate Sobolev systems with additive noise by using a different approach keeping, however, the main assumptions unchanged for the purpose of comparison. In particular, the mild and strong well posedness for the initial and final value problems are presented and studied by applying a suitable transformation which formulates the degenerate stochastic system as a pseudoparabolic one. Based on the derived results for the forward and backward cases, under this new framework, the conditions for the exact controllability are revisited for a particular class of degenerate Sobolev systems.AMS Subject Classification: Primary: 60H15; Secondary: 35R60; 35K65; 35Q61",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The singular sources method for an inverse transmission problem",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s00607-004-0085-z",
            "Abstract": "We employ the singular sources method introduced in [4] to solve an inverse transmission scattering problem for the Helmholtz equation                                      or D, respectively, where the total field u satisfies the transmission conditions                                      on the boundary of some domain D with some constant β. The main idea of the singular sources scheme is to reconstruct the scattered field of point sources or higher multipoles                                     (·, z) with source point z in its source point from the far field pattern                                      of scattered plane waves. The function                                     (z, z) is shown to become singular for z→∂D. This can be used to detect the shape D of the scattering object.Here, we will show how in addition to reconstructions of the shape D of the scattering object, the constant β can be reconstructed without solving the direct scattering problem. This extends the singular …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:Se3iqnhoufwC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Department of Physics, University of Athens, Panepistimiopolis, 15784 Athens, Greece",
            "Publication year": 2002,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=T8rUCgAAQBAJ&oi=fnd&pg=PA214&dq=info:g1geTyePkOwJ:scholar.google.com&ots=IYG90eDi2V&sig=Ha50KbHo4D2bmSPjP9HtyGC6k7Q",
            "Abstract": "In this paper we present some results on the mathematical modelling of time dispersive nonlinear chiral media. Models for spatially homogeneous and non-homogeneous media are formulated. As a special example of the general formulation we present the case of nonlinear media in the low chirality, weak dispersion limit, where the dynamics of the field envelopes is governed by a set of four coupled nonlinear Schrödinger equations.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Homogenization in chiral elasticity",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812773197_0010",
            "Abstract": "We study the perodic homogenization problem for the elasticity theory of linear chiral materials. We establish the weak convergence of the solutions u∊ corresponding to the material of period  to a limit u0 which we identify as the solution corresponding to an analogous 'limit' homogeneous problem. We describe explicitly the coefficients of chiral elasticity of the limit problem in terms of an auxiliary cell problem.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A priori estimates for a singular limit approximation of the constitutive laws for chiral media in the time domain",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022247X09000985",
            "Abstract": "The equations for the evolution of electromagnetic fields in chiral media, in the time domain, are nonlocal in time. In this work we study the validity of a singular limit (local in time) approximation for these nonlocal in time equations, by estimating the size of the difference of the fields as predicted by both models. In particular, we establish an a priori estimate for this difference, depending on the time horizon, properties of the domain, spatial properties of the initial data and the source terms and the chirality measure β of the approximating model.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Representation formulae of general solutions in the theory of hemitropic elasticity",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8152534/",
            "Abstract": "We consider the steady state oscillation equations of the theory of elasticity of hemitropic materials. We derive general representation formulae for the displacement and microrotation vectors by means of six scalar metaharmonic functions. These formulae are very convenient and useful in many particular problems for domains with concrete geometry. Here we consider two canonical transmission problems for piecewise homogeneous bodies with spherical interfaces and with the help of the representation formulae construct explicit solutions in the form of absolutely and uniformly convergent series. The representations can also be applied to multi-layered bodies with spherical and cylindrical interfaces.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:ufrVoPGSRksC",
            "Publisher": "OUP"
        },
        {
            "Title": "Mathematical problems of the theory of elasticity of chiral materials",
            "Publication year": 2003,
            "Publication url": "http://www.viam.science.tsu.ge/Ami/AMI_PAGE/2003_1/natroshvili.pdf",
            "Abstract": "The purpose of this paper is to construct explicitly fundamental matrices of solutions to the differential equations of the theory of hemitropic elastic (chiral) materials. We consider the differential equations corresponding to the cases of pseudo-oscillations and steady state oscillations and in terms of elementary functions we construct fundamental matrices satisfying the generalized Sommerfeld-Kupradze type radiation conditions. On the basis of Green’s formulae we derive the general integral representations of solutions in bounded and unbounded domains by means of potential type integrals. Properties of the single-and double-layer potentials and of certain, generated by them, boundary integral (pseudodifferential) operators are studied. Applying the potential method and the theory of pseudodifferential equations we prove the uniqueness and existence theorems of solutions to the Dirichlet, Neumann and mixed boundary value problems for the pseudo-oscillation equations. Some particular results are obtained for the steady state oscillation equations.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ON THE RECONSTRUCTION OF A SMALL ELASTIC SPHERE IN THE NEAR FIELD BY POINT-SOURCES",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812814852_0001",
            "Abstract": "A near-field reconstruction method which locates the radius and the position of a small elastic rigid sphere in the low-frequency sense is considered. In particular, the direct scattering problem for a rigid sphere by a point generated dyadic field is presented in a dyadic form, and the exact Green's function as well as the elastic far-field patterns of the radiating solution in form of infinite series are obtained. Finally, the inversion scheme is based on a closed form approximation of the scattered field at the source for various point-source locations.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Appendix C. Some Facts from Elliptic Homogenisation Theory",
            "Publication year": 2012,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9781400842650.327/html",
            "Abstract": "The weak convergences given in Theorem C. 1.4 cannot be strong unless f is a constant and| Y|= 1. Indeed, strong convergence implies that〈 fp〉=〈 f〉 p. Nevertheless, it is easy to check that, for p> 1, one has〈 fp〉=〈 f〉 p. An interesting per se by-product of the proof of the above theorem is the following result: let p and f be as in Theorem C. 1.4 and I be any open interval of RN containing at least a translated set of Y. Then there exists a constant C depending only on the spatial dimension n such that fϵ p",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:8AbLer7MMksC",
            "Publisher": "Princeton University Press"
        },
        {
            "Title": "On the controllability of Maxwell’s equations in a class of complex media",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Stratis/publication/257141577_On_the_controllability_of_Maxwell's_equations_in_a_class_of_complex_media/links/02e7e52795b958d5d3000000/On-the-controllability-of-Maxwells-equations-in-a-class-of-complex-media.pdf",
            "Abstract": "We describe some results on the problem of the controllability of the electromagnetic field in a 3–dimensional bounded body consisting of a complex medium which has specific constitutive relations.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Transmission problem for bi-isotropic media: Bi-lsotropic media",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00036810108840904",
            "Abstract": "In this work we study the solvability of the transmission problem describing the scattering of a plane time-harmonic electromagnetic wave by a penetrable bi-isotropic obstacle. Existence and uniqueness of the solution to this problem is established by a weak solutions approach, with the use of the Dirichlet-to-Neumann operator. Moreover, in the low frequency case, we reduce the problem to a sequence of potential problems which can be solved iteratively.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Gordon and Breach Science Publishers"
        },
        {
            "Title": "A mixed impedance scattering problem for partially coated obstacles in two-dimensional linear elasticity",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-16727-5_3",
            "Abstract": "In this paper the problem of scattering of time-harmonic elastic waves by a non-penetrable partially coated obstacle buried in a piecewise homogeneous medium is considered. We study the direct scattering problem as well as the inverse one. The direct problem for the Navier equation is formulated in a dyadic form and the issues of solvability due to uniqueness, existence and regularity are discussed. Uniqueness results for the corresponding inverse scattering problem are proved. In particular, the unique determination of the non-penetrable partially coated obstacle with its boundary condition as well as of the penetrable interface(s) between the layered media are established via the knowledge of the far-field pattern for elastic waves. The proof of the uniqueness is based on a mixed reciprocity relation and its connection between plane-waves and point-sources. The paper at hand deals with two-dimensional …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Birkhäuser, Cham"
        },
        {
            "Title": "On the well-posedness of the Maxwell system for linear bianisotropic media",
            "Publication year": 2012,
            "Publication url": "https://epubs.siam.org/doi/pdf/10.1137/100817401",
            "Abstract": "The time-dependent Maxwell system is supplemented with the constitutive relations of linear bianisotropic media and is treated as a neutral integro-differential equation in a Hilbert space. By using the theory of abstract Volterra equations and strongly continuous semigroups we obtain general well-posedness results for the corresponding mathematical problem.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:dhFuZR0502QC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Homogenization of random elliptic systems with an application to Maxwell's equations",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218202515500359",
            "Abstract": "We study the homogenization of elliptic systems of equations in divergence form where the coefficients are compositions of periodic functions with a random diffeomorphism with stationary gradient. This is done in the spirit of scalar stochastic homogenization by Blanc, Le Bris and Lions. An application of the abstract result is given for Maxwell's equations in random dissipative bianisotropic media.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:g5m5HwL7SMYC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "On singular linear matrix differential systems",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Stratis/publication/258603989_On_singular_linear_matrix_differential_systems/links/00b7d528b4e7281572000000/On-singular-linear-matrix-differential-systems.pdf",
            "Abstract": "In this paper we study Singular Linear Matrix Differential Systems (SLMDS) of the form:",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The exterior Calderón operator for non-spherical objects",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s42985-019-0005-x",
            "Abstract": "This paper deals with the exterior Calderón operator for not necessarily spherical domains. We present a new approach of finding the norm of the exterior Calderón operator for a wide class of surfaces. The basic tool in the treatment is the set of eigenfunctions and eigenvalues to the Laplace–Beltrami operator for the surface. The norm is obtained in view of an eigenvalue problem of a quadratic form containing the exterior Calderón operator. The connection of the exterior Calderón operator to the transition matrix for a perfectly conducting surface is analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:P5F9QuxV20EC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Stochastic degenerate Sobolev equations: well posedness and exact controllability",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.4077",
            "Abstract": "In this paper, we revisit the recently proposed results for a general class of linear stochastic degenerate Sobolev systems with additive noise by using a different approach keeping, however, the main assumptions unchanged for the purpose of comparison. In particular, the mild and strong well‐posedness for the initial and final value problems are presented and studied by applying a suitable transformation that formulates the degenerate stochastic system as a pseudoparabolic one. Based on the derived results for the forward and backward cases, under this new framework, the conditions for the exact controllability are revisited for a particular class of degenerate Sobolev systems. Copyright © 2016 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the domain derivative for scattering by impenetrable obstacles in chiral media",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8146244/",
            "Abstract": "For scattering of electromagnetic waves in a chiral medium by some perfectly conducting inclusions, we study the dependence of the scattered field on the boundary of the inclusions and show its Fréchet differentiability in appropriate spaces. Further, we derive a characterization of the derivative as a solution to some corresponding chiral boundary value problem. Our proof contains a new approach to rigorously derive this characterization.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:Zph67rFs4hoC",
            "Publisher": "OUP"
        },
        {
            "Title": "On the quasi-steady-state assumption in enzyme kinetics: rigorous analysis",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2109.14667",
            "Abstract": "We study, from a purely quantitative point of view, the quasi-steady-state assumption for the fundamental mathematical model of the general enzymatic reaction: we re-establish, on a rigorous basis, certain already known results and we propose a novel approach to the subject, that makes waivable an ambiguous, widely used, practice. In particular, we define the two parts of the assumption in a quantitative fashion, we employ a simple algorithm for the proper scaling of the corresponding problem which naturally provides us with the necessary and sufficient information, and we comment, among other issues, on a dispensable third part of the assumption.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Low frequency electromagnetic scattering from a nonchiral object in a chiral environment",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812792327_0005",
            "Abstract": "Chiral media are examples of media responding with both magnetic and electric polarization to either magnetic or electric excitation. They can be characterized by a set of constitutive relations in which the magnetic and electric fields are coupled. Recently there is a developing interest in turbid chiral media. In this work we consider the problem of scattering of an electromagnetic wave propagating in homogeneous, isotropic, chiral space by a nonchiral three–dimensional obstacle. We derive integral representations for the total exterior field of the arising transmission problem. Extending the nonchiral electromagnetic low frequency theory to the considered case, we reduce the scattering problem to an iterative sequence of problems in potential theory.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the approximate controllability of the stochastic Maxwell equations",
            "Publication year": 2010,
            "Publication url": "https://academic.oup.com/imamci/article-abstract/27/1/103/695743",
            "Abstract": "We study the approximate controllability of the stochastic Maxwell equations with an abstract approach and a constructive approach using a generalization of the Hilbert uniqueness method as proposed in Kim (2004, Approximate controllability of a stochastic wave equation. Appl. Math. Optim., 49, 81–98) for the stochastic wave equation.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "On the spectral properties of the exterior Calderón operator",
            "Publication year": 2020,
            "Publication url": "https://portal.research.lu.se/portal/files/75799026/URSI_GASS_2020_Extended_Abstract_Calderon_properties_v1.pdf",
            "Abstract": "General rights Unless other specific re-use rights are stated the following general rights apply: Copyright and moral rights for the publications made accessible in the public portal are retained by the authors and/or other copyright owners and it is a condition of accessing publications that users recognise and abide by the legal requirements associated with these rights.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The eigenvalue problem for a bianisotropic cavity",
            "Publication year": 2016,
            "Publication url": "http://repository.edulll.gr/edulll/bitstream/10795/2960/2/2960_1.109_%CE%91%CE%9D_12_8_13.pdf",
            "Abstract": "The eigenvalue problem for a bianisotropic cavity Page 1 The eigenvalue problem for a \nbianisotropic cavity Eftychia Argyropoulou, Andreas D .Ioannidis National and Kapodistrian \nUniversity of Athens, Greece Linnaeus University, Sweden PIERS 2013, Stockholm, Sweden \nEftychia Argyropoulou (UoA) The eigenvalue problem for a bianisotropic cavity 12–15 August \n2012 1 / 21 Page 2 Formulation Let Ω be filled with a bianisotropic material. Eftychia \nArgyropoulou (UoA) The eigenvalue problem for a bianisotropic cavity 12–15 August 2012 2 / 21 \nPage 3 Formulation Let Ω be filled with a bianisotropic material. Bianisotropic materials: optically \nactive, meaning they can twist the polarization of light in either refraction or transmission. This is \na consequence of the fact that electric and magnetic fields are coupled. Eftychia Argyropoulou \n(UoA) The eigenvalue problem for a bianisotropic cavity 12–15 August 2012 2 / 21 Page (…",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Chapter Eleven. Nonlinear Problems",
            "Publication year": 2012,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/9781400842650.231/html",
            "Abstract": "Nonlinearity is inherent in nature and accounts for a number of interesting phenomena. To keep within the context of electromagnetic media, nonlinearity appears in a number of cases in which the dispersion relations or equivalently the coefficients of the constitutive relations change as a function of the field amplitudes. This behaviour is very common in dielectrics, where it has been experimentally verified, theoretically studied, and widely studied mathematically. Furthermore, the interplay between dispersion and nonlinearity in dielectrics has led to the observation of solitary waves, which has important applications to optical communications. Regarding chiral media, although third-order nonlinear effects were predicted as early as 1967, nonlinear optical rotation experiments were not undertaken before 1993. Out of a long list, the papers [313] and [314] can serve as representative of related important experimental …",
            "Abstract entirety": 0,
            "Author pub id": "hlS6MNcAAAAJ:geHnlv5EZngC",
            "Publisher": "Princeton University Press"
        },
        {
            "Title": "Homogenisation theory for deterministic and random bianisotropic media",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359836811005464",
            "Abstract": "Homogenisation theory may play an important role in the understanding, modelling and design of multifunctional materials. A homogenisation theory for periodic and random bianisotropic electromagnetic media is presented. Starting with a formal two-scale approach we motivate an auxiliary elliptic homogenisation problem which plays a crucial role in the construction of the homogenised bianisotropic medium which is subsequently supported by rigorous mathematical arguments based on the notion of weak convergence. Comments on the potential implementation of this theory in the modelling of complex electromagnetic media are provided.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:blknAaTinKkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Electromagnetic scattering by a homogeneous chiral obstacle in a chiral environment",
            "Publication year": 2000,
            "Publication url": "https://academic.oup.com/imamat/article-abstract/64/3/245/654345",
            "Abstract": "Time-harmonic electromagnetic waves are scattered by a homogeneous chiral obstacle embedded in a chiral environment. The corresponding transmission problem is reduced, via Bohren's decomposition, to an integral equation over the interface between the obstacle and the surrounding medium. This integral equation is shown to be uniquely solvable except for a discrete set of electromagnetic parameters of the obstacle.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Special Issue on Applied Mathematics",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.3066",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electromagnetic fields in linear and nonlinear chiral media: a time-domain analysis",
            "Publication year": 2004,
            "Publication url": "https://downloads.hindawi.com/books/9789775945143.pdf#page=224",
            "Abstract": "We present several recent and novel results on the formulation and the analysis of the equations governing the evolution of electromagnetic fields in chiral media in the time domain. In particular, we present results concerning the well-posedness and the solvability of the problem for linear, time-dependent, and nonlocal media, and results concerning the validity of the local approximation of the nonlocal medium (optical response approximation). The paper concludes with the study of a class of nonlinear chiral media exhibiting Kerr-like nonlinearities, for which the existence of bright and dark solitary waves is shown.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scattering relations for point-generated dyadic fields in two-dimensional linear elasticity",
            "Publication year": 2006,
            "Publication url": "https://www.ams.org/distribution/qam/2006-64-04/S0033-569X-06-01041-0/home.html",
            "Abstract": "The problem of scattering of elastic waves by a bounded obstacle in two-dimensional linear elasticity is considered. The scattering problems are presented in a dyadic form. An incident dyadic field generated by a point source is disturbed by a rigid body, a cavity, or a penetrable obstacle. General scattering theorems are proved, relating the far-field patterns due to scattering of waves from a point source set up in either of two different locations. The most general reciprocity theorem is established, and mixed scattering relations are also proved. Finally, a relation between the incident and the scattered wave which refers to the mechanism of energy transfer of the scatterer, the so-called optical theorem, is established.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On equilibria of the two-fluid model in magnetohydrodynamics",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:MPAG.0000024670.67327.0f",
            "Abstract": "We show how the equilibria of the two-fluid model in magnetohydrodynamics can be described by the double curl equation and through the study of this equation we study some properties of these equilibria.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Well posedness of the stochastic Drude-Born-Fedorov model in electromagnetics",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Stratis/publication/257141657_Well_posedness_of_the_stochastic_Drude-Born-Fedorov_model_in_electromagnetics/links/02e7e5273c45b3ee1c000000/Well-posedness-of-the-stochastic-Drude-Born-Fedorov-model-in-electromagnetics.pdf",
            "Abstract": "In this work we present some results on the stochastic Drude-Born-Fedorov (DBF) model for the evolution of electromagnetic fields in chiral media, in the time domain. The problem reduces to a Cauchy problem for a Sobolev type stochastic evolution equation with additive noise. We show that the problem is strongly well posed.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pseudoparabolic equations with additive noise and applications",
            "Publication year": 2009,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.1077",
            "Abstract": "In this work we present some results on the Cauchy problem for a general class of linear pseudoparabolic equations with additive noise. We consider questions of existence and uniqueness of mild and strong solutions and well posedness for this problem. We also prove the existence and uniqueness of mild and strong solutions for a related perturbed Cauchy problem and we investigate the continuity of the solution with respect to a small parameter. The abstract results are illustrated using examples from electromagnetics and heat conduction. Copyright © 2008 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:aqlVkmm33-oC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "On an interior Calderón operator and a related Steklov eigenproblem for Maxwell's equations",
            "Publication year": 2020,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/19M1251370",
            "Abstract": "We discuss a Steklov-type problem for Maxwell's equations  which is related to an interior Calderón operator and an appropriate Dirichlet-to-Neumann map. The corresponding Neumann-to-Dirichlet map turns out to be compact, and this provides a Fourier basis of Steklov eigenfunctions for the associated energy spaces.  With an   approach  similar to that developed by G. Auchmuty for the Laplace operator,  we provide natural spectral representations for the appropriate trace spaces, for the Calderón operator itself, and for the solutions of the corresponding boundary value problems subject to electric or magnetic boundary conditions on a cavity.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:08ZZubdj9fEC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "On the error of the optical response approximation in chiral media",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/0003681031000151443",
            "Abstract": "We study the equations modelling the evolution of electromagnetic fields in chiral media with dispersion. We prove existence and uniqueness of solutions of these equations and provide estimates for the error of the optical response approximation for chiral media.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "On the relation of the solutions of the chiral and the achiral electromagnetic transmission problems for small chirality",
            "Publication year": 2000,
            "Publication url": "https://www.dl.begellhouse.com/journals/0632a9d54950b268,2fb4c18d238f67a7,063bdcd358b78624.html",
            "Abstract": "The convergence of the solution of the transmission problem describing the scattering of a plane, time-harmonic, electromagnetic wave by a penetrable chiral obstacle (obeying the Tellegen constitutive relations) to the solutions of the corresponding classical transmission problem (for an achiral obstacle) as the chirality parameter goes to zero is established.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Begel House Inc."
        },
        {
            "Title": "An application of the reciprocity gap functional to inverse mixed impedance problems in elasticity",
            "Publication year": 2010,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0266-5611/26/8/085011/meta",
            "Abstract": "In this paper, a mixed impedance scattering problem for partially coated obstacles is studied. We formulate the direct scattering problem for the Navier equation and the mathematical setting for the description of the inverse problem. The scattered field satisfies mixed Dirichlet-impedance boundary conditions on the smooth boundary of the scatterer. A uniqueness theorem for the determination of the partially coated obstacle is proved. A method for the reconstruction of the shape of the obstacle is presented, for which no a priori information of the physical parameters of the scattering obstacle is needed. The inverse problem is treated using ideas from the linear sampling method and by the use of the reciprocity gap functional. Further, a characterization of the surface impedance is established.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Scattering relations for point sources: acoustic and electromagnetic waves",
            "Publication year": 2002,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1509089",
            "Abstract": "The problem of scattering of spherical waves by a bounded obstacle is considered. General scattering theorems are proved. These relate the far-field patterns due to scattering of waves from a point source put in any two different locations. The scatterer can have any of the usual properties, penetrable or impenetrable. The optical theorem is recovered as a corollary. Mixed scattering relations are also established, relating the scattered fields due to a point source and a plane wave.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "On the 1-dim Defocusing NLS Equation with Non-vanishing Initial Data at Infinity",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-26748-3_19",
            "Abstract": "We show global well-posedness of certain type of strong-in-time and weak-in-space solutions for the Cauchy problem of the 1-dimensional nonlinear Schrödinger equation, in various cases of open sets, bounded and unbounded. These solutions do not vanish at the boundary or at infinity.",
            "Abstract entirety": 1,
            "Author pub id": "hlS6MNcAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer, Cham"
        }
    ]
}]