[{
    "name": "Ιωάννης Ανδρεάδης ",
    "romanize name": "Ioannis Andreadis ",
    "School-Department": "Ηλεκτρολόγων Μηχ & Μηχ Υπολογιστών",
    "University": "duth",
    "Rank": "Καθηγητής",
    "Apella_id": 6006,
    "Scholar name": "Ioannis Andreadis",
    "Scholar id": "3wMEVMMAAAAJ",
    "Affiliation": "Unknown affiliation",
    "Citedby": 3118,
    "Interests": [
        "Intelligent sytems",
        "Machine vision"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=3wMEVMMAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "New fuzzy color median filter",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s10846-005-9901-8",
            "Abstract": " Median filters are widely used in color image processing. In this paper a new fuzzy median filter is introduced, suitable for the removal of impulse noise in color images. In order to apply a median operator, some kind of ordering of vectors is required. Thus, a vector ordering scheme in the HSV color space using fuzzy if-then rules is described and then the median value operator is defined. The weighted fuzzy median is also studied. This filter performs significantly better in impulse noise removal, compared to other reported median filters. Experimental and comparative results of the application of the proposed filter and other similar reported filters, exhibit the superiority of the proposed method when applied to degraded color images. ",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:sSrBHYA8nusC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Seismic Cellular Automata",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-27270-2_20",
            "Abstract": "The proposed cellular automata driven potential-basedmodel for earthquake simulation is a dynamic system constituted of cells-charges. It is assumed that the system balances through the exercitation of electrostatic Coulomb-forces among charges, without the existence of any other form of interconnection in-between. Such kinds of forces are also responsible for this level to be bonded with a rigid but moving plane below.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Multithresholding of color and gray-level images through a neural network technique",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0262885699000153",
            "Abstract": "One of the most frequently used methods in image processing is thresholding. This can be a highly efficient means of aiding the interpretation of images. A new technique suitable for segmenting both gray-level and color images is presented in this paper. The proposed approach is a multithresholding technique implemented by a Principal Component Analyzer (PCA) and a Kohonen Self-Organized Feature Map (SOFM) neural network. To speedup the entire multithresholding algorithm and reduce the memory requirements, a sub-sampling technique can be used. Several experimental and comparative results exhibiting the performance of the proposed technique are presented.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Soft morphological filtering using a fuzzy model and its application to colour image processing (vol 6, pg 257, 2004)",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=10362151079450470416&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "SPRINGER"
        },
        {
            "Title": "Neuro-fuzzy techniques for the classification of earthquake damages in buildings",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0263224110000527",
            "Abstract": "The identification of damages produced by severe earthquakes on constructions is important for several reasons such as public safety, economical recourses management, infrastructure and urban planning. After the manifestation of an earthquake, engineers have to evaluate the safety of existing structures and decide the actions to be taken. In this study two techniques are proposed for automatic damage classification in buildings. The inherent information contained in accelerograms is described by 20 seismic parameters. Two classification models of earthquake damages based on artificial neural networks and neuro-fuzzy systems were designed. Furthermore, they were tested for their effectiveness to classify structural, architectural, mechanical–electrical-plumbing and contents damages. The proposed systems were trained and tested with three reinforced concrete frame structures. Results show correct …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "2007 Index IEEE Transactions on Instrumentation and Measurement Vol. 56",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4397159/",
            "Abstract": "This index covers all technical items - papers, correspondence, reviews, etc. - that appeared in this periodical during the year, and items from previous years that were commented upon or corrected in this year. Departments and other items may also be covered if they have been judged to have archival value. The Author Index contains the primary entry for each item, listed under the first author's name. The primary entry includes the coauthors' names, the title of the paper or other item, and its location, specified by the publication abbreviation, year, month, and inclusive pagination. The Subject Index contains entries describing the item under all appropriate subject headings, plus the first author's name, the publication abbreviation, month, and year, and inclusive pages. Note that the item title is found only under the primary entry in the Author Index.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Log-Polar interpolation applied to image scaling",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4258810/",
            "Abstract": "This paper proposes a bio-inspired interpolation algorithm suitable for image scaling. A log-polar neighbor model is adopted, utilizing the feature of applying larger weights to pixels at the center of the interpolation region and logarithmically decreasing weights to pixels away from the center. The interpolation is performed in the Cartesian plane without requiring the full transformation of the image to the log-polar plane. Experiments show that in both visual comparisons and quantitative analysis, the results extracted by the proposed log-polar neighbor model are better than those extracted from pixel repetition, bilinear and bicubic interpolation.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:Fu2w8maKXqMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware implementations of membership function generators for fuzzy systems",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=2559670820554139718&hl=en&oi=scholarr",
            "Abstract": "The rapid utilization of fuzzy inference systems in soft computing has led to their extensive analog and digital hardware implementations. One of the most critical elements in a fuzzy inference system is the membership function generator. The demands in robustness, efficiency and modularity make the digital implementations a complicate task, especially for nonlinear function approximators. In this paper a detailed discussion of different reported digital membership functions generators is presented. Furthermore, a new dynamically programmable circuit capable of accurately approximating Gaussian membership function is presented. The proposed hardware structure is implemented in a field programmable gate array (FPGA) chip and is based on a sequence of pipeline stages and parallel processing, in order to minimize computational times. Its main features are the ability of accurate approximation of the Gaussian …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy inference systems for automatic classification of earthquake damages",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16239-8_48",
            "Abstract": "This paper presents efficient models in the area of damage potential classification of seismic signals. After an earthquake, one of the most important actions that authorities must take is to inspect structures and estimate the degree of damages. The interest is obvious for several reasons such as public safety, economical recourses management and infrastructure. This approach provides a comparative study between the Mamdani-type and Sugeno-type fuzzy inference systems (FIS). The fuzzy models use a set of artificial accelerograms in order to classify structural damages in a specific structure. Previous studies propose a set of twenty well-known seismic parameters which are essential for description of the seismic excitation. The proposed fuzzy systems use an input vector of twenty seismic parameters instead of the earthquake accelerogram and produce classification rates up to 90%. Experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:BqipwSGYUEgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Digital image stabilization by independent component analysis",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5282563/",
            "Abstract": "In this paper, we propose a novel digital-image-stabilization scheme based on independent component analysis (ICA). The method utilizes ICA and information obtained from the image sequence to deconvolve the ego-motion from the unwanted motion of the sequence. We notice that the motion observed in image sequences captured from consumer electronics such as handheld cameras and third-generation mobile phones is mainly caused by two independent motions: the camera motion (ego-motion) and the undesired hand jitter (high-frequency motion). The extensive and successful application of ICA in both the statistical and the signal processing community has helped us to realize that the independence property of these two primary signals facilitates the application of ICA for deconvolution by maximizing their statistical independence. Sets of estimated local motion vectors of the sequence are introduced to …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Artificial accelerograms composition based on the CEEMD",
            "Publication year": 2018,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0142331216654533",
            "Abstract": "In this work, a new methodology for generating spectrum-compatible accelerograms is presented. The proposed methodology considers the non-stationary and non-linear characteristics of seismic signals and utilizes the Hilbert–Huang transform (HHT) to analyse them. The two reported drawbacks of HHT, i.e. the mode mixing phenomenon and the end effects issue, are resolved through the proposed methodology. More specifically, the advantages of the recently introduced complementary ensemble empirical mode decomposition (CEEMD) are exploited in order to eliminate the mode mixing phenomenon. Moreover, the application of the proposed method only to the strong motion duration of the seismic signal assists to overcome the end effects issue. Thirty natural seismic records of different characteristics, such as frequency content, amplitude and duration, are employed as initial seed signals to demonstrate the …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:35N4QoGY0k4C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Laboratory of Electronics Section of Electronics and Information Systems Technology",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=2434634904681775652&hl=en&oi=scholarr",
            "Abstract": "Mathematical morphology is a powerful tool for image processing and analysis of binary, grey-scale and colour images. In this paper a fuzzy model for morphological colour image processing is presented. The basic morphological operations are defined by means of a vector ordering scheme that uses fuzzy if-then rules. Illustrative examples that exhibit the applicability of the technique in impulse noise removal, colour image skeletonisation, edge detection problems and top-hat transformation are demonstrated. Hardware implementation issues suitable for real-time application are also included.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:4MWp96NkSFoC",
            "Publisher": "Pergamon Press"
        },
        {
            "Title": "An intelligent system for aerial image retrieval and classification",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_8",
            "Abstract": "Content based image retrieval is an active research area of pattern recognition. A new method of extracting global texture energy descriptors is proposed and it is combined with features describing the color aspect of texture, suitable for image retrieval. The same features are also used for image classification, by its semantic content. An exemplar fuzzy system for aerial image retrieval and classification is proposed. The fuzzy system calculates the degree that a class, such as sea, clouds, desert, forests and plantations, participates in the input image. Target applications include remote sensing, computer vision, forestry, fishery, agricultures, oceanography and weather forecasting.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Image retrieval based on fuzzy color histogram processing",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401804013069",
            "Abstract": "Content-based image retrieval (CBIR) is a collection of techniques for retrieving images on the basis of features, such as color, texture and shape. An efficient tool, which is widely used in CBIR, is that of color image histograms. The classic method of color histogram creation results in very large histograms with large variations between neighboring bins. Thus, small changes in the image might result in great changes in the histogram. Moreover, the fact that each color space consists of three components leads to 3-dimensional histograms. Manipulating and comparing 3D histograms is a complicated and computationally expensive procedure. The need, therefore, for reduction of the three dimensions to one could lead to efficient approaches. This procedure of projecting the 3D histogram onto one single-dimension histogram is called histogram linking. In this paper, a new fuzzy linking method of color histogram …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:8AbLer7MMksC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Application of artificial intelligence methods to content-based image retrieval",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780123859815000033",
            "Abstract": "Every single day, millions of people worldwide create a vast amount of digital images and the need to index and retrieve these images has become more than obvious. The majority of retrieval systems are based on descriptors created by aggregating certain amounts of a specific feature from the image itself, thus creating a representation of its content. Over the years, many conventional probabilistic methods have been proposed that attempt to solve the problem of image retrieval. In this chapter, a variety of such methods are presented to pave the path that eventually will lead to an answer of whether or not artificial intelligence (AI) methods such as fuzzy logic are the correct way to proceed to enhance the image retrieval process. Moreover, since an abundance of swarm intelligence techniques have been used to find a solution for many non-deterministic polynomial time–complete problems, a discussion is being …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Assessment and Localization of Structural Damage in r/c Structures through Intelligent Seismic Signal Processing",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08839514.2021.1935589",
            "Abstract": "In this work, a novel approach in post-earthquake structural damage estimation is investigated. The approach is formulated as a problem of both damage approximation and localization. The inter-story drift ratio and the global damage index of Park/Ang (DIG,PA) are the estimated damage indicators for each floor of the structure. Artificial neural networks (ANNs), random forests (RFs), support vector machines (SVMs) with linear and radial basis function (RBF) kernels and adaptive neuro-fuzzy inference systems (ANFISs) are tested to predict the seismic damage state of each floor of an 8-storey reinforced concrete (r/c) building subjected to 155 natural and artificially generated seismic accelerograms. The damage potential of the accelerograms is described by three seismic parameters extracted from the response of the structure. The set of seismic accelerograms is defined by combining two outlier detection …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Fuzzy system for seismic signal classification",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/document/1610526/",
            "Abstract": "A new efficient technique for the classification of signals, in the form of earthquake-induced ground-acceleration time histories, according to the damage that they cause in buildings, is presented for the first time. A training set of real seismic accelerograms with well-known damage effects is utilised and fuzzy representations of prototype signals are extracted. These prototypes are selected with respect to the architectural and structural damage caused by the seismic-acceleration time histories. The classification of the unknown accelerograms takes place through a fuzzy comparison with the prototypes and each is classified to the most similar prototype. Real, seismic time-acceleration records were used for testing the algorithm and the high percentage of the correctly recognised signals prove the effectiveness of the algorithm. Correct classification rates of up to 84% are achieved.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IET"
        },
        {
            "Title": "Modelling earthquake activity features using cellular automata",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895717707000325",
            "Abstract": "Cellular automata (CA) are a powerful technique for modelling otherwise intractably complex systems. On the other hand, earthquake can be defined as a spatially extended dissipative dynamic system that naturally evolves into a critical state with no characteristic time or length scales. In this paper, a two-dimensional CA model capable of reproducing some prominent features of earthquake data is presented. The proposed model with continuous states and discrete time, comprises cell-charges and aims at simulating earthquake activity with the usage of potentials. Several measurements have been carried out at different critical states, leading to different paths to criticality, for various cascade (earthquake) sizes, various cell activities and different neighbourhood sizes. Most notably, the produced simulation results emulate the Gutenberg–Richter (GR) scaling law, in both quantitative and qualitative way. Furthermore …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Classification of seismic damages in buildings using fuzzy logic procedures",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-5134-7_20",
            "Abstract": "It is well-known that damage observations on buildings after severe earthquakes exhibit interdependence with the seismic intensity parameters. Numerical elaboration of structural systems quantified the interrelation degree by correlation coefficients. Further, the seismic response of buildings is directly depended on the ground excitation. Consequently, the seismic response of buildings is directly depended on the used accelerogram and its intensity parameters. Among the several response quantities, the focus is on the overall damage. Thus, the Maximum Inter-Storey Drift Ratio and the damage index of Park/Ang are used. Intervals for the values of the damage indices are defined to classify the damage degree in low, medium, large and total. This paper presents an Adaptive Neuro-Fuzzy Inference System for the damage classification. The seismic excitations are simulated by artificial accelerograms. Their …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Vector ordering and morphological operations for colour image processing: Fundamentals and applications",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1007/s100440200024",
            "Abstract": ": The extension of concepts of greyscale morphology to colour image processing requires the use of a proper ordering of vectors (colours) and the definitions of infimum and supremum operators in an appropriate colour space. In this paper, a new approach to colour image morphology is proposed. It is based on a new ordering of vectors in the HSV colour space that is partial ordering. The proposed approach is hue preserving, and it is not a component-wise technique. Its basic characteristic is that it is compatible to the standard greyscale morphology: its fundamental and secondary operations possess the same basic properties as their greyscale counterparts, and furthermore, it is identical to greyscale morphology when it is applied to greyscale images. Examples that illustrate the application of the defined operations to colour images are provided. Moreover, the usefulness of the new method in various …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer-Verlag London Limited"
        },
        {
            "Title": "Cellular automata model with game theory for power management of hybrid renewable energy smart grids",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11520-7_26",
            "Abstract": "In recent years, control of smart grids that match electricity demand in different sites and forms with supply has been considered as one of the most difficult aspect of smart energy grids design. In this paper we present a Cellular Automata (CA) based approach combined with Game Theory for the enhancement of Power Management Strategies (PMSs) of multiple Hybrid Renewable Energy Systems (HYRES) that form a smart grid for the exchange of energy. More specifically, taking advantage of the local interactions of HYRES we coupled CA principles with Public Goods Game (PGG) for modeling. The presented CA model focuses on providing valuable feedback for PMSs of the understudy HYRES connected in a grid. In this manner, a flexible network based HYRES design is considered and applied to specific HYRESs located in Olvio, near Xanthi, Greece, part of SYSTEMS SUNLIGHT facilities. The …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:evX43VCCuoAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A new vector median filter for colour image processing",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865500001410",
            "Abstract": "In this paper a new vector median filter suitable for colour image processing is presented. It is based on a new ordering of vectors in the HSV colour space. Illustrative and comparative examples of degraded colour image restoration are also provided.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:xtRiw3GOFMkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Real-time disparity map computation module",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014193310700124X",
            "Abstract": "Stereo vision deals with images acquired by a stereo camera setup, where the disparity between the stereo images allows depth estimation within a scene. 3D information, hence, is retrieved which is essential in many machine vision applications. Disparity map extraction of an image is a computationally demanding task. Previous work on disparity map computation is mainly limited to software based techniques on general-purpose architectures. In this paper a new hardware-efficient real-time disparity map computation module is developed. This enables a hardware-based cellular automata (CA) parallel-pipelined design, for the overall module, realized on a single FPGA device, the typical operating frequency of which is 256 MHz. Accurate disparity maps are computed at a rate of nearly 275 per second, for a stereo image pair with a disparity range of 80 pixels and 640 × 480 pixels spatial resolution. The presented …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Development of a stereo vision system for remotely operated robots: A control and video streaming architecture",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4592745/",
            "Abstract": "This paper describes the open and flexible architecture of a stereo vision system prototype, using open source software. The system is designed for teleoperated robots and includes a four degrees of freedom stereo head mechanism, a pair of high performance digital cameras, a head tracker and a head mounted display. All processes for the head control and video streaming are performed in Linux-based Real-time Operating Systems using open source libraries under GPL license. Experimental results showed that our system is capable of satisfying the hard-real time requirements for the head control, with great precision, and a low latency for the stereo video streaming. The video streaming management is particularly sophisticated resulting in a flexible, efficient and reliable service.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cellular ants: A method to create collision free trajectories for a cooperative robot team",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921889010001727",
            "Abstract": "Creating collision-free trajectories for mobile robots, known as the path planning problem, is considered to be one of the basic problems in robotics. In case of multiple robotic systems, the complexity of such systems increases proportionally with the number of robots, due to the fact that all robots must act as one unit to complete one composite task, such as retaining a specific formation. The proposed path planner employs a combination of Cellular Automata (CA) and Ant Colony Optimization (ACO) techniques in order to create collision-free trajectories for every robot of a team while their formation is kept immutable. The method reacts with obstacle distribution changes and therefore can be used in dynamical or unknown environments, without the need of a priori knowledge of the space. The team is divided into subgroups and all the desired pathways are created with the combined use of a CA path planner and an …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:u-x6o8ySG0sC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Cellular Robotic Ants Synergy Coordination for Path Planning",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-10924-4_9",
            "Abstract": "In this chapter, a unified architecture is proposed for a robot team in order to accomplish several tasks based on the application of an enhanced Cellular Automata (CA) path planner. The presented path planner can produce adequate collision-free pathways with minimum hardware resources and low complexity levels. During the course of a robot team to its final destination, dynamic obstacles are detected and avoided in real time as well as coordinated movements are executed by applying cooperations in order to maintain the team’s initial formation. The inherit parallelism and simplicity of CA result in a path planner that requires low computational resources and thus, its implementation in miniature robots is straightforward. Cooperations are limited to a minimum so that further resource reduction can be achieved. For this purpose, the basic fundamentals of another artificial intelligence method, namely Ant …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Adaptive reverse engineering of gene regulatory networks using genetic algorithms",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1629947/",
            "Abstract": "An increasingly popular model of regulation is to represent networks of genes as if they directly affect each other. Although such gene networks are phenomenological because they do not explicitly represent the proteins and metabolites that mediate cell interactions, they are a logical way of describing phenomena observed with transcription profiling. In this paper, we present a computational tool, based on genetic algorithms (GAs), which is able to predict with observed data the regulatory pathways that are represented as influence matrix. The ability to create gene networks from experimental data and use them to reason about their dynamics and design principles increase our understanding of cellular function",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Non-linear image processing in hardware",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320399001612",
            "Abstract": "A new ASIC capable of computing rank order filters, weighted rank order filters, standard erosion and dilation, soft erosion and dilation, order statistic soft erosion and dilation, fuzzy erosion and dilation and fuzzy soft erosion and dilation is presented in this paper. Its function is based on local histogram and a successive approximation technique and performs on 3×3-pixel image windows. The hardware complexity of the proposed structure is linearly related to both image data window size and pixel resolution. The dimensions of the core of the proposed ASIC are 2.88 mm×2.8 mm=8.06 mm2 and its die size dimensions are 3.72 mm×3.64 mm=13.54 mm2. It executes 3.5×106 non-linear filter operations per second.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Colour histogram content-based image retrieval and hardware implementation",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/document/1251657/",
            "Abstract": "With the ongoing development of multimedia technology, the number of information systems containing image retrieval functions is increasing rapidly. Techniques of colour histogram content-based image retrieval are compared in terms of speed and efficiency, and a modified approach based on a composite colour image histogram processing is introduced. The proposed approach is fast and provides results comparable to those of much slower algorithms. Furthermore, a novel pipelined hardware structure has been designed and implemented on an FPGA, to increase the operation speed and make the technique suitable for real-time applications. The typical clock frequency of this device is 35 MHz and it can perform over 50 comparisons of 640/spl times/480-pixel images per second",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:0EnyYjriUFMC",
            "Publisher": "IET"
        },
        {
            "Title": "Real-Time Biologically-Inspired Image Exposure Correction",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12267-5_8",
            "Abstract": "This chapter presents a real-time FPGA implementation of a biologically-inspired image enhancement algorithm. The algorithm compensates for the under/over-exposed image regions, emerging when High Dynamic Range (HDR) scenes are captured by contemporary imaging devices. The transformations of the original algorithm, which are necessary in order to meet the requirements of an FPGA-based hardware system, are presented in detail. The proposed implementation, which is synthesized in Altera’s Stratix II GX: EP2SGX130GF1508C5 FPGA device, features pipeline architecture, allowing the real-time rendering of color video sequences (25fps) with frame sizes up to 2.5Mpixels.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Sample copy",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=11004367514453895555&hl=en&oi=scholarr",
            "Abstract": "Feature extraction from seismic accelerograms is a key issue in characterization of earthquake damage in structures. Until today, a number of effective classical parameters such as peak ground acceleration (PGA) and Arias intensity have been proposed for analyzing the earthquake motion records. The aim of this paper is to search for new crucial characteristic seismic parameters which provide information pertinent to the damage indicators of the structures. The first proposed parameter is the maximum amplitude (AHHT max) and the second is the mean amplitude (AHHT mean). Emphasis of our work has been placed on the use of the Hilbert–Huang transform (HHT). A set of 13 natural accelerograms from worldwide well-known sites with strong seismic activity have been used. The HHT has been applied to the nonlinear and non-stationary data (earthquake recordings). Each complex seismic accelerogram is decomposed into several simple components called intrinsic mode functions (IMFs). Using the IMFs a three-dimensional time–frequency distribution of earthquake excitation is computed and two new seismic parameters are proposed and evaluated. After the numerical computation of all the seismic parameters (classical and proposed), nonlinear dynamic analysis is carried out to provide the post-seismic damage status of the structure under study. Two structural damage indices are utilized and the degree of interrelation among them and the seismic parameters is provided by correlation coefficients. Furthermore, two different reinforced concrete structures are examined. Results indicate the high correlation of the new seismic parameters …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A real-time occlusion aware hardware structure for disparity map computation",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04146-4_77",
            "Abstract": "Many machine vision applications deal with depth estimation in a scene. Disparity map recovery from a stereo image pair has been extensively studied by the computer vision community. Previous methods are mainly restricted to software based techniques on general-purpose architectures, presenting relatively high execution time due to the computationally complex algorithms involved. In this paper a new hardware module suitable for real-time disparity map computation module is realized. This enables a hardware based occlusion-aware parallel-pipelined design, implemented on a single FPGA device with a typical operating frequency of 511 MHz. It provides accurate disparity map computation at a rate of 768 frames per second, given a stereo image pair with a disparity range of 80 pixels and 640x480 pixel spatial resolution. The proposed method allows a fast disparity map computational module to be …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Image analysis using moments",
            "Publication year": 2005,
            "Publication url": "http://icta05.teithe.gr/papers/65.pdf",
            "Abstract": "Moments of images provide efficient local descriptors and have been used extensively in image analysis applications. Their main advantage is their ability to provide invariant measures of shape. In this work, we present an overview of the most commonly used image moments, as well as a hardware architecture capable of fast calculation of geometric, Zernike and Tchebichef moments.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Intelligent Impulse Noise Detection and Elimination Algorithm",
            "Publication year": 2007,
            "Publication url": "http://www.dynamicpublishers.com/Neural/NPSC2007/30-NPSC-2007-479-488.pdf",
            "Abstract": "The algorithm presented in this paper uses fuzzy logic techniques in order to detect impulse noise and emphasises on the reduction of the computational complexity required in the noise suppression scheme. The algorithm is applicable to both greyscale and colour images and outperforms similar reported techniques.The need to obtain a noise free image after transmission through a noisy channel or because of image capture devises malfunction is important for its further process. Several impulse detection algorithms that utilise fuzzy logic have been presented in the literature. An indeed efficient technique suitable for impulse noise detection and removal using fuzzy techniques has been reported in [I]. This first detects possible noise contaminated pixels in the image and then it uses a special kind of information redundancy-long range correlation within different parts of the image in order to suppress noise. The algorithm proposed in this paper uses more advanced fuzzy techniques in the noise detection part. Each pixel is characterised by a fuzzy flag that indicates the degree of noise presence by a more effective membership function. Furthermore, the shape of the function is modified, leading to a better discrimination against impulse noise affected pixels. The noise elimination part that follows operates only on the pixels that have been detected previously and its function is to add or subtract an appropriate value from the noisy pixels and restore them to their former state before noise contamination. According to the PSNR (peak-signal-to-noise-ratio) and MSE (Mean-squared-error) indexes, the proposed algorithm is effective and outperforms …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:kRWSkSYxWN8C",
            "Publisher": "DYNAMIC PUBLISHER, INC"
        },
        {
            "Title": "Non-parametric confidence estimates for the Gini–Simpson measure of sparsity",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/document/8278059/",
            "Abstract": "Assessment of the quality of local estimates of data sparsity is central for various adaptive algorithms in signal processing. Empirical bounds for the estimation performance of a frequently used measure of sparsity, namely the Gini–Simpson index are derived. Confidence bounds are derived for an unbiased estimator of this measure, with exponential convergence to the true (unknown) sparsity value, as the number of samples increases. The analysis is distribution-free, as no parametric or distributional assumptions are made for the available data.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:zLWjf1WUPmwC",
            "Publisher": "IET"
        },
        {
            "Title": "A cellular automaton model for crowd evacuation and its auto-defined obstacle avoidance attribute",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15979-4_48",
            "Abstract": "In this paper, a crowd evacuation model based on Cellular Automata (CA) is described. The model takes advantage of the inherent ability of CA to represent sufficiently phenomena of arbitrary complexity and to be simulated precisely by digital computers as well. Pedestrian movement depends on their distance from the closest exit, which is defined dynamically. The adoption of Manhattan distance as the reference metric provides calculation simplicity, computational speed and improves significantly computational performance. Moreover, the model applies an efficient method to overcome obstacles. The latter is based on the generation of a virtual field along obstacles. A pedestrian moves along the axis of the obstacle towards the direction that the field increases its values, leading her/him to avoid the obstacle effectively. Distinct features of crowd dynamics and measurements on different distributions of …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An intelligent image retrieval system based on the synergy of color and artificial ant colonies",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73040-8_88",
            "Abstract": "In this paper a new image retrieval algorithm is proposed which aims to discard irrelevant images and increase the amount of relevant ones in a large database. This method utilizes a two-stage ant colony algorithm employing in parallel color, texture and spatial information. In the first stage, the synergy of the low-level descriptors is considered to be a group of ants seeking the optimal path to the “food” which is the most similar image to the query, whilst settling pheromone on each of the images that they confront in the high similarity zone. In the second stage additional queries are made by using the highest ranked images as new queries, resulting in an aggregate deposition of pheromone through which the final retrieval is performed. The results prove the system to be satisfactorily efficient as well as fast.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Parametric optimisation in a 2-D cellular automata model of fundamental seismic attributes with the use of genetic algorithms",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0965997811000597",
            "Abstract": "A two-dimensional (2-D) cellular automata (CA) dynamic system constituted of cells-charges has been proposed for the simulation of the earthquake process. In this paper, the study is focused on the optimal parameterisation of the model introducing the use of genetic algorithm (GA). The optimisation of the CA model parameterisation, by applying a standard GA, extends its ability to study various hypotheses concerning the seismicity of the region under consideration. The GA evolves an initially random population of candidate solutions of model parameters, such that in time appropriate solutions to emerge. The quality criterion is realised by taking into account the extent that the simulation results match the Gutenberg–Richter (GR) law derived from recorded data of the area under test. The simulation results presented here regard regions of Greece with different seismic and geophysical characteristics. The results …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:rO6llkc54NcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A new approach to morphological color image processing",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320301001662",
            "Abstract": "This paper presents a new approach to the generalization of the concepts of grayscale morphology to color images. A new vector ordering scheme is proposed, infimum and supremum operators are defined, and the fundamental vector morphological operations are extracted. The basic properties of the presented vector morphology are described and its similarities to grayscale morphological operators are pointed out. The main advantages of the proposed methodology are that is vector preserving and provides improved results in many morphological applications. Furthermore, experimental results demonstrate the applicability of the proposed technique in a number of image processing and analysis problems, such as noise removal, edge detection and skeleton extraction.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:35r97b3x0nAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A new content based median filter",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7079776/",
            "Abstract": "In this paper the hardware implementation of a content based median filter suitable for real-time impulse noise suppression is presented. The function of the proposed circuitry is adaptive; it detects the existence of impulse noise in an image neighborhood and applies the median filter operator only when necessary. In this way, the blurring of the image in process is avoided and the integrity of edge and detail information is preserved. The proposed digital hardware structure is capable of processing gray-scale images of 8-bit resolution and is fully pipelined, whereas parallel processing is used to minimize computational time. The architecture presented was implemented in FPGA and it can be used in industrial imaging applications, where fast processing is of the utmost importance. The typical system clock frequency is 55 MHz.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast automatic compensation of under/over-exposured image regions",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-77129-6_45",
            "Abstract": "This paper presents a new algorithm for spatially modulated tone mapping in Standard Dynamic Range (SDR) images. The method performs image enhancement by lightening the tones in the under-exposured regions while darkening the tones in the over-exposured, without affecting the correctly exposured ones. The tone mapping function is inspired by the shunting characteristics of the center-surround cells of the Human Visual System (HVS). This function is modulated differently for every pixel, according to its surround. The surround is calculated using a new approach, based on the oriented cells of the HVS, which allows it to adapt its shape to the local contents of the image and, thus, minimize the halo effects. The method has low complexity and can render 1MPixel images in approximately 1 second when executed by a conventional PC.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Binary, gray-scale, and vector soft mathematical morphology: extensions, algorithms, and implementations",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1076567001800859",
            "Abstract": "This chapter discusses standard morphological operations, their algebraic properties, and fuzzy morphology. Soft morphological filters are a relatively new subclass of nonlinear filters. They were introduced to improve the behavior of standard morphological filters in noisy environments. Soft mathematical morphology and the definitions of vector soft morphological operations, their basic properties, and their use in color impulse noise attenuation are provided in the chapter. Several implementations of soft morphological filters and an implementation of vector morphological filters are analyzed in the chapter. Soft morphological operations are based on weighted order statistics. Algorithms for implementation of soft morphological operations include the well-known mergesort and quicksort algorithms for weighted order statistics computation. Fuzzy soft mathematical morphology applies the concepts …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:ipzZ9siozwsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Intelligent systems for structural damage assessment",
            "Publication year": 2020,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/jisys-2017-0193/html",
            "Abstract": "This research provides a comparative study of intelligent systems in structural damage assessment after the occurrence of an earthquake. Seismic response data of a reinforced concrete structure subjected to 100 different levels of seismic excitation are utilized to study the structural damage pattern described by a well-known damage index, the maximum inter-story drift ratio (MISDR). Through a time-frequency analysis of the accelerograms, a set of seismic features is extracted. The aim of this study is to analyze the performance of three different techniques for the set of the proposed seismic features: an artificial neural network (ANN), a Mamdani-type fuzzy inference system (FIS), and a Sugeno-type FIS. The performance of the models is evaluated in terms of the mean square error (MSE) between the actual calculated and estimated MISDR values derived from the proposed models. All models provide small MSE …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "A cellular automaton crowd tracking system for modelling evacuation processes",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11861201_82",
            "Abstract": "Crowd safety and comfort in highly congested places not only depend on the design and the function of the place, but also on the behaviour of each individual. In this paper, an integrated evacuation system is described. The proposed system comprises three stages. The main stage includes an efficient computational tool based on Cellular Automata (CA) capable of simulating main features of pedestrian dynamics during the evacuation of large areas, supported by a multi-parameterised graphical-user interface (GUI). Moreover, an image-processing tracking algorithm is used for the calibration of the system providing all the necessary information about the number of individuals and their distribution in the under test area. Finally, the VLSI implementation of the proposed model is straightforward due to the simplicity of the CA rule, thus leading to the design of a dedicated processor.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multi-exposure image fusion based on illumination estimation",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Vassilios-Vonikakis/publication/235350562_Multi-Exposure_Image_Fusion_Based_on_Illumination_Estimation/links/54c75e0d0cf238bb7d0a7b30/Multi-Exposure-Image-Fusion-Based-on-Illumination-Estimation.pdf",
            "Abstract": "This paper presents a new method for fusing two or more differently exposed images of a High Dynamic Range (HDR) scene. The method employs illumination estimation filtering, in order to assess the degree of “wellexposedness” of the pixels in the original image sequence. These initial estimations are then modulated by membership functions, which assign specific weights to the pixels of the image sequence. The membership functions favor the well-exposed pixels from each exposure, in order to maximize the visual information in the final result. The fused image is derived by interpolating between all the pixels, using the weights assigned by the membership functions. The experimental results show that the proposed algorithm preserves well the information from each exposure of the sequence, resulting to an image with extended information both in the shadows and in the highlights.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and implementation of a fuzzy area-based image-scaling technique",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4539284/",
            "Abstract": "In this paper, we propose the design and implementation of an interpolation scheme for performing image scaling by utilizing a dynamic mask combined with a sophisticated neighborhood averaging fuzzy algorithm. The functions that contribute to the final interpolated image are the areas of the input pixels, overlapped by a dynamic mask, and the difference in intensity between the input pixels. Fuzzy if-then rules for these two functions are presented to carry out the interpolation task. Simulation results have shown a fine high-frequency response and a low interpolation error, in comparison with other widely used algorithms. The interpolation can be applied to both gray-scale and color images for any scaling factor. The proposed hardware structure is implemented in a field-programmable gate array (FPGA) chip and is based on a sequence of pipeline stages and parallel processing to minimize computation times …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Artificial spectrum-compatible seismic accelerograms with characteristics similar to natural seismic signals",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Eleni-Vrochidou/publication/282357176_Artificial_Spectrum-Compatible_Seismic_Accelerograms_with_Characteristics_Similar_to_Natural_Seismic_Signals/links/560e3b3e08ae967420111a25/Artificial-Spectrum-Compatible-Seismic-Accelerograms-with-Characteristics-Similar-to-Natural-Seismic-Signals.pdf",
            "Abstract": "This paper deals with the relation of well-known seismic parameters and damage indices between two sets of data; a set of natural seismic signals and a set of artificial accelerograms generated from natural records. The Hilbert-Huang transform is utilized to produce the artificial spectrumcompatible earthquake time histories. Results reveal that the extracted seismic parameters of the artificial seismic accelerograms share the same degree of correlation with the damage indices as the natural seismic signals. Thus, the proposed technique can be a useful tool for generating realistic representations of seismic events.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cellular automaton collision-free path planner suitable for cooperative robots",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4621572/",
            "Abstract": "The settlement of the collision-free path planning problem is considered as a complicated objective and is of vital importance in systems comprising one or multiple robots. In multi-robots systems, the path planning problem is based on cooperation. In such systems, the robots dynamically exchange roles in order to complete complex tasks, such as moving in different formations. In this paper, a Cellular Automaton algorithm for solving the path planning problem in a multi-agent system is presented. Moreover, robots must cooperate to keep their initial formation if an unexpected event in the environment takes place. The proposed method was implemented in a real time system of three autonomous mobile robots. Simulation results and the results obtained from this system demonstrate the effectiveness of the method and its robustness.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware implementation of soft color image morphological operations",
            "Publication year": 2002,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-41/issue-7/0000/Hardware-implementation-of-soft-color-image-morphological-operations/10.1117/1.1482721.short",
            "Abstract": "A new hardware field programmable gate array (FPGA) structure suitable for the realization of soft color image morphological operations is presented for the first time. Data is processed in a pipelined array that performs fast soft vector erosion and dilation. The proposed hardware structure can process two-dimensional 24-bit resolution color images up to 4096 pixels wide, but it can be easily modified to accommodate larger images. MAXPLUS II software of the Altera Corporation is employed for design and simulation. The FPGA used is the EPF10K130VG599-3 Altera device. The typical clock frequency of operation is 40 MHz.© 2002 Society of Photo-Optical Instrumentation Engineers.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:70eg2SAEIzsC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Design and implementation of a fuzzy hardware structure for morphological color image processing",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1193044/",
            "Abstract": "A hardware implementation of a fuzzy processor suitable for morphological color image processing applications is presented for the first time. From the hardware point of view, only a small number of algorithms for hardware implementation of soft gray-scale morphological filters have been reported in the literature, since research in mathematical morphology focuses mainly on possible extensions of the standard definitions (e.g., color and fuzzy mathematical morphology). The proposed digital hardware structure is based on a sequence of pipeline stages, and parallel processing is used in order to minimize computational times. It is capable of performing the basic morphological operations of standard and soft erosion/dilation for color images of 24-bit resolution. For the computation of morphological operations, a 3 /spl times/ 3-pixel image neighborhood and the corresponding structuring element are used. However …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cellular automata for image resizing",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-06431-4_2",
            "Abstract": "During the last years, several methods have been applied to tackle the image resizing problem. Most of these methods are derived from image interpolation techniques for image enlargement. Among them, the edge-directed interpolation methods succeed to preserve the edges of the low resolution image and produce crisper results compared to the space invariantmodels. In this chapter, we present an edge-directed method which exploits the simplicity and the inherent parallelism of the Cellular Automata (CA) computational tool to generate high resolution images from low resolution acquired images. This task is accomplished with the help of the Canny Edge Detector so as to discriminate the edge regions from the homogenous ones. Moreover, appropriate CA states and transition rules were designed to evolve the CA, which, eventually, attempt to enhance the quality of the edge areas. The orientation of …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "2008 Index IEEE Transactions on Instrumentation and Measurement Vol. 57",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4671031/",
            "Abstract": "This index covers all technical items - papers, correspondence, reviews, etc. - that appeared in this periodical during the year, and items from previous years that were commented upon or corrected in this year. Departments and other items may also be covered if they have been judged to have archival value. The Author Index contains the primary entry for each item, listed under the first author's name. The primary entry includes the coauthors' names, the title of the paper or other item, and its location, specified by the publication abbreviation, year, month, and inclusive pagination. The Subject Index contains entries describing the item under all appropriate subject headings, plus the first author's name, the publication abbreviation, month, and year, and inclusive pages. Note that the item title is found only under the primary entry in the Author Index.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time computation of Zernike moments",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1435465/",
            "Abstract": "Zernike moments have been proven to be very powerful image descriptors. However, their computational complexity makes them unsuitable for real-time applications. In this paper, a mathematical relationship between geometric and Zernike moments is extracted. In this way, the computation of geometric moments is adequate to derive Zernike moments. Since geometric moments can be efficiently implemented in hardware and their calculation can be performed in real-time, we propose here a new real-time hardware architecture for the computation of Zernike moments. This method outperforms existing software approaches, especially for large images, allowing real-time processing of images up to 4 Mpixels.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:nrtMV_XWKgEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A color coordinate normalizer chip",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1008157318480",
            "Abstract": "The use of multispectral images of the same object considerably increases the opportunity for unique selection of features. The use of color information has been receiving growing attention. This paper presents the design and VLSI implementation of a new ASIC, which performs real-time conversion of the raw RGB data into the rgb normalized color coordinates. The high speed of operation is achieved by pipelining the data in a vector fashion. Eight-bit color images have been used, since this resolution is adequate for encoding the composite video signal without noticeable degradation. The inputs to the circuit are the RGB data obtained from a color sensor and digitized through three flash ADCs. The design has been implemented using the CADENCE VLSI CAD tool. The die size dimensions for the core of the chip are 1.87 mm × 1. 80 mm = 3. 37 mm2, for a DLM, 0.7 μm, N-well, CMOS technology and its …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:UHK10RUVsp4C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Design and implementation of a fuzzy-modified ant colony hardware structure for image retrieval",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4915788/",
            "Abstract": "In this paper, a hardware implementation of a fuzzy modified ant colony processor that is suitable for image retrieval is presented for the first time. The proposed method utilizes three different descriptors in a two stage fuzzy ant algorithm where the query image represents the nest and the database images represent the food. From the hardware point of view, only a small number of algorithms for hardware implementation have been reported in the image retrieval literature, since research focuses mainly on possible software solutions and the acceleration of existing algorithms. The proposed digital hardware structure is based on a sequence of pipeline stages, while parallel processing is also used in order to minimize computational times. It is capable of performing the extraction and comparison of features from (64times64)-pixel-size color images, although through a simple transformation it can be easily expanded …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Content-based image retrieval using cellular automata",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/43935726/67.pdf",
            "Abstract": "Content-based Image Retrieval (CBIR) is generally known as a collection of techniques for retrieving images on the basis of features, such as color, texture and shape. An efficient tool in CBIR is that of image histograms. In this paper a new image retrieval method is proposed with the use of histograms in conjunction with cellular automata (CAs). The main thrust of this paper is the classification of the images in the database by CAs and the retrieval of the desired images by a simple histogram extracted from the hue component of the HSV color space. Moreover, because of the CAs local rule simplicity, the VLSI implementation of the proposed CA algorithm is straightforward.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solar radiation prediction model based on Empirical Mode Decomposition",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6958466/",
            "Abstract": "Accurate solar radiation data are a key factor in Photovoltaic system design and installation. Efficient solar radiation time series prediction is regarded as a challenging task for researchers both in the past and at present. This paper deals with solar radiation time series prediction. To date an essential research effort has been made and various methods are proposed that have different mathematical backgrounds, such as artificial neural networks, fuzzy predictors, evolutionary and genetic algorithms. In the present study the solar radiation time series prediction combines the Empirical Mode Decomposition (EMD) and Support Vector Regression (SVR) models. The EMD is an adaptive signal processing technique that decomposes the nonstationary and nonlinear signals into a set of components with a different spatial frequency content. It results in a small set of new time series that are easier to model and predict. The …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recognition of 2-d shapes inspired by the human visual system",
            "Publication year": 2010,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm00288",
            "Abstract": "This paper presents a new method suitable for shape recognition, inspired by the Primary Visual Cortex of the Human Visual System. It extracts a description for 2-dimensional shapes with a closed contour, regardless of their size, rotation and position, with low computational cost. The paper introduces a new computational approach to the modeling of the hypercolumns of the Primary Visual Cortex, which requires significantly less computational burden and which is highly parallel. A new shape descriptor based on the relative angles of an object is also proposed. It produces close results for different shapes of the same object, it is proportion-flexible and it can identify distorted shapes correctly. Experimental results prove that the method is adequate for shape-based image retrieval and classification, as well as for efficiently storage of edges and line drawings.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:D03iK_w7-QYC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Fast computation of Chebyshev moments",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1661664/",
            "Abstract": "Chebyshev moments were recently proposed to address problems of moments of continuous orthogonal basis. They are moments of a discrete basis and are orthogonal in the domain of the image coordinate space, a feature which presents a number of advantages over moments of continuous orthogonal basis. No effort has been devoted yet to the efficiency of their calculation. In this paper, we present a hardware architecture which enables real-time processing of binary and grayscale images of up to 4 Mpixels. This architecture is realized in a field-programmable gate array of typical clock frequency of 100 MHz",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A rotational and translational image stabilization system for remotely operated robots",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4258802/",
            "Abstract": "Remotely operated robots equipped with on board cameras, apart from providing video input to operators, perform optical measurements to assist their navigation as well. Such image processing algorithms require image sequences, free of high frequency unwanted movements, in order to generate their optimal results. Image stabilization is the process which removes the undesirable position fluctuations of a video sequence improving, therefore, its visual quality. In this paper, we introduce the implementation of an image stabilization system that utilizes input from an on board camera and a gyrosensor. The frame sequence is processed by an optic flow algorithm and the inertial data is processed by a discrete Kalman filter. The compensation is performed using two servo motors for the pan and tilt movements and frame shifting for the vertical and horizontal movements. Experimental results of the robot head, have …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New fuzzy model for morphological colour image processing",
            "Publication year": 2002,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-vis_20020380",
            "Abstract": "Mathematical morphology is a powerful tool for image processing and analysis of binary, greyscale and colour images. In the paper, an efficient new fuzzy model for morphological colour image processing is introduced. A new vector-ordering scheme that uses fuzzy if–then rules is proposed, and then the basic morphological operations of erosion and dilation are defined. The morphological operators presented, which are vector preserving, are less sensitive to image distortion and perform significantly better in noise removal problems than other reported morphological operators. Experimental results demonstrate these advantageous characteristics on real images. Additionally, illustrative examples that exhibit the applicability of the proposed framework to edge-detection problems are given.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:P5F9QuxV20EC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "FPGA based disparity map computation with vergence control",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014193311000030X",
            "Abstract": "Depth estimation in a scene using image pairs acquired by a stereo camera setup, is one of the important tasks of stereo vision systems. The disparity between the stereo images allows for 3D information acquisition which is indispensable in many machine vision applications. Practical stereo vision systems involve wide ranges of disparity levels. Considering that disparity map extraction of an image is a computationally demanding task, practical real-time FPGA based algorithms require increased device utilization resource usage, depending on the disparity levels operational range, which leads to significant power consumption. In this paper a new hardware-efficient real-time disparity map computation module is developed. The module constantly estimates the precisely required range of disparity levels upon a given stereo image set, maintaining this range as low as possible by verging the stereo setup cameras …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A path planning method based on cellular automata for cooperative robots",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08839514.2011.606767",
            "Abstract": "A Cellular Automaton-based technique suitable for solving the path planning problem in a distributed robot team is outlined. Real-time path planning is a challenging task that has many applications in the fields of artificial intelligence, moving robots, virtual reality, and agent behavior simulation. The problem refers to finding a collision-free path for autonomous robots between two specified positions in a configuration area. The complexity of the problem increases in systems of multiple robots. More specifically, some distance should be covered by each robot in an unknown environment, avoiding obstacles found on its route to the destination. On the other hand, all robots must adjust their actions in order to keep their initial team formation immutable. Two different formations were tested in order to study the efficiency and the flexibility of the proposed method. Using different formations, the proposed technique could …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "An algorithm for adaptive mean filtering and its hardware implementation",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s11265-006-5920-3",
            "Abstract": "Noise due to the sensor and the electronics of a camera is an undesirable issue in any machine vision application. Such noise tends to corrupt images and to obstruct any further analysis. An algorithm to detect and cancel such noise, using statistical methods, is presented in this paper. The proposed algorithm is an adaptive mean filter, which filters out image regions that are found to be noise corrupted. The efficiency of the proposed filter was examined both qualitatively and quantitatively, by software simulation in several noisy conditions. The main advantage of the filter in hand is that it is appropriate for hardware implementation and can be easily incorporated to smart cameras. The hardware implementation of the filter is also presented in this paper. This implementation aims at time critical applications such as machine vision, inspection and visual surveillance.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Birkhäuser-Verlag"
        },
        {
            "Title": "Performance evaluation techniques for image scaling algorithms",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4659952/",
            "Abstract": "The paper studies different existing methods for image scaling algorithm evaluation. In addition, one new evaluation method is proposed which is directly related to ground truth optically scaled images. Digital image scaling is classified into the general interpolation scheme. However, due to the unique characteristics and wide applications of image scaling, a separate study of their evaluation methods is crucial. Two main classes of criteria are used as the basis for the assessments: The fidelity criteria and the computational complexity criteria. All methods are briefly described and comparative discussions are provided. This survey is helpful for an appropriate use of existing evaluation methods and for improving their performance as well as for systematically designing new evaluation methods.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic classification of earthquake-induced building damages",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Eleni-Vrochidou/publication/323429630_Automatic_Classification_of_Earthquake-Induced_Building_Damages/links/5aa676acaca27291845fdde1/Automatic-Classification-of-Earthquake-Induced-Building-Damages.pdf",
            "Abstract": "Summary, CO NTRIBUTIONTOTHE State OF Art v from the introduced strong motion duration of the seismic accelerogram so as to extract the new set of seismic features. The aforementioned analysis is carried out only to those signal components which have a direct impact on the damages of the construction under study. A correlation study is conducted and shows that the extracted seismic intensity parameters are strongly correlated to the structural damage. Therefore, the new seismic intensity parameters constitute an efficient data set, which can be utilized to represent the seismic intensity of signals in an intelligent system for structural damage estimation.The aforementioned research is essentially the background work for creating a model for structural damage assessment. Having artificially generated accelerograms of any desired intensity available, along with an efficient data set of seismic parameters strongly related to structural damage, the research is completed with the implementation of a system suitable for damage estimation. All extracted seismic parameters and damage indices refer to a certain reinforced concrete (RC) frame model utilized throughout the present project. However, the research methodology is structured in such a way as to be general in nature thus, being in a form that renders it ready to be implemented in different engineering design provisions with only minor changes.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:abG-DnoFyZgC",
            "Publisher": "LAP LAMBERT Academic Publishing"
        },
        {
            "Title": "Histogram based color reduction through self-organized neural networks",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44668-0_66",
            "Abstract": "A new technique suitable for reduction of the number of colors in an image is presented in this paper. It is based on histogram processing and the use of Kohonen Self Organizing Feature Map (SOFM) neural networks. Initially, the dominant colors of each primary image are extracted through a simple linear piece-wise histogram approximation process. Then, using a SOFM the dominant color components of each primary color band are obtained and a look up table is constructed containing all possible color triplets. The final dominant colors are extracted from the look-up table entries using a SOFM by specifying the number of output neurons equal to the number of the dominant colors. Thus, the final image has all the dominant color classes. Experimental and comparative results demonstrate the applicability of the proposed technique.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Soft morphological filtering using a fuzzy model and its application to colour image processing",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-003-0193-y",
            "Abstract": "Soft morphological filters form a class of filters with many desirable properties. They were introduced to improve the behaviour of standard morphological filters in detail preservation and noise elimination. In this paper, a framework for soft morphological colour image processing using a fuzzy model is introduced. This extends the standard colour morphological operators in the same way that soft greyscale morphology extends the standard greyscale morphology theory. The primary and secondary operations of the new soft morphological approach are defined. The proposed operators are less sensitive to image distortion and to small variations in the shape of the objects, and perform significantly better in impulse noise removal problems, compared to standard morphological operators. Experimental results of the application to real colour images demonstrate these advantageous …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "An intelligent cellular automaton model for crowd evacuation in fire spreading conditions",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410259/",
            "Abstract": "In this paper, a two-dimensional Cellular Automaton (CA) model simulates the evacuation process of a crowd responding to fire spread. The crowd consists of individuals and its behaviour is modelled by the response of each individual to a rule that directs him/her to the nearest exit. Furthermore, fire spreading and movements of the crowd members while approaching the fire are successfully simulated. Empirical studies and socio-psychological concepts that attempt to explain how individuals act under fire threat have been considered. Characteristic features of crowd dynamics, such as incoherent pedestrian motion, blockings in front of exits and mass behaviour are successfully simulated. An efficient user-friendly interface has been equipped with parameters defining the arrangement of the area, crowd formation and fire features. Finally, the model is executed fast on typical PCs and can be used for planning …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An intelligent hardware structure for impulse noise suppression",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1296937/",
            "Abstract": "In this paper an intelligent hardware module suitable for the computation of an adaptive median filter (AMF) is presented. The proposed digital hardware structure is pipelined and parallel processing is used to minimize computational time. It is capable of processing gray-scale images of 8-bit resolution with 3/spl times/3 or 5/spl times/5-pixel image neighborhoods as options for the computation of the filter output. However, the system can be easily expanded to accommodate windows of larger sizes. The function of the proposed circuitry is to detect the existence of impulse noise in an image neighborhood and apply the median filter operator only when necessary. Moreover, the noise detection procedure can be customized so that a range of pixel values is considered as impulse noise. In this way, the integrity of edge and detail information of the image under process is preserved and blurring is avoided. The …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Depicting pathways for cooperative miniature robots using cellular automata",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5999910/",
            "Abstract": "One of the major tasks in the field of robotics is the path planning problem. In systems consisted of numerous robots, the creation of collision free trajectories be comes even more complex. Such robotic teams must avoid all detected obstacles while further tasks must be achieved such as forming specific patterns. In this paper, a Cellular Automaton (CA) based path planner and its implementation in a real cooperative robot team are presented. All robots must cover the same distance avoiding all detected obstacles while their formation is kept immutable. Due to its simplicity, the method has low computational load and therefore further applications could be applied. On the other hand, miniature robots can cooperate in order to perform area measurements, simultaneous localization and mapping (SLAM), panoramic images and so on. One of the most interesting cooperation aspects is the usage of multiple digital …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast moment generating architectures",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4453840/",
            "Abstract": "Image moments are used extensively in various applications. Depending on the task at hand, the type as well as the order of moments to be implemented varies greatly. Simple geometric characteristics require the first few geometrical moments, while robust image watermarking employs high-order orthogonal moments. In this paper, we present an architecture which can be easily modified to implement various types of moments, including geometric, continuous as well as discrete orthogonal, in real-time. Although this architecture is optimized for hardware, software implementation is feasible and advantageous in some cases.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:SdhP9T11ey4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hardware structure for time-to-impact computation using log-polar images",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.472.7270&rep=rep1&type=pdf",
            "Abstract": "This paper describes the design of a new hardware system for the optical flow and time-to-impact computation with real-time response. This is achieved by estimating the optical flow of the object on the camera plane. In order to reduce the image size without losing significant information, the log-polar transformation is utilized. The system employs a sequence of log-polar images for the optical flow and time-to-impact computation of a moving object. The algorithm that has been implemented belongs to “differential techniques” category, which is suitable for parallel computation of the parameters. The structure of the implementation allows the processing of grey-level log-polar images of 45x60 pixels in real time (25 frames per second)",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A digital image stabilization method based on the Hilbert–Huang transform",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6170562/",
            "Abstract": "In this paper, an innovative technique for digital image stabilization (DIS) based on the Hilbert-Huang transform (HHT) is proposed. It exploits the basic features of the HHT in order to separate the local motion signal obtained from an image sequence into two different motion vectors. A variety of embedded systems equipped with a digital image sensor, such as handheld cameras, mobile phones, and robots, can produce image sequences with an observed motion caused by two different types of movements: the smooth camera motion (intentional) and the unwanted shaking motion (jitter). The HHT has been successfully employed in applications for disaggregating signals into smaller portions with specific features (e.g., biomedical applications). Subsequently, for DIS, local motion vectors of an image sequence are calculated, and they are processed by the HHT in order to define both signals. The original signal is …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On-chip earthquake simulation model using potentials",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11069-008-9255-1",
            "Abstract": "A two-dimensional (2-D) Cellular Automata (CA) dynamic system constituted of cells-charges has been proposed for the simulation of the earthquake process. The CA model has been calibrated with the use of real data. The calibration incorporates major seismic characteristics of the area under test. The simulation results are found in good quantitative and qualitative agreement with the recorded Gutenberg–Richter (GR) scaling relations. The model is enriched with a powerful multi-parameter interface that enables the user to load real data from different regions. This paper examines the on-chip realisation of the model and its instrumentation. The CA model hardware implementation is based on Field Programmable Gate Array (FPGA) logic. It utilises an array of 32 × 32 cells. Parameters that construct the local CA rule constitute the input data. The initial seed, which to some extent corresponds to the …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:JQOojiI6XY0C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Conditional random field model for robust multi-focus image fusion",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8737867/",
            "Abstract": "In this paper, a novel multi-focus image fusion algorithm based on conditional random field optimization (mf-CRF) is proposed. It is based on an unary term that includes the combined activity estimation of both high and low frequencies of the input images, while a spatially varying smoothness term is introduced, in order to align the graph-cut solution with boundaries of focused and defocused pixels. The proposed model retains the advantages of both spatial-domain methods and multi-spectral methods and by solving an energy minimization problem and finds an optimal solution for the multi-focus image fusion problem. Experimental results demonstrate the effectiveness of the proposed method that outperforms current state-of-the-art multi-focus image fusion algorithms in both qualitative and quantitative comparisons. In this paper, the successful application of the mf-CRF model in multi-modal image fusion (visible …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:kzcrU_BdoSEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pattern Recognition Referees 2009",
            "Publication year": 2010,
            "Publication url": "https://www.diva-portal.org/smash/record.jsf?pid=diva2:928895",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special issue on color imaging. Guest Editor",
            "Publication year": 2002,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2002PatRe..35.1641A/abstract",
            "Abstract": "The history of color science spans a period of approximately 2000 years. Aristotle first recognized the primacy of red, green and blue and stated that other colors are intermediate between these three, either mixtures of them or result from contrast between them. Twenty centuries later Young proposed the trichromatic theory of vision. He suggested that there exist three different kinds of receptors in the human eye each one tuned to one of the primary colors. In 1872, Maxwell demonstrated the reproduction of color scenes by projecting a scene simultaneously through red, green and blue filters. Hering's opponent-color theory suggests the existence of six independent color dimensions, which are perceived by three opponent color systems: black-white, red-green and yellow-blue. For many years the above theories were considered to be in competition until Mueller suggested that both Young's and Hering's theories …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Fast Post-Processing Technique for Real-Time Stereo Correspondence.",
            "Publication year": 2008,
            "Publication url": "https://www.scitepress.org/papers/2008/10734/10734.pdf",
            "Abstract": "In computer vision, the extraction of dense and accurate disparity maps is a computationally expensive and challenging problem, and high quality results typically require from several seconds to several minutes to be obtained. In this paper, we present a new post-processing technique, which detects the incorrect reconstructed pixels after the initial matching process and replaces them with correct disparity values. Experimental results with Middlebury data sets show that our approach can process images of up to 3MPixels in less than 3.3 msec, producing at the same time semi-dense (up to 99%) and accurate (up to 94%) disparity maps. We also propose a way to adaptively change, in real time, the density and the accuracy of the extracted disparity maps. In addition, the matching and post-processing procedures are calculated without using any multiplication, which makes the algorithm very fast, while its reduced complexity simplifies its implementation. Finally, we present the hardware implementation of the proposed algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Colour image skeletonisation",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7075216/",
            "Abstract": "In this paper a new morphological technique suitable for colour image skeleton extraction is presented. Vector morphological operations are defined by means of a new ordering of vectors of the HSV colour space, which is a combination of conditional and partial sub-ordering. Then, these are used to extract skeletons of colour images in terms of erosions and openings. The proposed method was tested with a variety of images and such experimental results are provided. Its applications include image compression and recognition problems.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cellular Automata Model with Game Theory for Power Management of Hybrid Renewable Energy Smart Grids",
            "Publication year": 2014,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10013",
            "Abstract": "In recent years, control of smart grids that match electricity demand in different sites and forms with supply has been considered as one of the most difficult aspect of smart energy grids design. In this paper we present a Cellular Automata (CA) based approach combined with Game Theory for the enhancement of Power Management Strategies (PMSs) of multiple Hybrid Renewable Energy Systems (HYRES) that form a smart grid for the exchange of energy. More specifically, taking advantage of the local interactions of HYRES we coupled CA principles with Public Goods Game (PGG) for modeling. The presented CA model focuses on providing valuable feedback for PMSs of the understudy HYRES connected in a grid. In this manner, a flexible network based HYRES design is considered and applied to specific HYRESs located in Olvio, near Xanthi, Greece, part of SYSTEMS SUNLIGHT facilities. The proposed model can be applied to the understudy HYRESs grid management to enhance and optimize its PMS based on the provided energy prediction scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer"
        },
        {
            "Title": "The Imapct of Low-Level Features in Semantic-Based Image",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/imapct-low-level-features-semantic/28920",
            "Abstract": "Image Retrieval (IR) is generally known as a collection of techniques for retrieving images on the basis of features, either low-level (Content-based IR) or high-level (Semantic-based IR). Since Semantic-based features rely on low-level ones, in this chapter the reader is initially familiarized with the most widely used low-level features. An efficient way to present these features is by means of a statistical tool capable of bearing concrete information, such as the histogram. For use in IR, the histograms extracted from the previously mentioned features need to be compared by means of a metric. The most popular methods and distances are, thus, apposed. Finally, a number of IR systems using histograms are presented in a thorough manner and their experimental results are discussed. The steps in order to develop a custom IR system, along with modern techniques in image feature extraction are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Digital image scaling",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1604529/",
            "Abstract": "The proposed scaling algorithm outperforms other standard and widely used scaling techniques. The algorithm uses a mask of maximum four pixels and calculates the final luminosity of each pixel combining two factors; the percentage of area that mask covers from each source pixel and the difference in luminosity between the source pixels. The interpolation is capable of scaling both grey-scale and color images of any resolution in any scaling factor. Its key characteristics and low complexity make the interpolation very fast and capable of real time implementation. The performance results in a variety of standard tests are presented and compared to other scaling algorithms",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "1-d cellular automaton for pseudorandom number generation and its reconfigurable hardware implementation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1693661/",
            "Abstract": "In this paper, a one dimensional (1-d) cellular automaton (CA) for pseudorandom number generation (PRNG) and its reconfigurable hardware implementation are presented. The proposed 1-d CA based on the real time clock sequence (analytical time description) can generate high-quality random numbers which can pass all of the statistical tests of DIEHARD and NIST which seem to be the most powerfully complete general test suites for randomness. After describing our implementation in field-programmable gate array (FPGA), through experiments, we have identified the efficiency of the presented CA that performs exceptionally well compared to most known CA PRNGs reported in literature. More specifically, our CA implementation outperforms all the previous CA and LFSR PRNGs both in hardware implementation and timing characteristics. Such a CA can be efficiently implemented for PRNG reasons in every …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vector ordering and morphological operations for colour image processing: fundamentals and applications",
            "Publication year": 2002,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=13812481",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time stereo vision applications",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=xAmhDwAAQBAJ&oi=fnd&pg=PA275&dq=info:kFCfdjxipkIJ:scholar.google.com&ots=urvCEdG366&sig=mhBujYQJe8qcCIAALQW9DYLmR90",
            "Abstract": "Depth perception is one of the important tasks of a computer vision system. Stereo correspondence by calculating the distance of various points in a scene relative to the position of a camera allows the performance of complex tasks, such as depth measurements and environment reconstruction (Jain et al., 1995). The most common approach for extracting depth information from intensity images is by means of a stereo camera setup. The point-by-point matching between the two images from the stereo setup derives the depth images, or the so called disparity maps,(Faugeras, 1993). The computational demanding task of matching can be reduced to a one dimensional search, only by accurately rectified stereo pairs in which horizontal scan lines reside on the same epipolar plane, as shown in Figure 1. By definition, the epipolar plane is defined by the point P and the two camera optical centers OL and OR. This plane POLOR intersects the two image planes at lines EP1 and EP2, which are called epipolar lines. Line EP 1 is passing through two points: EL and PL, and line EP2 is passing through ER and PR respectively. EL and ER are called epipolar points and are the intersection points of the baseline OLOR with each of the image planes. The computational significance for matching different views is that for a point in the first image, its corresponding point in the second image must lie on the epipolar line, and thus the search space for a correspondence is reduced from 2 dimensions to 1 dimension. This is called the epipolar constraint. The difference on the horizontal coordinates of points PL and PR is the disparity. The disparity map consists of all …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "An efficient peer to peer image retrieval technique using content addressable networks",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_62",
            "Abstract": "We present a novel technique for efficient Content Based Peer to Peer Image Retrieval (CBP2PIR) that employs a Content Addressable Network (CAN). A two-stage color histogram based method is described. The first stage defines mapping into the CAN by use of a single fuzzy histogram; while the second stage completes the image retrieval process through a spatially-biased histogram. The proposed system is completely decentralized, non-flooding, and promises high image recall, while minimizing network traffic.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multi-scale image contrast enhancement",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4795629/",
            "Abstract": "This paper presents a new method suitable for the contrast enhancement of digital images. The proposed algorithm employs the center-surround architecture of the human visual system (HVS) for the comparison of the central pixel with the mean intensity of its surround. These two values are inputs to a mapping function, which calculates the new intensity value of the central pixel, in a way that increases small local intensity differences while preserving the large ones. The proposed method is applied to three spatial scales by employing different surround sizes. As a result, contrast enhancement is performed in different spatial frequencies of the original image. The proposed method is tested against other similar methods and is found to exhibit better results in the enhancement of low-contrast images, such as medical, aerial or foggy scenes, revealing visual information that otherwise would not be available to the …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent seismic acceleration signal processing for damage classification in buildings",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4303379/",
            "Abstract": "Three new pattern recognition methods, based on fuzzy logic techniques that are suitable for seismic acceleration signal classification, are proposed in this paper. The classification of unknown signals is carried out according to the structural or architectural damage that is produced by the seismic signals. A set of 400 natural accelerograms, which have been recorded in various regions with well-known strong seismic activity, has been used for evaluation of the proposed methods. The seismic accelerograms are first treated as graphs; the similarity between them is exploited in order to perform the classification. In the second approach, a set of parameters are derived from each signal through computer analysis. These describe effectively the intensity measure of the seismic excitation, and they are used instead of the accelerograms. Similarity between them is appropriately utilized. Finally, a method that depends …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Soft morphological color image processing: A fuzzy approach",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=3739991410711607574&hl=en&oi=scholarr",
            "Abstract": "Mathematical morphology is a powerful tool for image processing and analysis of binary, gray-scale and color images. Soft morphological filters form a class of filters with many desirable properties. They were introduced to improve the behavior of standard morphological filters in detail preservation and noise elimination. In this paper a framework for soft morphological color image processing using a fuzzy model is presented and implemented in hardware. The basic morphological operations of soft erosion and dilation are defined by means of a vector ordering scheme that uses fuzzy if-then rules. Experimental results of the application to real color images demonstrate that the proposed operators are less sensitive to image distortion and to small variations in the shape of the objects and perform significantly better in impulse noise removal problems, compared to standard morphological operators …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Synthesis of artificial spectrum-compatible seismic accelerograms",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/25/8/085002/meta",
            "Abstract": "The Hilbert–Huang transform is used to generate artificial seismic signals compatible with the acceleration spectra of natural seismic records. Artificial spectrum-compatible accelerograms are utilized instead of natural earthquake records for the dynamic response analysis of many critical structures such as hospitals, bridges, and power plants. The realistic estimation of the seismic response of structures involves nonlinear dynamic analysis. Moreover, it requires seismic accelerograms representative of the actual ground acceleration time histories expected at the site of interest. Unfortunately, not many actual records of different seismic intensities are available for many regions. In addition, a large number of seismic accelerograms are required to perform a series of nonlinear dynamic analyses for a reliable statistical investigation of the structural behavior under earthquake excitation. These are the main motivations …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:HE397vMXCloC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A real-time color space converter for the measurement of appearance",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320300000601",
            "Abstract": "The value of being able to specify and control color representations in perceptual terms is increasingly being recognized. The advantages of using perceptual color spaces include intuitive addressability, uniformity, independent control of lightness and chromatic contrast, and device characterization in perceptual terms. This paper presents the design and VLSI implementation of a new digital hardware structure which performs the conversion, in real-time, of the R, G and B color co-ordinates to the CIE L∗ u∗ v∗ perceptually uniform color space. For a typical 512× 512 pixel digital color image the number of required operations is 28× 512 2 (including power and division operations) and these cannot be executed in software fast enough to cope with time critical applications. The high speed of operation is achieved by pipelining the data in a vector fashion. The structure is implemented using a DLM, 0.7 μm, N-well …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Simple-Shape Classification Based on the Human Visual System",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Antonios-Gasteratos/publication/235350539_Simple_Shape_Classification_Based_on_the_Human_Visual_System/links/00b4952b5cb7a9d1a1000000/Simple-Shape-Classification-Based-on-the-Human-Visual-System.pdf",
            "Abstract": "This paper presents a new method suitable for shape classification, inspired by the early processing levels of the human visual system. It extracts a description for any simple 2-dimensional shape having a closed contour, regardless of its size, rotation and position, in affordable computational cost. The paper introduces a new approach to the modeling of the hypercolumns of the primary visual cortex, which requires significantly less computational burden and that is highly parallel. A new shape descriptor based on the relative angles of an object is also proposed. It produces close results for different shapes of the same object, it is proportion-flexible and it can identify distorted shapes correctly. Experimental results prove that the method is adequate for industrial production applications based on shape classification, as well as for shape-based image retrieval.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A genetic algorithm for the classification of earthquake damages in buildings",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-0221-4_40",
            "Abstract": "In this paper an efficient classification system in the area of earthquake engineering is reported. The proposed method uses a set of artificial accelerograms to examine several types of damages in specific structures. With the use of seismic accelerograms, a set of twenty seismic parameters have been extracted to describe earthquakes. Previous studies based on artificial neural networks and neuro-fuzzy classification systems present satisfactory classification results in different types of earthquake damages. In this approach a genetic algorithm (GA) was used to find the optimal feature subset of the seismic parameters that minimizes the computational cost and maximizes the classification performance. Experimental results indicate that the use of the GA was able to classify the structural damages with classification rates up to 92%.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Enhancement of hybrid renewable energy systems control with neural networks applied to weather forecasting: the case of Olvio",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-015-2175-6",
            "Abstract": "In this paper, an intelligent forecasting model, a recurrent neural network (RNN) with nonlinear autoregressive architecture, for daily and hourly solar radiation and wind speed prediction is proposed for the enhancement of the power management strategies (PMSs) of hybrid renewable energy systems (HYRES). The presented model (RNN) is applicable to an autonomous HYRES, where its estimations can be used by a central control unit in order to create in real time the proper PMSs for the efficient subsystems’ utilization and overall process optimization. For this purpose, a flexible network-based design of the HYRES is used and, moreover, applied to a specific system located on Olvio, near Xanthi, Greece, as part of Systems Sunlight S.A. facilities. The simulation results indicated that RNN is capable of assimilating the given information and delivering some satisfactory future estimation achieving …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Seismic intensity feature construction based on the Hilbert–Huang transform",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6003786/",
            "Abstract": "An increasing number of seismic parameters for the representation of the severity of earthquake signals have been proposed in recent years. Considering the complex nature of seismic accelerograms, there is an obvious need for a more effective representation. The destructiveness of a seismic wave cannot be always described using a single feature of the examined ground motion. Moreover, the level of structural damage caused by a severe earthquake depends on the characteristics of the oscillated structure. The aim of this study is to propose new crucial ground-motion parameters, which reflect the damage potential of the seismic excitations. The Hilbert-Huang transform (HHT) is applied to a set of 70 natural accelerograms. Through the HHT, the complex earthquake signals are decomposed into several simple components called intrinsic mode functions. After a thorough analysis, eight new seismic parameters …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Parallel local histogram comparison hardware architecture for content-based image retrieval",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:JINT.0000021021.10780.af",
            "Abstract": "The explosive growth of the World Wide Web has made a vast amount of information available especially the multimedia data such as images and graphics. New generation search engines with the technology of Content-Based Image Retrieval (CBIR) is a response to the need. In this paper, a new technique based on composite local colour histograms suitable for CBIR is described. The proposed approach is accurate even in very large image databases. Furthermore, a novel parallel hardware structure has been designed and implemented on a chip-set of FPGAs, in order to increase the operation speed. Its typical maximum clock frequency is 35 MHz and it can perform over 50 comparisons of 640×480-pixel images per second.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Automated Visual Inspection Systems",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B978012443880450065X",
            "Abstract": "The aim of this chapter is to describe automated visual inspection systems. Automated visual inspection involves observing the same type of object repeatedly to detect mistakes. Expectations of general purpose automated visual inspection go beyond the capabilities of existing algorithms and hardware. Concentrating on specific industrial tasks such as printed circuit board inspection, information recognition on labels, and fruit sorting has proved to be useful. It should be plausible to apply more sophisticated pattern recognition techniques to more complex automatic inspection problems, considering the recent progress in very large scale of integration (VLSI) technology, special computer architectures, and vision techniques. Speed and versatility are the two major goals that should be fulfilled by any technique to be of particular use for the visual product inspection. Future research in automated …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Special issue on mathematical morphology & nonlinear image processing",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=9643026809272531881&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:WbkHhVStYXYC",
            "Publisher": "PERGAMON-ELSEVIER SCIENCE LTD"
        },
        {
            "Title": "Partitioning trees: A global multiclass classification technique for SVMs.",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=5454024553324282422&hl=en&oi=scholarr",
            "Abstract": "Presented in this paper is a novel technique for multiclass classification in SVMs through combination of binary classifiers, namely that of Partitioning Trees (P-Trees). The technique aims at improving the Directed Acyclic Graphs (DAGs) both in terms of training as well as testing performance. It works by progressively constructing a decision graph, where each node is a binary classifier. Each trained node defines a dichotomy over the instance space which, in turn, is used to train subsequent nodes. In this way, every node trains against only a subset of the samples of its classes; namely the samples that reach the node through the decision graph in addition to a subsampled version of the ones that fail to reach it. Training sets reduce in size and decision surfaces become more compact, thus improving training and testing performance. Extensive experimental results demonstrate the effectiveness of the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cellular automaton simulation tool for modelling seismicity in the region of Xanthi",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1364815206001587",
            "Abstract": "Seismicity is an extended geophysical characteristic of the Greek dominion. There are certain areas of high seismic activity, as well as, regions of low seismicity where strong earthquakes are rather rare events. Consequently, it is of great interest to present a methodology concerning the earthquake process in Greece even for areas considered to be of low seismicity. In this paper, a study of the earthquake activity of an area in Northeastern Greece, centred at Xanthi, Thrace, extending over a region of radius R = 80 km, during a certain time period is presented. A two-dimensional cellular automaton (CA) dynamic system consisting of cells representing charges is used for the simulation of the earthquake process. The model has been tested as well as calibrated using the recorded events of the above-mentioned region as initial conditions. The simulation results are found in good quantitative and qualitative agreement …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:5nxA0vEk-isC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An edge preserving image resizing method based on cellular automata",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33350-7_39",
            "Abstract": "This paper introduces a novel image resizing method for both color and grayscale images. The method could be beneficial in applications where time and quality of the processed images are crucial. The basic idea of the proposed method relies on preserving the edges by partitioning the digital images into homogenous and edge areas during the enlargement process. In addition, the basic fundamentals of Cellular Automata were adopted in order to achieve better performance both in terms of processing time as well as in image quality. By creating appropriate transition rules, the direction of the edges is considered so that every unknown pixel is processed based on its neighbors in order to preserve the quality of the edges. Results demonstrate that the proposed method improves the subjective quality of the enlarged images over conventional resizing methods while keeping the required processing time …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A new hardware module for stereo matching using Zernike moments",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4437910/",
            "Abstract": "This paper presents a new hardware module suitable for matching point features between two uncalibrated images of a scene with real-time response. A robust matching is established under a mixed geometric and moment-based correspondence strength function. In order to provide rotation invariance and low noise sensitivity, Zernike moments are utilized. The proposed system is capable of extracting correspondences between stereo pairs at a rate of over 25 pairs per second, for VGA images.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Earthquake damage classification method based on support vector machines",
            "Publication year": 2011,
            "Publication url": "https://www.actapress.com/Abstract.aspx?paperId=451607",
            "Abstract": "EARTHQUAKE DAMAGE CLASSIFICATION METHOD BASED ON SUPPORT VECTOR \nMACHINES Petros-Fotios Alvanitopoulos Department of Electrical and Computer \nEngineering Democritus University of Thrace GR-67100 Xanthi, Greece palvanit@ee.duth.gr \nJohn M. Konstantinides Department of Electrical and Computer Engineering Democritus \nUniversity of Thrace GR-67100 Xanthi, Greece ikonstan@ee.duth.gr Ioannis Andreadis \nDepartment of Electrical and Computer Engineering Democritus University of Thrace GR-67100 \nXanthi, Greece iandread@ee.duth.gr Anaxagoras Elenas Department of Civil Engineering \nDemocritus University of Thrace GR-67100 Xanthi, Greece elenas@civil.duth.gr \nABSTRACT This paper presents an efficient method for automatic seismic damage \nassessment on multistory constructions. Support Vector Machines (SVMs) are trained in \norder to acquire compact and efficient damage -…",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey on evaluation methods for image interpolation",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/20/10/104015/meta",
            "Abstract": "Image interpolation is applied to Euclidean, affine and projective transformations in numerous imaging applications. However, due to the unique characteristics and wide applications of image interpolation, a separate study of their evaluation methods is crucial. The paper studies different existing methods for the evaluation of image interpolation techniques. Furthermore, an evaluation method utilizing ground truth images for the comparisons is proposed. Two main classes of analysis are proposed as the basis for the assessments: performance evaluation and cost evaluation. The presented methods are briefly described, followed by comparative discussions. This survey provides information for the appropriate use of the existing evaluation methods and their improvement, assisting also in the designing of new evaluation methods and techniques.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Potential Field Approach of a Cellular Automaton Evacuation Model and Its FPGA Implementation",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-79992-4_73",
            "Abstract": "Crowd evacuation from constructions can be modelled with the use of Cellular Automata. The crowd consists of individuals and its behaviour is modelled by the response of each individual to a simple updating rule that directs a person to the nearest exit as facilitates any object avoidance. Individual interactions are defined locally while the crowd motion evolves. In this paper, this motion approach is based on the concept of virtual potential fields that are defined by the location of exits, other pedestrians or objects. Electric charges located at exit and obstacle positions generate such fields. Characteristic features of crowd dynamics, such as incoherent-to-coherent pedestrian motion, blockings in front of exits and mass behaviour are successfully simulated. Finally, the paper presents the main architectural concepts of the corresponding dedicated FPGA processor, as the major structural part of an integrated …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Potential–Based Cellular Automaton Model for Earthquake Simulation",
            "Publication year": 2019,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9780429081385-45/potential-based-cellular-automaton-model-earthquake-simulation-georgoudas-ch-sirakoulis-andreadis",
            "Abstract": "In this paper a potential-based model for earthquake simulation that is a two-dimensional cellular automaton dynamic system constituted of cells-charges, is presented. The proposed model is constructed in order to simulate earthquake activity in correspondence to the quasi-static two-dimensional version of the Burridge-Knopoff spring-block model of earthquakes, as well as, to the Olami-Feder-Christensen (OFC) earthquake model. The simulation results are found in good quantitative and qualitative agreement with the Gutenberg–Richter (GR) scaling relation predictions. Numerical results for various cascade (earthquake) sizes and different critical states are presented. Furthermore, the parameter of different neighbourhood in the proposed model is also explored.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:W7OEmFMy1HYC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "A simulation tool for modelling pedestrian dynamics during evacuation of large areas",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_72",
            "Abstract": "The movement of large numbers of people is important in many situations, such as the evacuation of a building in an emergency. In this paper, pedestrian dynamics during the evacuation of large areas is simulated using a computational intelligent technique, based on Cellular Automata. The characteristic feature of the proposed model is that the crowd consists of independent parts rather than treated as homogeneous mass. The crowd behaviour is artificially formatted by the response of each of these parts to the rule according to which each pedestrian reaches one of the possible exits. Furthermore, an efficient graphical user interface has been developed, in order to study various hypotheses concerning the pedestrians’ activity features. Collisions among pedestrians have been encountered while collective effects prominent at crowd behaviour have been also realised during simulation. Finally, the …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Hardware Implementation of a Crowd Evacuation Model Based on Cellular Automata",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04504-2_38",
            "Abstract": "Cellular Automata (CA) can sufficiently represent phenomena of arbitrary complexity and at the same time they can be precisely simulated by digital computers, because of their intrinsic discreteness. A two-dimensional (2-D) CA dynamic system has been proposed to efficiently model crowd behaviour inside bounded areas to contribute to the upgrade of public facilities. This paper examines the on-chip realisation of the proposed model. The hardware implementation of the CA model is based on FPGA logic. CA cells obtain discrete values, thus indicating their status; either free or occupied. Significant parameters of the local CA rule, such as the number and the allocation of the exits or the obstacles are inputs of the dedicated processor. Initial data is loaded to the dedicated processor in a semi-parallel way, i.e. all rows of the CA grid are loaded simultaneously while data propagates in a serial way from one …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the use of color histograms for content based image retrieval in various color spaces",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/957400.957471",
            "Abstract": "As digital image libraries are already overpopulated, the development of improved methods for better indexing and retrieving images from such libraries (databases), has become an imperative issue. Content-based Image Retrieval (CBIR) is a technique for retrieving images on the basis of automatically-derived features such as color, texture and shape. The features used for retrieval can be either primitive or semantic, but the extraction process must be predominantly automatic [1]. A large number of applications, including military, industrial and civilian generate gigabytes of images daily. As a result, there is a huge amount of information which cannot be accessed or made use of unless it is organized [3]. By organized it is meant that appropriate indexing is available in order to allow efficient browsing, searching and retrieving as in keyword searches of text databases. The easiest way to search is with the use of …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive document binarization",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Antonios-Gasteratos/publication/221415249_Adaptive_document_binarization_A_human_vision_approach/links/0912f505a1e127129a000000/Adaptive-document-binarization-A-human-vision-approach.pdf",
            "Abstract": "This paper presents a new approach to adaptive document binarization, inspired by the attributes of the Human Visual System (HVS). The proposed algorithm combines the characteristics of the OFF ganglion cells of the HVS with the classic Otsu binarization technique. Ganglion cells with four receptive field sizes tuned to different spatial frequencies are employed, which, adopting a new activation function, are independent of gradual illumination changes, such as shadows. The Otsu technique is then used for thresholding the outputs of the ganglion cells, resulting to the final segmentation of the characters from the background. The proposed method was quantitatively and qualitatively tested against other contemporary adaptive binarization techniques in various shadow levels and noise densities, and it was found to outperform them.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancement of fast acquired disparity maps using a 1-D cellular automation filter",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Antonios-Gasteratos/publication/259885133_Enhancement_of_Fast_Acquired_Disparity_Maps_using_a_1-D_Cellular_Automation_Filter/links/54721ecd0cf24af340c53151/Enhancement-of-Fast-Acquired-Disparity-Maps-using-a-1-D-Cellular-Automation-Filter.pdf",
            "Abstract": "Among others, stereo vision analysis deals with the extraction of depth in a scene, using the disparity between the images acquired by a stereo camera setup. The disparity calculation for the whole of an image is mostly a computation demanding procedure, commonly being performed by dedicated hardware. In this paper a hardware architecture for real time extraction of disparity maps is proposed, capable of processing images of 1MPixels in less than 25ms. The produced disparity maps are indented to be used for real-time navigation of a mobile platform, as well as in other time critical applications which demand 3D information.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extraction of salient contours in color images",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_40",
            "Abstract": "In this paper we present an artificial cortical network, inspired by the Human Visual System (HVS), which extracts the salient contours in color images. Similarly to the primary visual cortex, the network consists of orientation hypercolumns. Lateral connections between the hypercolumns are modeled by a new connection pattern based on co-exponentiality. The initial color edges of the image are extracted in a way inspired by the double-opponent cells of the HVS. These edges are inputs to the network, which outputs the salient contours based on the local interactions between the hypercolumns. The proposed network was tested on real color images and displayed promising performance, with execution times small enough even for a conventional personal computer.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:738O_yMBCRsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On estimation of the number of image principal colors and color reduction through self‐organized neural networks",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ima.10019",
            "Abstract": "A new technique suitable for reduction of the number of colors in a color image is presented in this article. It is based on the use of the image Principal Color Components (PCC), which consist of the image color components and additional image components extracted with the use of proper spatial features. The additional spatial features are used to enhance the quality of the final image. First, the principal colors of the image and the principal colors of each PCC are extracted. Three algorithms were developed and tested for this purpose. Using Kohonen self‐organizing feature maps (SOFM) as classifiers, the principal color components of each PCC are obtained and a look‐up table, containing the principal colors of the PCC, is constructed. The final colors are extracted from the look‐up table entries through a SOFM by setting the number of output neurons equal to the number of the principal colors obtained for the …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "FPGA implementation of a real-time biologically inspired image enhancement algorithm",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11554-008-0090-0",
            "Abstract": "This paper presents an FPGA implementation of a novel image enhancement algorithm, which compensates for the under-/over-exposed image regions, caused by the limited dynamic range of contemporary standard dynamic range image sensors. The algorithm, which is motivated by the attributes of the shunting center-surround cells of the human visual system, is implemented in Altera Stratix II GX: EP2SGX130GF1508C5 FPGA device. The proposed implementation, which is synthesized in an FPGA technology, employs reconfigurable pipeline, structured memory management, and data reuse in spatial operations, to render in real-time the huge amount of input data that the video signal comprises. It also avoids the use of computationally intensive operations, achieving the required specifications in terms of flexibility, timing, performance and visual quality. The proposed implementation allows real-time …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Morphological Colour Image Segmentation",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=15072434169524422382&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of neural networks solar radiation prediction for hybrid renewable energy systems",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11071-4_13",
            "Abstract": "In this paper a Recurrent Neural Network (RNN) for solar radiation prediction is proposed for the enhancement of the Power Management Strategies (PMSs) of Hybrid Renewable Energy Systems (HYRES). The presented RNN can offer both daily and hourly prediction concerning solar irradiation forecasting. As a result, the proposed model can be used to predict the Photovoltaic Systems output of the HYRES and provide valuable feedback for PMSs of the understudy autonomous system. To do so a flexible network based design of the HYRES is used and, moreover, applied to a specific system located on Olvio, near Xanthi, Greece, as part of SYSTEMS SUNLIGHT S.A. facilities. As a result, the RNN after training with meteorological data of the aforementioned area is applied to the specific HYRES and successfully manages to enhance and optimize its PMS based on the provided solar radiation prediction.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Correlation between seismic intensity parameters of HHT-based synthetic seismic accelerograms and damage indices of buildings",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33409-2_44",
            "Abstract": "In this work, a correlation study between well-known seismic parameters and damage indices is presented. The correlation analysis is first performed on a set of natural seismic signals and afterwards on a set of artificial accelerograms generated from natural records. The artificial seismic signals are generated by a combination of techniques; the Hilbert-Huang transform and an optimization algorithm. In addition, they are compatible with the design spectra of a chosen seismic area. Results reveal that the seismic parameters of the synthetic earthquake accelerograms provide the same degree of correlation with the used damage indices as the natural earthquakes. Thus, the proposed synthetic accelerograms technique appropriately represents a seismic event and, therefore, it is a useful tool in earthquake engineering.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:5ugPr518TE4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Structural damage estimation in mid-rise reinforced concrete structure based on time–frequency analysis of seismic accelerograms",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/document/7600519/",
            "Abstract": "The aim of this study is to evaluate the intensity and damage potential of seismic accelerograms on structures combining a fuzzy inference system with a set of new seismic intensity parameters. The proposed seismic parameters stem from the energy content of seismic signals. More specifically, a time-window is utilised to define the strong motion duration of seismic excitations and the ensemble empirical mode decomposition is employed for a time-frequency analysis of the selected strong motion area. The maximum inter-storey drift ratio is selected as the seismic structural damage index. Strong interdependence between the proposed seismic intensity parameters and the selected damage index is reported. The membership functions of the fuzzy system are tuned by means of a genetic algorithm. The effectiveness of the proposed fuzzy model is tested on a reinforced concrete frame structure. The methodology …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:qUcmZB5y_30C",
            "Publisher": "IET"
        },
        {
            "Title": "Real-time adaptive image impulse noise suppression",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1299144/",
            "Abstract": "In this paper, a new intelligent hardware module suitable for the computation of an adaptive median filter is presented for the first time. The function of the proposed circuit is to detect the existence of impulse noise in an image neighborhood and apply the operator of the median filter only when it is necessary. The noise detection procedure can be controlled so that a range of pixel values is considered as impulse noise. In this way, the blurring of the image in process is avoided, and the integrity of edge and detail information is preserved. Experimental results with real images demonstrate the improved performance. The proposed digital hardware structure is capable to process gray-scale images of 8-bit resolution and is fully pipelined, whereas parallel processing is used in order to minimize computational time. In the presented design, a 3/spl times/3 or 5/spl times/5 pixel image neighborhood can be selected for the …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new algorithm for the classification of earthquake damages in structures",
            "Publication year": 2008,
            "Publication url": "https://www.actapress.com/Abstract.aspx?paperId=32555",
            "Abstract": "A NEW ALGORITHM FOR THE CLASSIFICATION OF EARTHQUAKE DAMAGES IN \nSTRUCTURES P. Alvanitopoulos Laboratory of Electronics Section of Electronics and \nInformation Systems Technology Department of Electrical and Computer Engineering \nDemocritus University of Thrace GR – 67100 Xanthi, Greece palvanit@ee.duth.gr I. \nAndreadis Laboratory of Electronics Section of Electronics and Information Systems \nTechnology Department of Electrical and Computer Engineering Democritus University of \nThrace GR – 67100 Xanthi, Greece iandread@ee.duth.gr A. Elenas Institute of Structural \nMechanics and Earthquake Engineering Department of Civil Engineering Democritus \nUniversity of Thrace GR – 67100 Xanthi, Greece elenas@civil.duth.gr ABSTRACT It is well-known \nthat the natural phenomenon of an earthquake is unpredictable both in time and intensity. \nConsequently, the damages on human by an . . …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ant Colony Optimization for Use in Content Based Image Retrieval",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/ant-colony-optimization-use-content/19654",
            "Abstract": "The aim of this chapter is to provide the reader with a Content Based Image Retrieval (CBIR) system which incorporates AI through ant colony optimization and fuzzy logic. This method utilizes a two-stage fuzzy modified ant colony algorithm employing in parallel low-level features such as color, texture and spatial information which are extracted from the images themselves. The results prove the system to be more efficient compared to popular and contemporary methods such as the histogram intersection, joint histograms and the scalable color histogram of the MPEG-7 standard. However, due to the high computational burden of the AI methods the system is quite slow when implemented in software. Thus in order to speed up the whole process the reader is also provided with the hardware implementation analysis of the whole system. The increase in speed is phenomenal.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Using simple coordinate logic operators to realize basic morphological operations",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/894538/",
            "Abstract": "We present a methodology for performing morphological operations using coordinate logic ones. Coordinate logic operations are simple and fast because they are logic operations among the corresponding binary values of the image pixels. Coordinate logic (CL) filters are a family of fast non-increasing, non-linear filters, which are based on coordinate logic operations. CL filters exhibit analogous properties to those of the morphological filters but due to their different definition they display slightly different response. This is revoked in this paper by using appropriate image gray level quantization. Based on this approach some fast efficient realizations of morphological filters using CL operators are proposed.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Discrete orthogonal moments in image analysis",
            "Publication year": 2007,
            "Publication url": "https://www.actapress.com/Abstract.aspx?paperId=29768",
            "Abstract": "DISCRETE ORTHOGONAL MOMENTS IN IMAGE ANALYSIS Leonidas Kotoulas and Ioannis \nAndreadis Laboratory of Electronics Department of Electrical and Computer Engineering \nDemocritus University of Thrace Xanthi, Greece email: lkotoula@ee.duth.gr, \niandread@ee.duth.gr ABSTRACT Image moments are extensively used in various image anal- \nysis tasks. Moments of a discrete orthogonal basis were recently proposed as image descriptors, \npresenting some advantages over moments of a continuous basis. In this pa- per, we derive \nsome of their properties regarding geomet- rical transformations, as well as some computational \nchar- acteristics. Most of these properties hold for all orthogonal polynomial moments, but when \napplied to discrete ones, no approximation errors appear. By using these properties, we propose \na novel method for the efficient computation of the moments of a 2D object through its . KEY […",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A real-time fuzzy hardware structure for disparity map computation",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s11554-010-0157-6",
            "Abstract": "Stereo images acquired by a stereo camera setup provide depth estimation of a scene. Numerous machine vision applications deal with retrieval of 3D information. Disparity map recovery from a stereo image pair involves computationally complex algorithms. Previous methods of disparity map computation are mainly restricted to software-based techniques on general-purpose architectures, presenting relatively high execution time. In this paper, a new hardware-implemented real-time disparity map computation module is realized. This enables a hardware-based fuzzy inference system parallel-pipelined design, for the overall module, implemented on a single FPGA device with a typical operating frequency of 138 MHz. This provides accurate disparity map computation at a rate of nearly 440 frames per second, given a stereo image pair with a disparity range of 80 pixels and 640 × 480 pixels spatial …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Adaptive neuro-fuzzy inference system in structural damage assesment",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Eleni-Vrochidou/publication/266631113_Adaptive_Neuro-Fuzzy_Inference_System_in_Structural_Damage_Assessment/links/560a50bf08ae4d86bb13729a/Adaptive-Neuro-Fuzzy-Inference-System-in-Structural-Damage-Assessment",
            "Abstract": "The non-linear dynamic analysis of constructions is a time consuming process. This paper proposes a method based on an Adaptive Neuro-Fuzzy Inference System (ANFIS) for automatic seismic structural damage classification. A set of 200 artificial accelerograms is utilized. The severity of these seismic excitations is described by 20 widely used seismic parameters. The global structural damage index Maximum Inter-Storey Drift Ratio (MISDR) is used as metric to quantify and classify the structural damage caused to a certain structure, into 4 categories (negligible, weak, moderate, severe). Results indicate that the proposed model is suitable for adaptive predictive control of the behavior of the construction for seismic signals and its accuracy rates up to 89.5%. The proposed method is compared to previous reported fuzzy techniques. Further study attempts to decrease the number of parameters used and maintain the same level of classification performance.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accurate calculation of image moments",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4271528/",
            "Abstract": "Image moments have been extensively used as feature descriptors. However, the quantization error introduced in discrete signals presents problems, especially when dealing with small-size images. This results in the fact that the invariant properties of moments are compromised. In this paper, we present a technique suitable for the calculation of moments from a continuous signal, derived by piecewise polynomial interpolation of the corresponding discrete one. The computed moments exhibit significantly increased accuracy while requiring trivial computational effort. Zernike moments are then computed using the proposed scheme and are shown to display increased stability to geometrical transformations.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:2KloaMYe4IUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementation of non-linear filters using nanoelectronic single-electron circuitry",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269204001181",
            "Abstract": "Non-linear filters are large family of filters used in signal and image processing. They have found numerous applications such as in digital image restoration, speech processing and coding, digital TV applications, etc. In this paper, two binary non-linear filters, the three-point median filter and the 2×2-pixel morphological opening filter are designed using nanoelectronic single-electron circuitry. In single-electron circuits bits of information are represented by the presence or absence of single electrons at conducting islands. The two nanoelectronic filters are simulated using a Monte Carlo technique and their correct and stable logical operation is confirmed.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:TQgYirikUcIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Enhancement of perceptually salient contours using a parallel artificial cortical network",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s00422-005-0040-x",
            "Abstract": "In this paper we present a parallel artificial cortical network inspired by the Human visual system, which enhances the salient contours of an image. The network consists of independent processing elements, which are organized into hypercolumns. They process concurrently the distinct orientations of all the edges of the image. These processing elements are a new set of orientation kernels appropriate for the discrete lattice of the hypercolumns. The Gestalt laws of proximity and continuity that describe the process of saliency extraction in the human brain are encoded by means of weights. These weights interconnect the kernels according to a novel connection pattern based on co-exponentiality. The output of every kernel is modulated by the outputs of its neighboring kernels, according to a new affinity function. This function takes into account the degree of difference between the facilitation of the two lobes …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A New Approach to Machine Contour Perception",
            "Publication year": 2019,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9780429081385-139/new-approach-machine-contour-perception-vassilios-vonikakis-ioannis-andreadis-antonios-gasteratos",
            "Abstract": "This chapter presents a new shape descriptor suitable for machine contour perception that mimics the orientation selective cells of the human visual cortex. It provides a description for any 2-dimensional shape, regardless of its size, rotation and position, with affordable computational cost. Furthermore, it can identify different shapes of the same object, distorted shapes and heavily contaminated shapes with up to 20% spike noise. The earliest stage of visual processing in the Human Visual System (HVS) is located in the primary visual cortex in an area known as VI. Similarly to the HVS, the proposed shape descriptor uses 12 groups of artificial VI cells each one specialized in detecting any edge with a particular orientation within its receptive field. Cells from higher levels of the HVS, receive whole visual maps of stimulated VI cells, and identify certain combinations among them, resulting to the gradual perception of …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Decomposition of grey-scale morphological structuring elements in hardware",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Antonios-Gasteratos/publication/2948731_Decomposition_of_Grey-Scale_Morphological_Structuring_Elements_in_Hardware/links/0fcfd51091bc508339000000/Decomposition-of-Grey-Scale-Morphological-Structuring-Elements-in-Hardware.pdf",
            "Abstract": "Morphological image processing machines are not capable of handling large-size structuring elements. A new architecture for fast execution of the erosion/dilation operations in an up to 9× 9-pixel, arbitrarily shaped, image window through decomposition of grey-scale morphological structuring element into 3× 3-pixel sub-domains is presented in this paper. The proposed hardware structure has been also implemented in VLSI and its throughput rate is 10 Mbytes/sec.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of Neural Networks Solar Radiation Prediction for Hybrid Renewable Energy Systems",
            "Publication year": 2014,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10008",
            "Abstract": "In this paper a Recurrent Neural Network (RNN) for solar radiation prediction is proposed for the enhancement of the Power Management Strategies (PMSs) of Hybrid Renewable Energy Systems (HYRES). The presented RNN can offer both daily and hourly prediction concerning solar irradiation forecasting. As a result, the proposed model can be used to predict the Photovoltaic Systems output of the HYRES and provide valuable feedback for PMSs of the understudy autonomous system. To do so a flexible network based design of the HYRES is used and, moreover, applied to a specific system located on Olvio, near Xanthi, Greece, as part of SYSTEMS SUNLIGHT S.A. facilities. As a result, the RNN after training with meteorological data of the aforementioned area is applied to the specific HYRES and successfully manages to enhance and optimize its PMS based on the provided solar radiation prediction.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Interdependence between damage indices and ground motion parameters based on Hilbert–Huang transform",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/21/2/025101/meta",
            "Abstract": "Feature extraction from seismic accelerograms is a key issue in characterization of earthquake damage in structures. Until today, a number of effective classical parameters such as peak ground acceleration (PGA) and Arias intensity have been proposed for analyzing the earthquake motion records. The aim of this paper is to search for new crucial characteristic seismic parameters which provide information pertinent to the damage indicators of the structures. The first proposed parameter is the maximum amplitude (A HHT_max) and the second is the mean amplitude (A HHT_mean). Emphasis of our work has been placed on the use of the Hilbert–Huang transform (HHT). A set of 13 natural accelerograms from worldwide well-known sites with strong seismic activity have been used. The HHT has been applied to the nonlinear and non-stationary data (earthquake recordings). Each complex seismic accelerogram is …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:ufrVoPGSRksC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Color processing–a new approach based on discrete dynamic systems",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=9855419445813026449&hl=en&oi=scholarr",
            "Abstract": "Nowadays, although an increased number of people tend to use high-quality images for their daily activities, there are some applications where it is useful to have a reduced number of colors in our images. In this article, a color reduction approach is presented based on Cellular Automata (CA). More specifically, we exploit the inherent properties of CA, in order to locally detect the dominant color values and replace the colors of a predetermined neighborhood with these values. This method is applicable to any type of color image and it can accommodate any type of color space. The final results indicate that there is enough space for future improvements in this field.1 INTRODUCTION: The reduction of the number of colors in digital images is still an active research area in image processing. Color reduction is the process of reducing the number of colors in an image, in order to improve its display or file handling …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Image Restoration through Kohonen Self-Organizing Network",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=12290218819766687280&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy area-based image scaling",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4258355/",
            "Abstract": "In this paper, we propose an interpolation scheme for performing image scaling by utilizing a dynamic mask combined with a sophisticated neighborhood averaging fuzzy algorithm. The functions that contribute to the final interpolated image are the areas of the input pixels, overlapped by a dynamic mask and the differences in intensity of the input pixels. Simple fuzzy if-then rules for these two functions are presented in order to carry out the interpolation task. Simulation results have shown a fine high-frequency response and low interpolation error in comparison to other widely used algorithms. The interpolation can be applied to both gray scale and color images, for any scaling factor.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integrated architecture for adaptive image stabilization in zooming operation",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4560136/",
            "Abstract": "This paper presents a novel architecture for integrating digital stabilizer with the camera zooming process. The proposed architecture scheme allows integration for both optical and digital zooming operation scenarios. The stabilizer adjusts its operational parameters from the current optical zooming status for a refined local motion estimation. Subsequently, the global motion compensation vectors, produced by the digital stabilizer, are sent to the digital zooming system, where the image compensation is merged within the interpolation process. Experimental results indicate that the proposed architecture can improve not only the quantitative performance of digital stabilization but also the computational efficiency when zooming is employed.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy Membership Function Generation and Defuzzification Through Analog Circuitry",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.416.5092&rep=rep1&type=pdf",
            "Abstract": "In this paper we present analog electronic module design and implementation through off-the shelf chips for fuzzy membership function shaping and defuzzification operations. Experimental results exhibiting the performance of the proposed modules are presented.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance analysis for canonical Huffman coding with fixed window size",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/document/7444238/",
            "Abstract": "The compression efficiency of canonical Huffman coding is drastically affected by the size of the compression window, the choice of which is typically done heuristically analytic bounds for the worst-case compression efficiency of canonical Huffman coding are introduced, as a function of the size of the compression window. The derived bounds offer fine-grained control over the compression latency-efficiency trade-off.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:XiVPGOgt02cC",
            "Publisher": "IET"
        },
        {
            "Title": "Performance and computational burden of histogram based color image retrieval techniques",
            "Publication year": 2005,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm00090",
            "Abstract": "Due to the fact that image libraries have largely become overcrowded, the need of improved methods for retrieving color images from such libraries has increased immensely. Color-based Image Retrieval (CBIR) is a collection of techniques for retrieving images on the basis of color. An efficient tool, which is widely used in CBIR, is image color histograms. In this paper we present a comparison among the methods used to compare global and local histograms in the color spaces of RGB, HSV, L* a* b* and LCH. Moreover, the computational burden of all the systems carried out was compared and discussed both in terms of CPU time and number of computations. One of the key results from the experiments with global histograms was that the main computational burden was produced by the color space transforms rather than the comparative techniques. All the comparisons of the featured methods were performed …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Implementation of morphological filters using coordinate logic operations",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320301000176",
            "Abstract": "In this paper we present a methodology for performing morphological operations using coordinate logic operations. Coordinate logic operations are simple and fast because they are logic operations among the corresponding binary values of the image pixels. Coordinate logic (CL) filters are a family of fast non-increasing, non-linear filters, which are based on coordinate logic operations. CL filters exhibit analogous properties to those of the morphological filters but due to their different definition they display slightly different response. This is revoked in this paper by using appropriate image gray level quantization and mapping of the resulting levels to a specific set of decimal numbers. Based on this approach some fast efficient implementations of morphological filters using CL operators are proposed.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Robust document binarization with OFF center-surround cells",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-011-0214-1",
            "Abstract": "This paper presents a new method for degraded-document binarization, inspired by the attributes of the Human Visual System (HVS). It can deal with various types of degradations, such as uneven illumination, shadows, low contrast, smears, and heavy noise densities. The proposed algorithm combines the characteristics of the OFF center-surround cells of the HVS with the classic Otsu binarization technique. Cells of two different scales are combined, increasing the efficiency of the algorithm and reducing the extracted noise in the final output. A new response function, which regulates the output of the cell according to the local contrast and the local lighting conditions is also introduced. The Otsu technique is used to binarize the outputs of the OFF center-surround cells. Quantitative experiments performed on a set of various computer-generated degradations, such as noise, shadow, and low contrast …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Real-time stereo vision techniques",
            "Publication year": 2008,
            "Publication url": "http://www.br2-publication.com/download/publications/conference_proceedings/Georgoulas_VLSI_SoC_2008.pdf",
            "Abstract": "This PhD aims at the design and implementation of real-time hardware-based stereo vision systems. Stereo vision deals with images acquired by a stereo camera setup, where the disparity between the stereo images allows depth estimation within a scene. In the first part of my research a new hardwareefficient real time disparity map computation module was developed which involved a fully parallel-pipelined design, for the overall module, realized on a single FPGA device. The design technique was extended to include the hardware implementation of a fuzzy inference system (FIS), to deal more efficiently with the detection of conjugate pairs in stereo images, which is a challenging research problem known as the correspondence problem, ie to find for each point in the left image, the corresponding point in the right one. The performance of the hardware implemented design methodologies was evaluated against the state of the art methods to prove their efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fast centre–surround contrast modification",
            "Publication year": 2008,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-ipr_20070012",
            "Abstract": "A new algorithm for fast contrast modification of standard dynamic range (SDR) images (8 bits/channel) is presented. Its thrust is to enhance the contrast in the under-/over-exposed regions of SDR images, caused by the low dynamic range of the capturing device. It is motivated by the attributes of the shunting centre–surround cells of the human visual system. The main advantage of the proposed algorithm is its O(N) complexity which results in very fast execution, even when executed on a conventional personal computer (0.2 s/frame for a 640×480 pixel resolution on a 3 GHz Pentium 4). Thus, it moderately increases the computational burden if it is used as a pre-processing stage for other image processing algorithms. The proposed method is compared with other established algorithms, which can enhance the contrast in the under-/over-exposed regions of SDR images: the multi-scale Retinex with colour …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "An event-driven model simulating fundamental seismic characteristics with the use of cellular automata",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474706511002361",
            "Abstract": "This paper presents an extensive simulation tool based on a Cellular Automata (CA) system that models fundamental seismic characteristics of a region. The CA-based dynamic model consists of cells-charges and it is used for the simulation of the earthquake process. The simulation tool has remarkably accelerated the response of the model by incorporating principles of the High Performance Computing (HPC). Extensive programming features of parallel computing have been applied, thus improving its processing effectiveness. The tool implements an enhanced (or hyper-) 2-dimensional version of the proposed CA model. Regional characteristics that depend on the seismic background of the area under study are assigned to the model with the application of a user-friendly software environment. The model is evaluated with real data that correspond to a circular region around Skyros Island, Greece, for different …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "HHT-Based artificial seismic accelerograms generation",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44654-6_47",
            "Abstract": "A new efficient approach for generating spectrum-compatible seismic accelerograms is proposed. It is based on the Hilbert-Huang Transform (HHT); one natural seismic accelerogram is decomposed into frequency and amplitude components. The components are appropriately modified to synthesize the artificial seismic accelerogram that appears to have compatible acceleration spectrum with the natural seismic accelerogram. The HHT is an adaptive signal processing technique for analyzing nonlinear and non-stationary data such as seismic accelerograms. With HHT a seismic accelerogram is decomposed into a finite and small set of components. These components have well defined instantaneous frequencies, estimated by the first derivative of the phase of the analytic signal. The method is tested using twenty natural seismic records and a comparison with two established methodologies is provided.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:EkHepimYqZsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Efficient hardware architectures for computation of image moments",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077201404000890",
            "Abstract": "Geometric moments are used in numerous image analysis tasks. While several approaches have been proposed, real-time computation is still inefficient. In this paper, a mathematical formulation of the relationship of the all-pole filter output to the geometric moments is discussed. Using this formulation, architectures for implementing in hardware geometric moments of 1, 2 or 3D objects are proposed. Four implementations are programmed in field programmable logic devices (FPGA) devices with typical clock frequencies of 40 MHz. The speed of these devices is adequate for real-time applications, and they can be used to extract local as well as global geometric moments.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Fast image retrieval based on attributes of the human visual system",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4052219/",
            "Abstract": "In this paper we present a new method for content-based image retrieval (CBIR), based on the retinal signal processing of the human visual system (HVS). A center-surround operator similar to the receptive fields of the ganglion cells of the retina is employed to create a new form of color histogram, the center-surround histogram (CSH). Unlike other proposed color histograms, the CSH takes into consideration only the visual signal surrounding the zero-crossings of an image. This reduces the processed amount of visual information and minimizes the computational burden. Furthermore, a combination of spatial and chromatic information of the image is also achieved. The method is compared to other contemporary methods for image retrieval, exhibiting better results in shorter computational times",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High performance stereo system for dense 3-D reconstruction",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6662410/",
            "Abstract": "3-D stereo reconstruction, a technique that estimates per-pixel depth in a scene, is still a challenging problem mainly due to some prohibitive factors that limit its performance and computational ability. The aim of this paper is to present a new hardware-efficient disparity map computation, which is based on disparity space image processing using discrete dynamic systems. The hardware architecture of the proposed system was implemented on a high-end field programmable gate array (FPGA) device, offering real-time 3-D reconstruction speeds using a hardware aware architecture based on parallelism and process pipelining. The proposed architecture fulfills the requirements of real-world applications regarding resource usage, frame rates, and disparity resolution, while its implementation on an Altera Stratix IV family FPGA device can extract disparity maps of up to 1280 × 1024 pixels with up to 128 disparity …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An FPGA implemented cellular automaton crowd evacuation model inspired by the electrostatic-induced potential fields",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933110000323",
            "Abstract": "This paper studies the on-chip realisation of a dynamic model proposed to simulate crowd behaviour, originated from electrostatic-induced potential fields. It is based on cellular automata (CA), thus taking advantage of their inherent ability to represent sufficiently phenomena of arbitrary complexity and, additionally, to be simulated precisely by digital computers. The model combines electrostatic-induced potential fields to incorporate flexibility in the movement of pedestrians. It primarily calculates distances in an obstacle filled space based on the Euclidean metric. Furthermore, it adopts a computationally fast and efficient method to overcome trouble-inducing obstacles by shifting the moving mechanism to a potential field method based on Manhattan-distance. The hardware implementation of the model is based on FPGA logic. Initialisation of the dedicated processor takes place in collaboration with a detecting and …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A fast fuzzy K-nearest neighbour algorithm for pattern classification",
            "Publication year": 2000,
            "Publication url": "https://content.iospress.com/articles/intelligent-data-analysis/ida00020",
            "Abstract": "A fast procedure for classifying a given test pattern to one of its possible classes using both the K-NN decision rule and concepts of the fuzzy set theory is described in this paper. The method is divided into two steps; in the first step the K nearest neighbours are found using a fast procedure, whereas in the second step the test pattern is classified using a fuzzy distance measure. The fast K-NN algorithm proceeds in finding a region containing at least K neighbours around the test sample by utilising an ordered search procedure of the test point from three reference points. In the sequence the found region is modified in such a way that the real K nearest neighbours of the given point will be always inside it. Then a small number of distance calculations are required to identify the true K-nearest neighbours and the fuzzy measure is applied to classify the test pattern. The pre-processing load is quite moderate and …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:WqliGbK-hY8C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Fast implementation of morphological operations using binary image block decomposition",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219467804001361",
            "Abstract": "Morphological transformations are commonly used to perform a variety of image processing tasks. However, morphological operations are time-consuming procedures since they involve ordering and min/max computation of numbers resulting from image interaction with structuring elements. This paper presents a new method that can be used to speed up basic morphological operations for binary images. To achieve this, the binary images are first decomposed in a set of non-overlapping rectangular blocks of foreground pixels that have predefined maximum dimensions. Then off-line dilation and erosion of all rectangular blocks are arbitrary obtained and stored into suitable look-up array tables. By using the look up tables, the results of the morphological operations to the rectangular blocks are directly obtained. Thus, first all image blocks are replaced by their look-up array tables. Then the morphological …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:vRqMK49ujn8C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Soft Morphology in the HSV Color Space: Definitions and Implementation",
            "Publication year": 2002,
            "Publication url": "https://www.ingentaconnect.com/content/ist/cgiv/2002/00002002/00000001/art00071",
            "Abstract": "In this paper a new approach to soft color image mathematical morphology, called soft vector morphology, is presented. Its main characteristic is that it is compatible to soft gray-scale morphology. Furthermore, it is vector preserving technique. The primary and secondary soft vector morphological operations are defined. Then experimental results provided demonstrate that - analogously to their grayscale counterparts - soft vector morphological transforms are advantageous regarding small detail preservation and impulse noise attenuation from color images, in comparison to the corresponding standard vector morphological transforms recently introduced in Ref. 8. Finally, a new hardware FPGA structure capable of executing soft/standard vector erosion and dilation is presented. It processes two-dimensional 24-bit resolution color images by means of a 3 × 2-pixel 24-bit resolution color structuring element. Its …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Society for Imaging Science and Technology"
        },
        {
            "Title": "Fast Dynamic Range Compression for Grayscale Images",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Antonios-Gasteratos/publication/235350541_Fast_Dynamic_Range_Compression_for_Grey_Scale_Images/links/54721df70cf2d67fc035c3f2/Fast-Dynamic-Range-Compression-for-Grey-Scale-Images.pdf",
            "Abstract": "This paper presents a new center-surround network for the dynamic range compression of grayscale images. The proposed method exploits some of the shunting characteristics of biological center-surround networks, in order to reduce the effects of uneven illumination and improve the dynamic range of images. The main advantage of the proposed method is its low computational burden, which allows the rendition of high-resolution 5-MPixel images in approximately 1.3 seconds, when executed by a conventional personal computer. The method is compared to the latest commercial version of the Retinex algorithm, and exhibits promising results for a wide variety of real images and lighting conditions.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Empirical Lipschitz Constants for the Renyi Entropy Maximum Likelihood Estimator",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8643800/",
            "Abstract": "Mathematical tools that are widely employed for the distribution-free analysis of the finite-sample performance of empirical estimators-like Efron-Stein's inequality, or Azuma's martingale inequality and derivatives-rely on the provision of tight bounds for the Lipschitz constants of the estimators. Lipschitz constants can be easily derived for simple functionals of the empirical measures, such as the Shannon or the Tsallis entropy. However, obtaining tight bounds for more generalized entropy functionals which cannot be decomposed into sums of identical terms is much more involved. The goal in this paper is the derivation of (empirical) Lipschitz constants for the maximum likelihood estimator of the family of Renyi entropies of order λ > 0, λ ≠ 1. Analytic solutions for the optimal constants are obtained for the most important special cases; namely, for 0 <; λ <; 1, for 1 <; λ <; 2 as well as for λ = 2 (collision entropy) and λ = 3 …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "2010 Index IEEE Transactions on Instrumentation and Measurement Vol. 59",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5625115/",
            "Abstract": "This index covers all technical items - papers, correspondence, reviews, etc. - that appeared in this periodical during the year, and items from previous years that were commented upon or corrected in this year. Departments and other items may also be covered if they have been judged to have archival value. The Author Index contains the primary entry for each item, listed under the first author's name. The primary entry includes the coauthors' names, the title of the paper or other item, and its location, specified by the publication abbreviation, year, month, and inclusive pagination. The Subject Index contains entries describing the item under all appropriate subject headings, plus the first author's name, the publication abbreviation, month, and year, and inclusive pages. Note that the item title is found only under the primary entry in the Author Index.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal code length estimates from dependent samples with bounds on the estimation error",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7560625/",
            "Abstract": "Modern communication networks require robust and adaptive communication protocols to optimize various performance metrics, such as latency and energy efficiency. Adaptive communication protocols require real-time estimation of critical system parameters, amongst which the average length of an optimal source code is of key importance, when data compression is involved. In this letter, we prove finite-sample estimates-along with their confidence levels-of the worst case average length of an optimal source code over a channel transmitting dependent data. More specifically, this is achieved by establishing a concentration inequality for the estimation of entropy of the source. Data dependence is modeled through stationary mixing. Evaluation of the proposed bounds is computationally efficient and can be used for real-time estimation.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integrated dynamic image stabilizer applied to zooming systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4258250/",
            "Abstract": "In this paper, we propose a new integrated architecture for a dependent stabilization and zooming process. The stabilization system adapts its operational parameters from the current optical zooming status and subsequently stabilization parameters are introduced, as an additional input, to the digital zooming system for the interpolation process. With this approach the stabilization system is dynamic, with no permanent setup only for the non-zooming operation of the camera, making the whole architecture dependent and not strictly sequential. Additionally, the digital image stabilization system introduces an input to the digital zooming system in order to carry out simultaneously the image compensation and the image zooming within the interpolation procedure. Experimental results showed that the proposed integrated architecture exhibit better performance compared to the existing conventional stabilization …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient technique for the computation of ART",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4454236/",
            "Abstract": "The angular radial transform (ART) is the region-based shape descriptor for MPEG-7. It is a compact descriptor that presents invariance to simple transformations, while presenting very low information redundancy. However, limited effort has been spent on the fast computation of ART, which is of the essence, especially in systems with sparse computational resources. In this paper, we present an efficient implementation of the descriptor, relating it to accumulation moments. The approximations used are shown not to affect the final 140-bit descriptor, and the architecture is capable of processing images up to one order of magnitude faster than the conventional method.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Albizuri, FX, see Raducanu, B.,(3ą4) 359 Alexandre, LA, AC Campilho and M. Kamel, On combining classifiers using sum and product rules,(12) 1283 Allende, H., J. Galbiati and R. Vallejos, Robust image modeling on image processing,(11) 1219",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=6867030607089335452&hl=en&oi=scholarr",
            "Abstract": "Biswas, KK, see Jadon, RS,(13) 1359 Bloyet, D., see Xue, J.-H.,(3ą4) 395 Bolon, Ph., see Coquin, D.,(14) 1483 Bonnet, N., see Herbin, M.,(14) 1557 Booth, W., see Melhi, M.,(10) 1059 Borgefors, G., G. Ramella and GS Baja, Shape and topology preserving multi-valued image pyramids for multi-resolution skeletonization,(6ą7) 741",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image dominant colors estimation and color reduction via a new self-growing and self-organized neural gas",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11578079_100",
            "Abstract": "A new method for the reduction of the number of colors in a digital image is proposed. The new method is based on the development of a new neural network classifier that combines the advantages of the Growing Neural Gas (GNG) and the Kohonen Self-Organized Feature Map (SOFM) neural networks. We call the new neural network: Self-Growing and Self-Organized Neural Gas (SGONG). Its main advantage is that it defines the number of the created neurons and their topology in an automatic way. Besides, a new method is proposed for the Estimation of the Most Important of already created Classes (EMIC). The combination of SGONG and EMIC in color images results in retaining the isolated and significant colors with the minimum number of color classes. The above techniques are able to be fed by both color and spatial features. For this reason a similarity function is used for vector comparison. To …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:epqYDVWIO7EC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Image Retrieval Using Krawtchouk Chromaticity Distribution Moments.",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/50783529/IMAGE_RETRIEVAL_USING_KRAWTCHOUK_CHROMATICITY.PDF",
            "Abstract": "In this paper a set of Krawtchouk Chromaticity Distribution Moments (KCDMs) for the effective representation of image color content is introduced. The proposed method describes chromaticity through a set of KCDMs applied on the associated chromaticity distribution function in the L* a* b* color space. The computational requirements of this approach are relatively small, compared to other methods addressing the issue of image retrieval using color features. This has a direct impact on the time required to index an image database. Furthermore, due to the short-length of KCDMs feature vector, there is a straight reduction on the time needed to retrieve the whole database. Comparing to previous relative works, KCDMs provide a more accurate representation of the L* a* b* chromaticity distribution functions, since no numerical approximation is involved in deriving the moments. Furthermore, unlike other orthogonal moments, Krawtchouk moments can be employed to extract local features of a chromaticity diagram. This property makes them more analytical near the centre of mass of the chromaticity distribution. The theoretical framework is validated by experiments which prove the superior performance of KCDMs above other methods.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Morphological granulometries for color images",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.67.737&rep=rep1&type=pdf",
            "Abstract": "In this paper a new morphological technique for size and shape analysis of color granular images is presented. The method is based on the sieving model reported by Matheron. According to this model, granular images can be characterised by means of the manner in which they are sieved through various size and shape sieves. The morphological operations that are used in this analysis are defined by means of a new ordering of vectors (colors) of the HSV color space. Minimum and maximum operators are defined, and the fundamental morphological operations are extracted. The proposed method was tested with a variety of images and such experimental results are provided.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cellular Automata-based Architecture for Cooperative Miniature Robots.",
            "Publication year": 2013,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=15575969&AN=90209963&h=08kMC6q3BpuTAXH1kMt6PUmuEeKNnbvo62nu8yR5BtLAZPO9T1fjoQYgQYyaUMImGt83RilHE8ImTrFbU7%2BSnA%3D%3D&crl=c",
            "Abstract": "The creation of collision-free paths for mobile robots, also known as the path planning problem, is a vibrant research field of robotics. Most related approaches for robotic teams display an increment of their total complexity due to the cooperative tasks that must be simultaneously achieved such as forming specific patterns. In addition, these methods extensively bind resources of the system in order to be fully functional and thus, no further tasks could be performed. In this paper, a path planning approach based on Cellular Automata (CA) is introduced. The proposed method assumes that a predefined distance must be covered by a team of robots while preserving their initial formation through cooperations. Due to its simplicity, the resulted computational burden permits the implementation of different methods in the same system in order to accomplish further tasks including image processing techniques. The usage of …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A center-surround histogram for content-based image retrieval",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-011-0217-y",
            "Abstract": "In this paper, a new type of histogram which incorporates only the visual information surrounding the edges of the image is introduced. The edge extraction operation is performed with the use of a center-surround operator of the Human Visual System. The proposed Center-Surround Histogram (CSH) has two main advantages over the classic histogram. First, it reduces the amount of visual information that needs to be processed and second, it incorporates a degree of spatial information when used in content based image retrieval applications. The method is compared with other contemporary image retrieval methods, including that of another edge color histogram, on two different databases. The comparison shows that the use of CSH exhibits better results in shorter execution times.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A FUZZY IMPULSE NOISE DETECTION AND SUPPRESSION FILTER FOR COLOR IMAGES",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702661_0073",
            "Abstract": "This paper describes the function of a noise detection and suppression filter that uses fuzzy logic techniques and aims both at improved performance and reduced computational complexity. It is applicable to color images and outperforms other similar reported techniques in terms of quality indexes and image detail preservation. The filter specializes in the detection and elimination of random and fixed valued impulse noise. The improved performance of the algorithm is confirmed by experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "3wMEVMMAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solar radiation time-series prediction based on empirical mode decomposition and artificial neural networks",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44654-6_44",
            "Abstract": "This paper presents a new model for daily solar radiation prediction. In order to capture the hidden knowledge of existing data, a time-frequency analysis on past measurements of the solar energy density is carried out. The Hilbert-Huang transform (HHT) is employed for the representation of the daily solar irradiance time series. A set of physical measurements and simulated signals are selected for the time series analysis. The empirical mode decomposition is applied and the adaptive basis of each raw signal is extracted. The decomposed narrow-band amplitude and frequency modulated signals are modelled by using dynamic artificial neural networks (ANNs). Nonlinear autoregressive networks are trained with the average daily solar irradiance as exogenous (independent) input. The instantaneous value of solar radiation density is estimated based on previous values of the time series and previous …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An anticipative crowd management system preventing clogging in exits during pedestrian evacuation processes",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5659493/",
            "Abstract": "This paper presents an anticipative system which operates during pedestrian evacuation processes and prevents escape points from congestion. The processing framework of the system includes four discrete stages: a) the detection and tracking of pedestrians, b) the estimation of possible route for the very near future, indicating possible congestion in exits, c) the proposal of free and nearby escape alternatives, and d) the activation of guiding signals, sound and optical. Detection and tracking of pedestrians is based on an enhanced implementation of a system proposed by Viola, Jones, and Snow that incorporates both appearance and motion information in near real-time. At any moment, detected pedestrians can instantly be defined as the initial condition of the second stage of the system, i.e., the route estimation model. Route estimation is enabled by a dynamic model inspired by electrostatic-induced potential …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cellular Automata Architectures for Pattern Recognition",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780124438804500685",
            "Abstract": "This chapter presents the development of a number of different and complimentary pattern classification techniques, based on parallel cellular automata architectures. The concepts of pattern classification and recognition are extremely crucial in the diverse fields of today's technology. The ability to successfully classify and to recognize patterns is an imperative issue in intelligent and expert systems. A pattern is defined as a set of data, ordered in any number of dimensions. A pattern class is a collection of patterns that share some common features and characteristics. Patterns may represent images, sound data, data describing the input and output of a control system, the inference rules of an expert system and, in general, any ordered set of data. The appropriate solution for applications that involve complex pattern classes and require fast and accurate classification is the development of parallel …",
            "Abstract entirety": 0,
            "Author pub id": "3wMEVMMAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Academic Press"
        }
    ]
}]