[{
    "name": "Κιαμάλ Πεκμεστζή",
    "romanize name": "Kiamal Pekmestzi",
    "School-Department": "Ηλεκτρονικών Μηχ και Μηχ Υπολογιστών",
    "University": "ntua",
    "Rank": "Καθηγητής",
    "Apella_id": 2013,
    "Scholar name": "Kiamal Pekmestzi",
    "Scholar id": "MVkryn8AAAAJ",
    "Affiliation": "Emeritus Professor, Electrical & Computer Eng., National Technical Univ. of Athens",
    "Citedby": 1357,
    "Interests": [
        "VLSI Design",
        "FPGAs",
        "Microprocessor Systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=MVkryn8AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Extending an embedded RISC microprocessor for efficient translation based Java execution",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933109000635",
            "Abstract": "Java has gained great popularity in embedded appliances such as set-top boxes, smart phones and other hand held devices. In this paper we propose a translation based hw/sw codesigned Java virtual machine architecture, which extends a typical embedded RISC processor. The architectural extensions we propose include special instructions that accelerate translated blocks dispatch and security checks for arrays and objects. The extensions are done in a way that operating systems support is maintained, something that makes their adoption more attractive. Benchmarking using Embedded Caffeine Mark (ECM) benchmarks, showed significant speedups, especially when high performance RISC processors are employed.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "FF-DICE: An 8T soft-error tolerant cell using Independent Dual Gate SOI FinFETs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6873696/",
            "Abstract": "In this paper we present FF-DICE (Footless-FinFET-DICE), an 8T footless storage element that exhibits soft error resilience characteristics to Single Event Upsets. The proposed cell utilises IDG (Independent Dual Gate) FinFETs to merge the functions of a typical cell's NMOS drivers and NMOS access transistors, thereby saving 33% of the transistors required for a typical DICE cell. Given the IDG FinFET dual gate mutual coupling and excellent control over the transistor conductive channel, simulations show that the proposed cell can operate as a regular memory cell, with Static Voltage Noise Margin of 341mV, Static Current Noise Margin of 15uA and provides soft-error immunity to particle strikes on single nodes, as well as considerable area savings compared to similar designs.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of Efficient 1's Complement Modified Booth Multiplier",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7723559/",
            "Abstract": "The 2's complement representation is widely adopted, since compared to the other signed number systems has the advantage of simpler addition and single representation of zero. Sing-magnitude representation is used in digital signal processors for the representation of digital signals for low-power purposes. The 1's complement representation compared to the 2's complement one has the advantages of the simpler conversion to and from the sign-magnitude representation, simpler negation and that truncation of negative numbers is equivalent to that of the sign-magnitude representation. Therefore, the design of efficient arithmetic units for this system should be examined. In this work 1's complement modified Booth multipliers with complexity similar to that of the 2's complement ones are proposed.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy-efficient VLSI implementation of multipliers with double LSB operands",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/document/8863230/",
            "Abstract": "Multiplication is an arithmetic operation that has a significant impact on the performance of various real-life applications, such as digital signal processing, image processing and computer vision. In this study, targeting to exploit the efficiency of alternative number representation formats, the authors propose an energy-efficient scheme for multiplying 2's-complement binary numbers with two least significant bits (LSBs). The double-LSB (DLSB) arithmetic delivers several benefits, such as the symmetric representation range, the number negation performed only by bitwise inversion, and the facilitation of the rounding process in the results of floating point architectures. The hardware overhead of the proposed circuit, when implemented at 45 nm, is negligible in comparison with the conventional Modified Booth multiplier for the ordinary 2's-complement numbers (3.1% area and 3.3% energy average overhead for different …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IET"
        },
        {
            "Title": "Exploiting the Potential of Approximate Arithmetic in DSP & AI Hardware Accelerators",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9556418/",
            "Abstract": "Approximate computing is an emerging design paradigm, which exploits the inherent error resilience of numerous applications to improve their energy efficiency and/or performance. The current paper focuses on applications from the DSP and AI domains, and examines the impact of arithmetic approximations on accelerators for FPGA and ASIC technologies. Based on our design methodology, we implement and evaluate approximate architectures for image processing, signal filtering, telecommunication digital functions, and convolutional neural networks. The evaluation shows that sophisticated bit-level optimizations and disciplined approximations deliver significant gains in the hardware resources and performance of the accelerator in exchange for small errors and tunable accuracy loss.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cache based stack folding technique for high performance Java processors",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1167999.1168009",
            "Abstract": "Java processors have been introduced to offer hardware acceleration for java applications. They execute java bytecodes directly in hardware. However, the stack nature of the java virtual machine instruction set imposes a limitation on the achievable execution performance. If we intend to exploit instruction level parallelism, we must remove the stack completely. This can be achieved by recursive stack folding algorithms, such as OPEX, which dynamically transform groups of java bytecodes to RISC like instructions. However, the decoding throughputs that are obtained are limited. In this paper we propose a novel stack folding technique, that uses a predecoded cache to store folded bytecodes, thus enabling reuse. The decoding throughput reaches 4 RISC instructions per cycle. With use of a superscalar backend core, the obtained IPC is approximately 2.08 instructions per cycle (or 3.02 java bytecodes per cycle).",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "New Systolic And Low Latency Parallel FIR Filter Schemes",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.136.362&rep=rep1&type=pdf",
            "Abstract": "New systolic schemes with low latency for the paral-lel implementation of FIR and symmetric linear-phase FIR filters are presented. These schemes can be applied to the implementation of either specific or programmable filters. They are based on the use of an extended carry-save form for the representation of the intermediate results. The resulting circuits have reduced hardware complexity compared with other systolic and non-systolic schemes. They also can be pipelined at the bit-level.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hardware peripheral for Java bytecodes translation acceleration",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1774088.1774201",
            "Abstract": "Java has gained great popularity in a wide range of applications. Just-in-time compilation is crucial for providing efficient execution of Java programs, but it is generally a hard task, not suited for embedded systems. This paper presents a hardware acceleration unit for efficient execution of JIT translation in embedded SoCs. The translation is limited to only first level optimizations, which include translation of Java bytecodes to native RISC instructions (stack folding). For experimentation, we developed a SoC with ARM7TDMI processor. In af 80nm ASIC technology and 80MHz clock, we measured a speed up of up to 4 times over the software only JIT translation.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the design of configurable modulo 2n±1 residue generators",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6387014/",
            "Abstract": "In this work new efficient modulo 2 n +1 residue generators are proposed. The input operands are divided into n-bit vectors which are added by an inverted end around carry save adder tree and a final stage diminished-1 modulo 2 n +1 adder. The conversion of the proposed residue generators to configurable modulo 2 n ±1 ones is also discussed. Modulo 2 n ±1 residue generators find applicability as forward converts from the binary to the residue number system, and in the design of self-checking digital systems.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A flexible architecture for DSP applications combining high performance arithmetic with small scale configurability",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080570/",
            "Abstract": "This paper presents the architecture of a flexible and high performance unit for DSP applications. The proposed architecture operates based on fast Carry-Save (CS) arithmetic. A mapping methodology, for datapaths composed with the proposed flexible units, is also presented. It exploits the incorporated features of the proposed units and enables fast computations, high operation densities and advanced data reusability. Experimental results shown that several DSP algorithms can be mapped onto the proposed architecture with high efficiency delivering in average, latency gains of 36.56% and 45.76% compared to the MAC and the primitive resources based datapaths, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Flexible DSP accelerator architecture exploiting carry-save arithmetic",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7027181/",
            "Abstract": "Hardware acceleration has been proved an extremely promising implementation strategy for the digital signal processing (DSP) domain. Rather than adopting a monolithic application-specific integrated circuit design approach, in this brief, we present a novel accelerator architecture comprising flexible computational units that support the execution of a large set of operation templates found in DSP kernels. We differentiate from previous works on flexible accelerators by enabling computations to be aggressively performed with carry-save (CS) formatted data. Advanced arithmetic design concepts, i.e., recoding techniques, are utilized enabling CS optimizations to be performed in a larger scope than in previous approaches. Extensive experimental evaluations show that the proposed accelerator architecture delivers average gains of up to 61.91% in area-delay product and 54.43% in energy consumption compared …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel systolic architecture for an efficient RSA implementation",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44586-2_30",
            "Abstract": "A new systolic serial-parallel scheme that implements the Montgomery multiplier is presented. The serial input of this multiplier consists of two sets of data that enter in a bit-interleaved form. The results are also derived in the same form. The design, with minor modifications, can be used for the implementation of the RSA algorithm. The circuit yields low hardware complexity and permits high-speed operation with 100% efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the design of modulo 2n+ 1 dot product and generalized multiply–add units",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790612001899",
            "Abstract": "In this work, modulo 2n + 1 fused architectures of dot product and generalized multiply–add units for operands in the weighted representation are proposed. According to our algorithm, the partial products and the additive operands are efficiently added using inverted end around carry-save adder trees. This approach results to large savings on delay, area and power compared to using discrete units. Optimization techniques and implementation results for units with practical interest are also given. The proposed modulo 2n + 1 arithmetic units can be utilized in all applications where the residue number system is used for the implementation of digital signal processing and cryptography algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:ldfaerwXgEUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Novel systolic schemes for serial-parallel multiplication",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7078120/",
            "Abstract": "In this paper two new schemes of systolic multipliers are proposed, one based on Modified Booth encoding and the other is based on the selection of one of the terms 0, X, 2X, 3X where x is the serial input of the multiplier. The proposed multipliers operate with 100% efficiency that is without zero words inserted between successive data. Systolisity and the continuous operation are achieved without an increase in hardware complexity. The proposed schemes are especially suited for long number multiplication.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low latency radiation tolerant self-repair reconfigurable SRAM architecture",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026271415302249",
            "Abstract": "In this paper we present a low latency reconfigurable radiation tolerant memory architecture for mission-critical applications based on the RTSR (Radiation Tolerant Self-Repair) cell. The proposed architecture offers detection and correction during the read cycle at high frequencies. Through reconfiguration circuitry, the memory can operate in two modes, one providing soft error tolerance and another geared towards increased (× 3) memory capacity. Compared to the conventional Triple Modular Redundancy, the proposed memory architecture provides radiation tolerance for single and multi-bit upsets with improved latency, area and power characteristics. An enhanced version of the RTSR-based memory architecture is also presented (RTSR+), whereby we can boost performance by embedding a small accelerator circuit. From simulation results on a layout implementation of the proposed memory architecture in a …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:SP6oXDckpogC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Efficient design of magnitude and 2's complement comparators",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016792601930015X",
            "Abstract": "Digital comparators are important arithmetic components used in digital systems to determine if two numbers are equal, or if one number is greater or less than the other. In this work, the design of magnitude and 2's complement comparators is examined. New OR-based full tree and simplified tree magnitude comparator architectures are proposed. The existing and the proposed comparator architectures are implemented in standard cell technology and evaluated, after extensive experimental analysis, in high performance and relaxed conditions. The proposed comparators operate faster than the existing ones, while operating at the same speed yield significant improvement in area complexity and power dissipation.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:eJXPG6dFmWUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Approximate hybrid high radix encoding for energy-efficient inexact multipliers",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8105832/",
            "Abstract": "Approximate computing forms a design alternative that exploits the intrinsic error resilience of various applications and produces energy-efficient circuits with small accuracy loss. In this paper, we propose an approximate hybrid high radix encoding for generating the partial products in signed multiplications that encodes the most significant bits with the accurate radix-4 encoding and the least significant bits with an approximate higher radix encoding. The approximations are performed by rounding the high radix values to their nearest power of two. The proposed technique can be configured to achieve the desired energy-accuracy tradeoffs. Compared with the accurate radix-4 multiplier, the proposed multipliers deliver up to 56% energy and 55% area savings, when operating at the same frequency, while the imposed error is bounded by a Gaussian distribution with near-zero average. Moreover, the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A high radix Montgomery multiplier with concurrent error detection",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7038613/",
            "Abstract": "Modular multiplication is essential in cryptographic algorithms (e.g. RSA), as it determines the performance of the entire cryptographic operation and its reliability is crucial for the system security. In this paper, we propose a high-radix Montgomery Modular Multiplication (MMM) implementation and conduct an exploration to find the optimal radix. Also, a concurrent error detection circuit with 99.9% detection rate, small area and power overheads (2.24% and 1.46% respectively) is proposed to protect the MMM against fault attacks and natural faults.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A systolic, high speed architecture for an RSA cryptosystem",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1020264818843",
            "Abstract": "An architecture based on the RSA public key cryptography algorithm is presented. The circuit includes two components, one for modular squaring and one for modular multiplication. Each component is based on the Montgomery algorithm and implements the modular operations using two modified serial-parallel multipliers. A full modular exponentiation is completed every n(n + 3) clock cycles. All circuits are systolic, operate with 100% efficiency and their maximum combinational delay is equal to one gated Full-Adder. Thus, high-speed performance is achieved while the low cell hardware complexity enables an efficient VLSI implementation.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:O3NaXMp0MMsC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A bit level area aware cache-based architecture for memory repairs",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5560217/",
            "Abstract": "In this paper an architecture for memory Built-In Self-Repair (BISR) is presented. The proposed scheme utilises a multiple bank cache-like memory for repairing defective bits and is a heavily modified version of a previously studied architecture that repaired at the word level, while the proposed repairs at the bit level. This scheme achieves high repair ratios at high defect densities with small overheads. The two architectures are compared on their footprint by means of an area approximation analysis. The proposed modified scheme shows significant area savings (greater than 4 times) while retaining the same high repairability qualities as its predecessor.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A design methodology for high-performance and low-leakage fixed-point transpose FIR filters",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5410902/",
            "Abstract": "This paper addresses the low leakage implementation of fixed-point transpose FIR filters, considering dual-V th  CMOS standard-cell libraries. Specifically, we introduce a design flow, based on a novel two-level selection algorithm, which replaces low-V th  Multiplication-Addition units by their high-V th  counterparts, taking into account the timing slack of each unit and the word-level binary representation of the units' coefficients. The proposed methodology is evaluated on an 8-tap and a 16-tap transpose FIR filters. Post-layout power results demonstrate leakage improvements ranging from 6.69-25.85% for several clock period constraints, compared to the low-V th  FIR implementations. Also, reduction of up to 12.35% is measured in overall power dissipation.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hybrid approximate multiplier architectures for improved power-accuracy trade-offs",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7273494/",
            "Abstract": "Approximate computing forms a promising design alternative for inherently error resilient applications, trading accuracy for power savings. In this paper, we exploit multi-level approximation, i.e. at the algorithmic, the logic and the circuit level, to design low power approximate arithmetic architectures for hardware multipliers. Motivated from the limited power savings that approximation techniques can achieve in isolation, we explore hybrid methods that apply simultaneously more than one techniques from different layers. We introduce the concept of perforation for approximate arithmetic circuit design and we explore the newly defined design space of hybrid designs showing that it leads to lower power consumption at every examined error range. To address the increased complexity of the target design space, we introduce an heuristic optimization technique and the corresponding design framework that …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new low-power soft-error tolerant SRAM cell",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5572816/",
            "Abstract": "In this paper we present a new 12T loadless SRAM cell that exhibits soft error resilience characteristics. The proposed cell is based on an interlocked structure with guard gates that provides an x80 increase in soft error resilience compared to a typical unprotected 6T SRAM cell, while addressing the static power consumption issue of modern CMOS technologies. At a 90nm technology, simulations show that the investigated 12T SRAM cell draws 3 times less leakage current than a DICE cell of similarly sized transistors and 20% less than a typical 6T cell.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An instruction set extension for java bytecodes translation acceleration",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4664854/",
            "Abstract": "Java has become popular in a wide range of applications. Just-in-time translation is crucial for providing efficient execution of Java programs. This paper presents an architecture extension to RISC processors that accelerates Java bytecodes translation. Our results show that the incorporation of this technique in a 4-way superscalar RISC and in one high performance embedded processor gives an average speedup of 2.95x and 2.29x respectively. A first order approximation using ASIC synthesis tools shows that this acceleration is performed with only a small increase in hardware.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A high level synthesis exploration framework with iterative design space partitioning",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-1488-5_7",
            "Abstract": "This chapter introduces a methodology for fast and efficient Design Space Exploration during High Level Synthesis. Motivated by the fact that higher quality design solutions are delivered when a larger number of parameters are explored, we study an augmented instance of the design space considering the combined impact of loop-unrolling, operation chaining and resource allocation onto the final datapath. We propose an iterative design space partitioning exploration strategy based on the synergy of an exhaustive traversal together with an introduced heuristic one. The introduced heuristic is based on a gradient-based pruning technique which efficiently evaluates large portions of the solution space in a quick manner. We show that the proposed exploration approach delivers high quality results, with considerable reductions of the exploration’s runtime in respect to the fully exhaustive approach.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Flexibility Inlining into Arithmetic Data-paths Exploiting A Regular Interconnection Scheme",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4285744/",
            "Abstract": "This paper presents a design technique for coarse grained reconfigurable cores targeting mostly DSP applications. The proposed technique inlines flexibility into custom carry-save-arithmetic (CSA) datapaths exploiting a stable and canonical interconnection scheme. The canonical interconnection is revealed by a uniformity transformation imposed on the basic architectures of CSA multipliers and CSA chain-adders/subtractors. The design flow for the implementation of the core is analyzed in detail, and a novel reconfigurable architecture prototype is presented. The paper concludes with the experimental results showing that our architecture performs an average latency reduction of 32.63%, compared with datapaths of primitive computational resources, with a tolerable overhead in hardware utilization.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A segmentation-based BISR scheme",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6742965/",
            "Abstract": "With memory estate increasing in System-On-Chips and highly integrated products, memory defects and wearout effects are the determining factor in the chip's yield loss and reliability. In this paper, a multiple cache-based Built-in Self-Repair scheme is proposed that is able to repair from the word level down to the bit level. Moreover, it is proved that the level of segmentation does not affect the repair efficiency. An exploration is then conducted to find the optimal scheme in terms of area overhead.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improving Power of DSP and CNN Hardware Accelerators Using Approximate Floating-point Multipliers",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3448980",
            "Abstract": "Approximate computing has emerged as a promising design alternative for delivering power-efficient systems and circuits by exploiting the inherent error resiliency of numerous applications. The current article aims to tackle the increased hardware cost of floating-point multiplication units, which prohibits their usage in embedded computing. We introduce AFMU (Approximate Floating-point MUltiplier), an area/power-efficient family of multipliers, which apply two approximation techniques in the resource-hungry mantissa multiplication and can be seamlessly extended to support dynamic configuration of the approximation levels via gating signals. AFMU offers large accuracy configuration margins, provides negligible logic overhead for dynamic configuration, and detects unexpected results that may arise due to the approximations. Our evaluation shows that AFMU delivers energy gains in the range 3.6%–53.5% for …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:q3oQSFYPqjQC",
            "Publisher": "ACM"
        },
        {
            "Title": "Fused modulo 2n+ 1 Add-Multiply unit for diminished-1 operands",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495110/",
            "Abstract": "Complex arithmetic operations dominate Digital Signal Processing (DSP) applications heavily degrading their performance. Targeting to accelerate the Residue Number Systems-based DSP applications, we optimize the design of the Add-Multiply (AM) operation with modulo 2n + 1 diminished-1 operands by incorporating the direct recoding of the sum of two numbers in its Modified Booth form. Compared to the conventional allocation of an adder and a subsequent multiplier, the proposed fused AM design yields delay, area and power gains.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High performance and area efficient flexible DSP datapath synthesis",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5325815/",
            "Abstract": "This paper presents a new methodology for the synthesis of high performance flexible datapaths, targeting computationally intensive digital signal processing kernels of embedded applications. The proposed methodology is based on a novel coarse-grained reconfigurable/flexible architectural template, which enables the combined exploitation of the horizontal and vertical parallelism along with the operation chaining opportunities found in the application's behavioral description. Efficient synthesis techniques exploiting these architectural optimization concepts from a higher level of abstraction are presented and analyzed. Extensive experimentation showed average latency and area reductions up to 33.9% and 53.9%, respectively, and higher hardware area utilization, compared to previously published high performance coarse-grained reconfigurable datapaths.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DIRT latch: A novel low cost double node upset tolerant latch",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026271416304164",
            "Abstract": "In this paper we propose the novel DIRT (Dual-input Inverter Radiation Tolerant) latch, a soft error tolerant latch that can mitigate both SNUs (Single Node Upsets) and DNUs (Double Node Upsets). The design of the latch is based on the use of a dual-input inverter with independently controlled PMOS and NMOS gates. The proposed latch is compared to known radiation hardened latches and proves to be more efficient than the revised DNU tolerant counterparts in terms of dynamic energy and propagation delay even under PVT variations and with a small energy penalty compared to SNU tolerant latches.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:738O_yMBCRsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Low-latency and high-efficiency bit serial-serial multipliers",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7079824/",
            "Abstract": "A new bit serial-serial multiplier for unsigned numbers is presented in this paper. The numbers being multiplied enter the circuit simultaneously in LSB first bit-serial form. The multiplier is of immediate response, pipelined at the bit level and has small combinational delay. A variation of this multiplier that operates with 100% efficiency, namely it does not require zero bits to be inserted between successive input data words, produces the product in full-precision is also proposed. The proposed schemes are well suited for DSP applications, compared with other schemes exhibit superior performance in terms of hardware complexity and throughput.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "INTEGRATION, the VLSI journal 30 (2001) 179",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=18289368155587014986&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Walking through the energy-error Pareto frontier of approximate multipliers",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8430622/",
            "Abstract": "In this article, we target approximate computing for arithmetic circuits, focusing on the most complex and power-hungry units: hardware multipliers. Driven by the lack of a clear solution on the energy-error efficiency of existing approximate multiplication techniques, we present a new, efficient, and easily applied approximation design, as well as explore the current state-of-the-art design space. We show that the proposed approximation scheme can be equally applied at design time to enable synthesis of customized approximate multiplier circuits and at runtime to support dynamic approximation tuning scenarios. We achieve significant gains-up to 69-percent energy and 64-percent area savings with respect to accurate designs-by proposing hybrid approximation performed by two independent techniques that reduce both the depth (through perforation) and the width (through rounding) of the partial products …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Diminished-1 Modulo  Addition and Subtraction",
            "Publication year": 2020,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218126620300056",
            "Abstract": "In this work, the design of the diminished-1 modulo  adders, subtractors and adders/subtractors are examined. Some of the existing modulo  adders, subtractors and adder/subtractors are redesigned and improved. Compared to other existing implementations, the proposed subtractor and adder/subtractors offer reduced area complexity and lower power consumption, while operating at the same speed. All the considered architectures are modified parallel-prefix adders with fast input carry processing. The totally parallel-prefix and carry look ahead implementation of the proposed arithmetic units are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Modulo 2n±1 Fused Add-Multiply Units",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7309544/",
            "Abstract": "Complex arithmetic operations are widely used in Digital Signal Processing (DSP) applications. Targeting to increase performance, in this work, we focus on optimizing the design of the modulo 2n ± 1 Add-Multiply (AM) operation. The proposed modulo 2n ± 1 fused AM units incorporate an initial row of Half Adders which carry out the requested addition of two specified operands resulting to an intermediate Delayed Carry representation of their sum. The Delayed Carry represented vectors are then multiplied by the specified multiplicand and the partial products are driven to OR logic gates in pairs. Using the appropriate Carry-Save (CS) Adder trees, the resulting n-bit operands are reduced to a pair of CS vectors, which are finally added by a modulo 2n -- 1 or a modulo 2n + 1 adder. Compared to the conventional designs of first instantiating a modulo 2n ± 1 adder and then, driving its output to a modulo 2n ± 1 …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A temperature-aware time-dependent dielectric breakdown analysis framework",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-17752-1_8",
            "Abstract": "The shrinking of interconnect width and thickness, due to technology scaling, along with the integration of low-k dielectrics, reveal novel reliability wear-out mechanisms, progressively affecting the performance of complex systems. These phenomena progressively deteriorate the electrical characteristics and therefore the delay of interconnects, leading to violations in timing-critical paths. This work estimates the timing impact of Time-Dependent Dielectric Breakdown (TDDB) between wires of the same layer, considering temperature variations. The proposed framework is evaluated on a Leon3 MP-SoC design, implemented at a 45nm CMOS technology. The results evaluate the system’s performance drift due to TDDB, considering different physical implementation scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Pipelined array-based FIR filter folding",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1377547/",
            "Abstract": "The elaborate design of folded finite-impulse response (FIR) filters based on pipelined multiplier arrays is presented in this paper. The design is considered at the bit-level and the internal delays of the pipelined multiplier array are fully exploited in order to reduce hardware complexity. Both direct and transposed FIR filter forms are considered. The carry-save and the carry-propagate multiplier arrays are studied for the filter implementations. Partially folded architectures are also proposed which are implemented by cascading a number of folded FIR filters. The proposed schemes are compared as to the aspect of hardware complexity with a straightforward implementation of a folded FIR filter based on the pipelined Wallace Tree multiplier. The comparison reveals that the proposed schemes require 20%-30% less hardware. Finally, efficient implementation of partially folded FIR filter circuits is presented when …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient memory repair using cache-based redundancy",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6069833/",
            "Abstract": "In modern processes, conventional defect density and variability related yield losses are a major concern for the aggressive memory designs in integrated circuits. Synergistic action for memory repair at the circuit and architectural level is essential to maintain the yields and profitability of past technology nodes. In this paper, we propose a scalable memory repair architecture that utilizes a set of direct-mapped cache banks to replace faulty words. Statistical and mathematical probability analysis shows that the proposed scheme achieves high repairability levels with low area and static power dissipation overheads, the latter being a dominant issue in nanometer technologies. It is therefore a suitable solution along with other mature memory repair techniques, to enhance the overall repairability features and guarantee the correct and reliable operation of embedded memories in nanometer technologies.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A column parity based fault detection mechanism for FIFO buffers",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016792601200020X",
            "Abstract": "This paper presents a low cost fault detection mechanism for FIFO buffers. The scheme is based on column parity maintenance in a single register, which is updated by monitoring the values written to and read from the FIFO memory array. A non-zero column parity when the FIFO is empty, constitutes an indication of fault, and this property is exploited for fault detection. The technique has gains in area, power and critical path delay, at the expense of (1) greater detection latency, due to the need for the FIFO to become empty in order to assert a violation and (2) worse Silent Data Corruption (SDC) rate.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:70eg2SAEIzsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the Design of Modulo 2^ n+ 1 Multipliers",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=14810866290198809716&hl=en&oi=scholarr",
            "Abstract": "In this work a new efficient modulo 2n+ 1 modified Booth multiplication algorithm for operands in the weighted representation is proposed. According to our algorithm n/2+ 2 partial products are derived. The resulting partial products are reduced by an inverted end around carry save adder tree to two operands, which are finally added by a diminished-1 modulo 2n+ 1 adder. Our design compares favorably for both area and delay to the modulo 2n+ 1 modified Booth multipliers previously proposed.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Mixed Style Architecture for Low Power Multipliers Based on a Bypass Technique",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=14018832467987122170&hl=en&oi=scholarr",
            "Abstract": "In this paper a new technique for the design of combi-national circuits for low power is introduced. The basic idea is to bypass blocks of logic when their function is not required, using low delay and area overhead components (transmission gates). The internal state of these blocks is kept unchanged, so the switching activity of the circuit is minimized, resulting to low power consumption. While this ideas is mainly applicable to array multipliers, due to their regular interconnection scheme, the reduced area of the Wallace tree multiplier is a real temptation for the designer. Therefore, a mixed style architecture, using a traditional, tree based part, combined with a bypass, array based part, is proposed. It has been found that the bypass technique offers minimum power consumption for all cases while the mixed architecture offers an area* power product improvement ranging from 1.2 x to 6.5 x compared to all other …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the hardware implementation of the 3GPP confidentiality and integrity algorithms",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45439-X_17",
            "Abstract": "This paper discusses the design and implementation of the Confidentiality and Integrity algorithms, which have been standardized by the 3- rdGeneration Partnership Project. Both algorithms use a modified version of the MISTY scheme, named KASUMI, as a basic cryptographic engine. Various architectural approaches have been examined and implemented in different hardware platforms (FPGAs, ASICs) providing useful information regarding the required area and the design throughput.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A predecoding technique for ILP exploitation in Java processors",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1383762108000271",
            "Abstract": "Java processors have been introduced to offer hardware acceleration for Java applications. They execute Java bytecodes directly in hardware. However, the stack nature of the Java virtual machine instruction set imposes a limitation on the achievable execution performance. In order to exploit instruction level parallelism and allow out of order execution, we must remove the stack completely. This can be achieved by recursive stack folding algorithms, such as OPEX, which dynamically transform groups of Java bytecodes to RISC like instructions. However, the decoding throughputs that are obtained are limited. In this paper, we explore microarchitectural techniques to improve the decoding throughput of Java processors. Our techniques are based on the use of a predecoded cache to store the folding results, so that it could be reused. The ultimate goal is to exploit every possible instruction level parallelism in Java …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:3fE2CSJIrl8C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A mixed style multiplier architecture for low dynamic and leakage power dissipation",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5496738/",
            "Abstract": "In this paper a new technique for the design of combinational circuits for low power is introduced. The basic idea is to bypass blocks of logic when their function is not required, using low delay and area overhead components (transmission gates). While this technique offers great dynamic power savings mainly in array multipliers, due to their regular interconnection scheme, it misses the reduced area and fast speed advantages of tree multipliers. Therefore, a mixed style architecture, using a traditional, tree based part, combined with a bypass, array based part, is proposed. Through extensive experimentation it has been found that while the bypass technique offers the minimum dynamic power consumption value, the mixed architecture offers a delay*power product improvement ranging from 1.2x to 6.5x, compared to all other architectures. Furthermore, the tree part of the mixed architecture has enough timing slack …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modulo 2n+1 addition and multiplication for redundant operands",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7038614/",
            "Abstract": "Complex arithmetic operations are widely used in Digital Signal Processing (DSP) applications. Keeping the intermediate results in a redundant representation (e.g. carry-save) is a common technique to speed up chained arithmetic operations due to the elimination of the intermediate parallel additions which occupy significant area and largely increase the overall critical delay. Thus, arithmetic units with operands in a redundant representation are of considerable practical interest. In this work, we propose an efficient modulo 2 n +1 addition unit with one or both operands in the redundant carry-save representation and, also, we introduce an efficient modulo 2 n +1 multiplier with the one of two operands in the redundant carry-save form.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware efficient fast FIR filter based on Karatsuba algorithm",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495158/",
            "Abstract": "In this work, an efficient implementation of a programmable Finite Impulse Response (FIR) filter based on the use of the Karatsuba Multiplication Algorithm (KMA) is presented. In this FIR filter circuit, a parallel, Modified Booth (MB) pre-encoded, Carry-Save (CS) Wallace tree multiplier is used as a building block. The KMA is a fast divide and conquer algorithm for the multiplication of large numbers. As a result, the proposed circuit is highly efficient in terms of speed, area and power in comparison with the Conventional FIR filter architecture. Simulations of FIR filters in transposed form made over standard-cell implementation based on a Faraday 90nm technology show an average reduction of about 15% in the delay, 9% in area and 17% in power.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "100% operational efficient bit-serial programmable FIR digital filters",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7078329/",
            "Abstract": "A new scheme for the implementation of programmable FIR digital filters with 100% operational efficiency is presented in this paper. The term 100% operational efficiency implies that no zero bits have to be inserted between successive input data words in order the filter input to be synchronized with the filter output. Both the input data and the filter output are in two's complement LSB-first bit-serial form. The coefficients are in two's complement bit-parallel form. All the intermediate results and the filter output are produced and handled in full precision. The proposed scheme is based on a special serial-parallel multiplier that operates with 100% efficiency. We exploit the internal registers and the free accumulation input in this multiplier to reduce the hardware complexity of the filter significantly. The proposed scheme is compared from the aspect of hardware complexity and efficiency with other bit-serial schemes.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A regular interconnection scheme for efficient mapping of DSP kernels into reconfigurable hardware",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7098955/",
            "Abstract": "This paper presents a design technique for coarse grained reconfigurable cores targeting mostly DSP applications. The proposed technique inlines flexibility into custom Carry-Save-Arithmetic (CSA) datapaths exploiting a stable and canonical interconnection scheme. The canonical interconnection is revealed by a uniformity transformation imposed on the basic architectures of CSA multipliers and CSA chain-adders/subtracters. The design flow for the implementation of the core is analyzed in detail, and the advanced mapping opportunities are presented. The paper concludes with the experimental results showing that our architecture performs an average latency reduction of 32.63%, compared with datapaths of primitive computational resources, with sufficient hardware utilization.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An elliptic curve cryptosystem design based on FPGA pipeline folding",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4274823/",
            "Abstract": "In this paper we present an efficient design technique for implementing the elliptic curve cryptographic (ECC) scheme in FPGAs. Our technique is based on a novel and efficient implementation of modular multiplication which is the core operation of ECC. To implement large bit-length multiplications we used a novel partitioning and pipeline folding scheme to fit at least 256-bit modular multiplications on a single Virtex-4 FPGA. Comparisons to several other schemes are presented.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the design of efficient modulo 2n+1 multiply-add-add units",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6850645/",
            "Abstract": "In this work efficient modulo 2 n +1 fused multiply-add-add units for weighted and diminished-1 operands are proposed. The proposed architectures can be applied in systems in which fused multiply-add-add units accelerate the execution of the targeting algorithms. Long integer arithmetic would also show considerable gains by using multiply-add-add units. Also, implementation results for the proposed units are given and compared to the performance of existing designs.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low leakage radiation tolerant CAM/TCAM cell",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7229860/",
            "Abstract": "In this paper we propose a leakage-aware soft error tolerant storage element, implementable in standard CMOS technology and able to operate both as a CAM and as a TCAM cell. The proposed cell is immune to SNUs (Single Node Upsets) when operating as a CAM cell and demonstrates partial resilience (75%) when operating as a TCAM cell. Simulation results in SPICE at a 45nm PTM technology show a significant reduction in leakage dissipation compared to the standard but unprotected 6T-based TCAM cell as well as compared to conventional DICE-based CAM/TCAM solutions.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fused modulo 2n+ 1 add-multiply unit for weighted operands",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7483875/",
            "Abstract": "Digital Signal Processing (DSP) applications are dominated by complex arithmetic operations, which heavily degrade their performance. Targeting to accelerate the execution of Residue Number Systems (RNS)-based DSP applications, in this work, we focus on optimizing the design of the modulo 2 n  + 1 Add-Multiply (AM) operation with weighted operands. We incorporate in our design a new direct recoding of the modulo 2 n  + 1 sum of two weighted operands in its Modified Booth form. Compared to the conventional design of first instantiating an adder and then, driving its output to a multiplier, the proposed fused AM design yields considerable delay, area and power gains.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the design of the FFT butterfly units",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937635/",
            "Abstract": "In this paper, efficient designs of the Fast Fourier Transform (FFT) Decimation-in-Time (DIT), radix-2, Butterfly Unit are proposed. Several techniques are incorporated in order to achieve higher performance. The operations are fused by keeping the intermediate variables in Carry-Save format. Besides of the conventional, the Gauss complex multiplication algorithm is also explored. Considered that the twiddle factors cosφ, sinφ used in FFT algorithm are constant numbers, we apply to them a special NR4SD encoding scheme with the following sets of digit values: {-2, -1, 0, +1}. Finally, to increase the operation speed, one level of pipelining is introduced in all designs. We implement four designs: one conventional and three new Butterfly Units. In all cases, the proposed three schemes are superior in terms of operation speed, area and power, compared to the conventional.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Design of Modulo 2^ n+ 1 Multipliers",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6037448/",
            "Abstract": "In this work a new efficient modulo 2 n +1 modified Booth multiplication algorithm for operands in the weighted representation is proposed. According to our algorithm [n/2]+2 partial products are derived. The resulting partial products are reduced by an inverted end around carry save adder tree to two operands, which are finally added by a diminished-1 modulo 2 n +1 adder. Our design compares favorably for both area and delay to the modulo 2 n +1 modified Booth multipliers previously proposed.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An optimized modified booth recoder for efficient design of the add-multiply operator",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6710220/",
            "Abstract": "Complex arithmetic operations are widely used in Digital Signal Processing (DSP) applications. In this work, we focus on optimizing the design of the fused Add-Multiply (FAM) operator for increasing performance. We investigate techniques to implement the direct recoding of the sum of two numbers in its Modified Booth (MB) form. We introduce a structured and efficient recoding technique and explore three different schemes by incorporating them in FAM designs. Comparing them with the FAM designs which use existing recoding schemes, the proposed technique yields considerable reductions in terms of critical delay, hardware complexity and power consumption of the FAM unit.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pipeline array implementation of FIR filters",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7079823/",
            "Abstract": "A new pipeline array type parallel scheme for the implementation of FIR digital filters of low-latency is presented in this paper. Each cell of the array of the proposed scheme implements the computation of a one-bit FIR filter and is based on carry-save arithmetic. This structure leads to a low-latency implementation that is independent of the number of the filter taps. The proposed scheme is pipelined at the bit-level, requires less hardware and yields superior performance than other schemes that are based on discrete multipliers. Also, a merging technique is applied inside the one-bit FIR filter cell achieving systolicity at the bit-level.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High-speed pipeline implementation of radix-2 DIF algorithm",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.133.7740&rep=rep1&type=pdf",
            "Abstract": "In this paper, we propose a new architecture for the implementation of the N-point Fast Fourier Transform (FFT), based on the Radix-2 Decimation in Frequency algorithm. This architecture is based on a pipeline circuit that can process a stream of samples and produce two FFT transform samples every clock cycle. Compared to existing implementations the architecture proposed achieves double processing speed using the same circuit complexity.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing coarse-grain reconfigurable architectures by inlining flexibility into custom arithmetic data-paths",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926009000029",
            "Abstract": "This paper introduces a design technique for coarse-grained reconfigurable architectures targeting digital signal processing (DSP) applications. The design procedure is analyzed in detail and an area-time-power efficient reconfigurable kernel architecture is presented. The proposed technique inlines flexibility into custom carry-save (CS) arithmetic datapaths exploiting a stable and canonical interconnection scheme. The canonical interconnection is revealed by a transformation, called uniformity transformation, imposed on the basic architectures of CS-multipliers and CS-chain-adders/subtractors. Experimental results including quantitative and qualitative comparisons with existing reconfigurable arithmetic cores and exploration results of the proposed reconfigurable architecture are provided.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multi-level approximate accelerator synthesis under voltage island constraints",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8456531/",
            "Abstract": "Approximate computing forms a promising paradigm shift for energy efficient design by aggressively decreasing power consumption of inherently error-tolerant applications. However, approximate computing architectures exacerbate the design complexity due to the diversity of inexact techniques and their impact on final circuit implementations. In this brief, we introduce approximate accelerator synthesis, which enables the design of power-optimized inexact circuits under error bound constraints, by leveraging the incorporation of diverse multi-level approximate techniques. We show the high efficiency of adopting multi-level approximation techniques and present a systematic approach for integrating multi-level approximation in hardware accelerator synthesis under error bound and voltage island constraints.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A tensorflow extension framework for optimized generation of hardware cnn inference engines",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/616720",
            "Abstract": "The workloads of Convolutional Neural Networks (CNNs) exhibit a streaming nature that makes them attractive for reconfigurable architectures such as the Field-Programmable Gate Arrays (FPGAs), while their increased need for low-power and speed has established Application-Specific Integrated Circuit (ASIC)-based accelerators as alternative efficient solutions. During the last five years, the development of Hardware Description Language (HDL)-based CNN accelerators, either for FPGA or ASIC, has seen huge academic interest due to their high-performance and room for optimizations. Towards this direction, we propose a library-based framework, which extends TensorFlow, the well-established machine learning framework, and automatically generates high-throughput CNN inference engines for FPGAs and ASICs. The framework allows software developers to exploit the benefits of FPGA/ASIC acceleration without requiring any expertise on HDL development and low-level design. Moreover, it provides a set of optimization knobs concerning the model architecture and the inference engine generation, allowing the developer to tune the accelerator according to the requirements of the respective use case. Our framework is evaluated by optimizing the LeNet CNN model on the MNIST dataset, and implementing FPGA-and ASIC-based accelerators using the generated inference engine. The optimal FPGA-based accelerator on Zynq-7000 delivers 93% less memory footprint and 54% less Look-Up Table (LUT) utilization, and up to 10× speedup on the inference execution vs. different Graphics Processing Unit (GPU) and Central Processing …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:D_sINldO8mEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Designing efficient DSP datapaths through compiler-in-the-loop exploration methodology",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5537090/",
            "Abstract": "This paper proposes a compiler-in-the-loop exploration framework during architectural DSP synthesis. We extend the conventional design space, considering code level transformations together with architectural level optimizations and their impact on the scheduled datapath. We show that the proposed methodology explores the design space more globally in comparison with existing methods. New trade-off points are revealed and Pareto curve shifting towards higher quality design solutions is performed.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cooperative arithmetic-aware approximation techniques for energy-efficient multipliers",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3316781.3317793",
            "Abstract": "Approximate computing appears as an emerging and promising solution for energy-efficient system designs, exploiting the inherent error-tolerant nature of various applications. In this paper, targeting multiplication circuits, ie, the energy-hungry counterpart of hardware accelerators, an extensive exploration of the error--energy trade-off, when combining arithmetic-level approximation techniques, is performed for the first time. Arithmetic-aware approximations deliver significant energy reductions, while allowing to control the error values with discipline by setting accordingly a configuration parameter. Inspired from the promising results of prior works with one configuration parameter, we propose 5 hybrid design families for approximate and energy-friendly hardware multipliers, consisting of two independent parameters to tune the approximation levels. Interestingly, the resolution of the state-of-the-art Pareto diagram …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mapping dsp applications onto high-performance architectural templates with inlined flexibility",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4584293/",
            "Abstract": "In this paper a formalized methodology is presented for mapping behavioral DSP kernels onto a novel reconfigurable architectural template. The architectural template is generated by a design technique called flexibility inlining, which delivers high performance coarse-grained reconfigurable architectures. The proposed methodology enables a seamless flow from high level specification to RTL implementation. A specialized intermediate representation model and a set of mapping algorithms have been considered to exploit the structure of the targeted architectures. Experimental results on DSP benchmark applications proves the efficiency of the proposed approach comparing with reconfigurable datapaths composed by standard coarse-grained cells.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Novel Systolic Architecture for an Efficient RSA Implementation 416",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=1364941256208968626&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:IWHjjKOFINEC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "A new low latency parallel FIR filter scheme",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11265-005-4847-4",
            "Abstract": "A new array type parallel scheme for an FIR digital filter is presented in this paper. The proposed scheme is based on the structure of the carry-save array multiplier where each cell implements the computation of an FIR filter at the bit-level. This structure leads to latency independent of the number of the filter taps. The proposed scheme is pipelined at the bit-level, is systolic at the cell-level and requires less hardware than other schemes based on discrete multipliers.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Custom multi-threaded dynamic memory management for multiprocessor system-on-chip platforms",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5642078/",
            "Abstract": "We address the problem of custom Dynamic Memory Management (DMM) in Multi-Processor System-on-Chip (MPSoC) architectures. Customization is enabled through the definition of a design space that captures in a global, modular and parameterized manner the primitive building blocks of multi-threaded DMM. A systematic exploration methodology is proposed to efficiently traverse the design space. Customized Pareto DMM configurations are automatically generated through the development of software tools implementing the proposed methodology. Experimental evaluation based on a real-life multithreaded dynamic network application show that the proposed methodology delivers higher quality (application-specific) solutions in comparison with state-of-the-art dynamic memory managers together with 62% exploration runtime reductions.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the design of modulo 2n±1 residue generators",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6673241/",
            "Abstract": "In this paper, we propose an efficient residue generator which concurrently computes the residues modulo 2 n +1 and modulo 2 n -1. The input operands are divided into n-bit vectors which are then grouped into two sets and added by two separate Carry Save Adder (CSA) trees. The output carry of each stage of the first CSA tree is used as input to the corresponding stage of the second CSA tree, while the output vectors of the trees are finally added modulo 2 n +1 and 2 n -1 to compute the residues. The proposed residue generator is well suited for Residue Number System (RNS) based applications which use both modulo 2 n +1 and 2 n -1 residues. An efficient configurable modulo 2 n ±1 residue generator is also proposed.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A mixed style architecture for low power multipliers based on a bypass technique",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5487585/",
            "Abstract": "In this paper a new technique for the design of combinational circuits for low power is introduced. The basic idea is to bypass blocks of logic when their function is not required, using low delay and area overhead components (transmission gates). The internal state of these blocks is kept unchanged, so the switching activity of the circuit is minimized, resulting to low dynamic power consumption. While this idea offers great savings mainly to array multipliers, due to their regular interconnection scheme, the reduced area and fast speed of tree multipliers is a real temptation for the designer. Therefore, a mixed style architecture, using a traditional, tree based part, combined with a bypass, array based part, is proposed. Through extensive experimentation it has been found that the bypass technique offers minimum power consumption for all cases while the mixed architecture offers a delay*power product improvement …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Long unsigned number systolic serial multipliers and squarers",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/924075/",
            "Abstract": "A systolic serial multiplier and a squarer for unsigned numbers - which operate without zero words inserted between successive data words, output the full product, and have only one clock cycle latency-are presented. The multiplier is based on a modified serial/parallel scheme that operates with 100% efficiency. The systolic form is obtained by merging two adjacent multiplier cells. The same technique is used for the design of a serial squarer. The systolisity and the continuous operation are achieved without an increase in hardware complexity. The proposed schemes are well suited for long number multiplication and squaring.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A bisr architecture for embedded memories",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4567077/",
            "Abstract": "In this paper a BISR architecture for embedded memories is presented. The proposed scheme utilises a multiple bank cache-like memory for repairs. Statistical analysis is used for minimisation of the total resources required to achieve a very high fault coverage. Simulation results show that the proposed BISR scheme is characterised by high efficiency and low area overhead, even for high defect densities. On a 4 Mbit memory and an average number of 1024 memory defects per IC, a repair ratio of 100% and over 90% require less than 2% and 1% memory overhead respectively.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Approximate multiplier architectures through partial product perforation: Power-area tradeoffs analysis",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2742060.2742109",
            "Abstract": "Approximate computing has received significant attention as a promising strategy to decrease power consumption of inherently error-tolerant applications. Hardware approximation mainly targets arithmetic units, eg adders and multipliers. In this paper, we design new approximate hardware multipliers and propose the Partial Product Perforation technique, which omits a number of consecutive partial products by perforating their generation. Through extensive experimental evaluation, we apply the partial product perforation method on different multiplier architectures and expose the optimal configurations for different error values. We show that the partial product perforation delivers reductions of up to 50% in power consumption, 45% in area and 35% in critical delay. Also, the product perforation method is compared with state-of-the-art works on approximate computing that consider the Voltage Over-Scaling (VOS …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-level approximation for Inexact accelerator synthesis under voltage island constraints",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=7007471841744214428&hl=en&oi=scholarr",
            "Abstract": "Approximate computing forms a promising design paradigm shift for aggressively decreasing power consumption of inherently error tolerant applications. However, as in approximate computing the designer must consider the power–error trade-off, designing complex approximate accelerators increases the already high complexity of hardware design. In this paper, we introduce an approximate accelerator synthesis framework that enables the application of multi-level approximate techniques in order to produce more efficient approximate accelerator implementations. We show the high efficiency of adopting multilevel approximation techniques and then we present a systematic approach for integrating multi-level approximation in high level accelerator synthesis under error bound and voltage island constraints.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Compiler-in-the-loop exploration during datapath synthesis for higher quality delay-area trade-offs",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2390191.2390202",
            "Abstract": "Design space exploration during high-level synthesis targets the computation of those design solutions which form optimal trade-off points. This quest for optimal trade-offs has been focused on studying the impact of various architectural-level parameters during high-level synthesis algorithms, silently neglecting the trade-offs produced from the combined impact of behavioral-level together with architectural-level parameters. We propose a novel design space, exploration methodology that studies an extended instance of the solution space considering the effects of combining compiler- and architectural-level transformations. It is shown that exploring the design space in a global manner reveals new trade-off points, thus shifting towards higher quality design solutions. We use a combination of upper-bounding conditions together with gradient-based heuristic pruning to efficiently traverse the extended search space …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:pqnbT2bcN3wC",
            "Publisher": "ACM"
        },
        {
            "Title": "Design-efficient approximate multiplication circuits through partial product perforation",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7434040/",
            "Abstract": "Approximate computing has received significant attention as a promising strategy to decrease power consumption of inherently error tolerant applications. In this paper, we focus on hardware-level approximation by introducing the partial product perforation technique for designing approximate multiplication circuits. We prove in a mathematically rigorous manner that in partial product perforation, the imposed errors are bounded and predictable, depending only on the input distribution. Through extensive experimental evaluation, we apply the partial product perforation method on different multiplier architectures and expose the optimal architecture-perforation configuration pairs for different error constraints. We show that, compared with the respective exact design, the partial product perforation delivers reductions of up to 50% in power consumption, 45% in area, and 35% in critical delay. In addition, the product …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fused modulo 2n− 1 add-multiply unit",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7049916/",
            "Abstract": "Complex arithmetic operations are widely used in Digital Signal Processing (DSP) applications. Targeting to increase performance, in this work, we focus on optimizing the design of the modulo 2 n  - 1 Add-Multiply (AM) operation. We incorporate in the design the direct recoding of the sum of two numbers in its Modified Booth (MB) form. Compared to the conventional design of first instantiating a modulo 2 n  - 1 adder and then, driving its output to a modulo 2 n  - 1 multiplier, the proposed fused AM design yields considerable reductions in terms of critical delay, area complexity and power consumption.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power-efficient and low latency implementation of programmable FIR filters using carry-save arithmetic",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4511168/",
            "Abstract": "This paper presents a new programmable finite-impulse response (FIR) digital filter scheme based on a low latency, power efficient architecture with reduced hardware complexity. In the proposed scheme, the input data is kept in bit-parallel form, while the coefficients enter the circuit in digit-serial form. The coefficient digits are encoded using the Modified Booth algorithm to reduce the partial products required for each multiplication. The structure of the filter is based on the technique of merging adjacent multiply-add units. The computation of the intermediate results is implemented using the carry-save arithmetic. Also, the coefficient digits of adjacent multiply-add units enter the filter in digit-skew form, while the input data sample remains stable until the relative output sample is produced. Thus, the proposed architecture results in a circuit with reduced hardware cost and lower power consumption, compared to other …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Building embedded DSP applications in a Java modeling framework",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7098956/",
            "Abstract": "In this paper we present a methodology for modeling embedded DSP applications based on the Java language. Models are written in a framework which allows detailed cycle accurate modeling in the area of focus with less detailed and more efficient statistical models for the rest. The modeling is based on a Java extension package that allows hardware modeling by providing classes and primitive calls, in the same way SystemC extends C. By adopting Java in hardware modeling great productivity gains can be brought to the hardware designer or computer architect, since it has simple object model and prevents us from the error prone pointers. As a modeling example, we evaluate the performance of an audio encoding application on top of a stack folding optimized Java processor.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DONUT: A double node upset tolerant latch",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7309622/",
            "Abstract": "In this paper we propose the novel DONUT (Double Node Upset Tolerant) latch, a soft error tolerant latch for SNUs (Single Node Upsets) and DNUs (Double Node Upsets). The latch comprises four DICE cells in a multi-interlocked scheme where each DICE cell is always guaranteed two stable nodes, rendering the DONUT latch resilient to SNUs and DNUs. The proposed latch design merges efficiently the four DICE cells saving 25% of the required transistors. Regarding the power dissipation and propagation delay, simulation results showed that the DONUT latch performs better compared to other BISER-based latches that are SNU or DNU tolerant.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A fast multiplier-less edge detection accelerator for FPGAs",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1774088.1774193",
            "Abstract": "Real time video is used in a wide variety of applications, ranging from video surveillance to medical imaging. These operations require significant amounts of processing power, especially when high resolution frames are used. A large percentage of processing time is used in edge detection kernels. Thus, accelerating these kernels is of vital importance in achieving satisfactory frame rates for real time performance, even in high resolutions. This paper proposes a hardware coprocessor to the Xilinx Microblaze processor which accelerates edge detection significantly, while keeping the hardware requirements low, by using no multipliers at all. Using a Xilinx Spartan 3E FPGA, we have reported a frame rate of 157 frames per second in 4CIF format, which corresponds to a 4x speedup over the software only solution. The speedup was achieved with only 1131 slices and 5 block RAMs hardware occupation, which makes …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient support vector machines implementation on Intel/Movidius Myriad 2",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376630/",
            "Abstract": "Support Vector Machines (SVM) classifiers are widely used as inference tools in Internet of Things (IoT) and Edge Computing applications. To achieve high classification accuracy, the SVM classifier can turn out to be the computationally intensive and power hungry component of the application. In this paper, we enable an efficient SVM implementation, in terms of performance and power dissipation, on an ultra-low-power multi-core SoC, Intel/Movidius Myriad 2. Experimental results highlight the efficiency of the proposed solution, as it achieves 105 × speed-up compared to its initial porting and up to 40% energy savings against state-of-the-art relevant approaches.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient modulo 2n+ 1 multiply and multiply-add units based on modified Booth encoding",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926013000126",
            "Abstract": "In this work a new efficient modulo 2n+1 modified Booth multiplication algorithm for both operands in the weighted representation is proposed. Furthermore, the same algorithm is extended to realize modulo 2n+1 multiply-add units. The derived partial products are reduced by an inverted end around carry-save adder tree to two operands, which are finally added by a modulo 2n+1 adder. The performance and efficiency of the proposed multipliers are evaluated and compared against the earlier modulo 2n+1 multipliers, based on a single gate level model. Comparisons based on experimental CMOS implementations for both the multiply and multiply-add units are also given. The proposed multipliers yield area and power savings by an average of 15% and 10% respectively, while the corresponding area and power savings of the proposed multiply-add units are 14% and 21% respectively.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:SeFeTyx0c_EC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Combining Arithmetic Approximation Techniques for Improved CNN Circuit Design",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9294869/",
            "Abstract": "Convolutional Neural Networks (CNN) plea for improved design at circuit level. Instead of compression, we adopt here arithmetic approximation techniques supporting seamlessly the original structure and arithmetic type of a given network. We focus on the convolution and explore various approximations towards refining the resources and/or throughput of any CNN implementation. We develop hybrid high radix multipliers, block floating point arithmetic, as well as parallel architectures and Winograd convolutions to further enhance our design. Results show half cost or even quadruple FPS, depending on ASIC/FPGA technology, with only negligible 0.1-0.4% loss of CNN accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:BrmTIyaxlBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Long number bit-serial squarers",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1467619/",
            "Abstract": "New bit serial squarers for long numbers in LSB first form, are presented in this paper. The first presented scheme is a 50% operational efficient squarer than has the half number of cells compared to the traditional squarers. The second scheme is a 100% operational efficient squarer. In this scheme, the number of the cells remain unchanged compared to other proposed schemes but the number of the required registers is reduced significantly. Both schemes are presented in non-systolic and systolic form and are compared against other squarers presented in the bibliography from the aspect of hardware complexity.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cost effective protection techniques for TCAM memory arrays",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6042857/",
            "Abstract": "This paper presents low cost techniques for error detection and correction in Ternary Content Addressable Memories (TCAMs). The techniques exploit the inherent redundancy of TCAM cells to allow for protection at lower cost. A fault detection technique with the cost of parity but with about the half probability of silent data corruption is proposed. This technique is then applied at both horizontal and vertical dimensions of the TCAM array, and a low cost error correction scheme is derived. Last, another error correction scheme is proposed, which employs a SECDED ECC of the half complexity, by making use of the TCAM redundancy, without compromising single bit error correction. The proposed schemes come with minimal area, power, and critical path overheads, in comparison with standard schemes, and they are good alternatives for TCAM arrays protection.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Flexible datapath synthesis through arithmetically optimized operation chaining",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5325425/",
            "Abstract": "Datapath synthesis incorporating complex operation templates has been proven extremely efficient especially for the digital signal processing (DSP) application domain.However, only architectural level optimizations have been reported for the specification and implementation of the operation templates. This paper introduces the consideration of arithmetic level optimizations for template based datapath synthesis. A high performance architecture for the implementation of DSP kernels is presented. It is based on flexible and arithmetically optimized components able to perform a large set of operation templates. A synthesis methodology for optimized mapping of DSP kernels onto the proposed architecture is also presented. Experimental results are reported showing significant gains in execution time, active chip area and power dissipation in comparison to previously published flexible template-based data paths.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Complex constant number serial multipliers",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/document/1251660/",
            "Abstract": "An efficient implementation of a complex number serial multiplier, when the one factor is constant, is presented. The real and imaginary parts of the constant number are represented in canonic signed digit (CSD) form. The corresponding parts of the non-constant factor are represented in two's complement form. The real and imaginary parts of the product are obtained in two's complement form. The CSD representation was chosen because it yields significant hardware reduction. The proposed scheme operates with 100% hardware efficiency; namely, no sign extension words between successive data words are required",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:M3NEmzRMIkIC",
            "Publisher": "IET"
        },
        {
            "Title": "A bit-interleaved systolic architecture for a high-speed RSA system",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926001000177",
            "Abstract": "A new systolic serial–parallel scheme that implements the Montgomery multiplier is presented. The serial input of this multiplier consists of two sets of data that enter in a bit-interleaved form. The results are also derived in the same form. The design, with minor modifications, can be used for the implementation of the RSA algorithm by realizing the square-and-multiply algorithm. The circuit yields the lowest hardware complexity reported and permits high-speed operation with 100% efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:UebtZRa9Y70C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Constant number serial pipeline multipliers",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1026507617721",
            "Abstract": "The pipeline form of the serial/parallel multiplier for constant numbers, which operates without insertion of zero words between successive data, is presented. The constant number is in Canonical Signed Digit (CSD) form and the other factor in two's complement form. The CSD form was chosen because it yields significant hardware reduction. Also, for the above data forms the Lyon's serial pipeline multiplier is examined. For these designs, a special algorithm for the multiplication of two's complement numbers with constant numbers in CSD representation was developed. The proposed serial pipeline multipliers are compared with the existing schemes from the point of hardware complexity.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:Zph67rFs4hoC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Segmenetation based design of serial parallel multipliers",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1579868/",
            "Abstract": "In this paper, a novel architecture for the implementation of serial parallel multipliers (SPM) is proposed. The proposed multiplier is based on a segmentation technique of a simple SPM to blocks of equal bit length. This multiplier achieves higher throughput because it requires small number of zeros to start a new multiplication cycle at a moderate hardware expense and achieves significant hardware reduction compared to the double precision SPM. The proposed technique permits the optimization of the area time product.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tf2fpga: A framework for projecting and accelerating tensorflow cnns on fpga platforms",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8741940/",
            "Abstract": "FPGA-based accelerators of Convolutional Neural Networks (CNNs) deliver significant performance, while leaving much room for optimizations. In this paper, we present a CNN accelerator based on the state-of-the-art Dataflow Hardware Mapping (DHM) methodology, optimized with the use of 8-bit unsigned integer quantization, 1-bit input mapping and deep-to-shallow conversion techniques. Interestingly, we introduce a Tensorflow-to-VHDL framework to generate high-performance accelerators for inferencing on FPGAs, adopting a holistic view of CNN problems. The proposed framework uses a VHDL library of our pre-optimized layers and modules, and creates the accelerator by extracting the model definition and weights from the respective Tensorflow files. The 8-bit quantized weights are stored in an on-board ROM memory, and thus, the need for external-to-FPGA “glue logic” modules and increased …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A high-speed radix-4 multiplexer-based array multiplier",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1366110.1366139",
            "Abstract": "This paper presents a new radix-4 multiplexer-based array multiplier, based on a multiplication scheme shown in a previous work, where 4-to-1 multiplexers are used for the computation of partial products. In the proposed design, the rows of the array are reduced to the half, compared to the initial multiplexer-based scheme, as two bits from both operands are processed at each step. The proposed scheme is compared to the Modified-Booth array multiplier and to the initial multiplexer-based array scheme. The compared designs are coded in VHDL and synthesized using the TSMC 0.13 ¼m technology library. The synthesis results of critical time and area show 11-22% improvement in critical time delay compared to the Modified-Booth array, in the expense of an area overhead of 3.8-16%. Compared to the initial multiplexer-based scheme, there is a significant improvement in terms of area and critical time.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pre-encoded multipliers based on non-redundant radix-4 signed-digit encoding",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7100882/",
            "Abstract": "In this paper, we introduce an architecture of pre-encoded multipliers for digital signal processing applications based on off-line encoding of coefficients. To this extend, the Non-Redundant radix-4 Signed-Digit (NR4SD) encoding technique, which uses the digit values    or    , is proposed leading to a multiplier design with less complex partial products implementation. Extensive experimental analysis verifies that the proposed pre-encoded NR4SD multipliers, including the coefficients memory, are more area and power efficient than the conventional Modified Booth scheme.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient high level synthesis exploration methodology combining exhaustive and gradient-based pruned searching",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5571801/",
            "Abstract": "This paper presents a methodology for fast and efficient Design Space Exploration during High Level Synthesis. An augmented instance of the design space is studied taking under consideration the effects of both compiler- and architectural-level transformations onto the final datapath. A new gradient-based pruning technique has been developed, which evaluates large portions of the augmented solution space in a quick manner. At a second level, the proposed pruning technique is combined with exhaustive exploration in order to guarantee the quality of design solutions. We show that the proposed methodology delivers (i) higher quality designs than exploration methods which do not account the introduced extended design space, (ii) with considerable reductions of the exploration's runtime and (iii) efficient convergence to global optima.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient serial and parallel implementation of programmable fir filters based on the merging technique",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080728/",
            "Abstract": "This paper presents a novel architecture for the efficient implementation of parallel and serial programmable FIR filters. In the parallel merged architecture, both the input data and the coefficients operate in bit-parallel form. In the serial merged architecture, input data enters the circuit in Modified-Booth encoded digits, while the coefficients are kept in bit-parallel form. The proposed schemes are based on a low latency filter structure, where adjacent multiply-add units are merged to reduce the number of carry-save registers of the accumulation path to the half. The computation of intermediate terms is implemented using the carry-save arithmetic. Based on theoretical estimation models of hardware complexity and switching activity, it is shown that the presented schemes result in circuits with reduced area and power consumption, compared to other parallel and serial FIR filter architectures presented in the bibliography.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reliability Breakdown Analysis of an MP-SoC platform due to Interconnect Wear-out",
            "Publication year": 2010,
            "Publication url": "http://www.ece.ucy.ac.cy/labs/easoc/dfr10/Papers/paper_id_1_camera_ready_Bekiaris.pdf",
            "Abstract": "The aggressive scaling of nanometer CMOS technology nodes and the integration of low-k dielectrics introduces novel reliability phenomena that progressively degrade the electrical characteristics of copper interconnects. These effects impact the performance of designs gradually rather than abruptly, leading to timing violations in several timing-critical paths and thus shortening the system’s lifetime. Therefore, the need for design methodologies predicting the impact of such phenomena is emerging. This paper presents a case study for a dominating interconnect reliability effect, Electro-migration, based on an MP-SoC platform with two LEON3 SPARC processors as kernels. The proposed flow studies the impact of Electro-migration on the timing-critical paths of the design and estimates the system’s lifetime due to this effect. The presented case study may be used as a guide to estimate the impact of Electro-migration in the performance of complex, MP-SOC designs, based on a proposed analysis framework, which can be extended to the study of relevant interconnect reliability phenomena.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High performance MAC designs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7038582/",
            "Abstract": "In this paper we propose two high performance multiplication-accumulation (MAC) designs. Targeting to operate at higher frequency, we investigate two different techniques based on the carry-save representation in order to reduce the delay impact of the accumulation process on the MAC operation. We conducted detailed experimental measurements to verify the advantages of the proposed MAC designs compared to two existing ones. Both the proposed designs operate at higher frequency without any losses in the area occupied or the power consumed.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient modulo 2n+1 multiplication for the idea block cipher",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2483028.2483106",
            "Abstract": "International Data Encryption Algorithm (IDEA) is a popular and secure cryptography algorithm, suitable for hardware implementation. IDEA comprises of modulo 2 16 additions, bitwise exclusive-OR operations and modulo 2 16+ 1 multiplications of 16-bit words. Among them, modulo 2 16+ 1 multiplication is the most time, space and power consuming operation. In this work, we propose an efficient modulo 2 n+ 1 modified Booth multiplication algorithm which is adapted to operands used in the IDEA. The IDEA multiplier based on the proposed modulo 2 n+ 1 multiplication algorithm yields area and power advantages of up to 12% and 14% respectively, compared to the already proposed modulo 2 n+ 1 multiplier designs. The implementation of a single round of the IDEA block cipher based on the proposed multiplier verifies the area and power advantages over the implementations based on existing modulo 2 n+ 1 …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient variability analysis of arithmetic units using linear regression techniques",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10470-016-0712-6.pdf",
            "Abstract": "The performance of modern digital signal processing (DSP) systems is inherently affected by the variability tolerance of their main arithmetic units. As CMOS technology approaches nanometer scales, numerous threats for the reliability of DSP designs emerge. A large portion of these phenomena are related to threshold voltage  variations, resulting in timing failures due to an overall increase of the arithmetic unit delay. In this work, we employ linear regression techniques to accelerate transistor variability estimation using static timing analysis (STA) tools. By identifying the variation-critical part of an arithmetic circuit, we reduce the transistor inventory that needs to be tracked by the STA solver. We substantiate the efficiency of the proposed framework for realistic designs. For the main logic blocks of the modulo  add–multiply (AM) operation, we capture the variability-induced degradation of the …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "High-level synthesis methodologies for delay-area optimized coarse-grained reconfigurable coprocessor architectures",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5572829/",
            "Abstract": "As Very Large Scale Integration (VLSI) process technology continues to scale down transistor sizes, modern computing devices are becoming extremely complex. In order to face this complexity explosion, the shifting of design methodologies towards higher level of abstraction has been proposed. This high level view of the design procedure enables the automated synthesis of applications' architecture that is written in an application-level description i.e. C/C++. Additionally, it allows designers to explore the tradeoffs between different system and implementation parameters to conclude in an efficient design solution. The work done during this PhD thesis targets the exploration and optimization of the design solutions in a global manner, by focusing on the combined development of novel (i) system-level automated design methodologies/tools and (ii) circuit-level techniques for a specific class of system architectures …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Delta DICE: A double node upset resilient latch",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7282145/",
            "Abstract": "In this paper we propose the novel Delta DICE latch that is tolerant to SNUs (Single Node Upsets) and DNUs (Double Node Upsets). The latch comprises three DICE cells in a delta interconnection topology, providing enough redundant nodes to guarantee resilience to conventional SNUs, as well as DNUs due to charge sharing. Simulation results demonstrated that in terms of power dissipation and propagation delay, the Delta DICE latch outperforms BISER-based latches that are SNU or DNU tolerant and provides DNU resilience at a small energy×delay penalty compared to other SNU tolerant cells.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A reconfigurable arithmetic data-path based on regular interconnection",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4291940/",
            "Abstract": "In this paper a novel coarse grained reconfigurable arithmetic unit (RAU) is introduced. The RAU's design is based on a technique that Mines flexibility into custom Carry-Save-Arithmetic (CSA) circuits exploiting a stable and canonical interconnection scheme. The reconfigurable architecture prototype is presented. Two mapping strategies of DSP algorithms onto the proposed unit, are also analyzed. Experimental results report an average latency reduction of 32.63% and of 40% compared with datapaths structured by primitive computational resources, using the first and the second mapping strategy respectively.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vossim: A framework for enabling fast voltage overscaling simulation for approximate computing circuits",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8302865/",
            "Abstract": "Approximate computing emerges as a new design paradigm for generating energy-efficient computing systems. Voltage overscaling (VOS) forms a very promising technique to generate approximate circuits, and its application in cooperation to other approximate techniques is proven to lead to more efficient solutions. However, the existing design tools fail to provide effective voltage-aware simulation for early exploration of power-error approximate design tradeoffs. In this brief, we propose VOSsim, a framework that extends state-of-the-art industry strength tools, to enable fast and accurate simulations of voltage overscaled circuits. We extensively evaluate VOSsim showing that it attains 99.2% output and 98.4% power accuracy, with an average speedup of 32× in simulation time compared to high-precision SPICE simulations, i.e., the only available solution today for VOS-aware simulation.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FPGA-based design of a large moduli multiplier for public-key cryptographic systems",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4380834/",
            "Abstract": "High secure cryptographic systems require large bit-length encryption keys which presents a challenge to their efficient hardware implementation especially in embedded devices. Modular multiplication is the core operation in well known cryptosystems like RSA and elliptic curve (ECC). Therefore, it is important to employ efficient modular multiplications techniques to improve the overall performance of the cryptographic system. We present a modular multiplier based on the ordinary Montgomery's multiplication algorithm and a new array multiplication scheme to perform the multiplication. The new modular multiplier is scalable and can be used for large bit-lengths. We also implement the modular multiplier into the Virtex4 FPGA devices and we show that our technique has better performance when compared with other schemes. To implement large bit-length multiplications we used a novel partitioning and pipeline …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An area optimized hardware implementation of the 3GPP confidentiality and integrity algorithms",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=10138452984849530276&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A systolic serial squarer of continuous operation",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7075516/",
            "Abstract": "A systolic serial squarer for unsigned numbers, which operates without zero words inserted between successive data words, outputs the full product and has immediate response, is presented. The systolic form is obtained by merging two adjacent multiplier cells, and the continuous operation is achieved by dividing the squaring procedure in two pipelined stages.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A standard-cell library suite for deep-deep sub-micron CMOS technologies",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5941445/",
            "Abstract": "The continuous scaling of CMOS transistor and interconnect geometries brings to light novel challenges regarding the design of VLSI systems in the nanoscale era. On the other hand, most of the forthcoming deep-deep submicron technologies are not yet mature to be used for fabrication. Hence, the development of standard-cell libraries at the nanometer regime is emerging, in order to estimate the behavior of complex systems in short-term technology nodes. In this paper, we introduce a standard-cell library generator flow for sub-65nm nodes, based on scaling rules presented in the literature. Our goal is to create a set of complete standard cell libraries enabling the design of large digital systems in technologies not yet available for fabrication. The generated libraries are compatible with the state-of-the-art industrial tool flows and they have been evaluated by benchmarks of medium and large complexity.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An independent dual gate SOI FinFET soft-error resilient memory cell",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7038584/",
            "Abstract": "In this paper we present an 8T footless storage element, the FFDICE (FinFET DICE), a dual interlocked structure using Independent Gate SOI FinFET transistors that exhibits soft error resilience characteristics. Compared to the conventional DICE cell, the proposed design achieves area savings by dispensing with the four NMOS driver transistors, retains the excellent tolerance characteristics to single node upsets and similar multiple node upset resilience. Of significance to modern designs that apply voltage scaling techniques to achieve power savings, simulation results on Static Voltage Noise Margin and Static Current Noise Margin metrics show that the proposed cell exhibits excellent stability across an examined voltage range of 0.75V to 1V.",
            "Abstract entirety": 1,
            "Author pub id": "MVkryn8AAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A large scale adaptable multiplier for cryptographic applications",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1638203/",
            "Abstract": "Large multipliers are important for cryptographic applications because they need large keys. The ability to modify key lengths, for security reasons, suggests adaptability in multiplication bit-length. However, reconfigurability of multiplication is a difficult task, especially when bit-lengths are large, say over 500 bits. For fixed bit-lengths, much work has been done in the range of 32, 64 or even 128 bits for advanced microprocessors and DSPs. The objective of this work is to design large adaptable bit-length multipliers that can be employed in cryptographic systems. We present a multiplication scheme for higher radix multiplexer-based array multipliers and we suggest a parallelization of the scheme within a single FPGA based implementation. We also suggest a novel partition of the multiplier into folded pipeline stages such that each stage can be instantiated by reconfiguration from its preceding stage during the …",
            "Abstract entirety": 0,
            "Author pub id": "MVkryn8AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        }
    ]
}]