[{
    "name": "Κυριάκος Μουρατίδης",
    "romanize name": "Kyriakos Mouratidis",
    "School-Department": "Επιστήμης Υπολογιστών",
    "University": "Singapore Management University",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 7843,
    "Scholar name": "Kyriakos Mouratidis",
    "Scholar id": "vq5oTnEAAAAJ",
    "Affiliation": "School of Computing and Information Systems, Singapore Management University",
    "Citedby": 4561,
    "Interests": [
        "Databases"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=vq5oTnEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Preference queries in large multi-cost transportation networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5447851/",
            "Abstract": "Research on spatial network databases has so far considered that there is a single cost value associated with each road segment of the network. In most real-world situations, however, there may exist multiple cost types involved in transportation decision making. For example, the different costs of a road segment could be its Euclidean length, the driving time, the walking time, possible toll fee, etc. The relative significance of these cost types may vary from user to user. In this paper we consider such multi-cost transportation networks (MCN), where each edge (road segment) is associated with multiple cost values. We formulate skyline and top-k queries in MCNs and design algorithms for their efficient processing. Our solutions have two important properties in preference-based querying; the skyline methods are progressive and the top-k ones are incremental. The performance of our techniques is evaluated with …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Maximum rank query",
            "Publication year": 2015,
            "Publication url": "https://ink.library.smu.edu.sg/sis_research/2823/",
            "Abstract": "The top-k query is a common means to shortlist a number of options from a set of alternatives, based on the user's preferences. Typically, these preferences are expressed as a vector of query weights, defined over the options' attributes. The query vector implicitly associates each alternative with a numeric score, and thus imposes a ranking among them. The top-k result includes the k options with the highest scores. In this context, we define the maximum rank query (MaxRank). Given a focal option in a set of alternatives, the MaxRank problem is to compute the highest rank this option may achieve under any possible user preference, and furthermore, to report all the regions in the query vector's domain where that rank is achieved. MaxRank finds application in market impact analysis, customer profiling, targeted advertising, etc. We propose a methodology for MaxRank processing and evaluate it with experiments on real and benchmark synthetic datasets.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:pqnbT2bcN3wC",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Marrying Top-k with Skyline Queries: Relaxing the Preference Input while Producing Output of Controllable Size",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3448016.3457299",
            "Abstract": "The two most common paradigms to identify records of preference in a multi-objective setting rely either on dominance (eg, the skyline operator) or on a utility function defined over the records' attributes (typically, using a top-k query). Despite their proliferation, each of them has its own palpable drawbacks. Motivated by these drawbacks, we identify three hard requirements for practical decision support, namely, personalization, controllable output size, and flexibility in preference specification. With these requirements as a guide, we combine elements from both paradigms and propose two new operators, ORD and ORU. We perform a qualitative study to demonstrate how they work, and evaluate their performance against adaptations of previous work that mimic their output.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An incremental threshold method for continuous text search queries",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4812497/",
            "Abstract": "A text filtering system monitors a stream of incoming documents, to identify those that match the interest profiles of its users. The user interests are registered at a server as continuous text search queries. The server constantly maintains for each query a ranked result list, comprising the recent documents (drawn from a sliding window) with the highest similarity to the query. Such a system underlies many text monitoring applications that need to cope with heavy document traffic, such as news and email monitoring. In this paper, we propose the first solution for processing continuous text queries efficiently. Our objective is to support a large number of user queries while sustaining high document arrival rates. Our solution indexes the streamed documents with a structure based on the principles of the inverted file, and processes document arrival and expiration events with an incremental threshold-based method. Using …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Geometric aspects and auxiliary features to top-k processing",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7551557/",
            "Abstract": "Top-k processing is a well-studied problem with numerous applications that is becoming increasingly relevant with the growing availability of recommendation systems and decision making software on PCs, PDAs and smart-phones. The objective of this seminar is twofold. First, we will delve into the geometric aspects of top-k processing. Second, we will cover complementary features to top-k queries that have a strong geometric nature. The seminar will close with insights in the effect of dimensionality on the meaningfulness of top-k queries, and interesting similarities to nearest neighbor search.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient evaluation of continuous text search queries",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5887333/",
            "Abstract": "Consider a text filtering server that monitors a stream of incoming documents for a set of users, who register their interests in the form of continuous text search queries. The task of the server is to constantly maintain for each query a ranked result list, comprising the recent documents (drawn from a sliding window) with the highest similarity to the query. Such a system underlies many text monitoring applications that need to cope with heavy document traffic, such as news and email monitoring. In this paper, we propose the first solution for processing continuous text queries efficiently. Our objective is to support a large number of user queries while sustaining high document arrival rates. Our solution indexes the streamed documents in main memory with a structure based on the principles of the inverted file, and processes document arrival and expiration events with an incremental threshold-based method. We …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Group nearest neighbor queries",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1320006/",
            "Abstract": "Given two sets of points P and Q, a group nearest neighbor (GNN) query retrieves the point(s) of P with the smallest sum of distances to all points in Q. Consider, for instance, three users at locations q/sub 1/ q/sub 2/ and q/sub 3/ that want to find a meeting point (e.g., a restaurant); the corresponding query returns the data point p that minimizes the sum of Euclidean distances |pq/sub i/| for 1/spl les/i/spl les/3. Assuming that Q fits in memory and P is indexed by an R-tree, we propose several algorithms for finding the group nearest neighbors efficiently. As a second step, we extend our techniques for situations where Q cannot fit in memory, covering both indexed and nonindexed query points. An experimental evaluation identifies the best alternative based on the data and query properties.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "k-Anonymity in the Presence of External Databases",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4912204/",
            "Abstract": "The concept of k-anonymity has received considerable attention due to the need of several organizations to release microdata without revealing the identity of individuals. Although all previous k-anonymity techniques assume the existence of a public database (PD) that can be used to breach privacy, none utilizes PD during the anonymization process. Specifically, existing generalization algorithms create anonymous tables using only the microdata table (MT) to be published, independently of the external knowledge available. This omission leads to high information loss. Motivated by this observation, we first introduce the concept of k-join-anonymity (KJA), which permits more effective generalization to reduce the information loss. Briefly, KJA anonymizes a superset of MT, which includes selected records from PD. We propose two methodologies for adapting k-anonymity algorithms to their KJA counterparts. The …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Continuous medoid queries over moving objects",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73540-3_3",
            "Abstract": "In the k-medoid problem, given a dataset P, we are asked to choose k points in P as the medoids. The optimal medoid set minimizes the average Euclidean distance between the points in P and their closest medoid. Finding the optimal k medoids is NP hard, and existing algorithms aim at approximate answers, i.e., they compute medoids that achieve a small, yet not minimal, average distance. Similarly in this paper, we also aim at approximate solutions. We consider, however, the continuous version of the problem, where the points in P move and our task is to maintain the medoid set on-the-fly (trying to keep the average distance small). To the best of our knowledge, this work constitutes the first attempt on continuous medoid queries. First, we consider centralized monitoring, where the points issue location updates whenever they move. A server processes the stream of generated updates and constantly …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Aggregate nearest neighbor queries in spatial databases",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1071610.1071616",
            "Abstract": "Given two spatial datasets P (e.g., facilities) and Q (queries), an aggregate nearest neighbor (ANN) query retrieves the point(s) of P with the smallest aggregate distance(s) to points in Q. Assuming, for example, n users at locations q1,…qn, an ANN query outputs the facility p ∈ P that minimizes the sum of distances |pqi| for 1 ≤ i ≤ n that the users have to travel in order to meet there. Similarly, another ANN query may report the point p ∈ P that minimizes the maximum distance that any user has to travel, or the minimum distance from some user to his/her closest facility. If Q fits in memory and P is indexed by an R-tree, we develop algorithms for aggregate nearest neighbors that capture several versions of the problem, including weighted queries and incremental reporting of results. Then, we analyze their performance and propose cost models for query optimization. Finally, we extend our techniques for disk-resident …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:qjMakFHDy7sC",
            "Publisher": "ACM"
        },
        {
            "Title": "Constrained shortest path computation",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11535331_11",
            "Abstract": "This paper proposes and solves a-autonomy and k-stops shortest path problems in large spatial databases. Given a source s and a destination d, an a-autonomy query retrieves a sequence of data points connecting s and d, such that the distance between any two consecutive points in the path is not greater than a. A k-stops query retrieves a sequence that contains exactly k intermediate data points. In both cases our aim is to compute the shortest path subject to these constraints. Assuming that the dataset is indexed by a data-partitioning method, the proposed techniques initially compute a sub-optimal path by utilizing the Euclidean distance information provided by the index. The length of the retrieved path is used to prune the search space, filtering out large parts of the input dataset. In a final step, the optimal (a-autonomy or k-stops) path is computed (using only the non-eliminated data points) by an …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Geometric approaches for Top-k Queries [Tutorial]",
            "Publication year": 2017,
            "Publication url": "https://ink.library.smu.edu.sg/sis_research/3760/",
            "Abstract": "Top-k processing is a well-studied problem with numerous applications that is becoming increasingly relevant with the growing availability of recommendation systems and decision-making software. The objective of this tutorial is twofold. First, we will delve into the geometric aspects of top-k processing. Second, we will cover complementary features to top-k queries, with strong practical relevance and important applications, that have a computational geometric nature. The tutorial will close with insights in the effect of dimensionality on the meaningfulness of top-k queries, and interesting similarities to nearest neighbor search.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:CHSYGLWDkRkC",
            "Publisher": "VLDB"
        },
        {
            "Title": "Continuous monitoring of spatial queries in wireless broadcast environments",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4752832/",
            "Abstract": "Wireless data broadcast is a promising technique for information dissemination that leverages the computational capabilities of the mobile devices in order to enhance the scalability of the system. Under this environment, the data are continuously broadcast by the server, interleaved with some indexing information for query processing. Clients may then tune in the broadcast channel and process their queries locally without contacting the server. Previous work on spatial query processing for wireless broadcast systems has only considered snapshot queries over static data. In this paper, we propose an air indexing framework that 1) outperforms the existing (i.e., snapshot) techniques in terms of energy consumption while achieving low access latency and 2) constitutes the first method supporting efficient processing of continuous spatial queries over moving objects.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Best upgrade plans for large road networks",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40235-7_13",
            "Abstract": "In this paper, we consider a new problem in the context of road network databases, named Resource Constrained Best Upgrade Plan computation (BUP, for short). Consider a transportation network (weighted graph) G where a subset of the edges are upgradable, i.e., for each such edge there is a cost, which if spent, the weight of the edge can be reduced to a specific new value. Given a source and a destination in G, and a budget (resource constraint) B, the BUP problem is to identify which upgradable edges should be upgraded so that the shortest path distance between source and destination (in the updated network) is minimized, without exceeding the available budget for the upgrade. In addition to transportation networks, the BUP query arises in other domains too, such as telecommunications. We propose a framework for BUP processing and evaluate it with experiments on large, real road networks.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Direct neighbor search",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437914000428",
            "Abstract": "In this paper we study a novel query type, called direct neighbor query. Two objects in a dataset are direct neighbors (DNs) if a window selection may exclusively retrieve these two objects. Given a source object, a DN search computes all of its direct neighbors in the dataset. The DNs define a new type of affinity that differs from existing formulations (eg, nearest neighbors, nearest surrounders, reverse nearest neighbors, etc.) and finds application in domains where user interests are expressed in the form of windows, ie, multi-attribute range selections. Drawing on key properties of the DN relationship, we develop an I/O optimal processing algorithm for data indexed with a spatial access method. In addition to plain DN search, we also study its K-DN and all-DN variants. The former relaxes the DN condition–two objects are K-DNs if a window query may retrieve them and only up to K− 1 other objects–whereas the all …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Continuous monitoring of top-k queries over sliding windows",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1142473.1142544",
            "Abstract": "Given a dataset P and a preference function f, a top-k query retrieves the k tuples in P with the highest scores according to f. Even though the problem is well-studied in conventional databases, the existing methods are inapplicable to highly dynamic environments involving numerous long-running queries. This paper studies continuous monitoring of top-k queries over a fixed-size window W of the most recent data. The window size can be expressed either in terms of the number of active tuples or time units. We propose a general methodology for top-k monitoring that restricts processing to the sub-domains of the workspace that influence the result of some query. To cope with high stream rates and provide fast answers in an on-line fashion, the data in W reside in main memory. The valid records are indexed by a grid structure, which also maintains book-keeping information. We present two processing techniques …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tree-based partition querying: a methodology for computing medoids in large spatial datasets",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s00778-007-0045-2",
            "Abstract": "Besides traditional domains (e.g., resource allocation, data mining applications), algorithms for medoid computation and related problems will play an important role in numerous emerging fields, such as location based services and sensor networks. Since the k-medoid problem is NP-hard, all existing work deals with approximate solutions on relatively small datasets. This paper aims at efficient methods for very large spatial databases, motivated by: (1) the high and ever increasing availability of spatial data, and (2) the need for novel query types and improved services. The proposed solutions exploit the intrinsic grouping properties of a data partition index in order to read only a small part of the dataset. Compared to previous approaches, we achieve results of comparable or better quality at a small fraction of the CPU and I/O costs (seconds as opposed to hours, and tens of node accesses instead of …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Exact processing of uncertain top-k queries in multi-criteria settings",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.14778/3204028.3204031",
            "Abstract": "Traditional rank-aware processing assumes a dataset that contains available options to cover a specific need (e.g., restaurants, hotels, etc) and users who browse that dataset via top-k queries with linear scoring functions, i.e., by ranking the options according to the weighted sum of their attributes, for a set of given weights. In practice, however, user preferences (weights) may only be estimated with bounded accuracy, or may be inherently uncertain due to the inability of a human user to specify exact weight values with absolute accuracy. Motivated by this, we introduce the uncertain top-k query (UTK). Given uncertain preferences, that is, an approximate description of the weight values, the UTK query reports all options that may belong to the top-k set. A second version of the problem additionally reports the exact top-k set for each of the possible weight settings. We develop a scalable processing framework for both …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:KxtntwgDAa4C",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Authenticating the query results of text search engines",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.14778/1453856.1453875",
            "Abstract": "The number of successful attacks on the Internet shows that it is very difficult to guarantee the security of online search engines. A breached server that is not detected in time may return incorrect results to the users. To prevent that, we introduce a methodology for generating an integrity proof for each search result. Our solution is targeted at search engines that perform similarity-based document retrieval, and utilize an inverted list implementation (as most search engines do). We formulate the properties that define a correct result, map the task of processing a text search query to adaptations of existing threshold-based algorithms, and devise an authentication scheme for checking the validity of a result. Finally, we confirm the efficiency and practicality of our solution through an empirical evaluation with real documents and benchmark queries.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "On m-Impact Regions and Standing Top-k Influence Problems",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3448016.3452832",
            "Abstract": "In this paper, we study the m-impact region problem (mIR). In a context where users look for available products with top-k queries, mIR identifies the part of the product space that attracts the most user attention. Specifically, mIR determines the kind of attribute values that lead a (new or existing) product to the top-k result for at least a fraction of the user population. mIR has several applications, ranging from effective marketing to product improvement. Importantly, it also leads to (exact and efficient) solutions for standing top-k impact problems, which were previously solved heuristically only, or whose current solutions face serious scalability limitations. We experiment, among others, on data mined from actual user reviews for real products, and demonstrate the practicality and efficiency of our algorithms, both for mIR and for standing top-k impact problems.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing access privacy of range retrievals over B+-trees",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6180165/",
            "Abstract": "Users of databases that are hosted on shared servers cannot take for granted that their queries will not be disclosed to unauthorized parties. Even if the database is encrypted, an adversary who is monitoring the I/O activity on the server may still be able to infer some information about a user query. For the particular case of a B + -tree that has its nodes encrypted, we identify properties that enable the ordering among the leaf nodes to be deduced. These properties allow us to construct adversarial algorithms to recover the B + -tree structure from the I/O traces generated by range queries. Combining this structure with knowledge of the key distribution (or the plaintext database itself), the adversary can infer the selection range of user queries. To counter the threat, we propose a privacy-enhancing PB + -tree index which ensures that there is high uncertainty about what data the user has worked on, even to a …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Determining the impact regions of competing options in preference space",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3035918.3064044",
            "Abstract": "In rank-aware processing, user preferences are typically represented by a numeric weight per data attribute, collectively forming a weight vector. The score of an option (data record) is defined as the weighted sum of its individual attributes. The highest-scoring options across a set of alternatives (dataset) are shortlisted for the user as the recommended ones. In that setting, the user input is a vector (equivalently, a point) in a d-dimensional preference space, where d is the number of data attributes. In this paper we study the problem of determining in which regions of the preference space the weight vector should lie so that a given option (focal record) is among the top-k score-wise. In effect, these regions capture all possible user profiles for which the focal record is highly preferable, and are therefore essential in market impact analysis, potential customer identification, profile-based marketing, targeted advertising …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Best upgrade plans for single and multiple source-destination pairs",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10707-014-0219-1.pdf",
            "Abstract": "In this paper, we study Resource Constrained Best Upgrade Plan (BUP) computation in road network databases. Consider a transportation network (weighted graph) G where a subset of the edges are upgradable, i.e., for each such edge there is a cost, which if spent, the weight of the edge can be reduced to a specific new value. In the single-pair version of BUP, the input includes a source and a destination in G, and a budget B (resource constraint). The goal is to identify which upgradable edges should be upgraded so that the shortest path distance between source and destination (in the updated network) is minimized, without exceeding the available budget for the upgrade. In the multiple-pair version of BUP, a set Q of source-destination pairs is given, and the problem is to choose for upgrade those edges that lead to the smallest sum of shortest path distances across all pairs in Q, subject to budget …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Global immutable region computation",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2588555.2610508",
            "Abstract": "A top-k query shortlists the k records in a dataset that best match the user's preferences. To indicate her preferences, the user typically determines a numeric weight for each data dimension (ie, attribute). We refer to these weights collectively as the query vector. Based on this vector, each data record is implicitly mapped to a score value (via a weighted sum function). The records with the k largest scores are reported as the result. In this paper we propose an auxiliary feature to standard top-k query processing. Specifically, we compute the maximal locus within which the query vector incurs no change in the current top-k result. In other words, we compute all possible query weight settings that produce exactly the same top-k result as the user's original query. We call this locus the global immutable region (GIR). The GIR can be used as a guide to query vector readjustments, as a sensitivity measure for the top-k result …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scalable verification for outsourced dynamic databases",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.14778/1687627.1687718",
            "Abstract": "Query answers from servers operated by third parties need to be verified, as the third parties may not be trusted or their servers may be compromised. Most of the existing authentication methods construct validity proofs based on the Merkle hash tree (MHT). The MHT, however, imposes severe concurrency constraints that slow down data updates. We introduce a protocol, built upon signature aggregation, for checking the authenticity, completeness and freshness of query answers. The protocol offers the important property of allowing new data to be disseminated immediately, while ensuring that outdated values beyond a pre-set age can be detected. We also propose an efficient verification technique for ad-hoc equijoins, for which no practical solution existed. In addition, for servers that need to process heavy query workloads, we introduce a mechanism that significantly reduces the proof construction time by …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Shortest path computation on air indexes",
            "Publication year": 2010,
            "Publication url": "http://ink.library.smu.edu.sg/cgi/viewcontent.cgi?article=1614&context=sis_research",
            "Abstract": "Shortest path computation is one of the most common queries in location-based services that involve transportation net-works. Motivated by scalability challenges faced in the mo-bile network industry, we propose adopting the wireless broad-cast model for such location-dependent applications. In this model the data are continuously transmitted on the air, while clients listen to the broadcast and process their queries locally. Although spatial problems have been considered in this environment, there exists no study on shortest path queries in road networks. We develop the rst framework to compute shortest paths on the air, and demonstrate the practicality and e ciency of our techniques through exper-iments with real road networks and actual device speci ca-tions.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:MXK_kJrjxJIC",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Continuous monitoring of spatial queries",
            "Publication year": 2009,
            "Publication url": "http://ink.library.smu.edu.sg/cgi/viewcontent.cgi?article=1245&context=sis_research",
            "Abstract": "A continuous spatial query runs over long periods of time and requests constant reporting of its result as the data dynamically change. Typically, the query type is range or nearest neighbor (NN), and the assumed distance metric is the Euclidean one. In general, there are multiple queries being processed simultaneously. The query points and the data objects move frequently and arbitrarily, ie, their velocity vectors and motion patterns are unknown. They issue location updates to a central server, which processes them and continuously reports the current (ie, updated) query results. Consider, for example, that the queries correspond to vacant cabs, and that the data objects are pedestrians that ask for a taxi. As cabs and pedestrians move, each free taxi driver wishes to know his/her closest client. This is an instance of continuous NN monitoring. Spatial monitoring systems aim at minimizing the processing time at the …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer Verlag"
        },
        {
            "Title": "Creating top ranking options in the continuous option and preference space",
            "Publication year": 2019,
            "Publication url": "https://ink.library.smu.edu.sg/sis_research/4431/",
            "Abstract": "Top-k queries are extensively used to retrieve the k most relevantoptions (eg, products, services, accommodation alternatives, etc) based on a weighted scoring function that captures user preferences. In this paper, we take the viewpoint of a business owner whoplans to introduce a new option to the market, with a certain type ofclientele in mind. Given a target region in the consumer spectrum, we determine what attribute values the new option should have, so that it ranks among the top-k for any user in that region. Ourmethodology can also be used to improve an existing option, at theminimum modification cost, so that it ranks consistently high for anintended type of customers. This is the first work on competitiveoption placement where no distinct user (s) are targeted, but a general clientele type, ie, a continuum of possible preferences. Herealso lies our main challenge (and contribution), ie, dealing withthe interplay between two continuous spaces: the targeted regionin the preference spectrum, and the option domain (where the newoption will be placed). At the core of our methodology lies a noveland powerful interlinking between the two spaces. Our algorithmsoffer exact answers in practical response times, even for the largestof the standard benchmark datasets.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:XiSMed-E-HIC",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Efficient evaluation of multiple preference queries",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4812513/",
            "Abstract": "Consider multiple users searching for a hotel room, based on size, cost, distance to the beach, etc. Users may have variable preferences expressed by different weights on the attributes of the searched objects. Although individual preference queries can be evaluated by selecting the object in the database with the highest aggregate score, in the case of multiple requests at the same time, a single object cannot be assigned to more than one users. The challenge is to compute a fair 1-1 matching between the queries and a subset of the objects. We model this as a stable-marriage problem and propose an efficient technique for its evaluation. Our algorithm is an iterative process, which finds at each step the query-object pair with the highest score and removes it from the problem. This is done efficiently by maintaining and matching the skyline of the remaining objects with the remaining queries at each step. An …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Heuristic algorithms for balanced multi-way number partitioning",
            "Publication year": 2011,
            "Publication url": "https://www.aaai.org/ocs/index.php/IJCAI/IJCAI11/paper/viewPaper/3251",
            "Abstract": "Balanced multi-way number partitioning (BMNP) seeks to split a collection of numbers into subsets with (roughly) the same cardinality and subset sum. The problem is NP-hard, and there are several exact and approximate algorithms for it. However, existing exact algorithms solve only the simpler, balanced two-way number partitioning variant, whereas the most effective approximate algorithm, BLDM, may produce widely varying subset sums. In this paper, we introduce the LRM algorithm that lowers the expected spread in subset sums to one third that of BLDM for uniformly distributed numbers and odd subset cardinalities. We also propose Meld, a novel strategy for skewed number distributions. A combination of LRM and Meld leads to a heuristic technique that consistently achieves a narrower spread of subset sums than BLDM.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spatial queries in the presence of obstacles",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24741-8_22",
            "Abstract": "Despite the existence of obstacles in many database applications, traditional spatial query processing utilizes the Euclidean distance metric assuming that points in space are directly reachable. In this paper, we study spatial queries in the presence of obstacles, where the obstructed distance between two points is defined as the length of the shortest path that connects them without crossing any obstacles. We propose efficient algorithms for the most important query types, namely, range search, nearest neighbors, e-distance joins and closest pairs, considering that both data objects and obstacles are indexed by R-trees. The effectiveness of the proposed solutions is verified through extensive experiments.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Continuous monitoring of multi-dimensional queries",
            "Publication year": 2006,
            "Publication url": "https://search.proquest.com/openview/cf6a3a54dac8442c7d306ec0ec01db36/1?pq-origsite=gscholar&cbl=18750&diss=y",
            "Abstract": "This thesis studies the monitoring of continuous multi-dimensional queries. A continuous query runs over long periods of time and requests reporting of its result as the data dynamically change. Initially, we focus on nearest neighbor (NN) monitoring, a problem that typically arises in location-based services. In this context, the query points and the data objects move arbitrarily, and the task of a central server is to report the k closest objects (ie, the k NNs) to each query point. First, we propose a method that aims at minimizing the communication cost spent in message exchanges between the data objects and the server. Our second contribution is an algorithm that minimizes the processing cost at the server, assuming that the distance between objects and queries is defined according to the Euclidean metric. Next, we present efficient NN monitoring techniques targeted to applications where the objects and the queries …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Query processing in spatial databases containing obstacles",
            "Publication year": 2005,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13658810500286935",
            "Abstract": "Despite the existence of obstacles in many database applications, traditional spatial query processing assumes that points in space are directly reachable and utilizes the Euclidean distance metric. In this paper, we study spatial queries in the presence of obstacles, where the obstructed distance between two points is defined as the length of the shortest path that connects them without crossing any obstacles. We propose efficient algorithms for the most important query types, namely, range search, nearest neighbours, e‐distance joins, closest pairs and distance semi‐joins, assuming that both data objects and obstacles are indexed by R‐trees. The effectiveness of the proposed solutions is verified through extensive experiments.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Optimal matching between spatial datasets under capacity constraints",
            "Publication year": 2010,
            "Publication url": "https://ink.library.smu.edu.sg/sis_research/206/",
            "Abstract": "Consider a set of customers (eg, WiFi receivers) and a set of service providers (eg, wireless access points), where each provider has a capacity and the quality of service offered to its customers is anti-proportional to their distance. The capacity constrained assignment (CCA) is a matching between the two sets such that (i) each customer is assigned to at most one provider,(ii) every provider serves no more customers than its capacity,(iii) the maximum possible number of customers are served, and (iv) the sum of Euclidean distances within the assigned provider-customer pairs is minimized. Although max-flow algorithms are applicable to this problem, they require the complete distance-based bipartite graph between the customer and provider sets. For large spatial datasets, this graph is expensive to compute and it may be too large to fit in main memory. Motivated by this fact, we propose efficient algorithms for optimal assignment that employ novel edge-pruning strategies, based on the spatial properties of the problem. Additionally, we develop incremental techniques that maintain an optimal assignment (in the presence of updates) with a processing cost several times lower than CCA re-computation from scratch. Finally, we present approximate (ie, suboptimal) CCA solutions that provide a tunable trade-off between result accuracy and computation cost, abiding by theoretical quality guarantees. A thorough experimental evaluation demonstrates the efficiency and practicality of the proposed techniques.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:4DMP91E08xMC",
            "Publisher": "ACM"
        },
        {
            "Title": "A threshold-based algorithm for continuous monitoring of k nearest neighbors",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1512032/",
            "Abstract": "Assume a set of moving objects and a central server that monitors their positions over time, while processing continuous nearest neighbor queries from geographically distributed clients. In order to always report up-to-date results, the server could constantly obtain the most recent position of all objects. However, this naive solution requires the transmission of a large number of rapid data streams corresponding to location updates. Intuitively, current information is necessary only for objects that may influence some query result (i.e., they may be included in the nearest neighbor set of some client). Motivated by this observation, we present a threshold-based algorithm for the continuous monitoring of nearest neighbors that minimizes the communication overhead between the server and the data objects. The proposed method can be used with multiple, static, or moving queries, for any distance definition, and does not …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient motif discovery in spatial trajectories using discrete fréchet distance",
            "Publication year": 2017,
            "Publication url": "http://ink.library.smu.edu.sg/cgi/viewcontent.cgi?article=4635&context=sis_research",
            "Abstract": "The discrete Fréchet distance (DFD) captures perceptual and geographicalsimilarity between discrete trajectories. It has been successfullyadopted in a multitude of applications, such as signatureand handwriting recognition, computer graphics, as well as geographicapplications. Spatial applications, eg, sports analysis, traffic analysis, etc. require discovering the pair of most similarsubtrajectories, be them parts of the same or of different input trajectories. The identified pair of subtrajectories is called a motif. The adoption of DFD as the similarity measure in motif discovery, although semantically ideal, is hindered by the high computationalcomplexity of DFD calculation. In this paper, we propose asuite of novel lower bound functions and a grouping-based solutionwith multi-level pruning in order to compute motifs with DFD ef-ficiently. Our techniques apply directly to motif discovery withinthe same or between different …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:bFI3QPDXJZMC",
            "Publisher": "EDBT"
        },
        {
            "Title": "Continuous nearest neighbor monitoring in road networks",
            "Publication year": 2006,
            "Publication url": "http://ink.library.smu.edu.sg/cgi/viewcontent.cgi?article=1871&context=sis_research",
            "Abstract": "Recent research has focused on continuous monitoring of nearest neighbors (NN) in highly dynamic scenarios, where the queries and the data objects move frequently and arbitrarily. All existing methods, however, assume the Euclidean distance metric. In this paper we study k-NN monitoring in road networks, where the distance between a query and a data object is determined by the length of the shortest path connecting them. We propose two methods that can handle arbitrary object and query moving patterns, as well as uctuations of edge weights. The rst one maintains the query results by processing only updates that may invalidate the current NN sets. The second method follows the shared execution paradigm to reduce the processing time. In particular, it groups together the queries that fall in the path between two consecutive intersections in the network, and produces their results by monitoring the NN sets …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:d1gkVwhDpl0C",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Discovering historic traffic-tolerant paths in road networks",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10707-016-0265-y.pdf",
            "Abstract": "Historic traffic information is valuable in transportation analysis and planning, e.g., evaluating the reliability of routes for representative source-destination pairs. Also, it can be utilized to provide efficient and effective route-search services. In view of these applications, we propose the k traffic-tolerant paths (TTP) problem on road networks, which takes a source-destination pair and historic traffic information as input, and returns k paths that minimize the aggregate (historic) travel time. Unlike the shortest path problem, the TTP problem has a combinatorial search space that renders the optimal solution expensive to find. First, we propose an exact algorithm with effective pruning rules to reduce the search time. Second, we develop an anytime heuristic algorithm that makes ‘best-effort’ to find a low-cost solution within a given time limit. Extensive experiments on real and synthetic traffic data demonstrate the …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Applying Spatial Database Techniques to Other Domains: a Case Study on Top-k and Computational Geometric Operators",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3210272.3226094",
            "Abstract": "In this seminar, we will explore how processing rich spatial data is not the only practical (and research-wise promising) application domain for traditional spatial database techniques. An equally promising direction, possibly with low-hanging fruits for research innovation, may be to apply the spatial data management expertise of our community to non-spatial types of queries, and to extend standard, more theoretical operators to large scale datasets with the objective of practical solutions (as opposed to favorable asymptotic complexity alone). As a case study, we will review spatial database work on top-k-related operators (ie, non-spatial problems) and how it integrates fundamental computational geometric operators with spatial indexing/pruning to produce efficient solutions to practical problems.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Shortlisting top-k assignments",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2484838.2484859",
            "Abstract": "In this paper we identify a novel query type, the top-K assignment query (αTop-K). Consider a set of objects and a set of suppliers, where each object must be assigned to one supplier. Assume that there is a cost associated with every object-supplier pair. If we allocate each object to the server with the smallest cost (for the specific object), the derived overall assignment will have the minimum total cost. In many scenarios, however, runner-up assignments may be required too, like for example when a decision maker needs to make additional considerations, not captured by individual object-supplier costs. In this case, it is necessary to examine several shortlisted assignments before choosing one. This motivates the αTop-K query, which computes the K best assignments, ie, those achieving the K smallest total costs. Algorithms for the traditional assignment ranking problem could be adapted to process the query, but …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Joint Search by Social and Spatial Proximity [Extended Abstract].(2016)",
            "Publication year": 2016,
            "Publication url": "https://ink.library.smu.edu.sg/cgi/viewcontent.cgi?referer=&httpsredir=1&article=4218&context=sis_research",
            "Abstract": "The diffusion of social networks introduces new challenges and opportunities for advanced services, especially so with their ongoing addition of location-based features. We show how applications like company and friend recommendation could significantly benefit from incorporating social and spatial proximity, and study a query type that captures these twofold semantics. We develop highly scalable algorithms for its processing, and use real social network data to empirically verify their efficiency and efficacy.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:tOudhMTPpwUC",
            "Publisher": "ICDE"
        },
        {
            "Title": "Spatial cloaking revisited: Distinguishing information leakage from anonymity",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02982-0_10",
            "Abstract": "Location-based services (LBS) are receiving increasing popularity as they provide convenience to mobile users with on-demand information. The use of these services, however, poses privacy issues as the user locations and queries are exposed to untrusted LBSs. Spatial cloaking techniques provide privacy in the form of k-anonymity; i.e., they guarantee that the (location of the) querying user u is indistinguishable from at least k-1 others, where k is a parameter specified by u at query time. To achieve this, they form a group of k users, including u, and forward their minimum bounding rectangle (termed anonymizing spatial region, ASR) to the LBS. The rationale behind sending an ASR instead of the distinct k locations is that exact user positions (querying or not) should not be disclosed to the LBS. This results in large ASRs with considerable dead-space, and leads to unnecessary performance degradation …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Historical traffic-tolerant paths in road networks",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2666310.2666483",
            "Abstract": "Historical traffic information is valuable for transportation analysis and planning, as well as for route search services. In view of these applications, we propose the k traffic-tolerant paths problem (TTP) on road networks, which takes a source-destination pair and historical traffic information as input, and returns k paths that minimize the aggregate (historical) travel time. Unlike the shortest path problem, the TTP problem has a combinatorial search space that renders the optimal solution expensive to compute. We propose an exact algorithm and a heuristic algorithm for this problem. Experiments on real traffic data demonstrate the effectiveness of TTP paths and the efficiency of our proposed algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computing immutable regions for subspace top-k queries",
            "Publication year": 2013,
            "Publication url": "https://ink.library.smu.edu.sg/sis_research/1624/",
            "Abstract": "Given a high-dimensional dataset, a top-k query can be used to shortlist the k tuples that best match the user’s preferences. Typically, these preferences regard a subset of the available dimensions (ie, attributes) whose relative significance is expressed by user-specified weights. Along with the query result, we propose to compute for each involved dimension the maximal deviation to the corresponding weight for which the query result remains valid. The derived weight ranges, called immutable regions, are useful for performing sensitivity analysis, for finetuning the query weights, etc. In this paper, we focus on top-k queries with linear preference functions over the queried dimensions. We codify the conditions under which changes in a dimension’s weight invalidate the query result, and develop algorithms to compute the immutable regions. In general, this entails the examination of numerous non-result tuples. To reduce processing time, we introduce a pruning technique and a thresholding mechanism that allow the immutable regions to be determined correctly after examining only a small number of non-result tuples. We demonstrate empirically that the two techniques combine well to form a robust and highly resource-efficient algorithm. We verify the generality of our findings using real high-dimensional data from different domains (documents, images, etc) and with different characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:mB3voiENLucC",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Joint search by social and spatial proximity",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6858087/",
            "Abstract": "The diffusion of social networks introduces new challenges and opportunities for advanced services, especially so with their ongoing addition of location-based features. We show how applications like company and friend recommendation could significantly benefit from incorporating social and spatial proximity, and study a query type that captures these two-fold semantics. We develop highly scalable algorithms for its processing, and enhance them with elaborate optimizations. Finally, we use real social network data to empirically verify the efficiency and efficacy of our solutions.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Preventing location-based identity inference in anonymous spatial queries",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4358948/",
            "Abstract": "The increasing trend of embedding positioning capabilities (for example, GPS) in mobile devices facilitates the widespread use of location-based services. For such applications to succeed, privacy and confidentiality are essential. Existing privacy-enhancing techniques rely on encryption to safeguard communication channels, and on pseudonyms to protect user identities. Nevertheless, the query contents may disclose the physical location of the user. In this paper, we present a framework for preventing location-based identity inference of users who issue spatial queries to location-based services. We propose transformations based on the well-established K-anonymity concept to compute exact answers for range and nearest neighbor search, without revealing the query source. Our methods optimize the entire process of anonymizing the requests and processing the transformed spatial queries. Extensive …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spatial queries in wireless broadcast environments",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2258056.2258065",
            "Abstract": "Wireless data broadcasting is a promising technique for information dissemination that exploits the computational capabilities of mobile devices, in order to enhance the scalability of the system. Under this environment, the data are continuously broadcast by the server, interleaved with some indexing information for query processing. Clients may tune in the broadcast channel and process their queries locally without contacting the server. In this paper we focus on spatial queries in particular. First, we review existing methods on this topic. Next, taking shortest path computation as an example, we showcase technical challenges arising in this processing model and describe techniques to address them.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On-line discovery of hot motion paths",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1353343.1353392",
            "Abstract": "We consider an environment of numerous moving objects, equipped with location-sensing devices and capable of communicating with a central coordinator. In this setting, we investigate the problem of maintaining hot motion paths, ie, routes frequently followed by multiple objects over the recent past. Motion paths approximate portions of objects' movement within a tolerance margin that depends on the uncertainty inherent in positional measurements. Discovery of hot motion paths is important to applications requiring classification/profiling based on monitored movement patterns, such as targeted advertising, resource allocation, etc. To achieve this goal, we delegate part of the path extraction process to objects, by assigning to them adaptive lightweight filters that dynamically suppress unnecessary location updates and, thus, help reducing the communication overhead. We demonstrate the benefits of our methods …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On discovering motifs and frequent patterns in spatial trajectories with discrete Fréchet distance",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10707-021-00438-x",
            "Abstract": "The discrete Fréchet distance (DFD) captures perceptual and geographical similarity between two trajectories. It has been successfully adopted in a multitude of applications, such as signature and handwriting recognition, computer graphics, as well as geographic applications. Spatial applications, eg, sports analysis, traffic analysis, etc. require discovering similar subtrajectories within a single trajectory or across multiple trajectories. In this paper, we adopt DFD as the similarity measure, and study two representative trajectory analysis problems, namely, motif discovery and frequent pattern discovery. Due to the time complexity of DFD, these tasks are computationally challenging. We address that challenge with a suite of novel lower bound functions and a grouping-based solution. Our techniques apply directly when the analysis tasks are defined within the same or across multiple trajectories. An extensive …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Computing medoids in large spatial datasets",
            "Publication year": 2009,
            "Publication url": "https://ink.library.smu.edu.sg/sis_research/247/",
            "Abstract": "In this chapter, we consider a class of queries that arise in spatial decision making and resource allocation applications. Assume that a company wants to open a number of warehouses in a city. Let P be the set of residential blocks in the city. P represents customer locations to be potentially served by the company. At the same time, P also comprises the candidate warehouse locations because the warehouses themselves must be opened in some residential blocks.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:u9iWguZQMMsC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "A fair assignment algorithm for multiple preference queries",
            "Publication year": 2009,
            "Publication url": "https://ink.library.smu.edu.sg/sis_research/873/",
            "Abstract": "Consider an internship assignment system, where at the end of each academic year, interested university students search and apply for available positions, based on their preferences (eg, nature of the job, salary, office location, etc). In a variety of facility, task or position assignment contexts, users have personal preferences expressed by different weights on the attributes of the searched objects. Although individual preference queries can be evaluated by selecting the object in the database with the highest aggregate score, in the case of multiple simultaneous requests, a single object cannot be assigned to more than one users. The challenge is to compute a fair 1-1 matching between the queries and the objects. We model this as a stable-marriage problem and propose an efficient method for its processing. Our algorithm iteratively finds stable query-object pairs and removes them from the problem. At its core lies a novel skyline maintenance technique, which we prove to be I/O optimal. We conduct an extensive experimental evaluation using real and synthetic data, which demonstrates that our approach outperforms adaptations of previous methods by several orders of magnitude.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "ACM"
        },
        {
            "Title": "Anonymous query processing in road networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4782961/",
            "Abstract": "The increasing availability of location-aware mobile devices has given rise to a flurry of location-based services (LBSs). Due to the nature of spatial queries, an LBS needs the user position in order to process her requests. On the other hand, revealing exact user locations to a (potentially untrusted) LBS may pinpoint their identities and breach their privacy. To address this issue, spatial anonymity techniques obfuscate user locations, forwarding to the LBS a sufficiently large region instead. Existing methods explicitly target processing in the euclidean space and do not apply when proximity to the users is defined according to network distance (e.g., driving time through the roads of a city). In this paper, we propose a framework for anonymous query processing in road networks. We design location obfuscation techniques that: (1) provide anonymous LBS access to the users and (2) allow efficient query processing at the …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Medoid queries in large spatial databases",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11535331_4",
            "Abstract": "Assume that a franchise plans to open k branches in a city, so that the average distance from each residential block to the closest branch is minimized. This is an instance of the k-medoids problem, where residential blocks constitute the input dataset and the k branch locations correspond to the medoids. Since the problem is NP-hard, research has focused on approximate solutions. Despite an avalanche of methods for small and moderate size datasets, currently there exists no technique applicable to very large databases. In this paper, we provide efficient algorithms that utilize an existing data-partition index to achieve low CPU and I/O cost. In particular, we exploit the intrinsic grouping properties of the index in order to avoid reading the entire dataset. Furthermore, we apply our framework to solve medoid-aggregate queries, where k is not known in advance; instead, we are asked to compute a medoid set …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Geometric Top-k Processing: Updates Since MDM'16 [Advanced Seminar]",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8788837/",
            "Abstract": "The top-k query has been studied extensively, and is considered the norm for multi-criteria decision making in large databases. In recent years, research has considered several complementary operators to the traditional top-k query, drawing inspiration (both in terms of problem formulation and solution design) from the geometric nature of the top-k processing model. In this seminar, we will present advances in that stream of work, focusing on updates since the preliminary seminar on the same topic in MDM'16.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Continuous top-k monitoring on document streams",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7831369/",
            "Abstract": "The efficient processing of document streams plays an important role in many information filtering systems. Emerging applications, such as news update filtering and social network notifications, demand presenting end-users with the most relevant content to their preferences. In this work, user preferences are indicated by a set of keywords. A central server monitors the document stream and continuously reports to each user the top-k documents that are most relevant to her keywords. Our objective is to support large numbers of users and high stream rates, while refreshing the top-k results almost instantaneously. Our solution abandons the traditional frequency-ordered indexing approach. Instead, it follows an identifier-ordering paradigm that suits better the nature of the problem. When complemented with a novel, locally adaptive technique, our method offers (i) proven optimality w.r.t. the number of considered …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic Nearest Neighbor Queries in Euclidean Space",
            "Publication year": 2017,
            "Publication url": "https://ink.library.smu.edu.sg/sis_research/3217/",
            "Abstract": "Given a query point q and a set D of data points, a nearest neighbor (NN) query returns the data point p in D that minimizes the distance DIST (q, p), where the distance function DIST (,) is the L 2 norm. One important variant of this query type is kNN query, which returns k data points with the minimum distances. When taking the temporal dimension into account, the k NN query result may change over a period of time due to changes in locations of the query point and/or data points.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer"
        },
        {
            "Title": "Efficient verification of shortest path search via authenticated hints",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5447914/",
            "Abstract": "Shortest path search in transportation networks is unarguably one of the most important online search services nowadays (e.g., Google Maps, MapQuest, etc), with applications spanning logistics, spatial optimization, or everyday driving decisions. Often times, the owner of the road network data (e.g., a transport authority) provides its database to third-party query services, which are responsible for answering shortest path queries posed by their clients. The issue arising here is that a query service might be returning sub-optimal paths either purposely (in order to serve its own purposes like computational savings or commercial reasons) or because it has been compromised by Internet attackers who falsify the results. Therefore, for the above applications to succeed, it is essential that each reported path is accompanied by a proof, which allows clients to verify the path's correctness. This is the first study on shortest …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data Stream Processing: An Overview of Recent Research",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.94.7913&rep=rep1&type=pdf",
            "Abstract": "Traditional data base management systems are designed to handle persistent data and answer transient queries. However, due to the evolution of network, telecommunication and sensor technologies, a new data processing model has recently arisen. In this scenario, continuous and long-running queries are posed over transient streaming data ([BBDMW02, GO03]). Example applications include among others, financial tickers, network traffic monitoring, web and transaction log analysis, and sensor networks. In such environments, data arrive in the form of multiple high-speed data streams that have to be processed online and provide near-real time answers to the queries.A data stream is a continuous, time-varying, unbounded sequence of data-items. Stream items usually take the form of relational tuples that are disposed after they get processed, implying that online stream algorithms are restricted to only one pass over the data. Data arrival rates are arbitrary and cannot be controlled by the processing system. They are unpredictable and fluctuate vastly over time. Moreover, explicitly storing a stream in its entirety is impossible, due to its unbounded nature.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conceptual partitioning: An efficient method for continuous nearest neighbor monitoring",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1066157.1066230",
            "Abstract": "Given a set of objects P and a query point q, a k nearest neighbor (k-NN) query retrieves the k objects in P that lie closest to q. Even though the problem is well-studied for static datasets, the traditional methods do not extend to highly dynamic environments where multiple continuous queries require real-time results, and both objects and queries receive frequent location updates. In this paper we propose conceptual partitioning (CPM), a comprehensive technique for the efficient monitoring of continuous NN queries. CPM achieves low running time by handling location updates only from objects that fall in the vicinity of some query (and ignoring the rest). It can be used with multiple, static or moving queries, and it does not make any assumptions about the object moving patterns. We analyze the performance of CPM and show that it outperforms the current state-of-the-art algorithms for all problem settings. Finally, we …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Strong location privacy: A case study on shortest path queries",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6547441/",
            "Abstract": "The last few years have witnessed an increasing availability of location-based services (LBSs). Although particularly useful, such services raise serious privacy concerns. For example, exposing to a (potentially untrusted) LBS the client's position may reveal personal information, such as social habits, health condition, shopping preferences, lifestyle choices, etc. There is a large body of work on protecting the location privacy of the clients. In this paper, we focus on shortest path queries, describe a framework based on private information retrieval (PIR), and conclude with open questions about the practicality of PIR and other location privacy approaches.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Continuous spatial assignment of moving users",
            "Publication year": 2010,
            "Publication url": "https://ink.library.smu.edu.sg/sis_research/2450/",
            "Abstract": "Consider a set of servers and a set of users, where each server has a coverage region (ie, an area of service) and a capacity (ie, a maximum number of users it can serve). Our task is to assign every user to one server subject to the coverage and capacity constraints. To offer the highest quality of service, we wish to minimize the average distance between users and their assigned server. This is an instance of a well-studied problem in operations research, termed optimal assignment. Even though there exist several solutions for the static case (where user locations are fixed), there is currently no method for dynamic settings. In this paper, we consider the continuous assignment problem (CAP), where an optimal assignment must be constantly maintained between mobile users and a set of servers. The fact that the users are mobile necessitates real-time reassignment so that the quality of service remains high (ie, their distance from their assigned servers is minimized). The large scale and the time-critical nature of targeted applications require fast CAP solutions. We propose an algorithm that utilizes the geometric characteristics of the problem and significantly accelerates the initial assignment computation and its subsequent maintenance. Our method applies to different cost functions (eg, average squared distance) and to any Minkowski distance metric (eg, Euclidean, L1 norm, etc).",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Continuous nearest neighbor queries over sliding windows",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4161900/",
            "Abstract": "This paper studies continuous monitoring of nearest neighbor (NN) queries over sliding window streams. According to this model, data points continuously stream in the system, and they are considered valid only while they belong to a sliding window that contains 1) the W most recent arrivals (count-based) or 2) the arrivals within a fixed interval W covering the most recent time stamps (time-based). The task of the query processor is to constantly maintain the result of long-running NN queries among the valid data. We present two processing techniques that apply to both count-based and time-based windows. The first one adapts conceptual partitioning, the best existing method for continuous NN monitoring over update streams, to the sliding window model. The second technique reduces the problem to skyline maintenance in the distance-time space and precomputes the future changes in the NN set. We analyze …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Shortest path computation with no information leakage",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1204.6076",
            "Abstract": "Shortest path computation is one of the most common queries in location-based services (LBSs). Although particularly useful, such queries raise serious privacy concerns. Exposing to a (potentially untrusted) LBS the client's position and her destination may reveal personal information, such as social habits, health condition, shopping preferences, lifestyle choices, etc. The only existing method for privacy-preserving shortest path computation follows the obfuscation paradigm; it prevents the LBS from inferring the source and destination of the query with a probability higher than a threshold. This implies, however, that the LBS still deduces some information (albeit not exact) about the client's location and her destination. In this paper we aim at strong privacy, where the adversary learns nothing about the shortest path query. We achieve this via established private information retrieval techniques, which we treat as black-box building blocks. Experiments on real, large-scale road networks assess the practicality of our schemes.",
            "Abstract entirety": 1,
            "Author pub id": "vq5oTnEAAAAJ:aqlVkmm33-oC",
            "Publisher": "VLDB Endowment"
        },
        {
            "Title": "Partially materialized digest scheme: an efficient verification method for outsourced databases",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s00778-008-0108-z",
            "Abstract": "In the outsourced database model, a data owner publishes her database through a third-party server; i.e., the server hosts the data and answers user queries on behalf of the owner. Since the server may not be trusted, or may be compromised, users need a means to verify that answers received are both authentic and complete, i.e., that the returned data have not been tampered with, and that no qualifying results have been omitted. We propose a result verification approach for one-dimensional queries, called Partially Materialized Digest scheme (PMD), that applies to both static and dynamic databases. PMD uses separate indexes for the data and for their associated verification information, and only partially materializes the latter. In contrast with previous work, PMD avoids unnecessary costs when processing queries that do not request verification, achieving the performance of an ordinary index (e.g., a B …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Capacity constrained assignment in spatial databases",
            "Publication year": 2008,
            "Publication url": "http://ink.library.smu.edu.sg/cgi/viewcontent.cgi?article=1411&context=sis_research",
            "Abstract": "Given a point set P of customers (eg, WiFi receivers) and a point set Q of service providers (eg, wireless access points), where each q 2 Q has a capacity qk, the capacity constrained assignment (CCA) is a matching MQ× P such that (i) each point q 2 Q (p 2 P) appears at most k times (at most nce) in M,(ii) the size of M is maximized (ie, it comprises min {| P|, P q2Q qk} pairs), and (iii) the total assignment cost (ie, the sum of Euclidean distances within all pairs) is minimized. Thus, the CCA problem is to identify the assignment with the optimal overall quality; intuitively, the quality of q’s service to p in a given (q, p) pair is anti-proportional to their distance. Although max-flow algorithms are applicable to this problem, they require the complete distance-based bipartite graph between Q and P. For large spatial datasets, this graph is expensive to compute and it may be too large to fit in main memory. Motivated by this fact, we …",
            "Abstract entirety": 0,
            "Author pub id": "vq5oTnEAAAAJ:roLk4NBRz8UC",
            "Publisher": "ACM"
        }
    ]
}]