[{
    "name": "Κυριάκος Σγάρμπας",
    "romanize name": "Kyriakos Sgarmpas",
    "School-Department": "Ηλεκτρολόγων Μηχανικών και Τεχνολογίας Υπολογιστών",
    "University": "upatras",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 18767,
    "Scholar name": "Kyriakos Sgarbas (Κυριάκος Σγάρμπας)",
    "Scholar id": "TTgOnWAAAAAJ",
    "Affiliation": "Assoc. Professor, Dept. of Electrical & Computer Engineering, University of Patras, Hellas (Greece)",
    "Citedby": 870,
    "Interests": [
        "Artificial Intelligence",
        "Quantum Information Processing",
        "Computational Linguistics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=TTgOnWAAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Self-trained Rotation Forest for semi-supervised learning",
            "Publication year": 2016,
            "Publication url": "https://content.iospress.com/articles/journal-of-intelligent-and-fuzzy-systems/ifs152641",
            "Abstract": "The most important asset of semi-supervised learning (SSL) methods is the use of available unlabeled data combined with an enough smaller set of labeled examples, so as to increase the classification accuracy compared with the default procedure of supervised methods, in which during the training only the labeled data are used. The encapsulation of classifier ensembles that produce different models through training process into semi-supervised schemes seems to be a promising strategy for enhanced learning ability. In this work, a Self-trained Rotation Forest (Self-RotF) algorithm and a variant of this (Weighted-Self-RotF) are presented. We performed an in depth comparison with other well-known semi-supervised classification methods on standard benchmark datasets and after having tested their performance with statistical tests, we finally reached to the point that the presented technique had better accuracy …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:D03iK_w7-QYC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Detection of dialogue acts using perplexity-based word clustering",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74628-7_82",
            "Abstract": "In the present work we used a word clustering algorithm based on the perplexity criterion, in a Dialogue Act detection framework in order to model the structure of the speech of a user at a dialogue system. Specifically, we constructed an n-gram based model for each target Dialogue Act, computed over the word classes. Then we evaluated the performance of our dialogue system on ten different types of dialogue acts, using an annotated database which contains 1,403,985 unique words. The results were very promising since we achieved about 70% of accuracy using trigram based models.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A speech-based human-computer interaction system for automating directory assistance services",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1022338631326",
            "Abstract": "The automation of Directory Assistance Services (DAS) through speech is one of the most difficult and demanding applications of human-computer interaction because it deals with very large vocabulary recognition issues. In this paper, we present a spoken dialogue system for automating DAS.1 Taking into account the major difficulties of this endeavor a stepwise approach was adopted. In particular, two prototypes D1.1 (basic approach) and D1.2 (improved version) were developed successively. The results of D1.1 evaluation were used to refine D1.1 and gradually led to D1.2 that was also improved using a feedback approach. Furthermore, the system was extended and optimized so that it can be utilized in real-world conditions. We describe the general architecture and the three stages of the system's development in detail. Evaluation results concerning both the speech recognizer's accuracy and the …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "On the development of brain quantum-computer interfaces",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7064311/",
            "Abstract": "In this paper, we overview basic quantum machine learning algorithms and we highlight their potential application for rehabilitation brain computer interface systems. The paper provides a very brief introduction to basic quantum theory issues, such as quantum registers and quantum gates, as well as basic limitations of brain computer interface systems. Finally, we present references, ideas and research guidelines on how quantum theory can be used to deal with such limitations. Our ideas might result in \"brain quantum-computer interfaces\", as soon as quantum computers become widely available, resulting in real-time apparatus.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Αυτόματη αξιολόγηση ασκήσεων προγραμματισμού, με χρήση της πλατφόρμας DOMjudge",
            "Publication year": 2016,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/589",
            "Abstract": "Η διδασκαλία μαθημάτων προγραμματισμού, ιδιαίτερα στα μικρά έτη των πανεπιστημιακών ιδρυμάτων, απαιτεί τη διόρθωση σημαντικού αριθμού ασκήσεων (κώδικα) που πολλαπλασιαζόμενος με το μεγάλο πλήθος φοιτητών δημιουργεί έναν σημαντικό φόρτο εργασίας και απαιτεί πολυμελείς ομάδες διδασκόντων για τη διόρθωση. Μάλιστα, συχνά η αξιολόγηση των ασκήσεων πρέπει να γίνει σε ιδιαίτερα περιορισμένο χρόνο, ώστε οι φοιτητές να γνωρίζουν την επίδοσή τους σε μια άσκηση πριν ασχοληθούν με την επόμενη. Στο παρόν κείμενο παρουσιάζεται μια λύση στο παραπάνω πρόβλημα, βασισμένη στην τροποποίηση της πλατφόρμας DOMjudge (που κανονικά χρησιμοποιείται για διαγωνισμούς προγραμματισμού) ώστε να διορθώνει και να αξιολογεί αυτόματα (ακόμη και σε πραγματικό χρόνο) ασκήσεις προγραμματισμού. Στο τροποποιημένο σύστημα που παρουσιάζεται στην εργασία, οι διδάσκοντες μπορούν να ορίζουν τμήματα και επί μέρους μαθήματα, ανοικτής ή περιορισμένης πρόσβασης, στα οποία εισάγουν ασκήσεις προγραμματισμού προς επίλυση. Οι φοιτητές μπορούν να λύσουν τις ασκήσεις μέσα από έναν φυλλομετρητή (web-browser), χωρίς να εγκαταστήσουν οποιαδήποτε εφαρμογή και ανεξαρτήτως λειτουργικού συστήματος, χρησιμοποιώντας έναν διαδραστικό κειμενογράφο, ο οποίος υποστηρίζει μεγάλη ποικιλία γλωσσών προγραμματισμού. Στην παρούσα εργασία, αναλύονται όλες οι επιμέρους τροποποιήσεις που έγιναν στην αρχική έκδοση της πλατφόρμας DOMjudge, τόσο σε λειτουργικότητα των επιπλέον δυνατοτήτων, όσο και στη δομή της βάσης δεδομένων που την υποστηρίζει. Το τροποποιημένο σύστημα στοχεύει στην απομακρυσμένη …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effectiveness of semi-supervised learning in bankruptcy prediction",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7785435/",
            "Abstract": "Adoption of techniques from fields related with Data Science, such as Machine Learning, Data Mining and Predictive Analysis, in the task of bankruptcy prediction can produce useful knowledge for both the policy makers and the organizations that are already funding or are interested in acting towards this direction in the near future. The nature of this task prevents analysts from collecting large amount of data for building accurate predictive models. Semi-supervised algorithms overcome this phenomenon and can perform robust behavior based on a few data. Experiments using data from Greek firms have been made in this work, comparing many semi-supervised schemes against well-known supervised algorithms and the results are promising.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Self-trained stacking model for semi-supervised learning",
            "Publication year": 2017,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213017500014",
            "Abstract": "The most important characteristic of semi-supervised learning methods is the combination of available unlabeled data along with an enough smaller set of labeled examples, so as to increase the learning accuracy compared with the default procedure of supervised methods, which on the other hand use only the labeled data during the training phase. In this work, we have implemented a hybrid Self-trained system that combines a Support Vector Machine, a Decision Tree, a Lazy Learner and a Bayesian algorithm using a Stacking variant methodology. We performed an in depth comparison with other well-known Semi-Supervised classification methods on standard benchmark datasets and we finally reached to the point that the presented technique had better accuracy in most cases.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:pyW8ca7W8N0C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Educational Software Evaluation: A Study From an Educational Data Mining Perspective",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/34898175/6314ijma01.pdf",
            "Abstract": "In this paper the complicated task of educational software evaluation is revisited and examined from a different point of view. By the means of Educational Data Mining (EDM) techniques, in the present study 177 of the most common evaluation standards that have been proposed by various researchers are examined and evaluated with regards to the degree they affect the effectiveness of educational software. More specifically, via the employment of prediction, feature selection and relationship mining techniques we investigate for the underlying rationale hidden within the data collected from experiments conducted at the Department of Education of the University of Patras with regards to the software evaluation task and the results of this study are presented and discussed in a quantitative and qualitative way.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:vV6vV6tmYwMC",
            "Publisher": "AIRCC Publishing Corporation"
        },
        {
            "Title": "Digital Scholarship in the Humanities: Journal of the Alliance of Digital Humanities Organizations",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=7126101919819305563&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:KxtntwgDAa4C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Combining outlier detection with random walker for automatic brain tumor segmentation",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33412-2_3",
            "Abstract": "The diagnosis of brain neoplasms has been facilitated by the emerging of high-quality imaging techniques, such as Magnetic Resonance Imaging (MRI), while the combination of several sequences from conventional and advanced protocols has increased the diagnostic information. Treatment planning and therapy follow-up require the detection of neoplastic and edematous tissue boundaries, a very time consuming task when manually performed by medical experts based on the 3D MRI data. Automating the detection process is challenging, due to the high diversity in appearance of neoplastic tissue among different patients and, in many cases, similarity between neoplastic and normal tissue. In this paper, we propose an automatic brain tumor segmentation method based on a multilabel multiparametric random walks approach initialized by an outlier detection scheme. Segmentation assessment is …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Human-Computer Interaction using Natural Language. An Application in the Medical Treatment Domain",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.77.3897&rep=rep1&type=pdf",
            "Abstract": "The effective information retrieval, along with the comprehensive dialogue systems response, happen to be of great importance in medical applications domain, where the precision of information is critical and users are usually inexperienced and unwilling to participate in long, tiring interactions. The use of natural language is a promising idea because it is direct, natural for the humans and does not need any special training. Our work presents a natural language interaction system, developed by Hellenic partners and utilized with success in the medical domain. Experimental results and comparisons with other methods tabulate improvement in time response as well as in the correctness of the answer. The evaluation of the model was done using a group of 20 persons of different specialties (medical stuff-doctors-computer users-students) which were already trained about how to use the system and each one supplied 25 different questions.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of lexical ambiguity in Modern Greek using a computational lexicon",
            "Publication year": 2015,
            "Publication url": "https://academic.oup.com/dsh/article-abstract/30/1/20/351482",
            "Abstract": "Ambiguity is one of the most significant problems in Natural Language Processing. This difficulty may not be apparent to native speakers because of their natural ability at resolving it using contextual information and common sense knowledge. In contrast, current computer applications are still lacking the ability to disambiguate complex texts efficiently. The most common type of ambiguity is lexical ambiguity, and this is noticed even in highly inflectional languages such as Greek. In the present article, all the patterns of predictable lexical ambiguity in Modern Greek Language are registered, verified and quantified as occurred in the Neurolingo computational lexicon, after a study of morpho-syntactic characteristics that differentiate the ambiguous words.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Influenza A immunomics and public health omics: the dynamic pathway interplay in host response to H1N1 infection",
            "Publication year": 2014,
            "Publication url": "https://www.liebertpub.com/doi/abs/10.1089/omi.2013.0062",
            "Abstract": "Towards unraveling the influenza A (H1N1) immunome, this work aims at constructing the murine host response pathway interactome. To accomplish that, an ensemble of dynamic and time-varying Gene Regulatory Network Inference methodologies was recruited to set a confident interactome based on mouse time series transcriptome data (day 1–day 60). The proposed H1N1 interactome demonstrated significant transformations among activated and suppressed pathways in time. Enhanced interplay was observed at day 1, while the maximal network complexity was reached at day 8 (correlated with viral clearance and iBALT tissue formation) and one interaction was present at day 40. Next, we searched for common interactivity features between the murine-adapted PR8 strain and other influenza A subtypes/strains. For this, two other interactomes, describing the murine host response against H5N1 and …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Mary Ann Liebert, Inc."
        },
        {
            "Title": "Natural Spoken Dialogue Interaction: Technology, Tools, Resources and Applications",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/31804686/Ganchev_AIGdemos.pdf",
            "Abstract": "The Artificial Intelligence Group (AIG) is one of the seven research groups of the Wire Communications Laboratory (WCL–established in 1967) in the Department of Electrical and Computer Engineering, University of Patras, Greece. The unit has more than 30 years of continuous research activity in the areas of Speech & Language Technology and Artificial Intelligence. During this period, AIG has published over 300 scientific publications, contributed over 20 PhD dissertations, developed various resources (databases, research tools, technology-prove prototypes, etc) and participated (or is currently participating) as a partner or coordinator in more than 30 RTD projects. AIG has been developing speech, language and dialogue interaction systems for telecommunication and industrial applications, but also a significant part of its research focuses on theoretical and mathematical models of artificial intelligence methods and algorithms as well.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Semi-supervised regressor based on model trees",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201033",
            "Abstract": "Plenty of Machine Learning (ML) approaches have been applied all these years over a great variety of tasks, leading to several kind of algorithms that face efficiently specific problems. However, their inability to generalize well enough over data that stem from more generic sources or other specialized occasions that are not connected with their initial field of interest, still remains an open issue. Thus, the interest of data scientists has been shifted towards ensemble learners, which try to leverage the predictive behavior of the contained algorithms, offering improved learning performance and robustness over wide spectrum of posed implications. Thus, an ensemble semi-supervised regressor that operates under the presence of a few examples is presented, covering the applications under which shortage of labeled data is usually met, offering at the same time well enough predictive behavior without spending much …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bayesian Retrieval Using a Similarity-Based Lemmatizer",
            "Publication year": 2012,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213012500248",
            "Abstract": "The present paper describes a Bayesian network approach to Information Retrieval (IR) from Web documents. The network structure provides an intuitive representation of uncertainty relationships and the embedded conditional probability table is used by inference algorithms in an attempt to identify documents that are relevant to the user's needs, expressed in the form of Boolean queries. Our research has been directed in constructing a probabilistic IR framework that focus on assisting users to perform Ad-hoc retrieval of documents from the various domains such as economics, news, sports, etc. Furthermore, users can integrate feedback regarding the relevance of the retrieved documents in an attempt to improve performance on upcoming requests. Towards these goals, we have expanded the traditional Bayesian network IR system and tested it on several Greek web corpora on different application domains. We …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:HDshCWvjkbEC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "An active learning ensemble method for regression tasks",
            "Publication year": 2020,
            "Publication url": "https://content.iospress.com/articles/intelligent-data-analysis/ida194608",
            "Abstract": "Active learning is a typical approach for learning from both labeled and unlabeled examples aiming to build efficient and accurate predictive models at minimum expense under an expert’s guidance. Since there is a lack of labeled data in many scientific fields whilst, at the same time, the labeling cost of unlabeled data is typically high in terms of time and expenditure, active learning has grown rapidly over recent years with great success. This is reflected in various studies providing insights and analyzing several active learning methods, especially in the case of classification tasks, whereas, there is only a limited number of studies concerning the implementation of active learning methods for regression ones. Within this context, the present paper sets out to put forward a pool-based active learning regression algorithm employing the query by committee strategy to evaluate the informativeness of unlabeled examples …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:08ZZubdj9fEC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A straightforward approach to morphological analysis and synthesis",
            "Publication year": 2001,
            "Publication url": "https://arxiv.org/abs/cs/0112010",
            "Abstract": "In this paper we present a lexicon-based approach to the problem of morphological processing. Full-form words, lemmas and grammatical tags are interconnected in a DAWG. Thus, the process of analysis/synthesis is reduced to a search in the graph, which is very fast and can be performed even if several pieces of information are missing from the input. The contents of the DAWG are updated using an on-line incremental process. The proposed approach is language independent and it does not utilize any morphophonetic rules or any other special linguistic information.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Review of: Automata theory with modern applications (by James A. Anderson)",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:UebtZRa9Y70C",
            "Publisher": "ACM"
        },
        {
            "Title": "Leveraging dynamic user profiles for the assistance of anxiety disorders' treatment using inferential rules.",
            "Publication year": 2009,
            "Publication url": "https://europepmc.org/article/med/19963683",
            "Abstract": "While anxiety disorders exhibit an impressive spread especially in western societies, context-awareness seems a promising technology to provide assistance to physicians in psychotherapy sessions. In the present paper an approach addressing the assistance of the anxiety disorders' treatment is proposed. The suggested method employs the a priori association rule mining algorithm in order to achieve dynamic update of patient profiles according to generated rules describing the underlying relations between patients' main context conditions and their stress level. This method was evaluated by therapists specializing in the mental health domain and the feedback received was very encouraging with respect to the assistance dynamic patient profiles offer, during CBT sessions.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Speech recognition combining MFCCs and image features",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-43958-7_79",
            "Abstract": "Automatic speech recognition (ASR) task constitutes a well-known issue among fields like Natural Language Processing (NLP), Digital Signal Processing (DSP) and Machine Learning (ML). In this work, a robust supervised classification model is presented (MFCCs + autocor + SVM) for feature extraction of solo speech signals.  Mel Frequency Cepstral Coefficients (MFCCs) are exploited combined with Content Based Image Retrieval (CBIR) features extracted from spectrogram produced by each frame of the speech signal. Improvement of classification accuracy using such extended feature vectors is examined against using only MFCCs with several classifiers for three scenarios of different number of speakers. ",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Module-Based Cross-Tissue Pathway Identification in Aging",
            "Publication year": 2013,
            "Publication url": "https://www.jstage.jst.go.jp/article/jsmbe/51/Supplement/51_R-170/_article/-char/ja/",
            "Abstract": "In this work, we present a modular large scale network-based methodology that captures the changes in age-related mechanisms. Our proposed method, combined with integrated diverse-omics data, identified the cross-tissue temporally conserved pathways, that may serve as potential biomarkers among distinct aging states.Recently many Systems Biology approaches were employed to investigate the different molecular aspects of aging [1]. In this study, we provide pathway biomarkers that elucidate the changes between early and late phase of aging. Our approach can detect module-based biomarkers from composite biological networks of gene expression datasets (GEDs) and Protein-Protein Interaction (PPI) networks. We used two GEDs from human brain and muscle tissues, with NCBI's GEO accession numbers GSE1572 and GSE8479. In order to identify highly differentiated pathways, we isolated the 6\" youngest\" and the 6\" oldest\" samples. We constructed a reliable PPI network with 59403 interactions among 11266 proteins, based on OPHID, MINT and BioGRID databases. A core component of our method is DMSP algorithm [2], which extracts a module from a weighted graph based on an initial\" seed\" protein. Initially, we constructed small-sized modules (ranging from 2-20 members) in both states based on the same seeds. The weighted graph was created from the PPI network after assigning as weight on an edge the Pearson Correlation Coefficient (PCC) between the expression profiles of the two corresponding genes of the GED. As seed proteins, we considered the hub nodes (above 50 connections) of the PPI network and after …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:TFP_iSt0sucC",
            "Publisher": "Osaka, Japan"
        },
        {
            "Title": "An empirical study of active learning for text classification",
            "Publication year": 2012,
            "Publication url": "http://nimbusvault.net/publications/koala/assr/589.html",
            "Abstract": "Text categorization or better text classification has recently attracted the interest of several researchers, since the amount of generated documents on daily basis is vast and on many situations their manipulation is infeasible without using any appropriate Machine Learning tools. Several variants of real-life applications belong to this field and much research has been made the last two decades over them. However, default learning methods do not exploit uncategorized files which are in abundance on several fields. Thus, new learning schemes are exploited for boosting learning performance of supervised algorithms. Active Learning is such a representative example, incorporating both labeled and unlabeled data and integrating human's expertise knowledge with the obtained predictions by supervised learners. In this work, four learners are compared under two different Active Learning approaches against random sampling, examining the efficacy of annotating unlabeled documents that verify specific queries. Classification error has been recorded for two different public provided datasets highlighting the improved learning behavior of using specific queries instead of random sampling approach, under the existence of a really small portion of the initial data.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Domain knowledge acquisition and plan recognition by probabilistic reasoning",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213004001570",
            "Abstract": "This paper introduces a statistical framework for extracting medical domain knowledge from heterogeneous corpora. The acquired information is incorporated into a natural language understanding agent and applied to DIKTIS, an existing web-based educational dialogue system for the chemotherapy of nosocomial and community acquired pneumonia, aiming at providing a more intelligent natural language interaction. Unlike the majority of existing dialogue understanding engines, the presented system automatically encodes semantic representation of a user's query using Bayesian networks. The structure of the networks is determined from annotated dialogue corpora using the Bayesian scoring method, thus eliminating the tedious and costly process of manually coding domain knowledge. The conditional probability distributions are estimated during a training phase using data obtained from the same set of …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:Y0pCki6q_DkC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Construction of a Modern Greek grammar checker through Mnemosyne formalism",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23132-7_21",
            "Abstract": "The aim of this paper is to present a useful and friendly electronic tool (grammar checker) which will carry out the morphological and syntactic analysis of sentences, phrases and words in order to correct syntactic, grammatical and stylistic errors. We also present the formalism used (the Mnemosyne’s Kanon) and also the particularities of the Greek language that hinder the computational processing. Given that the major problem of modern Greek is the lexical ambiguity we designed the Greek tagger grounded on linguistic criteria for those cases where the lexical ambiguity impede the imprint of the errors in Greek language. The texts that were given for correction to the grammar checker were also corrected by a person. In a very large percentage the grammar checker approximates in accuracy the human-corrector.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Multi-objective Optimization of C4. 5 Decision Tree for Predicting Student Academic Performance",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8900771/",
            "Abstract": "Applying data mining methods in the educational field has gained a lot of attention among scientists over the last years. Educational Data Mining forms an ever-developing research area aiming to unveil the hidden knowledge in educational data and improve students' learning behavior and outcomes. To this end, a plethora of data mining methods have already been implemented in various educational settings solving a variety of tasks, among which the prediction of students' academic performance as well. Decision trees have proven to be a quite effective method for both classification and regression problems showing a number of considerable advantages, such as efficiency, simplicity, flexibility and interpretability. Moreover, configuration of parameter values has often a material impact on building optimal trees in terms of accuracy and/or size. In this context, the main objective of our study is to yield a highly …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementation of Iterative Recursion for the Data Retrieval from Directed Acyclic Word Graphs",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=959334925628428593&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present an alternative idea for the data retrieval from directed acyclic word graphs (DAWG). The proposed algorithm is adequate for both the deterministic (DFA) and the nondeterministic (NFA) finite state automata and can be used instead of other traditional data extraction methods. The suggested algorithm is capable of retrieving the data contained in such data structures in a quite simple and fast way and can be used in several applications which are treating of finite state automata, natural language processing and data mining. Such applications are the following: lexicon building, morphological processing, speech recognition, DNA analysis etc. This paper also provides experimental verification of the correctness of the algorithm and several experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:j3f4tGmQtD8C",
            "Publisher": "CRC Press"
        },
        {
            "Title": "A low cost approach for brain tumor segmentation based on intensity modeling and 3D Random Walker",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1746809415001068",
            "Abstract": "Magnetic resonance imaging (MRI) is the primary imaging technique for evaluation of the brain tumor progression before and after radiotherapy or surgery. The purpose of the current study is to exploit conventional MR modalities in order to identify and segment brain images with neoplasms.Four conventional MR sequences, namely, T1-weighted, gadolinium-enhanced T1-weighted, T2-weighted and fluid attenuation inversion recovery, are combined with machine learning techniques to extract global and local information of brain tissues and model the healthy and neoplastic imaging profiles. Healthy tissue clustering, outlier detection and geometric and spatial constraints are applied to perform a first segmentation which is further improved by a modified multiparametric Random Walker segmentation method. The proposed framework is applied on clinical data from 57 brain tumor patients …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Design and construction of the Greek grammar checker",
            "Publication year": 2017,
            "Publication url": "https://academic.oup.com/dsh/article-abstract/32/3/554/2669769",
            "Abstract": "The aim of this paper is to present both the main parts of the designing and the implementation of a useful and user-friendly electronic tool, the Greek grammar checker. This tool carries out the function of analyzing morphologically and syntactically sentences, phrases, and words in order to correct syntactic, grammatical, and stylistic errors (, ). Our premise in order to deal with all these issues is the settings of Grammar (adaptation of Little Modern Grammar of Manolis Triantafyllidis), which is the formal grammatical codification of Modern Greek, since 1976 . This paper also presents the formalism used (the Mnemosyne), a formalism that handles with the particularities of the Greek language that hinder the computational processing. This formalism has already been used to identify multi-word terms and to phrase grammars, aiming to automatically extract information. We tested the Greek grammar checker by giving …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Design and implementation of an electronic lexicon for Modern Greek",
            "Publication year": 2012,
            "Publication url": "https://academic.oup.com/dsh/article-abstract/27/2/155/929718",
            "Abstract": "Natural language text analysis presupposes the encoding of morphological phenomena. In this article, we present some particularities of Modern Greek and the way these are encoded in the presented electronic lexicon. The project plan of its development combined both simple planning algorithms and more elaborate ones for the generation and recognition processes. The resulted lexicon exhibits fast access to its contents and easy content management. It is re-usable and modular enough to support existing NLP applications.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:qUcmZB5y_30C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "The WATCHER project: Building an agent for automatic extraction of language resources from the Internet",
            "Publication year": 2003,
            "Publication url": "https://academic.oup.com/dsh/article-abstract/18/4/449/957783",
            "Abstract": "The WATCHER project aims to automate the extraction of language resources from the Internet via an intelligent agent called the ‘WATCHER’. This agent (in its final form) will be able to actively search and collect subject-specific and language-specific texts and build corpora and lexicons from them. Although the resources will still have to be checked for validity after their collection, the proposed method requires the minimum of human interaction. Apart from its ability to collect these resources automatically, the WATCHER will also be able to track the evolution of a target language over time by collecting resources annually and presenting their analysis in annual reports. The WATCHER is still under development. This paper presents an overview of its architecture and functionality, and reports recent progress.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:roLk4NBRz8UC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Machine learning in human language technology",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44673-7_14",
            "Abstract": "The undoubted usefulness of present-day information systems is only moderated by the fact that people have to invest substantial effort and training time in order to learn how to use them. Even modern applications with Graphical-User Interfaces (which are considered user-friendly), built-in wizards and on-line context-sensitive help, require a considerable self-training period, thus discouraging most people from fully exploiting their capabilities. In the years to come we expect that information systems will gradually become more and more complex and since the training period is usually proportional to the system complexity, with the usual Human Computer Interaction methods less and less people will have the time to learn how to use a new piece of software.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A semisupervised cascade classification algorithm",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1155/2016/5919717",
            "Abstract": "Classification is one of the most important tasks of data mining techniques, which have been adopted by several modern applications. The shortage of enough labeled data in the majority of these applications has shifted the interest towards using semisupervised methods. Under such schemes, the use of collected unlabeled data combined with a clearly smaller set of labeled examples leads to similar or even better classification accuracy against supervised algorithms, which use labeled examples exclusively during the training phase. A novel approach for increasing semisupervised classification using Cascade Classifier technique is presented in this paper. The main characteristic of Cascade Classifier strategy is the use of a base classifier for increasing the feature space by adding either the predicted class or the probability class distribution of the initial data. The classifier of the second level is supplied with the …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Incremental construction of compact acyclic NFAs",
            "Publication year": 2001,
            "Publication url": "https://arxiv.org/abs/cs/0201002",
            "Abstract": "This paper presents and analyzes an incremental algorithm for the construction of Acyclic Non-deterministic Finite-state Automata (NFA). Automata of this type are quite useful in computational linguistics, especially for storing lexicons. The proposed algorithm produces compact NFAs, i.e. NFAs that do not contain equivalent states. Unlike Deterministic Finite-state Automata (DFA), this property is not sufficient to ensure minimality, but still the resulting NFAs are considerably smaller than the minimal DFAs for the same languages.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Association for Computational Linguistics"
        },
        {
            "Title": "Work in progress: An introduction to computing course using a Python-based experiential approach",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7943071/",
            "Abstract": "This paper discusses our experience with designing and implementing a new Introduction to Computing course that aims both to introduce students to programming and at the same time to cover key concepts of Computer Science using a hands-on experiential approach. The re-design of the course has put more emphasis on using Python as a tool for studying computer science. It was found that the students enjoyed this approach and responded positively to the challenge. Examples are given on how concepts of binary arithmetic, computer architecture, operating systems, networking have been introduced through Python coding examples and exercises, while the project work introduced the students to the challenges of software development.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A clustering based method accelerating gene regulatory network reconstruction",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050914003603",
            "Abstract": "One important direction of Systems Biology is to infer Gene Regulatory Networks and many methods have been developed recently, but they cannot be applied effectively in full scale data. In this work we propose a framework based on clustering to handle the large dimensionality of the data, aiming to improve accuracy of inferred network while reducing time complexity. We explored the efficiency of this framework employing the newly proposed metric Maximal Information Coefficient (MIC), which showed superior performance in comparison to other well established methods. Utilizing both benchmark and real life datasets, we showed that our method is able to deliver accurate results in fractions of time required by other state of the art methods. Our method provides as output interactions among groups of highly correlated genes, which in an application on an aging experiment were able to reveal aging related …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:BqipwSGYUEgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optimal selection of electrocorticographic sensors for voice activity detection",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7064274/",
            "Abstract": "An effective speech brain machine interface requires selecting the best cortical recording sites and signal features for decoding speech production, but also minimal clinical risk for the patient. Motivated by this need to reduce patient risk, the purpose of this study is to detect voice activity (speech onset and offset) automatically from spatial-spectral features of electrocorticographic signals using the optimal number of sensors (minimal invasiveness). ECoG signals were recorded while a subject performed two different syllable repetition tasks. We found that the optimal frequency resolution for detecting voice activity is 8 Hz using 31 sensors out of 55, achieving 98.2% accuracy by employing support vector machines (SVM) as a classifier, and that acceptable accuracy of 96.7% was achieved using 15 sensors, which would permit a less invasive surgery for the placement of electrodes. The proposed voice activity detector …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Supervised method for construction of microRNA-mRNA networks: Application in cardiac tissue aging dataset",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6943593/",
            "Abstract": "MicroRNAs play an important role in regulation of gene expression, but still detection of their targets remains a challenge. In this work we present a supervised regulatory network inference method with aim to identify potential target genes (mRNAs) of microRNAs. Briefly, the proposed method exploiting mRNA and microRNA expression trains Random Forests on known interactions and subsequently it is able to predict novel ones. In parallel, we incorporate different available data sources, such as Gene Ontology and ProteinProtein Interactions, to deliver biologically consistent results. Application in both benchmark data and an experiment studying aging showed robust performance.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Self-train logitboost for semi-supervised learning",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23983-5_14",
            "Abstract": "Semi-supervised classification methods are based on the use of unlabeled data in combination with a smaller set of labeled examples, in order to increase the classification rate compared with the supervised methods, in which the total training is executed only by the usage of labeled data. In this work, a self-train Logitboost algorithm is presented. The self-train process improves the results by using the accurate class probabilities for which the Logitboost regression tree model is more confident at the unlabeled instances. We performed a comparison with other well-known semi-supervised classification methods on standard benchmark datasets and the presented technique had better accuracy in most cases. ",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Review of: How to Think about Algorithms (by Jeff Edmonds)",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:MXK_kJrjxJIC",
            "Publisher": "ACM"
        },
        {
            "Title": "Dynamic Gene Network Reconstruction from gene expression data in mice after Influenza A (H1N1) infection",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1186/2043-9113-1-27",
            "Abstract": "The immune response to viral infection is a temporal process, represented by a dynamic and complex network of gene and protein interactions. Here, we present a reverse engineering strategy aimed at capturing the temporal evolution of the underlying Gene Regulatory Networks (GRN). The proposed approach will be an enabling step towards comprehending the dynamic behavior of gene regulation circuitry and mapping the network structure transitions in response to pathogen stimuli. We applied the Time Varying Dynamic Bayesian Network (TV-DBN) method for reconstructing the gene regulatory interactions based on time series gene expression data for the mouse C57BL/6J inbred strain after infection with influenza A H1N1 (PR8) virus. Initially, 3500 differentially expressed genes were clustered with the use of k-means algorithm. Next, the successive in time GRNs were built over the expression profiles of …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:4TOpqqG69KYC",
            "Publisher": "BioMed Central Ltd"
        },
        {
            "Title": "Acronym identification in Greek legal texts",
            "Publication year": 2015,
            "Publication url": "https://academic.oup.com/dsh/article-abstract/30/3/440/346245",
            "Abstract": "The use of acronyms is common in several document categories. With acronyms we avoid the repetitive use of long cumbersome titles and simplify some very wordy and verbose texts. In formal types of texts (eg in academic writing), two approaches are used to properly define acronyms within a text. For longer stand-alone works, like a textbook or a thesis, a list of definitions and acronyms used throughout the text is sometimes included near the beginning of the work (eg after the table of contents). In shorter texts [eg request for comments (RFC), medical, legislation texts], a more direct method of defining acronyms is adopted: acronyms are usually defined at the first point of use in the text with a parenthetical reference after the full title.Unfortunately, not all writers comply with the aforementioned approaches. It is very common for a writer to use unidentified acronyms presupposing that all readers share a common …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "A Quantum Probability Splitter and its Application to Qubit Preparation",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s11128-012-0402-y",
            "Abstract": "This paper presents a quantum probability splitter, i.e. a quantum circuit that modifies the probability amplitudes of a qubit so that the probability on the selected basis state is halved. It also presents a potential application of this circuit related to qubit preparation: it shows how a qubit is prepared to a superposition of any valid pair of basis states probabilities, by repeated application of the quantum probability splitter.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Using the levenshtein edit distance for automatic lemmatization: A case study for modern greek and english",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410417/",
            "Abstract": "In the present work we have implemented the Edit Distance (also known as Levenshtein Distance) on a dictionary-based algorithm in order to achieve the automatic induction of the normalized form (lemma) of regular and mildly irregular words with no direct supervision. The algorithm combines two alignment models based on the string similarity and the most frequent inflexional suffixes. In our experiments, we have also examined the language-independency (i.e. independency of the specific grammar and inflexional rules of the language) of the presented algorithm by evaluating its performance on the Modern Greek and English languages. The results were very promising as we achieved more than 95 % of accuracy for the Greek language and more than 96 % for the English language. This algorithm may be useful to various text mining and linguistic applications such as spell-checkers, electronic dictionaries …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multi-scheme semi-supervised regression approach",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865519302090",
            "Abstract": "The production of vast amounts of data has increased the necessity of applying Machine Learning (ML) and Pattern Recognition (PR) methods that could perform accurate predictive performance without demanding much human effort for collecting and preparing the necessary data. Keeping in mind that annotating instances is one of the most time-consuming procedures during the learning phase of supervised approaches, the role of Semi-supervised Learning (SSL) schemes, which exploit both labeled and unlabeled data, is totally upgraded considering especially the real-word scenarios. The flexibility that is offered through such schemes about combining various learners for mining useful information through unlabeled instances allows the production of several variants of these schemes. Thus, the construction of generic approaches that could achieve robust learning behavior over problems that stem from …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:738O_yMBCRsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Joint spatial-spectral feature space clustering for speech activity detection from ECoG signals",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6705641/",
            "Abstract": "Brain-machine interfaces for speech restoration have been extensively studied for more than two decades. The success of such a system will depend in part on selecting the best brain recording sites and signal features corresponding to speech production. The purpose of this study was to detect speech activity automatically from electrocorticographic signals based on joint spatial-frequency clustering of the ECoG feature space. For this study, the ECoG signals were recorded while a subject performed two different syllable repetition tasks. We found that the optimal frequency resolution to detect speech activity from ECoG signals was 8 Hz, achieving 98.8% accuracy by employing support vector machines as a classifier. We also defined the cortical areas that held the most information about the discrimination of speech and nonspeech time intervals. Additionally, the results shed light on the distinct cortical areas …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multi-scale modeling of gene regulatory networks via integration of temporal and topological biological data",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6346162/",
            "Abstract": "Regulome is the dynamic network representation of the regulatory interplay among genes, proteins and other cellular components that control cellular processes. Reconstruction of gene regulatory networks (GRN) delineates one of the main objectives of Systems Biology towards understanding the organization of regulome. Significant progress has been reported the last years regarding GRN reconstruction methods, but the majority of them either consider information originating solely from gene expression data or/and are applied on a small fraction of the experimental dataset. In this paper, we will describe an integrative method, utilizing both temporal information arriving from time-series gene expression profiles, as well as topological properties of protein networks. The proposed methodology detects relations among either groups of genes or specific genes depending on the level of abstraction or resolution …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identifying disease network perturbations through regression on gene expression and pathway topology analysis",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7592088/",
            "Abstract": "In Systems Biology, network-based approaches have been extensively used to effectively study complex diseases. An important challenge is the detection of network perturbations which disrupt regular biological functions as a result of a disease. In this regard, we introduce a network based pathway analysis method which isolates casual interactions with significant regulatory roles within diseased-perturbed pathways. Specifically, we use gene expression data with Random Forest regression models to assess the interactivity strengths of genes within disease-perturbed networks, using KEGG pathway maps as a source of prior-knowledge pertaining to pathway topology. We deliver as output a network with imprinted perturbations corresponding to the biological phenomena arising in a disease-oriented experiment. The efficacy of our approach is demonstrated on a serous papillary ovarian cancer experiment and …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handwritten word recognition based on structural characteristics and lexical support",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1227727/",
            "Abstract": "In this paper a handwritten recognition algorithm based on structural characteristics, histograms and profiles, is presented. The well-known horizontal and vertical histograms are used, in combination with the newly introduced radial histogram, out-in radial and in-out radial profiles for representing 32 /spl times/ 32 matrices of characters, as 280-dimension vectors. The recognition process has been supported by a lexical component based on dynamic acyclic FSAs (Finite-State-Automata).",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Functional connectivity analysis of mental fatigue reveals different network topological alterations between driving and vigilance tasks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8254390/",
            "Abstract": "Despite the apparent importance of mental fatigue detection, a reliable application is hindered due to the incomprehensive understanding of the neural mechanisms of mental fatigue. In this paper, we investigated the topological alterations of functional brain networks in the theta band (4 - 7 Hz) of electroencephalography (EEG) data from 40 male subjects undergoing two distinct fatigue-inducing tasks: a low-intensity one-hour simulated driving and a high-demanding half-hour sustained attention task [psychomotor vigilance task (PVT)]. Behaviorally, subjects demonstrated a robust mental fatigue effect, as reflected by significantly declined performances in cognitive tasks prior and post these two tasks. Furthermore, characteristic path length presented a positive correlation with task duration, which led to a significant increase between the first and the last five minutes of both tasks, indicating a fatigue-related …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Revealing the dynamic modularity of composite biological networks in breast cancer treatment",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6347223/",
            "Abstract": "A major challenge in modern breast cancer treatment is to unravel the effect of drug activity through the systematic rewiring of cellular networks over time. Here, we illustrate the efficacy and discriminative power of our integrative approach in detecting modules that represent the regulatory effect of tamoxifen, widely used in anti-estrogen treatment, on transcriptome and proteome and serve as dynamic sub-network signatures. Initially, composite networks, after integrating protein interaction and time series gene expression data between two conditions (estradiol and estradiol plus tamoxifen), were constructed. Further, the Detect Module from Seed Protein (DMSP) algorithm elaborated on the graphs and constructed modules, with specific `seed' proteins used as starting points. Our findings provide evidence about the way drugs perturb and rewire the high-order organization of interactome in time.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A revised phonetic alphabet for Modern Greek",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=3325367374476312394&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Natural language in dialogue systems. A case study on a medical application",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.75.4549&rep=rep1&type=pdf",
            "Abstract": "The effective acquisition of information, along with the comprehensive dialogue system’s response, happen to be of great importance in the medical applications domain, where accuracy of information is essential and users are usually inexperienced and unwilling to participate in long, exhausting interactions. The use of natural language is a promising idea since it is direct, natural for the humans and does not require any special training. Our effort presents a natural language interaction system, developed by Hellenic partners and utilized with success in the medical domain of pneumonia treatment. Experimental results and comparisons with other approaches tabulate improvement in time response as well as in the correctness of the answers. The evaluation of the method was made using a group of 20 persons of different specialties (medical stuff/doctors/computer users/students) which were already informed about how to use the system and each one supplied 25 different questions.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A stochastic greek-to-greeklish transcriber modeled by real user data",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_44",
            "Abstract": "Greek to Greeklish transcription does not appear to be a difficult task since it can be achieved by directly mapping each Greek character to a corresponding symbol of the Latin alphabet. Nevertheless, such transliteration systems do not simulate efficiently the human way of Greeklish writing, since Greeklish users do not follow a standardized way of transliteration. In this paper a stochastic Greek to Greeklish transcriber modeled by real user data is presented. The proposed transcriber employs knowledge derived from the analytical processing of 9,288 Greek-Greeklish word pairs annotated by real users and achieves the automatic transcription of any Greek word into a valid Greeklish form in a stochastic way (i.e. each Greek symbolset corresponds to a variety of Latin symbols according to the processed data), simulating thus human-like behavior. This transcriber could be used as a real-time Greek-to …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Real-time voice activity detection for ECoG-based speech brain machine interfaces",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6900790/",
            "Abstract": "In this article, we investigated the performance of a real-time voice activity detection module exploiting different time-frequency methods for extracting signal features in a subject with implanted electrocorticographic (ECoG) electrodes. We used ECoG signals recorded while the subject performed a syllable repetition task. The voice activity detection module used, as input, ECoG data streams, on which it performed feature extraction and classification. With this approach we were able to detect voice activity (speech onset and offset) from ECoG signals with high accuracy. The results demonstrate that different time-frequency representations carried complementary information about voice activity, with the S-transform achieving 92% accuracy using the 86 best features and support vector machines as the classifier. The proposed real-time voice activity detector may be used as a part of an automated natural speech BMI …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast very large vocabulary recognition based on compact DAWG-structured language models",
            "Publication year": 2000,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/icslp_2000/i00_2987.pdf",
            "Abstract": "In this paper we present a method for building compact lattices for very large vocabularies, which has been applied to surname recognition in an Interactive telephoneabased Directory Assistance Services system 1. The method involves the construction of a nonadeterministic DAWG, which is eventually transformed into a phoneme lattice in Entropic, s HTK Application Programming Interface (HAPI) format. Incremental construction functions are used for the creation and update of the DAWG, whereas an algorithm for converting the DAWG into the HAPI format is presented. Furthermore, trees, graphs and fullaforms (whole words with no merging of nodes) are compared in a straightforward way under the same conditions, using the same decoder (HAPI MVX) and the same vocabularies. Experimental results showed that as we go from fullaform lexicons to trees and then to graphs the size of the recognition network is …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network-based modular markers of aging across different tissues",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-00846-2_456",
            "Abstract": "Aging is a highly complex biological process and a risk factor for many diseases. Motivated by the high availability of diverse high-throughput data in the mouse model organism, we provide a systemic view of the age-related mechanisms. In particular, we present a robust network-based integrative approach that provides, based on protein interaction and microarray data, reliable modules that alter significantly in terms of expression during aging. Our modular meta-analysis provides novel information about the involvement of several established as well as recently reported longevity-associated pathways across different tissues.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:maZDTaKrznsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Semi-supervised forecasting of fraudulent financial statements",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003740",
            "Abstract": "Prediction of potential fraudulent activities may prevent both the stakeholders and the appropriate regulatory authorities of national or international level from being deceived. The objective difficulties on collecting adequate data that are obsessed by completeness affects the reliability of the most supervised Machine Learning methods. This work examines the effectiveness of forecasting fraudulent financial statements using semi-supervised classification techniques (SSC) that require just a few labeled examples for achieving robust learning behaviors mining useful data patterns from a larger pool of unlabeled examples. Based on data extracted from Greek firms, a number of comparisons between supervised and semi-supervised algorithms has been conducted. According to the produced results, the later algorithms are favored being examined over several scenarios of different Labeled Ratio (R) values.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Speaker identification using semi-supervised learning",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23132-7_48",
            "Abstract": "Semi-supervised classification methods use available unlabeled data, along with a small set of labeled examples, to increase the classification accuracy in comparison with training a supervised method using only the labeled data. In this work, a new semi-supervised method for speaker identification is presented. We present a comparison with other well-known semi-supervised and supervised classification methods on benchmark datasets and verify that the presented technique exhibits better accuracy in most cases.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Domain knowledge acquisition and plan recognition by probabilistic reasoning",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45226-3_39",
            "Abstract": "In this paper, a probabilistic framework for acquiring domain knowledge from heterogeneous corpora is introduced. The acquired information is used for intelligent human-computer interaction through the web. The application selected for the framework experimentation was education on issues of chemotherapy of nosocomial and community acquired pneumonia. Contrasting to existing educational dialogue engines which use handcrafted knowledge of the application domain, our approach utilizes automatic encoding of the semantic model of the application, based on learning Bayesian networks from past user questions. The structure of the networks as well as the conditional probability distributions are computed automatically from dialogue corpora, thus eliminating the tedious process of manual insertion of domain knowledge. Furthermore, we attempt to overcome the significant issue of limited …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Age-related subpathway detection through meta-analysis of multiple gene expression datasets",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7251931/",
            "Abstract": "A novel perspective of systems biology is the incorporation of pathway structure data along with transcriptomics studies. In parallel, the plethora of high-throughput experimental studies necessitates employment of meta-analysis approaches in order to obtain more biologically consistent results. Towards this orientation we developed a subpathway-based meta-analysis method that integrates human pathway maps along with multiple human mRNA expression experiments. Our method succeeded to identify known age-related subpathways as differentially expressed exploiting several independent muscle-specific aging studies. Finally, our method is applicable in several complex biological problems where massive amount of time series expression data is available.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Locally application of naive Bayes for self-training",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s12530-016-9159-3.pdf",
            "Abstract": "Semi-supervised algorithms are well-known for their ability to combine both supervised and unsupervised strategies for optimizing their learning ability under the assumption that only a few examples together with their full feature set are given. In such cases, the use of weak learners as base classifiers is usually preferred, since the iterative behavior of semi-supervised schemes require the building of new temporal models during each new iteration. Locally weighted naïve Bayes classifier is such a classifier that encompasses the power of NB and k-NN algorithms. In this work, we have implemented a self-labeled weighted variant of local learner which uses NB as the base classifier of self-training scheme. We performed an in depth comparison with other well-known semi-supervised classification methods on standard benchmark datasets and we reached to the conclusion that the presented technique had …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Applying similarity measures for automatic lemmatization: a case-study for modern Greek and English",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S021821300800428X",
            "Abstract": "This paper addresses the problem of automatic induction of the normalized form (lemma) of regular and mildly irregular words with no direct supervision using language-independent algorithms. More specifically, two string distance metric models (i.e. the Levenshtein Edit Distance algorithm and the Dice Coefficient similarity measure) were employed in order to deal with the automatic word lemmatization task by combining two alignment models based on the string similarity and the most frequent inflectional suffixes. The performance of the proposed model has been evaluated quantitatively and qualitatively. Experiments were performed for the Modern Greek and English languages and the results, which are set within the state-of-the-art, have showed that the proposed model is robust (for a variety of languages) and computationally efficient. The proposed model may be useful as a pre-processing tool to various …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time-varying parametric modeling of ECoG for syllable decoding",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23344-4_22",
            "Abstract": "As a step toward developing neuroprostheses, the purpose of this study is to explore syllable decoding in a subject with implanted electrocorticographic (ECoG) recordings. For this study, we use ECoG signals recorded while a subject volunteered to perform a task in which the patient has been visually cued to speak isolated consonant-vowel syllables varying in their articulatory features. We propose a recursive estimation method to calculate the parametric model coefficients in each time instant and band power features from individual ECoG sites are extracted to decode the articulated syllables. Our findings may contribute to the development of brain machine interface (BMI) systems for syllable-level speech rehabilitation in handicapped individuals.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The Road to Quantum Artificial Intelligence",
            "Publication year": 2007,
            "Publication url": "https://arxiv.org/abs/0705.3360",
            "Abstract": "This paper overviews the basic principles and recent advances in the emerging field of Quantum Computation (QC), highlighting its potential application to Artificial Intelligence (AI). The paper provides a very brief introduction to basic QC issues like quantum registers, quantum gates and quantum algorithms and then it presents references, ideas and research guidelines on how QC can be used to deal with some basic AI problems, such as search and pattern matching, as soon as quantum computers become widely available.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Patras, Greece. Arxiv preprint arXiv:0705.3360"
        },
        {
            "Title": "Self-trained LMT for semisupervised learning",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1155/2016/3057481",
            "Abstract": "The most important asset of semisupervised classification methods is the use of available unlabeled data combined with a clearly smaller set of labeled examples, so as to increase the classification accuracy compared with the default procedure of supervised methods, which on the other hand use only the labeled data during the training phase. Both the absence of automated mechanisms that produce labeled data and the high cost of needed human effort for completing the procedure of labelization in several scientific domains rise the need for semisupervised methods which counterbalance this phenomenon. In this work, a self-trained Logistic Model Trees (LMT) algorithm is presented, which combines the characteristics of Logistic Trees under the scenario of poor available labeled data. We performed an in depth comparison with other well-known semisupervised classification methods on standard benchmark …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:rO6llkc54NcC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Self-trained extreme gradient boosting trees",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8900737/",
            "Abstract": "Semi-Supervised Learning (SSL) is an ever-growing research area offering a powerful set of methods, either single or multi-view, for exploiting both labeled and unlabeled instances in the most effective manner. Self-training is a representative SSL algorithm which has been efficiently implemented for solving several classification problems in a wide range of scientific fields. Moreover, self-training has served as the base for the development of several self-labeled methods. In addition, gradient boosting is an advanced machine learning technique, a boosting algorithm for both classification and regression problems, which produces a predictive model in the form of decision trees. In this context, the principal objective of this paper is to put forward an improved self-training algorithm for classification tasks utilizing the efficacy of eXtreme Gradient Boosting (XGBoost) trees in a self-labeled scheme in order to build a …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Revealing aging mechanisms from ensemble gene network inference methods",
            "Publication year": 2013,
            "Publication url": "https://www.jstage.jst.go.jp/article/jsmbe/51/Supplement/51_R-161/_article/-char/ja/",
            "Abstract": "The increasing number of sparsely and unevenly sampled gene expression experiments in aging research pose significant constraints in gene network inference. In addition, the inconsistency in predictions among gene regulatory network methods hampers the identification of true biological structure. Recent approaches show that ensemble predictions derived from community-based methods are more accurate and provide truly testable hypotheses. Such ensemble strategies combined with multiple aging datasets establish a robust cost-effective way for unraveling cross-tissue aging mechanisms and exonerate the need for refined microarray design.Over the last years, a substantial number of methods provided novel insights at different molecular aspects of aging with the use of systems biology network-based approaches. The decline in cellular function during aging is the cumulative result of changes in the expression level of a number of genes. Towards this orientation, the construction of Gene Regulatory Networks (GRNs) plays a prevalent role in the system modeling of interactions and regulations among genes. However, the choice of the network inference method still remains challenging, since recent studies have shown that no single method performs optimally across diverse data. For this reason, we propose the integration of predictions from multiple methods, since it has been proved to lead to more confident networks [1].",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:isC4tDSrTZIC",
            "Publisher": "Osaka, Japan"
        },
        {
            "Title": "Tamoxifen integromics and personalized medicine: dynamic modular transformations underpinning response to tamoxifen in breast cancer treatment",
            "Publication year": 2014,
            "Publication url": "https://www.liebertpub.com/doi/abs/10.1089/omi.2013.0055",
            "Abstract": "Recent advances in pharmacogenomics technologies allow bold steps to be taken towards personalized medicine, more accurate health planning, and personalized drug development. In this framework, systems pharmacology network-based approaches offer an appealing way for integrating multi-omics data and set the basis for defining systems-level drug response biomarkers. On the road to individualized tamoxifen treatment in estrogen receptor-positive breast cancer patients, we examine the dynamics of the attendant pharmacological response mechanisms. By means of an “integromics” network approach, we assessed the tamoxifen effect through the way the high-order organization of interactome (i.e., the modules) is perturbed. To accomplish that, first we integrated the time series transcriptome data with the human protein interaction data, and second, an efficient module-detecting algorithm was applied …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Mary Ann Liebert, Inc."
        },
        {
            "Title": "A contextual data mining approach toward assisting the treatment of anxiety disorders",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5378491/",
            "Abstract": "Anxiety disorders are considered the most prevalent of mental disorders. Nevertheless, the exact reasons that provoke them to patients remain yet not clearly specified, while the literature concerning the environment for monitoring and treatment support is rather scarce warranting further investigation. Toward this direction, in this study a context-aware approach is proposed, aiming to provide medical supervisors with a series of applications and personalized services targeted to exploit the multiparameter contextual data collected through a long-term monitoring procedure. More specifically, an application that assists the archiving and retrieving of the patients' health records was developed, and four treatment supportive services were considered. The three of them focus on the discovery of possible associations between the patient's contextual data; the last service aims at predicting the stress level a patient might …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Review of: Semantic Techniques in Quantum Computation (by Simon Gay and Ian Mackie eds)",
            "Publication year": 2012,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:RGFaLdJalmkC",
            "Publisher": "ACM"
        },
        {
            "Title": "Spatio-spectral analysis of ECoG signals during voice activity",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701531/",
            "Abstract": "In this paper, we perform spatio-spectral analysis of the human cortex with implanted electrocorticographic (ECoG) electrodes during the voice production process. For this study, the ECoG signals were recorded while the subject performed two-syllable tasks. Additionally, assuming that the speech activity of a subject is expressed as ECoG signal activity disparately distributed over the space of the electrodes, we examined the spectral information in response to the electrode locations. The study was based on spectral features (power spectral density) estimated for each electrode. Quantitative analysis based on the Relief algorithm was followed to estimate the degree of importance of each electrode for describing the voice activity. The experimental results showed that the spectral analysis with resolution of 8 Hz offers the highest voice discrimination performance (94.2%) using support vector machines as classifier …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pathway analysis using XGBoost classification in Biomedical Data",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201029",
            "Abstract": "Given the fact that our biological existence is rooted in a complex system within our cells with thousands of interactions among genes and metabolites, research community in biological and medical fields have shifted their interest to network-based approaches. This complexity is imprinted in networks which encode the relationships among system's components. This evolution has also led to the generation a new research fields, the Network Medicine, a combination of Network Science and Systems Biology applied to human diseases. Meanwhile, cutting-edge approaches towards this direction are the subpathway-based methods, identifying\" active subpathways\"-in the form of local sub-structures within pathways-related with a case under study.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal insertion in deterministic DAWGs",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397502005716",
            "Abstract": "In this paper, we present an on-line algorithm for adding words (strings) in deterministic directed acyclic word graphs (DAWGs) i.e. acyclic deterministic finite-state automata (DFAs). The proposed algorithm performs optimal insertion, meaning that if applied to a minimal DAWG, the DAWG after the insertion will also be minimal. The time required to add a new word is O(n) with respect to the size of the DAWG. Repetitive application of the proposed insertion algorithm can be used to construct minimal deterministic DAWGs incrementally, although the algorithm is not time-efficient for building minimal DAWGs from a set of words: to build a DAWG of n words this way, O(n2) time is required. However, the algorithm is quite useful in cases where existing minimal DAWGs have to be updated rapidly (e.g. speller dictionaries), since each word insertion traverses only a limited portion of the graph and no additional minimization …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Voice activity detection from electrocorticographic signals",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-00846-2_405",
            "Abstract": "The purpose of this study was to explore voice activity detection (VAD) in a subject with implanted electrocorticographic (ECoG) electrodes. Accurate VAD is an important preliminary step before decoding and reconstructing speech from ECoG. For this study we used ECoG signals recorded while a subject performed a picture naming task. We extracted time-domain features from the raw ECoG and spectral features from the ECoG high gamma band (70-110Hz). The RelieF algorithm was used for selecting a subset of features to use with seven machine learning algorithms for classification. With this approach we were able to detect voice activity from ECoG signals, achieving a high accuracy using the 100 best features from all electrodes (96%) or only 12 features from the two best electrodes (94%) using the support vector machines or a linear regression classifier. These findings may contribute to the …",
            "Abstract entirety": 0,
            "Author pub id": "TTgOnWAAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A PC-PATR-Based syntactic description of modern Greek",
            "Publication year": 2000,
            "Publication url": "https://academic.oup.com/dsh/article-abstract/15/3/291/939387",
            "Abstract": "This paper presents an implementation of a syntactic parser for the Modern Greek language based on the PC-PATR formalism. The Modern Greek language presents a high flexibility in its syntactic structure. The various phrasal categories (noun phrases, verb phrases, prepositional, and adverbial phrases) can be ordered in almost any permutation so as to build valid sentences. The allowable combinations of lexical categories (nouns, verbs, adjectives, etc.) forming the above phrases, as well as the combinations of these phrases, forming clauses, are encoded according to the PC-PATR formalism and are presented in this paper. The presented rules cover the majority of the syntactic phenomena of the Modern Greek language, adequate for speech and natural language applications.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:ufrVoPGSRksC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Learning Greek Phonetic Rules Using Decision-Tree Based Models.",
            "Publication year": 2007,
            "Publication url": "https://www.scitepress.org/Papers/2007/23812/23812.pdf",
            "Abstract": "This paper describes the application of decision-tree based induction techniques for automatic extraction of phonetic knowledge for the Greek language. We compare the ID3 algorithm and Quinlan’s C4. 5 model by applying them to two pronunciation databases. The extracted knowledge is then evaluated quantitatively. In the ten cross-fold validation experiments that are conducted, the decision tree models are shown to produce an accuracy higher than 99.96% when trained and tested on each dataset.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self-labeled Hidden Naive Bayes algorithm for semi-supervised classification",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7785414/",
            "Abstract": "Exploiting both labeled and unlabeled instances of various problems seems a really promising strategy, since useful information that is contained on the latter pool of data is discarded during supervised approaches. However, the size of the unlabeled data that needs to be examined is usually extremely large and efficient algorithms should be utilized in such cases. Hidden Naive Bayes (HNB) model constitutes a computational cheap variant of Bayesian networks. In this work, HNB has been used as the base classifier of Self-training scheme for classification problems. Its results over 36 UCI datasets prove that a robust behavior can be achieved with only one hidden layer even under strict time restrictions.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Layered, Transducer-Based Model for Speech and Language Processing",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:5nxA0vEk-isC",
            "Publisher": "Moscow, Russia"
        },
        {
            "Title": "A large greek-English dictionary with incorporated speech and language processing tools",
            "Publication year": 2009,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/interspeech_2009/papers/i09_1891.pdf",
            "Abstract": "A large Greek-English Dictionary with 81,515 entries, 192,592 translations into English and 50,106 usage examples with their translation has been developed in combined printed and electronic (DVD) form. The electronic dictionary features unique facilities for searching the entire or any part of the Greek and English section, and has incorporated a series of speech and language processing tools which may efficiently assist learners of Greek and English. This paper presents the human-machine interface of the dictionary and the most important tools, ie the TTS-synthesizers for Greek and English, the lemmatizers for Greek and English, the Grapheme-to-Phoneme converter for Greek and the syllabification system for Greek.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Web based Quantum Computer Simulator with symbolic extensions",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-56932-1_15",
            "Abstract": "This paper presents a quantum computer simulator with a web interface, based on the circuit model of quantum computation. This is the standard model for which most quantum algorithms have been developed. According to this model, quantum algorithms are expressed as circuits of quantum registers (series of qubits) and quantum gates operating on them. The paper also proposes another version of the existing simulator using symbolic computation in Python programming language, in order to perform quantum calculations.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:M05iB0D1s5AC",
            "Publisher": "Special Session in Computer algebra in quantum computing and quantum information theory"
        },
        {
            "Title": "Driving mental fatigue classification based on brain functional connectivity",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-65172-9_39",
            "Abstract": "EEG techniques have been widely used for mental fatigue monitoring, which is an important factor for driving safety. In this work, we performed an experiment involving one hour driving simulation. Based on EEG recordings, we created brain functional networks in alpha power band with three different methods, partial directed coherence (PDC), direct transfer function (DTF) and phase lag index (PLI). Then, we performed feature selection and classification between alertness and fatigue states, using the functional connectivity as features. High accuracy (84.7%) was achieved, with 22 discriminative connections from PDC network. The selected features revealed alterations of the functional network due to mental fatigue and specifically reduction of information flow among areas. Finally, a feature ranking is provided, which can lead to electrode minimization for real-time fatigue monitoring applications.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Review of: Quantum Computing: A Gentle Introduction (by Eleanor Rieffel and Wolfgang Polak)",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/2491533.2491543",
            "Abstract": "This is an introductory book on quantum computation. Since many books on quantum computation have already been reviewed and presented in this column (eg issues 34-3, 36-3, 38-1, 40-4, 41-3), I presume that most readers already know what a quantum computer is, or what Grover’s algorithm is famous for, so I shall try not to repeat statements of common knowledge. Let me just say that this book addresses the circuit model of quantum computation, where computation is preformed by quantum gates (aka unitary transformations) and algorithmic processes are usually expressed as circuits built using such gates. Also, the content focuses on quantum algorithmic processes, ie it does not contain details on hardware implementations of quantum computers.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:r0BpntZqJG4C",
            "Publisher": "ACM"
        },
        {
            "Title": "Teaching introduction to computing through a project-based collaborative learning approach",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600433/",
            "Abstract": "Teaching introduction to computing courses, especially to first year college students, is a challenging endeavor given the increasing difficulty of today's students with programming and algorithmic thinking. In this paper the experience of introducing collaborative and project based approaches in a first year University course is reported. Both synchronous collaborative learning approaches and asynchronous collaboration through group project work have been introduced in the course using Python as a programming language. The effect of use of these approaches in students' attitude towards Computer Science and their performance is discussed here.",
            "Abstract entirety": 1,
            "Author pub id": "TTgOnWAAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        }
    ]
}]