[{
    "name": "Κυριάκος Βλάχος",
    "romanize name": "Kyriakos Vlachos",
    "School-Department": "Μηχανικών Ηλεκτρονικών Υπολογιστών & Πληροφορικής",
    "University": "upatras",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 17723,
    "Scholar name": "Kyriakos Vlachos",
    "Scholar id": "dwzqmcQAAAAJ",
    "Affiliation": "University of Patras",
    "Citedby": 2407,
    "Interests": [
        "photonics",
        "biosensors",
        "WDM transmission systems",
        "FiWi convergence"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=dwzqmcQAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Modeling of photonic crystal fiber with polymer inclusions",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8426/84260Y/Modeling-of-photonic-crystal-fiber-with-polymer-inclusions/10.1117/12.922674.short",
            "Abstract": "We have numerically investigated the guiding properties in a hybrid polymer/silica photonic crystal fiber (PCF). We considered poly-dimethylsiloxane (PDMS) as the infused polymer into the air-holes of PCF and we present how the modal properties of the fiber are affected due to PDMS inclusions. We numerically calculated the guiding and thermal properties of the hybrid structure in terms of the effective index, single-mode operation, confinement loss, numerical aperture (NA), effective modal area (EMA) and fraction of power into the polymer-filled cladding for different relative hole sizes, d/Λ (0.35-0.75) of the hybrid PCF whereas direct comparison with a conventional air-filled PCF is also shown. Further investigation of EMA, NA and fraction of power in the cladding with respect to thermal variations is also reported for a range of temperatures from 0°C to 100°C.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:UxriW0iASnsC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A self-consistent model for a SOA-based fiber ring laser including the mode-locked pulse properties",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401806000563",
            "Abstract": "In this paper, we present a self-consistent model of an optically mode-locked semiconductor fiber ring laser. The fiber laser uses a semiconductor optical amplifier (SOA) as the gain medium, while mode-locking is achieved by its gain modulation, via an external optical pulsed signal. We solved the model analytically developing a novel technique, where we have assumed double saturation of the SOA by both the mode-locked and the externally introduced pulsed signal. The study revealed the locus of the laser parameters to achieve mode-locking. In particular, it was found that SOA gain and energy of the externally introduced signal are two critical parameters that must simultaneously set properly for exact mode-locking. Another outcome of our analysis is that the study of the chirp parameter should be carried out keeping the nonlinear terms of the SOA gain. We have also investigated a slightly detuning regime of …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:bEWYMUwI8FkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Virtual Department on Optical Switching Systems VD-S–Key issues and planned activities",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=14529613049102820147&hl=en&oi=scholarr",
            "Abstract": "This document is deliverable D. VD-S. 1 of VD-S work-package of Network of Excellence e-Photon/ONE project. It aims at identifying and explaining the key issues for realizing future optical switching systems. The deliverable is organized in two sections. First section presents the partners’ planned activities and reveals the current research trends within VD-S network. The partners, based on these planned activities, have established bilateral agreements to work jointly in a number of activities. To this end, the second section of this deliverable summarizes these joint work proposals and provides a brief description of the work to be carried out. A full description of the proposed collaborative work appears in an appendix.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ARTEMIS: 40-Gb/s all-optical self-routing node and network architecture employing asynchronous bit and packet-level optical signal processing",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-24-8-2967",
            "Abstract": "A 40-Gb/s asynchronous self-routing network and node architecture that exploits bit and packet level optical signal processing to perform synchronization, forwarding, and switching in the optical domain is presented. Optical packets are self-routed on a hop-by-hop basis through the network by using stacked optical tags, each representing a specific optical node. Each tag contains necessary control signals for configuring the node-switching matrix and forwarding each packet to the appropriate outgoing link and onto the next hop. In order to investigate the feasibility of their approach physical-layer simulations are performed, modeling each optical subsystem of the node showing acceptable signal quality and end-to-end bit error rates. In the All-optical self-RouTer EMploying bIt and packet-level procesSing (ARTEMIS) control plane, a timed/delayed resource reservation-based signaling scheme is employed …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "50-GHz, ultrastable, polarization-maintaining semiconductor fiber ring laser",
            "Publication year": 2005,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Optical-Engineering/volume-44/issue-6/064206/50-GHz-ultrastable-polarization-maintaining-semiconductor-fiber-ring-laser/10.1117/1.1926867.short",
            "Abstract": "We demonstrate a highly stable, all-polarization-maintaining fiber semiconductor ring laser source. It uses a semiconductor optical amplifier (SOA) to provide both gain and gain modulation from an external 5-GHz optical pulse train. The laser source generates 3.5-ps pulses up to a 50-GHz repetition rate with negligible amplitude pattern.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:hFOr9nPyWt4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A dynamic impairment-aware networking solution for transparent mesh optical networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4939275/",
            "Abstract": "Core networks of the future will have a translucent and eventually transparent optical structure. Ultra-high-speed end-to-end connectivity with high quality of service and high reliability will be realized through the exploitation of optimized protocols and lightpath routing algorithms. These algorithms will complement a flexible control and management plane integrated in the proposed solution. Physical layer impairments and optical performance are monitored and incorporated in impairment-aware lightpath routing algorithms. These algorithms will be integrated into a novel dynamic network planning tool that will consider dynamic traffic characteristics, a reconfigurable optical layer, and varying physical impairment and component characteristics. The network planning tool along with extended control planes will make it possible to realize the vision of optical transparency. This article presents a novel framework that …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "New unified PON-RAN access architecture for 4G LTE networks",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-6-10-890",
            "Abstract": "This work presents a new converged access architecture for LTE mobile backhaul networks. In the proposed architecture, evolved NodeBs (eNBs) are interconnected with local ring-based wavelength-division-multiplexed (WDM) passive optical networks (PONs), which aggregate and efficiently transport traffic to the evolved packet core (EPC). The proposed WDM-PON ring design supports a dynamic setup of virtual circuits for inter-base-station communication, over a dedicated λ_LAN channel. It also supports load balancing, by dynamically reallocating and sharing the capacity of the downstream wavelengths. The reservation mechanism is arbitrated by the optical line terminal, which monitors the traffic imbalances of downstream channels and orchestrates the setup of subwavelength “transient flows.”",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:1qzjygNMrQYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optical device for extracting a sideband signal from a composite signal including orthogonally modulated signals",
            "Publication year": 2008,
            "Publication url": "https://patents.google.com/patent/US7315699B2/en",
            "Abstract": "An optical device extracts an information bearing sideband such as an FSK or SCM signal (label) from a composite signal that includes the sideband and an orthogonally modulated signal such as an intensity modulated signal (payload) by splicing the composite signal into a polarization maintaining fiber at a desired angle so that the composite signal is separated into two orthogonal polarizations that experience differential group delay in the fiber. The polarized output signals from the fiber are then coupled to a polarization beam splitter at an equivalent or complementary angle to the desired angle so that one sideband of the composite signal appears at a first output of the beam splitter while another sideband appears at a second output of the beam splitter. The sidebands can then be converted to an electrical data signal by using an appropriate receiver, such as a balanced receiver for FSK signals. In one …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "10 x 30 GHz pulse train generation from semiconductor amplifier fiber ring laser",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/817457/",
            "Abstract": "A multiwavelength, fiber ring laser source, is demonstrated. It generates 10 wavelength channels, simultaneously mode-locked and synchronized at 30 GHz, each producing 7-ps pulses. The mode-locking technique relies on the gain saturation of the semiconductor amplifier from an external optical pulse train to impose the simultaneous mode-locking of the 10 wavelengths.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ARTEMIS: A 40 Gb/s all-optical self-router using asynchronous bit and packet-level optical signal processing",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1578023/",
            "Abstract": "We present a 40 Gb/s asynchronous self-routing network and node architecture that exploits bit and packet level optical signal processing to perform synchronization, forwarding and switching. Optical packets are self-routed on a hop-by-hop basis through the network by using stacked optical tags, each representing a specific optical node. Each tag contains control signals for configuring the switching matrix and forwarding each packet to the appropriate outgoing link and onto the next hop. Physical layer simulations are performed, modeling each optical sub-system of the node showing acceptable signal quality and bit error rates. Resource reservation-based signaling algorithms are theoretically modeled for the control plane capable of providing high performance in terms of blocking probability and holding time",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of an optical packet\" scheduling\" switch",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1378310/",
            "Abstract": "In this paper a performance analysis of the packet scheduling switch is presented. The scheduling switch uses a series of feedforward delays interconnected with elementary optical switches. This series of programmable delay blocks constitutes an optical buffer of depth T, whose purpose is to delay/re-arrange incoming packets that request the same outgoing link so as to resolve or reduce packet contention. Performance results have been obtained for random Bernoulli traffic, Pareto traffic, as well as for smooth traffic with an upper bound of inherent burstiness.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EBRP: A hybrid signaling protocol for efficient burst-level reservations and QoS differentiation in OBS networks",
            "Publication year": 2006,
            "Publication url": "http://www.ceid.upatras.gr/webpages/faculty/manos/kchristodou/journals/jon_ebrp.PDF",
            "Abstract": "Optical burst switching (OBS) has been introduced as a true broadband solution offering a higher degree of data transparency and providing sufficient bandwidth for the establishment of the fast internet and other advanced, high speed services [1]. The recent advances in network techniques, such as the introduction of GMPLS, have favored the development of new OBS concepts such as Labelled OBS (LOBS) securing higher network performance standards by enabling a sub-wavelength, burst-level granularity [2]. The requirement for optimizing network resources and simultaneously minimizing buffering in the core has imposed severe constraints on designing simple and efficient OBS networks.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Seasonality of violent suicides in the Athens greater area",
            "Publication year": 2009,
            "Publication url": "https://guilfordjournals.com/doi/abs/10.1521/suli.2009.39.3.321",
            "Abstract": "The aim of the study was to ascertain suicide seasonality in the Greek population and to associate this seasonal variation with age, sex, and suicide method. Studying seasonality can be of help in establishing a public health policy, related with suicide prevention. This is an epidemiologic study based on forensic evidence. We studied the deaths caused by self-injury (trauma), namely deaths by violent suicide (not self-poisoning). Statistically significant suicide seasonality was established with a peak in May. This seasonal variation is attributed mainly to males. As for the method, suicide by hanging peaks in June and by shooting in April. It was also observed that seasonality for individuals above the age of 45 peaks in early May.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Guilford"
        },
        {
            "Title": "Efficient inter-ONU communication in ring-based WDM-PONs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6876475/",
            "Abstract": "Ring-based WDM-PONs can employ a single dedicated wavelength channel to interconnect the Optical Network Units (ONUs) thus providing a means for inter-ONU communication and downstream wavelength sharing. In this paper, a new TDM dynamic bandwidth allocation (DBA) algorithm for inter-ONU communication is proposed, which takes into account the destination of the ONUs on the ring. The main purpose of this `Destination-Aware' (DestAware) algorithm is to improve the network inter-ONU communication performance without any additional cost. Performance results show that by considering the destination of the ONUs during the bandwidth allocation process both line utilization and experienced delay are improved.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wavelength-space permutation switch with coherent PDM QPSK transmission for supercomputer optical interconnects",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=NFOEC-2010-JWA62",
            "Abstract": "We experimentally study the performance of an economically-viable, high-capacity supercomputer optical interconnect employing wavelength-space optical packet switching, polarization division multiplexed (PDM) quadrature phase shift keying (QPSK) modulation and coherent detection.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Bending loss and thermo-optic effect of a hybrid PDMS/silica photonic crystal fiber",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-18-23-24344",
            "Abstract": "In this paper, we demonstrate and report a photonic crystal fiber (PCF) infiltrated with PDMS elastomer which is sensitive to external bending and temperature perturbations. Numerical simulations and experimental measurements were carried out to investigate the fundamental TIR-based guiding mechanism of the hybrid PDMS/silica PCF in terms of effective index, effective modal area and loss. Wavelength dependence of bending losses was also measured for different bend diameters as well as the temperature dependence of the fundamental guiding mode for a range of temperatures from 20°C to 75°C. Experimental measurements have shown a ~6% power recovery of the bend-induced loss for a 6-cm long PDMS-filled PCF at 4 cm bend diameter.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:8k81kl-MbHgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Thermo-optic effect of an index guiding photonic crystal fiber with elastomer inclusions",
            "Publication year": 2011,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/7753/775340/Thermo-optic-effect-of-an-index-guiding-photonic-crystal-fiber/10.1117/12.886004.short",
            "Abstract": "In this work, we demonstrate numerically and experimentally the temperature dependence of a photonic crystal fiber (PCF) infiltrated with PDMS elastomer. We investigated the guiding properties of the PDMS-filled PCF and we present the variation of the effective index and effective modal areas of the fundamental guiding mode at 633 and 1550 nm, for a range of temperatures from 20°C to 75°C. Experimental measurements have shown an up to ~6% power recovery of the bend-induced loss for a 6-cm long PDMS-filled PCF at 4 cm bend diameter.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:iH-uZ7U-co4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "An efficient, low-cost I/O subsystem for network processors",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1214353/",
            "Abstract": "An efficient I/O subsystem enables cost-effective network processing. To improve high-speed data transfer, the I/O subsystem sends data directly into the processing core's register file. An implementation of this subsystem in a single-chip network processor , the Pro/sup 3/, can sustain advanced inspection firewall processing of 2.5-Gbps TCP traffic.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Introduction to Robotics for Novice Users: A Case Study from Summer Schools in Greece",
            "Publication year": 2018,
            "Publication url": "https://www.ejers.org/index.php/ejers/article/view/640",
            "Abstract": "The paper conveys experiences and conclusions from the organization of three summer schools aiming at introducing novice users to robotics programming. Issues related to teaching material, teaching approaches, challenges in the classroom and participant's acceptance are all examined in dedicated sections of the paper. The teaching staff’s impressions as well as the conclusions drawn from the course evaluation by the participants show that the robots can be successfully employed for introducing novice users, especially schoolchildren, to software development as well as robotic principles.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:hkOj_22Ku90C",
            "Publisher": "Unknown"
        },
        {
            "Title": "All-optical clock recovery from short asynchronous data packets at 10 Gb/s",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1224609/",
            "Abstract": "In this letter, we demonstrate clock extraction from 10-Gb/s asynchronous short data packets. Successful clock acquisition is achieved from data packets arriving at time intervals of only 1.5 ns, irrespective of their precise phase relation. The clock recovery circuit used consists of a Fabry-Perot filter and an ultrafast nonlinear interferometer gate and requires very short time for synchronization.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A reconfigurable OADM architecture for high-order regular and offset QAM based OFDM super-channels",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8667642/",
            "Abstract": "We investigate the performance of a reconfigurable all-optical add drop multiplexer (ROADM) architecture, that is suitable of supporting high-order regular and offset based QAM signals. The design is based on a highly modular interferometric, structure, in which OFDMA sub-channels remain in the optical domain. Sub-channel extraction is achieved via waveform splitting and coherent subtraction. Numerical studies have been carried out to validate performance and optimize critical parameters of the add/drop process. Particularly, input parameters like the signal extinction ratio, pulse rise time, switching window, and input power levels have been optimized for single sub-carrier add/drop operation, from an OFDM super-channel comprising seven optical sub-carriers with 10 GHz spacing. Results have shown that the proposed ROADM architecture can accommodate and process both regular and offset based high …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A combined TCP aware scheduling and assembly scheme for OBS networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5336339/",
            "Abstract": "The efficient transmission of TCP traffic over OBS networks is a challenging problem, due to the high sensitivity of TCP congestion control mechanism to losses. In this work, we propose solutions to this problem, through the burst assembly and scheduling mechanism of OBS. We investigate and propose algorithms to achieve performance enhancements for TCP traffic by taking into account TCP state information. We prove our claims with references to well-established TCP models, and validate the proposed algorithms through simulations.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Research Agenda in Optical Burst Switching in e-Photon/ONe",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4013823/",
            "Abstract": "Summary form only given. This talk provides an overview of the current research in optical burst switching within the EU network of excellence e-Photon/ONe, comprising network aspects such as routing techniques, resilience and contention resolution, together with burst switch architectures. On the other hand, we also discuss traffic analysis issues, quality of service (QoS) schemes, TCP/IP over OBS and physical layer aspects for OBS",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultrafast semiconductor-based fiber laser sources",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1288084/",
            "Abstract": "In this paper, a novel ring laser platform is presented that uses a single active element, a semiconductor optical amplifier (SOA), to provide both gain and gain modulation in the optical cavity. Gain modulation is achieved by an externally introduced optical pulsed signal. This signal periodically saturates the amplifier gain and forces the ring laser to mode lock. Using this laser platform, we demonstrate picosecond pulsetrain generation at repetition rates up to 40 GHz, either in single or multiwavelength operation mode. In particular, using rational harmonic mode locking, 2.5-ps pulses were obtained up to a 40-GHz repetition rate, while output pulses and output power were constant over a 20-nm tuning range. In addition, a multiwavelength optical signal was obtained using the same laser platform with the addition of a Fabry-Pe/spl acute/rot filter for comb generation. Multiwavelength oscillation is possible due to the …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On transmission control protocol synchronization in optical burst switching",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11107-009-0195-9",
            "Abstract": "This article studies the transmission control protocol (TCP) synchronization effect in optical burst switched networks. Synchronization of TCP flows appears when optical bursts with segments from different flows inside are dropped in the network causing flow congestion windows decreasing simultaneously. In this article, this imminent effect is studied with different assembly schemes and network scenarios. Different metrics are applied to quantitatively assess synchronization with classical assembly schemes. A new burst assembly scheme is proposed that statically or dynamically allocates flows to multiple assembly queues to control flow aggregation within the assembly cycle. The effectiveness of the scheme has been evaluated, showing a good improvement in optical link utilization.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "On the use of genetic algorithms for solving the RWA problem employing the maximum quantity of edge disjoint paths",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4598678/",
            "Abstract": "In this paper, the routing and wavelength assignment problem in all optical networks is considered. A solution to the RWA problem is proposed through a Genetic Algorithm (GA) based approach to search for the most suitable set of paths from many possible ones. We use GAs to solve this problem by introducing a new fitness function based on the mean value of occurrence of the common edges between the different genes of a single chromosome. In addition, we further improve performance and particularly execution times by considering the maximum quantity of edge disjoint paths (EDPs) to initialize the population with some indigo chromosomes. These EDPs are pre-computed and inserted in the GA-RWA problem. The proposed approach has been evaluated on the NSF network topology and compared with other similar schemes.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Constrained and Unconstrained overspill routing in optical networks: a detailed performance evaluation",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11107-006-0052-z.pdf",
            "Abstract": "In this article, we present a detailed performance evaluation of a hybrid optical switching (HOS) architecture called Overspill Routing in Optical Networks (ORION). The ORION architecture combines (optical) wavelength and (electronic) packet switching, so as to obtain the individual advantages of both switching paradigms. In particular, ORION exploits the possible idle periods of established lightpaths to transmit packets destined to the next common node, or even directly to their common end-destination. Depending on whether all lightpaths are allowed to simultaneously carry and terminate overspill traffic or overspill is restricted to a sub-set of wavelengths, the architecture limits itself to constrained or un-constrained ORION. To evaluate both cases, we developed an extensive network simulator where the basic features of the ORION architecture were modeled, including suitable edge/core node switches …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:HDshCWvjkbEC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "STOLAS: Switching technologies for optically labeled signals",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1244923/",
            "Abstract": "GMPLS-based labeled optical burst switching (LOBS) networks are being considered as the next-generation optical Internet. GMPLS includes wavelength switching next to label and fiber (space) switching. We present a new concept of optically labeling bursts of packets suitable for LOBS networks supported by GMPLS. It is based on angle modulation, which enables control information to modulate the phase or frequency of the optical carrier, while payload data are transmitted via intensity modulation (IM). In particular, the optical label is orthogonally modulated, with respect to the payload, using either frequency shift keying or differential phase shift keying. We present a performance analysis of the modulation schemes by means of simulations where the influence of the payload IM extinction ratio and laser linewidth are investigated. In addition, the transmission performance of an IM/FSK combined modulated …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "23 Wavelength with 100 GHz spacing comb generator source",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1024437428334",
            "Abstract": "Simultaneous oscillation of 23 wavelengths, spaced at 100 GHz, is demonstrated from a single source using a semiconductor optical amplifier linear cavity. The wavelength comb is generated from an intra cavity, fiber implemented Lyot filter. Each oscillating wavelength has a linewidth of 12.5 GHz and the maximum power variation between the 23 wavelengths was less than 3 dB.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:TFP_iSt0sucC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Recipe for intensity modulation reduction in SOA-based interferometric switches",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-22-12-2834",
            "Abstract": "This paper presents a theoretical and experimental analysis of saturated semiconductor optical amplifier (SOA)-based interferometric switching arrangements. For the first time, it is shown that such devices can provide enhanced intensity modulation reduction to return-to-zero (RZ) formatted input pulse trains, when the SOA is saturated with a strong continuous-wave (CW) input signal. A novel theoretical platform has been developed in the frequency domain, which reveals that the intensity modulation of the input pulse train can be suppressed by more than 10 dB at the output. This stems from the presence of the strong CW signal that transforms the sinusoidal transfer function of the interferometric switch into an almost flat, strongly nonlinear curve. This behavior has also been verified experimentally for both periodically and randomly degraded, in terms of intensity modulation, signals at 10 Gb/s using the ultrafast …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A preemptive scheduling scheme for flexible QoS provisioning in OBS networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5336379/",
            "Abstract": "In optical burst switching (OBS) networks one of the most challenging problems is to provide service differentiation. The lack of buffering in the intermediate nodes, makes QoS provisioning in OBS networks a difficult problem to address. In this work, we propose a scheduling algorithm that supports QoS based on preemptions, which are controlled by a novel preemption policy. Our claims are validated by analytical modelling and experimental analysis through simulations using data belonging to two different classes of service - best effort and video streaming data. Performance evaluation is based on throughput measurements for best effort class, and perceived quality metrics like PSNR and MOS scores for the video streaming class.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data underpinning article\" A Reconfigurable OADM Architecture for High-Order Regular-and Offset-QAM based OFDM Super-Channels\"",
            "Publication year": 2019,
            "Publication url": "http://researchdata.aston.ac.uk/id/eprint/408/",
            "Abstract": "Data underpinning article \"A Reconfigurable OADM Architecture for High-Order Regular- and \nOffset- QAM based OFDM Super-Channels\" - Aston Data Explorer Aston University logo \nResearch| Library| About Aston Login Home About Browse Advanced Search Search Data \nunderpinning article \"A Reconfigurable OADM Architecture for High-Order Regular- and Offset- \nQAM based OFDM Super-Channels\" Metadata Creators: Vlachos, Kyriakos, Ferreira, Filipe and \nSygletos, Stylianos Keywords: Add-Drop multiplexing, QAM signals, optical superchannel, \nOFDMA, coherent detection Divisions: Engineering and Applied Science > Institute of Photonics \nFunders: EPSRC, EU-ICT Projects: PEACE, TRANSNET, FOX-C Grant number: (EP/L000091/1, \n(EP/R035342/1, 318415 Data Publisher: Aston University Date Made Available: 26 March \n2019 Collection period: From To 2018 2019 Identification Number: https://doi.org//.aston…",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:fEOibwPWpKIC",
            "Publisher": "Aston University"
        },
        {
            "Title": "Research on optical core networks in the e-Photon/ONe network of excellence",
            "Publication year": 2006,
            "Publication url": "http://repository.bilkent.edu.tr/bitstream/handle/11693/27177/bilkent-research-paper.pdf?sequence=1",
            "Abstract": "This papers reports the advances in Optical Core networks research coordinated in the framework of the e-Photon/ONe and e-Photon/ONe+ networks of excellence.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical clock recovery and clock division at 20 Gb/s using a tunable semiconductor fiber ring laser",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401803016006",
            "Abstract": "Optical clock recovery and clock division is demonstrated from a pseudo-data pattern at 20 Gb/s, using a semiconductor optical amplifier fibre ring laser. The ring laser is capable of generating 4.7 ps pulses at 20 GHz repetition rate and less than 3 ps pulses at the divided clock frequencies of 10 and 5 GHz, over a 16 nm tuning range. The effect of the input data pattern on the recovered clock signal is investigated. The extinction ratio of the recovered clock signal to the clock sub-harmonics was found to be as high as 40 dB despite the long series of consecutive zeros of input pattern.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:ufrVoPGSRksC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Broadband penetration and broadband competition: evidence and analysis in the EU market",
            "Publication year": 2006,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/14636690610707464/full/html",
            "Abstract": "To examine broadband competition and broadband penetration in a set of countries that employ the same regulation framework. To define the policy and strategy required to promote broadband in weak markets that do not employ alternative infrastructures.Study penetration and competition level statistics from 2002 to 2005 in a set of countries with different infrastructures deployed, services provided as well as in their social‐economic structures but employing the same regulation framework. Measure the level of inter‐platform and intra‐platform competition as well as the availability of bitstream access versus the incumbents' shares.The paper concludes that a mature broadband market is the one that exhibits a high penetration ratio in combination with a high competition level. Bitstream access can counterbalance the inexistence of alternative broadband …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "An adaptive burst assembly scheme for OBS-GRID networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4610759/",
            "Abstract": "This paper addresses the problem of burst assembly in OBS-GRID networks and particularly the TCP throughput maximization problem for large file sizes. For that purpose, a novel adaptive size-based approach is proposed, following some probabilistic methods and considering the effect of the burstification process in the overall transport system. The scheme has been evaluated in a high capacity GRID network. It was found that the proposed scheme results in shorter file transfer times, a significant higher TCP throughout, thus yielding a positive impact at the grid mechanics. The performance of the scheme is compared to that of a timer-based algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental and theoretical studies of a high repetition rate fiber laser, mode-locked by external optical modulation",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401800007082",
            "Abstract": "An experimental and theoretical study of a high repetition rate laser source operating on a novel mode-locking technique is presented. This technique relies on the fast saturation and recovery of a semiconductor optical amplifier induced by an external optical pulse and has been used to obtain 4.3 ps pulses at 20 GHz. A complete mathematical model of the fiber ring laser is presented describing the mode-locking process in the laser oscillator and providing solutions for the steady-state mode-locked pulse profile. The critical parameters of the system are defined and analyzed and their impact on the formation of the mode-locked pulses is examined. The comparison between the theoretical results and the experimental data reveals very good agreement and has allowed the optimization of the performance of the system in terms of its critical parameters.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:_FxGoFyzp5QC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Development of hybrid solid and hollow core photonic crystal fiber with soft glass deposition for infrared light manipulation",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6876463/",
            "Abstract": "We experimentally demonstrate a novel method which allows deposition of solution-based soft-glass films (chalcogenide) inside the holes of commercially available solid and hollow core photonic crystal fiber (PCF). The transmission spectra are recorded using a supercontinuum source indicating ARROW type guidance in the solid core PCFs while initial results on deposition of soft glass films into the hollow core fiber is also reported. The proposed deposition method provides the ability to enhance significantly the nonlinearity in an silica PCF in a simple and cost-effective way. Multi-material deposition (in various layers) inside the holes of the PCF is experimentally feasible using the suggested approach.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Broadband ONU Design Using A Semiconductor Optical Amplifier-Based Optical Loop Mirror",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2009-JWA80",
            "Abstract": "We demonstrate a novel approach in the implementation of a broadband Optical Network Unit using a Semiconductor Optical Amplifier-based Optical Loop Mirror, both experimentally and via simulations for up to 50 km and 2.5 Gb/s.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optically-addressable packet timeslot interchanger using a quadruple switch array",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4348766/",
            "Abstract": "We propose and demonstrate a wavelength converter-based time-slot-interchanger architecture consisting of cascaded programmable delay stages. It uses an integrated quadruple switch array of HMZI switches and operated error-free with 10 Gb/s NRZ packets.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ARTEMIS: A new architecture for all-optical asynchronous self-routing network with efficient contention protection and QoS differentiation",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1576450/",
            "Abstract": "We present a new architecture for bufferless, asynchronous all-optical self-routing network combining an efficient physical layer structure and conflict-preventing signaling protocol for providing lossless communication with optimum resource utilization and QoS differentiation.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:k_IJM867U9cC",
            "Publisher": "IET"
        },
        {
            "Title": "A system perspective of all-optical digital logic gates",
            "Publication year": 2003,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-21-9-1857",
            "Abstract": "In this paper, we review recent advances in ultrafast optical time-domain technology with emphasis on the use in optical packet switching. In this respect, several key building blocks, including high-rate laser sources applicable to any time-division-multiplexing (TDM) application, optical logic circuits for bitwise processing, and clock-recovery circuits for timing synchronization with both synchronous and asynchronous data traffic, are described in detail. The circuits take advantage of the ultrafast nonlinear transfer function of semiconductor-based devices to operate successfully at rates beyond 10 Gb/s. We also demonstrate two more complex circuits-a header extraction unit and an exchange-bypass switch-operating at 10 Gb/s. These two units are key blocks for any general-purpose packet routing/switching application. Finally, we discuss the system perspective of all these modules and propose their possible …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient Projective Transformation and Lanczos Interpolation on ARM Platform using SIMD Instructions.",
            "Publication year": 2018,
            "Publication url": "https://www.scitepress.org/Papers/2018/65470/65470.pdf",
            "Abstract": "This paper proposes a novel way of exploiting NEON SIMD instructions for accelerating projective transformation in ARM platforms. Instead of applying data parallelism to linear algorithms, we study the effectiveness of SIMD intrinsics on this non-linear algorithm. For image resampling, Lanczos interpolation is used since it is adequately accurate, despite its rather large complexity. Multithreading is also employed for optimal use of system resources. Moreover, qualitative and quantitative results of NEON’s performance are presented and analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The design of an allo-optical packet switching network",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4378321/",
            "Abstract": "Recent advances in the all-optical signal processing domain report high-speed and nontrivial functionality directly implemented in the optical layer. These developments mean that the all- optical processing of packet headers has a future. In this article we address various important control plane issues that must be resolved when designing networks based on all-optical packet-switched nodes.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Model-based aberration correction in a closed-loop wavefront-sensor-less adaptive optics system",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/fulltext.cfm?uri=oe-18-23-24070",
            "Abstract": "In many scientific and medical applications, such as laser         systems and microscopes, wavefront-sensor-less (WFSless) adaptive optics         (AO) systems are used to improve the laser beam quality or the image         resolution by correcting the wavefront aberration in the optical path. The         lack of direct wavefront measurement in WFSless AO systems imposes a         challenge to achieve efficient aberration correction. This paper presents an         aberration correction approach for WFSlss AO systems based on the model         of the WFSless AO system and a small number of intensity measurements,         where the model is identified from the input-output data of the WFSless         AO system by black-box identification. This approach is validated in an         experimental setup with 20 static aberrations having Kolmogorov spatial         distributions. By correcting N = 9 Zernike modes (N is the number of …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "ICT BONE views on the Network of the Future: the role of optical networking",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548941/",
            "Abstract": "Part of the activities of the ICT EU Network of Excellence \"Building the future Optical Network in Europe\" (BONE) project is the development of the European Roadmap on Optical Networking in the context of the \"Network of the Future\". This paper presents a summary of the views of the BONE consortium as they were developed in the framework of the Roadmap activity. The methodology followed in the development of the BONE Roadmap was firstly to identify and analyse the status of broadband access penetration as well as the availability of specific network and IT technologies in various European countries. The data collected were then processed and translated into the traffic volume (distributed across different European countries) that a Pan-European network would need to support. This information is then used as the basis of a WDM optical network dimensioning exercise performed with the aim of identifying …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient resource management via dynamic bandwidth sharing in a WDM-PON ring-based architecture",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6253747/",
            "Abstract": "In this work, we propose an efficient resource management approach for WDM-PON ring architectures that supports dynamic bandwidth allocation and sharing of downstream wavelengths. We propose a modification in the ONU design, to dynamically setup virtual circuits for inter-ONU communication. The reservation mechanism is arbitrated by the OLT, which also monitors the traffic imbalances of downstream channels.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Label-free biosensing with high sensitivity in dual-core microstructured polymer optical fibers",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-19-8-7790",
            "Abstract": "We present experimentally feasible designs of a dual-core microstructured polymer optical fiber (mPOF), which can act as a highly sensitive, label-free, and selective biosensor. An immobilized antigen sensing layer on the walls of the holes in the mPOF provides the ability to selectively capture antibody biomolecules. The change of the layer thickness of biomolecules can then be detected as a change in the coupling length between the two cores. We compare mPOF structures with 1, 2, and 3 air-holes between the solid cores and show that the sensitivity increases with increasing distance between the cores. Numerical calculations indicate a record sensitivity up to 20 nm/nm (defined as the shift in the resonance wavelength per nm biolayer) at visible wavelengths, where the mPOF has low loss.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:WF5omc3nYNoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "New architectures for optical packet switching using QD-SOAs for multi-wavelength buffering",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4734424/",
            "Abstract": "We present two architectures for implementing optical buffers. Both use multi-wavelength selective elements like quantum dot semiconductor optical amplifiers (QD-SOAs) as multi-wavelength converters and fixed-length delay lines that are combined to form both an output queuing and a parallel buffer switch design. The output queuing buffer design requires less active devices (QD-SOA) when implementing large buffers, but the parallel buffer design becomes more profitable, when the number of wavelength channels that can be simultaneously processed by the wavelength selective switches (QD-SOAs) increases. This is because the number of active devices depends only on the buffer size. We also proposed scheduling algorithm to resolve packet contention in parallel buffer architecture and carried out a simulation considering mean packet delay, maximum buffer occupancy and packet loss probability.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The research agenda in optical burst switching in e-Photon/ONe (Tutorial)",
            "Publication year": 2006,
            "Publication url": "https://research-information.bris.ac.uk/en/publications/the-research-agenda-in-optical-burst-switching-in-e-photonone-tut",
            "Abstract": "The research agenda in optical burst switching in e-Photon/ONe (Tutorial) — University of \nBristol Skip to main navigation Skip to search Skip to main content University of Bristol Logo \nHelp & Terms of Use Home Profiles Research Units Research Outputs Projects Student theses \nDatasets Activities Prizes Facilities/Equipment Search by expertise, name or affiliation The \nresearch agenda in optical burst switching in e-Photon/ONe (Tutorial) S. Bjornstad, M. Casoni, \nK. Christodoulopoulos, J. Fdez-Palacios, C. Gauger, O. Gonzalez, G. Hu, E. Karasan, M. \nKlinkowski, D. Morato, R. Nejabati, H. Overby, C. Raffaelli, D. Simeonidou, J. Sole-Pareta, N. \nStol, GM Tosi Beleffi, K. Vlachos Department of Electrical & Electronic Engineering School of \nMathematics Photonics Communication Systems and Networks Research output: Chapter in \nBook/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Title -…",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Novel switch architectures",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-01524-3_6",
            "Abstract": "In this paper we discussed different switch architectures. We focus mainly on optical buffering. We investigate an all-optical buffer architecture comprising of cascaded stages of quantum-dot semiconductor optical amplifier- based tunable wavelength converters, at 160 Gb/s. We also propose the optical buffer with multi-wavelength converters based on quantum-dot semiconductor optical amplifiers. We present multistage switching fabrics with optical buffers, where optical buffers are based on fibre delay lines and are located in the first stage. Finally, we describe a photonic asynchronous packet switch and show that the employment of a few optical buffer stages to complement the electronic ones significantly improves the switch performance. We also propose two asynchronous optical packet switching node architectures, where an efficient contention resolution is based on controllable optical buffers and …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:f2IySw72cVMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Attack-aware resource planning and sparse monitor placement in optical networks",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427717302205",
            "Abstract": "This work presents joint optimization algorithms for lightpath establishment as well as sparse placement of optical performance monitoring (OPM) equipment in optical networks. OPMs are necessary to efficiently monitor the impact of physical layer attacks and are usually placed at locations that are more probable to be impacted by jamming attacks. A jamming attack is defined as a harmful signal interference with other signals, leading to service degradation, that is possible through intra-channel or inter-channel crosstalk effects. An Integer Linear Program (ILP) formulation is proposed to solve the problem of attack-aware routing and wavelength assignment (Aa-RWA), jointly with the placement of OPM equipment, in order to minimize the impact of physical layer jamming attacks in optical networks. Moreover, a Genetic Algorithm (GA) is proposed to solve the same optimization problem. The proposed GA algorithm is …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Performance evaluation of overspill routing in optical networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4024557/",
            "Abstract": "We present a detailed performance evaluation of a hybrid optical switching architecture called Overspill Routing in Optical Networks (ORION). The ORION architecture combines wavelength and (electronic) packet switching, so as to obtain the advantages of both switching paradigms. We have developed an extensive network simulator where the basic features of the ORION architecture were modeled, including suitable load-varying sources and edge/core node architectures. Various aspects of the ORION architecture were studied including the routing policies used (i.e. once ORION always ORION and lightpath reentry) and the various options available for the buffer architecture. The complete network study shows that ORION can absorb temporary traffic overloads, as intended, provided sufficient buffering is present.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An optical IM/FSK coding technique for the implementation of a label-controlled arrayed waveguide packet router",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1251089/",
            "Abstract": "In this paper, we present a new concept of optical packet/burst switching suitable for generalized multiprotocol label switched (GMPLS)-based optical networks. In such networks, optical labeled switched paths are being established in a similar way as label-switched paths in MPLS. We use a wavelength label as well as an orthogonally modulated label, with respect to the payload modulation format, and which is encoded using either frequency-shift keying (FSK) or differential phase-shift keying (DPSK). Wavelength is used for switching in the node, whereas the orthogonal label defines the label-switched path. We present both simulation and experimental results to assess transmission performance of the proposed combined modulation scheme. In addition, we propose a suitable optical node architecture that can take advantage of this stacked label concept. Toward this, we use widely tunable wavelength …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PR03: a hybrid NPU architecture",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1353200/",
            "Abstract": "As the telecommunications industry recovers from the severe downturn of recent years, data traffic continues to exhibit a rate of increase that outpaces advances in VLSI technology. Therefore, lowering overall system cost at network processing nodes and maximizing network utilization - hence revenues - remain extremely important objectives. To address these issues, new semiconductor devices called network processing units (NPUs) have emerged. They are optimized to provide programmable processing of protocol data units (PDUs) in networks with diverse requirements while efficiently supporting current and emerging protocols and services. NPUs promise to deliver an ASICs speed with a CPU's programmability, thus augmenting the capacity and features of network nodes that forward and manipulate data traffic. The Programmable Protocol Processor (PRO3) system reduces the overhead incurred by …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A converged optical wireless architecture for mobile backhaul networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6524899/",
            "Abstract": "In this work we propose a new unified PON-RAN architecture for LTE mobile backhaul networks, employing ring-based WDM PONs. The proposed architecture supports dynamic setup of virtual circuits for inter-base station communication, over a dedicated λ LAN  channel. The reservation mechanism is arbitrated by the OLT, which also monitors the traffic imbalances of downstream channels. The proposed architecture also supports load balancing, by dynamically reallocating and sharing the capacity of the downstream wavelengths.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel network processor for security applications in high‐speed data networks",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/bltj.10058",
            "Abstract": "This paper describes the programmable protocol processor (PRO3) architecture, which is capable of supporting advanced security services over high‐speed networks. Security services include such things as a firewall, packet and flow classification, connection‐state handling (i.e., stateful inspection), higher‐layer protocol data unit (PDU) reassembly (i.e., application‐level firewalls), and packet encryption and decryption. The PRO3, which is integrated with a high‐speed line card, attempts to accelerate the performance of the firewall by implementing key functionality in hardware and by optimizing the balance between hardware and software functions. In this way, significant performance enhancements can be achieved, such as making transport control protocol (TCP) and Internet protocol (IP) data transactions secure, and protecting and separating virtual private networks (VPNs) from the external public network …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "20 channels simultaneous oscillation from a semiconductor fibre laser",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1159433/",
            "Abstract": "We report the demonstration of a stable laser source capable of generating up to 20 wavelengths, with a 100 GHz line spacing and linewidth less than 1.25 GHz. In addition the power variation across the most intense oscillating lines was less than 3 dB. The source operates at room temperature and uses an SOA as gain medium, a polarization maintaining fiber based Lyot filter and two nonlinear optical loop mirrors, which form a linear cavity. By using NOLMs as reflectors to form a linear cavity and by using only low loss, fibre components, the end-to-end loss in the cavity is minimised and thus, more channels may oscillate.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiobjective genetic algorithms for solving the impairment-aware routing and wavelength assignment problem",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JOCN-3-1-40",
            "Abstract": "In future transparent (all-optical) WDM networks, the signal quality of transmission (QoT) will degrade due to physical layer impairments. In this paper, we propose two genetic algorithms for solving the static impairment-aware RWA (IA-RWA) problem by accounting for the impact of physical impairments in the optimization process when searching for the optimum routing path and wavelength channel. The first algorithm indirectly considers the physical impairments through the insertion of the path length and the number of common hops in the search process, using classical multiobjective optimization (MOO) strategies. The second algorithm is a single-objective genetic algorithm (GA) that uses the Q factor for the evaluation of the feasibility of the selected RWA solution. The Q factor is used in each iteration of the algorithm in a self-learning mode in order to evaluate the fitness of each solution to the RWA problem and …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:UebtZRa9Y70C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Efficient burst reservation protocol: a hybrid signaling protocol for efficient burst-level reservations and quality-of-service differentiation in optical burst switching networks",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JON-5-3-147",
            "Abstract": "In this paper we present the efficient burst reservation protocol (EBRP) suitable for bufferless optical burst switching (OBS) networks. The EBRP protocol is a two-way reservation scheme that employs timed and in-advance reservation of resources. In the EBRP protocol timed reservations are relaxed, introducing a reservation time duration parameter that is negotiated during call setup phase. This feature allows bursts to reserve resources beyond their actual size to increase their successful forwarding probability and can be used to provide quality-of-service (QoS) differentiation. The EBRP protocol is suitable for OBS networks and can guarantee a low blocking probability for bursts that can tolerate the round-trip delay associated with the two-way reservation. We present the main features of the proposed protocol and describe in detail the timing considerations regarding the call setup phase and the actual …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:lSLTfruPkqcC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Technologies and architectures for broadband Digital Divide elimination",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7998244/",
            "Abstract": "The provision of high speed connectivity to all citizens has been broadly accepted in the developed world, as one of the key elements for growth and innovation. Europe 2020 Strategy underlines the importance of the deployment of new network infrastructure, required for the provision of new innovative services, while in parallel sets ambitious targets in relation to the penetration of high speed broadband connectivity among European Citizens. In this paper, we examine the current situation, if broadband Digital Divide still exists, and propose a new paradigm for interconnecting rural areas and particularly islands complex. A techno-economic model has been developed for exploring the necessity of public aid funding or other cost sharing measure for the deployment of new fiber-optic transport networks.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical Burst Switching",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84882-278-8_4",
            "Abstract": "An all-OPS network architecture displays a very attractive prospect for the future highly flexible optical transport networks. However, due to a variety of technical challenges, there is still a long way to go to accomplish a mature realization of an OPS network that is ready for practical deployments. Optoelectronic packet switching alleviates the implementation difficult to some degree, but a series of technical innovations is still needed in optical signal processing concerning timing and synchronization. In general, OPS is regarded as the long-term solution for high speed optical networks but, in the meanwhile, more feasible network architectures are desired for the efficient transport of highly dynamic and bursty data traffic. This is the case of optical burst switching (OBS).In OBS networks, a special data unit called burst is defined for the transmission of user data. The data burst is generated by aggregating …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "An alternative implementation perspective for the scheduling switch architecture",
            "Publication year": 2005,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-23-2-732",
            "Abstract": "In this paper, a novel configuration is proposed for the implementation of an almost all-optical switch architecture called the scheduling switch,which when combined with appropriate wait-for-reservation or tell-and-go connection and flow control protocols provides lossless communication for traffic that satisfies certain smoothness properties. An all-optical 2 x 2 exchange/bypass (E/B) switch based on the nonlinear operation of a semiconductor optical amplifier (SOA) is considered as the basic building block of the scheduling switch as opposed to active SOA-based space switches that use injection current to switch between ON and OFF states. The experimental demonstration of the optically addressable 2 x 2 E/B, which is summarized for 10-Gb/s data packets as well as synchronous digital hierarchy (SDH)/STM-64 data frames, ensures the feasibility of the proposed configuration at high speeds, with low switching …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey of quality of service differentiation mechanisms for optical burst switching networks",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427709000514",
            "Abstract": "This paper presents an overview of Quality of Service (QoS) differentiation mechanisms proposed for Optical Burst Switching (OBS) networks. OBS has been proposed to couple the benefits of both circuit and packet switching for the “on demand” use of capacity in the future optical Internet. In such a case, QoS support imposes some important challenges before this technology is deployed. This paper takes a broader view on QoS, including QoS differentiation not only at the burst but also at the transport levels for OBS networks. A classification of existing QoS differentiation mechanisms for OBS is given and their efficiency and complexity are comparatively discussed. We provide numerical examples on how QoS differentiation with respect to burst loss rate and transport layer throughput can be achieved in OBS networks.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:4DMP91E08xMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The transition to chip-level optical interconnects",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5465368/",
            "Abstract": "The increasing bandwidth demands of computing chips have spawned significant research into chip-scale photonic interconnects. We review the DARPA-sponsored efforts at the inter- and intra-chip interconnect levels and highlight the key challenges to be addressed.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and performance evaluation of a Programmable Packet Processing Engine (PPE) suitable for high-speed network processors units",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933106001293",
            "Abstract": "In this paper, we present a Programmable Packet Processing Engine suitable for deep header processing in high-speed networking systems. The engine, which has been – fabricated as part of a complete network processor, consists of a typical RISC-CPU, whose register file has been modified in order to support efficient context switching, and two simple special-purpose processing units. The engine can be used in a number of network processing units (NPUs), as an alternative to the typical design practice of employing a large number of simple general purpose processors, or in any other embedded system designed to process mainly network protocols. To assess the performance of the engine, we have profiled typical networking applications and a series of experiments were carried out. Further, we have compared the performance of our processing engine to that of two widely used NPUs and show that our …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:Zph67rFs4hoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Virtual Department on Optical Switching Systems: Yearly VD-S technical report, including collection of published joint papers",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=13706615998570446186&hl=en&oi=scholarr",
            "Abstract": "This report describes the technical work carried out in Work Package WP-VD-S, Virtual Department on Optical Switching systems in the second year of the E-Photon/ONe+ project. The work package has been structured around a number of Joint Activities (JAs). The work spans from simulations of new optical switch architectures (JA1, JA2, JA9, JA13 and JA15) to control algorithms (JA11, JA12 and JA14) and functional building blocks for optical switches (JA3, JA5, JA6, JA8 and JA16). In JA4, a tutorial paper comprising much of the work has been prepared and accepted for publication in a major journal, thereby greatly enhancing the dissemination of the work. Section 3 describes the work carried out, categorized by JA. The JAs and (their participants) are:",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "All-optical signal processing and applications within the esprit project DO_ALL",
            "Publication year": 2005,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-23-2-781",
            "Abstract": "This paper reviews the work performed under the European ESPRIT project DO_ALL (Digital OpticAL Logic modules) spanning from advanced devices (semiconductor optical amplifiers) to all-optical modules (laser sources and gates) and from optical signal processing subsystems (packet clock recovery,optical write/store memory, and linear feedback shift register) to their integration in the application level for the demonstration of nontrivial logic functionality (all-optical bit-error-rate tester and a 2 x 2 exchange-bypass switch). The successful accomplishment of the project's goals has opened the road for the implementation of more complex ultra-high-speed all-optical signal processing circuits that are key elements for the realization of all-optical packet switching networks.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultrafast time-domain technology and its application in all-optical signal processing",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1230164/",
            "Abstract": "In this paper, we review recent advances in ultrafast optical time-domain technology with emphasis on the use in optical packet switching. In this respect, several key building blocks, including high-rate laser sources applicable to any time-division-multiplexing (TDM) application, optical logic circuits for bitwise processing, and clock-recovery circuits for timing synchronization with both synchronous and asynchronous data traffic, are described in detail. The circuits take advantage of the ultrafast nonlinear transfer function of semiconductor-based devices to operate successfully at rates beyond 10 Gb/s. We also demonstrate two more complex circuits-a header extraction unit and an exchange-bypass switch-operating at 10 Gb/s. These two units are key blocks for any general-purpose packet routing/switching application. Finally, we discuss the system perspective of all these modules and propose their possible …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A bandwidth monitoring mechanism enhancing SNMP to record timed resource reservations",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10922-006-9045-6.pdf",
            "Abstract": "The efficient use of resources and the lossless transfer of data bursts in future optical networks requires the accurate knowledge of the available bandwidth for each network link. Such information is important in monitoring congestions and can be used by appropriate load balancing and congestion avoidance mechanisms. In this paper we propose a mechanism for monitoring and subsequently managing bandwidth resources, using the Simple Network Management Protocol (SNMP). In the proposed mechanism, link bandwidth availability is not a scalar parameter, but a function of time that records the future utilization of the link. For every output port, each agent-node maintains a simple data structure in the form of a table that records the utilization profile of that outgoing link. With the addition of new objects in the Management Information Base (MIB) of each agent-node and proper synchronization, SNMP …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:TQgYirikUcIC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "SOA-based multi-wavelength laser sources",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/01468030490459980",
            "Abstract": "  We present recent advances in multi-wavelength, power-equalized laser sources that incorporate a semiconductor optical amplifier (SOA) and simple optical filters, such as Lyot-type and Fabry-Perot, for comb generation. Both linear and ring-cavity configurations are presented, and single-pass optical feedback technique is proposed to improve the performance in terms of the number of simultaneously oscillating lines and output channel power equalization. This technique resulted in a broadened oscillating spectrum of 52 lines spaced at 50 GHz, power-equalized within 0.3 dB. Finally, a simplified version that uses only an uncoated SOA for both gain and comb generation is demonstrated.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:4TOpqqG69KYC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "40 GHz mode-locked SOA fiber ring laser with 20 nm tuning range",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2000-TuR3",
            "Abstract": "High repetition rate, picosecond laser sources are key elements for WDM/OTDM transmission, switching and photonic network systems.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Advanced modulation techniques for high-performance computing optical interconnects",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6373688/",
            "Abstract": "We experimentally assess the performance of a 64 × 64 optical switch fabric used for ns-speed optical cell switching in supercomputer optical interconnects. More specifically, we study four alternative modulation formats and detection schemes, namely, 10-Gb/s nonreturn-to-zero differential phase-shift keying with balanced direct detection, 10-Gb/s polarization division multiplexed (PDM) quadrature phase-shift keying, 40-Gb/s single-polarization 16-ary quadrature amplitude modulation (16QAM), and 80-Gb/s PDM-16QAM, with coherent intradyne detection, in conjunction with an optimized version of the optical shared memory supercomputer interconnect system switch fabric. In particular, we investigate the resilience of the aforementioned advanced modulation formats to the nonlinearities of semiconductor optical amplifiers, used as ON/OFF gates in the supercomputer optical switch fabric under study. In addition …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Processing and scheduling components in an innovative network processor architecture",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1183136/",
            "Abstract": "In this paper, we describe the architecture of an innovative network processor aiming at the acceleration of packet processing in high speed network interfaces and at the tight coupling of low and high level protocols. The proposed design uses programmable hard-wired components with line rate throughput and is capable of executing protocols and handling efficiently high and low level streaming operations. We discuss the details of the main innovation of the proposed design, which incorporates a three stage RISC-based pipelined module and a composite scheduling unit for internal resource management and outgoing traffic shaping. When both components are integrated on the same platform then maximum and fair utilization of the available resources is achieved. Quantitative performance results are given, both by means of microcode profiling and simulation for indicative applications of the protocol processor.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "160 Gbps simulation of a quantum dot semiconductor optical amplifier based optical buffer",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72731-6_13",
            "Abstract": "We demonstrate the applicability of quantum-dot semiconductor-optical-amplifier based wavelength converters to the implementation of an ultra-high speed optical packet switching buffer. The buffer architecture consists of cascaded programmable delay stages that fully utilize the available wavelengths and thus minimize the number of wavelength converters that are required to implement the buffer. Physical layer simulations demonstrate error-free operation of the buffer with 3 cascaded Time-Slot-Interchager (TSI) stages at 160 Gbps in the 1.55um window.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A non-competing hybrid optical burst switch architecture for QoS differentiation",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427707000458",
            "Abstract": "In this paper, we present a new hybrid optical burst switch architecture (HOBS) that takes advantage of the pre-transmission idle time during lightpath establishment. In dynamic circuit switching (wavelength routing) networks, capacity is immediately hard-reserved upon the arrival of a setup message at a node, but it is used at least a round-trip time delay later. This waste of resources is significant in optical multi-gigabit networks and can be used to transmit traffic of a lower class of service in a non-competing way. The proposed hybrid OBS architecture, takes advantage of this idle time to transmit one-way optical bursts of a lower class of service, while high priority data explicitly requests and establishes end-to-end lightpaths. In the proposed scheme, the two control planes (two-way and one-way OBS reservation) are merged, in the sense that each SETUP message, used for the two-way lightpath establishment, is …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:mB3voiENLucC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Guiding and birefringent properties of a hybrid PDMS/silica photonic crystal fiber",
            "Publication year": 2011,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/7914/791427/Guiding-and-birefringent-properties-of-a-hybrid-PDMS-silica-photonic/10.1117/12.874158.short",
            "Abstract": "In this work, we demonstrate a highly birefringent (Hi-Bi) photonic crystal fiber (PCF) infiltrated with PDMS elastomer in order to enhance the sensitivity of the fiber to external temperature variations. Index guiding mechanism of the new PDMS/Silica structure and birefringent properties were investigated numerically and experimentally. We investigated the temperature dependance of birefringence from 20-120°C. For the particular design of Hi-Bi PCF, the cut-off operating wavelength of the hybrid fiber was found to be around 750 nm. We also experimentally demonstrate the effect of the elastomer inclusions to the polarization of the fiber. The sensitivity of the PDMS/Silica Hi-Bi fiber was found to be ~ 0.37 rad/K/cm for temperatures ranging from 20 to 80°C. The total length of the hybrid PCF examined was about 1.4 cm.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:NMxIlDl6LWMC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "We4. P. 083 ARTEMIS: A New Architecture for All-Optical Asynchronous Self-Routing Network with Efficient Contention Protection and QoS Differentiation",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=17316561758959322960&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "London; Institution of Electrical Engineers; 1999"
        },
        {
            "Title": "Performance evaluation of a Reconfigurable Optical Add Drop Multiplexer design for high-order regular and offset-QAM signals",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8473580/",
            "Abstract": "In this paper, we investigate the performance of a Reconfigurable Optical Add Drop Multiplexer (ROADM) architecture, that is suitable of supporting high-order regular as well as offset based QAM signals. In the proposed design, a bank of Phase Sensitive Amplification (PSA) subsystems is introduced for processing offset QAM signals, while sub-channel extraction is achieved via waveform splitting and coherent subtraction. Numerical studies have been carried out to validate functional performance, when processing high-order regular and offset based QAM signals.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient and low-cost input/output subsystem for network processors",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/30794237/10.1.1.60.2374.pdf",
            "Abstract": "We present the architecture and implementation of an input/output subsystem for a cost-effective network processor. We believe that adding processing power to a networking chip is relatively straightforward. However, transferring data to and from the processor (s) is insufficient for high wire speeds. To address this limitation we use a hardwired input/output subsystem transferring data directly into the processing core’s register file. Using a simple scalar RISC core at 200MHz, we are able to sustain state-full inspection firewall processing at 2.5 Gbps TCP traffic.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A service-transparent and self-organized optical network architecture",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5198669/",
            "Abstract": "In this paper, a new service oriented networking paradigm is presented, where network nodes (peers) are self- organized into individual service entities. The key idea relies on the overlay approach, where there exists a virtual service plane, fragmented into self-organized and self-managed entities called islands of service transparency. The islands are formed in an upstream, ad-hoc mode from the non-networking resources (i.e VoD, grid server, etc) towards all ingress routers of the network, using link state advertisements and multi-cost path selection algorithms (i.e residual bandwidth, server capacity, storage, etc). Organization and re-organization of nodes around non-network resources is transparent to end-users, and thus any request within a specific service island is transparently routed to the island's resource for execution. A service proxy is commissioned to resolve service addresses and service attributes to …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Chalcogenide glass layers in silica photonic crystal fibers",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-20-14-14814",
            "Abstract": "We report a novel approach for deposition of amorphous chalcogenide glass films inside the cylindrical air channels of photonic crystal fiber (PCF). In particular, we demonstrate the formation of nanocolloidal solution-based As_2S_3 films inside the air channels of PCFs of different glass-solvent concentrations for two fibers with cladding-hole diameter 3.5 and 1.3μm. Scanning electron microscopy is used to observe the formed chalcogenide layers and Raman scattering is employed to verify the existence and the structural features of the amorphous As_2S_3 layers. Optical transmission measurements reveal strong photonic bandgaps over a range covering visible and near-infrared wavelengths. The transmittance spectra and the corresponding losses were recorded in the wavelength range 500–1750 nm. The main advantage of the proposed technique is the simplicity of the deposition of amorphous chalcogenide …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Photonics in switching: Architectures, systems and enabling technologies",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138912860800087X",
            "Abstract": "This paper describes recent research activities and results in the area of photonic switching carried out within the Virtual Department on Switching (VDS) of the European e-Photon/ONe Network of Excellence. Contributions from outstanding European research groups in this field are collected to offer a platform for future research in optical switching. The paper contains the main topics related to network scenarios, switch architectures and experiments, with an effort to investigate synergies and challenging opportunities for collaboration and integration of research expertise in the field.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:5nxA0vEk-isC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Hardware accelerated impairment aware control plane",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2010-OWM3",
            "Abstract": "This paper presents a hardware accelerated QoT estimation tool used in the DICONET impairment-aware optical network. Performance evaluation is given by examining different network scenarios in terms of network size and number of wavelengths.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Advanced Architectures for PON Supporting Fi-Wi Convergence",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-42822-2_9.pdf",
            "Abstract": "The phenomenal growth of mobile backhaul capacity required to support the emerging mobile traffic including cellular Long-Term Evolution (LTE), and LTE-Advanced (LTE-A) requires rapid migration from today’s legacy circuit-switched T1/E1 wireline and microwave backhaul technologies to a new fiber-supported, all-packet-based mobile backhaul infrastructure. Mobile backhaul is utilized to backhaul traffic from individual base stations (BSs) to the radio network controller (RNC), which then connects to the mobile operator’s core network or gateway. Many carriers around the world are considering the potential of utilizing the fiber-based passive optical network (PON) access infrastructure as an all-packet-based converged fixed-mobile optical access networking transport architecture to backhaul both mobile and typical wireline traffic. This chapter details the case for backhauling wireless traffic utilizing an …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:WqliGbK-hY8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Grid optical burst switched networks (GOBS)",
            "Publication year": 2005,
            "Publication url": "https://www.ceid.upatras.gr/webpages/faculty/manos/files/papers/draft-ggf-ghpn-Grid-OBS-1.pdf",
            "Abstract": "Optical networking for the Grid computing is an attractive proposition offering huge amount of affordable bandwidth and global reach of resources [1]. Currently, Grid computing using optical network infrastructure is dedicated to a small number of well known organizations with extremely large jobs (eg large data file transfers between known users or destinations [1]. Due to the static or semi-static nature of this type of Grids, long-lived wavelength paths between clients and Grid resources with centralized job management strategies are usually deployed (Lambda Grids). This type of Grid networking relies on carrier provision of optical network resources while the Grid users have no visibility of the lambda infrastructure. In other words, the Grid user is not able to setup paths over the optical Grid network.As Grid applications evolve, the need for user controlled network infrastructure is apparent in order to support emerging dynamic and interactive services. Examples of such applications may be high resolution home video editing, real-time rendering, highdefinition interactive TV, e-health and immersive interactive learning environments. These applications need infrastructures that makes vast amount of storage and computation resources potentially available to a large number of users. Key for the future evolution of such networks is to determine early on the technologies, protocols, and network architecture that would enable solutions to these requirements.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building wireless metropolitan networks",
            "Publication year": 2010,
            "Publication url": "https://photonics.ceid.upatras.gr/kvlachos/pubs/Building%20Wireless%20Metropolitan%20Networks.pdf",
            "Abstract": "This paper describes the main aspects of building wireless networks, as described by the e-City idea of municipal networks owned and controlled by a central authority versus the anarchic design of open communities using as a case study Patras Wireless Metropolitan Network. The paper points out the important economic aspects that lead to the rigorous development and notates the main issues when using commercial equipment, as in the hot-city project driven by Cisco and the City of Luxemburg. Some discussion is done to point out the main differences among the two case studies, in terms of offered services, network coverage and the impact to the local societies. The important criteria into characterizing each approach is a discussion on the vision, objectives, and the expected benefits to each of the involved parties. Finally, it is evaluated if such an investment is profitable and whether a wISP should deploy such an infrastructure even if the economic criteria propose otherwise. Finally, the paper concludes on how these could lead to further local business development, improving the value of the offered services.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rate multiplication by double-passing Fabry-Perot filtering",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1224610/",
            "Abstract": "We present a new technique for extending the decay time of the impulse response function of a Fabry-Perot filter while simultaneously maintaining a large bandwidth. It involves double passing through the filter and it can be used for the easy multiplication of the repetition rate of optical sources. We apply the concept to a 10-GHz pulse train to demonstrate experimentally the rate quadruplication to 40 GHz.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiple-input-buffer and shared-buffer architectures for optical packet-and burst-switching networks",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-25-6-1379",
            "Abstract": "We present an architecture for implementing optical buffers, based on the feed-forward-buffer concept, that  can truly emulate input queuing and accommodate asynchronous packet and burst operation. The architecture uses  wavelength converters and fixed-length delay lines that are combined to form either a multiple-input buffer or a  shared buffer. Both architectures are modular, allowing the expansion of the buffer at a cost that grows  logarithmically with the buffer depth, where the cost is measured in terms of the number of switching elements, and  wavelength converters are employed. The architectural design also provides a tradeoff between the number of  wavelength converters and their tunability. The buffer architectures proposed are complemented with scheduling  algorithms that can guarantee lossless communication and are evaluated using physical-layer simulations to obtain  their performance in terms …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Weergave van GWH 19 december 2007, nr. 162/2007",
            "Publication year": 2008,
            "Publication url": "https://biblio.ugent.be/publication/430726",
            "Abstract": "Weergave van GWH 19 december 2007, nr. 162/2007 Universiteit Gent Add publications \nLists Sign in Academic Bibliography Search 200 years of publications by Ghent University \nresearchers. Search publications Advanced search Add to list 1.Search results 2.Weergave \nvan GWH 19 december 2007, nr... Weergave van GWH 19 december 2007, nr. 162/2007 \nTom Schepens (UGent) (2008) Vanden Broele > t-lexact rechtspraak > advocaat. 2. Author \nTom Schepens (UGent) Organization Department of Tax law (ceased 1-10-2014) Citation \nCite this BibTeX Metrics Please use this url to cite or link to this publication: http://hdl.handle.net/1854/LU-430726 \nMLA Schepens, Tom. “Weergave Van GWH 19 December 2007, Nr. 162/2007.” Vanden \nBroele > t-lexact rechtspraak > advocaat 2 (2008): n. pag. Print. APA Schepens, T. (2008). \nWeergave van GWH 19 december 2007, nr. 162/2007. Vanden Broele > t-lexact > advocaat…",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "10 simultaneously mode-locked and synchronized channels at 30 GHz from fiber ring laser",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2000-WM45",
            "Abstract": "The introduction of wavelength division multiplexing (WDM) to satisfy the increasing demand in the capacity of optical fiber network systems, has created an intense interest to demonstrate multiwavelength, high bit rate laser sources operating at 1.5 μm [1] and to qualify them in transmission experiments [2, 3]. Multi-wavelength sources have so far been demonstrated using spectrum slicing with LEDs [4], super luminescent diodes [5], amplified spontaneous emission from EDFAs [6] or supercontinuum generation in fiber [7].",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Packet processing acceleration with a 3-stage programmable pipeline engine",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1278315/",
            "Abstract": "In this letter, we present the architecture and implementation of a novel, 3-stage processing engine, suitable for deep packet processing in high-speed networks. The engine, which has been fabricated as part of a network processor, comprises of a typical RISC core and programmable hardware. To assess the performance of the engine, experiments with packets of various lengths have been performed and compared against the IXP1200 network processor. The comparison has revealed that for the case study shown in this letter, the proposed packet-processing engine is up to three times faster. Moreover, the engine is simple to be fabricated, less expensive than the corresponding hardware cores of IXP1200 and can be easily programmed for different networking applications.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient field processing cores in an innovative protocol processor system-on-chip",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1186665/",
            "Abstract": "We present an innovative protocol processor component that combines wire-speed processing for low-level, and best effort processing for higher-level protocols. The component is a System-on-Chip that integrates variable size packet buffering, specialised cores for header and field processing, generic RISC cores and scheduling blocks. We focus on the main innovation, the reprogrammable pipeline module, and discuss its internal architecture, optimised to perform field processing on byte streams, as well as protocol processing on complex data structures. Furthermore, we present how modern and new tools were used in system dimensioning, design, and verification phases. The chip is able to handle up to 512K flows organised in individual queues. It embeds 5 custom cores optimised for field processing, 3 typical RISC cores for packet processing and 11 generic and application specific hardware blocks. It's …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Relaxing delayed reservations: An approach for quality of service differentiation in optical burst switching networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4374364/",
            "Abstract": "In this paper we present a signaling protocol for QoS differentiation suitable for optical burst switching networks. The proposed protocol is a two-way reservation scheme that employs delayed and in-advance reservation of resources. In this scheme delayed reservations may be relaxed, introducing a reservation duration parameter that is negotiated during call setup phase. This feature allows bursts to reserve resources beyond their actual size to increase their successful forwarding probability and is used to provide QoS differentiation. The proposed signaling protocol offers a low blocking probability for bursts that can tolerate the round-trip delay required for the reservations. We present the main features of the protocol and describe in detail timing considerations regarding the call setup and the reservation process. We also describe several methods for choosing the protocol parameters so as to optimize …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of a SOA-based rack-to-rack switch for optical interconnects exploiting NRZ-DPSK",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=eceoc-2012-P3.05",
            "Abstract": "We experimentally study the transmission performance of 10-Gb/s NRZ-DPSK through concatenated AWG MUX/DMUXs and SOAs employed in an optimized 64× 64 optical supercomputer interconnect architecture. NRZ-DPSK offers 9-dB higher dynamic range compared to conventional IM/DD.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optical FSK transmitter using widely tunable GCSR lasers",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1312247/",
            "Abstract": "This paper, presents the tunable optical FSK transmitter a suitable encoding technique for transmitting label data in an IP/GMPLS data-switched optical network, using a grating-assisted coupler sampled reflector (GCSR) InGaAsP/InP laser. It is concluded that with the right reflector and phase current settings, a symmetrical FSK detuning for 32 ITU channels can be achieved and can be used for optical labeling of packets in a packet-switched network.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SLIP-IN Architecture: A new Hybrid Optical Switching Scheme",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4374366/",
            "Abstract": "In this paper, we present a new hybrid switching architecture, termed as SLIP-IN, that combines electronic packet/burst with optical circuit switching. SLIP-IN architecture takes advantages of the pre-transmission idle periods of optical lightpaths and slips into them packets or bursts of packets. In optical circuit switching (wavelength-routing) networks, capacity is immediately hard-reserved upon the arrival of a setup message, but is only used after a round-trip time delay. This idle period is significant for optical multi-gigabit networks and can be used to transmit traffic of a lower class of service. In this paper, we present the main features and dependencies of the proposed hybrid switching architecture, and further we perform a detailed evaluation by conducting network wide simulation experiments on the NSFnet backbone topology. For this purpose, we have developed an extensive network simulator, where the basic …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Virtual Department on Optical Switching Systems VD-S–report on the e-Photon/ONe+ viewpoint on optical and electro/optic switching systems, including list of key issues",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=16324608836906900201&hl=en&oi=scholarr",
            "Abstract": "Recent technology development has unlocked most of the fiber capacity making capacity an abundant resource. However, the majority of WDM (Wavelength Division Multiplexing) deployment has occurred in the form of point-to-point links with amplifiers in between if needed. Optical WDM lightpaths are static and are seen as a scarce resource. Once set up, they remain in place, essentially forever. Therefore, switching is only to transforms the raw bit rates into useful bandwidth. The prime objective of this deliverable is to provide the viewpoint on optical and electro/optic switching systems of Virtual Department on Optical Switching Systems. Within these directions, VDS must craft R&D directions and define the position of photonic switching in future optical networks. R&D actions must be aligned with current technologies and system perspectives for the future Internet.The questions the VDS must answer are how and …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Timing control implications for widely tunable lasers in stacked optical labelling",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1133914/",
            "Abstract": "By a time-resolved spectrum technique, the wavelength switching speed of a sampled-grating DBR laser has been investigated and in particular their statistical distributions have implications for stacked optical labelling intended for IP packet routing.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A TCP-specific traffic profiling and prediction scheme for performance optimization in OBS networks",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-3-12-924",
            "Abstract": "The efficient transmission of transport control protocol (TCP) traffic over optical burst-switched (OBS) networks is a challenging problem, due to the high sensitivity of the TCP congestion control mechanism to losses. In this paper, a TCP-specific traffic profiling and traffic prediction scheme is proposed, for optimizing TCP transmission over one-way OBS networks. In the proposed scheme, the burst assembly unit inspects TCP packet headers in parallel to the assembly process, keeping flow-level traffic statistics. These are then exploited to derive accurate traffic predictions, in at least one round trip time prediction window. This allows traffic schedulers to be notified of upcoming traffic changes in advance, in order to optimally reschedule their resource reservations. In this paper, we detail the traffic profiling and prediction mechanism and also provide analytical and simulation results to assess its performance. The …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Emulating lossless, one-way signaling protocols in OBS networks with traffic prediction",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4578404/",
            "Abstract": "In this paper, we propose a new scheme for on demand reservation of capacity in OBS networks, emulating one-way signaling protocols. The proposed framework relies on the combination of a two-way reservation protocol and a burst assembly scheme with a burstification delay enforced to be the round-trip-time and which incorporates a Least Mean Square filter to predict burst length. Upon the arrival of the first packet in the burst queue, a control packet (setup message) is generated and transmitted to reserve resources, based on the prediction filter. In this way the reservation process starts/ends simultaneously with the burst assembly process. In this paper, we present the main features of the proposed scheme, evaluate its performance for both homogeneous and non-homogeneous traffic and we further propose an extension with aggressive over-provisioning of resources that can guarantee lossless operation …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sub-channel add/drop multiplexing in offset-QAM OFDM signals",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8751275/",
            "Abstract": "We investigate the performance of an all-optical Reconfigurable Optical Add Drop Multiplexer (ROADM) architecture, that is suitable of supporting high-order regular as well as offset based QAM signals. In the proposed design, a bank of Phase Sensitive Amplifiers (PSAs) is introduced for processing offset QAM signals, while sub-channel extraction is achieved via waveform splitting and coherent subtraction. Successful performance is demonstrated for up to 32-QAM signals.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Indirect crosstalk-aware routing and wavelength assignment in transparent optical networks with the use of Genetic Algorithms",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7550355/",
            "Abstract": "In transparent optical networks it is critical to consider the impact of the crosstalk effect on the routing and wavelength assignment (RWA) process, in order to limit the impact of jamming attacks on the network, as well as the increased cost arising from the need for high port isolation in optical nodes. In this paper, we propose the use of a Genetic Algorithm (GA) that solves the RWA problem with the objective to minimize the in-band and out-of-band crosstalk interactions. The proposed GA algorithm is compared to an Integer Linear Program (ILP) formulation with the same objective as well as to a traditional RWA that has as an objective the minimization of the number of wavelengths used. Thus, the proposed approach can be compared with both the lower and upper bounds of crosstalk interactions. Simulation results indicate that the proposed GA algorithm provides a solution that is close to the solution of the ILP in …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:SdhP9T11ey4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical Switch Fabrics (OSFs) and Thier Application",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-84882-278-8_6",
            "Abstract": "The structure of this chapter is the following: First we present some key performance indicators of optical switch components, which allows us to understand and compare the different optical switch technologies that are presented in the next chapter. Then, different applications of optical switches are described focusing on the two main network elements that are used in optical networks, namely optical cross connects (OXC) and optical add/drop multiplexers (OADM). Special attention is also given to the protection switching, an attribute that is the most important factor for the provided quality of service. Based on the provided material the reader should be able to understand simple and well as complex optical network topologies based on OXC and OADM nodes.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Guiding and thermal properties of a hybrid polymer-infused photonic crystal fiber",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ome-2-7-929",
            "Abstract": "In this work, we investigate the guiding properties of a hybrid polymer (poly-dimethylsiloxane)/silica photonic crystal fiber (PCF). In particular, we demonstrate how the basic guiding properties of a conventional PCF are changed due to the infusion of poly-dimethylsiloxane (PDMS) in its air-holes. We show that PDMS infiltration allows tuning of single mode operation, confinement loss, effective modal area (EMA) and numerical aperture (NA) with wavelength and/or temperature. This is primarily due to the enhancement of evanescent field interaction, lending some important characteristics for designing tunable fiber devices. Numerical calculations were performed for different relative hole sizes, d/Λ (0.35-0.75), of PCF for a 500-1700nm wavelength and 0-100°C temperature range, whereas direct comparison with a conventional air-filled PCF is also shown.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A TCP prediction scheme for enhancing performance in OBS networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962751/",
            "Abstract": "The efficient transmission of TCP traffic over OBS networks is a challenging problem, due to the high sensitivity of TCP congestion control mechanism to losses. In this paper, a traffic prediction scheme is proposed that exploits TCP traffic dynamics to optimize the performance of TCP transmission over OBS networks. Due to the TCP flow control mechanism, traffic dynamics can be accurately predicted in at least one RTT-long prediction window. In the proposed scheme, the prediction process is tightly coupled with the burst assembly process since the edge node is capable of inspecting incoming TCP traffic, keeping traffic statistics in parallel to the assembly process. These statistics are then used for traffic predictions. In this way burst size can be predicted and thus in advance reserve the appropriate resources. In this paper, we detail the traffic prediction mechanism and we also provide simulation results to assess its …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Research in optical burst switching within the e-Photon/ONe network of excellence",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427706000555",
            "Abstract": "This paper presents a summary of Optical Burst Switching (OBS) research within the VI framework program e-Photon/ONe network of excellence. The paper includes network aspects such as routing techniques, resilience and contention resolution, together with burst switch architectures. On the other hand, we also discuss traffic analysis issues, Quality of Service (QoS) schemes, TCP/IP over OBS and physical layer aspects for OBS.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Profiling TCP traffic in optical burst switching networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30376-0_22",
            "Abstract": "The efficient transmission of TCP traffic over OBS networks is a challenging problem, due to the high sensitivity of TCP congestion control mechanism to losses. In this paper, a traffic profiling scheme is proposed for gathering TCP flow statistics, which are used to estimate steady-state performance of TCP traffic over OBS networks. The burst assembly unit, in parallel to the assembly process, can inspect TCP traffic, keeping traffic statistics that can be used for throughput estimations. In this paper, we detail the traffic profiling and estimation mechanism and also provide analytical and simulation results to assess its performance.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Optical-logic-gate aided packet-switching in transparent optical networks",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-26-16-2848",
            "Abstract": "The objective of this research is to propose two new optical procedures for packet routing and forwarding in the framework of transparent optical networks. The single-wavelength label-recognition and packet-forwarding unit, which represents the central physical constituent of the switching node, is fully described in both cases. The first architecture is a hybrid opto-electronic structure relying on an optical serial-to- parallel converter designed to slow down the label processing. The remaining switching operations are done electronically. The routing system remains transparent for the packet payloads. The second architecture is an all-optical architecture and is based on the implementation of all-optical decoding of the parallelized label. The packet-forwarding operations are done optically. The major subsystems required in both of the proposed architectures are described on the basis of nonlinear effects in …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Method and apparatus for receiving frequency modulated signals on an intensity modulated optical carrier",
            "Publication year": 2010,
            "Publication url": "https://patents.google.com/patent/US7650081B2/en",
            "Abstract": "The present invention provides a method and an FSK/IM receiver to solve the problem of burst-mode detection of frequency modulated labels on an ASK (or IM) payload. In accordance with one embodiment of the present invention, two FSK tones of an input FSK/IM optical signal are separated and communicated to a balanced detector. At the balanced detector, the two FSK tones are subtracted from each other and result in an AC-coupled data stream. The AC-coupled data stream is communicated to a Schmitt-trigger where the hysteresis of the Schmitt-trigger finally eliminates any residual ASK (or IM) payload in the recovered output data. The present invention provides both single channel and WDM solutions.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ultrafast nonlinear interferometer (UNI)-based digital optical circuits and their use in packet switching",
            "Publication year": 2003,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-21-11-2629",
            "Abstract": "Digital optical logic circuits capable of performing bit-wise signal processing are critical building blocks for the realization of future high-speed packet-switched networks. In this paper, we present recent advances in all-optical processing circuits and examine the potential of their integration into a system environment. On this concept, we demonstrate serial all-optical Boolean AND/XOR logic at 20 Gb/s and a novel all-optical packet clock recovery circuit, with low capturing time, suitable for burst-mode traffic. The circuits use the semiconductor-based ultrafast nonlinear interferometer (UNI) as the nonlinear switching element. We also present the integration of these circuits in a more complex unit that performs header and payload separation from short synchronous data packets at 10 Gb/s. Finally, we discuss a method to realize a novel packet scheduling switch architecture, which guarantees lossless communication …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analyzing traffic across the Greek school network",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541520/",
            "Abstract": "In this paper, we present a comprehensive traffic analysis of the Greek School Network (GSN), a wide area network designed to provide Internet access and services to about 15,000 units of primary and secondary education schools and administration offices. In our analysis, we have used measurements from the PATRAS region node obtained through the Cisco NetFlow and FlowScan tools. We have used classical analysis to obtain protocol and application traffic statistics. Our study revealed that TCP traffic is dominant in the network, while nearly 50% of the outgoing and 37% of the incoming traffic is peer-to-peer (P2P) traffic, with a further 25.6% of traffic using not registered ports and suspected to be P2P as well. Finally, we have also observed a remarkable traffic locality phenomenon in the P2P services, where more than the 90% of the traffic was heading or generated by 50 hosts",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "30 Gbps, broadly tunable, all-optical, clock recovery circuit",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/868571/",
            "Abstract": "Optical clock recovery is demonstrated up to 30 Gbps, with very low modulation pattern even for long series of consecutive 0's. The circuit uses all-optical gain modulation of a SOA in a fiber ring laser.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of an optically interconnected\" scheduling\" switch network for Pareto traffic",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jon-3-11-760",
            "Abstract": "Feature Issue on Optical Interconnection Networks (OIN)  A performance analysis of an optically interconnected packet-scheduling switch network is presented. The scheduling switch uses a branch of feed-forward delays for each input port, interconnected with elementary optical switches to resolve contention. The scheduling switch is guaranteed to be lossless under a certain smoothness property condition. We investigate the packet-loss performance of the switch when the smoothness property condition does not hold, as well as the packet delay impairments at the edge of a scheduling switch interconnected network when this property is enforced.Feature Issue on Optical Interconnection Networks (OIN)",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:blknAaTinKkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A new burst assembly scheme based on the average packet delay and its performance for TCP traffic",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427707000240",
            "Abstract": "We propose and evaluate a new burst assembly algorithm based on the average delay of the packets comprising a burst. This method fixes the average delay of the packets belonging to an assembled burst to a desired value T AVE that may be different for each forwarding equivalence class (FEC). We show that the proposed method significantly improves the delay jitter experienced by the packets during the burst assembly process, when compared to that of timer-based and burst length-based assembly policies. Minimizing packet delay jitter is important in a number of applications, such as real-audio and streaming-video applications. We also find that the improvement in the packet delay jitter yields a corresponding significant improvement in the performance of TCP, whose operation depends critically on the ability to obtain accurate estimates of the round-trip times (RTT).",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multi-wavelength oscillation of an uncoated SOA-based fiber ring laser",
            "Publication year": 2003,
            "Publication url": "http://users.auth.gr/npleros/Publications/Conf%20Pubs_pdfs/C.11_Uncoated%20SOA%20laser_CLEOEurope2003.pdf",
            "Abstract": "We present a multiwavelength ring laser source using an uncoated semiconductor optical amplifier (SOA) for providing both gain as well as the comb-like filtering function in the cavity. A SOA-based ring laser source oscillates over a wide bandwidth range due to heterogeneous spectral broadening and the broad gain spectrum of the SOA. Multi-wavelength operation can be obtained by inserting comb-like filters inside the cavity. Fig. 1 (a) shows the relative simple experimental setup used. Gain was provided by a bulk, 500µm long, InGaAsP/InP ridge waveguide SOA (OptoSpeed, SA) with facets tilted at 10oand without AR-coatings. The reflectance of the uncoated facets was calculated to be about 0.3. A polarization controller was incorporated to adjust polarization state and an isolator to ensure unidirectional oscillation in the ring cavity. Output was obtained via a 50: 50 fused fiber coupler. The total length of the cavity was 11, 45m corresponding to a fundamental ring frequency of 16.9 MHz. The oscillating spectrum was defined by the Fabry-Perot modes of the uncoated SOA whose free spectral range was 65GHz. At the output of the ring laser a 1.5 mm SOA was used for amplification and a fiber Fabry-Perot for individual channel isolation and detection in an optical or electrical spectrum analyzer. Multi-wavelength operation is possible even by using the reflection coated SOA alone considered as a linear, 500 um long, cavity, providing lasing lines determined by the Fabry-Perot modes that experience the highest gain. However, due to gain compression caused by the extreme low cavity losses, its performance as a multiwavelength source is …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Self-organized, Service-Oriented GMPLS Optical Network Testbed",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35576-9_31",
            "Abstract": "In this paper, we detail the implementation of a self-organized GMPLS network using the DRAGON software suite to introduce service awareness in a GMPLS network. DRAGON daemon has been extended to support anycast routing to allow forwarding user (service) requests to the most suitable servers based on their advertised service attributes. Furthermore, OSPF daemon has been also extended to allow for these advertisements to propagate through the network and modify shortest paths based on these service attributes that can be network (i.e. bandwidth, delay etc) and non-network (storage capacity, CPU units, availability etc) resources.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "23-channel with 100-GHZ spacing multi-wavelength laser source",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/journalIssue/Download?downloadType=journal%20article&urlId=10.1117%2F1.1536184&isResultClick=True",
            "Abstract": "Simultaneous oscillation of 23 wavelengths, spaced at 100 GHz, is demonstrated from a stable semiconductor optical amplifier source. The wavelength comb is generated from a fiber Lyot filter and each wavelength has 12.5-",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:uLbwQdceFCQC",
            "Publisher": "SPIE-THE INT SOC FOR OPTICAL ENGINEERING"
        },
        {
            "Title": "Optical Burst Switching",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/optical-burst-switching/16878",
            "Abstract": "Switching in core optical networks is currently being performed using high-speed electronic or all-optical circuit switches. Switching with high-speed electronics requires optical-to-electronic (O/E) conversion of the data stream, making the switch a potential bottleneck of the network: any effort (including parallelization) for electronics to approach the optical speeds seems to be already reaching its practical limits. Furthermore, the store-and-forward approach of packet-switching does not seem suitable for all-optical implementation due to the lack of practical optical Random-Access-Memories to buffer and resolve contentions. Circuit switching on the other hand, involves a pre-transmission delay for call setup and requires the aggregation of microflows into circuits, sacrificing the granularity and the control over individual flows, and is inefficient for bursty traffic. Optical burst switching (OBS) has been proposed by Qiao, C …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Multiple-Input and Shared Buffer Architectures for Asynchronous Optical Burst Switching Networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4289054/",
            "Abstract": "In this paper, we present the architectural design of optical burst-buffers that can truly emulate input queuing and accommodate asynchronous burst operation. The architectural design uses wavelength converters and fixed feed-forward delay lines that are combined to form either a multiple-input buffer or a shared buffer. Both schemes are modular, allowing the logarithmic expansion of buffer size with the number of switching elements (wavelength converters).",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Jitter-based analysis and discussion of burst assembly algorithms",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4374331/",
            "Abstract": "This work provides a jitter analysis of size-based burst assembly algorithms and also discusses other burst assembly algorithms that use the packet delay as the assembly threshold to provide a bound on jitter.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance assessment of an optimized optical supercomputer interconnect architecture",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2011-JWA086",
            "Abstract": "We investigate the performance of an optimized optical supercomputer interconnect architecture using a minimum number of on-off gates. A 64× 64 optical interconnection is demonstrated using 10 Gb/s IM/DD and 2.5 GBd coherent PDM/QPSK optical links.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:hMod-77fHWUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "50 channel and 50 GHz multi-wavelength laser source",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/989690/",
            "Abstract": "Simultaneous oscillation of 50 wavelengths, spaced at 50 GHz, is demonstrated from a stable Fabry-Perot ring laser source that uses two semiconductor optical amplifiers. Power variation between channels is less than 1.6 dB.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Influence of transmission impairments on the OSMOSIS HPC optical interconnect architecture",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6009152/",
            "Abstract": "We examine the impact of transmission impairments on the performance of the optical supercomputer interconnect architecture, initially proposed in the context of the optical shared memory supercomputer interconnect system (OSMOSIS) project. We study two versions of the aforementioned optical interconnect that differ in terms of the number of semiconductor optical amplifiers (SOAs) used as ON-OFF gates. For practical reasons related to packet arbitration, the size of the crossbar switch of the optical interconnect in this study is limited to 64 ports. The switch is based on a broadcast-and-select architecture and employs DWDM in conjunction with 10 Gb/s intensity modulation/direct detection per wavelength channel. We show, both by experiment and by simulation, that the minimization of the number of SOAs in the optical switch by taking advantage of the cyclic routing capability of optical arrayed waveguide …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Impact of the financial crisis to the penetration of broadband networks and services within EU",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Spyros-Polykalas/publication/308686146_Impact_of_the_financial_crisis_to_the_penetration_of_broadband_networks_and_services_within_EU/links/57ecd31808ae92a5dbd085ba/Impact-of-the-financial-crisis-to-the-penetration-of-broadband-networks-and-services-within-EU.pdf",
            "Abstract": "The countries of the European Union are facing one of the worst financial and economic crises of the recent history. The crisis impacts several social–economic indicators with multiple effects on societies. At the same time the adoption of Information and Communication Technologies within the European Union presents significant increase, even within the period of the crisis. Although there are several studies deal with the implication of the crisis, only few of them are analyzing the implications of the financial and economic crisis to the growth rate of broadband networks and services. The scope of this paper is to explore the correlation, if any, between the impacts of the financial crisis and the penetration of broadband services as well as the coverage of broadband networks both of the fixed and mobile sectors. The analysis is mainly based on the examination of several quantitative indicators relevant to broadband penetration over the period of crisis. The findings of this paper strongly indicate that on one hand there is no correlation between the impacts of the crisis and the growth of fixed broadband services penetration and broadband fixed and mobile networks coverage. On the contrary it seems that the financial crisis slowed up the penetration of mobile broadband service penetration.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Peer review is a fundamental aspect of maintaining high editorial standards for journals. Our reviewers provide helpful comments to authors of all manuscripts, and their critical assessment is invaluable for the editors when selecting the papers for publication in Optical Switching and Networking. The members of the Editorial Board express their appreciation to the following individuals who have generously volunteered their time to review manuscripts during 2009. Our apologies and thanks to any reviewer whose name may",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=1645443669715345778&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Window-based burst assembly scheme for TCP traffic over OBS",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JON-7-5-487",
            "Abstract": "The impact of burstification delay on the transmission control protocol traffic statistics is presented as well as a new assembly scheme that uses flow window size as the threshold criterion. It is shown that short assembly times are ideally suitable for sources with small congestion windows, allowing for a speedup in their transmission. In addition, large assembly times do not yield any throughput gain, despite the large number of segments per burst transmitted, but result in a low throughput variation, and thus a higher notion of fairness among the individual flows. To this end we propose a new burst assembly scheme that dynamically assigns flows to different assembly queues with different assembly timers, based on their instant window size. Results show that the proposed scheme with different timers provides a higher average throughput together with a smaller variance, which is a good compromise for bandwidth …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:_kc_bZDykSQC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Numerical Modeling of a High Repetition Rate Fiber Laser, Mode—Locked by External Optical Modulation of a Semiconductor Optical Amplifier",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35410-1_5",
            "Abstract": "A theoretical study of a high repetition rate laser source based on a novel mode — locking technique is presented. This technique relies on the fast saturation and recovery of a semiconductor optical amplifier induced by an external optical pulse and has been used to obtain 4.3 ps pulses at 20 GHz. A numerical model of the fiber ring laser has been developed describing the mode — locking process in the laser oscillator and providing solutions for the steady — state mode — locked pulse profile. The critical parameters of the system are defined and analyzed and their impact on the formation of the mode — locked pulses is examined. The comparison between the theoretical results and the experimental data reveals very good agreement and has allowed the optimization of the performance of the system in terms of these parameters.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "IP for 3G, Networking Technologies for Mobile Communications [Book Review]",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1244920/",
            "Abstract": "The fourth chapter is about multimedia support and session management. First, the concept of session management is introduced. The chapter focuses mainly on the control plane functions of session management, whereas the data plane functions are left to be elaborated on in detail in the sixth chapter. The concept of the virtual home environment (VHE) is given, which, forms one of the major requirements of next-generation mobile systems. Authors then review control plane session management protocols: H. 323 and Session Initiation Protocol (SIP). More is given to SIP, since it is included in the next generation of UMTS standards as the major session management protocol. The fifth chapter reviews a major problem in IP for 3G: mobility management. Other key issues of IP such as QoS, IPv6, and session management have always been subject to preceding studies, since those protocols have already been …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TCP traffic analysis for timer-based burstifiers in OBS networks",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72731-6_20",
            "Abstract": "The purpose of this paper is to assess the impact of timer-based burst assembly algorithms for TCP traffic. We present an analysis for short, medium and long assembly times and investigate segment and flow distribution over the assembled bursts. Further, we also analyze their impact on the congestion window evolution and on the effective throughput achieved. It has been found out that short assembly times are ideally suitable for sources with small congestion windows, allowing for a speed up, while large assembly times yield a lower throughput variation among the individual assembled flows. For long assembly times, the transfer of more segments from the same source is trading off the increase of the burstification delay but no throughput gain is obtained. However, large assembly times smooth out individual flow performance and provide a significant lower variation of throughput. To this end, in this …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Physical architectures for packet-switching network nodes based on nonlinear logic gates",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4610753/",
            "Abstract": "Two new architectures are proposed for designing physical network nodes in packet-switched structures. They allow transparent optical packet networking and are based on the association of various subsystems, which have previously been proposed, and demonstrated. These elements are mainly based on the application of nonlinear behavior in semiconductor optical amplifiers.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Formation of PDMS films inside the holes of silica photonic crystal fibers",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8426/842604/Formation-of-PDMS-films-inside-the-holes-of-silica-photonic/10.1117/12.922682.short",
            "Abstract": "In this work, we demonstrate the formation of Poly-dimethylsiloxane (PDMS) films inside the holes of conventional silica photonic crystal fiber. The index guiding properties of the new PDMS-layer/Silica structures were investigated and optimized numerically using FDTD analysis. Films with thicknesses ranging from 100nm to 1μm were formed using different PDMS solution concentrations and different solution movement speeds. The thickness of films was very uniform along almost all the deposition length as indicated by Scanning Electron Microscopy (SEM) images and micro- Raman mapping.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:uWQEDVKXjbEC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Virtual Department on Optical Switching Systems VD-S–Yearly VD-S technical report, including collection of published joint papers",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=9965773905639107775&hl=en&oi=scholarr",
            "Abstract": "This document is the second deliverable for the Virtual Department of Optical Switching Sysytems, within the network of excellence e-Photon/ONe+. VD-S has been organized around joint activities proposed by partners after having identifies the key research issues in the field. Partners proposed eleven joint activities and three joint experimens. These activites involved mobility actions, joint experimental work, simulation studies targeting a specific journal or conferece for disseminating the results. The list of the joint activities and experiments presented in this report follows.▪ Optical Switching Architectures",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "30 Gb/s all-optical clock recovery circuit",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/849091/",
            "Abstract": "All-optical clock recovery is demonstrated from pseudo-data patterns at 30 Gb/s. The circuit is based on the optical gain modulation of a semiconductor optical amplifier fiber laser. The recovered clock is a 2.7-ps pulse train, with very low modulation pattern even in the presence of more than 200 consecutive 0's in the data signal.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hybrid signaling protocol for enhancing performance of OBS networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5753383/",
            "Abstract": "A new hybrid signaling scheme is proposed in this work, that combines a two-way with an one-way reservation protocol. The key idea is to synchronize the assembly process with the reservation and hard reserve part of the end-to-end path in two way mode, for a duration equal to the burst assembly time. In this way, upon the arrival of the first packet in the assembly queue, the two-way reservation part of the signaling scheme may start simultaneously. Upon the completion of the burst assembly process, burst transmission may start immediately since the path has been successfully established for a certain number of hops. The framework that we propose benefits from the parallel execution of the signaling messages and the assembly process, and exploits the burstification delay to guarantee burst transmission for at least a part of the network path.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Burstification effect on the TCP synchronization and congestion window mechanism",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4550400/",
            "Abstract": "In this paper, we study the burstification effect on the TCP synchronization and TCP congestion window mechanism. It is shown that short assembly times are optimal for flows with similar characteristics, while large assembly time provide a higher notion of fairness. In addition, this paper analyzes the synchronization of multiple TCP flows when aggregated together over the same optical bursts. It is shown that there is a strong TCP synchronization effect upon burst losses, in the sense that flows’ windows increase/decrease simultaneously, resulting to a significant variation of outgoing traffic. These deficiencies may be dealt with employing a multi-queue burst assembly scheme with different timers and taking into account the TCP dynamics.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Photonics in switching: enabling technologies and subsystem design",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jon-8-5-404",
            "Abstract": "This paper describes recent research activities and results in the area of photonic switching carried out within the framework of the EU-funded e-Photon/ONe+ network of excellence, Virtual Department on Optical Switching. Technology aspects of photonics in switching and, in particular, recent advances in wavelength conversion, ring resonators, and packet switching and processing subsystems are presented as the building blocks for the implementation of a high-performance router for the next-generation Internet.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:0EnyYjriUFMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Partial power recovery of bend-induced loss using a hybrid index-guiding photonic crystal fiber",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_europe-2011-CE_P33",
            "Abstract": "Photonic crystal fibers are typically all-silica optical fibers in which a pattern of air-holes running along their entire length [1]. Such fibers allow for the introduction of polymers (and other active materials such as liquid crystals, high index fluids, etc.) into the air regions yielding hybrid polymer/silica waveguides that allow enhanced tunability of guiding properties due to the strong temperature dependence of the polymer refractive index [2, 3]. In this work, we present a solid-core endlessly single mode (ESM) PCF infiltrated with PDMS elastomer conserving index-guiding mechanism. PDMS (poly-dimethylsiloxane) is a polymeric widely used material in optoelectronics (particularly in opto/microfluidics) with refractive index lower than silica (around 1.41). Normally, the temperature dependence of the refractive index is described by the thermo-optic coefficient dn/dT (− 4.5/C for PDMS-Sylgard 184), which quantifies the shift …",
            "Abstract entirety": 0,
            "Author pub id": "dwzqmcQAAAAJ:WbkHhVStYXYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "On the use of multi-objective optimization algorithms for solving the impairment aware-RWA problem",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5199271/",
            "Abstract": "In future transparent optical networks, it is important to consider the impact of physical impairments in the routing and wavelengths assignment process, to achieve efficient connection provisioning. In this paper, we use classical multi-objective optimization (MOO) strategies and particularly genetic algorithms to jointly solve the impairment aware RWA (IA-RWA) problem. Fiber impairments are indirectly considered through the insertion of the path length and the number of common hops in the optimization process. It is shown that blocking is greatly improved, while the obtained solutions truly converge towards the Pareto front that constitutes the set of global optimum solutions. We have evaluated our findings, using an Q estimator tool, that calculates the signal quality of each path analytically.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Direct Bragg grating writing in a hybrid PDMS/Silica photonic crystal fiber",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO/Europe-2011-CE9_3",
            "Abstract": "Infiltration of materials into the air holes of the PCFs can potentially manipulate their optical properties creating a new category of fibers termed as hybrid PCFs [1] and many devices based on hybrid PCFs have been developed [2-5]. Recently, a hybrid PCF with poly-dimethylsiloxane (PDMS) elastomer inclusions has been demonstrated [6]. PDMS is widely used in the area of photonics and optofluidics. It is highly transparent with a refractive index~ 1.41, conserving the total internal reflection guiding mechanism of the hybrid PCF. When PDMS is irradiated with UV light its refractive index increases [7]. In this paper we present the first example of a Bragg grating directly written using UV light on the PDMS inclusions of a conventional silica PCF.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "An integrated view on monitoring and compensation for dynamic optical networks: from management to physical layer",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11107-008-0183-5",
            "Abstract": "A vertical perspective, ranging from management and routing to physical layer options, concerning dynamic network monitoring and compensation of impairments (M&C), is given. Feasibility, reliability, and performance improvements on reconfigurable transparent networks are expected to arise from the consolidated assessment of network management and control specifications, as a more accurate evaluation of available M&C techniques. In the network layer, physical parameters aware algorithms are foreseen to pursue reliable network performance. In the physical layer, some new M&C methods were developed and rating of the state-of-the-art reported in literature is given. Optical monitoring implementation and viability is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A virtual one-way signaling protocol with aggressive resource reservation for improving burst transmission delay",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4840469/",
            "Abstract": "In this paper, we propose a new scheme for the on demand use of capacity in OBS networks, combining a two-way reservation protocol and an assembly scheme process that incorporates an aggressive and forward resource reservation mechanism. The key idea is to tune the assembly timer to be equal to the time associated with the establishment of the end-to-end connection (round-trip-time) and, thus, synchronize the resource reservation with the assembly process. In this way, upon the arrival of the first packet in the queue, reservation of resources may start simultaneously based on an aggressive prediction of the burst length.",
            "Abstract entirety": 1,
            "Author pub id": "dwzqmcQAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        }
    ]
}]