[{
    "name": "Κωνσταντίνος Τσίχλας",
    "romanize name": "Konstantinos Tsichlas",
    "School-Department": "Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής",
    "University": "upatras",
    "Rank": "Επίκουρος Καθηγητής (Μόνιμος)",
    "Apella_id": 22141,
    "Scholar name": "Kostas Tsichlas",
    "Scholar id": "-KUXfxsAAAAJ",
    "Affiliation": "Dept. of Computer Engineering & Informatics, University of Patras",
    "Citedby": 901,
    "Interests": [
        "data structures",
        "algorithms",
        "computational geometry",
        "network analysis",
        "natural algorithms"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=-KUXfxsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Dynamic Processing of Dominating Queries with Performance Guarantees.",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.650.2071&rep=rep1&type=pdf",
            "Abstract": "The top-k dominating query returns the k database objects with the highest score with respect to their dominance score. The dominance score of an object p is simply the number of objects dominated by p, based on minimization or maximization preferences on the attribute values. Each object (tuple) is represented as a point in a multidimensional space, and therefore, the number of attributes equals the number of dimensions. The top-k dominating query combines the dominance concept of skyline queries with the ranking function of top-k queries and can be used as an important tool in multi-criteria decision making systems. In this work, we focus on the 2-dimensional space and present, for the first time, novel algorithms for top-k dominating query processing in main memory with non-trivial asymptotic guarantees. In particular, we focus on both the semi-dynamic case (only insertions are allowed) and the fully-dynamic case (insertions and deletions are supported). We perform a detailed cost analysis regarding the worst-case complexity of preprocessing, the worst-case complexity for the query cost and the worst-case and amortized complexity for updates (insertions and deletions) focusing on the RAM computation model. Our solutions require space linear with the number of points, which is very important especially for modern applications which manipulate massive datasets. In addition, we discuss the case of the word-RAM computation model, where slightly better results are obtained.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virus propagation in multiple profile networks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2783258.2783386",
            "Abstract": "Suppose we have a virus or one competing idea/product that propagates over a multiple profile (eg, social) network. Can we predict what proportion of the network will actually get\" infected\"(eg, spread the idea or buy the competing product), when the nodes of the network appear to have different sensitivity based on their profile? For example, if there are two profiles A and B in a network and the nodes of profile A and profile B are susceptible to a highly spreading virus with probabilities β A and β B respectively, what percentage of both profiles will actually get infected from the virus at the end? To reverse the question, what are the necessary conditions so that a predefined percentage of the network is infected? We assume that nodes of different profiles can infect one another and we prove that under realistic conditions, apart from the weak profile (great sensitivity), the stronger profile (low sensitivity) will get infected …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An experimental performance comparison for indexing mobile objects on the plane",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1643823.1643863",
            "Abstract": "We present a time-efficient approach to index objects moving on the plane to efficiently answer range queries about their future positions. Each object is moving with non small velocity u, meaning that the velocity value distribution is skewed (Zipf) towards u min in some range [u min, u max], where u min is a positive lower threshold. Our algorithm enhances a previously described solution [18] by accommodating the ISB-tree access method as presented in [6]. Experimental evaluation shows the improved performance, scalability and efficiency of the new algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Motif extraction from weighted sequences",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30213-1_41",
            "Abstract": "We present in this paper three algorithms. The first extracts repeated motifs from a weighted sequence. The motifs correspond to words which occur at least q times and with hamming distance e in a weighted sequence with probability ≥ 1/k each time, where k is a small constant. The second algorithm extracts common motifs from a set of N ≥ 2 weighted sequences with hamming distance e. In the second case, the motifs must occur twice with probability ≥ 1/k, in 1 ≤ q ≤ N distinct sequences of the set. The third algorithm extracts maximal pairs from a weighted sequence. A pair in a sequence is the occurrence of the same substring twice. In addition, the algorithms presented in this paper improve slightly on previous work on these problems.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Space-Optimal Hidden Surface Removal Algorithm for Iso-Oriented Rectangles",
            "Publication year": 2020,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0129054120500240",
            "Abstract": "We investigate the problem of finding the visible pieces of a scene of objects from a specified viewpoint. In particular, we are interested in the design of an efficient hidden surface removal algorithm for a scene comprised of iso-oriented rectangles. We propose an algorithm where given a set of  iso-oriented rectangles we report all visible surfaces in  time and linear space, where  is the number of surfaces reported. The previous best result by Bern [Journal of Computer and System Sciences  40 (1990) 49–69], has the same time complexity but uses  space.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:a0OBvERweLwC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Querying functional brain connectomics to discover consistent subgraph patterns",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701655/",
            "Abstract": "Dynamic recordings of functional activity maps can naturally and efficiently be represented in the form of functional/effective connectivity networks. New methods for mapping synaptic connections and recording neural signals generate rich and complex data about the structure and dynamics of brain networks. To study the most complex network in nature, the brain, there is need to integrate a huge amount of brain networks collected from laboratories over the world in large databases. Human Brain Project (Europe and USA) aims to explore brain functionality in various ways. Brain networks are central to achieving the goals of this ambitious plan. However, the immense amount of thousands of brain networks, prevent an easy way to utilizable knowledge. In this paper, we demonstrate a data-driven approach that discovers consistent patterns from a collection of brain networks via a querying approach: formulating a …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "NEFOS: rapid cache-aware range query processing with probabilistic guarantees",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-23088-2_5",
            "Abstract": "We present NEFOS (NEsted FOrest of balanced treeS), a new cache-aware indexing scheme that supports insertions and deletions in O(1) worst-case block transfers for rebalancing operations (given and update position) and searching in O(log B  logn) expected block transfers, (B= disk block size and n= number of stored elements). The expected search bound holds with high probability for any (unknown) realistic input distribution. Our expected search bound constitutes an improvement over the O(log B  logn) expected bound for search achieved by the ISB-tree (Interpolation Search B-tree), since the latter holds with high probability for the class of smooth only input distributions. We define any unknown distribution as realistic if the smoothness doesn’t appear in the whole data set, still it may appear locally in small spatial neighborhoods. This holds for a variety of real …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "ISB-tree: A new indexing scheme with efficient expected behaviour",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11602613_33",
            "Abstract": "We present the interpolation search tree (ISB-tree), a new cache-aware indexing scheme that supports update operations (insertions and deletions) in O(1) worst-case (w.c.) block transfers and search operations in O(log B  log n) expected block transfers, where B represents the disk block size and n denotes the number of stored elements. The expected search bound holds with high probability for a large class of (unknown) input distributions. The w.c. search bound of our indexing scheme is O(log B  n) block transfers. Our update and expected search bounds constitute a considerable improvement over the O(log B  n) w.c. block transfer bounds for search and update operations achieved by the B-tree and its numerous variants. This is also suggested by a set of preliminary experiments we have carried out. Our indexing …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Efficient and flexible algorithms for monitoring distance-based outliers over data streams",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437915001349",
            "Abstract": "Anomaly detection is considered an important data mining task, aiming at the discovery of elements (known as outliers) that show significant diversion from the expected case. More specifically, given a set of objects the problem is to return the suspicious objects that deviate significantly from the typical behavior. As in the case of clustering, the application of different criteria leads to different definitions for an outlier. In this work, we focus on distance-based outliers: an object x is an outlier if there are less than k objects lying at distance at most R from x. The problem offers significant challenges when a stream-based environment is considered, where data arrive continuously and outliers must be detected on-the-fly. There are a few research works studying the problem of continuous outlier detection. However, none of these proposals meets the requirements of modern stream-based applications for the following …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:blknAaTinKkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Improved bounds for finger search on a RAM",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39658-1_31",
            "Abstract": "We present a new finger search tree with O(1) worst-case update time and O(log log d) expected search time with high probability in the Random Access Machine (RAM) model of computation for a large class of input distributions. The parameter d represents the number of elements (distance) between the search element and an element pointed to by a finger, in a finger search tree that stores n elements. For the need of the analysis we model the updates by a “balls and bins” combinatorial game that is interesting in its own right as it involves insertions and deletions of balls according to an unknown distribution.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "I/o-efficient dynamic planar range skyline queries",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1207.2341",
            "Abstract": "We present the first fully dynamic worst case I/O-efficient data structures that support planar orthogonal \\textit{3-sided range skyline reporting queries} in $\\bigO (\\log_{2B^\\epsilon} n + \\frac{t}{B^{1-\\epsilon}})$ I/Os and updates in $\\bigO (\\log_{2B^\\epsilon} n)$ I/Os, using $\\bigO (\\frac{n}{B^{1-\\epsilon}})$ blocks of space, for  input planar points,  reported points, and parameter . We obtain the result by extending Sundar's priority queues with attrition to support the operations \\textsc{DeleteMin} and \\textsc{CatenateAndAttrite} in $\\bigO (1)$ worst case I/Os, and in $\\bigO(1/B)$ amortized I/Os given that a constant number of blocks is already loaded in main memory. Finally, we show that any pointer-based static data structure that supports \\textit{dominated maxima reporting queries}, namely the difficult special case of 4-sided skyline queries, in $\\bigO(\\log^{\\bigO(1)}n +t)$ worst case time must occupy  space, by adapting a similar lower bounding argument for planar 4-sided range reporting queries.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Canonical polygon queries on the plane: A new approach",
            "Publication year": 2008,
            "Publication url": "https://arxiv.org/abs/0805.2681",
            "Abstract": "The polygon retrieval problem on points is the problem of preprocessing a set of  points on the plane, so that given a polygon query, the subset of points lying inside it can be reported efficiently. It is of great interest in areas such as Computer Graphics, CAD applications, Spatial Databases and GIS developing tasks. In this paper we study the problem of canonical -vertex polygon queries on the plane. A canonical -vertex polygon query always meets the following specific property: a point retrieval query can be transformed into a linear number (with respect to the number of vertices) of point retrievals for orthogonal objects such as rectangles and triangles (throughout this work we call a triangle orthogonal iff two of its edges are axis-parallel). We present two new algorithms for this problem. The first one requires  space and  query time. A simple modification scheme on first algorithm lead us to a second solution, which consumes  space and  query time, where  denotes the size of the answer and  is the number of vertices. The best previous solution for the general polygon retrieval problem uses  space and answers a query in  time, where  is the number of vertices. It is also very complicated and difficult to be implemented in a standard imperative programming language such as C or C++.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ART: sub-logarithmic decentralized range query processing with probabilistic guarantees",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10619-012-7112-4?awc=5570_1395827928_25a9f33eb2b4ad334492e846d62d3182;",
            "Abstract": "We focus on range query processing on large-scale, typically distributed infrastructures, such as clouds of thousands of nodes of shared-datacenters, of p2p distributed overlays, etc. In such distributed environments, efficient range query processing is the key for managing the distributed data sets per se, and for monitoring the infrastructure’s resources. We wish to develop an architecture that can support range queries in such large-scale decentralized environments and can scale in terms of the number of nodes as well as in terms of the data items stored. Of course, in the last few years there have been a number of solutions (mostly from researchers in the p2p domain) for designing such large-scale systems. However, these are inadequate for our purposes, since at the envisaged scales the classic logarithmic complexity (for point queries) is still too expensive while for range queries it is even more disappointing. In this …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Threshold-based Network Structural Dynamics",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-79527-6_8",
            "Abstract": "The interest in dynamic processes on networks is steadily rising in recent years. In this paper, we consider the-Thresholded Network Dynamics (-Dynamics), where, in which only structural dynamics (dynamics of the network) are allowed, guided by local thresholding rules executed by each node. In particular, in each discrete round t, each pair of nodes u and v that are allowed to communicate by the scheduler, computes a value(the potential of the pair) as a function of the local structure of the network at round t around the two nodes. If then the link (if it exists) between u and v is removed; if then an existing link among u and v is maintained; if then a link between u and v is established if not already present.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:abG-DnoFyZgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Investigation of Database Models for Evolving Graphs",
            "Publication year": 2021,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2021/14782/",
            "Abstract": "We deal with the efficient implementation of storage models for time-varying graphs. To this end, we present an improved approach for the HiNode vertex-centric model based on MongoDB. This approach, apart from its inherent space optimality, exhibits significant improvements in global query execution times, which is the most challenging query type for entity-centric approaches. Not only significant speedups are achieved but more expensive queries can be executed as well, when compared to an implementation based on Cassandra due to the capability to exploit indices to a larger extent and benefit from in-database query processing.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:dshw04ExmUIC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "HiNode: an asymptotically space-optimal storage model for historical queries on graphs",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10619-017-7207-z",
            "Abstract": "Most modern networks are perpetually evolving and can be modeled by graph data structures. By collecting and indexing the state of a graph at various time instances we are able to perform queries on its entire history and thus gain insight into its fundamental features and attributes. This calls for advanced solutions for graph history storing and indexing that are capable of supporting application queries efficiently while coping with the aggravated space requirements. To this end, we advocate a purely vertex-centric storage model that is asymptotically space-optimal and more space efficient than any other proposal to date. In addition to space efficiency, the model’s purely vertex-centric approach shows great promise with respect to the efficiency and functionality of update and query operations. Furthermore, we make a qualitative comparison with other general methods for graph history storage identifying the pros …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Approximate string matching with gaps",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Athanasios-Tsakalidis/publication/2862306_Approximate_String_Matching_with_Gaps/links/0deec526fa84167ee5000000/Approximate-String-Matching-with-Gaps.pdf",
            "Abstract": "In this paper we consider several new versions of approximate string matching with gaps. The main characteristic of these new versions is the existence of gaps in the matching of a given pattern in a text. Algorithms are devised for each version and their time and space complexities are stated. These specific versions of approximate string matching have various applications in computerized music analysis.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Correction to: Virus propagation: threshold conditions for multiple profile networks",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-018-1277-8",
            "Abstract": "In the original publication, part figures were incorrectly positioned in Figure 2. The correct figure is given below.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Computation of repetitions and regularities of biologically weighted sequences",
            "Publication year": 2006,
            "Publication url": "https://www.liebertpub.com/doi/abs/10.1089/cmb.2006.13.1214",
            "Abstract": "      Biological weighted sequences are used extensively in molecular biology as profiles for protein families, in the representation of binding sites and often for the representation of sequences produced by a shotgun sequencing strategy. In this paper, we address three fundamental problems in the area of biologically weighted sequences: (i) computation of repetitions, (ii) pattern matching, and (iii) computation of regularities. Our algorithms can be used as basic building blocks for more sophisticated algorithms applied on weighted sequences.     ",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Mary Ann Liebert, Inc."
        },
        {
            "Title": "Continuous outlier detection in data streams: an extensible framework and state-of-the-art algorithms",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2463676.2463691",
            "Abstract": "Anomaly detection is an important data mining task, aiming at the discovery of elements that show significant diversion from the expected behavior; such elements are termed as outliers. One of the most widely employed criteria for determining whether an element is an outlier is based on the number of neighboring elements within a fixed distance (R), against a fixed threshold (k). Such outliers are referred to as distance-based outliers and are the focus of this work. In this demo, we show both an extendible framework for outlier detection algorithms and specific outlier detection algorithms for the demanding case where outlier detection is continuously performed over a data stream. More specifically: i) first we demonstrate a novel flavor of an open-source publicly available tool for Massive Online Analysis (MOA) that is endowed with capabilities to encapsulate algorithms that continuously detect outliers and ii) second …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel distributed p2p simulator architecture: D-p2p-sim",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1645953.1646305",
            "Abstract": "In this paper we introduce a novel distributed simulation environment with GUI for P2P simulations (D-P2P-Sim). The key aim is to provide the appropriate integrated set of tools in a single software solution to evaluate the performance of various protocols. The basic architecture of the distributed P2P simulator is based on a multi-threading, asynchronous, message passing and distributed environment with graphical user interface to facilitate ease of use by both researchers and programmers.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D3-Tree: A Dynamic Deterministic Decentralized Structure",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-48350-3_82",
            "Abstract": "We present D 3-Tree, a dynamic deterministic structure for data management in decentralized networks, by engineering and further extending an existing decentralized structure. D 3-Tree achieves O(logN) worst-case search cost (N is the number of nodes in the network), O(logN) amortized load-balancing cost, and it is highly fault-tolerant. A particular strength of D 3-Tree is that it achieves O(logN) amortized search cost under massive node failures. We conduct an extensive experimental study verifying that D 3-Tree outperforms other well-known structures and that it achieves a significant success rate in element queries in case of massive node failures.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "New dynamic balanced search trees with worst-case constant update time",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/998223.998229",
            "Abstract": "We present new search trees with worst-case O(1) update time and O(log n) search time, storing n elements in linear space, in the Pointer Machine (PM) model of computation. In addition, these trees can easily support finger searches in time O(log d) and update operations in worst-case O(log* n) time. The parameter d represents the number of elements (distance) between the search element and an element pointed to by a pointer termed finger. Our data structure is based on a previous result by Fleischer that exhibits the same asymptotic time and space complexities for simple search trees. We improve on this result by handling deletions in an explicit way without using the standard trick of global rebuilding. This is the first search tree that combines worst-case update times with a local rebalancing scheme without using global rebuilding to tackle deletions. In addition, insight is acquired from the construction of …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:0EnyYjriUFMC",
            "Publisher": "Otto-von-Guericke-Universitat"
        },
        {
            "Title": "Algorithms for extracting motifs from biological weighted sequences",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570866706000384",
            "Abstract": "In this paper we present three algorithms for the Motif Identification Problem in Biological Weighted Sequences. The first algorithm extracts repeated motifs from a biological weighted sequence. The motifs correspond to repetitive words which are approximately equal, under a Hamming distance, with probability of occurrence⩾ 1/k, where k is a small constant. The second algorithm extracts common motifs from a set of N⩾ 2 weighted sequences. In this case, the motifs consists of words that must occur with probability⩾ 1/k, in 1⩽ q⩽ N distinct sequences of the set. The third algorithm extracts maximal pairs from a biological weighted sequence. A pair in a sequence is the occurrence of the same word twice. In addition, the algorithms presented in this paper improve previous work on these problems.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Dynamic Top- Dominating Queries",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1305.2835",
            "Abstract": "Let  be a dataset of  2-dimensional points. The top- dominating query aims to report the  points that dominate the most points in . A point  dominates a point  iff all coordinates of  are smaller than or equal to those of  and at least one of them is strictly smaller. The top- dominating query combines the dominance concept of maxima queries with the ranking function of top- queries and can be used as an important tool in multi-criteria decision making systems. In this work, we propose novel algorithms for answering semi-dynamic (insertions only) and fully dynamic (insertions and deletions) top- dominating queries. To the best of our knowledge, this is the first work towards handling (semi-)dynamic top- dominating queries that offers algorithms with asymptotic guarantees regarding their time and space cost.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scheduling algorithms for procrastinators",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s10951-007-0038-4",
            "Abstract": " This paper presents scheduling algorithms for procrastinators, where the speed that a procrastinator executes a job increases as the due date approaches. We give optimal off-line scheduling policies for linearly increasing speed functions. We then explain the computational/numerical issues involved in implementing this policy. We next explore the online setting, showing that there exist adversaries that force any online scheduling policy to miss due dates. This impossibility result motivates the problem of minimizing the maximum interval stretch of any job; the interval stretch of a job is the job’s flow time divided by the job’s due date minus release time. We show that several common scheduling strategies, including the “hit-the-highest-nail” strategy beloved by procrastinators, have arbitrarily large maximum interval stretch. Then we give the “thrashing” scheduling policy and show that it is a Θ(1 …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Practical algorithms for execution engine selection in data flows",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X14002453",
            "Abstract": "Data-intensive flows are increasingly encountered in various settings, including business intelligence and scientific scenarios. At the same time, flow technology is evolving. Instead of resorting to monolithic solutions, current approaches tend to employ multiple execution engines, such as Hadoop clusters, traditional DBMSs, and stand-alone tools. We target the problem of allocating flow activities to specific heterogeneous and interdependent execution engines while minimizing the flow execution cost. To date, the state-of-the-art is limited to simple heuristics. Although the problem is intractable, we propose practical anytime solutions that are capable of outperforming those simple heuristics and yielding allocation plans in seconds even when optimizing large flows on ordinary machines. Moreover, we prove the NP-hardness of the problem in the generic case and we propose an exact polynomial solution for a …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:k_IJM867U9cC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Access Methods.",
            "Publication year": 2014,
            "Publication url": "https://datalab-old.csd.auth.gr/~gounaris/2014accessmethods.pdf",
            "Abstract": "We are witnessing a tremendous growth in the size of the data gathered, stored and processed by various kinds of information systems. Therefore, no matter how big memories become, there is always the need to store data in",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "I/O-efficient 2-d orthogonal range skyline and attrition priority queues",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925772120300833",
            "Abstract": "We present the first static and dynamic external memory data structures for variants of 2-d orthogonal range skyline reporting with worst-case logarithmic query and update I/O-complexity. The results are obtained by using persistent data structures and by extending the attrition priorities queues of Sundar (1989) [26] to also support real-time concatenation, a result of independent interest. We show that the problem is as hard as standard 2-d orthogonal range reporting in the indexability model by a lower bound on the I/O-complexity of 2-d orthogonal anti-dominance skyline reporting queries.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A New Approach on the Canonical k-vertex Polygon Retrieval Problem on the Plane",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.312.5011&rep=rep1&type=pdf",
            "Abstract": "The polygon retrieval problem on points is the problem of preprocessing a set of n points on the plane, so that given a polygon query, the subset of points lying inside it can be reported efficiently.It is of great interest in areas such as Computer Graphics, CAD applications, Spatial Databases and GIS developing tasks. In this paper we study the problem of canonical k-vertex polygon queries on the plane. A canonical k-vertex polygon query always meets the following specific property: a point retrieval query can be transformed into a linear number (with respect to the number of vertices) of point retrievals for orthogonal objects such as rectangles and triangles (throughout this work we call a triangle orthogonal iff two of its edges are axis-parallel). We present two new algorithms for this problem. The first one requires O (n log2 n) space and O (k log3n",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ISB-tree: A new indexing scheme with efficient expected behaviour",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570866710000304",
            "Abstract": "We present the interpolation search B-tree (ISB-tree), a new cache-aware indexing scheme that supports update operations (insertions and deletions) in O (1) worst-case block transfers and search operations in O (log B log n) expected block transfers, where B represents the disk block size and n denotes the number of stored elements. The expected search bound holds with high probability for a large class of (unknown) input distributions. The worst-case search bound of our indexing scheme is O (log B n) block transfers. Our update and expected search bounds constitute a considerable improvement over the O (log B n) worst-case block transfer bounds for search and update operations achieved by the B-tree and its numerous variants. This is also verified by an accompanying experimental study.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optimal finger search trees in the pointer machine",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022000003000138",
            "Abstract": "We develop a new finger search tree with worst-case constant update time in the pointer machine (PM) model of computation. This was a major problem in the field of Data Structures and was tantalizingly open for over 20 years, while many attempts by researchers were made to solve it. The result comes as a consequence of the innovative mechanism that guides the rebalancing operations, combined with incremental multiple splitting and fusion techniques over nodes.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Continuous monitoring of distance-based outliers over data streams",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5767923/",
            "Abstract": "Anomaly detection is considered an important data mining task, aiming at the discovery of elements (also known as outliers) that show significant diversion from the expected case. More specifically, given a set of objects the problem is to return the suspicious objects that deviate significantly from the typical behavior. As in the case of clustering, the application of different criteria lead to different definitions for an outlier. In this work, we focus on distance-based outliers: an object x is an outlier if there are less than k objects lying at distance at most R from x. The problem offers significant challenges when a stream-based environment is considered, where data arrive continuously and outliers must be detected on-the-fly. There are a few research works studying the problem of continuous outlier detection. However, none of these proposals meets the requirements of modern stream-based applications for the following …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic layers of maxima with applications to dominating queries",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925772120300936",
            "Abstract": "Over the past years there has been an enormous increase in the amount of data generated on a daily basis. A critical task in handling the information overload is locating the most interesting objects of a dataset according to a specific configuration or ranking function. Our work is based on the concept of dominance which compares data objects based on maximization preferences on the attribute values. Each data object is represented as a point in a multidimensional space based on its attribute values. The layers of maxima configuration assigns layer numbers to dataset points so that (some) points inside a layer dominate (some) points in subsequent layers and no point in a layer dominates another in the same layer. Furthermore, top-k dominating queries combine the merits of skyline (maxima) queries and top-k queries by returning the k first points with the highest dominance score, where the dominance score of …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Mining uncertain graphs: An overview",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-57045-7_6",
            "Abstract": "Graphs play an important role in modern world, due to their widespread use for modeling, representing and organizing linked data. Taking into consideration that most of the “killer” applications require a graph-based representation (e.g., the Web, social network management, protein-protein interaction networks), efficient query processing and analysis techniques are required, not only because these graphs are massive but also because the operations that must be supported are complex, requiring significant computational resources. In many cases, each graph edge e is annotated by a probability value p(e), expressing its existential uncertainty. This means that with probability p(e) the edge will be present in the graph and with probability  the edge will be absent. This gives rise to the concept of probabilistic graphs (also known as uncertain graphs). Formally, a probabilistic graph  is a triplet (V, E, p …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "2-D Monotone spatial indexing scheme with optimal update time",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/42997412/-D_Monotone_spatial_indexing_scheme_with20160223-29520-1mhbbf5.pdf",
            "Abstract": "For monotone generated points on the plane we present the Dynamic Monotone Priority Search Tree (DMoPST) in main/external memory with O (1) update time/O (1) block transfers in worst-case. The external version of the structure above promises efficient applications in transaction time Databases systems.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic 3-sided planar range queries with expected doubly logarithmic time",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-10631-6_21",
            "Abstract": "We consider the problem of maintaining dynamically a set of points in the plane and supporting range queries of the type [a,b]×( − ∞ , c]. We assume that the inserted points have their x-coordinates drawn from a class of smooth distributions, whereas the y-coordinates are arbitrarily distributed. The points to be deleted are selected uniformly at random among the inserted points. For the RAM model, we present a linear space data structure that supports queries in O(loglogn + t) expected time with high probability and updates in O(loglogn) expected amortized time, where n is the number of points stored and t is the size of the output of the query. For the I/O model we support queries in O(loglog B  n + t/B) expected I/Os with high probability and updates in O(log B  logn) expected amortized I/Os using linear space, where B is the disk block size. The data structures …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Geometric Retrieval for Grid Points in the RAM Model.",
            "Publication year": 2004,
            "Publication url": "http://jucs.org/jucs_10_9/geometric_retrieval_for_grid/Sioutas_S.pdf",
            "Abstract": "We consider the problem of d-dimensional searching (d≥ 3) for four query types: range, partial range, exact match and partial match searching. Let N be the number of points, s be the number of keys specified in a partial match and partial range query and t be the number of points retrieved. We present a data structure with worst case time complexities O (t+ logd− 2 N), O (t+(d− s)+ logs N), O (d+",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D3-Tree: A Dynamic Distributed Deterministic Load-Balancer for decentralized tree structures",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1503.07905",
            "Abstract": "In this work, we propose D3-Tree, a dynamic distributed deterministic structure for data management in decentralized networks. We present in brief the theoretical algorithmic analysis, in which our proposed structure is based on, and we describe thoroughly the key aspects of the implementation. Conducting experiments, we verify that the implemented structure outperforms other well-known hierarchical tree-based structures, since it provides better complexities regarding load-balancing operations. More specifically, the structure achieves a logarithmic amortized bound, using an efficient deterministic load-balancing mechanism, which is general enough to be applied to other hierarchical tree-based structures. Moreover, we investigate the structure's fault tolerance, which hasn't been sufficiently tackled in previous work, both theoretically and through rigorous experimentation. We prove that D3-Tree is highly fault tolerant, since, even for massive node failures, it achieves a significant success rate in element queries. Afterwards we go one step further, in order to achieve sub-logarithmic complexity and propose the ART+ structure (Autonomous Range Tree), exploiting the excellent performance of D3-Tree. ART+ is a fully dynamic and fault-tolerant structure, which achieves sub-logarithmic performance for query and update operations and performs load-balancing in sub-logarithmic amortized cost.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Continuous outlier mining of streaming data in flink",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437920300594",
            "Abstract": "In this work, we focus on distance-based outliers in a metric space, where the status of an entity as to whether it is an outlier is based on the number of other entities in its neighborhood. In recent years, several solutions have tackled the problem of distance-based outliers in data streams, where outliers must be mined continuously as new elements become available. An interesting research problem is to combine the streaming environment with massively parallel systems to provide scalable stream-based algorithms. However, none of the previously proposed techniques refer to a massively parallel setting. Our proposal fills this gap and investigates the challenges in transferring state-of-the-art techniques to Apache Flink, a modern platform for intensive streaming analytics. We thoroughly present the technical challenges encountered and the alternatives that may be applied, of which a micro-clustering-based one is …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "On the discovery of group-consistent graph substructure patterns from brain networks",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165027012004852",
            "Abstract": "Complex networks constitute a recurring issue in the analysis of neuroimaging data. Recently, network motifs have been identified as patterns of interconnections since they appear in a significantly higher number than in randomized networks, in a given ensemble of anatomical or functional connectivity graphs. The current approach for detecting and enumerating motifs in brain networks requires a predetermined motif repertoire and can operate only with motifs of small size (consisting of few nodes).There is a growing interest in methodologies for frequent graph-based pattern mining in large graph datasets that can facilitate adaptive design of motifs. The results presented in this paper are based on the graph-based Substructure pattern mining (gSpan) algorithm and introduce a manifold of ways to exploit it for data-driven motif extraction in connectomics research.Functional connectivity graphs from …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optimal solutions for the temporal precedence problem",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-002-0935-z",
            "Abstract": " Abstract.  In this paper we refer to the Temporal Precedence Problem  on Pure Pointer Machines . This problem asks for the design of a data structure, maintaining a set of stored elements and supporting the following two operations: insert  and precedes . The operation insert (a)  introduces a new element a  in the structure, while the operation  precedes  (a,b)  returns true iff element a  was inserted before element b  temporally. In [11] a solution was provided to the problem with worst-case time complexity O (log log n ) per operation and O(n  log log n)  space, where n  is the number of elements inserted. It was also demonstrated that the precedes  operation has a lower bound of Ω (log log n ) for the Pure Pointer Machine  model of computation. In this paper we present two simple solutions with linear space and worst-case constant insertion time. In addition, we describe two algorithms that can …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Skyline Queries in O (1) time?",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1709.03949",
            "Abstract": "The skyline of a set  of points () consists of the \"best\" points with respect to minimization or maximization of the attribute values. A point  dominates another point  if  is as good as  in all dimensions and it is strictly better than  in at least one dimension. In this work, we focus on the static -d space and provide expected performance guarantees for -sided Range Skyline Queries on the Grid, where  is the cardinality of ,  the size of a disk block, and  the capacity of main memory. We present the MLR-tree, which offers optimal expected cost for finding planar skyline points in a -sided query rectangle, , in both RAM and I/O model on the grid , by single scanning only the points contained in . In particular, it supports skyline queries in a -sided range in  time ( I/Os), where  is the answer size and  the time required for answering predecessor queries for  in a PAM (Predecessor Access Method) structure, which is a special component of MLR-tree and stores efficiently root-to-leaf paths or sub-paths. By choosing PAM structures with  expected time for predecessor queries under discrete -random distributions of the  and  coordinates, MLR-tree supports skyline queries in optimal  expected time ( expected number of I/Os) with high probability. The space cost becomes superlinear and can be reduced to linear for many special practical cases. If we choose a PAM structure with  amortized time for batched predecessor queries (under no assumption on distributions of the  and  coordinates), MLR-tree supports batched skyline queries in optimal  …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Access Methods for Temporal Interval Queries of Video Metadata.",
            "Publication year": 2007,
            "Publication url": "http://jucs.org/jucs_13_10/efficient_access_methods_for/jucs_13_10_1411_1433_sioutas.pdf",
            "Abstract": "Indexing video content is one of the most important problems in video databases. In this paper we present linear time and space algorithms for handling video metadata that represent objects or events present in various frames of the video sequence. To accomplish this, we make a straightforward reduction of this problem to the intersection problem in Computational Geometry. Our first result is an improvement over the one of VS Subrahmanian [Subramanian, 1998] by a logarithmic factor in storage. This is achieved by using different basic data structures. Then, we present two other interesting time-efficient approaches. Finally a reduction to a special geometric problem is considered according to which we can achieve two optimal in time and space solutions in main and external memory model of computation respectively. We also present an extended experimental evaluation.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rectangle enclosure reporting in linear space revisited",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/998223.998230",
            "Abstract": "We present a new algorithm for reporting all the enclosures in a set of plane rectangles in O(n log n log log n + k log log n) time and linear space (k denotes the output size). The result is already known (it has already been achieved by two previous papers), however the proposed algorithm follows a different approach.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:Zph67rFs4hoC",
            "Publisher": "Otto-von-Guericke-Universitat"
        },
        {
            "Title": "On the Convergence of Network Systems",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1902.04121",
            "Abstract": "The apparent disconnection between the microscopic and the macroscopic is a major issue in the understanding of complex systems. To this extend, we study the convergence of repeatedly applying local rules on a network, and touch on the expressive power of this model. We look at network systems and study their behavior when different types of local rules are applied on them. For a very general class of local rules, we prove convergence and provide a certain member of this class that, when applied on a graph, efficiently computes its k-core and its (k-1)-crust giving hints on the expressive power of such a model. Furthermore, we provide guarantees on the speed of convergence for an important subclass of the aforementioned class. We also study more general rules, and show that they do not converge. Our counterexamples resolve an open question of (Zhang, Wang, Wang, Zhou, KDD- 2009) as well, concerning whether a certain process converges. Finally, we show the universality of our network system, by providing a local rule under which it is Turing-Complete.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-objective optimization of data flows in a multi-cloud environment",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2486767.2486769",
            "Abstract": "As cloud-based solutions have become one of the main choices for intensive data analysis both for business decision making and scientific purposes, users face the problem of choosing among different cloud providers. In this work, we deal with data analysis flows that can be split in stages, and each stage can run on multiple cloud infrastructures. For each stage, a cloud provider may make a bid in the form of a continuous function in the time delay-monetary cost domain. The goal is to compute the optimal combination of bids according to how much a user is prepared to pay for the total time delay to execute the analysis task. The contributions of this work are (i) to provide a solution that can be computed in pseudo-polynomial time and with bounded relative error for the generic case;(ii) to provide exact polynomial solutions for specific cases; and (iii) to experimentally evaluate our proposal against other techniques …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hinode: implementing a vertex-centric modelling approach to maintaining historical graph data",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s00607-019-00715-6",
            "Abstract": "Over the past few years, there has been a rapid increase of data originating from evolving networks such as social networks, sensor networks and others. A major challenge that arises when handling such networks and their respective graphs is the ability to issue a historical query on their data, that is, a query that is concerned with the state of the graph at previous time instances. While there has been a number of works that index the historical data in a time-centric manner (i.e. according to the time instance an update event occurs), in this work, we focus on the less-explored vertex-centric storage approach (i.e. according to the entity in which an update event occurs). We demonstrate that the design choices for a vertex-centric model are not trivial, by proposing two different modelling and storage models that leverage NoSQL technology and investigating their tradeoffs. More specifically, we experimentally …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Springer Vienna"
        },
        {
            "Title": "Purely functional worst case constant time catenable sorted lists",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11841036_18",
            "Abstract": "We present a purely functional implementation of search trees that requires O(logn) time for search and update operations and supports the join of two trees in worst case constant time. Hence, we solve an open problem posed by Kaplan and Tarjan as to whether it is possible to envisage a data structure supporting simultaneously the join operation in O(1) time and the search and update operations in O(logn) time.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Dynamic 3-sided planar range queries with expected doubly-logarithmic time",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397514000310",
            "Abstract": "The Priority Search Tree is the classic solution for the problem of dynamic 2-dimensional searching for the orthogonal query range of the form [a, b]×(−∞, c](3-sided rectangle). It supports all operations in logarithmic worst case complexity in both main and external memory. In this work we show that the update and query complexities can be improved to expected doubly-logarithmic, when the input coordinates are being continuously drawn from specific probability distributions. We present three pairs of linear space solutions for the problem, ie a RAM and a corresponding I/O model variant:(1) First, we improve the update complexity to doubly-logarithmic expected with high probability, under the most general assumption that both the x-and y-coordinates of the input points are continuously being drawn from a distribution whose density function is unknown but fixed.(2) Next, we improve both the query …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A new approach on indexing mobile objects on the plane",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X0800092X",
            "Abstract": "We present a set of time-efficient approaches to index objects moving on the plane to efficiently answer range queries about their future positions. Our algorithms are based on previously described solutions as well as on the employment of efficient access methods. Finally, an experimental evaluation is included that shows the performance, scalability and efficiency of our methods.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:YsMSGLbcyi4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A Space-Optimal Hidden Surface Removal Algorithm for Iso-Oriented Rectangles",
            "Publication year": 2011,
            "Publication url": "https://arxiv.org/abs/1109.0389",
            "Abstract": "We investigate the problem of finding the visible pieces of a scene of objects from a specified viewpoint. In particular, we are interested in the design of an efficient hidden surface removal algorithm for a scene comprised of iso-oriented rectangles. We propose an algorithm where given a set of  iso-oriented rectangles we report all visible surfaces in  time and linear space, where  is the number of surfaces reported. The previous best result by Bern, has the same time complexity but uses  space.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of Features Generated by a High-End Low-Cost Electrical Smart Meter",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1328880",
            "Abstract": "The problem of energy disaggregation is the separation of an aggregate energy signal into the consumption of individual appliances in a household. This is useful, since the goal of energy efficiency at the household level can be achieved through energy-saving policies towards changing the behavior of the consumers. This requires as a prerequisite to be able to measure the energy consumption at the appliance level. The purpose of this study is to present some initial results towards this goal by making heavy use of the characteristics of a particular din-rail meter, which is provided by Meazon S.A. Our thinking is that meter-specific energy disaggregation solutions may yield better results than general-purpose methods, especially for sophisticated meters. This meter has a 50 Hz sampling rate over 3 different lines and provides a rather rich set of measurements with respect to the extracted features. In this paper we aim at evaluating the set of features generated by the smart meter. To this end, we use well-known supervised machine learning models and test their effectiveness on certain appliances when selecting specific subsets of features. Three algorithms are used for this purpose: the Decision Tree Classifier, the Random Forest Classifier, and the Multilayer Perceptron Classifier. Our experimental study shows that by using a specific set of features one can enhance the classification performance of these algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "D-P2P-Sim: A Distributed P2P Simulator",
            "Publication year": 2009,
            "Publication url": "https://google-code-archive-downloads.storage.googleapis.com/v2/code.google.com/d-p2p-sim/cikm09_d-p2p-sim.pdf",
            "Abstract": "Cloud computing and social networking applications are designed to operate over billions of data objects and nodes.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Batched Predecessor and Sorting with Size-Priced Information in External Memory",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-61792-9_13",
            "Abstract": "The fundamental problems of sorting and searching, traditionally studied in the unit-cost comparison model, have been generalized to include priced information, where different pairs of items have different comparison costs. These costs can be arbitrary (Charikar et al. STOC 2000), structured (Gupta et al. FOCS 2001), or stochastic (Angelov et al. LATIN 2008). Motivated by the database setting where the comparison cost depends on the sizes of the records, we consider the problems of sorting and batched predecessor where two non-uniform sets of items A and B are given as input. In the RAM model, pairwise comparisons (A-A, A-B and B-B) have respective comparison costs a, b and c. We give upper and lower bounds for the case , which serves as a warmup for the generalization to the external-memory model. In the Disk-Access Model (DAM), where transferring elements between disk and RAM is the …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "                                          D            2 -Tree: A New Overlay with Deterministic Bounds",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-014-9878-4",
            "Abstract": "We present a new overlay, called the Deterministic Decentralized tree (-tree). The -tree compares favorably to other overlays for the following reasons: (a) it provides matching and better complexities, which are deterministic for the supported operations; (b) the management of nodes (peers) and elements are completely decoupled from each other; and (c) an efficient deterministic load-balancing mechanism is presented for the uniform distribution of elements into nodes, while at the same time probabilistic optimal bounds are provided for the congestion of operations at the nodes. The load-balancing scheme of elements into nodes is deterministic and general enough to be applied to other hierarchical tree-based overlays. This load-balancing mechanism is based on an innovative lazy weight-balancing mechanism, which is interesting in its own right.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:GnPB-g6toBAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Fully persistent B-trees",
            "Publication year": 2012,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611973099.51",
            "Abstract": "We present I/O-efficient fully persistent B-Trees that support range searches at any version in O(logB n + t/B) I/Os and updates at any version in O(logB n + log2 B) amortized I/Os, using space O(m/B) disk blocks. By n we denote the number of elements in the accessed version, by m the total number of updates, by t the size of the query's output, and by B the disk block size. The result improves the previous fully persistent B-Trees of Lanka and Mays by a factor of O(logB m) for the range query complexity and O(logB n) for the update complexity. To achieve the result, we first present a new B-Tree implementation that supports searches and updates in O(logB n) I/Os, using O(n/B) blocks of space. Moreover, every update makes in the worst case a constant number of modifications to the data structure. We make these B-Trees fully persistent using an I/O-efficient method for full persistence that is inspired by the node …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "An overview of methods for handling evolving graph sequences",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-29919-8_14",
            "Abstract": "Graph data structures constitute a prominent way to model real-world networks. Most of the graphs originating from these networks are dynamic and constantly evolving. The state (snapshot) of a graph at various time instances forms an evolving graph sequence. By incorporating temporal information in the traditional graph queries, valuable characteristics regarding the nature of a graph can be extracted such as the evolution of the shortest path distance between two vertices through time. Most modern graph processing systems are not suitable for this task since they operate on single very large graphs. In this work we review centralized and distributed methods and solutions proposed towards handling evolving graph sequences.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Mining Uncertain Graphs: An Overview",
            "Publication year": 2017,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=-i2lDgAAQBAJ&oi=fnd&pg=PA87&dq=info:89z6CLdZQPoJ:scholar.google.com&ots=_nnGMsHtOT&sig=N-uC2sbn77sNnPEydnw6b2IlIWs",
            "Abstract": "Graphs play an important role in modern world, due to their widespread use for modeling, representing and organizing linked data. Taking into consideration that most of the “killer” applications require a graph-based representation (eg, the Web, social network management, protein-protein interaction networks), efficient query processing and analysis techniques are required, not only because these graphs are massive but also because the operations that must be supported are complex, requiring significant computational resources. In many cases, each graph edge e is annotated by a probability value p (e), expressing its existential uncertainty. This means that with probability p (e) the edge will be present in the graph and with probability 1− p (e) the edge will be absent. This gives rise to the concept of probabilistic graphs (also known as uncertain graphs). Formally, a probabilistic graph G is a triplet (V, E, p) where V is the set of nodes, E is the set of edges and p: E→(0, 1]. The main challenge posed by this formulation is that problems that are relatively easy to solve in exact graphs become very difficult (or even intractable) in probabilistic graphs. In this paper, we perform an overview of the algorithmic techniques proposed in the literature for uncertain graph analysis. In particular, we center our focus on the following graph mining tasks: clustering, maximal cliques, k-nearest neighbors and core decomposition. We conclude the paper with a short discussion related to distributed mining of uncertain graphs which is expected to achieve significant performance improvements.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Locating maximal multirepeats in multiple strings under various constraints",
            "Publication year": 2007,
            "Publication url": "https://academic.oup.com/comjnl/article-abstract/50/2/178/2568652",
            "Abstract": "             A multirepeat in a string is a substring (factor) that appears a predefined number of times. A multirepeat is maximal if it cannot be extended either to the right or to the left and produce a multirepeat. In this paper, we present algorithms for two different versions of the problem of finding maximal multirepeats in a set of strings. In the case of arbitrary gaps, we propose an algorithm with              O             (             σN2n              +              α             ) time complexity. When the gap is bounded in a small range              c             , we propose an algorithm with              O             ((             c2              +              σ2             )             mN2n              log(             Nn             ) +              α             ) time complexity. Here,              N              is the number of strings,              n              the mean length of each string,              m              the multiplicity of the multirepeat and              α              the number of reported occurrences. Our results extend previous …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Pattern matching on weighted sequences",
            "Publication year": 2004,
            "Publication url": "http://www.eng.ucy.ac.cy/manolisc/papers/weighted-pattern-matching.pdf",
            "Abstract": "Manolis Christodoulakis, Costas S. Iliopoulos, Laurent Mouchard, and Kostas Tsichlas abstract. Weighted sequences are used extensively as profiles for protein families, in the representation of binding sites and often for the representation of sequences produced by a shotgun sequencing strategy. We present various fundamental pattern matching problems on weighted sequences and their respective algorithms. In addition, we define two matching probabilistic measures and we give algorithms for each of these measures. The uncertainty introduced in weighed sequences can also be used as a means to perform approximate string matching. To the best of our knowledge, this is the first time these problems are tackled in this setting.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "King’s College London"
        },
        {
            "Title": "Brief announcement: ART--sub-logarithmic decentralized range query processing with probabilistic guarantees",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1835698.1835728",
            "Abstract": "We focus on range query processing on large-scale, typically distributed infrastructures. In this work we present the ART (Autonomous Range Tree) structure, which outperforms the most popular decentralized structures, including Chord (and some of its successors), BATON (and its successor) and Skip-Graphs. ART supports the join/leave and range query operations in O (log log N) and O (log 2 b logN+| A|) expected whp number of hops respectively, where the base b is a double-exponentially power of two, N is the total number of peers and| A| the answer size.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identifying occurrences of maximal pairs in multiple strings",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45452-7_12",
            "Abstract": "A molecular sequence “model” is a (structured) sequence of distinct or identical strings separated by gaps; here we design and analyze efficient algorithms for variations of the “Model Matching” and “Model Identification” problems.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Reflected min-max heaps",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S002001900200501X",
            "Abstract": "In this paper we present a simple and efficient implementation of a min-max priority queue, reflected min-max priority queues. The main merits of our construction are threefold. First, the space utilization of the reflected min-max heaps is much better than the naive solution of putting two heaps back-to-back. Second, the methods applied in this structure can be easily used to transform ordinary priority queues into min-max priority queues. Third, when considering only the setting of min-max priority queues, we support merging in constant worst-case time which is a clear improvement over the best worst-case bounds achieved by Høyer.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:UebtZRa9Y70C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Longest Common Subsequence on Weighted Sequences",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1901.04068",
            "Abstract": "We consider the general problem of the Longest Common Subsequence (LCS) on weighted sequences. Weighted sequences are an extension of classical strings, where in each position every letter of the alphabet may occur with some probability. Previous results presented a PTAS and noticed that no FPTAS is possible unless P=NP. In this paper we essentially close the gap between upper and lower bounds by improving both. First of all, we provide an EPTAS for bounded alphabets (which is the most natural case), and prove that there does not exist any EPTAS for unbounded alphabets unless FPT=W[1]. Furthermore, under the Exponential Time Hypothesis, we provide a lower bound which shows that no significantly better PTAS can exist for unbounded alphabets. As a side note, we prove that it is sufficient to work with only one threshold in the general variant of the problem.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic interpolation search revisited",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11786986_34",
            "Abstract": "A new dynamic Interpolation Search (IS) data structure is presented that achieves O(loglogn) search time with high probability on unknown continuous or even discrete input distributions with measurable probability of key collisions, including power law and Binomial distributions. No such previous result holds for IS when the probability of key collisions is measurable. Moreover, our data structure exhibits O(1) expected search time with high probability for a wide class of input distributions that contains all those for which o(loglogn) expected search time was previously known.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Improved bounds for finger search on a ram",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-012-9636-4",
            "Abstract": "We present a new finger search tree with O(loglogd) expected search time in the Random Access Machine (RAM) model of computation for a large class of input distributions. The parameter d represents the number of elements (distance) between the search element and an element pointed to by a finger, in a finger search tree that stores n elements. Our data structure improves upon a previous result by Andersson and Mattsson that exhibits expected O(loglogn) search time by incorporating the distance d into the search time complexity, and thus removing the dependence on n. We are also able to show that the search time is O(loglogd+ϕ(n)) with high probability, where ϕ(n) is any slowly growing function of n. For the need of the analysis we model the updates by a “balls and bins” combinatorial game that is interesting in its own right as it involves insertions and deletions of balls according to an unknown …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Dynamic planar range skyline queries in log logarithmic expected time",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020019020300776",
            "Abstract": "The skyline of a set P of points consists of the “best” points with respect to minimization or maximization of the attribute values. A point p dominates another point q if p is as good as q in all dimensions and it is strictly better than q in at least one dimension. In this work, we focus on the 2-d space and provide expected performance guarantees for dynamic (insertions and deletions) 3-sided range skyline queries. We assume that the x and y coordinates of the points are drawn from a class of distributions and present the ML-tree (Modified Layered Range-tree), which attains O (log 2⁡ N log⁡ log⁡ N) expected update time and O (t log⁡ log⁡ N) time with high probability for finding planar skyline points in a 3-sided query rectangle q=[a, b]×[d,+∞) in the RAM model, where N is the cardinality of P and t is the answer size.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "I/o-efficient planar range skyline and attrition priority queues",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2463664.2465225",
            "Abstract": "We study the static and dynamic planar range skyline reporting problem in the external memory model with block size B, under a linear space budget. The problem asks for an O (n/B) space data structure that stores n points in the plane, and supports reporting the k maximal input points (aka skyline) among the points that lie within a given query rectangle Q=[α 1 [α 2]×[β 1 β 2. When Q is 3-sided, ie one of its edges is grounded, two variants arise: top-open for β 2=∞ and left-open for α 1=-∞(symmetrically bottom-open and right-open) queries.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Apostolos N. Papadopoulos",
            "Publication year": 2014,
            "Publication url": "http://delab.csd.auth.gr/papers/AccessMethods2014ptgm.pdf",
            "Abstract": "We are witnessing a tremendous growth in the size of the data gathered, stored, and processed by various kinds of information systems. Therefore, no matter how big memories become, there is always the need to store data in secondary or even tertiary storage to facilitate access. Even if the data set can fit in main memory, there is still a need to organize data to enable efficient processing. In this chapter, we discuss the most important issues related to the design of efficient access methods (ie, indexing schemes), which are the fundamental tools in database systems for efficient query processing. For the rest of the discussion, we are going to use the terms access method and index interchangeably. Take, for example, a large data set containing information about millions of astronomical objects (eg, stars, planets, comets). An astronomer may require some information out of this data set. Therefore, the most natural way to proceed is to store the data set in a database management system (DBMS) in order to enjoy SQL-like query formulation. For example, a possible query in natural language is:“show me all stars which are at most 1000 light-years away from the sun.” To answer such a query efficiently, one should avoid the exhaustive examination of the whole data set. Otherwise, the execution of each query will occupy the system for a long period of time, which is not practical and leads to performance degradation.For the rest of the discussion, we are mainly interested in disk-based access methods, where the data set as well as the auxiliary data structures to facilitate access reside on magnetic disks. The challenge in this case is to perform as few …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Threshold-based Network Structural Dynamics",
            "Publication year": 2021,
            "Publication url": "https://livrepository.liverpool.ac.uk/3118829/",
            "Abstract": "Threshold-based Network Structural Dynamics - The University of Liverpool Repository Search \nthe University Study with Liverpool Study with Liverpool Find a course Select type Study in \nLiverpool All study opportunities Undergraduate Postgraduate taught Postgraduate research \nFoundation courses Access courses International students Continuing education Continuing \nprofessional development Study globally Study in London Study in China Study online Be part \nof a globally-connected Russell Group university Our research Our research Research Our \nresearch AZ of research groups REF 2014 Postgraduate Research PhD degrees Liverpool \nDoctoral College Research and business collaboration Collaborate with us How you can work \nwith us Research with real world impact About us About us Our story About the University \nKey people Accounts and main documents Strategy 2026 Key information News Events us …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Searching for regularities in weighted sequences",
            "Publication year": 2019,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9780429081385-172/searching-regularities-weighted-sequences-christodoulakis-iliopoulos-tsichlas-perdikuri",
            "Abstract": "In this paper we describe algorithms for finding regularities in weighted sequences. A weighted sequence is a sequence of symbols drawn from an alphabet∑ that have a prespecified probability of occurrence. We show that known algorithms for finding repeats in solid sequences may fail to do so for weighted sequences. In particular, we show that Crochemore’s algorithm for finding repetitions cannot be applied in the case of weighted sequences. However, one can use Karp’s algorithm to identify repeats of specific length. We also extend this algorithm to identify the covers of a weighted sequence. Finally, the implementation of Karp’s algorithm brings up some very interesting issues.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:roLk4NBRz8UC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "The pattern matching problem in biological weighted sequences",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.2.3634&rep=rep1&type=pdf",
            "Abstract": "In this paper we develop new and efficient algorithms for the problems of pattern matching and identification of repeated patterns in biological weighted sequences. Biological Weighted Sequences can model important biological processes such as the DNA Assembly Process or the DNA-Protein Binding Process. Thus, pattern matching or identification of repeated patterns in biological weighted sequences is a very important procedure in the translation of gene expression and regulation. Our results are based on a very elegant idea of Karp et al. and are both efficient and simple to implement.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms for bitmasking strings",
            "Publication year": 2006,
            "Publication url": "https://kclpure.kcl.ac.uk/portal/en/publications/algorithms-for-bitmasking-strings(44c3c3b5-9a47-4bd3-8bc9-a658942ad834).html",
            "Abstract": "In this paper we present algorithms for efficiently bitmasking strings. In particular, we assume a pattern (the bitmask) consisting of zeroes and ones as well as a text over an alphabet Sigma and the goal is to extract information efficiently when we apply the pattern on the text.. Three algorithms are presented, each one based on different techniques, exhibiting various time complexities",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:hFOr9nPyWt4C",
            "Publisher": "VSP BV-C/O BRILL ACAD PUBL"
        },
        {
            "Title": "DATA STRUCTURING APPLICATIONS FOR STRING PROBLEMS IN BIOLOGICAL SEQUENCES",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812704658_0104",
            "Abstract": "In this work we present applications of data structuring techniques for string problems in biological sequences. We firstly consider the problem of approximate string matching with gaps and secondly the problem of identifying occurrences of maximal pairs in multiple strings. The proposed implementations can be used in many problems that arise in the field of Computational Molecular Biology.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel continuous outlier mining in streaming data",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8631496/",
            "Abstract": "In this work, we focus on distance-based outliers in a metric space, where the status of an entity as to whether it is an outlier is based on the number of other entities in its neighborhood. In the recent years, several solutions have tackled the problem of distance-based outliers in data streams, where outliers must be mined continuously as new elements become available. An interesting research problem is to combine the streaming environment with massively parallel systems to provide scalable stream-based algorithms. However, none of the previously proposed techniques refer to a massively parallel setting. Our proposal fills this gap and studies transferring state-of-the-art techniques in Apache Flink, a modern platform for intensive streaming analytics. We thoroughly present the technical challenges encountered and the alternatives that may be applied. We show speed-ups up to 117 (resp. 2076) times over a …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ART $$^ $$: A Fault-Tolerant Decentralized Tree Structure with Ultimate Sub-logarithmic Efficiency",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-29919-8_10",
            "Abstract": "In this paper, we focus on large-scale, decentralized environments. Our aim is to develop an architecture that can support range queries and scale in terms of number of nodes as well as of data items stored. The solutions proposed in literature are inadequate for our purposes, since their classic logarithmic complexity is too expensive even for single queries. In this work, we contribute the ART (Autonomous Range Tree) structure, which outperforms the most popular decentralized structures, since it achieves sub-logarithmic complexity. ART achieves an  communication cost for query and update operations, where b is a double-exponentially power of 2 and N is the total number of nodes. Moreover, ART is a fully dynamic and fault-tolerant structure, which supports the join/leave node operations in  expected w.h.p number of hops and performs load-balancing in  …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Efficient processing of 3-sided range queries with probabilistic guarantees",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1804669.1804676",
            "Abstract": "This work studies the problem of 2-dimensional searching for the 3-sided range query of the form [a, b] x (-∞, c] in both main and external memory, by considering a variety of input distributions. A dynamic linear main memory solution is proposed, which answers 3-sided queries in O (log n+ t) worst case time and scales with O (log log n) expected with high probability update time, under continuous μ-random distributions of the x and y coordinates, where n is the current number of stored points and t is the size of the query output. Our expected update bound constitutes a considerable improvement over the O (log n) update time bound achieved by the classic Priority Search Tree of McCreight [23], as well as over the Fusion Priority Search Tree of Willard [30], which requires O (log n/log log n) time for all operations. Moreover, we externalize this solution, gaining O (log B n+ t/B) worst case and O (log B logn) amortized …",
            "Abstract entirety": 0,
            "Author pub id": "-KUXfxsAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time and space efficient content queries for video databases",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/42185576/Time_and_Space_Efficient_Content_Queries20160205-9800-76svv8.pdf",
            "Abstract": "Indexing video content is one of the most important problems in video databases. In this paper we present a simple optimal algorithm for this problem that answers certain content queries invoking video functions in linear time and space in terms of the number of the objects appearing in the video. To accomplish this, we make a straightforward reduction of this problem to the intersection problem in Computational Geometry. Our result is an improvement over the one of VS Subrahmanian [10] by a logarithmic factor in storage and is achieved by using different basic data structures. This logarithmic save is of great importance in video databases because vast space is needed to store videos and metadata for each video. Finally, we present two time-efficient approaches. We also compare the CPU times of our algorithms by presenting experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The dynamic monotone priority search tree(DMoPST): Anew efficient 2-D spatial indexing scheme withoptimal update time.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=6251024293738865508&hl=en&oi=scholarr",
            "Abstract": "For monotone generated points on the plane we present the Dynamic Monotone Priority Search Tree(DMoPST) in main/external memory with O(1) update time/O(1) block transfers in worst-case. The external version of the structure above promises efficient applications in transaction time Databases systems.",
            "Abstract entirety": 1,
            "Author pub id": "-KUXfxsAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        }
    ]
}]