[{
    "name": "Κωνσταντίνος Στάθης",
    "romanize name": "Konstantinos Stathis",
    "School-Department": " Computer Science",
    "University": "Royal Holloway, University of London",
    "Rank": "Καθηγητής",
    "Apella_id": 9780,
    "Scholar name": "Kostas Stathis",
    "Scholar id": "6Kwf-xkAAAAJ",
    "Affiliation": "Professor of Computer Science",
    "Citedby": 1516,
    "Interests": [
        "Artificial Intelligence",
        "Multi-Agent Systems",
        "Logic Programming"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=6Kwf-xkAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Recon: a robust multi-agent environment for simulating concurrent negotiations",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-30307-9_10",
            "Abstract": " Recon is an experimental simulation platform that supports the development of software agents interacting concurrently with other agents in negotiation domains. Unlike existing simulation toolkits that support only imperative negotiation strategies, Recon also supports declarative strategies, for applications where logic-based agents need to explain their negotiation decisions to a user. Recon is built on top of the GOLEM agent platform, specialized with a set of infrastructure agents that can manage an electronic market and extract statistics from the negotiations that take place. We evaluate the performance of Recon by showing how by increasing the number of agents in a simulation affects the agents’ time to make an offer during negotiation.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:8AbLer7MMksC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The apriori stochastic dependency detection (ASDD) algorithm for learning stochastic logic rules",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30200-1_13",
            "Abstract": " Apriori Stochastic Dependency Detection (ASDD) is an algorithm for fast induction of stochastic logic rules from a database of observations made by an agent situated in an environment. ASDD is based on features of the Apriori algorithm for mining association rules in large databases of sales transactions [1] and the MSDD algorithm for discovering stochastic dependencies in multiple streams of data [15]. Once these rules have been acquired the Precedence algorithm assigns operator precedence when two or more rules matching the input data are applicable to the same output variable. These algorithms currently learn propositional rules, with future extensions aimed towards learning first-order models. We show that stochastic rules produced by this algorithm are capable of reproducing an accurate world model in a simple predator-prey environment.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multi-dimensional causal discovery",
            "Publication year": 2013,
            "Publication url": "https://www.aaai.org/ocs/index.php/IJCAI/IJCAI13/paper/viewPaper/6655",
            "Abstract": "We propose a method for learning causal relations within high-dimensional tensor data as they are typically recorded in non-experimental databases. The method allows the simultaneous inclusion of numerous dimensions within the data analysis such as samples, time and domain variables construed as tensors. In such tensor data we exploit and integrate non-Gaussian models and tensor analytic algorithms in a novel way. We prove that we can determine simple causal relations independently of how complex the dimensionality of the data is. We rely on a statistical decomposition that flattens higher-dimensional data tensors into matrices. This decomposition preserves the causal information and is therefore suitable for structure learning of causal graphical models, where a causal relation can be generalised beyond dimension, for example, over all time points. Related methods either focus on a set of samples for instantaneous effects or look at one sample for effects at certain time points. We evaluate the resulting algorithm and discuss its performance both with synthetic and real-world data.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:tS2w5q8j5-wC",
            "Publisher": "AAAI"
        },
        {
            "Title": "Preface: Reinforcement Learning.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=9141862545510212241&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:URolC5Kub84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Organized Adaption in Multi-Agent Systems",
            "Publication year": 2008,
            "Publication url": "http://dni.dali.dartmouth.edu/t31io9awf7bn/02-frederick-okuneva-5/read-3642023762-organized-adaption-in-multi-agent-systems.pdf",
            "Abstract": "Our services was introduced using a aspire to function as a comprehensive online electronic local library which o ers usage of large number of PDF guide assortment. You could find many kinds of e-book and other literatures from your papers data bank. Distinct well-liked subject areas that spread on our catalog are popular books, solution key, examination test question and answer, guideline sample, skill guide, quiz example, end user handbook, consumer guideline, services instructions, restoration guide, and so forth.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special Issue on Artificial Societies for Ambient Intelligence Editorial Introduction",
            "Publication year": 2010,
            "Publication url": "https://academic.oup.com/comjnl/article-abstract/53/8/1136/363668",
            "Abstract": "This Special Issue is based on selected papers of the Symposium on Artificial Societies for Ambient Intelligence (ASAMI’07) that we organized under the AISB convention, which took place at the University of Newcastle, UK, in April 2007. Participation to ASAMI’07 was the highest among the symposiums organized under AISB that year, and this motivated the organization of this Special Issue. As well as asking for revised papers from ASAMI’07, we opened up the call to the wider international community.The context of this Special Issue relies upon a vision of Ambient Intelligence (AmI) as a society based on unobtrusive, often invisible interactions among people and computer-based services in a global computing environment [1]. Services in AmI are assumed to be ubiquitous in that there is no specific bearer or provider; instead, they will be associated with a variety of objects and devices in the environment, which …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "A formal framework of virtual organisations as agent societies",
            "Publication year": 2010,
            "Publication url": "https://arxiv.org/abs/1001.4405",
            "Abstract": "We propose a formal framework that supports a model of agent-based Virtual Organisations (VOs) for service grids and provides an associated operational model for the creation of VOs. The framework is intended to be used for describing different service grid applications based on multiple agents and, as a result, it abstracts away from any realisation choices of the service grid application, the agents involved to support the applications and their interactions. Within the proposed framework VOs are seen as emerging from societies of agents, where agents are abstractly characterised by goals and roles they can play within VOs. In turn, VOs are abstractly characterised by the agents participating in them with specific roles, as well as the workflow of services and corresponding contracts suitable for achieving the goals of the participating agents. We illustrate the proposed framework with an earth observation scenario.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A self-healing distributed pervasive health system",
            "Publication year": 2013,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWET.2013.055715",
            "Abstract": "In the context of pervasive healthcare systems there is a growing need of services that are constantly available to the patients accessing them. To address this issue, in this paper we present a distributed pervasive infrastructure that is capable of self-healing one or more of its parts when an external event causes a disruption of the service in the areas covered by the pervasive system. We utilise approaches from multi-agent systems (MASs) such as communication, coordination, planning and agent environments to create a distributed system whose emergent behaviour shows the capability to heal itself even if 50% of the system is not functioning due to external causes.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Computational model for computees and societies of computees",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=6312098919939396801&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:p2g8aNsByqUC",
            "Publisher": "Technical report, SOCS Consortium, 2003. Deliverable"
        },
        {
            "Title": "Normative KGP Agents: A Preliminary Report.",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/30793301/8_Normas_Final.pdf#page=98",
            "Abstract": "We extend the logical model of agency known as the KGP model, to support agents with normative concepts, using obligations and prohibitions as examples. The proposed framework illustrates how to integrate normative concepts and roles within the KGP model in such a way that these concepts can evolve dynamically. Furthermore, we illustrate how these concepts can be combined with the existing capabilities of KGP agents in order to plan and react to changes in the environment. Our approach gives an executable specification of normative concepts that can be used directly for prototyping applications.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Engineering Societies in the Agents World VIII: 8th International Workshop, ESAW 2007, Athens, Greece, October 22-24, 2007, Revised Selected Papers",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=16797862846251134306&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:tuHXwOkdijsC",
            "Publisher": "Springer-Verlag Berlin Heidelberg"
        },
        {
            "Title": "The KGP model of agency",
            "Publication year": 2004,
            "Publication url": "http://ftp.cs.rhul.ac.uk/~kostas/pubs/kakas04kgp.pdf",
            "Abstract": "This paper presents a new model of agency, called the KGP (Knowledge, Goals and Plan) model. This draws from the classic BDI model and proposes a hierarchical agent architecture with a highly modular structure that synthesises various reasoning and sensing capabilities of the agent in an open and dynamic environment. The novel features of the model include: its innovative use of Computational Logic (CL) in a way that facilitates both the formal analysis of the model and its computational realisability directly from the high-level specification of the agents (a first prototype for the development of KGP agents exists, based upon a correct computational counterpart of the model), the modular separation of concerns and flexibility afforded by the model in designing heterogeneous agents and in developing independently the various components of an agent, and the declarative agent control provided through a context-sensitive cycle CL theory component that regulates the agent’s operational behaviour, according to the current circumstances of operation, thus breaking away from the conventional one-size-fits-all control of operation.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Strategic change stemming from e‐commerce: implications of multi‐agent systems on the supply chain",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jsc.524",
            "Abstract": "   Electronic commerce (e‐commerce) raises a number of interesting business and technical issues. This paper addresses one important combination of business and technical issues — the implications of multi‐agent systems on the supply chain.   Multi‐agent systems give rise to a new approach of developing information systems where problems of various forms, ranging from complex computational tasks to a requirement of specific information, are solved by those software components best suited to do so.   The operational and strategic consequences of multi‐agent systems are examined.   Copyright © 2001 John Wiley & Sons, Ltd.Electronic commerce (e‐commerce) raises a number of interesting business and technical issues. This paper addresses one important combination of business and technical issues — the implications of multi‐agent systems on the supply chain.Multi‐agent systems give rise to a new approach of developing information systems where problems of various forms, ranging from complex computational tasks to a requirement of specific information, are solved by those software components best suited to do so.The operational and strategic consequences of multi‐agent systems are examined.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:eQOLeE2rZwMC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Vers une architecture modulaire d'agent argumentatif pour la composition de services.",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Kostas-Stathis/publication/221225256_Vers_une_architecture_modulaire_d'agent_argumentatif_pour_la_composition_de_services/links/09e41509916888e0ec000000/Vers-une-architecture-modulaire-dagent-argumentatif-pour-la-composition-de-services.pdf",
            "Abstract": "Dans cet article, nous adoptons un modèle d’agent argumentatif capable de sélectionner et de composer des services. À cette intention, nous proposons une architecture d’agent modulaire qui distingue trois composants principaux dédiés respectivement à la prise de décision, à la communication et à la négociation. Dans ce contexte de composition de services, nous illustrons notre proposition et son fonctionnement à l’aide de l’exemple désormais classique de l’agence de voyage “virtuelle”.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automating workflows using dialetical argumentation",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/30623727/2008110209.pdf",
            "Abstract": "This paper presents a multi-agent framework based on argumentative agent technology for the automation of the workflow selection and execution. In this framework, workflow selection is coordinated by agent interactions governed by the rules of a dialogue game whose purpose is to evaluate the workflow's properties via argumentation. Once a workflow is selected using this process, the workflow is executed by dynamically configuring workflow engines to coordinate the participating agents' workflow activities. We illustrate the overall framework with an example of workflow composition that allows an agent to book an appropriate ticket and rent a car.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The KGP model of agency for decision making in e-negotiation",
            "Publication year": 2005,
            "Publication url": "https://spiral.imperial.ac.uk/handle/10044/1/5896",
            "Abstract": "We investigate the suitabilility of the KGP (Knowledge, Goals, Plan) model of agency for autonomous decision making in dynamically changing environments. In particular, we illustrate how this model supports the decision making process of an agent at different levels, while the agents generates goals, plans for these goals, and selects actions to achieve the goals that it has planned for.  We also exemplify the approach by illustrating how the model and a prototype implementation in the PROSOCS platform can be adopted to support e-negotiation, using a particular kind of internet auctions as a case study.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A formal model of agent-oriented virtual organisations and their formation",
            "Publication year": 2011,
            "Publication url": "https://content.iospress.com/articles/multiagent-and-grid-systems/mgs00179",
            "Abstract": "We present a formal model for agent-oriented Virtual Organisations (VOs) for service grids and we study an associated operational model for the creation of VOs. The model is intended to be used for describing different service grid applications based on multiple agents and, as a result, it abstracts away from any realisation choices of service grid applications, the agents involved to support the applications and their interactions. Within the proposed framework VOs are created within societies of agents, where agents are abstractly characterised by goals and roles they can play within VOs. In turn, VOs are abstractly characterised by the agents participating in them with specific roles, as well as the workflow of services and corresponding contracts suitable for achieving the goals of the participating agents. We illustrate the proposed framework with an earth observation scenario, we discuss implementation issues, and …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:RGFaLdJalmkC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Supporting complaints investigation for nursing and midwifery regulatory agencies",
            "Publication year": 2021,
            "Publication url": "https://aclanthology.org/2021.acl-demo.10/",
            "Abstract": "Health professional regulators aim to protect the health and well-being of patients and the public by setting standards for scrutinising and overseeing the training and conduct of health and care professionals. A major task of such regulators is the investigation of complaints against practitioners. However, processing a complaint often lasts several months and is particularly costly. Hence, we worked with international regulators from different countries (the UK, US and Australia), to develop the first decision support tool that aims to help such regulators process complaints more efficiently. Our system uses state-of-the-art machine learning and natural language processing techniques to process complaints and predict their risk level. Our tool also provides additional useful information including explanations, to help the regulatory staff interpret the prediction results, and similar past cases as well as non-compliance to regulations, to support the decision making.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Activity recognition for an agent-oriented personal health system",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-13191-7_21",
            "Abstract": "We present a knowledge representation framework that allows an agent situated in an environment to recognise complex activities, reason about their progress and take action to avoid or support their successful completion. Activities are understood as parameterised templates whose parameters consist of a unique name labelling the activity to be recognised, a set of participants co-involved in the carrying out of the activity and a goal revealing the desired outcome the participants seek to bring about. The novelty of the work is the identification of an activity lifecycle where activities are temporal fluents that can be started, interrupted, suspended, resumed, or completed over time. The framework also specifies activity goals and their associated lifecycle, as with activities, and shows how the state of such goals aids the recognition of significant transitions within and between activities. We implement the …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Initial steps towards run-time support for norm-governed systems",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21268-0_15",
            "Abstract": "We present a knowledge representation framework with an associated run-time support infrastructure that is able to compute, for the benefit of the members of a norm-governed multi-agent system, the physically possible and permitted actions at each time, as well as sanctions that should be applied to violations of prohibitions. To offer the envisioned run-time support we use an Event Calculus dialect for efficient temporal reasoning. Both the knowledge representation framework and its associated infrastructure are highly configurable in the sense that they can be appropriately distributed in order to support real-time responses to agent requests. To exemplify the ideas, we apply the infrastructure on a benchmark scenario for multi-agent systems. Through experimental evaluation we also show how distributing our infrastructure can provide run-time support to large-scale multi-agent systems regulated by norms.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Deliverable D. 4.2: Towards an Argument-based Model of Legal Doctrines in Common Law of Contracts",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/46037632/Deliverable_D.4.2_Towards_an_Argument-ba20160529-27744-1lpudga.pdf",
            "Abstract": "We propose an argument-based framework for modeling contract dispute resolution as a two-level reasoning process where at the\" object-level\" the acceptability of certain beliefs and facts (also called factors in the literature) is established while at the metalevel the legal doctrines determine the risk allocation. We demonstrate how legal doctrines in common law of contract could be captured by completing partially specified contracts to represent the intended contracts that the parties would have agreed on had they foreseen the unexpected problems. We point out that the risk attitudes of contract parties (and hence the outcome of the dispute resolution) often are represented by their (credulous or skeptical) modes of reasoning. We also provide a sound metalevel proof system for the doctrines of contract breach and mutual mistake.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A restful and decentralised implementation of open objects",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2494091.2497585",
            "Abstract": "We show how to instantiate an existing framework for Open Objects to support a case-study for the Internet of Things. The resulting prototype illustrates the feasibility of the framework for a particular class of applications where physical objects with computational capabilities can collaborate in a decentralised manner. The framework described forms an initial step towards End-User Development on such complex distributed environments.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "From agent game protocols to implementable roles",
            "Publication year": 2008,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/2891/1/",
            "Abstract": "We present a formal framework for decomposing agent interaction protocols to the roles their participants should play. The framework allows an Authority Agent that knows a protocol to compute the protocol’s roles so that it can allocate them to interested parties. We show how the Authority Agent can use the role descriptions to identify problems with the protocol and repair it on the fly, to ensure that participants will be able to implement their role requirements without compromising the protocol’s interactions. Our representation of agent interaction protocols is a game-based one and the decomposition of a game protocol into its constituent roles is based upon the branching bisimulation equivalence reduction of the game. The work extends our previous work on using games to admit agents in an artificial society by checking their competence according to the society rules. The applicability of the overall approach is illustrated by showing how to decompose the NetBill protocol into its roles. We also show how to automatically repair the interactions of a protocol that cannot be implemented in its original form.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed agent environments in the ambient event calculus",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1619258.1619275",
            "Abstract": "We study the development of distributed agent environments as distributed event-based systems specified in the Ambient Event Calculus (AEC). The AEC is a logic-based formalism that is developed here to support the representation of a distributed agent environment as a persistent composite structure evolving over time. Such a complex structure supports the interaction between agents, objects, and containers, entities that have their own external observable state and can be distributed over a network. Interactions between these entities are specified in terms of events that represent actions executed by agents on objects and other agents in the environment. When events happen they are stored in containers and are notified to agent sensors that subscribe to event descriptions and as a result perceive the interactions. The AEC formalism also allows changes caused by events to be delivered across distributed …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experiments with animated societies of computees",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=16893981097813509807&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Technical report, SOCS Consortium, 2005. Deliverable"
        },
        {
            "Title": "Producing enactable protocols in artificial agent societies",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-25044-6_25",
            "Abstract": "This paper draws upon our previous work [7, 16] in which we proposed the organisation of services around the concept of artificial agent societies and presented a framework for representing roles and protocols using LTSs. The agent would apply for a role in the society, which would result in its participation in a number of protocols. We advocated the use of the games-based metaphor for describing the protocols and presented a framework for assessing the admission of the agent to the society on the basis of its competence. In this work we look at the subsequent question: what information should the agent receive upon entry?. We can not provide it with the full protocol because of security and overload issues. Therefore, we choose to only provide the actions pertinent to the protocols that the role the agent applied for participates in the society. We employ branching bisimulation for producing a protocol …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "HYDRA: a HYbrid Diagnosis and monitoRing Architecture for diabetes",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7001898/",
            "Abstract": "We present Hydra: a multi-agent hybrid diagnosis and monitoring architecture that is aimed at helping diabetic patients manage their illness. It makes use of model-based diagnosis techniques, where the model can be developed by two different approaches combined in a novel way. In the first approach, we build the model based on the medical guidelines provided for diabetes. A computational logic agent monitors the patient and provides feedback based on the model whenever the current observations regarding the patient are sufficient to draw a conclusion. In the second approach, we assume a function for the model, and learn its parameters through data. The model is consistently updated via incoming observations about the patients, and allows prediction of possible future values. We describe the components of such an architecture, and how it can integrated into the existing COMMODITY 12  personal health …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "First-class protocols for agent-based coordination of scientific instruments",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4407124/",
            "Abstract": "The coordination of distributed processing is of great interest to a number of research communities. However these research communities, such as those involved in e-science GRIDs and multi-agent systems, view this problem from disparate viewpoints. This paper aims to contribute to the necessary reconciliation of these perspectives. By demonstrating the coordination of processes whether reactive (such as web services) or proactive (such as autonomous agents) can be done with a single representation using a protocol language, RASA The multi-agent paradigm introduces, into any model of distributed systems, flexibility and autonomy that can be daunting and intimidating to scientists accustomed to more orthodox approaches. It is for this reason that it is important that the model for coordination of this system is reliable, verifiable, inspectable, referable, composable and executable. The language RASA provides …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Engineering Societies in the Agents World VIII",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=nBRrCQAAQBAJ&oi=fnd&pg=PP2&dq=info:hcZ1ZW7lKU4J:scholar.google.com&ots=AhUc4bZ-JJ&sig=VjQZ8qXa0cPZ1rWHyT9ff2d5-8M",
            "Abstract": "This book constitutes the thoroughly refereed post-conference proceedings of the 7th International Workshop on Engineering Societies in the Agents World, ESAW 2007, held in Athens, Greece, in October 2007. The 19 revised full papers were carefully reviewed and selected for inclusion in this book. The papers are organized in topical sections on electronic institutions, models of complex distributed systems with agents and societies; interaction in agent societies; engineering social intelligence in multi-agent systems; trust and reputation in agent societies; analysis, design and development of agent societies.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:tzM49s52ZIMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Socio-cognitive grids: The net as a universal human resource",
            "Publication year": 2003,
            "Publication url": "https://pure.royalholloway.ac.uk/portal/files/29019684/SocioCognitiveGrids.pdf",
            "Abstract": "We present the vision of a new form of complex system that we call socio-cognitive grid. We define what a socio-cognitive grid is and we exemplify the use of such a system with two different scenarios. We also outline a research strategy, which we argue will produce socio-cognitive grids by transforming the existing internetworking and web technologies into a human resource that will be accessible by anyone, at anytime, and anywhere in support of their everyday activities.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational logic foundations of KGP agents",
            "Publication year": 2008,
            "Publication url": "http://www.jair.org/index.php/jair/article/view/10575",
            "Abstract": "This paper presents the computational logic foundations of a model of agency called the KGP (Knowledge, Goals and Plan model. This model allows the specification of heterogeneous agents that can interact with each other, and can exhibit both proactive and reactive behaviour allowing them to function in dynamic environments by adjusting their goals and plans when changes happen in such environments. KGP provides a highly modular agent architecture that integrates a collection of reasoning and physical capabilities, synthesised within transitions that update the agent's state in response to reasoning, sensing and acting. Transitions are orchestrated by cycle theories that specify the order in which transitions are executed while taking into account the dynamic context and agent preferences, as well as selection operators for providing inputs to transitions.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "iCampus: A Connected Campus in the Ambient Event Calculus",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/content/61549",
            "Abstract": "iCampus is a prototype multi-agent system whose goal is to provide the ambient intelligence required to connect people in a university campus and make that campus inclusive and accessible. Software agents called guides run on mobile phones to help students with information about people, places, and events, thus providing people real-time, location-based advice that makes them more aware of what is going on in the campus. The work outlines how to specify iCampus in the Ambient Event Calculus and implement it using the agent environment GOLEM to deploy guide agents over a campus network. The work is illustrated by showing how iCampus improves the mobility of blind or partially sighted students within a campus, which has been the main motivation behind the work.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "PROSOCS: A platform for building software agents in computational logic",
            "Publication year": 2004,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Situating cognitive agents in GOLEM, Engineering environment-mediated multi-agent systems",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=5809301315730723591&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer"
        },
        {
            "Title": "Game-based e-retailing in GOLEM agent environments",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1574119209000492",
            "Abstract": "We present a prototype multi-agent system whose goal is to support a 3D application for e-retailing. The prototype demonstrates how the use of agent environments can be amongst the most promising and flexible approaches to engineer e-retailing applications. We illustrate this point by showing how the agent environment GOLEM supports social interactions and how it combines them with semantic-web technologies to develop the e-retailing application. We also describe the features of GOLEM that allow a user to engage in e-retailing activities in order to explore the virtual social environment by searching and dynamically discovering new agents, products and services.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Evatar–a prototyping middleware embodying virtual agents to autonomous robots",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13268-1_20",
            "Abstract": "We present EVATAR, a middleware framework for rapid prototyping of augmented reality, ubiquitous robotic applications. More specifically, EVATAR aims to connect low cost robotic applications running in a physical environment with software agents that implement the functionality of robots in a MAS (Multi Agent System) electronic environment, as if the robots were the avatars of the agents. We exemplify our ideas by showing how EVATAR can enable agents in the GOLEM agent platform to be connected and control Lego robots in order to create a distributed, autonomous robotic system.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "CONAN: a heuristic strategy for COncurrent Negotiating AgeNts",
            "Publication year": 2014,
            "Publication url": "http://www.ifaamas.org/Proceedings/aamas2014/aamas/p1585.pdf",
            "Abstract": "We develop CONAN, a heuristic agent for concurrent bilateral negotiations in electronic markets that are open, dynamic and complex. Existing strategies often omit the factors determining when a market environment is open or how an agent evaluates progress in bilateral negotiations. Such omissions in turn damage the offer-making ability of an agent and consequently the number of successful negotiations that this agent can achieve. Negotiation experiments indicate that CONAN outperforms other agents that rely on the current state-of-the-art by a significant amount in terms of the utility gained during a negotiation.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The ArguGRID platform: an overview",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-85485-2_18",
            "Abstract": "The ArguGRID project aims at supporting service selection and composition in distributed environments, including the Grid and Service-oriented architectures, by means of argumentative agents, an agent environment, a service-composition environment, Peer-to-Peer technology and Grid middleware. Agents are argumentative in that they use argumentation-based decision-making and argumentation-supported negotiation of services and contracts. The integration of all technologies gives rise to the overall ArguGRID platform. In this paper we outline the main components and the overall functionalities of the ARGUGRID platform.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Enabling decentralised decision-making in AI-an agent environments perspective.",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=18088416949649629425&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building Socio-Cognitive Grids by combining Peer-to-Peer Computing with Computational Logic",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Kostas-Stathis/publication/304895259_Building_Socio-Cognitive_Grids_by_Combining_Peer-to-peer_Computing_with_Computational_Logic/links/577cc8fd08ae3f37c5d537bd/Building-Socio-Cognitive-Grids-by-Combining-Peer-to-peer-Computing-with-Computational-Logic.pdf",
            "Abstract": "There are many technical questions that are raised by the vision of socio-cognitive grids|| 3], this short abstract discusses a combination of suitable computing technologies to build systems of this kind. The main requirement for building a socio-cognitive grid is based on the observation that although grid computing| 8| focuses on how computers make effective use of computing resources, a socio-cognitive grid is mainly concerned with how people use computers to carry out common everyday activities. In this new setting people, and not computers, are in the centre, and as a result the technology should reflect this change of perspective. Socio-cognitive grids rely on the assumption that everyday objects that people use will have computing capabilities|| 9||(consider for instance the computing capabilities of a mobile phone), and as a result a computing platform must be capable of being executed in small devices. To …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:dTyEYWd-f8wC",
            "Publisher": "i3"
        },
        {
            "Title": "Stratégie situationnelle pour l'équilibrage de charge",
            "Publication year": 2019,
            "Publication url": "https://lilloa.univ-lille.fr/bitstream/handle/20.500.12210/22394/https:/hal.archives-ouvertes.fr/hal-02173687/document?sequence=1",
            "Abstract": "Nous étudions une stratégie qui tient compte de la localité des ressources pour équilibrer les charges dans un système distribué. Cette stratégie permet aux agents coopératifs d’identifier une allocation non équilibrée, voire de déclencher des enchères concurrentes pour réallouer localement certaines des tâches. Les tâches sont réallouées en tenant compte de l’accessibilité des ressources pour les agents; elles sont exécutées conformément aux capacités des nœuds de calcul sur lesquels se trouvent les agents. Ce processus de négociation dynamique et continu est concurrent à l’exécution des tâches, ce qui permet d’adapter l’allocation des tâches aux perturbations (exécution de tâche, chute de performance d’un nœud). Nous évaluons cette stratégie dans le cadre du déploiement multi-agents de MapReduce. Ce patron de conception permet le traitement distribué de données massives. Les résultats empiriques démontrent que notre stratégie améliore significativement le temps d’exécution du traitement d’un jeu de données.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Cépaudès"
        },
        {
            "Title": "Ambient intelligence using KGP agents",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30473-9_33",
            "Abstract": "We investigate the application of a logical model of agency, known as the KGP model, to develop agents for ambient intelligence applications. Using a concrete scenario, we illustrate how the logical formalism employed by a KGP agent allows a person to access the surrounding ambient through the agent in a transparent manner. We evaluate our claims by implementing the resulting interactions in PROSOCS, a prototype multi-agent systems platform that allows KGP agents to be deployed as components of ambient intelligence applications.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Competence checking for the global e-service society using games",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75524-1_22",
            "Abstract": "We study the problem of checking the competence of communicative agents operating in a global society in order to receive and offer electronic services. Such a society will be composed of local sub-societies that will often be semi-open, viz., entrance of agents in a semi-open society is conditional to specific admission criteria. Assuming that a candidate agent provides an abstract description of their communicative skills, we present a test that a controller agent could perform in order to decide if a candidate agent should be admitted. We formulate this test by revisiting an existing knowledge representation framework based on games specified as extended logic programs. The resulting framework finds useful application in complex and inter-operable web-services construed as semi-open societies in support of the global vision known as the Semantic Web.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Community-based interactive systems",
            "Publication year": 2001,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-477c1c0c-4ec1-38ca-854c-9218179d3828",
            "Abstract": "Community-based interactive systems × Close The Infona portal uses cookies, ie strings of text \nsaved by a browser on the user's device. The portal can access those files and use them to \nremember the user's data, such as their chosen settings (screen view, interface language, \netc.), or their login data. By using the Infona portal the user accepts automatic saving and using \nthis information for portal operation purposes. More information on the subject can be found \nin the Privacy Policy and Terms of Service. By closing this window the user confirms that they \nhave read the information on cookie usage, and they accept the privacy policy and the way \ncookies are used by the portal. You can change the cookie settings in your browser. I accept \nPolski English Login or register account remember me Password recovery INFONA - science \ncommunication portal INFONA Search advanced search Browse series books journals × -, …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Argumentative Model for Service-Oriented Agents.",
            "Publication year": 2008,
            "Publication url": "https://www.aaai.org/Papers/Symposia/Spring/2008/SS-08-02/SS08-02-007.pdf",
            "Abstract": "In this paper we propose an argumentative agent model able to reason and make decisions, communicate and negotiate with other agents with the aim of supporting service selection and composition. Actually, our agent model is inspired from the general-purpose KGP agent model which deals only partially with priorities as required by our application. We provide here an argumentation framework which adopts Knowledge, Goals, Decisions, and Priorities as the main component to perform the individual and social reasoning of agents. We propose here an example to illustrate our approach.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards self-managing systems inspired by economic organizations",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5641875/",
            "Abstract": "Today's self-managing systems would ideally be able to adapt themselves (their internal structure or behavior), as well as to autonomously participate in larger, self-organizing systems. Analogously, the enterprises or other socio-economic systems autonomously manage themselves - they make decisions on how to adapt their structure and behavior, and how to organize with other entities in the environment. To connect internal self-adaptive with external self-organizational behavior, an enterprise is “aware” of itself and of its environment, and acts according to this awareness. This position paper proposes to address the challenges of a complex distributed self-managing system by making entities in such a system able to adapt themselves similarly to how companies manage themselves in socio-economic systems. To enable the knowledge transfer between these two fields, the paper proposes to utilize symbolic …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligence and interaction in community-based systems (Part 2)",
            "Publication year": 2003,
            "Publication url": "https://academic.oup.com/iwc/article-abstract/15/1/1/736340",
            "Abstract": "This is the second part of a special issue dedicated to the area of Intelligence and Interaction in Community-based Systems. The first (Stathis and Purcell, 2002) addressed the range of spontaneous interactions that may form part of a set of overlapping patterns of personal, familial, social and civic circles. The focus then was on the needs of physically co-located communities, those lay people who may live next door, frequent the local pub, send their children to the same school, or bump into each other intermittently at meetings of local societies or professional associations. This second part of the special issue still keeps the notion of local community in the physical neighbourhood but here the attention is diverted to the kind of relationships that the members of such a community may be establishing with other communities, whether local or global, real or virtual, more simple or more complex. Such relationships can …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:maZDTaKrznsC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Activity Recognition for Diabetic Patients Using a Smartphone",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=747634567791156612&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:tYavs44e6CUC",
            "Publisher": "Springer Science and Media"
        },
        {
            "Title": "Computational Logic Foundations of KGP Agents",
            "Publication year": 2014,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2014arXiv1401.3443K/abstract",
            "Abstract": "This paper presents the computational logic foundations of a model of agency called the KGP (Knowledge, Goals and Plan model. This model allows the specification of heterogeneous agents that can interact with each other, and can exhibit both proactive and reactive behaviour allowing them to function in dynamic environments by adjusting their goals and plans when changes happen in such environments. KGP provides a highly modular agent architecture that integrates a collection of reasoning and physical capabilities, synthesised within transitions that update the agents state in response to reasoning, sensing and acting. Transitions are orchestrated by cycle theories that specify the order in which transitions are executed while taking into account the dynamic context and agent preferences, as well as selection operators for providing inputs to transitions.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Declarative agent control",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/11533092_6",
            "Abstract": "In this work, we extend the architecture of agents (and robots) based upon fixed, one-size-fits-all cycles of operation, by providing a framework of declarative specification of agent control. Control is given in terms of cycle theories, which define in a declarative way the possible alternative behaviours of agents, depending on the particular circumstances of the (perceived) external environment in which they are situated, on the internal state of the agents at the time of operation, and on the agents’ behavioural profile. This form of control is adopted by the KGP model of agency and has been successfully implemented in the PROSOCS platform. We also show how, via cycle theories, we can formally verify properties of agents’ behaviour, focusing on the concrete property of agents’ interruptibility. Finally, we give some examples to show how different cycle theories give rise to different, heterogeneous agents …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A virtual e-retailing environment in golem",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4629781/",
            "Abstract": "We present a prototype multi-agent system whose goal is to support a 3D application for e-retailing. The prototype demonstrates how the use of agent environments can be amongst the most promising and flexible approaches to engineer e-retailing applications. We illustrate this point by showing how the agent environment GOLEM uses semantic Web concepts to develop the e-retailing application. In this context we describe the features of GOLEM that allow a user to become an avatar and explore the environment by searching and dynamically discovering new products and services.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IET"
        },
        {
            "Title": "Ambient Intelligence: 14th European Conference, AmI 2018, Larnaca, Cyprus, November 12-14, 2018, Proceedings",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=V1B1DwAAQBAJ&oi=fnd&pg=PR5&dq=info:cxqky15NSNkJ:scholar.google.com&ots=WnYmlXb7jZ&sig=FJeVLiWEz9GPsNKF4LZBit6biyM",
            "Abstract": "This book constitutes the refereed proceedings of the 14th European Conference on Ambient Intelligence, AmI 2018, held in Larnaca, Cyprus, in November 2018. The 12 revised full papers presented together with 6 short papers were carefully reviewed and selected from 36 submissions. The papers cover topics such as: Ambient Services and Smart Environments; Sensor Networks and Artificial Intelligence; Activity and Situation Recognition; Ambient Intelligence in Education.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:vbGhcppDl1QC",
            "Publisher": "Springer"
        },
        {
            "Title": "A Location-Aware Strategy for Agents Negotiating Load-balancing",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8995206/",
            "Abstract": "We study a novel location-aware strategy for distributed systems where cooperating agents perform the load-balancing. The strategy allows agents to identify opportunities within a current unbalanced allocation, which in turn triggers concurrent and one-to-many negotiations amongst agents to locally reallocate some tasks. The tasks are reallocated according to the proximity of the resources and they are performed in accordance with the capabilities of the nodes in which agents are situated. This dynamic and on-going negotiation process takes place concurrently with the task execution and so the task allocation process is adaptive to disruptions (task consumption, slowing down nodes). We evaluate the strategy in a multi-agent deployment of the MapReduce design pattern for processing large datasets. Empirical results demonstrate that our strategy significantly improves the overall runtime of the data processing.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:4MWp96NkSFoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "LIST OF CONTENTS",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=4960636221335297190&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Use of Artificial Intelligence in Regulatory Decision-Making",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2155825621001125",
            "Abstract": "This project aimed to develop an artificial intelligence (AI)–based tool for improving the consistency and efficiency of decision-making in the nursing complaints process in three jurisdictions. This article describes the tool and the overall process of its development. The AI tool was not designed to replace human judgment but rather to perform three data-driven decision support tasks: (a) an independent risk prediction of the case, (b) a comparison with previous similar cases, and (c) a cross reference to relevant parts of the regulatory standards or rules in each jurisdiction. Three nursing regulatory bodies in the United States, the United Kingdom, and Australia provided anonymized data from 5,700 cases for tool design and testing. Regulatory staff were involved in each stage of development and supported the potential role of an AI-based tool such as this in improving the efficiency and effectiveness of decision-making …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Towards runtime support for norm-governed multi-agent systems",
            "Publication year": 2010,
            "Publication url": "https://www.aaai.org/ocs/index.php/KR/KR2010/paper/viewPaper/1317",
            "Abstract": "We present a knowledge representation framework with an associated run-time support infrastructure that is able to compute, for the benefit of the members of a norm-governed multi-agent system, physically possible and/or permitted actions current at each time, as well as sanctions that should be applied to violations of prohibitions. Experimental results on a benchmark scenario indicate how by distributing norms we can provide run-time support to large-scale, norm-governed multi-agent systems.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ubiquitous agents for ambient ecologies",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S157411921100143X",
            "Abstract": "The cost of state-of-the-art devices and robots is critical for the uptake of Ambient Intelligence (AmI). One way to utilize low-cost hardware for both devices and robots is to run smart software remotely as agents deployed on computationally rich environments. In this context, the devices and the robots can be seen as the Avatars of agents, while the way devices and agents are related may be considered as an Ambient Ecology. We show how the application of a middleware platform called EVATAR realizes this vision by exemplifying the main issues with a multi-robot and a smart-home scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Learning to Act with RVRL agents",
            "Publication year": 2007,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/2999/",
            "Abstract": "The use of reinforcement learning to guide action selection of cognitive agents has been shown to be a powerful technique for stochastic environments. Standard Reinforcement learning techniques used to provide decision theoretic policies rely, however, on explicit state-based computations of value for each state-action pair. This requires the computation of a number of values exponential to the number of state variables and actions in the system. This research extends existing work with an acquired probabilistic rule representation of an agent environment by developing an algorithm to apply reinforcement learning to values attached to the rules themselves. Structure captured by the rules is then used to learn a policy directly. The resulting value attached to each rule represents the utility of taking an action if the conditions of the rule are present in the agent’s current set of percepts. This has several advantages for planning purposes: generalization over many states and over unseen states; effective decisions can therefore be made with less training data than state based modelling systems (e.g. Dyna Q-Learning); and the problem of computation in an exponential state-action space is alleviated. The results of application of this algorithm to rules in a specific environment are presented, with comparison to standard reinforcement learning policies developed from related work.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Engineering stable multi-agent systems",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/11423355_23",
            "Abstract": "We present an abstract declarative semantics for multi-agent systems based on the idea of stable set, and argue that it can be suitably employed to describe, and to some extent verify, the dynamics of complex systems of autonomous and heterogeneous interacting agents. We view agents as black-boxes, whose semantics is abstractly understood as an input-output transformation from the agents’ observations about their environment, to the actions they perform. Stable sets (of actions) characterise multi-agent systems able to reach an equilibrium point. Our semantics via stable sets takes into account the possibility that agents may fail. We illustrate how stability can characterise multi-agent systems by means of examples. We also draw considerations about how stable sets can be effectively approximated.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Clic: A framework for distributed, on-demand, human-machine cognitive systems",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1312.2242",
            "Abstract": "Traditional Artificial Cognitive Systems (for example, intelligent robots) share a number of limitations. First, they are usually made up only of machine components; humans are only playing the role of user or supervisor. And yet, there are tasks in which the current state of the art of AI has much worse performance or is more expensive than humans: thus, it would be highly beneficial to have a systematic way of creating systems with both human and machine components, possibly with remote non-expert humans providing short-duration real-time services. Second, their components are often dedicated to only one system, and underutilized for a big part of their lifetime. Third, there is no inherent support for robust operation, and if a new better component becomes available, one cannot easily replace the old component. Fourth, they are viewed as a resource to be developed and owned, not as a utility. Thus, we are presenting CLIC: a framework for constructing cognitive systems that overcome the above limitations. The architecture of CLIC provides specific mechanisms for creating and operating cognitive systems that fulfill a set of desiderata: First, that are distributed yet situated, interacting with the physical world though sensing and actuation services, and that are also combining human as well as machine services. Second, that are made up of components that are time-shared and re-usable. Third, that provide increased robustness through self-repair. Fourth, that are constructed and reconstructed on the fly, with components that dynamically enter and exit the system during operation, on the basis of availability, pricing, and need. Importantly, fifth …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recognising lifestyle activities of diabetic patients with a smartphone",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7349425/",
            "Abstract": "Diabetes is both heavily affected by the patients' lifestyle, and it affects their lifestyle. Most diabetic patients can manage the disease without technological assistance, so we should not burden them with technology unnecessarily, but lifestyle-monitoring technology can still be beneficial both for patients and their physicians. Because of that we developed an approach to lifestyle monitoring that uses the smartphone, which most patients already have. The approach consists of three steps. First, a number of features are extracted from the data acquired by smartphone sensors, such as the user's location from GPS coordinates and visible wi-fi access points, and the physical activity from accelerometer data. Second, several classifiers trained by machine learning are used to recognise the user's activity, such as work, exercise or eating. And third, these activities are refined by symbolic reasoning encoded in Event …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Argumentation sur les motivations propres dans l’architecture V3A pour des agents auto-adaptatifs",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/46037607/morge08jfsma.pdf",
            "Abstract": "Adoptant l’approche Voyelles, l’architecture d’agents V3A (Vowels Agent Argumentation Architecture) est un modèle d’agent à travers lequel un agent autonome débat en interne afin de gérer ses motivations. La personnalité de l’agent résout les éventuels conflits entre ses différentes motivations et dicte son comportement. À l’aide de cette architecture modulaire, nous sommes en mesure de développer des agents auto-adaptatifs capables de remplacer automatiquement leurs composants. Nous proposons ici une technique d’argumentation pour mettre en oeuvre le processus dialectique interne via un jeu de dialogue entre ces composants. Notre cadre est illustré à l’aide d’un scénario où un agent s’ adapte automatiquement au contexte d’exécution.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A lightweight service registry for unstable ad-hoc networks",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-25167-2_15",
            "Abstract": "We present a distributed systems framework for sharing knowledge and capabilities in ad-hoc networks of devices where network bandwidth, network connectivity and device computing power are severely limited. We develop a distributed registry to store knowledge of device capabilities and their invocation, implement it and show how it can be deployed in a set of network nodes to exemplify its usefulness. The ideas are exemplified with an ambient intelligence scenario known as autonomous road trains.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:P5F9QuxV20EC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Competent agents and customising protocols",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-25946-6_11",
            "Abstract": "In open agent societies, communication protocols and strategies cannot be assumed to always match perfectly, because they are typically specified by different designers. These potential discrepancies raise a number of interesting issues, most notably the problem of checking that the behaviour of an agent is (or will be) conformant to the rules described by a protocol. In this paper, we argue that the ability to merely conform to a protocol is not sufficient for an agent to be a competent user of that protocol. We approach the intuitive idea of protocol competence by introducing a notion that considers, broadly speaking, an agent’s ability to reach a particular state of the interaction and we provide preliminary results that allow us to automatically check competence in the context of a specific class of logic-based agents. Finally, we illustrate how these results can facilitate the customisation of protocols used by agents …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards distributed agent environments for pervasive healthcare",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16178-0_13",
            "Abstract": "In this paper we present a prototypical pervasive health care infrastructure, whose purpose is the continuous monitoring of pregnant women with gestational diabetes mellitus. In this infrastructure, patients are equipped with a body-area network made of sensors to control blood pressure and glucose levels, where the sensors are connected to a smart phone working as a hub to collect the data. These data is then fed to a pervasive GRID where abductive agents provide a diagnosis for the actual reading of the sensors and contacting health care professionals if necessary. We also show how, by applying the concept of agent environment, we are facilitated in defining a pervasive GRID for roaming agents that monitor continuously the health status of the patients.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "ANEGMA: an automated negotiation model for e-markets",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10458-021-09513-x",
            "Abstract": "We present a novel negotiation model that allows an agent to learn how to negotiate during concurrent bilateral negotiations in unknown and dynamic e-markets. The agent uses an actor-critic architecture with model-free reinforcement learning to learn a strategy expressed as a deep neural network. We pre-train the strategy by supervision from synthetic market data, thereby decreasing the exploration time required for learning during negotiation. As a result, we can build automated agents for concurrent negotiations that can adapt to different e-market settings without the need to be pre-programmed. Our experimental evaluation shows that our deep reinforcement learning based agents outperform two existing well-known negotiation strategies in one-to-many concurrent bilateral negotiations for a range of e-market settings.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Towards a p2p discovery framework for an argumentative agent technology assisted grid",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=5972510548149874915&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Logic Programs, Norms and Action: Essays in Honor of Marek J. Sergot on the Occasion of His 60th Birthday",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=Huy5BQAAQBAJ&oi=fnd&pg=PR3&dq=info:QG6mH_P9vNcJ:scholar.google.com&ots=oAQV6aIH26&sig=-6pF_skqffvf4qLM6FoPfX4mTMM",
            "Abstract": "This book is dedicated to Marek Sergot, Professor in Computational Logic at Imperial College London, on the occasion of his 60th birthday. Professor Sergot’s scientific contributions range over many different fields. He has developed a series of novel ideas and formal methods bridging areas including artificial intelligence, computational logic, philosophical logic, legal theory, artificial intelligence and law, multi-agent systems and bioinformatics. By combining his background in logic and computing with his interest in the law, deontic logic, action, and related areas, and applying to all his capacity to understand the subtleties of social interaction and normative reasoning, Professor Sergot has opened up new directions of research, and has been a reference, an inspiration, and a model for many researchers in the fields to which he has contributed. The Festschrift includes several reminiscences and introductory essays describing Professor Sergot's achievements, followed by a series of articles on logic programming, temporal reasoning and action languages, artificial intelligence and law, deontic logic and norm-governed systems, and logical approaches to policies.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:dshw04ExmUIC",
            "Publisher": "Springer"
        },
        {
            "Title": "Run-time support for norm-governed systems",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/30777270/CSD-TR-10-01.pdf",
            "Abstract": "We present a knowledge representation framework with an associated run-time support infrastructure that is able to compute, for the benefit of the members within a norm-governed multi-agent system, physically possible and/or permitted actions current at each time, as well as sanctions that should be applied to violations of prohibitions. To offer the envisioned run-time support we study selected versions of the Event Calculus to support efficient temporal reasoning without compromising the expressive power required to specify the norms. Both the knowledge representation framework and its associated infrastructure are highly configurable in the sense that they can be appropriately distributed in order to support real-time responses to agent requests. To exemplify the ideas, we apply the infrastructure on a benchmark scenario for multi-agent systems. Through experimental evaluation we also show how distributing our infrastructure can provide run-time support to large-scale multi-agent systems regulated by norms.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:hMod-77fHWUC",
            "Publisher": "Technical Report CSD-TR-10-01, Royal Holloway, University of London, UK"
        },
        {
            "Title": "A multi-agent system for service discovery, selection and negotiation.",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.156.8285&rep=rep1&type=pdf",
            "Abstract": "Service-oriented computing can benefit from multi-agent system technologies by adopting the coordination mechanisms, interaction protocols, and decision-making tools designed for multi-agent systems. We demonstrate here the use of a fully decentralised multi-agent system supporting the discovery, selection, and negotiation of services.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Normative KGP agents",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10588-006-9539-5.pdf",
            "Abstract": "We extend the logical model of agency known as the KGP model, to support agents with normative concepts, based on the roles an agent plays and the obligations and prohibitions that result from playing these roles. The proposed framework illustrates how the resulting normative concepts, including the roles, can evolve dynamically during the lifetime of the agent. Furthermore, we illustrate how these concepts can be combined with the existing capabilities of KGP agents in order to plan for their goals, react to changes in the environment, and interact with other agents. Our approach gives an executable specification of normative concepts that can be used directly for prototyping applications.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "ORC: an Ontology Reasoning Component for diabetes",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/46037633/ORC_an_Ontology_Reasoning_Component_for_20160529-27068-u5gsx2.pdf",
            "Abstract": "ORC is an ontology reasoning component that builds upon existing ontology modelling tools and techniques to support the integration and interpretation of multimodal medical information. We show how to embed ORC as a reasoning capability in reactive infrastructure agents that support intelligent agents operating in COMMODITY12, a personal health environment for diabetic patients and the medical professionals that treat them. The benefits of the approach are illustrated by showing how medical information for patient profiles at different sources can be included in COMMODITY12, thus extending the generality and potential of the resulting system. The approach also illustrates how ontologies can be combined with a variety of artificial intelligence tools and techniques to support e-Health activities on the Internet, thus contributing towards the vision of NetMedicine.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Probabilistic programming with Gaussian process memoization",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1512.05665",
            "Abstract": "Gaussian Processes (GPs) are widely used tools in statistics, machine learning, robotics, computer vision, and scientific computation. However, despite their popularity, they can be difficult to apply; all but the simplest classification or regression applications require specification and inference over complex covariance functions that do not admit simple analytical posteriors. This paper shows how to embed Gaussian processes in any higher-order probabilistic programming language, using an idiom based on memoization, and demonstrates its utility by implementing and extending classic and state-of-the-art GP applications. The interface to Gaussian processes, called gpmem, takes an arbitrary real-valued computational process as input and returns a statistical emulator that automatically improve as the original process is invoked and its input-output behavior is recorded. The flexibility of gpmem is illustrated via three applications: (i) robust GP regression with hierarchical hyper-parameter learning, (ii) discovering symbolic expressions from time-series data by fully Bayesian structure learning over kernels generated by a stochastic grammar, and (iii) a bandit formulation of Bayesian optimization with automatic inference and action selection. All applications share a single 50-line Python library and require fewer than 20 lines of probabilistic code each.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On modelling declaratively multiagent systems",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.435.7966&rep=rep1&type=pdf",
            "Abstract": "We propose a declarative framework for modelling multiagent systems and specify a number of properties of these systems and agents within them. The framework is parametric with respect to an input/output semantics for agents, whereby inputs are the agents’ observations, and outputs are their actions. The observations include actions performed by other agents and events happening in the world. We define the semantics of a multi-agent system via a stability condition over the individual agents’ semantics. We instantiate the framework with respect to simple abductive logic agents. We illustrate the framework and the proposed properties by means of a simple example of agent negotiation.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated workflows using dialectical argumentation",
            "Publication year": 2007,
            "Publication url": "https://pure.mpg.de/pubman/faces/ViewItemOverviewPage.jsp?itemId=item_1786583",
            "Abstract": "This paper presents a framework for dynamic workflow creation and ex-ecution developed as part of ARGUGRID, a collaborative project that seeks to provide a new model for programming the Grid at a semantic, knowledge-based level of abstraction through the use of argumentative agent technology. In this framework, workflow selection is coordinated by agent interactions based upon a dialogue game that allows agents to argue about workflows and their properties.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pareto Bid Estimation for Multi-Issue Bilateral Negotiation under User Preference Uncertainty",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9494429/",
            "Abstract": "We study the problem of how an agent that negotiates over multiple issues with an opponent can make offers given that it has incomplete information about the user it represents and the opponent it plays against. To tackle this problem, we take a multi-objective optimization stance, where the negotiating agent estimates the preferences of both user and opponent to generate bids that are (near) Pareto-optimal. However, since the negotiating agent needs to approximate the actual preferences of two parties, uncertainty is involved. To handle this uncertainty, we propose a fuzzy approach consisting of a two-phase Pareto-bid generation step where Phase-I generates the non-dominated solutions using a fuzzy multi-objective evolutionary algorithm, and Phase II ranks them to find the best bid to offer the opponent using a fuzzy multiple-criteria decision-making method. Rigorous experimentation shows that the hybrid …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:MLfJN-KU85MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Situating cognitive agents in GOLEM",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-85029-8_9",
            "Abstract": "We investigate the application of a logic-based framework representing an agent environment as a composite structure that evolves over time. Such a complex structure contains the interaction between two main classes of entities: agents and objects. Interactions between these entities are specified in term of events whose occurrence is governed by a set of physical laws specifying the possible evolutions of the agent environment, including how these evolutions are perceived by agents and affect objects and processes in the agent environment. We illustrate the work using GOLEM, a protype platform whose aim is to implement the framework to build situated cognitive agents in a distributed agent environment.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Agents acquiring Resources through Social Positions: An Activity-based Approach",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.10.5643&rep=rep1&type=pdf",
            "Abstract": "The main assumption of this paper is that we will need to use artificial agent societies [1, 11] in order to manage intelligently the resources and the interactions envisaged in sociocognitive grids. We are motivated by scenarios where location-independent smartservices provide the social and cognitive resources that agents will need to acquire in order to satisfy their users' needs.More concretely, we are investigating the situation where an agent who is trying to achieve a goal in a specific environment realises that it needs to join an artificial agent society in that environment (or possibly in another environment), which possesses the resources necessary for the agent to achieve the goal [14]. For example, if you travel to a foreign place for business purposes, you would expect your agent to join the artificial agent society of a train station, so that you can receive advice on how to buy a train ticket [5].",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:9vf0nzSNQJEC",
            "Publisher": "i3"
        },
        {
            "Title": "Towards anticipatory service composition in ambient intelligence",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5536832/",
            "Abstract": "Anticipatory cognitive mechanisms have been investigated so far in gaze control or in simple robot navigation. This is in order to build cognitive systems endowed with the ability to predict the outcome of their actions. However, research on the actual benefit of anticipatory behavior in Ambient Intelligence (AmI) for user assistance is still in its infancy. This paper proposes some use cases to illustrate the benefits of anticipatory service composition in AmI, highlights issues resulting from the incorporation of anticipation into ubiquitous environments, comes up with guideline principles and existing approaches that have shown promising results to address the identified challenges, and emphasizes the questions and issues that still need a suitable research program before they can be addressed.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pervasive healthcare using self-healing agent environments",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-19917-2_20",
            "Abstract": "Pervasive healthcare systems (PHSs) are required to be constantly available to the patients accessing them. To address this issue, in this paper we present an agent-based PHS that self-heals one or more of its parts when a service disruption happens. We propose a multi-agent system (MAS) approach that utilises coordination, planning and the notion of agent environment to create a distributed system capable to heal itself even if 50% of the system is not functioning due to external causes.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Rule value reinforcement learning for cognitive agents",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1160633.1160773",
            "Abstract": "RVRL (Rule Value Reinforcement Learning) is a new algorithm which extends an existing learning framework that models the environment of a situated agent using a probabilistic rule representation. The algorithm attaches values to learned rules by adapting reinforcement learning. Structure captured by the rules is used to form a policy. The resulting rule values represent the utility of taking an action if the rule's conditions are present in the agent's current percept. Advantages of the new framework are demonstrated, through examples in a predator-prey environment.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Organized Adaption in Multi-Agent Systems: First International Workshop, OAMAS 2008, Estoril, Portugal, May 13, 2008. Revised and Invited Papers",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=XMa6BQAAQBAJ&oi=fnd&pg=PR2&dq=info:k56G5wES-hoJ:scholar.google.com&ots=ahK489GQlb&sig=UGj3CwssCQzI1df6j6IsTJpdpWU",
            "Abstract": "Adaptation, for purposes of self-healing, self-protection, self-management, or self-regulation, is currently considered to be one of the most challenging pr-erties of distributed systems that operate in dynamic, unpredictable, and-tentially hostile environments. Engineering for adaptation is particularly c-plicated when the distributed system itself is composed of autonomous entities that, on one hand, may act collaboratively and with benevolence, and, on the other, maybehavesel? shlywhilepursuingtheirowninterests. Still, theseentities have to coordinate themselves in order to adapt appropriately to the prevailing environmental conditions, and furthermore, to deliberate upon their own and the system’s con? guration, and to be transparent to their users yet consistent with any human requirements. The question, therefore, of “how to organize the envisagedadaptationforsuchautonomousentitiesinasystematicway” becomes of paramount importance. The? rst international workshop on “Organized Adaptation in Multi-Agent Systems”(OAMAS) was a one-day event held as part of the workshop p-gram arranged by the international conference on Autonomous Agents and Multi-Agent Systems (AAMAS). It was hosted in Estoril during May, 2008, and was attended by more than 30 researchers. OAMAS was the steady convergence of a number of lines of research which suggested that such a workshop would be timely and opportune. This includes the areas of autonomic computing, swarm intelligence, agent societies, self-organizing complex systems, and ‘emergence’in general.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer"
        },
        {
            "Title": "Auto-adaptation dans l'architecture V3A par une argumentation sur les motivations propres",
            "Publication year": 2008,
            "Publication url": "https://hal-emse.ccsd.cnrs.fr/hal-00405608/",
            "Abstract": "École des Mines de Saint-Étienne - Auto-adaptation dans l'architecture V3A par une \nargumentation sur les motivations propres Accéder directement au contenu Accéder \ndirectement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL \nListe des portails AURéHAL API Data Documentation Episciences.org Episciences.org \nRevues Documentation Sciencesconf.org Support Mines de Saint-Etienne HAL - hal.archives-ouvertes.fr \nAccueil Déposer Rechercher Consulter Par date de publication Par domaine Par type de \npublication Par départements et Centres Par auteur de l'école hal-00405608, version 1 \nCommunication dans un congrès Auto-adaptation dans l'architecture V3A par une \nargumentation sur les motivations propres M. Morge 1 K. Stathis Laurent Vercouter 1 \nDétails 1 SMA-ENSMSE - Département Systèmes Multi-Agents Type de document : \nCommunication dans un congrès Liste des ://.-.…",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An agent architecture for concurrent bilateral negotiations",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11364-7_8",
            "Abstract": "We present an architecture that makes use of symbolic decision-making to support agents participating in concurrent bilateral negotiations. The architecture is a revised version of previous work with the KGP model [12, 23], which we specialise with knowledge about the agent’s self, the negotiation opponents and the environment. Our work combines the specification of domain-independent decision-making with a new protocol for concurrent negotiation that revisits the well-known alternating offers protocol [22]. We show how the decision-making can be specialised to represent the agent’s strategies, utilities and preferences using a Prolog-like meta-program. The work prepares the ground for supporting decision-making in concurrent bilateral negotiations that is more lightweight than previous work and contributes towards a fully developed model of the architecture.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Sit-to-Stand Movement Recognition Using Kinect",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-17091-6_13",
            "Abstract": "This paper examines the application of machine-learning techniques to human movement data in order to recognise and compare movements made by different people. Data from an experimental set-up using a sit-to-stand movement are first collected using the Microsoft Kinect input sensor, then normalized and subsequently compared using the assigned labels for correct and incorrect movements. We show that attributes can be extracted from the time series produced by the Kinect sensor using a dynamic time-warping technique. The extracted attributes are then fed to a random forest algorithm, to recognise anomalous behaviour in time series of joint measurements over the whole movement. For comparison, the k-Nearest Neighbours algorithm is also used on the same attributes with good results. Both methods’ results are compared using Multi-Dimensional Scaling for clustering visualisation.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Crafting the mind of PROSOCS agents",
            "Publication year": 2006,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08839510500479496",
            "Abstract": " PROSOCS agents are software agents that are built according to the KGP model of agency. KGP is used as a model for the mind of the agent, so that the agent can act autonomously using a collection of logic theories, providing the mind's reasoning functionalities. The behavior of the agent is controlled by a cycle theory that specifies the agent's preferred patterns of operation. The implementation of the mind's generic functionality in PROSOCS is worked out in such a way so it can be instantiated by the platform for different agents across applications. In this context, the development of a concrete example illustrates how an agent developer might program the generic functionality of the mind for a simple application.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "An adaptive multi-agent system for task reallocation in a MapReduce job",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0743731521000617",
            "Abstract": "We study the problem of task reallocation for load-balancing of MapReduce jobs in applications that process large datasets. In this context, we propose a novel strategy based on cooperative agents used to optimize the task scheduling in a single MapReduce job. The novelty of our strategy lies in the ability of agents to identify opportunities within a current unbalanced allocation, which in turn triggers concurrent and one-to-many negotiations amongst agents to locally reallocate some of the tasks within a job. Our contribution is that tasks are reallocated according to the proximity of the resources and they are performed in accordance to the capabilities of the nodes in which agents are situated. To evaluate the adaptivity and responsiveness of our approach, we implement a prototype test-bed and conduct a vast panel of experiments in a heterogeneous environment and by exploring varying hardware configurations …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:gsN89kCJA0AC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "The agent argumentation architecture revisited",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Kostas-Stathis/publication/228943660_The_agent_argumentation_architecture_revisited/links/09e415099168494574000000/The-agent-argumentation-architecture-revisited.pdf",
            "Abstract": "The Agent Argumentation Architecture (AAA) has been recently proposed [1] as an abstract model by means of which an autonomous agent argues with itself to manage its motivations and arbitrate its possibly conflicting internal goals. In an attempt to show how the AAA model can be instantiated, we revisit the original model with a concrete argumentation framework illustrating how the internal dialectic process can be specified as a dialogue-game between internal components representing the agent’s mental faculties. The resulting framework is exemplified with an intuitive case, illustrating the importance of argumentation to develop models of cognitive agents with motivations.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "SOCS prototype",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=1256398461002292741&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:bnK-pcrLprsC",
            "Publisher": "Technical report, SOCS Consortium, 2003. Deliverable"
        },
        {
            "Title": "Message from the workshop chairs SEISMYC 2010",
            "Publication year": 2011,
            "Publication url": "https://pure.ulster.ac.uk/en/publications/message-from-the-workshop-chairs-seismyc-2010",
            "Abstract": "Presents the introductory welcome message from the conference proceedings. May include the conference officers' congratulations to all involved with the conference event and publication of the proceedings record.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special Issue on Agents",
            "Publication year": 2001,
            "Publication url": "https://eprints.soton.ac.uk/257663/1/aisb_editorial.pdf",
            "Abstract": "For the last two decades, agent-based technology has been applied to building intelligent systems. The ability of agents to make their own decisions and adapt to and learn from their environment is a very powerful tool for implementing intelligent systems of general competence. In addition, the study of multi-agent systems—collections of specialised agents working in parallel—has helped us to solve complex problems not previously solved using a centralised approach. Moreover, agent-based simulators have been used to better understand cooperation and competition in society. It is therefore not surprising that agent-based systems have been successful in many varied domains, including E-commerce, online learning, medicine, entertainment, human-computer interaction, business management, traffic control and conflict simulation. Because agent technology is such a key area of Artificial Intelligence, and as Britain is strongly represented in this area, the Society for the Study of Artificial Intelligence and the Simulation of Behaviour decided to make agent technology the theme of their 2001 convention (AISB’01), held in York. Five invited talks in the plenary sessions at AISB’01 were on agent-based topics. Nick Jennings discussed “Automated Haggling: Building Artificial Negotiators”, Lyndon Lee described the “Multi-Agent Research at British Telecom”, Andrew Jones spoke “On the Concept of Trust”, Christoph Benzmüller presented “An Agent Based Approach to Reasoning” and Jim Doran described “Agents and Ecosystem Management: from the Fraser River to Boolean Networks”. Furthermore, the convention included symposia on (a …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Autonomic computing with self-governed super-agents",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5729600/",
            "Abstract": "This position paper explores the possibility of building autonomic systems using super-agents, virtual organizations of one or more agents that seek to govern a complex resource. The paper discusses first a control-loop suitable for building self-governed agents as an attempt to extend the original idea of autonomic managers with self-governance. It then sketches the structure of super-agents and discusses the main challenges of applying these ideas to self-governed autonomic systems.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Commodity 12: A smart e-health environment for diabetes management",
            "Publication year": 2013,
            "Publication url": "https://content.iospress.com/articles/journal-of-ambient-intelligence-and-smart-environments/ais220",
            "Abstract": "We present the development of COMMODITY12, a Personal Health System (PHS) to assist in the provision of continuous and personalised health services to diabetic patients, thus empowering their lifestyle regardless of their location. COMMODITY12 consists of ambient, wearable and portable devices, which acquire, monitor and communicate physiological parameters and other health-related context of an individual, such as physical activity and vital body signals. This data is interpreted by intelligent agents that use expert biomedical knowledge to derive important insights about the individual’s health status, which are then presented in the form of active feedback to the patient directly from the device, or via health professionals who assist in diagnosis, treatment and life management. The emphasis of the work is on the design of the PHS in terms of its main components, their integration and deployment to address …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:738O_yMBCRsC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Ambient Intelligence",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-03062-9.pdf",
            "Abstract": "The purpose of the European Conference on Ambient Intelligence (AmI) is to promote work that studies how to bring intelligence to our everyday environments in order to make these environments sensitive to us, as well as support scientific exchanges among Ambient Intelligence researchers, practitioners, scientists, and engineers in affiliated disciplines not only from Europe but from around the globe. After skipping the 2016 edition, this year’s conference, AmI 2018, seeks to maintain the momentum of last year’s event to keep the interdisciplinary research community interested in the field of Ambient Intelligence and related fields such as Internet of Things, Cyber-physical Systems and Artificial Intelligence. We have approached these areas from points of view ranging from Computer Science and Engineering, to Psychology and Social Sciences to Design and Architecture. Technologies that once were simply part of …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Sensor network grids: agent environments combined with QoS in wireless sensor networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4437924/",
            "Abstract": "We present a distributed systems architecture that uses Grid computing to combine basic nodes of wireless sensor networks with complex sensor nodes of wired networks. Three kinds of complex sensor nodes are identified: objects, agents and containers. The decision making capabilities of the complex nodes are then combined with a quality of service (QoS) framework for gathering data from the wireless sensor nodes. The resulting combination provides a powerful conceptual framework for developing ambient intelligence and ubiquitous computing applications on the grid.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive multi-agent system for situated task allocation",
            "Publication year": 2019,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02137346/document",
            "Abstract": "Multi-agent scheduling [1, 2, 4, 8, 10–17, 20, 22–25] has received significant attention in tackling the problem of load balancing and task allocation in distributed systems. Apart from dividing the work through decentralization, we consider dynamicity because allocation of tasks must be concurrent with their execution, and adaptation because tasks must be reallocated when a disruptive event is performed. We will assume that agents are fully distributed and cooperative in order to optimize the global runtime, ie a systemcentric metric rather than user-centric metrics [10–13, 20, 24]. We will also assume that a task can be performed by any single agent without preemption and precedence order. Moreover, tasks have no deadlines, are indivisible and not shareable.We follow a market-based approach [10–13, 20, 24] to tackle the multi-agent situated task allocation problem. In order to improve load balancing, agents adopt a locality-based strategy in concurrent one-to-many negotiations for task delegations. The task reallocation is dynamic since the negotiation process is iterated and concurrent with the tasks processing. Moreover, the system is adaptive to disruptive events, eg task consumptions. As a practical application, we consider the distributed deployment of the MapReduce design pattern for processing large datasets [9]. Our preliminary empirical results show that, for such an application, the locality-based strategy improves the runtime.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:EkHepimYqZsC",
            "Publisher": "International Foundation for Autonomous Agents andMultiagent Systems"
        },
        {
            "Title": "Ambient Intelligence: Human-Agent Interaction in Connected Communities",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=5965207401547856919&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:uWiczbcajpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentative agents for service-oriented computing",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33323-1_9",
            "Abstract": "We propose an argumentation-based agent model that supports service and partner selection in service-oriented computing settings. In this model, argumentation is also used to help agents resolve conflicts between themselves, whenever negotiation is required for the provision of complex services. The model relies upon an argumentation framework that is used in a modular architecture where Knowledge, Goals, Decisions and Priorities are manipulated by three specialized modules dealing with decision making, communication and negotiation.We formulate a distributed e-procurement process to illustrate how our agents select services and partners and can negotiate with one another.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Decision making with a KGP agent system",
            "Publication year": 2006,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.3166/jds.15.241-266",
            "Abstract": "A human user is centrally involved in a Decision Support System (DSS) task, whereas for an autonomous agent system, a user’s role is a more abstract notion of oversight and approval. In this paper, we examine the potential integration of a multi-agent architecture into a DSS. The motivation in this work is to utilise autonomous agent problemsolvers within a suitable multi-agent framework in such a way as to realise and generalise the capabilities of a DSS, while maintaining the DSS characteristic of significant user involvement. The approach taken is to employ agents both as domain problem solvers as well as to manage the interaction with the user as part of the semi-autonomous design. A framework for agent-enhanced DSS is presented which is more general than those presented previously. We show how the architectural framework used for KGP agents can be specialised to realise enhanced DSS capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:4DMP91E08xMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Open Game Tournaments in STARLITE.",
            "Publication year": 2015,
            "Publication url": "http://www.ifaamas.org/Proceedings/aamas2015/aamas/p1927.pdf",
            "Abstract": "STARLITE is a novel web-based agent platform that allows open, dynamic execution of agent simulations. Using STARLITE researchers can start simulations as web applications whose URI can then be used by other researchers to inspect progress with these simulations and deploy their agents on them dynamically to test their behaviour and performance. We describe the overall architecture of STARLITE and exemplify its main features through a tournament simulation for the Iterated Prisoner’s Dilemma (IPD).",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experiences in automated workflows using dialectical argumentation",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/51321874/iadis07.pdf",
            "Abstract": "This paper presents a multi-agent framework based on argumentative agent technology for the automation of the workflow selection and execution. In this framework, workflow selection is coordinated by agent interactions governed by the rules of a dialogue game whose purpose is to evaluate the workflow's properties via argumentation. Once a workflow is selected using this process, the workflow is executed by dynamically configuring workflow engines to coordinate the participating agents' workflow activities.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Coordination, Organizations, Institutions, and Norms in Agent Systems V",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-14962-7.pdf",
            "Abstract": "This volume is the fifth in a series that started in 2005, collecting papers from the Coordination, Organizations, Institutions and Norms (COIN) Workshops. The papers in this volume are drawn from the three meetings that took place in 2009.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MagnetDroid: security-oriented analysis for bridging privacy and law for Android applications",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3322640.3326729",
            "Abstract": "MagnetDroid is a novel artificial intelligence framework that integrates a security ontology, a multi-agent organisation, and a logical reasoning procedure to help build a bridge between the worlds of Android application analysis and law, with respect to privacy. Our contribution helps identify violations of the law by Android applications, as well as predict legal consequences. The resulting implementation of MagnetDroid can be useful to privacy-concerned users in order to acknowledge problems with the privacy of the applications they use, to application developers/publishers to help them identify which problems to fix, and to lawyers in order to provide an additional level of interpretation for any court when considering the privacy of Android applications.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:epqYDVWIO7EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Toward a modular architecture of argumentative agents to compose services",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.111.434&rep=rep1&type=pdf",
            "Abstract": "In this paper, we present a model of agents which use argumentation to select and compose services in open and distributed environments. For this purpose, we propose a modular agent architecture using three main modules, dedicated, respectively, to decision making, communication, and negotiation. We deploy a simple “virtual” travel agent example to illustrate how our agents select and compose services, focusing on the functionalities of the modules within the agents.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A game-based architecture for developing interactive components in computational logic",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.15.375",
            "Abstract": "We present a game-based architecture for developing complex interactive components in computational logic. Interactive components are developed either as players making moves according to the rules of a game or as umpires that enforce the rules, thereby controlling the behaviours of players. Centralised organisations based on umpires and decentralised organisations based on autonomous players can then be combined to produce interactive systems of a very complex nature. The potential",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agent‐oriented activity recognition in the event calculus: An application for diabetic patients",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/coin.12121",
            "Abstract": "We present a knowledge representation framework on the basis of the Event Calculus that allows an agent to recognize complex activities from low‐level observations received by multiple sensors, reason about the life cycle of such activities, and take action to support their successful completion. Activities are multivalue fluents that change according to events that occur in the environment. The parameters of an activity consist of a unique label, a set of participants involved in the performing of the activity, and a unique goal associated with the activity revealing the activity's desired outcome. Our contribution is the identification of an activity life cycle describing how activities can be started, interrupted, suspended, resumed, or completed over time, as well as how these can be represented. The framework also specifies activity goals, their associated life cycle, and their relation with the activity life cycle. We provide the …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ambient Intelligence: Human–Agent Interactions in a Networked Community",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/1-84628-601-8_12",
            "Abstract": "It is a weekend morning and you are having coffee and a chat with some friends in your local café. However, this is no ordinary café. It is a caf equipped to serve the communication needs of a new type of social context–the digitally connected community. This particular locale is a digital milieu in which information is both ubiquitous and location-independent and it is displayed in advanced communication devices that are embedded in the physical ambience of the neighbourhood. Afeature of these communication devices is that they are densely populated with agents of a special type. In this instance these are software agents, performing autonomously a variety of support roles for the local people. In the example of the café in question, these agents may inhabit, for instance, the coffee tables, the customers’ mobile phones and their personal electronic key ring tokens.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Building next generation Service-Oriented Architectures using argumentation agents",
            "Publication year": 2006,
            "Publication url": "https://dl.gi.de/bitstream/handle/20.500.12116/24098/GI-Proceedings-88-17.pdf?sequence=1",
            "Abstract": "1Department of Computing, Imperial College, 180 Queen’s Gate, London, SW7 2AZ, United Kingdom 2InforSense, 459a Fulham Road, London, SW10 9UZ, United Kingdom 3Department of Computing, City University, Northampton Square, London, EC1V 0HB, United Kingdom vc100@ doc. ic. ac. uk, mmg@ inforsense. com, yg@ inforsense. com,, kostas@ soi. city. ac. uk, ft@ doc. ic. ac. uk,",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Gesellschaft für Informatik eV"
        },
        {
            "Title": "Arguing over Motivations within the V3A-Architecture for Self-Adaptation.",
            "Publication year": 2009,
            "Publication url": "https://core.ac.uk/download/pdf/52620039.pdf",
            "Abstract": "The Vowel Agent Argumentation Architecture (V3A) is an abstract model by means of which an autonomous agent argues with itself to manage its motivations and arbitrate its possible internal conflicts. We propose an argumentation technique which specifies the internal dialectical process and a dialogue-game amongst internal components which can dynamically join/leave the game, thus having the potential to support the development of self-adaptive agents. We exemplify this dialectical representation of the V3A model with a scenario, whereby components of the agent’s mind called facets can be automatically downloaded to argue an agent’s motivation.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Concurrent bilateral negotiation for open e-markets: the CONAN strategy",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-017-1125-2",
            "Abstract": "We develop a novel strategy that supports software agents to make decisions on how to negotiate for a resource in open and dynamic e-markets. Although existing negotiation strategies offer a number of sophisticated features, including modelling an opponent and negotiating with many opponents simultaneously, they abstract away from the dynamicity of the market and the model that the agent holds for itself in terms of ongoing negotiations, thus ignoring information that increases an agent’s utility. Our proposed strategy COncurrent Negotiating AgeNts (Conan) considers a weighted combination of modelling the market environment and the progress of concurrent negotiations in which the agent partakes. We conduct extensive experiments to evaluate the strategy’s performance in various settings where different opponents from the literature provide a competitive market. Our experiments provide …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Software Anatomy of a KGP Agent.",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.216.2262&rep=rep1&type=pdf",
            "Abstract": "While there is much work in the literature on agent component technologies, there are comparatively few results on the engineering issues arising from the integration of these technologies into a complete and coherent agent architecture. This paper addresses these issues from both implementation and general architectural design point of view. The KGP (Knowledge, Goals and Plan) agent model developed in the EU SOCS project (IST-2001 32530) is used as an example to illustrate these engineering issues.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special Issue on Agent Technology",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.160.3477&rep=rep1&type=pdf#page=5",
            "Abstract": "For the last two decades, agent-based technology has been applied to building intelligent systems. The ability of agents to make their own decisions and adapt to and learn from their environment is a very powerful tool for implementing intelligent systems of general competence. In addition, the study of multi-agent systems—collections of specialised agents working in parallel—has helped us to solve complex problems not previously solved using a centralised approach. Moreover, agent-based simulators have been used to better understand cooperation and competition in society. It is therefore not surprising that agent-based systems have been successful in many varied domains, including ecommerce, online learning, medicine, entertainment, human-computer interaction, business management, traffic control and conflict simulation. Because agent technology is such a key area of Artificial Intelligence, and as Britain is strongly represented in this area, the Society for the Study of Artificial Intelligence and the Simulation of Behaviour decided to make agent technology the theme of their 2001 convention (AISB’01), held in York. Five invited talks in the plenary sessions at AISB’01 were on agent-based topics. Nick Jennings discussed “Automated Haggling: Building Artificial Negotiators”, Lyndon Lee described the “Multi-Agent Research at British Telecom”, Andrew Jones spoke “On the Concept of Trust”, Christoph Benzmüller presented “An Agent Based Approach to Reasoning” and Jim Doran described “Agents and Ecosystem Management: from the Fraser River to Boolean Networks”. Furthermore, the convention included symposia on (a) Software …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:JQOojiI6XY0C",
            "Publisher": "Society for the Study of Artificial Intelligence and Simulation of Behaviour"
        },
        {
            "Title": "Living memory: agent-based information management for connected local communities",
            "Publication year": 2002,
            "Publication url": "https://academic.oup.com/iwc/article-abstract/14/6/663/873049",
            "Abstract": "We investigate the application of multi-agent systems to develop intelligent information interfaces for connected communities, a class of computer applications aimed at enhancing the way people interact and socialise in geographically co-located communities such as neighbourhoods. In this context, we study the problem of providing effective information management in support of social interaction when a diverse range of computing devices is employed. The novelty of our approach is based on combining innovative interactive devices with a framework based on agent roles in order to support the effective flow of community-related content for the people of a given locality. In particular, we have integrated existing techniques for information retrieval and filtering with measures of content popularity, to ensure that documents in the community system are optimally available. After reporting on the potential …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Activity recognition for diabetic patients using a smartphone",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10916-016-0598-y",
            "Abstract": "Diabetes is a disease that has to be managed through appropriate lifestyle. Technology can help with this, particularly when it is designed so that it does not impose an additional burden on the patient. This paper presents an approach that combines machine-learning and symbolic reasoning to recognise high-level lifestyle activities using sensor data obtained primarily from the patient’s smartphone. We compare five methods for machine-learning which differ in the amount of manually labelled data by the user, to investigate the trade-off between the labelling effort and recognition accuracy. In an evaluation on real-life data, the highest accuracy of 83.4 % was achieved by the MCAT method, which is capable of gradually adapting to each user.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:ye4kPcJQO24C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Computational Logic in Multi-Agent Systems: 6th International Workshop, CLIMA VI, London, UK, June 27-29, 2005, Revised Selected and Invited Papers",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=YEH6BwAAQBAJ&oi=fnd&pg=PA1&dq=info:c1KbHYuAfwEJ:scholar.google.com&ots=LcOEq1D43S&sig=v0muPysDUZ_kJ_pMCeGfE51FW20",
            "Abstract": "This book constitutes the strictly refereed post-proceedings of the 6th International Workshop on Computational Logic for Multi-Agent Systems, CLIMA VI. The book presents 14 revised full technical papers, 4 contest papers, and 7 invited papers together with 1 invited article are organized in topical sections on foundational aspects of agency, agent programming, agent interaction and normative systems, the first CLIMA contest, and on the project report of the SOCS project.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:vDijr-p_gm4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Internalizing unknown objects by means of perception and communication in multi-agent systems",
            "Publication year": 2009,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/27838",
            "Abstract": "Very commonly, multi-agent systems built for ubiquitous computing and ambient intelligence applications require from their members to perform collaborative tasks or to attempt to communicate regarding potentially unknown objects in their environment. The specific class of this type of systems that constitutes the domain for the proposed research defines multi-agent systems utilizing agents that encompass high-level symbolic name worlds that are linked to their environment via low level sensory input. A successful outcome when attempting collaborative tasks in such systems is always dependent on the ability of the agents to refer to the correct objects in their communication. In my research I will pursue an approach towards confronting the above problem and propose a solution. This solution will be applied in this category of multi-agent systems enabling them to deal with the imperative to verify that all agents refer …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:u9iWguZQMMsC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Models for Multi-agent Systems-Stable Multi-agent Systems",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=7754768625890161689&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Automatic detection of microaneurysms in diabetic retinopathy fundus images using the L*a*b color space",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-33-1-74",
            "Abstract": "We develop an automated image processing system for detecting microaneurysm (MA) in diabetic patients. Diabetic retinopathy is one of the main causes of preventable blindness in working age diabetic people with the presence of an MA being one of the first signs. We transform the eye fundus images to the L*a*b* color space in order to separately process the L* and a* channels, looking for MAs in each of them. We then fuse the results, and last send the MA candidates to a k-nearest neighbors classifier for final assessment. The performance of the method, measured against 50 images with an ophthalmologist’s hand-drawn ground-truth, shows high sensitivity (100%) and accuracy (84%), and running times around 10 s. This kind of automatic image processing application is important in order to reduce the burden on the public health system associated with the diagnosis of diabetic retinopathy given the high …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:HE397vMXCloC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A Service-oriented approach for Ubiquitous Agents in AmI Systems using EVATAR",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agents and Environments",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=1921568365346164603&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:5nxA0vEk-isC",
            "Publisher": "Technical report, SOCS Consortium, 2002. IST32530/CITY/005/DN/I/a1"
        },
        {
            "Title": "DISECT: A Distributed Environment for simulating E-commerce Contracts",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer Berlin / Heidelberg"
        },
        {
            "Title": "Reinforcement Learning Preface",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=12169900302182789941&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "ACADEMIC PRESS INC ELSEVIER SCIENCE"
        },
        {
            "Title": "Intelligence and interaction in community-based systems",
            "Publication year": 2002,
            "Publication url": "https://academic.oup.com/iwc/article-abstract/14/6/639/873015",
            "Abstract": "In a world of virtual and real communities, this special issue ofInteracting with Computers' focuses on the real. The issue addresses the communication needs of physical co-located communities, those lay people who may live next-door, frequent the local pub, send their children to the same school, or bump into each other intermittently at meetings of local societies or professional associations. This is then the world of informal and spontaneous interactions located in a set of concentric patterns of personal, familial, social and civic circles.The context represents a major challenge for the profession of human±computer interaction to construct information technologies that support the interactions of ordinary people in these social settings. With pervasive internetworking, computers have become an extremely effective and economic means by which people communicate. A new generation of applications further …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Internet Commerce Developmnent; Craig Standing",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/46037626/s0736-5853_2801_2900001-620160529-19853-7wge83.pdf",
            "Abstract": "• external funding is usually limited to a fixed time period after which many projects fail; • \ntechnical and entrepreneurial Page 1 • external funding is usually limited to a fixed time \nperiod after which many projects fail; • technical and entrepreneurial skills are often missing \ningredients in failed projects; • community champions play a major role in driving projects; • \nengagement of local people is essential at all stages, especially the initial planning; • \ntelecomms infrastructure can both create and destroy projects; • private/public/community \npartnerships show promise for the future; • rapidly changing technologies have to be \nadapted to. Despite all these challenges, this book offers real hope that developing \ntechnologies, improved telecomms infrastructures and more accessible and usable \napplications with an easy to use web interface, will bring a utopian future global society \nwithin reach. Community Informatics will have a to `…",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:_xSYboBqXhAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Proceedings of the 5th international conference on Coordination, organizations, institutions, and norms in agent systems",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1886594",
            "Abstract": "Proceedings of the 5th international conference on Coordination, organizations, institutions, \nand norms in agent systems | Guide Proceedings ACM Digital Library home ACM home \nGoogle, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search \nJournals Magazines Proceedings Books SIGs Conferences People More Search ACM \nDigital Library SearchSearch Advanced Search Browse Browse Digital Library Collections \nMore HomeBrowse by TitleProceedingsCOIN'09 ABSTRACT No abstract available. \nComments Login options Check if you have access through your login credentials or your \ninstitution to get full access on this article. Sign in Full Access Get this Publication \nInformation Contributors Published in Guide Proceedings cover image COIN'09: \nProceedings of the 5th international conference on Coordination, organizations, institutions, \nand norms in agent systems May 2009 316 ISBN:…",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "The KGP model of agency for global computing: Computational model and prototype implementation",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-31794-4_18",
            "Abstract": "We present the computational counterpart of the KGP (Knowledge, Goals, Plan) declarative model of agency for Global Computing. In this context, a computational entity is seen as an agent developed using Computational Logic tools and techniques. We model a KGP agent by relying upon a collection of capabilities, which are then used to define a collection of transitions, to be used within logically specified, context sensitive control theories, which we call cycle theories. In close relationship to the declarative model, the computational model mirrors the logical architecture by specifying appropriate computational counterparts for the capabilities and using these to give the computational models of the transitions. These computational models and the one specified for the cycle theories are all based on, and are significant extensions of, existing proof procedures for abductive logic programming and logic …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "SMART (Stochastic Model Acquisition with ReinforcemenT) learning agents: A preliminary report",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-32274-0_5",
            "Abstract": "We present a framework for building agents that learn using SMART, a system that combines stochastic model acquisition with reinforcement learning to enable an agent to model its environment through experience and subsequently form action selection policies using the acquired model. We extend an existing algorithm for automatic creation of stochastic strips operators [9] as a preliminary method of environment modelling. We then define the process of generation of future states using these operators and an initial state and finally show the process by which the agent can use the generated states to form a policy with a standard reinforcement learning algorithm. The potential of SMART is exemplified using the well-known predator prey scenario. Results of applying SMART to this environment and directions for future work are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An agent development framework based on social positions",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1401062/",
            "Abstract": "We present an approach based on the concepts of roles, skills and social positions to enhance and support the interaction between users within social environments. It advocates the use of artificial agent societies as a complement to human societies and assumes that agents would need to join such a society' in order to realise user goals. A user's agent would apply to join a society under a certain social position; acceptance of the application would result in a number of roles and skills to be added to it. This work is a more detailed description of the framework presented in Leakas, G. and Stathis, K. (2003).",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ambient intelligence",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/ambient-intelligence/10230",
            "Abstract": "In recent years much research and development effort has been directed towards the broad field of ambient intelligence (AmI), and this trend is set to continue for the foreseeable future. AmI aims at seamlessly integrating services within smart infrastructures to be used at home, at work, in the car, on the move, and generally in most environments inhabited by people. It is a relatively new paradigm rooted in ubiquitous computing, which calls for the integration and convergence of multiple disciplines, such as sensor networks, portable devices, intelligent systems, human-computer and social interactions, as well as many techniques within artificial intelligence, such as planning, contextual reasoning, speech recognition, language translation, learning, adaptability, and temporal and hypothetical reasoning. The term AmI was coined by the European Commission, when in 2001 one of its Programme Advisory Groups …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A dialectic architecture for computational autonomy",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-25928-2_21",
            "Abstract": "This paper takes the view that to be considered autonomous, a software agent must possess the means by which to manage its own motivations and so arbitrate between competing internal goals. Using the motivational theories of Abraham Maslow as a starting point, we investigate the role that argumentation processes might play in balancing the many competing aspects of a whole agent’s motivational agenda. This is developed into an Agent Argumentation Architecture (AAA) in which multiple “faculties” argue for different aspects of the total behavior of the Agent. The overall effect of these internal arguments then defines which actions the agent will select for expression, and so define the overt and observable “personality” of the agent.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Playing with agent coordination patterns in MAGE",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-14962-7_6",
            "Abstract": "MAGE (Multi-Agent Game Environment) is a logic-based framework that uses games as a metaphor for representing complex agent activities within an artificial society. More specifically, MAGE seeks to (a) reuse existing computational techniques for norm-based interactions and (b) complement these techniques with a coordination component to support complex interactions. The reuse part of MAGE relates physical actions that happen in an agent environment to count as valid moves of a game representing the social environment of an application. The coordination part of MAGE supports the construction of composite games built from component sub-games and corresponds to coordination patterns that support complex activities built from sub-activities. To illustrate the MAGE approach, we discuss how to use the framework to specify the coordination patterns required to form a virtual organisation in the …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Open objects for ambient intelligence",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34898-3_23",
            "Abstract": "We present the Open Object, a framework for distributing capabilities over a system of inter-connected physical objects. We focus on allowing lightweight objects to not only share their capabilities with other objects but also to outsource capabilities when needed, in order to fulfil a user’s goal. We exemplify our approach with a smart home scenario and a service-oriented implementation.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Access-as-you-need: a computational logic framework for accessing resources in artificial societies",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-39173-8_10",
            "Abstract": "We investigate the application of abductive logic programming, an existing framework for knowledge representation and reasoning, for specifying the knowledge and behaviour of software agents that need to access resources in a global computing environment. The framework allows agents that need resources to join artificial societies where those resources are available. We show how to endow agents with the capability of becoming and ceasing to be members of societies, for different categories of artificial agent societies, and of requesting and being given or denied resources within societies. The strength of our formulation lies in combining the modelling and the computational properties of abductive logic programming for dealing with the issues arising in resource access within artificial agent societies.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Monitoring gestational diabetes mellitus with cognitive agents and agent environments",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6040666/",
            "Abstract": "This paper presents an agent-based pervasive healthcare system (PHS) to support pregnant women with Gestational Diabetes Mellitus (GDM). Such an infrastructure uses a mobile application to monitor patients affected by GDM, whose parameters are then sent to and analysed by cognitive agents. We utilise a symbolic reasoning approach to formalise the events happening in the system, the entities participating in the interaction and the agent cognitive model for continuous monitoring of GDM. Such a cognitive model is based on deductive treatment adjustment rules to provide doctors with indications about the patient's treatment and on abductive rules to provide a diagnosis of the illness' current state. We evaluate our system by means of medical data to assess the precision of our infrastructure.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A logic-based approach to model computees",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.160.8415",
            "Abstract": "a computational logic model for the description, analysis and verification of global and open societies of heterogeneous computees IST-2001-32530 Deliverable D4: A logic-based approach to model computees Project number:",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A deep reinforcement learning approach to concurrent bilateral negotiation",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2001.11785",
            "Abstract": "We present a novel negotiation model that allows an agent to learn how to negotiate during concurrent bilateral negotiations in unknown and dynamic e-markets. The agent uses an actor-critic architecture with model-free reinforcement learning to learn a strategy expressed as a deep neural network. We pre-train the strategy by supervision from synthetic market data, thereby decreasing the exploration time required for learning during negotiation. As a result, we can build automated agents for concurrent negotiations that can adapt to different e-market settings without the need to be pre-programmed. Our experimental evaluation shows that our deep reinforcement learning-based agents outperform two existing well-known negotiation strategies in one-to-many concurrent bilateral negotiations for a range of e-market settings.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:EYYDruWGBe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A RESTful middleware for AI controlled sensors, actuators and smart devices",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s12652-019-01439-3",
            "Abstract": "The numerous applications of internet of things (IoT) and sensor networks combined with specialized devices used in each has led to a proliferation of domain specific middleware, which in turn creates interoperability issues between the corresponding architectures and the technologies used. But what if we wanted to use a machine learning algorithm to an IoT application so that it adapts intelligently to changes of the environment, or enable a software agent to enrich with artificial intelligence (AI) a smart home consisting of multiple and possibly incompatible technologies? In this work we answer these questions by studying a framework that explores how to simplify the incorporation of AI capabilities to existing sensor-actuator networks or IoT infrastructures making the services offered in such settings smarter. Towards this goal we present eVATAR+, a middleware that implements the interactions within the context …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Learnable strategies for bilateral agent negotiation over multiple issues",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2009.08302",
            "Abstract": "We present a novel bilateral negotiation model that allows a self-interested agent to learn how to negotiate over multiple issues in the presence of user preference uncertainty. The model relies upon interpretable strategy templates representing the tactics the agent should employ during the negotiation and learns template parameters to maximize the average utility received over multiple negotiations, thus resulting in optimal bid acceptance and generation. Our model also uses deep reinforcement learning to evaluate threshold utility values, for those tactics that require them, thereby deriving optimal utilities for every environment state. To handle user preference uncertainty, the model relies on a stochastic search to find user model that best agrees with a given partial preference profile. Multi-objective optimization and multi-criteria decision-making methods are applied at negotiation time to generate Pareto-optimal outcomes thereby increasing the number of successful (win-win) negotiations. Rigorous experimental evaluations show that the agent employing our model outperforms the winning agents of the 10th Automated Negotiating Agents Competition (ANAC'19) in terms of individual as well as social-welfare utilities.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:g3aElNc5_aQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Anomaly Detection in Video Games.",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=11659244104433192877&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Metric Learning Approach to Anomaly Detection in Video Games",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9231700/",
            "Abstract": "With the aim of designing automated tools that assist in the video game quality assurance process, we frame the problem of identifying bugs in video games as an anomaly detection (AD) problem. We develop State-State Siamese Networks (S3N) as an efficient deep metric learning approach to AD in this context and explore how it may be used as part of an automated testing tool. Finally, we show by empirical evaluation on a series of Atari games, that S3N is able to learn a meaningful embedding, and consequently is able to identify various common types of video game bugs.",
            "Abstract entirety": 1,
            "Author pub id": "6Kwf-xkAAAAJ:hMsQuOkrut0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pirasa: strategic protocol selection for e-commerce agents",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s12525-018-0307-4",
            "Abstract": "We present Pirasa: an agent-based simulation environment for studying how autonomous agents can best interact with each other to exchange goods in e-commerce marketplaces. A marketplace in Pirasa enables agents to enact buyer or seller roles and select from sales, auction, and negotiation protocols to achieve the individual goals of their users. An agent’s strategy to maximize its utility in the marketplace is guided by its user’s preferences and constraints such as ‘maximum price’ and ‘deadline’, as well as an agent’s personality attributes, e.g., how ‘eager’ or ‘late’ the agent can be for exchanging goods and whether the agent is a ‘spender’ or ‘saver’ in an exchange. To guide the agent’s actions selected by a strategy, we use the notion of electronic contracts formulated as regulatory norms. In this context, we present how Pirasa is organized with regards to seller processes for goods submission, the …",
            "Abstract entirety": 0,
            "Author pub id": "6Kwf-xkAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Springer Berlin Heidelberg"
        }
    ]
}]