[{
    "name": "Κωνσταντίνος Κοντογιάννης",
    "romanize name": "Konstantinos Kontogiannis",
    "School-Department": "Ηλεκτρολόγων Μηχανικών & Μηχανικών Υπολογιστών",
    "University": "ntua",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 18652,
    "Scholar name": "Kostas Kontogiannis",
    "Scholar id": "gNZOUUAAAAAJ",
    "Affiliation": "Professor, and Research Chair, Western University",
    "Citedby": 4875,
    "Interests": [
        "Software Engineering",
        "Software Evolution",
        "Service Oriented Systems",
        "Cyber Physical Systems",
        "Intelligent Systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=gNZOUUAAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "MESOA 2009: 3rd International workshop on maintenance and evolution of service-oriented systems",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5306393/",
            "Abstract": "The main goal of this workshop is to provide an opportunity for participants to present current work and have a lively discussion of open issues for the maintenance and evolution of service-oriented systems. The dialog will include both short-term research issues such as reengineering processes and long-term issues such as evolution patterns for service-oriented systems.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A metric-based approach to enhance design quality through meta-pattern transformations",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1192426/",
            "Abstract": "During the evolution of object-oriented legacy systems, improving the design quality is. most often a highly demanded objective. For such systems which have a large number of classes and are subject to frequent modifications, detection and correction of design defects is a complex task. The use of automatic detection and correction tools can be helpful for this task. Various research approaches have proposed transformations that improve the quality of an object-oriented systems while preserving its behavior This paper proposes a framework where a catalogue of object-oriented metrics can be used-as indicators for automatically detecting situations where a particular transformation can be applied to improve the quality of an object-oriented legacy system. The correction process is based on analyzing the impact of various meta-pattern transformations on these object-oriented metrics.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Component Clustering Based on Maximal Association",
            "Publication year": 2001,
            "Publication url": "http://www.softlab.ntua.gr/~kkontog/publications/conferences/C4-2001.pdf",
            "Abstract": "In this paper, we present a supervised clustering framework for recovering the architecture of a software system. The technique measures the association between the sys-tem components (such as ﬁles) in terms of data and control ﬂow dependencies among the groups of highly related entities that are scattered throughout the components. The application of data mining techniques allows to extract the maximum association among the groups of entities. This association is used as a measure of closeness among the system ﬁles in order to collect them into subsystems using an optimization clustering technique. A two-phase supervised clustering process is applied to incrementally generate the clusters and control the quality of the system decomposi-tion. In order to address the complexity issues, the whole clustering space is decomposed into sub-spaces based on the association property. At each iteration, the sub …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:DUooU5lO8OsC",
            "Publisher": "Department of Electrical and Computer Engineering, University of Waterloo"
        },
        {
            "Title": "A graph pattern matching approach to software architecture recovery",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/972754/",
            "Abstract": "This paper presents a technique for recovering the high level design of legacy software systems based on pattern matching and user defined architectural patterns. Architectural patterns are represented using a description language that is mapped to an attributed relational graph and allows to specify the legacy system components and their data and control flow interactions. Such pattern descriptions are viewed as queries that are applied against an entity-relation graph that represents information extracted from the source code of the software system. A multi-phase branch and bound search algorithm with a forward checking mechanism controls the matching process of the two graphs by which, the query is satisfied and its variables are instantiated. An association based scoring mechanism is used to rank the alternative results generated by the matching process. Experimental results of applying the technique on …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pattern-based software architecture recovery",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Kostas-Kontogiannis/publication/251372191_Pattern-based_Software_Architecture_Recovery/links/542bcd590cf29bbc126aa511/Pattern-based-Software-Architecture-Recovery.pdf",
            "Abstract": "This paper presents a technique for recovering the high level design of legacy software systems based on pattern matching and user defined architectural patterns. Architectural patterns are represented using a description language that is mapped to an attributed relational graph and allows to specify the legacy system components and their data and control flow interactions. Such pattern descriptions are viewed as queries that are applied against an entity-relation graph that represents information extracted from the source code of the software system. A multi-phase¥ § ¦ search algorithm with a bounded path-queue mechanism controls the matching process of the two graphs by which, the query is satisfied and its variables are instantiated. An association based scoring mechanism is used to rank the alternative results generated by the matching process. Experimental results of applying the technique on the Xfig system are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Event clustering for log reduction and run time system understanding",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1982185.1982229",
            "Abstract": "Large software systems are constantly monitored so that audits can be initiated, once a failure occurs or when maintenance operations are performed. However, the log files are usually sizeable, and require filtering and reduction in order to be processed efficiently. In this paper, we define the concept of the Event Dependency Graph, and we discuss an event filtering and a use case identification technique, that is based on event clustering. This technique can be used to reduce the size of system logs and assist on system analysis and, program understanding.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Localizing and Using Services in Web-Enabled Environments",
            "Publication year": 2000,
            "Publication url": "https://seal-queensu.github.io/publications/pdf/WSE-Ying-2000.pdf",
            "Abstract": "The Web browser technology has revolutionized in the 1980’s the way Internet is explored and utilized for gathering and presenting information. With the emergence of distributed object technologies and new programming languages Internet is now moving from a world-wide information pool towards a service providing facility. This position paper examines the origin and architecture of the “services-based” Web and, discusses techniques for searching and integrating content and services with the Web as the primary medium.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Partial evaluation of model transformations",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6227160/",
            "Abstract": "Model Transformation is considered an important enabling factor for Model Driven Development. Transformations can be applied not only for the generation of new models from existing ones, but also for the consistent co-evolution of software artifacts that pertain to various phases of software lifecycle such as requirement models, design documents and source code. Furthermore, it is often common in practical scenarios to apply such transformations repeatedly and frequently; an activity that can take a significant amount of time and resources, especially when the affected models are complex and highly interdependent. In this paper, we discuss a novel approach for deriving incremental model transformations by the partial evaluation of original model transformation programs. Partial evaluation involves pre-computing parts of the transformation program based on known model dependencies and the type of the …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Migrating and specifying services for Web integration",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45254-0_22",
            "Abstract": "With the explosive growth of the Internet, businesses of all sizes aim on applying e-business solutions to their IT infrastructures, migrating their legacy business processes into Web-based environments, and establishing their own on-line services. To facilitate process and service integration, a complete and information rich service description language, is essential for server processes to be specified and for client processes to be able to locate services that are available in Web-enabled remote servers.Within the context of emerging technologies, such as XML, the Internet, and Network-Centric Computing, we propose an architecture that allows for Web-based integration of distributed components and services. The architecture is based on component wrapping, a service description language that allows for the specification of services, and on techniques that support service registration and dynamic …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Extracting REST resource models from procedure-oriented service interfaces",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121214002362",
            "Abstract": "During the past decade a number of procedure-oriented protocols and standards have emerged for making service-offering systems available on the Web. The WS-* stack of protocols is the most prevalent example. However, this procedure and message-oriented approach has not aligned with the true potential of the Web's own architectural principles, such as the uniform identification and manipulation of resources, caching, hypermedia, and layering. In this respect, Resource Oriented Architectures based on the REST architectural style, have been proposed as a possible alternative to the operation-based view of service offerings. To date, compiling a REST API for back-end procedure-oriented services is considered as a manual process that requires as input specialized models, such as, service requirements and behavioral models. In this paper, we propose a resource extraction method in which service …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:-FonjvnnhkoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Architectural design recovery using data mining techniques",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/827321/",
            "Abstract": "The paper presents a technique for recovering the high level design of legacy software systems according to user defined architectural plans. Architectural plans are represented using a description language and specify system components and their interfaces. Such descriptions are viewed as queries that are applied on a large database which stores information extracted from the source code of the subject legacy system. Data mining techniques and a modified branch and bound search algorithm are used to control the matching process, by which the query is satisfied and query variables are instantiated. The matching process allows the alternative results to be ranked according to data mining associations and clustering techniques and, finally, be presented to the user.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WCRE 2000 Most Influential Paper",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5645476/",
            "Abstract": "Clone detection and re-factoring have grown in importance over the past 10 years. In this talk, we will brief y review the WCRE 2000 work and discuss the advances in the field. The WCRE 2000 paper presented a computer assisted clone re-factoring approach. The process was based on metric-based clone analysis that produced clone clusters. Clones in the same cluster were then compared using token-based dynamic programming (DP) matching. Token-based clone differences, which included insertions, deletions, and substitutions, were then projected on to the ASTs corresponding to clones. Re-factoring opportunities were evaluated using: (1) classification of differences involving superficial differences, signature changes, and type changes, (2) number of differences, and (3) size of candidate clones. Selected clones were automatically re-factored using “strategy” and “template” design patterns. Experimental …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Case study on which relations to use for clustering-based software architecture recovery",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10664-016-9459-z",
            "Abstract": "Clustering-based software architecture recovery is an area that has received significant attention in the software engineering community over the years. Its key concept is the compilation and clustering of a system-wide graph that consists of source code entities as nodes, and source code relations as edges. However, the related research has mostly focused on investigating different clustering methods and techniques, and consequently there is limited work on addressing the question of what is a minimal set of relations that can be easily extracted from the system’s source code, and yet can be accurately used for extracting its architecture. In this paper, we report on results obtained from an architecture recovery case study we have conducted, by considering all possible combinations which can be generated from thirteen commonly used source code relations. We have examined the similarity of the …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Towards a goal driven task personalization specification framework",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6655695/",
            "Abstract": "Since its inception, Service Orientation allowed for distributed clients to invoke remote operations utilizing standardized protocols, programming paradigms and architectures. Furthermore, the problem of compiling complex service compositions, based on contextual information and user preferences, has been also extensively investigated by the research community. However, these techniques are mostly used within a single, or within coupled service domains that utilize predefined orchestration and composition service flows. In this paper, we propose an approach whereby service providers can specify complex service tasks as collections of goal model templates that can be instantiated and customized by the invoking clients. A reasoning process evaluates whether instantiated goals can be fulfilled based on the clients selections and consequently generates service flows that are compliant to the goal model and …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:lmc2jWPfTJgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The landscape of service-oriented systems: A research perspective",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4273289/",
            "Abstract": "Service orientation has been touted as one of the most important technologies for designing, implementing and deploying large scale service provision software systems. In this position paper we attempt to investigate an initial classification of challenge areas related to service orientation and service-oriented systems. We start by organizing the research issues related to service orientation in three general categories- business, engineering and operations, plus a set of cross-cutting concerns across domain. We further propose the notion of Service Strategy as a binding model for these three categories. Finally, concluding this position paper, we outline a set of emerging opportunities to be used for further discussion.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Results of SEI Independent Research and Development Projects FY 2007",
            "Publication year": 2008,
            "Publication url": "https://www.sei.cmu.edu/reports/09tr025.pdf",
            "Abstract": "The Software Engineering Institute (SEI) annually undertakes several independent research and development (IRAD) projects. These projects serve to (1) support feasibility studies investigating whether further work by the SEI would be of potential benefit and (2) support further exploratory work to determine whether there is sufficient value in eventually funding the feasibility study work as an SEI initiative. Projects are chosen based on their potential to mature and/or transition software engineering practices, develop information that will help in deciding whether further work is worth funding, and set new directions for SEI work. This report describes the IRAD projects that were conducted during fiscal year 2009 (October 2008 through September 2009).",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Carnegie Mellon University"
        },
        {
            "Title": "Code migration through transformations: An experience report",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1925805.1925817",
            "Abstract": "One approach to dealing with spiraling maintenance costs, manpower shortages and frequent breakdowns for legacy code is to\" migrate\" the code into a new platform and/or programming language. The objective of this paper is to explore the feasibility of semi-automating such a migration process in the presence of performance and other constraints for the migrant code. In particular, the paper reports on an experiment involving a medium-size software system written in PL/IX. Several modules of the system were migrated to C++, first by hand and then through a semiautomatic tool. After discovering that the migrant code was performing up to 50% slower than the original, a second migration effort was conducted which improved the performance of the migrant code substantially. The paper reports on the transformation techniques used by the transformation process and the effectiveness of the prototype tools that …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Incremental model synchronization in model driven development environments",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1723028.1723053",
            "Abstract": "Most modern model driven software development environments rely heavily on model transformations for generating various software design artifacts and eventually even source code. However, during development, maintenance and evolution activities, these software artifacts are subject to updates and refactoring operations. In such model driven development environments, these software artifacts need to be re-synchronized every time one of them is altered, so that they all remain consistent according to some specific rules, relations and domain constraints. Until now, the standard approach to model synchronization has been the re-application of all transformation rules, aiming thus for the complete re-generation of all artifacts in all models involved. This complete re-application is a safe yet computationally expensive way to ensure consistency among models. In this paper, we present a method for re …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interoperability of Reengineering Tools (Dagstuhl Seminar 01041)",
            "Publication year": 2021,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2021/15180/pdf/DagSemRep-296.pdf",
            "Abstract": "Software Reengineering is the present-day term for all activities for renovating aging systems to be more responsive to changes. Problems of the 90s like the Y2k-problem or the problem of converting software to the new European currency witnessed the importance of concepts, tools and techniques to improve the quality and maintainability of software.Reengineering is a part of software engineering with its focus on all problems appearing during software maintenance of legacy software. In this seminar we focused on the technical part related to the software artifacts themselves and excluded the management aspects of software maintenance. Reengineering activities use to a large part the same concepts, tools and techniques as other software engineering disciplines. Besides software engineering knowledge, there is also much usage of other more traditional areas of computer science, especially compiler construction, database systems, formal semantics, and knowledge representation. But due to its special focus, additional problems appear, like",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:gVv57TyPmFsC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "Service Invocation and Roaming in Pervasive-Computing Environments",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/51428877/Service_Invocation_and_Roaming_in_Pervas20170119-4607-1bfcpcd.pdf",
            "Abstract": "Emerging mobile-communication protocols aim to disassociate computing platforms from the location and the medium the user is accessing services. Moreover, a user should be able to access his/her personalized services any time, anywhere, on any type of device and with any type of wireless technology in a non-obtrusive environment. The complexities and problems associated with a mobile-wireless environment should be insulated from the user. This new type of computing is what we call pervasive computing.In this thesis, a framework for accessing location-aware services (service invocation) and the protocols involved for a user to be able to access services across different locations and networks (service roaming) are presented. Service advertisement, service registration, and service discovery need to be performed before service invocation. The proposed framework uses Web services to achieve these objectives. Specifically, Web Services Description Language (WSDL) and Universal Description, Discovery and Integration (UDDI) are used for service advertisement and registration, UDDI is used for service discovery, and Simple Object Access Protocol (SOAP) is used for service execution. In order to determine the particular services that a user is accessing and maintain information related to the task that the user is performing, a stateful protocol is required. In this context, in order to implement service-roaming capabilities the framework uses a proxy-based architecture. By doing so, the client, location, and transaction details can be kept and processed while the user roams in different locations, and accesses different services.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software Architecture Analysis and Reconstruction",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/software-architecture-analysis-reconstruction/25751",
            "Abstract": "This chapter addresses the research challenges in the area of software architecture reconstruction and discusses the state-of-the-art and practice solutions to these challenges. Software architecture analysis and reconstruction is an area within the software architecture domain that refers to the techniques and tools for processing and recovering high-level information from a low-level software system representation such as the source code. The importance of architecture analysis and reconstruction of a large and complex software system stems from the need to perform continuous maintenance activities to keep a mission critical system operational. Such activities include adopting a new implementation technology, error correction, feature enhancement, and migration to a new platform, in which the architectural reconstruction constitutes the major part of these activities. The authors believe that the discussions of this …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Igi Global"
        },
        {
            "Title": "Model synchronization as a problem of maximizing model dependencies",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1028664.1028760",
            "Abstract": "During the course of its evolution, software is modified through models at different levels of abstraction, from the requirements specification to source code. To enable systematic development and maintenance, related models need to be kept synchronized. In order to establish and maintain consistency, we need to precisely define what it means for two models to be synchronized. In this paper, we present our view of model synchronization as a problem of maximizing model dependencies. Our conceptual view of software models is as graphs, and model transformations are viewed in terms of basic graph transformations such as node insertions and deletions. Based on this view, a set of transformations applied to one model is traced and propagated to the other by choosing, from a set of possible transformation paths, a path that maximizes underlying model dependencies.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Impact of multi-organizational SOA implementation on the software life cycle",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1723028.1723088",
            "Abstract": "This workshop discussed the practical impact of multi-organizational Service Oriented Architecture (SOA) implementations. Multi-organizational SOA means that there is no single point of control for the full system. As a result, services may be developed by a number of service providers for use by an unknown set of service consumers. There may be federated SOA infrastructures, or there may be parts, or all, of the SOA implementation residing on a cloud platform. This leads to a greater need to address challenges and develop best practice for tasks across the software life cycle.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A methodology for developing transformations using the maintainability soft-goal graph",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1173066/",
            "Abstract": "Over the past few years, we are experiencing a surge of evolution problems related to legacy object-oriented systems. Object orientation provides means for systems to be well-designed to meet numerous non-functional quality requirements. However mismanagement of the maintenance process and ill-planned modifications usually are amplified in an object-oriented context. The paper presents a re-engineering framework that defines and categorizes a collection of source code transformations that aim to introduce design patterns in an ill-structured object-oriented system due to excessive maintenance process. The framework allows for five categories of transformations to be defined and associated through soft-goal dependency graphs for the target system. A case study that illustrates the use of the framework for the restructuring and introducing of design patterns to the GNU AVL Library is presented.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An XML-based framework for language neutral program representation and generic analysis",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1402113/",
            "Abstract": "XML applications are becoming increasingly popular to define structured or semi-structured constrained data in XML for special application areas. In pursuit there is a growing momentum of activities related to XML representation of source code in the area of program comprehension and software re-engineering. The source code and the artifacts extracted from a program are necessarily structured information that needs to be stored and exchanged among different tools. This makes XML to be a natural choice to be used as the external representation formats for program representations. Most of the XML representations proposed so far abstract the source code at the AST level. These AST representations are tightly coupled with the language grammar of the source code and hence require development of different tools for different programming languages to perform the same type of analysis. Moreover AST …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for software architecture refactoring using model transformations and semantic annotations",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1602365/",
            "Abstract": "Software-intensive systems evolve continuously under the pressure of new and changing requirements, generally leading to an increase in overall system complexity. In this respect, to improve quality and decrease complexity, software artifacts need to be restructured and refactored throughout their lifecycle. Since software architecture artifacts represent the highest level of implementation abstraction, and constitute the first step in mapping requirements to design, architecture refactorings can be considered as the first step in the quest of maintaining system quality during evolution. In this paper, we introduce an approach for refactoring software architecture artifacts using model transformations and quality improvement semantic annotations. First, the conceptual architecture view is represented as a UML 2.0 profile with corresponding stereotypes. Second, instantiated architecture models are annotated using …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quality-driven software re-engineering",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121202000821",
            "Abstract": "Software re-engineering consists of a set of activities intended to restructure a legacy system to a new target system that conforms with hard and soft quality constraints (or non-functional requirements, NFR). This paper presents a framework that allows specific NFR such as performance and maintainability to guide the re-engineering process. Such requirements for the migrant system are modeled using soft-goal interdependency graphs and are associated with specific software transformations. Finally, an evaluation procedure at each transformation step determines whether specific qualities for the new migrant system can be achieved.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Welcome from the Chairs",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5623558/",
            "Abstract": "Welcome to the 12 th  annual meeting of the IEEE International Symposium on Web Systems Evolution (WSE 2010). Since its inception in 1999, the Symposium has attracted leading technical people both from industry and academia, with the purpose of discussing and debating new and emerging technologies in the area of Web systems. The Symposium was originally conceived with the title International Workshop on Web Site Evolution as a forum for the analysis, maintenance and evolution of Web sites, with emphasis on sites with dynamic and diverse content. However, the technological trends of the recent years, and the emergence of Service Orientation as a predominant paradigm for offering, brokering, and using software applications over the Web led to the expansion of the Symposium and to the consequent change of its name to its current title. The quality of the papers that the Symposium has attracted …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A generic worklist algorithm for graph reachability problems in program analysis",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.15.7298",
            "Abstract": "Many program analyses involve, or can be expressed in terms of, a graph reachability problem. We present a generic worklist-style algorithm capable of expressing and solving the graph reachability components of many such analyses. We compare our framework with the language reachability framework proposed by Thomas Reps, and show that some problems are expressible in both frameworks, and some problems can be expressed in only one of the frameworks.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IEE Digital Library",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.83.9354&rep=rep1&type=pdf",
            "Abstract": "In 1999, the University of Wisconsin-Superior (UWS) launched a project to implement an enterprise resource planning (ERP) system called PeopleSoft Student Administration (SA). The new system would replace the university's aging, homebuilt legacy student information system (SIS) and several third-party subsystems. The university's chancellor and provost envisioned that the SA system would integrate existing administrative subsystems, meet increased demand for student Web-based services, and provide prompt and accurate reports. The implementation was, by and large, a success. In the paper implementers of the university ERP system share experiences and lessons from an IT perspective.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Migration of Legacy Web Applications to Enterprise Java Environments–Net. Data to JSP Transformation",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Kostas-Kontogiannis/publication/234812937_Migration_of_legacy_web_applications_to_enterprise_Java_TM_environments_netdataR_to_JSP_TM_transformation/links/542bcd5a0cf277d58e8a386a/Migration-of-legacy-web-applications-to-enterprise-Java-TM-environments-netdataR-to-JSP-TM-transformation.pdf",
            "Abstract": "As Web technologies advance, the porting and adaptation of existing Web applications to take advantage of the advancement has become an issue of increasing importance. Examples of such technology advancement include extensible architectural designs, more efficient caching protocols, and provision for customizable dynamic content delivery. This paper presents an experience report on the migration of legacy IBM® Net. Data® based applications to new enterprise Java™ environments. In this respect, a Net. Data application is refactored into JavaBeans™(Model), JavaServer Pages™(View), and Java Servlet™(Controller). To evaluate the effectiveness of the migration methodology, a tool has been developed to support the automatic translation of Net. Data to JavaServer Pages. Using such a tool, a case study is presented to deal with IBM WebSphere® Commerce applications.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Migration and Web-based integration of legacy services",
            "Publication year": 2000,
            "Publication url": "http://www.softlab.ntua.gr/~kkontog/publications/conferences/C1-2000.PDF",
            "Abstract": "With the explosive growth of the Internet, businesses of all sizes aim on applying networkwide solutions to their IT infrastructures, migrating their legacy business processes into web-based environments, and establishing their own on-line services. To facilitate process and service integration, a complete and information rich service description language, is essential for server processes to be specified and for client processes to be able to locate services that are available in Web-enabled remote servers. Within the context of emerging technologies, such as XML, Internet, and Web-enabled application servers, we propose an architecture that allows for the migration of legacy services to distributed environments. The architecture is based on legacy component wrapping, a service description language that allows for the specification of services at higher levels of abstraction than the standard Interface Description Languages (IDLs), and on techniques that support service registration and dynamic service localization.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proceedings of the Fourth International Workshop on a Research Agenda for Maintenance and Evolution of Service-Oriented Systems (MESOA 2010)",
            "Publication year": 2011,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA611617",
            "Abstract": "The Fourth International Workshop on Maintenance and Evolution of Service-Oriented Systems MESOA 2010, organized by members of the Carnegie Mellon Software Engineering Institutes technical staff, was held at the 26th International Conference on Software Maintenance ICSM 2010 in Timioara, Romania, on September 17, 2010. The goal for MESOA 2010 was to share current research efforts and discuss emerging technologies in the maintenance and evolution of service-oriented systems. A second goal of the workshop was to identify areas of future work needed to address existing gaps and problems in the taxonomy of research topics in service-oriented architecture SOA. This report summarizes the workshop and includes the accepted papers that were the basis for the presentations given during the workshop. Topics include using simulation models to evolve business processes, a requirements-driven framework for root cause analysis in SOA environments, SOA integration as an alternative to source migration, proactive adaptation as illustrated by the S-Cube service life cycle, a dynamic framework for quality web-service discovery, a characterization of policies that govern SOAs, and context-driven adaptive monitoring for supporting SOA governance. The report concludes with highlights from the discussions among workshop attendees.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:BUYA1_V_uYcC",
            "Publisher": "CARNEGIE-MELLON UNIV PITTSBURGH PA SOFTWARE ENGINEERING INST"
        },
        {
            "Title": "Requirements-driven root cause analysis using markov logic networks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-31095-9_23",
            "Abstract": "Root cause analysis for software systems is a challenging diagnostic task, due to the complexity emanating from the interactions between system components and the sheer size of logged data. This diagnostic task is usually assisted by human experts who create mental models of the system-at-hand, in order to generate hypotheses and conduct the analysis. In this paper, we propose a root cause analysis framework based on requirement goal models. We consequently use these models to generate a Markov Logic Network that serves as a diagnostic knowledge repository. The network can be trained and used to provide inferences as to why and how a particular failure observation may be explained by collected logged data. The proposed framework improves over existing approaches by handling uncertainty in observations, using natively generated log data, and by providing ranked diagnoses. The …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Mining software logs for goal-driven root cause analysis",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780124115194000185",
            "Abstract": "Root cause analysis for software systems is a challenging diagnostic task owing to the complex interactions between system components, the sheer volume of logged data, and the often partial and incomplete information available for root cause analysis purposes. This diagnostic task is usually performed by human experts who create mental models of the system at hand, generate root cause hypotheses, conduct log analysis, and identify the root causes of an observed system failure. In this chapter, we discuss a root cause analysis framework that is based on goal and antigoal models to represent the relationship between a system behavior or requirement, and the necessary conditions, configurations, properties, constraints, or external actions that affect this particular system behavior. We consequently use these models to generate a Markov logic network that allows probabilistic reasoning, so that conclusions …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:0izLItjtcgwC",
            "Publisher": "Morgan Kaufmann"
        },
        {
            "Title": "Quality driven transformation compositions for object oriented migration",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1183004/",
            "Abstract": "Reengineering legacy software systems to object oriented platforms has received significant attention over the past few years. In this paper, we propose a goal driven software migration framework that aims to identify and extract a quality object model from a procedural system and to generate quality object oriented code. The framework is composed of analysis tools, transformation rules, and non-functional requirement models for the target migrant system. Specifically, to facilitate the design and development of such goal driven migration framework, source code transformation rules are associated with a degree of belief that they contribute towards enhancing a desired property for the target system. The migration process applies a search algorithm that is guided by the source code analysis to select a transformation sequence that has the highest likelihood of yielding such a target system. The migration of a …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Assisting developers towards fault localization by analyzing failure reports.",
            "Publication year": 2017,
            "Publication url": "https://www.csd.uwo.ca/~kkontogi/publications/conferences/Fault-Localization-Reports.pdf",
            "Abstract": "Large software applications encompass many components with complex interdependencies. When a failure occurs, developers usually have limited information and time in their disposal for localizing the root cause of the observed failure. The most common information developers have readily access to includes failure reports, stack traces, and event logs. In this context, a major challenge is to devise techniques that assist developers utilize this information in order to zero-in their focus on specific methods that have a high probability of containing the root cause of the observed failure. Once such an initial set of methods has been identified, other more elaborate, complex, and computationally expensive data flow analyses could be applied. In this paper, we present a technique which aims to identify such an initial set of suspicious methods by first, retrieving information from failure reports obtained from Bugzilla repositories, second by combining this information with graph models that denote actual dependencies obtained from the subject system’s source code in order to create an hypothesis space and third, by applying a ranking score to identify methods that have high likelihood of containing the root cause. The technique is shown to be tractable when applied to systems with several thousands of source code methods and exhibits high accuracy on the obtained results.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Requirements driven software evolution",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1311070/",
            "Abstract": "Software evolution is an integral part of the software life cycle. Furthermore in the recent years the issue of keeping legacy systems operational in new platforms has become critical and one of the top priorities in IT departments worldwide. The research community and the industry have responded to these challenges by investigating and proposing techniques for analyzing, transforming, integrating, and porting software systems to new platforms, languages, and operating environments. However, measuring and ensuring that compliance of the migrant system with specific target requirements have not been formally and thoroughly addressed. We believe that issues such as the identification, measurement, and evaluation of specific re-engineering and transformation strategies and their impact on the quality of the migrant system pose major challenges in the software re-engineering community. Other related …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The landscape of service-oriented systems: a research perspective for maintenance and reengineering",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.543.7460&rep=rep1&type=pdf",
            "Abstract": "Service orientation has been touted as one the important technologies for designing, implementing and deploying large scale service provision software systems. In this position paper we attempt to investigate an initial classification of challenge areas related to service orientation. More specifically, we partition the problems and related issues of service orientation in three domains—Business, Engineering, and Operations domain—along with the notion of Service Strategy as a binding model for these domains. A list of potential challenges for the maintenance and reengineering of service-oriented systems is presented for discussion.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Root cause analysis and diagnosis in SOA and cloud environments",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1723028.1723092",
            "Abstract": "Modern information technology (IT) is comprised of a complex mix of infrastructure components provisioning enterprise applications performing tasks in various enterprise business processes. Over the years these components were integrated into overall business processes using various integration technologies and architectures. In recent years, service-oriented architecture (SOA) approaches have emerged which separate the service implementations from its interfaces. Stable service interfaces allow for the integration of services at a higher level and orchestration of services into ever more complex business solutions. However, the implementation of a service can change at any time, and this is considered a good thing because of its flexibility. Sometimes a services implementation is comprised of a single software component, but in an enterprise setting, a service might be composed of multiple IT applications …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework for migrating procedural code to object-oriented platforms",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/991506/",
            "Abstract": "With the rapid growth of the Internet and pervasive computing activities, the migration of back-end legacy systems to network centric environments has become a focal point for researchers and practitioners alike. To leverage back-end legacy services into Web-enabled environments, this paper proposes an incremental and iterative migration framework where legacy procedural source code is reengineered into an object-oriented platform. The reengineering framework allows for the representation of the legacy source in the form of XML based annotated abstract syntax trees. Consequently, the extraction of an object-oriented model from the original source code is based on the analysis of source code features in the original system that can be used to identify classes, associations, aggregations, and polymorphic patterns in the new target system.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Extracting Java library subsets for deployment on embedded systems",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016764230200059X",
            "Abstract": "Embedded systems provide means for enhancing the functionality delivered by small-sized electronic devices such as hand-held computers and cellular phones. Java is a programming language which incorporates a number of features that are useful for developing such embedded systems. However, the size and the complexity of the Java language and its libraries have slowed its adoption for embedded systems, due to the processing power and storage space limitations. A common approach to address storage space limitations is for the vendor to offer special versions of the libraries with reduced functionality and size to meet the constraints of embedded systems. However, such an approach will severely limit the type of applications that can be deployed. This paper presents a technique that is used for selecting, on an as needed basis, the subset of library entities that is exactly required for a given Java …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Model Contextual Variability for Agents Using Goals and Commitments.",
            "Publication year": 2013,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.421.2124&rep=rep1&type=pdf#page=110",
            "Abstract": "Goal models have been extensively utilized in requirements engineering as they provide an expressive and qualitative way to represent requirements, while recent extensions related to contextual variability have further increased the expressiveness of the models. In addition to their application in requirements engineering however, goal models have been also proposed in the literature as a formal way to define the internal design of agents in multi-agent systems. In this paper we adopt the idea of applying goal models with contextual elements, ie conditional goals, decompositions and contributions, as a mean to model the internal design of agents. Furthermore, we express the way those agents can interact with each other in terms of commitments, a recently introduced modeling concept that can be used for the definition of communication protocols in multi-agent systems. In this context, we introduce a transformation process that maps all conditional elements to commitments and contributions, and hence, reasoning techniques that exist for commitments can be applied to contextual models with no further changes.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:vbGhcppDl1QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transforming legacy Web applications to the MVC architecture",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1372143/",
            "Abstract": "With the rapid changes that occur in the area of Web technologies, the porting and adaptation of existing Web applications into new platforms that take advantage of modern technologies has become an issue of increasing importance. This paper presents a reengineering framework whose target system is an architecture based on the model-view-controller (MVC) design pattern and enabled for the Java/spl trade/ 2 Platform, Enterprise Edition (J2EE). The proposed framework is mainly concerned with the decomposition of a legacy Web application by identifying software components to be transformed into Java objects such as JavaBeans, JavaServer Pages (JSP), and Java Servlet.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improving design quality using meta‐pattern transformations: a metric‐based approach",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smr.299",
            "Abstract": "Improving the design quality of large object‐oriented systems during maintenance and evolution is widely regarded as a high‐priority objective. Furthermore, for such systems that are subject to frequent modifications, detection and correction of design defects may easily become a very complex task that is even not tractable for manual handling. Therefore, the use of automatic or semi‐automatic detection and correction techniques and tools can assist reengineering activities. This paper proposes a framework whereby object‐oriented metrics can be used as indicators for automatically detecting situations for particular transformations to be applied in order to improve specific design quality characteristics. The process is based both on modeling the dependencies between design qualities and source code features, and on analyzing the impact that various transformations have on software metrics that quantify the …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:LkGwnXOMwfcC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Report on evaluation experiments using different machine learning techniques for defect prediction",
            "Publication year": 2020,
            "Publication url": "https://www.csd.uwo.ca/~kkontogi/publications/conferences/Error-Prone-Prediction.pdf",
            "Abstract": "With the emergence of AI, it is of no surprise that the application of Machine Learning techniques has attracted the attention of numerous software maintenance groups around the world. For defect proneness classification in particular, the use of Machine Learning classifiers has been touted as a promising approach. As a consequence, a large volume of research works has been published in the related research literature, utilizing either proprietary data sets or the PROMISE data repository which, for the purposes of this study, focuses only on the use of source code metrics as defect prediction training features. It has been argued though by several researchers, that process metrics may provide a better option as training features than source code metrics. For this paper, we have conducted a detailed extraction of GitHub process metrics from 150 open source systems, and we report on the findings of experiments conducted by using different Machine Learning classification algorithms for defect proneness classification. The main purpose of the paper is not to propose yet another Machine Learning technique for defect proneness classification, but to present to the community a very large data set using process metrics as opposed to source code metrics, and draw some initial interesting conclusions from this statistically significant data set.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:8xutWZnSdmoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A research agenda for service-oriented architecture (SOA): Maintenance and evolution of service-oriented systems",
            "Publication year": 2010,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA522530",
            "Abstract": "Despite recent reports that it has failed, the reality is that Service-Oriented Architecture SOA remains the best option available for systems integration and leverage of legacy systems. The technologies to implement SOA will certainly evolve to address emerging needs, but its concepts will remain. To address those needs and concerns that SOA is potentially being stretched beyond its limits, a significant and coordinated research program is needed. The SEI has developed an SOA Research Agenda with participation from a broad cross-section of the research community. The core of the agenda is a taxonomy that classifies topics into the business, engineering, and operations aspects of service-oriented systems, along with a set of cross-cutting aspects. Based on this taxonomy, the agenda outlines research areas, each of which is identified with its rationale, overview of current research, and delineation of research challenges and gaps. This report outlines the SOA Research Agenda. It also provides detail on specific re-search challenges related to the maintenance and evolution of service-oriented systems. The report concludes with a discussion of next steps in the evolution of the research agenda.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:j3f4tGmQtD8C",
            "Publisher": "CARNEGIE-MELLON UNIV PITTSBURGH PA SOFTWARE ENGINEERING INST"
        },
        {
            "Title": "Special issue on the 12th conference on software maintenance and reengineering (CSMR 2008)",
            "Publication year": 2009,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smr.405",
            "Abstract": "Software maintenance and reengineering are vital software engineering activities for facilitating the evolution of large software systems. However, software maintenance is not only to be considered for existing systems, but also for new systems, where software models and artefacts evolve as part of iterative and incremental development processes. The Conference on Software Maintenance and Reengineering is the premier European forum to discuss the theory and practice of software maintenance, reengineering, and evolution of software systems. CSMR promotes fruitful discussion and exchange of experiences among researchers and practitioners about the development of maintainable systems, and their evolution, migration and reengineering. This special issue comprises extended versions of three papers, presented at CSMR 2008. The 12th CSMR focused on ‘Developing evolvable systems’. The need for …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:pyW8ca7W8N0C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "MESOA 2008: 2nd international workshop on a research agenda for maintenance and evolution of service-oriented systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4658089/",
            "Abstract": "The main goal of this workshop is to provide an opportunity for participants to present current work and have a lively discussion of open issues for the maintenance and evolution of service-oriented systems. The dialog will include both short-term research issues such as reengineering processes and long-term issues such as evolution patterns for service-oriented systems. The current version of a SOA research agenda will be used as a starting point for discussion.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using formal concept analysis to establish model dependencies",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1425171/",
            "Abstract": "Software models evolve at different levels of abstraction, from the requirements specification to development of the source code. The models underlying this process are related and their elements are usually mutually dependent. To preserve consistency and enable synchronization when models are altered due to evolution, the underlying model dependencies need to be established and maintained. As there is a potentially large number of such relations, this process should be automated for suitable scenarios. This paper introduces a tractable approach to automating identification and encoding of model dependencies that can be used for model synchronization. The approach first uses association rules to map types between models and different levels of abstraction. It then makes use of formal concept analysis (FCA) on attributes of extracted models to identify clusters of model elements.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Methodology to Facilitate Mass Software Change",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=5268174160652014424&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comprehension and maintenance of large-scale multi-language software applications",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4021379/",
            "Abstract": "During the last decade, the number of software applications that have been deployed as a set of components built using different programming languages and paradigms has increased considerably. When such applications are maintained, traditional program comprehension and reengineering techniques may not be adequate. Hence, this working session aims to stimulate discussion around key issues relating to the comprehension, re engineering, and maintenance of multi-language software applications. Such issues include, but are not limited to, the formalization, management, exploration, and presentation of multi-language program dependencies, as well as the development of practical toolsets to automate and ease the comprehension and maintenance of multi-language software",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The effect of call graph construction algorithms for object-oriented programs on automatic clustering",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/852493/",
            "Abstract": "Call graphs are commonly used as input for automatic clustering algorithms, the goal of which is to extract the high level structure of the program under study. Determining the call graph for a procedural program is fairly simple. However this is not the case for programs written in object oriented languages, due to polymorphism. A number of algorithms for the static construction of an object oriented program's call graph have been developed in the compiler optimization literature in recent years. We investigate the effect of three such algorithms on the automatic clustering of the Java Expert System Shell (JESS). Object oriented programs have an inherently richer structure than those written in procedural languages, and so even medium sized programs such as JESS produce large graphs. Existing tools that we are aware of are not able to process such graphs. Consequently, we have developed our own algorithm for …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Weaving between non-functional requirements and object-oriented re-engineering",
            "Publication year": 2001,
            "Publication url": "https://stargroup.uwaterloo.ca/pubs/conf/Tahvildari_et_al_IRIS01.pdf",
            "Abstract": "The widespread use of the object-oriented design paradigm and the programming languages is a contributing factor for the increase on the amount of object-oriented software introduced in many organizations. Gradually, a new generation of object-oriented legacy systems is emerging. The technologies for addressing the maintenance and the evolution of such systems will be of vital importance in the years to come. Also, software re-engineering tasks have to conform with hard and soft quality constraints (or non-functional requirements) such as “the re-engineered system must run as fast as the original system”, or “the new system should be more easily maintainable than the original system”. These desired qualities (or, more precisely, desired deltas on these qualities) play a fundamental role in defining the object-oriented reengineering process and the techniques that support it. We have developed a re …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:OR75R8vi5nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality-driven object-oriented code restructuring",
            "Publication year": 2003,
            "Publication url": "https://stargroup.uwaterloo.ca/pubs/conf/Tahvildari_et_al_STEP-SAM03.pdf",
            "Abstract": "The technique of refactoring, restructuring the source code of an object-oriented program without changing it external behavior, has been embraced by many objectoriented software developers as a way to accommodate changing requirements. It is expected that such refactoring operations or software transformations improve the maintainability of software. Unfortunately, it in unclear how specific quality factors are affected by applying such refactorings operations or software transformations. This position paper addresses the issue of developing a restructuring methodology and its associated architecture for migrating an object-oriented legacy system to a new target system. The methodology allows for specific design and quality requirements of the target migrant system to be considered during the restructuring process that is applied on iterative and incremental steps.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Managing known clones: issues and open questions",
            "Publication year": 2007,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2007/967/",
            "Abstract": "Many software systems contained cloned code, ie, segments of code that are highly similar to each other, typically because one has been copied from the other, and then possibly modified. In some contexts, clones are of interest because they are targets for refactoring. This paper summarizes the results of a working session in which the problems of merely managing clones that are already known to exist. Six key issues in the space are briefly reviewed, and open questions raised in the working session are listed.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:GnPB-g6toBAC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "Migration to object oriented platforms: A state transformation approach",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1167814/",
            "Abstract": "It has become evident that the benefits of object orientation warrant the design and development of reengineering methods that aim to migrate legacy procedural systems to modern object oriented platforms. However, most research efforts in this direction focus mostly on the extraction of an object model from the legacy procedural code without taking into account quality requirements for the target migrant system. This paper presents a reengineering workbench that allows for quality requirements of the target system to be modeled as soft-goals and software transformations to be applied selectively towards achieving specific quality requirements for the target system. In this context, the migration process is denoted by a sequence of transformations that alter the state of the system being reengineered. A Markov model approach and the Viterbi algorithm are used to identify the optimal sequence of transformations that …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic Analysis for the Reconstruction of System Behavior Models",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5615806/",
            "Abstract": "The analysis of large software systems is often a difficult and time consuming task because of the sheer complexity of such systems, and the limited access software engineers have to the system's source code. In this respect, it is important to be able to analyze the system based on the events that can be collected while the system performs its specified operations. Such analysis, can take the form of reconstructing system behavioral models, and identifying common operational patterns that may assist software engineers deduce important information on the properties and characteristics of the system being analyzed. In this paper, we present an analysis technique that allows for the hierarchical reconstruction of sequence diagrams and the identification of common event patterns from system traces. The technique has been applied for the analysis of different operations in the Session Initiation Protocol.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "selected papers from the 12th International Symposium on Web Systems Evolution (WSE 2010)",
            "Publication year": 2013,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smr.1574",
            "Abstract": "The International Symposium on Web Systems Evolution (WSE) is regarded as one of the premier conferences by the software evolution and maintenance community in its domain. As a symposium, an important focus of WSE is to enable stimulating discussions and interactions of researchers, ranging from the software maintenance and evolution community to the Web engineering and service-oriented computing community, from both academia and industry, while also providing a platform for presenting high-quality research papers. To give a visual impression of the topics covered by WSE from 2001 to 2011, Figure 1 shows a tag cloud constructed from the 170 paper titles published in the corresponding proceedings. The first edition of WSE was held in 1999 as “1st International Workshop on Web Site Evolution”, and since its sixth instantiation in 2005, it is held as a symposium. Since its third instantiation in 2001 …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Techniques for Software Maintenance",
            "Publication year": 2011,
            "Publication url": "https://www.csd.uwo.ca/~kkontogi/publications/books/b1-2011.pdf",
            "Abstract": "Software maintenance constitutes a major phase of the software life cycle. Studies indicate that software maintenance is responsible for a significant percentage of a system’s overall cost and effort. The software engineering community has identified four major types of software maintenance, namely, corrective, perfective, adaptive, and preventive maintenance. Software maintenance can be seen from two major points of view. First, the classic view where software maintenance provides the necessary theories, techniques, methodologies, and tools for keeping software systems operational once they have been deployed to their operational environment. Most legacy systems subscribe to this view of software maintenance. The second view is a more modern emerging view, where maintenance is an integral part of the software development process and it should be applied from the early stages in the software life cycle. Regardless of the view by which we consider software maintenance, the fact is that it is the driving force behind software evolution, a very important aspect of a software system. This entry provides an in-depth discussion of software maintenance techniques, methodologies, tools, and emerging trends.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:Ri6SYOTghG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On modeling software architecture recovery as graph matching",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1235425/",
            "Abstract": "This paper presents a graph matching model for the software architecture recovery problem. Because of their expressiveness, the graphs have been widely used for representing both the software system and its high-level view, known as the conceptual architecture. Modeling the recovery process as graph matching is an attempt to identify a sub-optimal transformation from a pattern graph, representing the high-level view of the system, onto a subgraph of the software system graph. A successful match yields a restructured system that conforms to the given pattern graph. A failed match indicates the points where the system violates specific constraints. The pattern graph generation and the incrementality of the recovery process are the important issues to be addressed. The approach is evaluated through case studies using a prototype toolkit that implements the proposed interactive recovery environment.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A generic worklist algorithm for graph reachability problems in program analysis",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/995791/",
            "Abstract": "Many program analyses involve, or can be expressed in terms of, a graph reachability problem. We present a generic worklist-style algorithm capable of expressing and solving the graph reachability components of many such analyses. We compare our framework with the language reachability framework proposed by Thomas Reps. (1998), and show that some problems are expressible in both frameworks, and some problems can be expressed in only one of the frameworks. Our two main case studies are Choi et al.'s escape analysis and Bacon-Sweeney's rapid type analysis. The reachability problems in these analyses can be directly expressed in the framework of our algorithm, but not in the language reachability framework. We discuss why this is the case, but important future work remains to formally characterize the kinds of problems that are amenable to our approach. The paper also summarizes our …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3 rd international workshop on net-centric computing(NCC 2001)",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=8014394858773180027&hl=en&oi=scholarr",
            "Abstract": "The theme of the 3rd International Workshop on Net-Centric Computing (NCC 2001) is \"Migrating to the Web.\" The workshop will focus on issues related to reengineering legacy systems for use in an NCC environment. In particular, on holistic techniques for Web-enabling existing applications that integrates various reengineering aspects (e.g., code, data, and user interface reengineering) into a \"whole system\" modernization process.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Domain independent event analysis for log data reduction",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6340147/",
            "Abstract": "Analyzing the run time behavior of large software systems is a difficult and challenging task. Log analysis has been proposed as a possible solution. However, such an analysis poses unique challenges, mostly due to the volume and diversity of the logged data that is collected, thus making this analysis often intractable for practical purposes. In this paper, we present a log analysis technique that aims to compute a smaller, compared to the original, collection of events that relate to a given analysis objective. The technique is based on computing a similarity score between the logged events and a collection of significant events that we refer to as beacons. The major novelties of the proposed technique are that it is domain independent and that it does not require the use of a pre-existing training data set. The technique has been evaluated against the DARPA Intrusion Detection Evaluation 1999 and the KDD 1999 …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "DevOps toolchains for continuous engineering and improvement",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/3172795.3172847",
            "Abstract": "The workshop participants focused-on, and primarily discussed, three main areas a) models to denote and reconcile software system related data, obtained from different and diverse DevOps sources such as version control systems, bug reporting systems, collaboration tools and testing frameworks; b) analytics on software artifacts stored or created by DevOps tools; these artifacts include not only source code but also deployment scripts, configuration files, build specifications, bug reports, version histories, developer's comments and notes and c) infrastructures to support continuous maintenance and deployment by providing insights on deploy or no-deploy decision making choices, and by considering and analyzing information that is collected from the overall application and its constituent components. The workshop topics are related to the IBM DevOps Analytics, IBM DevOps Insights, and IBM DevOps …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Component clustering based on maximal association",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957814/",
            "Abstract": "Presents a supervised clustering framework for recovering the architecture of a software system. The technique measures the association between the system components (such as files) in terms of data and control flow dependencies among the groups of highly related entities that are scattered throughout the components. The application of data mining techniques allows us to extract the maximum association among the groups of entities. This association is used as a measure of closeness among the system files in order to collect them into subsystems using an optimization clustering technique. A two-phase supervised clustering process is applied to incrementally generate the clusters and control the quality of the system decomposition. In order to address the complexity, issues, the whole clustering space is decomposed into subspaces based on the association property. At each iteration, the subspaces are …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Task specification and reasoning in dynamically altered contexts",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07881-6_42",
            "Abstract": "Software systems are prone to evolution in order to be kept operational and meet new requirements. However, for large systems such evolution activities cannot occur in a vacuum. Instead, specific action plans must be devised so that evolution goals can be achieved within an acceptable level of deviation or, risk. In this paper we present an approach that allows for the identification of plans in the form of actions that satisfy a goal model when the environment is constantly changing. The approach is based on sequences of mutations of an initial solution, using a local search algorithm. Experimental results indicate that even for medium size models, the approach outperforms in execution time the weighted Max-Sat algorithms, while it is able to achieve an almost optimal solution. The approach is demonstrated on an example scenario of re-configuring a dynamically provisioned system.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:M7yex6snE4oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "m-Roam: a service invocation and roaming framework for pervasive computing",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1283941/",
            "Abstract": "This paper proposes an architectural framework for integrating services within an enterprise and accessing them from mobile devices in a pervasive-computing environment. Present network environments are prone to failures from disconnections and device crashes. Being able to maintain service transaction while moving to different locations and wireless networks (known as service roaming), is currently a major objective in pervasive and mobile computing research. This paper presents a framework (called m-Roam) that allows for mobile clients to perform service invocation and roaming. The framework addresses this problem by introducing a proxy-based architecture so that invocation context and transaction state can be maintained or updated accordingly, while the user roams in different locations.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The SOA programming model: challenges in a services oriented world",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1723028.1723096",
            "Abstract": "Over the past decade there has been a significant growth in the area of Service Oriented systems; in particular, systems that have been designed and built using the Service Oriented Architecture approach. The most popular and frequent implementation of SOA systems is based on Web Services, a technology that utilizes internet application layer protocols and standards for service description, service invocation and service composition. However, due to the plethora and diversity of types of services that are available as run time components and implemented in different languages, the middleware and the infrastructure required to make these components interoperable and deployable as services in different platforms grew in complexity. The technical skills required to design, build and test these systems become more difficult as the complexity and requirements of the systems increases and new deployment …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "1st workshop on AIOps and systems compliance",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/3432601.3432636",
            "Abstract": "Over the past two years we have seen a growth on AIOps. AIOps is the area of software engineering which aims to apply Artificial Intelligence on IT operations and on the big data which are harvested from different IT systems across an organisation. AIOps comes as a direct response to the dire need to break the siloed approach to IT operations in order to support a holistic system analysis which allows not only for the identification and proactive or even predictive resolution of issues, but also for assessing the compliance of a system against certain policies such as policies related to safety, security, and regulatory. This workshop brought together researchers and practitioners to discuss the latest developments on AIOps and system compliance and identified key challenge issues.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:Ehil0879vHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Log filtering and interpretation for root cause analysis",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5609556/",
            "Abstract": "Problem diagnosis in large software systems is a challenging and complex task. The sheer complexity and size of the logged data make it often difficult for human operators and administrators to perform problem diagnosis and root cause analysis. A challenge in this area is to provide the necessary means, tools, and techniques for the operators to focus their attention to specific parts of the logged data reducing thus the complexity of the diagnostic process. In this paper, we propose a framework for filtering logs according to specific analysis goals and diagnostic hypotheses set by the user or by an automated process. More specifically, the proposed framework uses annotated goal trees to model the constraints and the conditions by which the functionality of a particular system is being delivered. Next, a transformation process maps such constraints and conditions to a collection of queries that can be either applied to …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Important Dates",
            "Publication year": 2009,
            "Publication url": "https://icsm2009.cs.ualberta.ca/CFP.pdf",
            "Abstract": "ICSM is the premier international event in the software maintenance field for participants from academia, government, and industry to share ideas and experiences for solving critical software maintenance problems. The 25th International Conference on Software Maintenance (ICSM 2009) will be held in Edmonton, Alberta, Canada, one of the most vibrant cities in Canada bordering the beautiful Canadian Rockies.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reengineering legacy systems towards web environments",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/reengineering-legacy-systems-towards-web/25747",
            "Abstract": "With the widespread use of the Web, distributed object technologies have been widely adopted to construct network-centric architectures, using XML, Web Services, CORBA, and DCOM. Organizations would like to take advantage of the Web in its various forms of Internet, Intranet and Extranets. This requires organizations to port and integrate their legacy assets to distributed Web-enabled environments, so that the functionality of existing legacy systems can be leveraged without having to rebuild these systems. In this chapter, we provide techniques to re-engineer standalone legacy systems into Web-enabled environments. Specifically, we aim for a framework that allows for the identification of reusable business logic entities in large legacy systems in the form of major legacy components, the migration of these procedural components to an object-oriented design, the specification of interfaces of these identified …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Igi Global"
        },
        {
            "Title": "Tracing evolution changes of software artifacts through model synchronization",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1357809/",
            "Abstract": "Software evolution encompasses all activities related to engineering software, from its inception to retirement. Propagating change across software models that are altered due to maintenance activities is a first step towards maintaining consistency between architectural design, and implementation models. Model synchronization techniques initially presented within the context of model driven architecture provide an instrument for achieving change trace-ability and consistency. We present a framework whereby software artifacts at different levels of abstraction such as architecture diagrams, object models, and abstract syntax trees are represented by graph-based MOF compliant models that can be synchronized using model transformations. In such a framework model dependencies are implicitly encoded using transformation rules and an equivalence relation is used to evaluate when two models become …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "4 A Research Agenda for Service-Oriented Architecture",
            "Publication year": 2008,
            "Publication url": "ftp://ftp.sei.cmu.edu/pub/documents/08.reports/08tr017.pdf#page=24",
            "Abstract": "4.1 PURPOSEIt is clear that service-oriented architecture (SOA) is having a substantial impact on the way software systems are developed. However, although significant progress is being made on several fronts, current efforts seem to be evolving in many directions. There is a danger that important research needs will be overlooked, while other efforts will focus on issues of peripheral long-term significance in practice. As a research community that has gone through a substantial―growth spurt‖ we find ourselves facing a great opportunity and challenge: to better channel our research efforts, we should attempt to reflect upon our progress to date and recognize how our efforts and results build on each other, and to identify—and potentially prioritize—the areas that we still need to investigate. The purpose of this project is to provide a long-term consensus SOA research agenda, classified into research issues pertaining to the business, engineering, and operation aspects of service-oriented systems, plus a set of cross-cutting aspects. An additional goal is to assemble an international research group to analyze the current state of the practice and current research initiatives in SOA and create a community of interest around SOA research to share results and ideas on how to improve SOA adoption and the development of service-oriented systems.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Workbench for Quality Based Software Re-engineering",
            "Publication year": 2000,
            "Publication url": "https://stargroup.uwaterloo.ca/pubs/other/Tahvildari_et_al_OOPSLA00-Poster.pdf",
            "Abstract": "This research presents a re-engineering workbench and architecture that allows for legacy systems written in procedural languages to be migrated to new object oriented platforms. This methodology allows for specific design and quality requirements of the target migrant system to be considered during the re-engineering process through an iterative and incremental process. The migration process recovers an object model from the procedural code and incrementally refines it by taking into consideration the design requirements for the migrant system. A case study is presented as a proof of concept.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:4MWp96NkSFoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards automatic establishment of model dependencies using formal concept analysis",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218194006002902",
            "Abstract": "Software evolution is an iterative and incremental process that encompasses the modification and alteration of software models at different levels of abstraction. These modifications are usually performed independently, but the objects to which they are applied to, are in most cases mutually dependent. Inconsistencies and drift among related artifacts may be created if the effects of an alteration are not properly identified, recorded, and propagated in other dependent models. For large systems, it is possible that there is a considerable number of such model dependencies, for which manual extraction is not feasible. In this paper, we introduce an approach for automating the identification and encoding of dependence relations among software models and their elements. The proposed dependency extraction technique first uses association rules to map types between models at different levels of abstraction. Formal …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:r0BpntZqJG4C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "A user‐assisted approach to component clustering",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smr.277",
            "Abstract": "In this paper, we present a user‐assisted clustering technique for software architecture recovery based on a proximity measure that we call component association. The component association measure is computed on the shared properties among groups of highly related system entities. In this approach, the software system is modeled as an attributed relational graph with the software constructs (entities) represented as nodes and data/control dependencies represented as edges. The application of data mining techniques on the system graph allows us to generate a component graph where the edges are labeled by the association strength values among the components. An interactive partitioning technique is used to partition a system into cohesive components. Graph visualization tools and cluster quality evaluation metrics are applied by the user to assess and fine tune the partition result. Copyright © 2003 …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:kNdYIx-mwKoC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Computer aided software engineering",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/047134608X.W6911",
            "Abstract": "The sections in this article are",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "4th Workshop on Leveraging REST and Web Technologies in Enterprise Service Systems",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2555523.2555568",
            "Abstract": "Modern service-oriented enterprise systems tend to encapsulate architectural principles and constraints that characterize the World Wide Web architecture. In particular, during the last few years Representational State Transfer (REST), which contains most of the architectural constraints that the Web architecture conforms to, has influenced the way service systems are designed and implemented in the enterprise. In addition, organizations have traditionally based their environments and service-oriented ecosystems in procedure-oriented conceptualizations. Therefore, a number of issues and challenges related to the introduction of resource-orientation in enterprise computing have been raised. In this workshop, we examined a number of issues and topics around leveraging REST and Web Technologies for designing, building, composing modern resource-oriented service systems, and we identified a collection of …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Incremental Software Architecture Recovery based on Supervised Clustering",
            "Publication year": 2010,
            "Publication url": "http://www.cs.ecu.edu/sartipi/papers/7.IJSEKE.pdf",
            "Abstract": "We present a supervised clustering environment for the analysis and restructuring of the legacy software systems into cohesive components. The proposed technique is novel in the sense that it pre-processes the relations among the system entities using data mining techniques in order to extract groups of maximally associated system entities. This property can be further used to define similarity metrics between two individual entities or between two groups of entities. Consequently, a two-phase supervised clustering process is used to incrementally generate new clusters. The proposed architectural recovery process is hierarchical in the sense that the software system is first decomposed into subsystems of files and then each subsystem can be further decomposed into modules of system entities such as functions, datatypes, and global variables. An interactive environment provides evaluation metrics to assess the quality of the obtained clusters according to their cohesion and coupling properties. Experimental results obtained by applying the proposed clustering technique on six open source systems are presented.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A pattern matching framework for software architecture recovery and restructuring",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/852478/",
            "Abstract": "The paper presents a framework for software architecture recovery and restructuring. The user specifies a high level abstraction view of the system using a structured pattern language. A pattern matching engine provides an optimal match between the given pattern and a decomposition of the legacy system entities by satisfying the inter/intramodule constraints defined by the pattern. The data mining technique Apriori is used by the matching engine to reveal meaningful data and control flow properties of the target system and limit the search space. A branch and bound search algorithm using a score function, models the constraints in the pattern as a Valued Constraint Satisfaction Problem (VCSP), and assists in searching for an optimal match between the given pattern and the target system.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A research agenda for maintenance & evolution of soa-based systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4362663/",
            "Abstract": "The main goal of this working session is to provide an opportunity for participants to present current work and have a lively discussion of open issues for the maintenance and evolution of SOA-based systems. The dialog will include both business issues (e.g., organizational changes in the context of migrating to an SOA environment) and technical issues (e.g., analyzing the reuse potential of legacy components in an SOA environment). A draft version of a research agenda will be used as a starting point for obtaining feedback from researchers and practitioners active in this area.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic Web data description and discovery",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1372144/",
            "Abstract": "Currently we are experiencing the emergence of the fourth generation of the World Wide Web which is geared towards service and data provision using semantic and ontological information. Specifically, the objective is for data available on the Web to be described, retrieved, and used using semantic and contextual information. This paper presents a framework that allows such a polymorphic service provision through the introduction of user personas, semantic data descriptions that extend the WSDL and the UDDI protocols. In this way, Web data content is associated at run-time with different services and presentation manifests, according to the context and the environment it is invoked and used in. The framework and its associated architecture have been implemented in a prototype system that utilizes Web services technology.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interactive software architecture recovery: An incremental supervised clustering approach",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=17972320863682697032&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:rO6llkc54NcC",
            "Publisher": "Department of Electrical and Computer Engineering, University of Waterloo"
        },
        {
            "Title": "On the role of design patterns in quality-driven re-engineering",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/995810/",
            "Abstract": "Design patterns have been widely adopted and well investigated by the software engineering community over the past decade. However, their primary use is still associated with forward engineering and the design phase of the software life-cycle. In this paper, we examine design patterns from a different perspective namely, their classification and usage for software re-engineering and restructuring. Specifically, twenty three design patterns originally presented in the \"Gang of Four\" book are reclassified for re-engineering purposes into two major categories, primitive and complex. Moreover, their relationships and impacts to specific re-engineering objectives are presented in terms of a layered model that is denoted by six different relations namely: uses, refines, conflicts, is-similar-to, combines-with, and requires. The paper also discusses how the classification scheme can be applied for the re-engineering and …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a Webcentric Legacy System Migration Framework",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/L-Aversano/publication/3893301_Migrating_legacy_systems_to_the_Web_An_experience_report/links/0a85e5362d5ed96858000000/Migrating-legacy-systems-to-the-Web-An-experience-report.pdf#page=70",
            "Abstract": "With the rapid growth of B2B and e-Commerce activities, the “Service Web” has emerged as a promising framework to address the issues related to process integration. In this paper, we present a stack of interrelated protocols, such as SOAP, WSDL, and UDDI, to support service integration using the Web as the medium. Specifically, we aim for a framework that allows for the identification of reusable business logic in large legacy systems in the form of major legacy components, the identification of interfaces between the legacy components and the rest of the legacy system, the automatic generation of CORBA wrappers to enable for remote access, and finally, the seamless interoperation with Web services via HTTP based on the SOAP messaging mechanism.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Schema independent reduction of streaming log data",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07881-6_27",
            "Abstract": "Large software systems comprise of different and tightly interconnected components. Such systems utilize heterogeneous monitoring infrastructures which produce log data at high rates from various sources and in diverse formats. The sheer volume of this data makes almost impossible the real- or near real-time processing of these system logs. In this paper, we present a log schema independent approach that allows for the real time reduction of logged data based on a set of filtering criteria. The approach utilizes a similarity measure between features of the incoming events and a set of filtering features we refer to as beacons. The similarity measure is based on information theory principles and uses caching techniques so that infinite log data streams and log data schema alterations can be handled. The approach has been applied successfully on the KDD-99 intrusion detection benchmark data set.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Distributed analysis and filtering of application event streams",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121217300687",
            "Abstract": "Large information systems comprise different interconnected hardware and software components, that collectively generate large volumes of data. Furthermore, the run-time analysis of such data involves computationally expensive algorithms, and is pivotal to a number of software engineering activities such as, system understanding, diagnostics, and root cause analysis. In a quest to increase the performance of run-time analysis for large sets of logged data, we present an approach that allows for the real time reduction of one or more event streams by utilizing a set of filtering criteria. More specifically, the approach employs a similarity measure that is based on information theory principles, and is applied between the features of the incoming events, and the features of a set of retrieved or constructed events, that we refer to as beacons. The proposed approach is domain and event schema agnostic, can handle …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:GtLg2Ama23sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Advanced clone-analysis to support object-oriented system refactoring",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/891457/",
            "Abstract": "Manual source code copy and modification is often used by programmers as an easy means for functionality reuse. Nevertheless, such practice produces duplicated pieces of code or clones whose consistent maintenance might be difficult to achieve. It also creates implicit links between classes sharing a functionality. Clones are therefore good candidates for system redesign. This paper presents a novel approach for computer-aided clone-based object-oriented system refactoring. The approach is based on an advanced clone analysis which focuses on the extraction of clone differences and their interpretation in terms of programming language entities. It also focuses on the study of contextual dependencies of cloned methods. The clone analysis has been applied to JDK 1.1.5, a large scale system of 150 KLOC.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "on a Research Agenda for Maintenance and Evolution of Service-Oriented Systems (MESOA 2010)",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.645.9679&rep=rep1&type=pdf",
            "Abstract": "This paper investigates the evolution of business processes triggered by changing operating conditions, company policies, and deterioration of key performance indicators (KPIs). We monitor the execution of business processes, build and tune the performance model of the process under study, and then use it to investigate future changes or improvements.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:5qfkUJPXOUwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing a multi-objective decision approach to select source-code improving transformations",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1357829/",
            "Abstract": "Our previous work on improving the quality of object-oriented legacy systems through re-engineering proposed a software transformation framework based on soft-goal inter-dependency graphs (Tahvildari and Kontogiannis, 2002). We considered a class of transformations where a program is transformed into another program in the same language (source-to-source transformations) and that the two programs may differ in specific qualities such as performance and maintainability. This paper defines a decision making process that determines a list of source-code improving transformations among several applicable transformations. The decision-making process is developed on a multi-objective decision analysis technique. This type of technique is necessary as there are a number of different, and sometimes conflicting, criterion among nonfunctional requirements. For the migrant system, the proposed approach …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Policy modeling and compliance verification in enterprise software systems: A survey",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6392600/",
            "Abstract": "During the past few years we are witnessing a paradigm shift in enterprise computing, from the classic host-based service-oriented architecture pattern, to a more complex or elastic computing pattern that facilitates the provision of on-demand computing resources. This new computing paradigm offers numerous advantages but also, poses significant challenges. Advantages are related to the flexibility service providers have on deploying virtual resources on as-needed-basis, providing thus opportunities for large scale computing capabilities, while limiting the total cost of ownership. However, these benefits come at the cost of the user partially losing control over the deployed resources and the cost managing platforms and applications that are now provisioned at an unprecedented rate and interaction complexity. In order to address the above challenges, a service management and service assurance framework is …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Goal Modelling Meets Service Choreography: A Graph Transformation Approach",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9233296/",
            "Abstract": "As microservices become one of the predominant architectural styles for distributed enterprise computing, there is a need to devise frameworks which allow for the goal driven composition and coordination of such highly granular service components. Even though a number of service composition and orchestration techniques have been proposed over the past decade, these do not take into account stakeholders’ intents as well as data, control, and temporal interdependencies between actions microservices can perform. In this paper, we present extensions to goal models with respect to data, logical and temporal dependencies exhibited between tasks and actions among microservices, and we propose a framework based on a graph transformation approach which, when applied to the extended goal models, can yield service invocation plans that achieve the desired requirements and constraints denoted by the …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:OP4eGU-M3BUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A research agenda for service-oriented architecture",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1370916.1370917",
            "Abstract": "It is clear that Service-Oriented Architecture (SOA) is having a substantial impact on the way software systems are developed. However, although significant progress is being made in several fronts, current efforts seem to evolve in many directions. There is danger that important research needs will be overlooked, while other efforts will focus on issues of peripheral long-term significance in practice. As a research community that has gone through a substantial\" growth spurt\" we find ourselves facing a great opportunity and challenge: to better channel our research efforts, we should attempt to reflect upon our progress to date and recognize how our efforts and results build on each other, and to identify--and potentially prioritize--the areas that we still need to investigate. The purpose of this work is to provide a long-term consensus SOA research agenda, classified into research issues pertaining to the business …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interoperability and Integration of Enterprise Applications through Grammar-Based Model Synchronization",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/9549043/preproc-step-2005.pdf#page=255",
            "Abstract": "Enterprise applications consist of heterogeneous components and subsystems that communicate through externally exposed interfaces. Each of the component or system interfaces represents a set of specific constraints and relations to which the systems that implement them must conform. Therefore, the problem of enterprise application integration and interoperability can be seen as a problem of model synchronization of system descriptions and the underlying deployment component models. In this paper, we present an approach to integration and interoperability of enterprise applications through grammar-based model synchronization. As part of the approach, component and subsystem interfaces are viewed as instances of corresponding domains formally defined through annotated domain model grammars. The automated mapping between source and target interfaces is performed via association grammars that represent associated productions of the two domains.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SDSOA 2008: second international workshop on systems development in SOA environments",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1370175.1370240",
            "Abstract": "The key objective of this workshop is to provide researchers and practitioners an opportunity to discuss open SOA research challenges. An SOA research agenda that has been developed by SEI and a group of collaborators over the past year will be presented as a framework for obtaining feedback and new ideas from researchers and practitioners who do work and research in this area.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prototalk: A generative software engineering framework for prototyping protocols in smalltalk",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5254228/",
            "Abstract": "Network protocols are complex systems implemented by collections of equally complex software components. In many cases, the realization of such protocols requires extensive prototyping and experimentation with different alternative implementations.In this paper, we present ProtoTalk, a generative, domain-specific software framework that utilizes model driven software engineering principles for prototyping state and message driven protocols with emphasis on telecommunication and network protocols. The framework allows first, for modeling a variety of common protocol features by using mappings from state machines, sequence diagrams and packet encodings to ProtoTalk models, and second, for the consequent automatic generation of prototype Smalltalk code from the aforementioned ProtoTalk models. In this respect, the paper attempts to shed light on the use of generative model driven programming …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identification of REST-like resources from legacy service descriptions",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5645561/",
            "Abstract": "Service-oriented systems mainly follow two principles for accessing data and invoking back end applications: Remote Procedure Calls and Message-Orientation. However, a number of researchers and practitioners have criticized these paradigms as too complex and rigid. Instead, Representational State Transfer (REST) architectural style has lately gained significant attention as an alternative means for accessing services and data. RESTful HTTP systems depend on Uniform Resource Identifiers (URIs) to uniquely identify and denote data and services as “resources”. In this paper, we discuss a technique to analyze the descriptions of legacy data and services in order first, to model their roles and relationships and second, to use the discovered dependencies for extracting Unique Resource Identifiers and the available HTTP methods, so that these legacy service elements and data can be accessed using …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Model-driven business process recovery",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1374322/",
            "Abstract": "A business process attempts to encapsulate the delivery of a sequence of tasks, typically starting from accepting a service request and ending at certain points, such as the completion of the service. We propose a model-driven business process recovery framework that captures the essential functional features representing a business process. The framework utilizes static tracing techniques and a number of heuristics to map source code entities to high-level business process entities. A case study is preformed to recover IBM/spl reg/ WebSphere/spl reg/ Business Integration business processes from IBM WebSphere Commerce code. The experimental result demonstrates the effectiveness of the proposed framework.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advanced clone-analysis to support object-oriented system",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=7338304234273014436&hl=en&oi=scholarr",
            "Abstract": "cess used instead is a manual\" copy-and-paste”. This Manual source code copy and modification is often used other approach produces what we call cloned pieces of by programmers as an easy means for functionality code, or clones which will undergo independent succes-reuse. Nevertheless, such practice produces duplicated sive maintenance (12). pieces of code or clones whose consistent maintenance",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:u-coK7KVo8oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3rd International Workshop on Net-Centric Computing (NCC 2001): Theme: Migrating to the Web",
            "Publication year": 2001,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/icse/2001/10500766/12OmNvlg8ow",
            "Abstract": "Enlarged ventricular size and/or asymmetry have been found markers for psychiatric illness, including schizophrenia. However, this morphometric feature is non-specific and occurs in many other brain diseases, and its variability in healthy controls is not sufficiently understood. We studied ventricular size and shape in 3D MRI (N= 20) of monozygotic (N= 5) and dizygotic (N= 5) twin pairs. Left and right lateral, third and fourth ventricles were segmented from high-resolution T1w SPGR MRI using supervised classification and 3D connectivity. Surfaces of binary segmentations of left and right lateral ventricles were parametrized and described by a series expansion using spherical harmonics. Objects were aligned using the intrinsic coordinate system of the ellipsoid described by the first order expansion. The metric for pairwise shape similarity was the mean squared distance (MSD) between object surfaces. Without …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:j8SEvjWlNXcC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Clone detector use questions: A list of desirable empirical studies",
            "Publication year": 2007,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2007/969/",
            "Abstract": "Code\" clones\" are similar segments of code that are frequently introduced by\" scavenging\" existing code, that is, reusing code by copying it and adapting it for a new use. In order to scavenge the code, the developer must be aware of it already, or must find it. Little is known about how tools-particularly search tools-impact the clone construction process, nor how developers use them for this purpose. This paper lists five outstanding research questions in this area and proposes sketches of designs for five empirical studies that might be conducted to help shed light on those questions.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik"
        },
        {
            "Title": "The migration of multi-tier e-commerce applications to an enterprise Java environment",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1022697422240",
            "Abstract": "As technology evolves, many organizations face the problem of migrating legacy applications from one technology base to another. We report on a case study involving the migration of legacy code into the IBM® WebSphere® Commerce Suite product. Specifically, we focus on the problem of migrating applications that use traditional database access techniques to applications using the Enterprise JavaBean (EJB) programming model. Our results include a practical methodology that facilitates such migration, as well as a tool that supports this methodology. The tool has been released on IBM's alphaWorks site.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "2nd International Workshop on Personalized Web Tasking",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2555523.2555577",
            "Abstract": "The\" Personal Web Tasking\" workshop is the second in a series that started in the context of the\" ICWS 2013\" conference (in June 2013). The objective of the workshop is to bring together researchers and practitioners interested in developing a new generation of the web as a platform programmable by end users, through",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:LI9QrySNdTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Workshop on a Research Agenda for Maintenance and Evolution of Service-Oriented Systems (MESOA 2009)",
            "Publication year": 2010,
            "Publication url": "https://resources.sei.cmu.edu/asset_files/specialreport/2011_003_001_15323.pdf",
            "Abstract": "This paper investigates the evolution of business processes triggered by changing operating conditions, company policies, and deterioration of key performance indicators (KPIs). We monitor the execution of business processes, build and tune the performance model of the process under study, and then use it to investigate future changes or improvements.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:hCrLmN-GePgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality Driven Transformation Framework for Object Oriented Migration",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.5.6954&rep=rep1&type=pdf",
            "Abstract": "Reengineering legacy software systems to object oriented platforms has received significant attention over the past few years. In this paper, we propose a goal driven software migration framework that aims to identify and extract a quality object model from a procedural system and to generate quality object oriented code that produces a platform for network-centric application integration. The framework is composed of analysis tools, transformation rules, and non-functional requirement models for the target migrant system. Specifically, to facilitate the design and development of such goal driven migration framework, source code transformation rules are associated with a degree of belief that they contribute towards enhancing a desired property for the target system. The migration process applies a search algorithm that is guided by the source code analysis to select a transformation sequence that has the highest likelihood of yielding such a target system. The migration of a selected set of gnu AVL libraries to a new object oriented platform is presented as a proof of concept for the proposed technique.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a portable XML-based source code representation",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/42090379/xse-2001.pdf",
            "Abstract": "Program representation is a critical issue in the area of software analysis and software re-engineering. It heavily relates to the portability and effectiveness of the software analysis tools that can be developed. This paper describes an approach that focuses on source code representation schemes in the form of Abstract Syntax Trees that are encoded as XML documents. These XML source code representations conform with a DTD we call the domain model. By utilizing a domain model for a given programming language we can build tools on top of an XML DOM tree. The XML DOM tree has a standard API that all tools developed using this approach can use. In such a way, software analysis tools can interoperate or be easily integrated in what we refer to as Integrated Software Maintenance Environments.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Run-time requirements verification for reconfigurable systems",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0950584916300593",
            "Abstract": "Context: Modern software systems often are distributed, run on virtualized platforms, implement complex tasks and operate on dynamically changing and unpredictable environments. Such systems need to be dynamically reconfigured or evolve in order to continue to meet their functional and non-functional requirements, as load and computation need to change. Such reconfiguration and/or evolution actions may cause other requirements to fail.Objective: Given models that describe with a degree of confidence the requirements that should hold in a running software system, along with their inter-dependencies, our objective is to propose a framework that can process these models and estimate the degree requirements hold as the system is dynamically altered or adapted.Method: We present an approach where requirements and their inter-dependencies are modeled using conditional goal models with weighted …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:0N-VGjzr574C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Working Session: Program Comprehension and Migration Strategies for Web Service and Service-Oriented Architectures",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1631126/",
            "Abstract": "The migration to Web services has the potential of providing significant value to keeping legacy systems and components operational in a networked environment, a number of critical issues still need to be addressed. These issues can be classified in three categories; a) program comprehension and analysis issues; b) legacy system migration issues and; c) technology and standards issues. This paper discusses and debates approaches for addressing these issues. The paper's objective is twofold. First, is to explore the current state of the art in methods, tools and technologies that can assist in carrying out the required work and to identify a taxonomy of current approaches as well as, their strengths and weaknesses. The second objective is to identify open issues and research opportunities in the area of migrating legacy systems in Web enabled environments",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:zLWjf1WUPmwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Report from the 4th International Workshop on Net-Centric Computing (NCC 2005)",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1691643/",
            "Abstract": "This paper reports on the activities and results from the 4 International Workshop on Net-Centric Computing (NCC 2005) that was held on September 25, 2005 in Budapest, Hungary as part of the 13 Software Technology and Engineering Practice conference (STEP 2005). The theme of NCC 2005 was \"Middleware: The Next Generation.\" The workshop focused on issues related to emerging middleware technologies in an NCC environment. Representative topics included gap analysis of current middleware offerings, empirical studies of middleware as an enabling technology for NCC applications, and forecasts for new directions in middleware in the coming years",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:uc_IGeMz5qoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SANER’20",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9054805/",
            "Abstract": "Conference proceedings front matter may contain various advertisements, welcome messages, committee or program information, and other miscellaneous conference information. This may in some cases also include the cover art, table of contents, copyright statements, title-page or half title-pages, blank pages, venue maps or other general information relating to the conference that was part of the original conference proceedings.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:fFSKOagxvKUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web-based specification and integration of legacy services",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.23.5818&rep=rep1&type=pdf",
            "Abstract": "With the explosive growth of the Internet, businesses of all sizes aim on applying networkwide solutions to their IT infrastructures, migrating their legacy business processes into web-based environments, and establishing their own on-line services. To facilitate process and service integration, a complete and information rich service description language, is essential for server processes to be specified and for client processes to be able to locate services that are available in Web-enabled remote servers. Within the context of emerging technologies, such as XML, Internet, and Web-enabled application servers, we propose an architecture that allows for the migration of legacy services to distributed environments. The architecture is based on legacy component wrapping, a service description language that allows for the specification of services at higher levels of abstraction than the standard Interface Description Languages (IDLs), and on techniques that support service registration and dynamic service localization.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3rd Workshop on Leveraging REST and Web Technologies in Enterprise Service Systems",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2399776.2399804",
            "Abstract": "During the last few years, the architecture of the Web has been a significant source of influence in designing and implementing modern service-oriented systems. More specifically, the Representational State Transfer (REST) as the primary architectural style of the Web, along with HTTP and URI as the primary technologies of the Web, have provided an important alternative paradigm in building enterprise service systems. The aim is to provide a better and more seamless integration of these systems with the resource-oriented nature of the Web's ecosystem. Nevertheless, existing enterprise computing service systems and assets that follow primarily the procedure-oriented design and the lack of mature models, tools, and methodologies in building RESTful systems expose a number of issues and challenges that pertain to the use of resource orientation in enterprise computing. In this workshop, we examined the …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:URolC5Kub84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Model synchronization for efficient software application maintenance",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1357849/",
            "Abstract": "A business software application often has two perspectives: the business flow and operation that the application intends to solve, and the source code and its design and flow upon which the application is built. As one changes and evolves, the other needs to be synchronized. This paper addresses an approach to synchronize these two models for effective software maintenance.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Challenges and opportunities related to the design, deployment and, operation of Web Services",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4659244/",
            "Abstract": "Web services have been proposed almost a decade ago as an implementation technology for service oriented architecture. Web service technologies have since been adopted by many users as a vehicle to build such service provision-based software systems. Despite their widespread adoption, Web services still pose significant challenges as well as, opportunities both to the information technology community and, to business community. The challenges deal with engineering, and adoption issues while the opportunities deal mostly with business and operations issues. In this paper, we first discuss the state of the art in the area of Web services, and then we proceed on identifying challenges and opportunities related to designing, implementing, operating and maintaining such systems. Finally, we present emerging technologies that we believe may play a significant role in implementing and deploying the next …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Keynote: Service Systems Compliance and Management: Requirements, Challenges, Opportunities by Kostas Kontogiannis",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6976602/",
            "Abstract": "We have come a long way from the service oriented architecture model, and we are now witnessing the proliferation of service eco-systems and socio-technical systems being considered within the context cloud provisioned environments. The management and compliance issues that were applicable in the past are now of limited use and need be adapted due to the complexity of the interdependencies of the constituent framework components, services, processes, and stakeholders. This keynote will first set the stage for defining and understanding the problem of evaluating compliance and managing such systems, identify technical challenges, and discuss research issues and future opportunities.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:xtoqd-5pKcoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards Environment Retargetable Parser Generators",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-21599-0_18",
            "Abstract": "One of the most fundamental issues in program understanding is the issue of representing the source code at a higher level of abstraction. Even though many researchers have investigated a variety of program representation schemes, one particular scheme, the Abstract Syntax Tree (AST), is of particular interest for its simplicity, generality, and completeness of the information it contains. In this chapter, we investigate ways to generate Abstract Syntax Trees that conform with a user-defined domain model, can be easily ported to different CASE tools, and can be generated using publicly available parser generators. The work discussed in this chapter uses PCCTS and yacc as parser generators, and provides an integration mechanism with the conceptual language Telos, and the CASE tools Rigi, PBS, and RefineTM .",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "A software transformation framework for quality-driven object-oriented re-engineering",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1167824/",
            "Abstract": "In re-engineering object-oriented legacy code, it is frequently useful to introduce a design pattern in order to improve specific nonfunctional requirements (e.g., maintainability enhancement). This paper presents a methodology for the development of a quality-driven re-engineering framework for object-oriented systems. First, a catalogue of design motifs (primitive design pattern transformations) is presented Then, the transformations for the design patterns in the GoF book are defined as a composition of these primitive transformations. Nonfunctional requirements for the migrant system can be encoded using soft-goal interdependency graphs and can be associated with design pattern transformations that are applied for the migration of an object-oriented legacy system.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Issues and challenges leveraging REST architectural style in enterprise service systems",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1923947.1923997",
            "Abstract": "Over the past decade we have experienced a steady growth of software applications that are based on Service-Oriented Architecture and Web Services. These systems rely on protocols, such as SOAP, that utilize the Remote Procedure Call (RPC) as well as messaging principles used for accessing data and invoking back-end applications. However, a number of researchers and practitioners have criticized the Service Oriented Architecture paradigm as too complex and rigid. Instead, they have proposed an alternative architectural style called REST for accessing services and data through a collection of URIs, which uniquely identify and denote services and data as\" resources\" over the Web. The result is that client applications can use light-weight HTTP requests to obtain access and manipulate such\" resources\".",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fifth International Workshop on System Quality and Maintainability",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5741276/",
            "Abstract": "The fifth international workshop on Software Quality and Maintainability (SQM 2011) offered a forum to researchers to present their original work and to practitioners to relate their experiences on issues pertaining to software quality and maintainability. Moreover, the theme of the workshop invited discussion on how to bridge the gap between end user expectations, business requirements, vendor performance, and engineering constraints regarding software quality.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:evX43VCCuoAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "12th European Conference on Software Maintenance and Reengineering",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4493288/",
            "Abstract": "[Breaker page] - IEEE Conference Publication IEEE.org IEEE Xplore IEEE-SA IEEE Spectrum \nMore Sites Create Account Personal Sign In Personal Sign In For IEEE to continue sending \nyou helpful information on our products and services, please consent to our updated Privacy \nPolicy. I have read and accepted the IEEE Privacy Policy. Accept & Sign In Email Address \nPassword Sign In Forgot Password? [Breaker page] Abstract: Breaker page. Published in: \n2008 12th European Conference on Software Maintenance and Reengineering Article #: Date \nof Conference: 1-4 April 2008 Date Added to IEEE Xplore: 18 April 2008 ISBN Information: \nPrint ISBN: 978-1-4244-2157-2 ISSN Information: Print ISSN: 1534-5351 INSPEC Accession \nNumber: Persistent Link: https://xplorestaging.ieee.org/servlet/opac?punumber=4489834 More \n» Publisher: IEEE IEEE Account Change Username/Password Update Address Purchase ? : -…",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards portable source code representations using XML",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/891464/",
            "Abstract": "One of the most important issues in source code analysis and software re-engineering is the representation of software code text at an abstraction level and form suitable for algorithmic processing. However, source code representation schemes must be compact, accessible by well defined application programming interfaces (APIs) and above all portable to different operating platforms and various CASE tools. This paper proposes a program representation technique that is based on language domain modes and the XML markup language. In this context, source code is represented as XML DOM trees that offer a higher level of openness and portability than custom-made tool specific abstract syntax trees. The DOM trees can be exchanged between tools in textual or binary form. Similarly the domain model allows for language entities to be associated with analysis services offered by various CASE tools, leading to …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Maintainability Model for Industrial Software Systems Using Design Level",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/40642519/A_maintainability_model_for_industrial_s20151204-2680-ejv9se.pdf",
            "Abstract": "Software maintenance is a time consuming and expensive phase of a software product's life-cycle. This paper investigates the use of software design metrics to statistically estimate the maintainability of large software systems, and to identify error prone modules. A methodology for as-Sessing, evaluating and, selecting software metrics for pre-dicting software maintainability is presented. In addition, a linear prediction model based on a minimal set of design level software metrics is proposed. The model is evaluated by applying it to industrial software systems.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:FPJr55Dyh1AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "i-Cube: A tool-set for the dynamic extraction and integration of web data content",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45415-2_8",
            "Abstract": "This paper presents the i-Cube environment, a tool-set that allows for Internet data and content originally available as HTML Web pages and programmatic scripts to be denoted, modeled, and represented in the form of XML documents. These XML documents conform to spe- cific Document Type Definitions and other structural constraints that are fully customizable by the end-user or the service provider. The approach is based on representing HTML document data content in the form of annotated trees. Specific areas of interest and data content in the original HTML document that need to be encoded in the form of an XML rep- resentation, are represented as a collection of annotated sub-trees in the tree that corresponds to a large HTML document. A service integration module allows for different categories of analysis and presentation rules to be invoked according to script based user-defined logic.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "SDSOA 2007: International Workshop on Systems Development in SOA Environments",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4222711/",
            "Abstract": "The Service-Oriented Architecture (SOA) paradigm is having a substantial impact on the way software systems are developed. Although significant progress is being made in several fronts, there are not a set of clear, central themes to focus research activity. As a result, there is a danger that important research needs will be overlooked, while other efforts will focus on issues of peripheral long-term significance in practice. The objective of this workshop is to begin developing a long-term community-wide research agenda for the successful development of SOA-based systems. A tentative taxonomy of research issues will be presented, as well as papers that focus on specific parts of the taxonomy. Through an interactive workshop format, researchers will collaboratively identify open research issues and develop a draft research agenda for the community.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Welcome from the program co-chairs",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5306344/",
            "Abstract": "This year we have received a good number of submissions by authors from 31 countries to the research track. From a total of 162 submissions, the program committee selected 35 full papers and 28 short papers. The acceptance ratio of the full papers is 22%. These 35 full papers are presented in 12 presentation sessions on software testing, evolution studies, software design, verification and validation, practice studies, change analysis, dynamic analysis, metrics and measurement, defect analysis, static analysis, software process, and concept/traceability recovery, respectively. The 28 short papers are presented in both 2 presentation sessions and 1 poster session. The program also includes two keynotes given by distinguished researchers: Mary Jean Harrold and David M. Weiss. Each submitted paper to the research track was reviewed by at least three members of the program committee, which consists of 78 …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "First International Workshop on Refactoring: Achievements, Challenges, and Effects (REFACE? 03).",
            "Publication year": 2003,
            "Publication url": "https://stargroup.uwaterloo.ca/pubs/conf/Tahvildari_et_al_REFACE03.pdf",
            "Abstract": "The research in object-oriented restructuring and refactoring continues to be very active in these days. Although commercial refactoring tools are beginning to increase in number, there are still a lots of open issues that remain to be solved. In general, there is a need for formalism and methods that address refactoring operations in a more consistent, generic, scalable way. The aim of this half-day workshop is to bring together researchers and practitioners within the field of object-oriented restructuring and refactoring to address the current state of research and to raise a number of open questions from both fundamental and practical perspectives. Position paper presentations following the discussions are employed to explore issues and questions. The output of the discussion sessions will be the foundation for a workshop report.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Continuous software engineering: challenge areas and frameworks",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/3049877.3049931",
            "Abstract": "Over the past years we are witnessing a paradigm shift on software development operations, where software life-cycle phases form a continuous process model as opposed to discrete process steps. In this respect, researchers and practitioners propose methods, tools, and frameworks that allow for continuous software engineering activities which achieve controlled short release cycles. More specifically, such activities that are bound in a continuum include business analysis, implementation, integration, delivery, testing and, compliance verification. To implement such a model we require infrastructures that provide continuous verification and gathering of new requirements, continuous run-time monitoring, continuous assessment of software health, and automatic or semi-automatic deployment and integration.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework for business model driven development",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1613370/",
            "Abstract": "Typically, large companies in an effort to increase efficiency specify business processes using workflow languages, while software designers specify the systems that implement these processes with the use of languages like UML. This separation of domain expertise allows for software engineers from each individual area to work more efficiently using domain specific languages and tools. However, models in these two domains evolve independently and inconsistencies may occur when two models become unsynchronized due to constant revision or evolution of processes and design artifacts. In this paper, we present a set of transformations to automatically generate a specific set of UML artifacts from the business process specifications. In particular, we examine and investigate a preliminary framework for the necessary annotations that need be applied to a business process model so that the generation of UML …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Message from the PWT 2013 Organizers",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=11121834762353427709&hl=en&oi=scholarr",
            "Abstract": "In the continuous quest of enhancing the experience of users interacting with web systems, researchers and practitioners are investigating ways to automate repetitive and mundane tasks transparently; customize the users' experience to their specific computing devices; and to personalize the interactions based on the users' spatiotemporal and social context. The topic of personal web tasking draws inspiring ideas from web services, RESTful system design, context-aware computing, sematic web, linked data, HCI, ubiquitous computing, workflow management, and W3C standards.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:2VqYfGB8ITEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proceedings of the 3rd International Workshop on a Research Agenda for Maintenance and Evolution of Service-Oriented Systems (MESOA 2009)",
            "Publication year": 2010,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA515837",
            "Abstract": "The 3rd International Workshop on a Research Agenda for Maintenance and Evolution of Service-Oriented Systems MESOA 2009 was held at the 25th International Conference on Software Maintenance ICSM 2009 in Edmonton, British Columbia, Canada on September 21, 2009. The goal for MESOA 2009 was to discuss current efforts in the maintenance and evolution of service-oriented systems and identify research challenges in addressing existing gaps and problems. The workshop had 20 attendees, representing industry and academia. Papers and presentations contributed original work, and the discussions highlighted additional work that is being done as well as new research challenges. Presentations from the workshop can be found at httpwww. sei. cmu. eduworkshopsmesoa2009. This report includes selected papers presented at the workshop that highlight important issues within the established SOA research agenda.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "CARNEGIE-MELLON UNIV PITTSBURGH PA SOFTWARE ENGINEERING INST"
        },
        {
            "Title": "Requirements-driven software re-engineering framework",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957811/",
            "Abstract": "Software re-engineering projects such as migrating code from one platform to another or restructuring a monolithic system into a modular architecture are popular maintenance tasks. Usually, projects of this type have to conform to hard and soft quality constraints (or non-functional requirements) such as \"the migrant system must run as fast as the original\", or \"the new system should be more maintainable than the original\". This paper proposes a framework that allows for specific design and quality requirements (performance and maintainability) of the target migrant system to be considered during the re-engineering process. Quality requirements for the migrant system can be encoded using soft-goal interdependency graphs and can be associated with specific software transformations that need to be carried out for achieving the target quality requirement. These transformations can be applied as a series of iterative …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A user-assisted approach to",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=2140714092979963262&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present a user assisted clustering technique for software architecture recovery based on a proximity measure that we call component association. The component association measure is computed on the shared properties among groups of highly related system entities. In this approach, the software system is modeled as an attributed relational graph with the software constructs (entities) represented as nodes and data/control dependencies represented as edges. The application of data mining techniques on the system graph allows to generate a component graph where the edges are labeled by the association strength values among the components. An interactive partitioning technique and environment is used to partition a system into cohesive subsystems where the graph visualiëation aids and cluster quality evaluation metrics are applied to assess and fine tune the partition by the user.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A workbench for quality based software re-engineering to object-oriented platforms",
            "Publication year": 2000,
            "Publication url": "https://stargroup.uwaterloo.ca/pubs/other/Tahvildari_et_al_OOPSLA00-DS.pdf",
            "Abstract": "This research presents a re-engineering workbench and architecture that allows for legacy systems written in procedural languages to be migrated to new object oriented platforms. This methodology allows for specific design and quality requirements of the target migrant system to be considered during the re-engineering process through an iterative and incremental process. The migration process recovers an object model from the procedural code and incrementally refines it by taking into consideration the design requirements for the migrant system.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality and constraint driven workflow composition",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1613373/",
            "Abstract": "Complex business workflows are becoming an integral part of day-to-day business activities. As companies merge or embark in collaborations, there is a need to analyze, update, and integrate existing workflow specifications and run-time applications, to generate new ones that conform to specific target requirements and constraints. We propose a software engineering framework and its associated algorithms to compute the optimal composition of target workflows from constituent ones. First, we present a mechanism to compose services from constituent workflows to form a new target workflow. Second, since the composition process may entail the compliance to certain compositional, structural, or behavioral constraints we present a quantitative technique that is based on tolerance thresholds similar to those used in constraint satisfaction problems to restrict the number of constraints violated during the composition …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Language Neutral Program Representation and Generic Analysis",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=9697677712700334492&hl=en&oi=scholarr",
            "Abstract": "XML applications are becoming increasingly popular to define structured or semi-structured constrained data in XML for special application areas.In pursuit there is a growing momentum of activities related to XML representation of source code in the area of program comprehension and software reengineering. The source code and the artifacts extracted from a program are necessarily structured information that needs to be stored and exchanged",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:GFxP56DSvIMC",
            "Publisher": "IEEE Computer Society Press"
        },
        {
            "Title": "Joint Proceedings of the First International Workshop on Model-Driven Software Migration (MDSM 2011) and the Fifth International Workshop on Software Quality and Maintainability (SQM 2011)",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=15485998622483739947&hl=en&oi=scholarr",
            "Abstract": "4 Model-Driven Migration of Scientific Legacy Systems to Service-Oriented Architectures Jon Oldevik, Gøran K. Olsen, Ute Brönner, Nils Rune Bodsberg",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "CEUR"
        },
        {
            "Title": "Towards an interpretation framework for assessing interface uniformity in REST",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1967428.1967440",
            "Abstract": "Interface uniformity is regarded as one of the most distinctive features of the REST architectural style among other network-based styles, because of the specific set of restrictions it imposes on the behavior paradigms of interacting components. However, in practice conforming to the REST's uniform interface constraint in Web-based services most often proves to be a difficult task, as identified by a number of researchers and practitioners. This implementation and conformance difficulty can be partly attributed to the lack of a systematic conceptual framework that could be used to interpret abstract architectural restrictions of interface uniformity to practical design decisions and strategies being generalized as interface design criteria. These criteria could be then mapped to domain-specific techniques that provide the context for guiding and/or examining the level of uniformity of a REST-based API. In this paper, we …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pattern and policy driven log analysis for software monitoring",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4591541/",
            "Abstract": "The component-based nature of large industrial software systems that consist of a number of diverse collaborating applications, pose significant challenges with respect to system maintenance, monitoring, auditing, and diagnosing. In this context, a monitoring and diagnostic system interprets log data to recognize patterns of significant events that conform to specific threat models. Threat models have been used by the software industry for analyzing and documenting a systempsilas risks in order to understand a systempsilas threat profile. In this paper, we propose a framework whereby patterns of significant events are represented as expressions of a specialized monitoring language that are used to annotate specific threat models. An approximate matching technique that is based on the Viterbi algorithm is then used to identify whether system generated events, fit the given patterns. The technique has been applied …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient parallel reasoning on fuzzy goal models for run time requirements verification",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10270-016-0562-9",
            "Abstract": "As software applications become highly interconnected in dynamically provisioned platforms, they form the so-called systems-of-systems. Therefore, a key issue that arises in such environments is whether specific requirements are violated, when these applications interact in new unforeseen ways as new resources or system components are dynamically provisioned. Such environments require the continuous use of frameworks for assessing compliance against specific mission critical system requirements. Such frameworks should be able to (a) handle large requirements models, (b) assess system compliance repeatedly and frequently using events from possibly high velocity and high frequency data streams, and (c) use models that can reflect the vagueness that inherently exists in big data event collection and in modeling dependencies between components of complex and dynamically re-configured …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:86PQX7AUzd4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Introduction to the special issue on software analysis, evolution and reengineering",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167642306000189",
            "Abstract": "Software analysis, evolution, and reengineering are important areas of the software life cycle. The quest to maintain and keep operational large mission critical systems has always been a challenge for software practitioners. This special issue presents a compilation of papers covering six major areas namely, program understanding, tools and environments, source code modeling, component recovery, migration to network-centric platforms, and binary reverse engineering and reengineering. These papers are re-worked and extended versions of papers that appeared in the Working Conference on Reverse Engineering. We hope that the readers will find this collection of papers useful as it provides an indicative view of the current work in the areas of software analysis, evolution, and reengineering.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:hkOj_22Ku90C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Maintenance: Techniques.",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=6800757175583744894&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:sNmaIFBj_lkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A goal driven framework for software project data analytics",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38709-8_35",
            "Abstract": "The life cycle activities of industrial software systems are often complex, and encompass a variety of tasks. Such tasks are supported by integrated environments (IDEs) that allow for project data to be collected and analyzed. To date, most such analytics techniques are based on quantitative models to assess project features such as effort, cost and quality. In this paper, we propose a project data analytics framework where first, analytics objectives are represented as goal models with conditional contributions; second, goal models are transformed to rules that yield a Markov Logic Network (MLN) and third, goal models are assessed by an MLN probabilistic reasoner. This approach has been applied with promising results to a sizeable collection of software project data obtained by ISBSG repository, and can yield results even with incomplete or partial data.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:EYYDruWGBe4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Customizable service integration in Web-enabled environments",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45254-0_21",
            "Abstract": "In recent years we have been experiencing a tremendous change in software development processes, where new systems are built by utilizing distributed, possibly heterogeneous, components. In this pa- per, we propose an infrastructure and a meta programming environment that allows for distributed components to be integrated, in a fully cus- tomizable manner, intoWeb-enabled environments. In particular, we pro- pose an architecture that conforms to the event-condition-action para- digm. A set of event-condition-action rules combined with a rule enact- ment engine serves as a driver that determines the transaction logic by which remote services are invoked. A prototype system using the pro- posed architecture applied to the domain of e-commerce is also presented.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A maintainability model for industrial software systems using design level metrics",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/891476/",
            "Abstract": "Software maintenance is a time consuming and expensive phase of a software product's life-cycle. The paper investigates the use of software design metrics to statistically estimate the maintainability of large software systems, and to identify error prone modules. A methodology for assessing, evaluating and, selecting software metrics for predicting software maintainability is presented. In addition, a linear prediction model based on a minimal set of design level software metrics is proposed. The model is evaluated by applying it to industrial software systems.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the role of services in enterprise application integration",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1267619/",
            "Abstract": "Recent advances in Web and middleware technologies offer a promising solution for a number of enterprise integration problems. The convergence of the Internet and distributed-object technologies, which has been referred to as the Internet's third wave, extends this \"information-based\" Internet to a worldwide \"services-based\" Web. In this paper we present a model for Enterprise Application Integration (EAI) and we discuss the role of emerging technologies, as they relate to the specification of services, registration of services, data integration, and control integration.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "End-to-end E-commerce Application Development Based on XML Tools.",
            "Publication year": 2000,
            "Publication url": "http://www.softlab.ntua.gr/~kkontog/publications/journals/end-to-end.pdf",
            "Abstract": "In this paper, we discuss an electronic business application framework and its related architecture. The framework is presented in the form of a prototype system which illustrates how XML tools can assist organizations on building and deploying e-commerce applications. The use of the system is presented in the form of a sample e-commerce application that involves shopping in a virtual store. The framework allows for customers and service providers to be linked through XML/EDI with back-end applications and to trigger e-procurement orders which are sent using either XML or EDI messages. Invoice handling and order tracking are also discussed along with extensions to the proposed architecture that allow for business process logic to be encoded at the server side, in the form of Event Condition Action scripts.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:edDO8Oi4QzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Considerations of Adapting Service-Offering Components to RESTful Architectures",
            "Publication year": 2013,
            "Publication url": "https://www.igi-global.com/chapter/content/72222",
            "Abstract": "Over the past few years, we have witnessed a paradigm shift on the programming models and on architectural styles, which have been used to design and implement large-scale service-oriented systems. More specifically, the classic message-oriented and remote procedure call paradigm has gradually evolved to the resource-oriented architectural style, inspired by concepts pertinent to the World Wide Web. This shift has been primarily driven by multifaceted functional and non-functional requirements of Web enabled large-scale service offering systems. These requirements include enhanced interoperability, lightweight integration, scalability, enhanced performance, even looser coupling, and less dependence on shifting technology standards. As a consequence, several, and sometimes antagonistic, architectures, design patterns, and programming paradigms have emerged on a quest to overcome the constantly …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:XiVPGOgt02cC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "April 1–4, 2008 Athens, Greece",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4493287/",
            "Abstract": "The following topics are dealt with: software maintenance and reengineering and developing evolvable systems.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proceedings of 12th IEEE International Symposium on Web Systems Evolution, WSE 2010",
            "Publication year": 2010,
            "Publication url": "https://iris.unisannio.it/handle/20.500.12070/14631",
            "Abstract": "Proceedings of 12th IEEE International Symposium on Web Systems Evolution, WSE 2010 IRIS \nnascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti \nper: Autore Titolo Riviste Serie Login IRIS Archivio della ricerca dell'Università degli studi del \nSannio Catalogo Ricerca 7 Curatele 7.1 Curatela Proceedings of 12th IEEE International \nSymposium on Web Systems Evolution, WSE 2010 Italiano Italiano English Proceedings of \n12th IEEE International Symposium on Web Systems Evolution, WSE 2010 / Kontogiannis K; \nKienle H; Di Lucca G; Tilley S. - (2010). Scheda breve Scheda completa Titolo: Proceedings \nof 12th IEEE International Symposium on Web Systems Evolution, WSE 2010 Autori interni: \nDI LUCCA, Giuseppe Antonio mostra contributor esterni Data di pubblicazione: 2010 Handle: \nhttp://hdl.handle.net/20.500./14631 ISBN: 978-142448636-6 Appare nelle tipologie: in :…",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:_5tno0g5mFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Source code modularization using lattice of concept slices",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1281420/",
            "Abstract": "Most legacy systems have been altered due to prolonged maintenance to the point that they deviate significantly from their original and intended design and consequently, they lack modularity. Static source code analysis techniques like concept assignment, formal concept analysis and program slicing, have been successfully used by researchers for program understanding and for restoring system design properties. In our approach we combine these three techniques, aiming to gain on their individual strengths and overcoming their weaknesses. Here we present a program representation formalism that we call the lattice of concept slices and a program modularization technique that aims to separate statements in a code fragment according to the concept they implement or they may belong to. The lattice shows the relationship between the statements of a program and the domain concepts that might be …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Big picture of big data software engineering: with example research challenges",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7165992/",
            "Abstract": "In the rapidly growing field of Big Data, we note that a disproportionately larger amount of effort is being invested in infrastructure development and data analytics in comparison to applications software development -- approximately a 80:20 ratio. This prompted us to create a context model of Big Data Software Engineering (BDSE) containing various elements -- such as development practice, Big Data systems, corporate decision-making, and research -- and their relationships. The model puts into perspective where various types of stakeholders fit in. From the research perspective, we describe example challenges in BDSE, specifically requirements, architectures, and testing and maintenance.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:q3CdL3IzO_QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Static Analysis of Software Systems",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=6649366306502524458&hl=en&oi=scholarr",
            "Abstract": "This research addresses the design and development of an incremental software architecture recovery and evaluation environment using data mining techniques. The environment is interactive and provides: pattern-based architectural recovery using a query language and approximate graph pattern matching; optimization clustering; partitioning; and view-based architectural design evaluation. These techniques have been implemented within my Alborz toolkit.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:LO7wyVUgiFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a requirements-driven framework for detecting malicious behavior against software systems",
            "Publication year": 2011,
            "Publication url": "http://www.softlab.ntua.gr/~kkontog/publications/conferences/C1-2011.pdf",
            "Abstract": "Root cause determination for software failures that occurred due to intentional or unintentional third party activities is a difficult and challenging task. In this paper, we propose a new technique for identifying the root causes of system failures stemming from external interventions that is based first, on modeling the conditions by which a system delivers its functionality utilizing goal models, second on modeling the conditions by which system functionality can be compromised utilizing anti-goal models, third representing logged data as well as, goal and anti-goal models as rules and facts in a knowledge base and fourth, utilizing a probabilistic reasoning technique that is based on the use of Markov Logic Networks. The technique is evaluated in a medium size COTS based system and the DARPA 2000 Intrusion Detection data set.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the syllogistic structure of object-oriented programming",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/919086/",
            "Abstract": "Recent works by J.F. Sowa (2000) and D. Rayside and G.T. Campbell (2000) demonstrate that there is a strong connection between object-oriented programming and the logical formalism of the syllogism, first set down by Aristotle in the Prior Analytics (1928). In this paper, we develop an understanding of polymorphic method invocations in terms of the syllogism, and apply this understanding to the design of a novel editor for object-oriented programs. This editor is able to display a polymorphic call graph, which is a substantially more difficult problem than displaying a non-polymorphic call graph. We also explore the design space of program analyses related to the syllogism, and find that this space includes Unique Name, Class Hierarchy Analysis, Class Hierarchy Slicing, Class Hierarchy Specialization, and Rapid Type Analysis.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Model Driven Evolution of Network-Centric Applications: Perspectives, Challenges, and Issues",
            "Publication year": 2006,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/wse/2006/26960003/12OmNvq5jxd",
            "Abstract": "Model-driven techniques have been proposed and promoted by the Software Engineering community over the past few years as a mechanism for streamlining the design, implementation and evolution of large software applications. The basic idea behind model-driven techniques is that, design artifacts of large software applications can be represented as a collection of models which can be consequently transformed and evolved to generate specific design artifacts and even source code that complies with specific programmatic paradigms and patterns. Even though model-driven frameworks have caught the attention of the software engineering community as a way to increase programmers? productivity and overall system robustness through the disciplined manipulation and transformation of models and ultimately code generation, they have remained so far only in the form of\" guidelines\" or\" standard practices\" …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Soam 2008: 2nd workshop on soa-based systems maintenance and evolution",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4493345/",
            "Abstract": "The main goal of this workshop is to provide an opportunity for participants to present current work and have a lively discussion of open issues for the maintenance and evolution of SOA-based systems. The dialog will include both business issues such as organizational change in the context of migrating to a SOA environment, and technical issues such as analysis of the reuse potential of legacy components in SOA environments. The current version of a SOA research agenda will be used as a starting point for discussion.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "End-to-end E-commerce application development based on XML tools",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/42090394/A00MAR-CD.pdf#page=32",
            "Abstract": "In this paper, we discuss an electronic business application framework and its related architecture. The framework is presented in the form of a prototype system which illustrates how XML tools can assist organizations on building and deploying e-commerce applications. The use of the system is presented in the form of a sample e-commerce application that involves shopping in a virtual store. The framework allows for customers and service providers to be linked through XML/EDI with back-end applications and to trigger e-procurement orders which are sent using either XML or EDI messages. Invoice handling and order tracking are also discussed along with extensions to the proposed architecture that allow for business process logic to be encoded at the server side, in the form of Event Condition Action scripts.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality-driven software re-engineering",
            "Publication year": 2004,
            "Publication url": "https://se.kaist.ac.kr/wp-content/uploads/2013/02/01.Quality-driven-software-re-engineering.pdf",
            "Abstract": "Quality-driven software re-engineering Page 1 Quality-driven software re-engineering Ladan \nTahvildari, Kostas Kontogiannis, and John Mylopoulos The Journal of Systems and Software \n(2003) 2010-05-11 Park Bum Seok KAIST SE LAB 2010 Page 2 Contents ❖Introduction \n❖Background ❖Overall approach ❖Quality-driven re-engineering ❖Case study 2/22 KAIST SE \nLAB 2010 ❖Case study ❖Related work ❖Conclusion & Future work ❖Discussion Page 3 \nIntroduction (1/2) ❖Software re-engineering ▪ Definition • A set of activities intended to restructure \na legacy system to a new target system that confirms Non-FunctionalRequirements (NFR) ▪ \nPurpose • Achievement of software quality requirements and objectives ▪ Process • Trial-and-error \n• Iterative process 3/22 KAIST SE LAB 2010 Quality is not guaranteed Page 4 Introduction \n(2/2) ❖Quality ▪ Definition • Requirements that user requests. • Functional requirements • -(…",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Executive Sciences Institute"
        },
        {
            "Title": "Enterprise integration",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=16028807485528998210&hl=en&oi=scholarr",
            "Abstract": "For several years, the SEI has been conducting architecture evaluations with a variety of companies and DoD organizations, 1 helping them to identify system and software architecture concerns and risks. We have noticed particular problems from an activity referred to as “enterprise integration.” The goal of enterprise integration (EI) is to provide timely and accurate exchange of consistent information between business functions to support strategic and tactical business goals in a manner that appears to be seamless. However, problems often emerge from overly ambitious or imprecise requirements resulting from inadequate plans for integrating different systems (legacy or otherwise). In this column, we describe the challenges associated with EI and provide a road map toward a solution.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:yMeIxYmEMEAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrated system diagnosis and root cause analysis",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1923947.1924029",
            "Abstract": "To support ever-growing numbers of business initiatives and users, companies form diverse software systems into mission-critical enterprise applications whose scale and complexity has caused unprecedented problem determination challenges. As modern systems increase in complexity, due to technologies such as virtualization, service-orientation, mobile computing, and cloud computing, system management has become an increasing concern. Computer system failures at, for example, Google, RIM, Wikipedia, and the TSX have massive, newsworthy effects on users.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:35r97b3x0nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Refactoring web sites to the controller-centric architecture",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1281421/",
            "Abstract": "A Web site is a hyperlinked network environment, which consists of hundreds of interconnected pages, usually without an engineered architecture. This is often a large, complex Web site that is difficult to understand and maintain. Here, we propose an approach that aims to restructure an existing Web site by adapting them to a controller-centric architecture. In particular, this approach is twofold. First, it defines a domain model to represent dependencies between Web pages in order to abstract current structure of the Web site. Second, it designs a system architecture as a reference model for restructuring the Web site to the new structure. These principles will be illustrated through a case study using a reengineering tool that implements the refactoring process for a JSP-based Web site.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "30th International Conference on Software Engineering, ICSE 2008 Co-located Workshops-Proceedings of the 2nd International Workshop on Systems Development in SOA Environments, SDSOA'08: Foreword",
            "Publication year": 2008,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/37806",
            "Abstract": "30th International Conference on Software Engineering, ICSE 2008 Co-located Workshops - \nProceedings of the 2nd International Workshop on Systems Development in SOA Environments, \nSDSOA'08: Foreword Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → \nΔημοσιεύσεις μελών ΔΕΠ→ Εμφάνιση Τεκμηρίου HEAL DSpace 30th International Conference \non Software Engineering, ICSE 2008 Co-located Workshops - Proceedings of the 2nd \nInternational Workshop on Systems Development in SOA Environments, SDSOA'08: Foreword \nΑποθετήριο DSpace/Manakin 30th International Conference on Software Engineering, ICSE \n2008 Co-located Workshops - Proceedings of the 2nd International Workshop on Systems \nDevelopment in SOA Environments, SDSOA'08: Foreword Kontogiannis, K; Litoiu, M; Lewis, \nGA; Smith, DB URI: http://hdl.handle.net/123456789/37806 Ημερομηνία: 2008 Εμφάνιση (…",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:3htObqc8RwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Message from the General and Program Co-Chairs",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1631094/",
            "Abstract": "This year marks an important event, the change of the title of the venue from its former title \"IEEE International Workshop on Program Comprehension\" (IWPC) to its current new title. This change better reflects the caliber and the scope of the venue as it has evolved during the past thirteen years since its first offering in 1992, in Orlando, Florida. As the General and Program Chairs of this year’s venue, we would like to extend our sincere thanks to the Steering Committee members, and to the members of the IEEE Technical Committee on Software Engineering who proposed and approved, respectively, this title change. The new venue will certainly follow the steps of high quality and excellence set by the IWPC community over the years. Program comprehension is a vital software engineering and maintenance activity. It is necessary to facilitate reverse engineering, inspection, reuse, maintenance, and evolution of …",
            "Abstract entirety": 0,
            "Author pub id": "gNZOUUAAAAAJ:UHK10RUVsp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Web-based legacy system migration and integration",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.23.4942&rep=rep1&type=pdf",
            "Abstract": "With the exponential growth of the Internet and the multi-tier distributed system architectures, there is an urgent demand to develop Web-based and component-based applications to reduce the time to the market and to leverage existing software. This paper presents an approach to migrate the existing legacy applications to a Web-enabled Network-Centric environment. The migration process focuses on specifying the identified legacy components in XML, consequently wrapping them by CORBA objects, and finally deploying the distributed component into the application server. A scripting language that is encoded in an XML format can be used for allowing thin clients to communicate with legacy components.",
            "Abstract entirety": 1,
            "Author pub id": "gNZOUUAAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        }
    ]
}]