[{
    "name": "Κωνσταντίνος Μαρκαντωνάκης",
    "romanize name": "Konstantinos Markantonakis",
    "School-Department": "Information Security Group",
    "University": "Royal Holloway, University of London",
    "Rank": " Καθηγητής",
    "Apella_id": 3716,
    "Scholar name": "Konstantinos Markantonakis",
    "Scholar id": "NygekFcAAAAJ",
    "Affiliation": "Professor of Information Security",
    "Citedby": 3134,
    "Interests": [
        "smart card security",
        "embedded system security",
        "IoT",
        "mobile phone security",
        "avionics secuity"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=NygekFcAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Smart card security",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-71078-3_8",
            "Abstract": "In recent years smart cards have become one of the most common secure computing devices. Their uses include such diverse applications such as: providing secure wireless communication framework, banking and identification. Direct threats to smart card security can be invasive (attacks that alter the chip inside the card), analysis of a side channel, induced faults, as well as more traditional forms of attack. This chapter will describe the various attacks that can be applied to smart cards, and the subsequent countermeasures required in software to achieve a secure solution. Invasive attacks are considered beyond the scope of this chapter and can be mitigated with software countermeasures. A case study on the various generations of the European mobile telephone networks is given as an example of how the deployment of countermeasures has changed due to the various attacks described in this chapter.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Information Security Theory and Practices. Smart Cards, Mobile and Ubiquitous Computing Systems: First IFIP TC6/WG 8.8/WG 11.2 International Workshop, WISTP 2007, Heraklion, Crete, Greece, May 9-11, 2007",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=zADZmOCxBNQC&oi=fnd&pg=PP2&dq=info:gL0trBro36UJ:scholar.google.com&ots=FedCQfHKEk&sig=tII91L7ac8wkKKKDhrbUOFEZH80",
            "Abstract": "With the rapid technological development of information technology, computer systems and especially embedded systems are becoming more mobile and ub-uitous. Ensuring the security of these complex and yet resource-constraineds-temshasemergedasoneofthemostpressingchallengesforresearchers. Although there are a number of information security conferences that look at particular aspects of the challenge, we decided to create the Workshop in Information-curity Theory and Practices (WISTP) to consider the problem as a whole. In additiontheworkshopaimsto bringtogetherresearchersandpractitionersin-lated disciplines and encourage interchange and practical co-operation between academia and industry. Although this is the? rst ever WISTP event, the response from researchers wassuperbwithover68paperssubmittedforpotentialinclusionintheworkshop and proceedings. The submissions were reviewed by at least three reviewers, in most cases by four, and for program committee (PC) papers at least? ve reviewers. This long and rigorous process was only possible thanks to the hard work of the PC members and additional reviewers, listed in the following pages. We would like to express our gratitude to the PC members, who were very supportive from the very beginning of this project. Thanks are also due to the additional expert reviewers who helped the PC to select the? nal 20 workshop papers for publication in the proceedings. Of course we highly appreciate the e? orts of all the authors who submitted papers to WISTP 2007. We hope they will contribute again to a future edition and encourage others to do so.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer-Verlag New York Inc"
        },
        {
            "Title": "Select-response grouping proof for RFID tags",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5175970/",
            "Abstract": "In this paper, we investigate a scenario of RFID applications referred to enable a group of RFID tags which have been scanned simultaneously by a reading device, is literally called grouping proof problems. After examining the existing ldquoYoking Proofrdquo protocols of RFID, this paper proposes a protocol called ldquoSelect-Responserdquo Grouping Proof. Instead of waiting the computation result from the tags as previous protocols, the new protocol uses a new mechanism that the reader actively selects the demanded tags to fulfill the verification. With this fundamental change, our protocol neutralizes the threats of denial of service attack, which is suffered by the ldquoYoking Proofrdquo protocols, and provide collision-free and missing tag identification properties, which would offer great help in the practical applications.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Location based application availability",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-05290-3_22",
            "Abstract": "Smart cards are being integrated into a diverse range of industries: ranging from banking, telecom, transport, home/office access control to health and E-passport. Traditionally, cardholders are required to carry a smart card for each application. However, recent developments in the Near Field Communication (NFC) have renewed the interest in multiple applications for different services on a single device. This paper builds onto the NFC initiative and avoids the smart card ownership issues that hinder the adoption of such devices. The proposal integrates the Global Positioning System with the NFC in mobile phones to provide a ubiquitously and flexible service access model.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "User centric security model for tamper-resistant devices",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6104614/",
            "Abstract": "Tamper-resistant devices provide a secure, reliable, and trusted execution environment even in the possession of an adversary. With ever growing use of computing platforms (i.e. mobile phones, tablets and embedded devices, etc.) the potential for compromising the security and privacy of an individual is increased. The Trusted Platform Module is restricted to integrity measurement and cryptographic operations, which is crucial in its own right. On the contrary, smart cards provide a general-purpose execution environment, but traditionally they are under a centralised control, which if extended to the other computing platforms may not be appropriate. Therefore, in this paper we analyse the rationale for a general-purpose cross-platform user centric tamper-resistant device based on the smart card architecture, its applications in different computing environments, along with the ownership management framework.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An exploratory analysis of the security risks of the Internet of Things in finance",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-64483-7_11",
            "Abstract": "The Internet of Things (IoT) is projected to significantly impact consumer finance, through greater customer personalisation, more frictionless payments, and novel pricing schemes. The lack of deployed applications, however, renders it difficult to evaluate potential security risks, which is further complicated by the presence of novel, IoT-specific risks absent in conventional systems. In this work, we present two-part study that uses scenario planning to evaluate emerging risks of IoT in a variety of financial products and services, using ISO/IEC 20005:2008 to assess those risks from related work. Over 1,400 risks were evaluated from a risk assessment with 7 security professionals within the financial industry, which was contrasted with an external survey of 40 professionals within academia and industry. From this, we draw a range of insights to advise future IoT research and decision-making regarding …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:m8MyhXdlT-4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An efficient, secure and trusted channel protocol for avionics wireless networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7777967/",
            "Abstract": "Avionics networks rely on a set of stringent reliability and safety requirements. In existing deployments, most of these networks are based on a wired technology, which supports these requirements. Furthermore, this technology simplifies the security management of the network since certain assumptions can be safely made, including the inability of an attacker to access the network, and the fact that it is almost impossible for an attacker to introduce a node into the network. The proposal for Avionics Wireless Networks (AWNs, currently under consideration by multiple aerospace working groups, promises a reduction in the complexity of electrical wiring harness design and fabrication, a reduction in the total weight of wires, increased customization possibilities, and the capacity to monitor otherwise inaccessible moving or rotating aircraft parts such as landing gear and some sections of the aircraft engines. While …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:SyxJh60XUSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Can you call the software in your device be firmware?",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7809921/",
            "Abstract": "In addition to storing a plethora of code and functionality, devices also possess a certain set of data and commands, known as firmware. The ability of devices to perform specific tasks relies on the firmware. In order to understand the scope of firmware we conducted a qualitative analysis of its properties, functionalities and security. We examined the use of the terminology over a period of years and found that \"firmware\" is used in numerous situations in a range of contexts. In this paper, we propose a taxonomy of firmware to classify the field and understand it better.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:C2yK8tfAHAgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed e-voting using the smart card web server",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6378952/",
            "Abstract": "Voting in elections is the basis of democracy, but citizens may not be able or willing to go to polling stations to vote on election days. Remote e-voting via the Internet provides the convenience of voting on the voter's own computer or mobile device, but Internet voting systems are vulnerable to many common attacks, affecting the integrity of an election. Distributing the processing of votes over many web servers installed in tamper-resistant, secure environments can improve security: this is possible by using the Smart Card Web Server (SCWS) on a mobile phone Subscriber Identity Module (SIM). This paper proposes a generic model for a voting application installed in the SIM/SCWS, which uses standardised Mobile Network Operator (MNO) management procedures to communicate (via HTTPs) with a voting authority to vote. The generic SCWS voting model is then used with the e-voting system Prêt à Voter. A …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Radio Frequency Identification and IoT Security: 12th International Workshop, RFIDSec 2016, Hong Kong, China, November 30–December 2, 2016, Revised Selected Papers",
            "Publication year": 2017,
            "Publication url": "https://scholars.cityu.edu.hk/en/publications/publication(71b7a2e0-2400-47c1-8794-1c879efd835c).html",
            "Abstract": "This book constitutes the thoroughly refereed post-conference proceedings of the 12th International Workshop on Radio Frequency Identification and IoT Security, RFIDSec 2016, held in Hong Kong, China, in November/December 2016.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:SNyOjmPOlygC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "A secure and efficient mutual authentication protocol for low-cost RFID systems",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5066551/",
            "Abstract": "In this work we propose a mutual authentication protocol for RFID (Radio Frequency Identification) systems incorporating low-cost RFID tags. These tags, due to their limited computational capabilities do not incorporate advanced cryptographic primitives. As a result, there are various threats against userspsila privacy and against the security of such systems. Our protocol, PMM, utilizes a hash function and a pseudorandom number generator that can be hardware implemented in a low-cost RFID tag. As we will demonstrate, our protocol offers a high level of security by preventing replay attacks, Denial-of-Service attacks, tracking attacks, tag spoofing and by offering forward security and an enhanced protection of user privacy.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "LIRA-V: Lightweight Remote Attestation for Constrained RISC-V Devices",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2102.08804",
            "Abstract": "This paper presents LIRA-V, a lightweight system for performing remote attestation between constrained devices using the RISC-V architecture. We propose using read-only memory and the RISC-V Physical Memory Protection (PMP) primitive to build a trust anchor for remote attestation and secure channel creation. Moreover, we show how LIRA-V can be used for trusted communication between two devices using mutual attestation. We present the design, implementation and evaluation of LIRA-V using an off-the-shelf RISC-V microcontroller and present performance results to demonstrate its suitability. To our knowledge, we present the first remote attestation mechanism suitable for constrained RISC-V devices, with applications to cyber-physical systems and Internet of Things (IoT) devices.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:SZzxPo9m4nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Practical Attacks on Virtual Worlds",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-17127-2_12",
            "Abstract": "Virtual Worlds (VWs) are immensely popular online environments, where users interact in real-time via digital beings (avatars). However, a number of security issues affect VWs, and they are vulnerable to a range of attacks on their infrastructure and communications channels. Their powerful architecture can also be used to mount attacks against live Real World servers, by using malicious VW objects. Researching these attacks in commercial VWs would not be acceptable, as it would be contrary to the terms of conditions which govern acceptable behaviour in a particular VW. So in this paper, attacks were conducted/analysed in a laboratory-based test bed VW implementation developed specifically for the research, with custom built attack and analysis tools: commercial VWs were used for data gathering only. Results of these experiments are presented, and appropriate countermeasures proposed which …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A mutual authentication enabled fair-exchange and anonymous e-payment protocol",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1640275/",
            "Abstract": "In this paper, a practical electronic-payment (e-payment) protocol is presented for the purchase of digital products over the Internet. The proposed protocol realizes the true fair-exchange through a process of mutual authentication between the customer and the merchant, by which each party ensures that the item (product or payment) he/she is about to receive from the other party is valid and correct, whilst maintaining customer and merchant anonymity",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "May the force be with you: Force-based relay attack detection",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75208-2_9",
            "Abstract": "Relay attacks pose a significant threat against communicating devices that are required to operate within a short-distance from each other and a restricted time frame. In the field of smart cards, distance bounding protocols have been proposed as an effective countermeasure, whereas, in the field of smartphones, many proposals suggest the use of (natural) ambient sensing as an effective alternative. However, empirical evaluation of the proposals carried out in existing literature has reported negative results in using natural ambient sensing in distance- and time-restricted scenarios, like EMV contactless payments that require the proximity to be less than 3 cm and the transaction duration to be under 500 ms. In this paper, we propose a novel approach for Proximity and Relay Attack Detection (PRAD), using bidirectional sensing and comparing button presses and releases behaviour (duration of press and …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:5McdzzY_mmwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Smart card technology in the public transport industry",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=5308970671851278055&hl=en&oi=scholarr",
            "Abstract": "Over the last few years there has been much discussion around the optimal introduction and utilization of smart card technology in the public transport industry. A number of schemes have been proposed worldwide, being followed by a smaller number of live schemes arising mainly in Europe [1] and Asia [2].In this article we provide an overview of the main issues around the current status of smart card technology in the transport industry. We begin our discussion by highlighting the main driving forces behind the use of smart card technology in the transport industry and introducing the major smart card standardization initiatives. This leads into some observations, concluding remarks and ideas for further consideration when balancing security and interoperability, along with the overall advantages and disadvantages of smart card technology in the public transport sector.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A mutual authentication protocol for low-cost rfid tags formally verified using casperfdr and avispa",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6750160/",
            "Abstract": "Although Radio Frequency IDentification (RFID) systems offer many remarkable characteristics, security and privacy concerns are not easy to address. In this paper, we aim to overcome some of the significant privacy and security concerns by proposing a simple and lightweight RFID mutual authentication protocol. Our protocol is utilising hash functions and simple bitwise operations in an attempt to extract the strengths found in previous protocols and avoid their deficiencies. We found that the majority of the proposed protocols fail to resist DoS attacks when the attacker blocks the messages exchanged between the reader and tag more than once. Moreover, recent research focused on the security side and ignored performance. Our proposed protocol aims to solve these issues. We provide an informal analysis along with automated formal analysis using CasperFDR and AVISPA. The results show that the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Return-Oriented Programming on RISC-V",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3320269.3384738",
            "Abstract": "This paper provides the first analysis on the feasibility of Return-Oriented programming (ROP) on RISC-V, a new instruction set architecture targeting embedded systems. We show the existence of a new class of gadgets, using several Linear Code Sequences And Jumps (LCSAJ), undetected by current Galileo-based ROP gadget searching tools. We argue that this class of gadgets is rich enough on RISC-V to mount complex ROP attacks, bypassing traditional mitigation like DEP, ASLR, stack canaries, G-Free and some compiler-based backward-edge CFI, by jumping over any guard inserted by a compiler to protect indirect jump instructions. We provide examples of such gadgets, as well as a proof-of-concept ROP chain, using C code injection to leverage a privilege escalation attack on two standard Linux operating systems. Additionally, we discuss some of the required mitigations to prevent such attacks and …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:0kYikfLtzSYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Mobile Java Card Grid Project",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00406496/",
            "Abstract": "This position paper presents an overview of the Mobile Java Card Grid project that consists in setting up a grid like mobile infrastructure based on SIM cards. It combines the Java Card Grid infrastructure developed at the LaBRI, the SIM experience and tools of the Royal Holloway University of London, and some features of the MADNESS project developed at the XLIM.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fair and Transparent Blockchain Based Tendering Framework-A Step Towards Open Governance",
            "Publication year": 2018,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2018arXiv180505844S/abstract",
            "Abstract": "Society is in constant transition to keep up with technological advancement, we are seeing traditional paradigms being increasingly challenged. The fundamentals of governance are one such paradigm. As society's values have shifted, so have expectations of government shifted from the traditional model to something commonly referred to as' open governance'. Though a disputed term, we take open governance to mean a concept, which encourages and facilitates openness, accountability, and responsiveness to citizens. For the success of open governance initiatives, there are some technologies, such as the internet, that are crucial. These technologies enable access to both the data and to engagement activities between citizens and government. There are also other technologies, like blockchain and smart contacts, which could be utilised to assist open governance. A sound starting point would be moving from …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:LiF7i2gyBHwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure Application Execution in Mobile Devices",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-662-49301-4.pdf#page=419",
            "Abstract": "Smart phones have rapidly become hand-held mobile devices capable of sustaining multiple applications. Some of these applications allow access to services including healthcare, financial, online social networks and are becoming common in the smart phone environment. From a security and privacy point of view, this seismic shift is creating new challenges, as the smart phone environment is becoming a suitable platform for security-and privacy-sensitive applications. The need for a strong security architecture for this environment is becoming paramount, especially from the point of view of Secure Application Execution (SAE). In this chapter, we explore SAE for applications on smart phone platforms, to ensure application execution is as expected by the application provider. Most of the proposed SAE proposals are based on having a secure and trusted embedded chip on the smart phone. Examples include the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:NJ774b8OgUMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Performance of Certificate Revocation Protocols Based on a Java Card Certificate Client Implementation",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=5058074339154280912&hl=en&oi=scholarr",
            "Abstract": "The use of certificates for secure transactions in smart cards requires the existence of a secure and efficient revocation",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Errata to: Secure smart embedded devices, platforms and applications",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-7915-4_26",
            "Abstract": "Errata to: Secure Smart Embedded Devices, Platforms and Applications Page 1 Errata to: \nSecure Smart Embedded Devices, Platforms and Applications Konstantinos Markantonakis \nand Keith Mayes Errata to: K. Markantonakis and K. Mayes (eds.), Secure Smart Embedded \nDevices, Platforms and Applications, DOI 10.1007/978-1-4614-7915-4 Page vii, Foreword, \nParagraph 3 Line 2: RFID NFC should read ‘‘Radio Frequency Identity (RFID), Near Field \nCommunication (NFC)’’ Page x, Preface, Paragraph 2 Line 10: FPGA should read ‘‘Field \nProgrammable Gate Array (FPGA)’’ Page x, Preface, Paragraph 3 Line 16: WSN should \nread ‘‘Wireless Sensor Nodes (WSN)’’ Page xi, Preface, Paragraph 1 Line 11: SCADA \nshould read ‘‘Supervisory Control And Data Acquisition (SCADA)’’ Page xv, \nAcknowledgements, Paragraph 1 Line 8: Naem should read ‘‘Naeem’’ Page xxxviii, \nContributors, Paragraph 4 Line 7: Saarbrcken ‘‘’…",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:geHnlv5EZngC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Smart card platform fingerprinting",
            "Publication year": 2006,
            "Publication url": "http://helper.ipam.ucla.edu/publications/scws4/scws4_6646.pdf",
            "Abstract": "▪ When a batch of USIM cards is ordered the supplier is sent an input file that sets the initial values and customisation parameters for use in the cards▪ The supplier generates a response file that is intended for loading into the Authentication centre▪ It may be sent to the customer in a PGP encrypted file▪ A “trusted employee” will see the information in clear▪ The data should be encrypted in the AuC but this is doubtful▪ If this file is leaked by “trusted employees” or IT managers then widespread cloning is possible regardless of the design/implementation of the normal smart card solution.▪ The file could provide all secret data associated with say 1 million cards-& this is not just the ‘K’values",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure autonomous uavs fleets by using new specific embedded secure elements",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7846999/",
            "Abstract": "Unmanned Aerial Vehicles (UAVs) fleets are becoming more apparent in both military and civilian applications. However security of these systems still remains unsatisfactory if a strong adversary model with a high attack potential (i.e. the adversary has capabilities and knowledge to capture a UAV, to perform side-channel or fault injection or other physical, software or combined attacks in order to gain access to some secret data like cryptographic keys, mission plan, etc.) is considered. The aim of this position paper is to draw security requirements for this kind of adversaries and to propose theoretical solutions based on an embedded Secure Element (SE) that could help to accommodate these requirements. Finally, our proposal on how to use these SEs to secure Autonomous UAVs fleets is presented.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:polMJLZb0X8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Let’s get mobile: Secure FOTA for automotive system",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-25645-0_38",
            "Abstract": "Over-the-air (OTA) firmware update is available in some systems such as mobile networks. Security plays a vital role to ensure that the firmware update process is successful despite possible threats against it. Therefore mobile devices may be useful to support the OTA firmware update process for other devices such as those used for automotive applications. Using a mobile device as a tool can offer added security features as well as giving flexibility to the process. Automotive security is of high importance as it is critically related to the safety and reliability of the vehicle. We propose a secure OTA firmware update (FOTA) protocol to offer flexibility to the firmware update process, while meeting the required security requirements. The protocol was formally analysed using Scyther and CasperFDR and no known attack was found.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:JQOojiI6XY0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Privacy-preserving Group Authentication for RFID Tags Using Bit-Collision Patterns",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9353715/",
            "Abstract": "When authenticating a group of RFID tags, a common method is to authenticate each tag with some challenge-response exchanges. However, sequentially authenticating individual tags one by one might not be desirable, especially when considering that a reader often has to deal with multiple tags within a limited period, since it will incur long scanning time and heavy communication costs. To address these problems, we put forward a novel efficient group authentication protocol where a group of tags can be authenticated simultaneously with only one challenge and one response. The protocol is built on a new designed symmetric key based algorithm and the bit-collision pattern technique, so that authentication responses transmitted by multiple tags in a group at the same time will result in a verifiable bit-collision pattern that represents the authentication response for the entire group. The proposed approach can …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:cAUKuAERoUMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Radio Frequency Identification and IoT Security: 12th International Workshop, RFIDSec 2016, Hong Kong, China, November 30--December 2, 2016, Revised Selected Papers",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=18227163469960125153&hl=en&oi=scholarr",
            "Abstract": "This book constitutes the thoroughly refereed post-conference proceedings of the 12th International Workshop on Radio Frequency Identification and IoT Security, RFIDSec 2016, held in Hong Kong, China, in November/December 2016. The 14 revised full papers were carefully reviewed and selected from 30 submissions and are organized in topical sections on protocols; side channel and hardware; cards and tokens; proximity; and communication.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:HkunuPqSaCsC",
            "Publisher": "Springer"
        },
        {
            "Title": "A secure and trusted channel protocol for uavs fleets",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-93524-9_1",
            "Abstract": "Fleets of UAVs will be deployed in near future in reliability and safety critical applications (e.g. for smart cities). To satisfy the stringent level of criticality, each UAV in the fleet must trust the other UAVs with which it communicates to get assurance of the trustworthiness in information received and to be sure not to disclose information to an unauthorized party. In addition, to be protected against an attacker willing to eavesdrop and/or modify the exchanged data, the communication channel needs to be secured, i.e. it has to provide confidentiality and integrity of exchanges. The work presented here is based on our previous research which concluded that it is required that each UAV includes a Secure Element (which we called ARFSSD standing for Active Radio Frequency Smart Secure Device) to withstand an adversary with a high attack potential. In this paper, we propose a secure and trusted channel …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:6sy8ByAbWgIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A privacy preserving application acquisition protocol",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6295999/",
            "Abstract": "In the smart card industry, the application acquisition process involves the card issuers and application providers. During this process, the respective card issuer reveals the identity of the smart card user to the individual application providers. In certain application scenarios it might be necessary (e.g. banking and identity applications). However, with introduction of the Trusted Service Manager (TSM) architecture there might be valid cases where revealing the card user's identity is not necessary. At the moment, the secure channel protocols for traditional smart card architecture including the TSM does not preserve the privacy of the card users. In this paper, we propose a secure and trusted channel protocol that provide such feature along with satisfying the requirements of an open and dynamic environment referred as User Centric Smart Card Ownership Model (UCOM). A comparison is provided between the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Empirical Evaluation of Ambient Sensors as Proximity Detection Mechanism for Mobile Payments",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1601.07101",
            "Abstract": "Near Field Communication (NFC) has enabled mobile phones to emulate contactless smart cards. Similar to contactless smart cards, they are also susceptible to relay attacks. To counter these, a number of methods have been proposed that rely primarily on ambient sensors as a proximity detection mechanism (also known as an anti-relay mechanism). In this paper, we, for the first time in academic literature, empirically evaluate a comprehensive set of ambient sensors for their effectiveness as a proximity detection mechanism. We selected 15 out of a total of 17 sensors available via the Google Android platform for evaluation, with the other two sensors unavailable on widely-used handsets. In existing academic literature, only 5 sensors have been proposed with positive results as a potential proximity detection mechanism. Each sensor, where feasible, was used to record the measurements of 1000 contactless transactions at four different physical locations. A total of 252 random users, random sample of the university student population, were involved during the field trails. The analysis of these transactions provides an empirical foundation to categorically answer whether ambient sensors provide a strong proximity detection mechanism for security sensitive applications like banking, transport and high-security access control. After careful analysis, we conclude that no single evaluated mobile ambient sensor is suitable for such critical applications in realistic deployment scenarios. Lastly, we identify a number of potential avenues that may improve their effectiveness.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimistic Fair-Exchange with Anonymity for Bitcoin Users",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=8125403480466335728&hl=en&oi=scholarr",
            "Abstract": "Fair-exchange and anonymity are two important attributes in e-commerce. It is much more difficult to expect fair- ness in e-commerce transactions using Bitcoin due to anonymity and transaction irreversibility. Genuine consumers and merchants who would like to make and receive payments using Bitcoin may be reluctant to do so due to this uncertainty. The proposed proto- col guarantees strong-fairness while preserving anonymity of the consumer and the merchant, using Bitcoin as a payment method which addresses the aforementioned concern. The involvement of the trusted third party (T T P ) is kept to a minimum, which makes the protocol optimistic and the exchanged product is not revealed to T T P . It achieves dispute resolution within the protocol run without any intervention of an external judge. Finally we show how the protocol can be easily adapted to use other digital cash systems designed using public …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A face centered cubic key agreement mechanism for mobile ad hoc networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03819-8_11",
            "Abstract": "Mobile ad hoc networking is an operating mode for rapid mobile node networking. Each node relies on adjacent nodes in order to achieve and maintain connectivity and functionality. Security is considered among the main issues for the successful deployment of mobile ad hoc networks (MANETs). In this paper we introduce a weak to strong authentication mechanism associated with a multiparty contributory key establishment method. The latter is designed for MANETs with dynamic changing topologies, due to continuous flow of incoming and departing nodes. We introduce a new cube algorithm based on the face-centered cubic (FCC) structure. The proposed architecture employs elliptic curve cryptography, which is considered more efficient for thin clients where processing power and energy consumption are significant constraints.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Leaky controller: cross-VM memory controller covert channel on multi-core systems",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-58201-2_1",
            "Abstract": "Data confidentiality is put at risk on cloud platforms where multiple tenants share the underlying hardware. As multiple workloads are executed concurrently, conflicts in memory resource occur, resulting in observable timing variations during execution. Malicious tenants can intentionally manipulate the hardware platform to devise a covert channel, enabling them to steal the data of co-residing tenants. This paper presents two new microarchitectural covert channel attacks using the memory controller. The first attack allows a privileged adversary (i.e. process) to leak information in a native environment. The second attack is an extension to cross-VM scenarios for unprivileged adversaries. This work is the first instance of leakage channel based on the memory controller. As opposed to previous denial-of-service attacks, we manage to modulate the load on the channel scheduler with accuracy. Both attacks are …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:54SpJiyHbzwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Card-present transactions on the internet using the smart card web server",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6680893/",
            "Abstract": "Purchasing over the Internet is not limited to traditional computers, and nowadays a person is able to shop from her mobile equipment. However, identity theft and credit/debit card fraud deter some potential customers, or limit their activity. Customers' privacy is threatened in several ways, including malware that directly targets their computers/mobile equipment and from attacks that target merchant infrastructure and databases. In this paper we propose a new way for a user to pay for goods ordered online, which is based on the use of a Smart Card Web Server (SCWS), hosted either on a phone Subscriber Identity Module (SIM) or in a traditional credit/debit card. It would mean that a customer never submits card details via the Internet and is only required to remember a PIN, and for merchants the responsibility to store/protect customer card details is avoided. Overall the privacy for customer data is enhanced by this …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "J, N, B. Mayes, K. and Markantonakis, K., The Secure M-Payment System Based on the Mobile Phone Platform",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=7130884469636662913&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "E-voting with blockchain: An e-voting protocol with decentralisation and voter privacy",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8726645/",
            "Abstract": "Technology has positive impacts on many aspects of our social life. Designing a 24 hour globally connected architecture enables ease of access to a variety of resources and services. Furthermore, technology like the Internet has been a fertile ground for innovation and creativity. One such disruptive innovation is blockchain - a keystone of cryptocurrencies. The blockchain technology is presented as a game changer for many of the existing and emerging technologies/services. With its immutability property and decentralised architecture, it is taking centre stage in many services as an equalisation factor to the current parity between consumers and large corporations/governments. One potential application of the blockchain is in e-voting schemes. The objective of such a scheme would be to provide a decentralised architecture to run and support a voting scheme that is open, fair, and independently verifiable. In this …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:9UF2BbDYXHIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reprint of “You can’t touch this: Consumer-centric android application repackaging detection”",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X17325451",
            "Abstract": "Application repackaging is a widely used method for malware distribution, revenue stealing and piracy. Repackaged applications are modified versions of original applications, that can potentially target large audiences based on the original application’s popularity. In this paper, we propose an approach for detecting repackaged applications. Our approach takes advantage of the attacker’s reluctance to significantly alter the elements that characterise an application without notably impacting the application’s distribution. These elements include the application’s name and icon. The detection is initiated from the client side, prior to an application’s installation, making it application store agnostic. Our experimental results show that detection based on our algorithm is effective and efficient.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:5uu-MYFt2EcC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Empirical Evaluation of Ambient Sensors as Proximity Detection Mechanism for Mobile Payments",
            "Publication year": 2016,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2016arXiv160107101N/abstract",
            "Abstract": "Near Field Communication (NFC) has enabled mobile phones to emulate contactless smart cards. Similar to contactless smart cards, they are also susceptible to relay attacks. To counter these, a number of methods have been proposed that rely primarily on ambient sensors as a proximity detection mechanism (also known as an anti-relay mechanism). In this paper, we, for the first time in academic literature, empirically evaluate a comprehensive set of ambient sensors for their effectiveness as a proximity detection mechanism. We selected 15 out of a total of 17 sensors available via the Google Android platform for evaluation, with the other two sensors unavailable on widely-used handsets. In existing academic literature, only 5 sensors have been proposed with positive results as a potential proximity detection mechanism. Each sensor, where feasible, was used to record the measurements of 1000 contactless …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:LYDvBi7O6RsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information Security Theory and Practices: Security and Privacy of Pervasive Systems and Smart Devices",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=9671482627339333945&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer-Verlag Berlin Heidelberg"
        },
        {
            "Title": "Inhibiting card sharing attacks",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11908739_17",
            "Abstract": "The satellite TV industry relies heavily on the use of smart card technology at the very heart of broadcasted services that are protected by legacy conditional access systems. The process of Satellite TV signal protection is distributed amongst a number of system components, e.g. smart cards, receivers, Conditional Access Modules (CAM) and the content provider. However, the introduction of “Open” Satellite Receivers, providing a highly configurable environment with software emulation of conditional access systems, enabled the implementation of whole range of new attacks. A widely deployed attack is often referred to as the “card sharing” attack, by which one legitimate user colludes to provide protected content to a larger group of unauthorised users. This paper proposes a countermeasure that increases the bandwidth requirements of this attack to the point where it is no longer practical with a standard …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Firewall mechanism in a user centric smart card ownership model",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12510-2_9",
            "Abstract": "Multi-application smart card technology facilitates applications to securely share their data and functionality. The security enforcement and assurance in application sharing is provided by the smart card firewall. The firewall mechanism is well defined and studied in the Issuer Centric Smart Card Ownership Model (ICOM), in which a smart card is under total control of its issuer. However, it is not analysed in the User Centric Smart Card Ownership Model (UCOM) that delegates the smart card control to their users. In this paper, we present UCOM’s security requirements for the firewall mechanism and propose a generic framework that satisfies them.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Security and performance comparison of different secure channel protocols for Avionics Wireless Networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7777966/",
            "Abstract": "The notion of Integrated Modular Avionics (IMA) refers to inter-connected pieces of avionics equipment supported by a wired technology, with stringent reliability and safety requirements. If the inter-connecting wires are physically secured so that a malicious user cannot access them directly, then this enforces (at least partially) the security of the network. However, substituting the wired network with a wireless network - which in this context is referred to as an Avionics Wireless Network (AWN) - brings a number of new challenges related to assurance, reliability, and security. The AWN thus has to ensure that it provides at least the required security and safety levels offered by the equivalent wired network. Providing a wired-equivalent security for a communication channel requires the setting up of a strong, secure (encrypted) channel between the entities that are connected to the AWN. In this paper, we propose three …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:DGpvO1n63MYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Trusted platform module for smart cards",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6814058/",
            "Abstract": "Near Field Communication (NFC)-based mobile phone services offer a lifeline to the under-appreciated multiapplication smart card initiative. The initiative could effectively replace heavy wallets full of smart cards for mundane tasks. However, the issue of the deployment model still lingers on. Possible approaches include, but are not restricted to, the User Centric Smart card Ownership Model (UCOM), GlobalPlatform Consumer Centric Model, and Trusted Service Manager (TSM). In addition, multiapplication smart card architecture can be a GlobalPlatform Trusted Execution Environment (TEE) and/or User Centric Tamper-Resistant Device (UCTD), which provide cross-device security and privacy preservation platforms to their users. In the multiapplication smart card environment, there might not be a prior off-card trusted relationship between a smart card and an application provider. Therefore, as a possible solution …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A set of efficient privacy protection enforcing lightweight authentication protocols for low-cost rfid tags",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7345334/",
            "Abstract": "Providing security and privacy protection in Radio Frequency IDentification (RFID) tags is a challenging task due to their highly constrained resources. Because tags cannot support strong cryptography, security must rely on low-computational solutions. Privacy protection is often an additional requirement for acceptance of the technology by end-users. Thus, dedicated lightweight algorithms and protocols need to be designed. In this paper, we propose a set of extremely lightweight (optionally mutual) authentication protocols between a tag and a database (sharing a secret value) which protect the identity of the tag. However, if, for some practical reasons, the identity of the tag needs to be revealed to the reader, an additional optional last step can be added at the end of our protocols to satisfy this requirement. Our proposals are inspired by a protocol of Chien et al. but they are more efficient, since they operate in O(1 …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:uLbwQdceFCQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Provisioning software with hardware-software binding",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3098954.3103158",
            "Abstract": "Smart cities are a concept of interest to many industrial, academic and government organisations. However, smart cities present a large attack surface to adversaries if every traffic light, power relay and water pipe are connected to the internet. This paper describes the problem of distributing software in a smart city when strong protection of device software, software installation and update provision are required. A set of requirements for a secure software provisioning system is presented and two models for the software distribution are proposed. Three protocols for distributing software are presented that meet the requirements stated. A formal analysis using Tamarin Prover is described that proves the security of the proposed protocols. Finally, an implementation has been developed using a laptop and Raspberry Pi 3 to demonstrate the proposed protocols in action and the performance of them.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:b8wqy9DyMDUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tokenisation Blacklisting Using Linkable Group Signatures",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=14965163809527591181&hl=en&oi=scholarr",
            "Abstract": "Payment cards make use of a Primary Account Number (PAN) that is normally used by merchants to uniquely identify users, and if necessary to deny users service by blacklisting. However, tokenisation is a technique whereby the PAN is replaced by a temporary equivalent, for use in mobile devices that emulate payment cards, but with reduced attack resistance. This paper outlines how tokenised payments contradict the process of blacklisting in open transport systems. We propose the use of a linkable group signature to link different transactions by a user regardless of the variable token. This allows the transport operator to check if a user’s signature is linked to a previous dishonest transaction in the blacklist, while still maintaining the anonymity of the user.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:pxLfhFzThFYC",
            "Publisher": "Springer"
        },
        {
            "Title": "IY2530 (Team Project in Security Computing)—Project Brief Secure SMS",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.169.2616&rep=rep1&type=pdf",
            "Abstract": "You have been working for a consultancy company secureitall. com that specialises in the development of applications for mobile phones, PDAs and tokens (eg smart cards, USB tokens, etc). The company is relatively well known in its field and recognised for delivering high quality projects, always within the specified timeframes and at very competitive prices. In particular, it is well respected for its thorough development and testing processes and equally important for its information security skills and expertise.The company’s managing director has been approached by a major technology investment company (hereafter referred to as the “client”) for the development of a new application that can be used in mobile devices in order to encrypt Short-Messaging-Service (SMS) and Multi-Media-Service (MMS) messages. Naturally decryption for encrypted messages should also be provided. This could have a variety of uses, including, but not limited to:",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building the Bridges--A Proposal for Merging Different Paradigms in Mobile NFC Ecosystem",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6405919/",
            "Abstract": "In late 1990s. the multi-application initiative was put forward to have multiple applications on a single smart card. This would have enabled a cardholder to accumulate all of her smart card based applications (e.g. banking, telecom, and transport etc.) on a single device. However, despite the initial fervour for the multi-application smart card initiative, there were no wide spread adoption of this model. Nevertheless, the Near Field Communication (NFC) has reinvigorated the multi-application initiative again. In this paper, we will analyse why the multi-application smart card initiative failed to materialise a decade ago and whether this time around it will succeed as a viable model or not. The NFC trials being conducted basically rely on the existing ownership architectures, which can create market segregation and thus reducing the potential revenue generation capability. We propose a possible approach that avoids …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A vulnerability in the song authentication protocol for low-cost rfid tags",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39218-4_8",
            "Abstract": "In this paper, we describe a vulnerability against one of the most efficient authentication protocols for low-cost RFID tags proposed by Song. The protocol defines a weak attacker as an intruder which can manipulate the communication between a reader and tag without accessing the internal data of a tag. It has been claimed that the Song protocol is able to resist weak attacks, such as denial of service (DoS) attack; however, we found that a weak attacker is able to desynchronise a tag, which is one kind of DoS attack. Moreover, the database in the Song protocol must use a brute force search to retrieve the tag’s records affecting the operational performance of the server. Finally, we propose an improved protocol which can prevent the security problems in Song protocol and enhance the server’s scalability performance.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:dshw04ExmUIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An Asymmetric Cryptography Secure Channel Protocol for Smart Cards",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/1-4020-8143-X_23",
            "Abstract": "Smart card secure channel protocols based on public key cryptography are not widely utilised mainly due to processing overheads introduced in the underlying smart card microprocessors and the complexities introduced by the operation of a PKI infrastructure. In this paper we analyse the significance of public key secure channel protocols in multi application smart cards. We believe that multi application smart card technology (e.g. the GlobalPlatform smart card specification) should benefit more from the advantages of public key cryptography specifically for the initiation and maintenance of a secure channel. This paper introduces a public key based cryptographic protocol for secure entity authentication, data integrity and data confidentiality. The proposed secure channel protocol uses a combination of public key, secret key and the main idea behind the Diffie-Hellmann key establishment protocols in order …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "P2PEdge: A Decentralised, Scalable P2P Architecture for Energy Trading in Real-Time",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/973476",
            "Abstract": "Current Peer-to-Peer (P2P) energy market models raise serious concerns regarding the confidentiality and integrity of energy consumption, trading and billing data. While Distributed Ledger Technology (DLT) systems (eg, blockchain) have been proposed to enhance security, an attacker could damage other parts of the model, such as its infrastructure: an adversarial attacker could target the communication between entities by, eg, eavesdropping or modifying data. The main goal of this paper is to propose a model for a decentralised P2P marketplace for trading energy, which addresses the problem of developing security and privacy-aware environments. Additionally, a Multi-Agent System (MAS) architecture is presented with a focus on security and sustainability. In order to propose a solution to DLT’s scalability issues (ie, through transaction confirmation delays), off-chain state channels are considered for the energy negotiation and resolution processes. Additionally, a STRIDE (spoofing, tampering, repudiation, information disclosure, denial of service, elevation of privilege) security analysis is conducted within the context of the proposed model to identify potential vulnerabilities.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:Qs68GpkTGbMC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "The B-side of side channel leakage: Control flow security in embedded systems",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-04283-1_18",
            "Abstract": "The security of an embedded system is often compromised when a “trusted” program is subverted to behave differently. Such as executing maliciously crafted code and/or skipping legitimate parts of a “trusted” program. Several countermeasures have been proposed in the literature to counteract these behavioural changes of a program. A common underlying theme in most of them is to define security policies at the lower level of the system in an independent manner and then check for security violations either statically or dynamically at runtime. In this paper we propose a novel method that verifies a program’s behaviour, such as the control flow, by using the device’s side channel leakage.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "One covert channel to rule them all: A practical approach to data exfiltration in the cloud",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9343152/",
            "Abstract": "The sharing of hardware platforms in multi-tenant environments is a growing security concern. Microarchitectural timing-based covert channels allow tunneling information out of a compromised cloud instance, thus bypassing information flow policies. Significant research efforts have been carried out in order to address the super-set of timing channels. Nevertheless, new attacks keep on being published while disregarding the latest academic efforts, arguing that the relevant defences have not yet been deployed. In order to bridge the gap between vulnerabilities and countermeasures, we challenge state-of-the-art mitigation techniques by constructing the first cross-VM covert channel that is resilient against all known defences, whether they are already deployed or still theoretical. Defence strategies that are relevant with covert channels are surveyed, and a list of requirements is constructed for the new attack. Then …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:yRRszJvrVdAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fair and transparent blockchain based tendering framework-a step towards open governance",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8456054/",
            "Abstract": "At a time when society is in constant transition to keep up with technological advancement, we are seeing traditional paradigms being increasingly challenged. The fundamentals of governance are one such paradigm. As society's values have shifted, so have expectations of government shifted from the traditional model to something commonly referred to as `open governance'. Though a disputed term, we take open governance to mean a concept, which encourages and facilitates openness, accountability, and responsiveness to citizens. For the success of open governance initiatives, there are some technologies, such as the internet, that are crucial. These technologies enable access to both the data and to engagement activities between citizens and government. There are also other technologies, like blockchain and smart contacts, which could be utilised to assist open governance. A sound starting point would …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:fHS53ZCY-AEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tokenisation blacklisting using linkable group signatures",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-59608-2_10",
            "Abstract": "Payment cards make use of a Primary Account Number (PAN) that is normally used by merchants to uniquely identify users, and if necessary to deny users service by blacklisting. However, tokenisation is a technique whereby the PAN is replaced by a temporary equivalent, for use in mobile devices that emulate payment cards, but with reduced attack resistance. This paper outlines how tokenised payments contradict the process of blacklisting in open transport systems. We propose the use of a linkable group signature to link different transactions by a user regardless of the variable token. This allows the transport operator to check if a user’s signature is linked to a previous dishonest transaction in the blacklist, while still maintaining the anonymity of the user.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:MbTKqoTs-1EC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Information Security Theory and Practices. Security and Privacy of Pervasive Systems and Smart Devices. International Workshop, WISTP 2010, Passau, Germany",
            "Publication year": 2010,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00587239/",
            "Abstract": "Archive ouverte HAL - Information Security Theory and Practices. Security and Privacy of \nPervasive Systems and Smart Devices. International Workshop, WISTP 2010, Passau, Germany \nAccéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD \nHAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation \nEpisciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil \nDépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de \npublication Par structure de recherche Les portails de l'archive Recherche Documentation \nhal-00587239, version 1 Ouvrage (y compris édition critique et traduction) Information Security \nTheory and Practices. Security and Privacy of Pervasive Systems and Smart Devices. \nInternational Workshop, WISTP 2010, Passau, Germany P. Samarati MJ Tunstall J. Posegga K. (…",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer"
        },
        {
            "Title": "Secure remote credential management with mutual attestation for constrained sensing platforms with tees",
            "Publication year": 2018,
            "Publication url": "https://deepai.org/publication/secure-remote-credential-management-with-mutual-attestation-for-constrained-sensing-platforms-with-tees",
            "Abstract": "Trusted Execution Environments (TEEs) are rapidly emerging as the go-to root of trust for protecting sensitive applications and data using hardware-backed isolated worlds of execution--surpassing related initiatives, such as Secure Elements, for constrained devices. TEEs are envisaged to provide sensitive IoT deployments with robust assurances regarding critical algorithm execution, tamper-resistant credential storage, and platform integrity via remote attestation. However, the challenge of remotely managing credentials between TEEs remains largely unaddressed in existing literature. Here, credentials must remain protected against untrusted system elements and transmitted over a secure channel with bi-directional trust assurances of their authenticity and operating states. In this paper, we present novel protocols for four key areas of remote TEE credential management using mutual attestation: backups, updates, migration, and revocation. The proposed protocols are agnostic to the TEE implementation and network architecture, developed in line with the requirements and threat model of IoT TEEs, and subjected to formal symbolic verification using Scyther, which found no attacks.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:o4Qvs5Y5TLQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance variation in host-based card emulation compared to a hardware security element",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7072872/",
            "Abstract": "Traditionally, card emulation mode in Near Field Communication devices makes use of a hardware Secure Element (SE) as a secure storage and execution environment for applications. However, a different way of card emulation that bypasses the SE has emerged, referred to as Host-based Card Emulation (HCE). HCE relies on the phone CPU for processing power, sharing it with other running processes. This produces variable readings in terms of response times from the phone. This paper investigates this variability in HCE implementation as compared to an SE implementation. We also discuss how our findings may call into question the use of HCE in time critical scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:SdhP9T11ey4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The mobile Java card grid project",
            "Publication year": 2006,
            "Publication url": "http://damien.sauveron.fr/fileadmin/damiensauveron/publications/MobileJavaCardGridPoster.pdf",
            "Abstract": "This project consists in setting up a grid-like mobile infrastructure based on SIM cards. It combines the Java Card Grid infrastructure developed at the LaBRI, the SIM experience and tools of the Royal Holloway University of London, and some features of the MADNESS project developed at the XLIM.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Feature Interaction Problems in Smart Cards with Dynamic Application Lifecycle and Their Countermeasures",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7345318/",
            "Abstract": "Smart cards, in their traditional deployment architecture referred to as the Issuer Centric Smart Card Ownership Model (ICOM), have a restricted application lifecycle. In this model, an application is installed onto a smart card by the relevant card issuer. In most cases, the card issuer is also the centralised controlling authority for different lifecycle stages of the application. The installed application might not be deleted for the whole duration of the smart card's operation. The interaction of the application is controlled and closely monitored by the card issuer. ICOM-based smart cards have only one application, in the majority of deployments. Therefore, the likelihood of Feature Interaction Problems (FIPs) is minimal. By contrast, in open and dynamic smart card models like the GlobalPlatform Consumer-Centric Model (GP-CCM), and the User Centric Smart Card Ownership Model (UCOM) the probability of FIPs is …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:dQ2og3OwTAUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Artificial ambient environments for proximity critical applications",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3098954.3098964",
            "Abstract": "In the field of smartphones a number of proposals suggest that sensing the ambient environment can act as an effective anti-relay mechanism. However, existing literature is not compliant with industry standards (eg EMV and ITSO) that require transactions to complete within a certain time-frame (eg 500ms in the case of EMV contactless payments). In previous work the generation of an artificial ambient environment (AAE), and especially the use of infrared light as an AAE actuator was shown to have high success rate in relay attacks detection. In this paper we investigate the application of infrared as a relay attack detection technique in various scenarios, namely, contactless transactions (mobile payments, transportation ticketing, and physical access control), and continuous Two-Factor Authentication. Operating requirements and architectures are proposed for each scenario, while taking into account industry …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:cocyvO7vrcwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simulator problem in user centric smart card ownership model",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5703595/",
            "Abstract": "The Issuer Centric Smart Card Ownership Model (ICOM) gives complete control of smart cards to their respective card issuers, enabling them to install, modify or delete applications remotely, in a secure manner. However, the User Centric Smart Card Ownership Model (UCOM) delegates the ownership of smart cards to their users, entitling them to install or delete any application according to their requirements. In the UCOM there might be no off-card relationship between a smart card and an application provider, referred to as a Service Provider, which is the cornerstone of the ICOM security framework. Therefore, this creates unique security issues like the simulator problem, in which a malicious user may simulate the smart card environment on a computing device and requests installation of an application. Following this, it might be possible to retrieve sensitive application data by reverse engineering. In this paper …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Subscriber centric conditional access system for pay-tv systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6686303/",
            "Abstract": "A pay-TV system is a digital broadcasting system, where content providers charge subscribers a subscription fee. Such a system is a combination of a Conditional Access System (CAS), a smart card and a Set-Top-Box (STB). The current Pay-TV system business model follows a circle of dependency, wherein the service provider, the CAS vendor and the STB manufacturer have to work in a restricted vertical market. Furthermore, the unilateral communication channel between the transmitting and receiving ends makes distinguishing compromised cards (keys) and identifying the corresponding subscribers difficult. Additionally, the subscribers are compelled to be bound into using one specific STB pre-determined by the service provider, as such they can not access their entitlements via arbitrary STBs or receive content from other service providers. In this paper, we briefly analyse the existing CAS, the advantages and …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Two rounds RFID grouping-proof protocol",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7488022/",
            "Abstract": "In this paper, we focus on a particular RFID application called a grouping-proof, where an entity such as an RFID reader generates a proof that two or more tags have been scanned simultaneously. This proof is then verified by the server, which processes the tags' data in the system. However, designing a grouping-proof protocol is challenging for two reasons. Firstly, in some cases, the server that authenticates the tags is offline during the scanning process, thus the tags' data need to be assembled in a valid grouping-proof to be authenticated later. Secondly, a number of recent grouping-proof protocols are either prone to attacks, or they are not efficient in terms of performance. In this paper, we present an offline two rounds grouping-proof protocol that provides immunity against well-known attacks on RFID protocols and improves tag's memory and computing performance. We analysed our protocol using a …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:ZppSRAJs3i8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A New Approach to Complex Dynamic Geofencing for Unmanned Aerial Vehicles",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.09453",
            "Abstract": "The anticipated widespread use of unmanned aerial vehicles (UAVs) raises significant safety and security concerns, including trespassing in restricted areas, colliding with other UAVs, and disrupting high-traffic airspaces. To mitigate these risks, geofences have been proposed as one line of defence, which limit UAVs from flying into the perimeters of other UAVs and restricted locations. In this paper, we address the concern that existing geometric geofencing algorithms lack accuracy during the calculation of complex geofences, particularly in dynamic urban environments. We propose a new algorithm based on alpha shapes and Voronoi diagrams, which we integrate into an on-drone framework using an open-source mapping database from OpenStreetMap. To demonstrate its efficacy, we present performance results using Microsoft's AirSim and a low-cost commercial UAV platform in a real-world urban environment.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:yqZeyBDMhiUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information Security Theory and Practice. Smart Devices, Pervasive Systems, and Ubiquitous Networks: Third IFIP WG 11.2 International Workshop, WISTP 2009 Brussels, Belgium, September 1-4, 2009 Proceedings Proceedings",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=g1lsCQAAQBAJ&oi=fnd&pg=PR2&dq=info:nDnqdV0E8QgJ:scholar.google.com&ots=XPIKjj3fly&sig=AnjgU146lM8RmjhqGEV3BH26ONM",
            "Abstract": "This volume contains the 12 papers presented at the WISTP 2009 conference, held in Brussels, Belgium in September 2009. WISTP 2009 was the third int-national workshop devoted to information security theory and practice. WISTP 2009 built on the successful WISTP 2007 and 2008 conferences, held in Heraklion, Crete, Greece and Seville, Spain in May 2007 and May 2008,-spectively. The proceedings of WISTP 2007 and WISTP 2008 were published as volumes 4462 and 5019 of the Lecture Notes in Computer Science series. This workshop received the following support:–Co-sponsored by IFIP WG 11. 2 Small System Security–Co-sponsored by VDE ITG–Technical sponsorship of the IEEE Systems, Man & Cybernetics Society–Supported by the Technical Committee on Systems Safety and Security–Organized in cooperation with the ACM SIGSAC–Supported by ENISA–Supported by the Institute for Systems and Technologies of Information, Control and Communication (INSTICC) These proceedings contain 12 original papers covering a range of theoretical and practical topics in information security. For the purposes of the organi-tion of the WISTP program, the papers were divided into four main categories, namely:–Mobility–Attacks and Secure Implementations–Performance and Security–Cryptography The12papersincludedherewereselectedfromatotalof27submissions. The refereeing process was rigorous, involving at least three (and mostly four or? ve) independent reports being prepared for each submission.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer-Verlag New York Inc"
        },
        {
            "Title": "An overview of the GlobalPlatform smart card specification",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1363412703001031",
            "Abstract": "Over the last five years smart card technology has changed considerably, both at the hardware and software level. More powerful microprocessors along with secure multi-application smart card operating systems provided the necessary functionality required by a large number of smart card applications. GlobalPlatform is considered among the leading multi-application smart card propositions that make an attempt to meet the requirements, for post issuance, issuer control, and interoperability. This article provides an overview of the GlobalPlatform card specification with an emphasis on its security functionality.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Application-binding protocol in the user centric smart card ownership model",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-22497-3_14",
            "Abstract": "The control of the application choice is delegated to the smart card users in the User Centric Smart Card Ownership Model (UCOM). There is no centralised authority that controls the card environment, and it is difficult to have implicit trust on applications installed on a smart card. The application sharing mechanism in smart cards facilitates corroborative and interrelated applications to co-exist and augment each other’s functionality. The already established application sharing mechanisms (e.g. in Java Card and Multos) do not fully satisfy the security requirements of the UCOM that require a security framework that provides runtime authentication, and verification of an application. Such a framework is the focus of this paper. To support the framework, we propose a protocol that is verified using CasperFDR. In addition, we implemented the protocol and provide a performance comparison with existing protocols.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Recovering from a lost digital wallet",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6832109/",
            "Abstract": "Multi-application smart cards enable a user to have multiple applications on her smart card. The growing trend of services convergence fuelled by the Near Field Communication and smartphones has made multi-application smart cards a tangible reality. In such an environment, cardholders might have number of applications on their smart cards and in case they lose the smart card, they would lose all of the applications. Currently, the recovery of a smart card based service might take from a day to a week at best, during which time the service provider might lose on business from the user because she is not able to access the respective services. The proposed framework in this paper enables a user to acquire a new smart card as she desires and then migrate/restore all of her applications onto it - facilitating her to recover from her lost digital wallet in a secure, efficient, seamless and ubiquitous manner.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comparison of dynamic biometrie security characteristics against other biometrics",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7996938/",
            "Abstract": "Biometrie data can be used as “something you are” in authentication systems, but if a biometrie is compromised by a malicious entity, the genuine user can no longer use it because it cannot be easily changed. Dynamic biometrics may offer a practical alternative, as they capture both an inherence factor along with a changeable knowledge factor in a single step. This paper investigates dynamic biometrics and whether they offer useful security authentication properties compared to conventional biometrics. In particular the paper focuses on one type of dynamic biometry, authentication based on Gesture Recognition, and presents a proof of concept experiment. Security characteristics of examples from three classes of dynamic biometrics are compared to a selection of common physiological (“fixed”) biometrics, leading to the conclusion that in addition to providing one-step, two factor authentication, dynamic biometry …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:5-bGDoUgDrYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A certificateless group authenticated key agreement protocol for secure communication in untrusted UAV networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8569730/",
            "Abstract": "Smart cities are increasingly relying on information and communication technologies to cope with today's challenges, including increasing population, heterogeneous economic growth, and environmental legislation hardening. The use of Unmanned Aerial Vehicles (UAVs) generates a growing interest in coping with such challenges, along with new business opportunities. As a result, it is expected to see the number of drone-based applications to rise at a very fast pace, entailing new cybersecurity risks to emerge. In this paper, we propose to tackle the problem of secure communication among untrusting parties with a certificateless-group authenticated key agreement (CL-GAKA) scheme. The intent is to enable confidentiality, message integrity, and authenticity in UAV-to-UAV communication. Provisioning untrusted UAV networks with trusted communication will provide ground for further research and applications …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:96M4k3P_OWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Study on Microarchitectural Covert Channel Vulnerabilities in Infrastructure-as-a-Service",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-61638-0_20",
            "Abstract": "Microarchitectural cross-VM covert channels are software-launched attacks which exploit multi-tenant environments’ shared hardware. They enable transmitting information from a compromised system when the information flow policy does not allow to do so. These attacks represent a threat to the confidentiality and integrity of data processed and stored on cloud platforms. Although potentially severe, covert channels tend to be overlooked due to an allegedly strong adversary model. The literature focuses on mechanisms for encoding information through timing variations, without addressing practical considerations. Furthermore, the field lacks a realistic evaluation framework. Covert channels are usually compared to each other using the channel capacity. While a valuable performance metric, the capacity is inadequate to assess the severity of an attack. In this paper, we conduct a comprehensive study on the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:3ssty3PwuTgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Coopetitive architecture to support a dynamic and scalable NFC based mobile services architecture",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34129-8_19",
            "Abstract": "Near Field Communication (NFC) has reinvigorated the multi-application smart card initiative. The NFC trials are relying on an extension of Issuer Centric Smart Card Model (ICOM) referred as Trusted Service Manager (TSM) architecture, which may create market segregation. Where the User Centric Smart Card Ownership Model (UCOM) takes an opposite approach of delegating the smart card ownership to its users. Therefore, to reconcile these two approaches we proposed the Coopetitive Architecture for Smart Cards (CASC) that avoids market segregation, increase revenue generation, and provide flexibility, robustness, and scalability. To support the CASC framework in this paper, we propose an application installation protocol that provides entity authentication, trust assurance and validation, mutual key and contractual-agreement generation. The protocol is compared with existing protocols on its …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:D03iK_w7-QYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards trusted execution of multi-modal continuous authentication schemes",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3019612.3019652",
            "Abstract": "The emergence of powerful, sensor-rich devices has led to the development of continuous authentication (CA) schemes using off-the-shelf hardware, where user behaviour is compared to past experience to produce an authentication decision with the aim of addressing challenges with traditional authentication schemes. Current CA proposals, however, have largely neglected adversaries present in a real-world deployment, namely the ubiquity of mal ware and software attacks. This has particular importance when a device cannot be trusted by a third-party, such as a corporation, that controls access to assets based on that decision. A software compromise, either on the scheme implementation or platform, may enable an adversary to modify authentication scores to alter the status of the device in reality, give insights into user behaviour, or gain unauthorised access to restricted assets. Hence, for the first time, we …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:QxlgOPrhsAcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A smart card web server in the web of things",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-56991-8_55",
            "Abstract": "The establishment of the Internet of Things (IoT) is gathering pace. The “things” will be counted in their billions, however interoperability problems may compromise the interconnectivity aspect. Isolated “things” are common and often make use of proprietary communication and security protocols that have not been subject to public scrutiny. By contrast the World Wide Web has well established technology and protocols and so there is interest in the so-called Web of Things (WoT) that would allow the “things” to communicate using standard web protocols. However, with so many readily accessible nodes we considered that the WoT should be underpinned by attack/tamper-resistant security modules that are compatible with the WoT protocols. This paper considers the use of the Smart Card Web Server (SCWS) capability to practically secure the WoT. Finally, the use of a SCWS is extended to provide a means of …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Confidence in smart token proximity: Relay attacks revisited",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404809000595",
            "Abstract": "Contactless and contact smart card systems use the physical constraints of the communication channel to implicitly prove the proximity of a token. These systems, however, are potentially vulnerable to an attack where the attacker relays communication between the reader and a token. Relay attacks are not new but are often not considered a major threat, like eavesdropping or skimming attacks, even though they arguably pose an equivalent security risk. In this paper we discuss the feasibility of implementing passive and active relay attacks against smart tokens and the possible security implications if an attacker succeeds. Finally, we evaluate the effectiveness of time-out constraints, distance bounding and the use of a additional verification techniques for making systems relay-resistant and explain the challenges still facing these mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:qjMakFHDy7sC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Don't Brick Your Car: Firmware Confidentiality and Rollback for Vehicles",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7299907/",
            "Abstract": "In modern cars, there are a number of controllers that play a major role in the overall operations of the vehicles. The secure and updated firmware of these controllers is crucial to the overall security and reliability of the vehicle and its electronic system (s). Therefore, the life cycle of these controllers should be carefully managed. In this paper, we examine the vehicular firmware updates process and their associated security issues. We have analysed the security of the firmware update protocol proposed in the EVITA project, referred as EVITA protocol, which is considered as a main industrial effort in this field and found some potential shortcomings. Based on the analysis, in this paper we have suggested a number of improvements to the EVITA protocol, related with safety and security measures. The proposed improved protocol, also referred as EVITA+ protocol includes a rollback mechanism while preserving the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deep Learning Application in Security and Privacy–Theory and Practice: A Position Paper",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20074-9_10",
            "Abstract": "Technology is shaping our lives in a multitude of ways. This is fuelled by a technology infrastructure, both legacy and state of the art, composed of a heterogeneous group of hardware, software, services, and organisations. Such infrastructure faces a diverse range of challenges to its operations that include security, privacy, resilience, and quality of services. Among these, cybersecurity and privacy are taking the centre-stage, especially since the General Data Protection Regulation (GDPR) came into effect. Traditional security and privacy techniques are overstretched and adversarial actors have evolved to design exploitation techniques that circumvent protection. With the ever-increasing complexity of technology infrastructure, security and privacy-preservation specialists have started to look for adaptable and flexible protection methods that can evolve (potentially autonomously) as the adversarial actor …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:tswL-GKFg8UC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Proximity assurances based on natural and artificial ambient environments",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-69284-5_7",
            "Abstract": "Relay attacks are passive man-in-the-middle attacks that aim to extend the physical distance of devices involved in a transaction beyond their operating environment. In the field of smart cards, distance bounding protocols have been proposed in order to counter relay attacks. For smartphones, meanwhile, the natural ambient environment surrounding the devices has been proposed as a potential Proximity and Relay-Attack Detection (PRAD) mechanism. These proposals, however, are not compliant with industry-imposed constraints that stipulate maximum transaction completion times, e.g. 500 ms for EMV contactless transactions. We evaluated the effectiveness of 17 ambient sensors that are widely-available in modern smartphones as a PRAD method for time-restricted contactless transactions. In our work, both similarity- and machine learning-based analyses demonstrated limited effectiveness of natural …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:gPamCmV4epEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Information Security Theory and Practices",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-540-72354-7.pdf",
            "Abstract": "With the rapid technological development of information technology, computer systems and especially embedded systems are becoming more mobile and ubiquitous. Ensuring the security of these complex and yet resource-constrained systems has emerged as one of the most pressing challenges for researchers. Although there are a number of information security conferences that look at particular aspects of the challenge, we decided to create the Workshop in Information Security Theory and Practices (WISTP) to consider the problem as a whole. In addition the workshop aims to bring together researchers and practitioners in related disciplines and encourage interchange and practical co-operation between academia and industry.Although this is the first ever WISTP event, the response from researchers was superb with over 68 papers submitted for potential inclusion in the workshop and proceedings. The …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A formally verified mutual authentication protocol for low-cost RFID tags",
            "Publication year": 2015,
            "Publication url": "http://infonomics-society.ie/wp-content/uploads/ijrfidsc/published-papers/volume-3-2014/A-Formally-Verified-Mutual-Authentication-Protocol-for-Low-Cost-RFID-Tags-.pdf",
            "Abstract": "In this paper, we propose a lightweight mutual authentication protocol for low-cost Radio Frequency IDentification (RFID) tags. Although RFID systems promise a fruitful future, security and privacy concerns have affected the proliferation of the RFID technology. The proposed protocol aims to protect RFID tags against a wide variety of attacks and especially Denial of Service (DoS) attacks. We found that the majority of the proposed protocols failed to resist this kind of attack. To analyse our proposed protocol, we provide an informal analysis. In addition, we formally analyse the security of the proposed protocol via using automated formal verification tools such as CasperFDR and AVISPA. We also employed an up-to-date privacy model to evaluate the privacy of the RFID protocol. The results show that the proposed protocol achieves tag’s data secrecy, privacy and authentication under the presence of a passive adversary.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Temporally Aware Behaviour-Based Security in Smart Cards",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4072159/",
            "Abstract": "This work looks at behaviour-based security on smart cards and proposes enhancements to threshold detection using temporal awareness that could address emerging attacks (card-sharing and DPA). Temporal awareness requires knowledge of time of which a smart card has no internal source. This work discusses smart card time, behaviour-based security, details a contractual behaviour counter-measure which is implemented in JavaCard and detailed analysis is conducted",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rethinking the smart card technology",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07620-1_20",
            "Abstract": "Creating security architectures and processes that directly interact with consumers, especially in consumer electronics, has to take into account usability, user-experience and skill level. Smart cards provide secure services, even in malicious environments, to end-users with a fairly straightforward limited usage pattern that even an ordinary user can easily deal with. The way the smart card industry achieves this is by limiting users’ interactions and privileges on the smart cards they carry around and use to access different services. This centralised control has been the key to providing secure and reliable services through smart cards, while keeping the smart cards fairly useable for end-users. However, as smart cards have permeated into every aspect of modern life, users have ended up carrying multiple cards to perform mundane tasks, making smart card-based services a cumbersome experience. User …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A secure and trusted boot process for avionics wireless networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7486322/",
            "Abstract": "Integrated Modular Avionics (IMA) in existing deployments is a collection of inter-connected avionics equipment supported by wired technology, with stringent reliability and safety requirements. If the inter-connecting wires are physically secured so that a malicious user cannot access them directly, then this simplifies the security management of the network. However, substituting the wired network with a wireless network - also referred to as an Avionics Wireless Network (AWN) - brings a set of new challenges related to assurance, reliability, and security; even for a specific set of well-defined and non-critical tasks. The AWN has to ensure that it provides at a minimum the existing required levels of safety offered by the equivalent wired network. These challenges are underpinned by a necessity to boot the AWN to a secure and trusted state, before it can be used to bridge different parts of the IMA in an aircraft. In this …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:qzPvQt7yPGwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A security framework model with communication protocol translator interface for enhancing NFC transactions",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5489770/",
            "Abstract": "With the recent technological advances of Near Field Communication (NFC) enabled mobile phones it is now possible to introduce additional transactions of value, including those originating from contact-based security tokens within the existing infrastructure. We propose a low cost security framework including a PKI based security protocol, which can be used to integrate transactions involving external contact-based smart cards, for the purposes of e-identification, e-payment, e-ticketing, and communication services. We then designed and implemented a secure Communications Protocol Translator Interface (CPTI), which allows an NFC enabled mobile phone to access and use, over a contact less interface, any additional smart cards (or secure elements (SE)) which are externally available on a contact based interface and vice-versa. By using CPTI, it is now possible to have communication and interaction …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting Sensor Multiplexing for Covert Channels and Application Fingerprinting on Mobile Devices",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.06363",
            "Abstract": "Mobile devices often distribute measurements from a single physical sensor to multiple applications using software-based multiplexing. On Android devices, the highest requested sampling frequency is returned to all applications even if other applications request measurements at lower frequencies. In this paper, we demonstrate that this design choice exposes practically exploitable side-channels based on frequency-key shifting. By carefully modulating sensor sampling frequencies in software, we show that unprivileged malicious applications can construct reliable spectral covert channels that bypass existing security mechanisms, e.g. Android's permissions framework. Moreover, we present a variant of this technique that allows an unprivileged malicious observer app to fingerprint other device applications and user interactions at a coarse-grained level. Both techniques do not impose any assumptions beyond application installation and accessing standard mobile services via the Android Sensors SDK. As such, they open a powerful attack vector that exploits subtle yet insecure design choices in mobile sensor stacks.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:2hlgnPHlchoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Smart cards, tokens, security and applications",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-50500-8.pdf",
            "Abstract": "When the first edition of this book was published back in 2008, the scope was anything to do with smart cards and security tokens in the widest sense. The aim was in fact to provide a complete story, looking at a cross section of technologies, processes, applications and real-world usage. The original motivation for the book was to provide a suitable reference text for the Masters course in Information Security, run by the Information Security Group (ISG) at Royal Holloway, University of London (RHUL). However, as the planning for the book advanced we realised that various industries and government departments can become quite narrow in their understanding of smart cards/RFIDs and that looking across industry and across roles (such as technical, business and logistics) could be beneficial for a much wide range of readers. Eight years on, in this second edition, we find we have new material to cover, whilst …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer"
        },
        {
            "Title": "Remote attestation mechanism based on physical unclonable functions",
            "Publication year": 2013,
            "Publication url": "https://abdn.pure.elsevier.com/en/publications/remote-attestation-mechanism-based-on-physical-unclonable-functio",
            "Abstract": "Remote attestation mechanisms are well studied in the high-end computing environments; however, the same is not true for embedded devices-especially for smart cards. With ever changing landscape of smart card technology and advancements towards a true multi-application platform, verifying the current state of the smart card is significant to the overall security of such proposals. The initiatives proposed by GlobalPlatform Consumer Centric Model (GP-CCM) and User Centric Smart Card Ownership Model (UCOM) enables a user to download any application as she desire-depending upon the authorisation of the application provider. Before an application provider issues an application to a smart card, verifying the current state of the smart card is crucial to the security of the respective application. In this paper, we analyse the rationale behind the remote attestation mechanism for smart cards, and the fundamental features that such a mechanism should possess. We also study the applicability of Physical Unclonable Functions (PUFs) for the remote attestation mechanism and propose two algorithms to achieve the stated features of remote attestation. The proposed algorithms are implemented in a test environment to evaluate their performance.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Enhancing the key distribution model in the RFID-enabled supply chains",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6844749/",
            "Abstract": "In this paper, we point out the use of secret sharing strategies as a promising solution for managing the key distribution and recovery in the Radio Frequency Identification (RFID)- enabled supply chains. To this end, we designed a new model based on a secret sharing approach to solve the key distribution issue within the supply chains. We further proposed a secret key update protocol incorporating a resynchronisation capability to counter the disruptive effects of location tracking, replay attacks, and desynchronisation attacks. Compared with relevant approaches, our work demonstrates a number of advantages in terms of security and performance.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Overview of security threats for smart cards in the public transport industry",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4690659/",
            "Abstract": "The advantages of utilising smart card technology, more importantly contactless smart cards, in the transport industry have long been realised. In this paper we provide an overview of the generic security issues and threats encountered whenever smart cards are utilised within the transport industry. To help highlight the issues, we analyse the different types of cards, their hosted applications, along with certain requirements on the relevant card issuing authorities.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vulnerability Analysis of a Commercial. NET Smart Card",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-08302-5_9",
            "Abstract": "In this paper we discuss the operating system security measures of a commercial .NET smart card for mitigating risks of malicious smart card applications. We also investigate how these security measures relate to the card resident binary by analysing its proprietary file format to develop a new vulnerability research tool for .NET card applications. This tool enables us to modify compiled card applications for creating vulnerability research test cases. We then present the details of the vulnerabilities in the target .NET virtual machine (VM) which have been discovered using this tool. The vulnerabilities relate to potential misuse of administrator privileges, therefore, we conclude with recommending countermeasures to be implemented in the card manager application and .NET VM to fix those vulnerabilities.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An evaluation of the security of the Bitcoin Peer-to-Peer Network",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8726695/",
            "Abstract": "Underpinning the operation of Bitcoin is a peer-to-peer (P2P) network [1] that facilitates the execution of transactions by end users, as well as the transaction confirmation process known as bitcoin mining. The security of this P2P network is vital for the currency to function and subversion of the underlying network can lead to attacks on bitcoin users including theft of bitcoins, manipulation of the mining process and denial of service (DoS). As part of this paper the network protocol and bitcoin core software are analysed, with three bitcoin message exchanges (the connection handshake, GETHEADERS/HEADERS and MEMPOOL/INV) found to be potentially vulnerable to spoofing and use in distributed denial of service (DDoS) attacks. Possible solutions to the identified weaknesses and vulnerabilities are evaluated, such as the introduction of random nonces into network messages exchanges.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:ThYxFsVAhEkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smart Card Reader and Mobile APIs",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-50500-8_12",
            "Abstract": "The aim of this chapter is to describe the main middlewares and APIs used to manage and access smart card readers          and smart cards, along with the mobile phone APIs          to access smart cards, SIM card and Secure Elements. It is illustrated by samples of code that the reader          of this book will be able to reuse to quickly develop his/her first applications to communicate with smart cards.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:5o6HiIVP414C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Cross-platform application sharing mechanism",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6120870/",
            "Abstract": "The application sharing mechanism in multi application smart cards facilitates corroborative schemes between applications in a secure and reliable manner. Traditional application sharing can only be realised if both applications are installed on the same device. In this paper, we extend the smart card firewall to include the application sharing mechanism between applications installed on different smart cards. We propose Platform and Application Binding Protocols that enables two smart-cards / applications to authenticate and ascertain the trustworthiness before sharing resources. Furthermore, we provide an informal analysis of the protocols along with comparison with existing protocols. Subsequently, mechanical formal analysis based on the CasperFDR, and the implementation experience is presented.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "eak ontroller ross M Memor ontroller o ert flannel on M lti ore S stems",
            "Publication year": 2020,
            "Publication url": "https://easychair.org/publications/preprint_download/npJf",
            "Abstract": "Data confidentiality is put at risk on cloud platforms where multiple tenants share the underlying hardware. As multiple workloads are executed concurrently, conflicts in memory resource occur, resulting in observable timing variations during execution. Malicious tenants can intentionally manipulate the hardware platform to devise a covert channel, enabling them to steal the data of co-residing tenants. This paper presents two new microarchitectural covert channel attacks using the memory controller. The first attack allows a privileged adversary (ie process) to leak information in a native environment. The second attack is an extension to cross-VM scenarios for unprivileged adversaries. This work is the first instance of leakage channel based on the memory controller. As opposed to previous denial-of-service attacks, we manage to modulate the load on the channel scheduler with accuracy. Both attacks are implemented on cross-core configurations. Furthermore, the cross-VM covert channel is successfully tested across three different Intel microarchitectures. Finally, a comparison against state-of-the-art covert channel attacks is provided, along with a discussion on potential mitigation techniques.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:AOwgc6nnr1EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing EMV Tokenisation with Dynamic Transaction Tokens",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-62024-4_8",
            "Abstract": "Europay MasterCard Visa (EMV) Tokenisation specification details how the risk involved in Personal Account Number (PAN) compromise can be prevented by using tokenisation. In this paper, we identify two main potential problem areas that raise concerns about the security of tokenised EMV contactless mobile payments, especially when the same token also called a static token is used to pay for all transactions. We then discuss five associated attack scenarios that would let an adversary compromise payment transactions. It is paramount to address these security concerns to secure tokenised payments, which is the main focus of the paper. We propose a solution that would enhance the security of this process when a smart phone is used to make a tokenised contactless payment. In our design, instead of using a static token in every transaction, a new dynamic token and a token cryptogram is used. The …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:pk6FPx6l9xIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Are we smart about security?",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S136341270300102X",
            "Abstract": "The introduction of new technologies and changes in behaviours has resulted in an erosion of personal contact and greater reliance on security systems and safeguards. The proliferation of independent security measures has generated an increasing amount of security information that must be stored and recalled by the consumer. Overall security can then be weakened as the consumer is inexpert at managing such data and really needs an integrated high security solution that is also easy to use. The multi-application smart card offers a promising solution, however, we may need to challenge some existing practices if we are to empower the citizen in the online world.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "On the effectiveness of ambient sensing for detecting NFC relay attacks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8029421/",
            "Abstract": "Smartphones with Near-Field Communication (NFC) may emulate contactless smart cards, which has resulted in the deployment of various access control, transportation and payment services, such as Google Pay and Apple Pay. Like contactless cards, however, NFC-based smartphone transactions are susceptible to relay attacks, and ambient sensing has been suggested as a potential countermeasure. In this study, we empirically evaluate the suitability of ambient sensors as a proximity detection mechanism for smartphone-based transactions under EMV constraints. We underpin our study using sensing data collected from 17 sensors from an emulated relay attack test-bed to assess whether they can thwart such attacks effectively. Each sensor, where feasible, was used to record 350-400 legitimate and relay (illegitimate) contactless transactions at two different physical locations. Our analysis provides an …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:SgTKrLvt1DcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An analysis of the vulnerabilities introduced with the java card 3 connected edition",
            "Publication year": 2012,
            "Publication url": "http://www.ma.rhul.ac.uk/static/techrep/2013/MA-2013-04.pdf",
            "Abstract": "During 2009, Sun released the Java Card 3.0 specifications, defining various aspects of the Java Card platform, which is capable of hosting multiple applications on smart cards and USB tokens. This release introduced several improvements over its predecessors, in what was called the Classic Edition. However the more innovative aspect was the introduction of a new separate set of specifications, named the",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Attacking smart card systems: Theory and practice",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S136341270900017X",
            "Abstract": "Smart card technology has evolved over the last few years following notable improvements in the underlying hardware and software platforms. Advanced smart card microprocessors, along with robust smart card operating systems and platforms, contribute towards a broader acceptance of the technology. These improvements have eliminated some of the traditional smart card security concerns. However, researchers and hackers are constantly looking for new issues and vulnerabilities. In this article we provide a brief overview of the main smart card attack categories and their corresponding countermeasures. We also provide examples of well-documented attacks on systems that use smart card technology (e.g. satellite TV, EMV, proximity identification) in an attempt to highlight the importance of the security of the overall system rather than just the smart card.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Problems and Prospects of Multi Application Smart cards in the UK Financial Industry",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4402132/",
            "Abstract": "The research questions that will be answered in this paper are the following: Firstly, whether smart card technology (in the banking sector) can be used, not only for combating fraud, but also in order to achieve a competitive advantage without suffering from traditional IT system drawbacks. Secondly, what are the business and technical issues that will affect such a migration? The methodology involved requires a thorough review of the relevant literature on IT and competitive advantage. Furthermore, it also involves a number of interviews in the UK financial industry (i.e. banks and credit card companies), and the smart card technology providers.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Challenges of security and trust in avionics wireless networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7311416/",
            "Abstract": "Avionics networks have a set of stringent reliability and safety requirements. In existing deployments, most of these networks are based on wired technology which provides a high degree of reliability and safety. Furthermore, it simplifies the security management of the network since certain assumptions, including an inability for an attacker to access the network, can be safely made. The proposal for having an Avionics Wireless Network (AWN), currently being developed by multiple aerospace working groups, promises reduction in the complexity of electrical wiring harness design and fabrication, reduction in wiring weight, increased configurability, and potential monitoring of otherwise inaccessible moving or rotating aircraft parts. While providing these benefits, the AWN must ensure that it provides, at a minimum, equivalent levels of safety to those offered by the wired network. Substituting the wired network with a …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:UHK10RUVsp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure Deployment of Applications to Fielded Devices and Smart Cards.",
            "Publication year": 2006,
            "Publication url": "https://www.scitepress.org/papers/2006/24864/24864.pdf",
            "Abstract": "This work presents a process of deploying applications securely to fielded devices with smart cards whilst taking into consideration the possibility that the client device could be malicious. Advantages of the proposed process include; caching functionality upon the device, optimal use of resources, employment of nested security contexts whilst addressing fielded infrastructures and a homogeneous solution. This work outlines a targeted scenario, details existing malicious device activity and defines an attacker profile. Assumptions and requirements are drawn and analysis of the proposal and attack scenarios is conducted. Advantages and deployment scenarios are presented with an implementation the process using Java and specific standards.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gesture recognition implemented on a personal limited device",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7921966/",
            "Abstract": "For a biometrics system, one of the principal challenges is to protect the biometric reference template, as if a malicious individual is able to obtain this template, the genuine user would not be able to reuse the biometric for any application. A solution may be to use a new form of authentication based on gesture recognition. This type of authentication has the added advantage that in the case of compromise, the gesture can be changed yet still retain the advantages of the biometric input. In this paper, we investigate whether it is feasible to implement a Gesture Recognition system on a personal limited device such as a smart card. To do this, we set out an experiment using sample gestures based on practical results of gesture authentication trials and an optimised version of Dynamic Time Warping (DTW) algorithm to analyse the data captured. We implemented them on both a contact Smart Card (SC) and the more …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:H0nRGT7Dr7IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security, privacy and safety evaluation of dynamic and static fleets of drones",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8101984/",
            "Abstract": "Interconnected everyday objects, either via public or private networks, are gradually becoming reality in modern life - often referred to as the Internet of Things (IoT) or Cyber-Physical Systems (CPS). One stand-out example are those systems based on Unmanned Aerial Vehicles (UAVs). Fleets of such vehicles (drones) are prophesied to assume multiple roles from mundane to high-sensitive applications, such as prompt pizza or shopping deliveries to the home, or to deployment on battlefields for battlefield and combat missions. Drones, which we refer to as UAVs in this paper, can operate either individually (solo missions) or as part of a fleet (group missions), with and without constant connection with a base station. The base station acts as the command centre to manage the drones' activities; however, an independent, localised and effective fleet control is necessary, potentially based on swarm intelligence, for …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:Iq19BMNozs4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing Java Runtime Environment for Smart Cards Against Runtime Attacks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24177-7_27",
            "Abstract": "Smart cards are mostly deployed in security-critical environments in order to provide a secure and trusted access to the provisioned services. These services are delivered to a cardholder using the Service Provider’s (SPs) applications on his or her smart card(s). These applications are at their most vulnerable state when they are executing. There exist a variety of runtime attacks that can circumvent the security checks implemented either by the respective application or the runtime environment to protect the smart card platform, user and/or application. In this paper, we discuss the Java Runtime Environment and a potential threat model based on runtime attacks. Subsequently, we discussed the counter-measures that can be deployed to provide a secure and reliable execution platform, along with an evaluation of their effectiveness, incurred performance-penalty and latency.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:hkOj_22Ku90C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Smart cards, tokens, security and applications",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-50500-8.pdf",
            "Abstract": "When the first edition of this book was published back in 2008, the scope was anything to do with smart cards and security tokens in the widest sense. The aim was in fact to provide a complete story, looking at a cross section of technologies, processes, applications and real-world usage. The original motivation for the book was to provide a suitable reference text for the Masters course in Information Security, run by the Information Security Group (ISG) at Royal Holloway, University of London (RHUL). However, as the planning for the book advanced we realised that various industries and government departments can become quite narrow in their understanding of smart cards/RFIDs and that looking across industry and across roles (such as technical, business and logistics) could be beneficial for a much wide range of readers. Eight years on, in this second edition, we find we have new material to cover, whilst …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:738O_yMBCRsC",
            "Publisher": "Springer"
        },
        {
            "Title": "Challenges of security and trust of mobile devices as digital avionics component",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7486323/",
            "Abstract": "Mobile devices are becoming part of modern digital avionics. Mobile devices can be applied to a range of scenarios, from Electronic Flight Bags to maintenance platforms, in order to manage and configure flight information, configure avionics networks or perform maintenance tasks (including offloading flight logs). It can be argued that recent developments show an increased use of personal mobile devices playing an integral part in the digital avionics industry. In this paper, we look into different proposals for integrating mobile devices with various avionics networks - either as part of the Bring Your Own Device (BYOD) or Corporate Owned Personally Enabled (COPE) paradigms. Furthermore, we will evaluate the security and trust challenges presented by these devices in their respective domains. This analysis will also include the issues related to communication between the mobile device and the aircraft network …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An introduction to the trusted platform module and mobile trusted module",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-7915-4_4",
            "Abstract": "The trusted platform module (TPM) is a tamper-resistant component that provides roots of trust in secure computing and remote attestation frameworks. In this chapter, we briefly discuss the TPM architecture, operations and services. The discussion is then extended to the mobile trusted module (MTM)—to contrast and compare different approaches to implement a trusted platform architecture. This illustrates the vital role the ecosystem of a computing platform plays in the architectural design decisions regarding the root of trust in a trusted platforms.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Physical Fault Injection and Side-Channel Attacks on Mobile Devices: A Comprehensive Analysis",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404821002959",
            "Abstract": "Today’s mobile devices contain densely packaged system-on-chips (SoCs) with multi-core, high-frequency CPUs and complex pipelines. In parallel, sophisticated SoC-assisted security mechanisms have become commonplace for protecting device data, such as trusted execution environments, full-disk and file-based encryption. Both advancements have dramatically complicated the use of conventional physical attacks, requiring the development of specialised attacks. In this survey, we consolidate recent developments in physical fault injections and side-channel attacks on modern mobile devices. In total, we comprehensively survey over 50 fault injection and side-channel attack papers published between 2009–2021. We evaluate the prevailing methods, compare existing attacks using a common set of criteria, identify several challenges and shortcomings, and suggest future directions of research.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:-cHHJ4ChvFsC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Secure and trusted execution: Past, present, and future-a critical review in the context of the internet of things and cyber-physical systems",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7846943/",
            "Abstract": "Notions like security, trust, and privacy are crucial in the digital environment and in the future, with the advent of technologies like the Internet of Things (IoT) and Cyber-Physical Systems (CPS), their importance is only going to increase. Trust has different definitions, some situations rely on real-world relationships between entities while others depend on robust technologies to gain trust after deployment. In this paper we focus on these robust technologies, their evolution in past decades and their scope in the near future. The evolution of robust trust technologies has involved diverse approaches, as a consequence trust is defined, understood and ascertained differently across heterogeneous domains and technologies. In this paper we look at digital trust technologies from the point of view of security and examine how they are making secure computing an attainable reality. The paper also revisits and analyses the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:XAEgxC7iu0MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An RFID grouping proof protocol exploiting anti-collision algorithm for subgroup dividing",
            "Publication year": 2010,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSN.2010.032206",
            "Abstract": "Verifying that several RFID tags are all present in a group poses specific challenges that have generated great interest in the academic community. As the number of tags becomes large, the unreliability of radio wave communication could potentially cause possible high failure rates to the existing grouping proof. In this paper, we propose a way of grouping proof, which uses the dynamic binary tree anti-collision algorithm to subgroup the tags. This paper combines the 'Yoking Proof' idea and the 'Select-Response' mode from previous publications. The 'Yoking Proof' is generated between subgroups and within each subgroup, and as a result, the failure rates are greatly reduced. The 'Select-Response' mode is used for subgroup verification.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "A secure and trusted channel protocol for the user centric smart card ownership model",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6680860/",
            "Abstract": "The User Centric Smart Card Ownership Model (UCOM) provides an open and dynamic smart card environment enabling cardholders to request installation/deletion of an application to which they are entitled. As in this model, smart cards are not under the control of a centralised authority; hence, it is difficult for an application provider to ascertain their trustworthiness. At present, proposed secure channel protocols for the smart card environment do not provide adequate assurance required by the UCOM. In this paper, we explore the reasons behind their failure to meet the UCOM requirements and then propose a secure and trusted channel protocol that meets them. In addition, the proposed protocol is also suitable to GlobalPlatform's consumer-centric smart cards. A comparison of the proposed protocol with existing smart card and selected Internet protocols is provided. Then we analyse the protocol with the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Log your car: Reliable maintenance services record",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-54705-3_30",
            "Abstract": "A maintenance services logging system is a useful tool for car owners to keep track of the car’s condition and also can increase the market value of the car. Logging systems range from manual, paper-based, to automated, cloud-based systems. The automated process provides ease of use and availability of the records. A secure protocol is required to ensure that the workshop and service record are authentic, and hence the records are reliable. In this paper, we propose a secure protocol for automated maintenance services logging systems, through the use of a mobile application called AutoLOG. The multiple electronic control units (ECUs) used to support the connected and intelligent vehicle’s technology are used to support the digital automated logging system. The car is the trusted entity that generates the log. The records are stored in an authorised mobile device and uploaded onto a cloud server to …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:xyzrkeHX5M4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Fraud detection and prevention in smart card based environments using artificial intelligence",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-85893-5_9",
            "Abstract": "This paper discusses the development and research for the detection of fraud in Smart-Card environments by using artificial intelligence. The current research deals with behaviour based detection engine, which will detect abnormalities by learning the usual behaviour of the user and detecting new unusual behaviours. The behaviour-based detection engines is based on ‘Neural Networks’. This work considers the feasibility of implementing ‘Neural Network’ fraud engine on a Smart card platforms.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Secure mobile payment on NFC-enabled mobile phones formally analysed using CasperFDR",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7011278/",
            "Abstract": "Near Field Communication (NFC) mobile phones can be used as payment devices and can emulate credit cards. Although NFC mobile services promise a fruitful future, several issues have been raised by academics and researchers. Among the main concerns for the use and deployment of NFC-enabled mobile phones is the potential loss of security and privacy. More specifically, mobile phone users involved in a payment transaction conducted over a mobile handset require that such a system does not reveal their identity or any sensitive data. Furthermore, that all entities participating in the transaction are legitimate. To this end, we proposed a protocol that meets the mobile user's requirements. The proposed protocol attempts to address the main security concerns and protects the customer privacy from any third party involved in the transaction. We formally analysed the protocol using CasperFDR and did not …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Virtual world authentication using the smart card web server",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40576-1_4",
            "Abstract": "Virtual Worlds (VWs) are persistent, immersive digital environments, in which people utilise digital representation of themselves. Current management of VW identity is very limited, and security issues arise, such as identity theft. This paper proposes a two-factor user authentication scheme based on One Time Passwords (OTPs), exploiting a Smart Card Web Server (SCWS) hosted on the tamper-resistant Subscriber Identity Module (SIM) within the user’s mobile phone. Additionally, geolocation attributes are used to compare phone and PC locations, introducing another obstacle for an attacker. A preliminary security analysis is done on the protocol, and future work is identified.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:UxriW0iASnsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An efficient protocol for UAS security",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8011987/",
            "Abstract": "This article consists of a collection of slides from the author's conference presentation. Some of the specific areas/topics discussed include: our protocol for UAS is efficient and secure against an attacker with a high attack potential: in addition, it is flexible: implementer can choice the encryption scheme: and we plan to extend it to hierarchical UAS: several GSs: network with big UAV acting as cluster head.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:SC9kKMAi-DoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Forensic smartphone analysis using adhesives: Transplantation of package on package components",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1742287618301117",
            "Abstract": "Investigators routinely recover data from mobile devices. In many cases the target device is severely damaged. Events such as airplane crashes, accidents, terrorism or long submersion may bend or crack the device's main board and hence prevent using standard forensic tools. This paper shows how to salvage forensic information when NAND memory, SoC or cryptographic chips are still intact. We do not make any assumptions on the state of the other components. In usual forensic investigations, damaged phone components are analysed using a process called “forensic transplantation”. This procedure consists of unsoldering (or lapping) chips, re-soldering them on a functionnal donor board and rebooting.Package on Package (PoP) component packaging is a new technique allowing manufacturers to stack two silicon chips, e.g. memory, CPU or cryptographic processors. Currently, PoP is widely used by most …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:6e4D8M0GhXMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Smart Card Web Server",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-1192-1_19",
            "Abstract": "In this article (based on “Kyrillidis L, Mayes K, Markantonakis K (2010) Web server on a SIM card. Lecture notes in engineering and computer science: Proceedings of the World Congress on Engineering 2010, WCE 2010, 30 June–2 July 2010, London, UK, pp 253–259”) we discuss about the integration of a web server on a SIM card and we attempt an analysis from various perspectives (management, operation, security). A brief representation of the Smart Card Web Server (SCWS) will take place along with a use case that will help the reader to identify the way that an SCWS can be used in practice, before we reach to a final conclusion.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Is the performance of smart card cryptographic functions the real bottleneck",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-306-46998-7_6",
            "Abstract": "It is generally believed that among the major delaying factors of smart card performance is the speed of the cryptographic algorithms. This is only partially true, as a number of other factors that add substantial delays to the overall performance of a smart card application should also be taken into account. In this paper we analyse the significance of these delaying factors. Furthermore, we also present some performance measurements of the two most widely used terminal application programming interfaces (APIs) and Java Cards. The aim of this work is to emphasise, both to smart card application developers and smart card technology researchers, the importance of these delaying factors and also to provide a reference point as to the performance of each API.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Establishing mutually trusted channels for remote sensing devices with trusted execution environments",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3098954.3098971",
            "Abstract": "Remote and largely unattended sensing devices are being deployed rapidly in sensitive environments, such as healthcare, in the home, and on corporate premises. A major challenge, however, is trusting data from such devices to inform critical decision-making using standardised trust mechanisms. Previous attempts have focused heavily on Trusted Platform Modules (TPMs) as a root of trust, but these forgo desirable features of recent developments, namely Trusted Execution Environments (TEEs), such as Intel SGX and the GlobalPlatform TEE. In this paper, we contrast the application of TEEs in trusted sensing devices with TPMs, and raise the challenge of secure TEE-to-TEE communication between remote devices with mutual trust assurances. To this end, we present a novel secure and trusted channel protocol that performs mutual remote attestation in a single run for small-scale devices with TEEs. This is …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:UFuRdyijzaAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A session hijacking attack against a device-assisted physical-layer key agreement",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8741092/",
            "Abstract": "Physical-layer key agreement is used to generate a shared key between devices on demand. Such schemes utilize the characteristics of the wireless channel to generate the shared key from the device-to-device channel. As all characteristics are time-dependent and location-dependent, it is hard for eavesdroppers to get the key. However, most research works in this area use passive attack models whereas active attacks that aim at manipulating the channel and key are also possible. Physical-layer key agreement with User Introduced Randomness (PHYUIR) is a solution similar to the Diffie-Hellman protocol against such a kind of active attack. The users (devices) introduce their own randomness to help to prevent active attacks. In this paper, we analyze the possibility of launching a session hijacking attack on PHY-UIR to allow an attacker to control the shared key established. The session hijacking attack …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:jvrRlaHg2sAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Is the Performance of the Cryptographic Functions the Real Bottleneck?",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Philanthropy on the Blockchain",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-93524-9_2",
            "Abstract": "One of the significant innovations that came out of Bitcoin is the blockchain technology. This paper explores how the blockchain can be leveraged in the philanthropic sector, through charitable donation services in fiat currency or Bitcoin via a web-based donor platform. The philanthropic model is then used for a case study providing humanitarian aid for a community living in a challenging geographical environment with limited internet availability. An SMS based mobile payment system is proposed for provisioning the received donations using the existing GSM network, very basic mobile phones and One Time Password (OTP) security tokens. The proposed scheme is finally evaluated for security while discussing the impact it has on charities and donors.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:H8haQKU-3ZsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Mobile communication security controllers an evaluation paper",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1363412708000411",
            "Abstract": "Cellular communication via a traditional mobile handset is a ubiquitous part of modern life and as device technology and network performance continues to advance, it becomes possible for laptop computers, Personal Digital Assistants [PDAs; Note abbreviations will be shown in square brackets to avoid confusion with references.] and even electrical meters to better exploit mobile networks for wireless communication. As the diverse demands for network access and value added services increase, so does the importance of maintaining secure and consistent access controls. A critical and well-proven component of the GSM and UMTS security solution is the smart card in the form of the SIM or USIM respectively. This has also extended into some regions using variants of CDMA standards where the RUIM is specified. However with the enlarged range of communications devices, some manufacturers claim that the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Practical NFC peer-to-peer relay attack using mobile phones",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16822-2_4",
            "Abstract": "NFC is a standardised technology providing short-range RFID communication channels for mobile devices. Peer-to-peer applications for mobile devices are receiving increased interest and in some cases these services are relying on NFC communication. It has been suggested that NFC systems are particularly vulnerable to relay attacks, and that the attacker’s proxy devices could even be implemented using off-the-shelf NFC-enabled devices. This paper describes how a relay attack can be implemented against systems using legitimate peer-to-peer NFC communication by developing and installing suitable MIDlets on the attacker’s own NFC-enabled mobile phones. The attack does not need to access secure program memory nor use any code signing, and can use publicly available APIs. We go on to discuss how relay attack countermeasures using device location could be used in the mobile …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "advanced semantic and social multimedia technologies for future computing environment",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-012-1105-1",
            "Abstract": "With the popularity of multimedia data on the internet, efficiently accessing and managing the explosively growing multimedia content from large-scale multimedia database has become essential. During the last decades, extensive research efforts have been dedicated to automatic multimedia analysis and processing, such as acquisition, generation, storage, and retrieval of large-scale multimedia information. However, despite these techniques already provide promising results, there are still several key difficulties such as semantic gap and user gap in multimedia analysis/processing and annotation/tagging, respectively. The aim of this special issue is to provide an overview of emerging research challenges in Semantic Multimedia and to help reducing the Semantic and User Gap between low-level content descriptions of multimedia and the semantics in high-level human interpretations of audiovisual media …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Serverless protocols for inventory and tracking with a UAV",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8102113/",
            "Abstract": "It is widely acknowledged that the proliferation of Unmanned Aerial Vehicles (UAVs) may lead to serious concerns regarding avionics safety, particularly when end-users are not adhering to air safety regulations. There are, however, domains in which UAVs may help to increase the safety of airplanes and the management of flights and airport resources that often require substantial human resources. For instance, Paris Charles de Gaulle airport (CDG) has more than 7,000 staff and supports 30,000 direct jobs for more than 60 million passengers per year (as of 2016). Indeed, these new systems can be used beneficially for several purposes, even in sensitive areas like airports. Among the considered applications are those that suggest using UAVs to enhance safety of on-ground airplanes; for instance, by collecting (once the aircraft has landed) data recorded by different systems during the flight (like the sensors of …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:cUMtEw7vMgQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Consumer Centric Data Control, Tracking and Transparency–A Position Paper",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8456060/",
            "Abstract": "Personal data related to a user's activities, preferences and services, is considered to be a valuable commodity not only for a wide range of technology-oriented companies like Google, Amazon and Apple but also for more traditional companies like travel/transport, banking, entertainment and marketing industry. This has resulted in more targeted and to a great extend personalised services for individuals - in most cases at a minimal financial cost to them. The operational reality upon which a user authorises companies to collect his/her personal data to receive, in return, more personalised/targeted/context-aware services and hassle-free activities (for users) is widely deployed. It becomes evident that the security, integrity and accessibility of the collected data are of paramount importance. These characteristics are becoming more entrenched in the era of Internet-of-Things (IoT), autonomous vehicles and seamless …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:vPKCt-r_nWsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A location based security framework for authenticating mobile phones",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1890791.1890796",
            "Abstract": "Although the utilisation of location information in mobile network access systems has given rise to a variety of applications and services, it is thought that the underlying service authentication model and the related security can be further enhanced. We propose a hierarchical location and proximity based access framework to services using mobile devices. We then show that it is practically feasible to implement this framework using'intelligent'mobile agents. We discuss the necessary security mechanisms and security protocols for such a framework and show that our framework is resilient to relay attacks. The developed location aware mobile agent is equipped with accurate source-of-location sensing that operates online and offline.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure logging mechanisms for smart cards",
            "Publication year": 2000,
            "Publication url": "http://www.ma.rhul.ac.uk/static/techrep/2001/RHUL-MA-2001-6.pdf",
            "Abstract": "!¢¡ 35©)(4¡ ecf gihyg v wyvjIda hqwqt prgihc qGg yg it wygi C tv vg wqf g hqtveg q prhqprCI tfv qprh mpxwy yf g dxdp jI C lp¤£ g wyg¦¥dxdujI v § ecf g qGqw7 ev ygihyg@ wygi px\" wqfvprh wqf gihqprh prhd wqf g ygihqtvdxwU IQqpx bpx kjIdk ygihygijI y yf ijI q qprgitvw 8@ 9© u'9hyg dr px 2 idxdj8vjIwqpr) qpxwqf2wqf g yhr qfvpxdrhqw© gvydxdrgi 2 px wqf gg ekjI qwug@ w\" I lm¤ jIwqf gujIwqpr ih\" jh7 j ijI pr jIwyg7wqf g7 vg b ygig\" I wy'I dfvpxdr bhyevf9 § ecfvprh qGqw¤ fkjhw 8gig W hqt8vupxwqwygis jI 9wqf gs vg b ygigl jiqcjI y¦ px jI 9wqf g tv vpx Sg yhqpxw9s gi t ijIwqprkjIdE gihqwvj8dxprhqfug@ w© §",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CAN bus risk analysis revisit",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-43826-8_13",
            "Abstract": "In automotive design process, safety has always been the main concern. However, in modern days, security is also seen as an important aspect in vehicle communication especially where connectivity is very widely available. In this paper, we are going to discuss the threats and vulnerabilities of a CAN bus network. After we have considered a number of risk analysis methods, we decided to use FMEA. The analysis process allowed us to derive the security requirements of a CAN bus. Experimental setup of CAN bus communication network were implemented and analysed.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:5ugPr518TE4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Security challenges for user-oriented RFID applications within the\" Internet of things\"",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.302.9192&rep=rep1&type=pdf",
            "Abstract": "In this article, we examine the role played by RFID in enabling user-oriented networked applications. We explain why RFID is seen to be an important building block of the ‘Internet of Things’ and examine how RFID, assisted by the deployment of NFC devices, is increasingly facilitating useroriented, Internet-based application architectures. Finally, we look at the high-level security challenges that these user-oriented application architectures will need to address.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:0EnyYjriUFMC",
            "Publisher": "National Dong Hwa University"
        },
        {
            "Title": "The applicability of ambient sensors as proximity evidence for NFC transactions",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8227305/",
            "Abstract": "Near Field Communication (NFC) has enabled mobile phones to emulate contactless smart cards. Similar to contactless smart cards, they are also susceptible to relay attacks. To counter these, a number of methods have been proposed that rely primarily on ambient sensors as a proximity detection mechanism (also known as an anti-relay mechanism). In this paper, we empirically evaluate a comprehensive set of ambient sensors for their effectiveness as a proximity detection mechanism for NFC contactless-based applications like banking, transport and high-security access controls. We selected 17 sensors available via the Google Android platform. Each sensor, where feasible, was used to record the measurements of 1,000 contactless transactions at four different physical locations. A total of 252 users, a random sample from the university student population, were involved during the field trials. After careful …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:Fx13dKtzC7kC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Remote attestation mechanism for embedded devices based on physical unclonable functions",
            "Publication year": 2013,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/35532",
            "Abstract": "Remote attestation mechanisms are well studied in the high-end computing environments; however, the same is not true for embedded devices–especially for smart cards. With ever changing landscape of smart card technology and advancements towards a true multi-application platform, verifying the current state of the smart card is significant to the overall security of such proposals. The initiatives proposed by GlobalPlatform Consumer Centric Model (GP-CCM) and User Centric Smart Card Ownership Model (UCOM) enables a user to download any application as she desire–depending upon the authorisation of the application provider. Before an application provider issues an application to a smart card, verifying the current state of the smart card is crucial to the security of the respective application. In this paper, we analyse the rationale behind the remote attestation mechanism for smart cards, and the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:7T2F9Uy0os0C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "When theory and reality collide: Demystifying the effectiveness of ambient sensing for NFC-based proximity detection by applying relay attack data",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1605.00425",
            "Abstract": "Over the past decade, smartphones have become the point of convergence for many applications and services. There is a growing trend in which traditional smart-card based services like banking, transport and access control are being provisioned through smartphones. Smartphones with Near Field Communication (NFC) capability can emulate a contactless smart card; popular examples of such services include Google Pay and Apple Pay. Similar to contactless smart cards, NFC-based smartphone transactions are susceptible to relay attacks. For contactless smart cards, distance-bounding protocols are proposed to counter such attacks; for NFC-based smartphone transactions, ambient sensors have been proposed as potential countermeasures. In this study, we have empirically evaluated the suitability of ambient sensors as a proximity detection mechanism for contactless transactions. To provide a comprehensive analysis, we also collected relay attack data to ascertain whether ambient sensors are able to thwart such attacks effectively. We initially evaluated 17 sensors before selecting 7 sensors for in-depth analysis based on their effectiveness as potential proximity detection mechanisms within the constraints of a contactless transaction scenario. Each sensor was used to record 1000 legitimate and relay (illegitimate) contactless transactions at four different physical locations. The analysis of these transactions provides an empirical foundation on which to determine whether ambient sensors provide a strong proximity detection mechanism for security-sensitive applications like banking, transport and high-security access control.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:tKAzc9rXhukC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Log your car: The non-invasive vehicle forensics",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7847047/",
            "Abstract": "Digital forensics is becoming an important feature for many embedded devices. In automotive systems, digital forensics involves multiple electronic control units (ECUs) used to support the connected and intelligent vehicle's technology. Digital evidence from these ECUs can be used in forensics investigation and analysis. Such a mechanism can potentially facilitate crash investigation, insurance claims and crime investigation. Issues related to forensics include the authenticity, integrity and privacy of the data. In this paper, the security of the forensic process and data in automotive systems is analysed. We propose an efficient, secure, privacy-preserving and reliable mechanism to provide a forensics data collection and storage process. A diagnostic application for smart phones, DiaLOG, is incorporated in the proposed process that uses a secure protocol to communicate the collected forensic data to a secure cloud …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:e0CZ6poB34oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Website credential storage and two-factor web authentication with a Java SIM",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12368-9_17",
            "Abstract": "In this paper two mobile website authentication schemes are proposed. The first enables authentication credentials (username and password) to be stored and retrieved securely from a mobile handset, and requires no changes to existing websites. The second scheme, which may optionally be used with the first, utilises a one-time password and is intended for applications requiring an enhanced level of authentication, e.g. financial services. Both authentication schemes use a Java SIM and ubiquitous mobile phone; with its familiar and convenient form factor and high user acceptance. Both schemes also provide protection against online phishing attacks.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Smart cards for Banking and Finance",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-50500-8_5",
            "Abstract": "The banking industry managed global payment for consumers over several decades using magnetic stripe card          technology. Fraud has always been an issue to manage and it grows over time with the increase of card usage. This coupled with fresh technologies on the horizon led to the adoption of smart card technology to bear down on fraud and open the way for new forms of payment. The major Payment System          operators developed a global specification (EMV)             describing the technical and security          requirements for the physical card to terminal          environment, whilst other initiatives addressed contactless          opportunities and Internet Payment. This chapter looks into the technical and security details of the EMV specifications along with aspects of the additional security          in e-commerce and enhanced smart card-based authentication         .",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Ecosystems of Trusted Execution Environment on smartphones-a potentially bumpy road",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7886559/",
            "Abstract": "The advent of smartphones and the flexibility to have multiple applications serving the user's needs, has started a convergence of different services into a single device. Traditional services provided by mobile phones like voice and text communication became secondary to other domains like Online Social Network (OSN) and entertainment applications on smartphones. A similar trend is also happening for smart card services, in which traditional smart card services like banking, transport-ticketing and access control, are moving to smartphones. This transition from smart cards to smartphone is to a large extent, facilitated by Near Field Communication (NFC) technology which enables a smartphone to emulate a smart card. As the smart card services require a comparatively higher level of security than other applications on the smartphone. Initial proposals for this convergences were focused on secure elements …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:QndmRo8phpgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure Logging Mechanisms for Smart Cards",
            "Publication year": 2000,
            "Publication url": "http://www.ma.rhul.ac.uk/static/techrep/2001/RHUL-MA-2001-6.pdf",
            "Abstract": "!¢¡ 35©)(4¡ ecf gihyg v wyvjIda hqwqt prgihc qGg yg it wygi C tv vg wqf g hqtveg q prhqprCI tfv qprh mpxwy yf g dxdp jI C lp¤£ g wyg¦¥dxdujI v § ecf g qGqw7 ev ygihyg@ wygi px\" wqfvprh wqf gihqprh prhd wqf g ygihqtvdxwU IQqpx bpx kjIdk ygihygijI y yf ijI q qprgitvw 8@ 9© u'9hyg dr px 2 idxdj8vjIwqpr) qpxwqf2wqf g yhr qfvpxdrhqw© gvydxdrgi 2 px wqf gg ekjI qwug@ w\" I lm¤ jIwqf gujIwqpr ih\" jh7 j ijI pr jIwyg7wqf g7 vg b ygig\" I wy'I dfvpxdr bhyevf9 § ecfvprh qGqw¤ fkjhw 8gig W hqt8vupxwqwygis jI 9wqf gs vg b ygigl jiqcjI y¦ px jI 9wqf g tv vpx Sg yhqpxw9s gi t ijIwqprkjIdE gihqwvj8dxprhqfug@ w© §",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:RGFaLdJalmkC",
            "Publisher": "University of London"
        },
        {
            "Title": "An architecture to support multiple subscriber identity applications accessing multiple mobile telecommunication access network systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4682272/",
            "Abstract": "With the advances in smart card technology it is quite possible to support more than one type of subscriber identity applications on the same smart card. We propose an architecture capable of hosting multi faceted subscriber identity applications which exploits common functions and data in a secure partitioned manner. The associated security mechanisms are also defined in order to realise its implementation on a single smart card. Our proposed architecture provides a harmonised secure authentication environment. The architecture is extensible to platforms on mobile devices and secure tokens operating across diverse access interfaces. Furthermore, we propose a set of protocols for secure communications between terminal, control module and hosted subscriber identity applications.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A paradigm shift in smart card ownership model",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5476633/",
            "Abstract": "Smart cards have been proliferated into many aspects of modern life. Historically, the ownership of smart cards has remained with the smart card issuers. Although this ownership model is favored by a wide range of industries and service providers, it does not provide optimum convenience and flexibility to cardholders. One potential solution could be to shift the control of smart cards from the smart card issuers to the smart card users. In this paper, we will analyze the feasibility of an ownership model that delegates the ownership of a smart card to its user. The operational and security requirements of the proposed ownership model will be provided. In addition, principal research questions are identified that would merit further in-depth analysis to test the viability of this ownership model.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Practical Attacks on Virtual Worlds",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=tHK6CAAAQBAJ&oi=fnd&pg=PA180&dq=info:_Ci-BDwMsvQJ:scholar.google.com&ots=uB9kpkpY06&sig=14A2Q0-ytZgxXimqaK8ugXJ2D4I",
            "Abstract": "Virtual Worlds (VWs) are immensely popular online environments, where users interact in real-time via digital beings (avatars). However, a number of security issues affect VWs, and they are vulnerable to a range of attacks on their infrastructure and communications channels. Their powerful architecture can also be used to mount attacks against live Real World servers, by using malicious VW objects. Researching these attacks in commercial VWs would not be acceptable, as it would be contrary to the terms of conditions which govern acceptable behaviour in a particular VW. So in this paper, attacks were conducted/analysed in a laboratory-based test bed VW implementation developed specifically for the research, with custom built attack and analysis tools: commercial VWs were used for data gathering only. Results of these experiments are presented, and appropriate countermeasures proposed which could reduce the likelihood of the attacks succeeding in live VWs.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:5awf1xo2G04C",
            "Publisher": "Springer"
        },
        {
            "Title": "Remote credential management with mutual attestation for trusted execution environments",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20074-9_12",
            "Abstract": "Trusted Execution Environments (TEEs) are rapidly emerging as a root-of-trust for protecting sensitive applications and data using hardware-backed isolated worlds of execution. TEEs provide robust assurances regarding critical algorithm execution, tamper-resistant credential storage, and platform integrity using remote attestation. However, the challenge of remotely managing credentials between TEEs remains largely unaddressed in existing literature. In this work, we present novel protocols using mutual attestation for supporting four aspects of secure remote credential management with TEEs: backups, updates, migration, and revocation. The proposed protocols are agnostic to the underlying TEE implementation and subjected to formal verification using Scyther, which found no attacks.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:kVKjLOQJbwAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Preventing relay attacks in mobile transactions using infrared light",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3019612.3019794",
            "Abstract": "Near Field Technology (NFC) enables a smartphone to emulate a smart card, enabling it to provide services, like banking and transport ticketing. Similar to smart cards, NFC-based transactions are susceptible to relay attacks. Distance bounding protocols have been proposed for smart cards to counter relay attacks. However, this may not be effective in the field of mobile transactions, due to their requirement of high time-delay sensitivity and specialised hardware. A number of proposals are being put forward that show that sensing the natural ambient environment is an effective anti-relay mechanism. Existing literature neither involves a threat actor in their analysis nor they are in compliance with EMV's transaction requirement of 500ms. In this paper, we look at the anti-relay mechanism from a different point of view. Instead of measuring the natural ambience, we generate and measure a unique artificial ambient …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:00hq1xGbIBsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The mobile Java card grid project. e-Smart 2006",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=12273608310537242694&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Practical relay attack on contactless transactions by using nfc mobile phones",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=R2-ejFJEKyAC&oi=fnd&pg=PA21&dq=info:ZXo9q31S6OQJ:scholar.google.com&ots=cFgAwJs9jF&sig=Vc5r3dvH0lpvAHVr0nj6ZJBt2Tg",
            "Abstract": "Contactless technology is widely used in security sensitive applications, including identiﬁcation, payment and access-control systems. Near Field Communication (NFC) is a short-range contactless technology allowing mobile devices to act primarily as either a reader or a token. Relay attacks exploit the assumption that a contactless token within communication range is in close proximity, by placing a proxy-token in range of a contactless reader and relaying communication over a greater distance to a proxy-reader communicating with the authentic token. It has been theorised that NFC-enabled mobile phones could be used as a generic relay attack platform without any additional hardware, but this has not been successfully demonstrated in practice. We present the ﬁrst generic practical implementation of a contactless relay attack by using only NFC-enabled mobile phones, requiring only suitable mobile software applications. This implementation reduces the complexity of relay attacks and therefore has potential security implications for current contactless systems.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure application execution in mobile devices",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-49301-4_26",
            "Abstract": "Smart phones have rapidly become hand-held mobile devices capable of sustaining multiple applications. Some of these applications allow access to services including healthcare, financial, online social networks and are becoming common in the smart phone environment. From a security and privacy point of view, this seismic shift is creating new challenges, as the smart phone environment is becoming a suitable platform for security- and privacy-sensitive applications. The need for a strong security architecture for this environment is becoming paramount, especially from the point of view of Secure Application Execution (SAE). In this chapter, we explore SAE for applications on smart phone platforms, to ensure application execution is as expected by the application provider. Most of the proposed SAE proposals are based on having a secure and trusted embedded chip on the smart phone. Examples …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:W5xh706n7nkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Smart card security",
            "Publication year": 2007,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00113428/",
            "Abstract": "Archive ouverte HAL - Smart Card Security Accéder directement au contenu Accéder \ndirectement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste \ndes portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues \nDocumentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts \nPar type de publication Par discipline Par année de publication Par structure de recherche Les \nportails de l'archive Recherche Documentation hal-00113428, version 1 Chapitre d'ouvrage \nSmart Card Security Damien Sauveron 1 K. Markantonakis K. Mayes MJ Tunstall F. Piper Détails \n1 DMI XLIM - XLIM Type de document : Chapitre d'ouvrage Liste complète des métadonnées \nVoir https://hal.archives-ouvertes.fr/hal-00113428 Contributeur : Yolande Vieceli <> Soumis \nle : lundi 13 novembre 2006 - 14:20:48 Dernière modification le : jeudi 11 janvier 2018 - 06:…",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer SCI Series"
        },
        {
            "Title": "You can’t touch this: Consumer-centric android application repackaging detection",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X16301327",
            "Abstract": "Application repackaging is a widely used method for malware distribution, revenue stealing and piracy. Repackaged applications are modified versions of original applications, that can potentially target large audiences based on the original application’s popularity. In this paper, we propose an approach for detecting repackaged applications. Our approach takes advantage of the attacker’s reluctance to significantly alter the elements that characterise an application without notably impacting the application’s distribution. These elements include the application’s name and icon. The detection is initiated from the client side, prior to an application’s installation, making it application store agnostic. Our experimental results show that detection based on our algorithm is effective and efficient.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:2KloaMYe4IUC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Multi-application smart card platforms and operating systems",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-50500-8_3",
            "Abstract": "Although smart card technology has been available          for many decades, it is only in the last few years that smart cards have become widely considered as one of the most common secure computing devices. They are encountered in a number of applications (e.g. secure wireless access in mobile          networks, banking         , identification) satisfying a diverse range of uses. One of the fundamental factors contributing towards the success of smart card technology is tamper resistance. As the underlying smart card processing power increases at a constant pace, more and more functionality becomes available. It was soon realised that in order to grasp the full benefits of the underlying hardware, parallel advances in the corresponding smart card operating systems would be necessary. This chapter provides an overview of the most widely utilised smart card operating systems or platforms that enable multiple …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Physical Fault Injection and Side-Channel Attacks on Mobile Devices: A Comprehensive Survey",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.04454",
            "Abstract": "The past decade has seen the rapid deployment of mobile devices with densely packaged system-on-chips (SoCs) with multi-core, high-frequency CPUs and complex pipelines. In parallel, sophisticated SoC-assisted security mechanisms, such as trusted execution environments (TEEs), full-disk and file-based encryption, have also been deployed for protecting sensitive data. Both advancements have dramatically complicated the use of physical attacks, which has recently led to the development of specialised attack methods. In this survey, we consolidate recent developments in physical fault injections (FIAs) and side-channel attacks (SCAs) on modern mobile devices. In total, we comprehensively survey over 50 fault injection and side-channel attack papers published between 2009-2021. We evaluate the prevailing attack methods, compare existing attacks using a common framework, identify several challenges and shortcomings, and suggest future directions of research.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:X41XOdD1uaEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information Security Theory and Practices: Security and Privacy of Pervasive Systems and Smart Devices*",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer-Verlag New York Inc"
        },
        {
            "Title": "A dynamic and ubiquitous smart card security assurance and validation mechanism",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15257-3_15",
            "Abstract": "Smart cards have been deployed as trusted components in a wide range of industries. The basis of the trust on a smart card platform and applications is static and evaluated before the card issuance to cardholders. A dynamic and post-issuance security assurance and validation mechanism can be useful, but it is not considered necessary in the Issuer Centric Smart Card Ownership Model. However, in an open and dynamic smart card environment like the User Centric Smart Card Ownership Model, it is essential to have a mechanism that on request could provide assurance and validation of the implemented and evaluated security mechanisms. Such a framework is the focus of this paper.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Potential misuse of NFC enabled mobile phones with embedded security elements as contactless attack platforms",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5402513/",
            "Abstract": "In this paper we investigate the possibility that a Near Field Communication (NFC) enabled mobile phone, with an embedded Secure Element (SE), could be used as a mobile token cloning and skimming platform. We show how an attacker could use a NFC mobile phone as such an attack platform by exploiting the existing security controls of the embedded SE and the available contactless APIs. To illustrate the feasibility of these actions we also show how to practically skim and emulate certain tokens typically used in payment and access control applications with a NFC mobile phone. Although such attacks can also be implemented on other contactless platforms, such as custom-built card emulators and modified readers, the NFC-enabled mobile phone has a legitimate form factor, which would be accepted by merchants and arouse less suspicion in public. Finally, we propose several security countermeasures for …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "HB-MP+ Protocol: An Improvement on the HB-MP Protocol",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4519342/",
            "Abstract": "In this paper, we propose an enhanced version of the HB-MP authentication protocol, called the HB-MP +  protocol. The HB-MP protocol is a lightweight authentication protocol that is suitable for use in passive radio frequency identification (RFID) systems. The HB-MP +  protocol overcomes the man-in-the-middle attack to which the basic HB-MP protocol is vulnerable while maintaining its suitability to low-cost passive RFID systems. We show an effective man-in-the-middle attack against the HB-MP protocol where the attacker utilizes the predictable rotation of the secret key. We enhance the HB-MP protocol by randomizing the rotation of the secret key, which eliminates the vulnerability. We also propose the use of round keys that may be produced by rotation or, more generally, by a one-way function. We analyse the security and performance improvements of our HB-MP +  protocol and find it to be suitable for …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A brief comparison of NFC smart posters and quick response codes",
            "Publication year": 2012,
            "Publication url": "http://crisptelecom.com/files/nfcworld.pdf",
            "Abstract": "With the advances in mobile phone technology there is a lot of interest in being able to automatically access information or trigger a service by bringing the phone close to an object. One of the most obvious ideas is to use the phone camera to read and interpret a simple 1-Dimensional barcode, a capability which has subsequently been extended to deal with barcodes containing more information eg 2-Dimensional barcodes such as Quick Response codes (QR code)[1]. In parallel with the development of QR codes there has been significant advances in Near Field Communication (NFC)[2][3][4][5], which amongst other things allows a mobile phone to interact with Radio Frequency ID (RFID)[6] tags that may be attached to objects. The interaction is achieved simply by bringing the phone within a few cm of the NFC compatible RFID (which we will also refer to as an NFC tag in this paper). The availability of different technologies (optical and Radio Frequency) with overlapping service capabilities can cause some confusion for potential Service Providers (SP) and customers alike, and the wrong choice can affect system security, usability, cost and logistics. In this paper we briefly consider the technologies and their capabilities, and attempt to clarify their strengths and weaknesses. We begin by introducing QR codes and NFC tags before making service comparisons and finally offering some suggestions and conclusions.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personalised rail passenger experience and privacy",
            "Publication year": 2017,
            "Publication url": "https://eprints.soton.ac.uk/414982/",
            "Abstract": "In this article the authors discuss the implications of this data collection in terms of its potential benefits to the customer experience, its impact on passenger privacy, the information security risks to the industry from storing all this personal data as well as the need for data provenance and how anonymisation of data will impact its provenance and utility. It is imperative for the industry to look at the trade-offs between the need to store personal data to provide an improved customer service and the legal ramifications of doing so, especially in the light of the incoming General Data Protection Regulation (GDPR)[1](to be enacted in UK law by May 2018) which makes organisations liable for a substantial fine in the case of a serious data security breach. To help operators address these data protection and legal compliance issues, the authors provide a brief overview of existing privacy and security frameworks, standards and guidelines which can assist the industry in utilising a best practice and well-established approach.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:AdGrMoNItN4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pseudorandom number generation in smart cards: an implementation, performance and randomness analysis",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6208760/",
            "Abstract": "Smart cards rely on pseudorandom number generators to provide uniqueness and freshness in their cryptographic services i.e. encryption and digital signatures. Their implementations are kept proprietary by smart card manufacturers in order to remain competitive. In this paper we look at how these generators are implemented in general purpose computers. How architecture of such generators can be modified to suit the smart card environment. Six variations of this modified model were implemented in Java Card along with the analysis of their performance and randomness. To analyse the randomness of the implemented algorithms, the NIST statistical test suite is used. Finally, an overall analysis is provided, that is useful for smart card designers to make informed decisions when implementing pseudorandom number generators.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure log file download mechanisms for smart cards",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/10721064_27",
            "Abstract": "The necessity of auditing mechanisms for smart cards is currently under thorough investigation. Both current and future real world applications impose requirements which suggest the storage of sensitive information in log files. In this paper we present various applications that demonstrate the use of audit logs, justifying their practical advantages and disadvantages. We propose computationally practical methods for creating and maintaining such log files in the light of the limited memory of smart cards. We conclude with a brief discussion of design principles for future implementations and guidelines for further research.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "On the potential of high density smart cards",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=13423494273080089929&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Elsevier, Information Security Technical Report Vol11 No3"
        },
        {
            "Title": "Analysis of potential vulnerabilities in payment terminals",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-7915-4_13",
            "Abstract": "Payment systems fraud is considered in the center of several types of criminal activities. The introduction of robust payment standards, practices and procedures has undoubtedly reduced criminals’ profit, and significantly hardened their work. Still though, all payment systems’ components are constantly scrutinised to identify vulnerabilities. This chapter focuses on the security of payment terminals, as a critical component in a payment system’s infrastructure, providing an understanding on potential attacks identified in the literature. The attacks are not only limited to those aiming to insult terminals’ tamper-resistance characteristics but also include those that target weak procedures and practices aiming to facilitate the design of better systems, solutions and deployments.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:sSrBHYA8nusC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Improving Security of Autonomous UAVs Fleets by Using New Specific Embedded Secure Elements-A Position Paper",
            "Publication year": 2014,
            "Publication url": "http://damien.sauveron.fr/fileadmin/damiensauveron/publications/improving-security-autonomous-CameraReady14.pdf",
            "Abstract": "Unmanned Aerial Vehicles (UAVs) fleets are becoming more apparent in both military and civilian applications. However security of these systems still remains unsatisfactory if a strong adversary model is considered. The aim of this position paper is to draw requirements for this kind of adversaries and to propose theoretical solutions based on an embedded Secure Element (SE) that could help to accommodate these requirements.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A body-centered cubic method for key agreement in dynamic mobile ad hoc networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4622582/",
            "Abstract": "Mobile ad hoc networking is an operating mode for rapid mobile host interconnection, where nodes rely on each other, in order to maintain network connectivity and functionality. Security is one of the main issues for mobile ad hoc networks (MANETs) deployment. We introduce a weak to strong authentication mechanism associated with a multiparty contributory key agreement method, designed for dynamic changing topologies, where nodes arrive and depart from a MANET at will. We introduce a new cube algorithm based on the body-centered cubic (BCC) structure. The proposed system employs elliptic curve cryptography, which is more efficient for thin clients where processing power and energy are significant constraints. The algorithm is designed for MANETs with dynamic changing topologies due to continuous flow of incoming and departing nodes.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Good vibrations: artificial ambience-based relay attack detection",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8455943/",
            "Abstract": "Relay attacks are passive man in the middle attacks, aiming to extend the physical distance of devices involved in a transaction beyond their operating environment, within the restricted time-frame. In the field of smartphones, proposals have been put forward suggesting sensing the natural ambient environment as an effective Proximity and Relay Attack Detection (PRAD) mechanism. However, these proposals are not in compliance with industry imposed constraints (e.g. EMV and ITSO) mandating that transactions should complete within a certain time-frame (e.g. 500ms for EMV contactless transactions). The generation of an artificial ambient environment (AAE) using peripherals of the transaction devices has shown positive results when using infrared light as an AAE actuator. In this paper we propose the use of vibration as an alternative AAE actuator. We empirically evaluated the effectiveness of the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:gNZucvRojEcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Precise instruction-level side channel profiling of embedded processors",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-06320-1_11",
            "Abstract": "Since the first publication, side channel leakage has been widely used for the purposes of extracting secret information, such as cryptographic keys, from embedded devices. However, in a few instances it has been utilised for extracting other information about the internal state of a computing device. In this paper, we show how to create a precise instruction-level side channel leakage profile of an embedded processor. Using the profile we show how to extract executed instructions from the device’s leakage with high accuracy. In addition, we provide a comparison between several performance and recognition enhancement tools. Further, we also provide details of our lab setup and noise minimisation techniques, and suggest possible applications.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:1qzjygNMrQYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Smart Cards for Security and Assurance",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/smart-cards-security-assurance/25842",
            "Abstract": "When designing and implementing a system that handles sensitive or valuable information, there can be few discussions that do not include some reference to ensuring adequate security. At a strategic level there will be high level requirements for security that will safeguard the system, which must ultimately translate to practical solutions and physical implementations. This chapter focuses on the technical implementation of security requirements and, in particular, the use of smart cards as trusted security tokens. In particular, it examines the significance of tamper resistance by exploring the different hardware and software platforms in relation to smart card attacks. It also highlights certain issues around the deployment of smart card technology in the financial industry.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:qUcmZB5y_30C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A secure and trusted protocol for enhancing safety of on-ground airplanes using uavs",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8011986/",
            "Abstract": "This article consists of a collection of slides from the author's conference presentation. Some of the specific areas/topics discussed include: as shown UAVs (supervised by relevant authorities) can help to enhance the safety of aircraft and can help to minimize the AOG time: and we will extend the proposal to use UAVs as RFID readers to inventory and track items tagged with RFID both on board of aircraft along with those used in area of the airport (e.g. luggages, tools for maintenance).",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:N5XbD978G_MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the security issues of NFC enabled mobile phones",
            "Publication year": 2010,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJITST.2010.037408",
            "Abstract": "In this paper, we investigate the possibility that a Near Field Communication (NFC) enabled mobile phone, with an embedded secure element (SE), could be used as a mobile token cloning and skimming platform. We show how an attacker could use an NFC mobile phone as such an attack platform by exploiting the existing security controls of the embedded SE and the available contactless APIs. To illustrate the feasibility of these actions, we also show how to practically skim and emulate certain tokens typically used in payment and access control applications with a NFC mobile phone. We also discuss how to capture and analyse legitimate transaction information from contactless systems. Although such attacks can also be implemented on other contactless platforms, such as custom-built card emulators and modified readers, the NFC enabled mobile phone has a legitimate form factor, which would be accepted …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Binding hardware and software to prevent firmware modification and device counterfeiting",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2899015.2899029",
            "Abstract": "Embedded systems are small scale computing devices that are increasingly located in more of the items we use and own. The number of embedded systems in the world is increasing dramatically as the\" internet of things\" concept becomes more prevalent in the market. The value of the market for embedded systems is predicted to increase to being worth trillions of dollars by 2020. With great value in the embedded system market, there is a need for preventing unauthorised firmware tampering or product counterfeiting. Here is presented a technique for binding software to hardware instances that uses hardware intrinsic security properties of the devices being protected. The proposed technique provides assurance to manufacturers that only they can perform their hardware and software binding and create their products. Also presented is an FPGA implementation of the described scheme that binds the hardware …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web Server on a SIM card",
            "Publication year": 2010,
            "Publication url": "http://www.iaeng.org/publication/WCE2010/WCE2010_pp253-259.pdf",
            "Abstract": "In this paper we discuss the integration of a web server on a SIM card and we attempt an analysis from a security, management, operation and personalization perspective. A brief representation of the Smart Card Web Server (SCWS) will take place, along with a use case that will help the reader to identify the way that a SCWS can be used in practice, before we reach to a final conclusion.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A DLT-based Smart Contract Architecture for Atomic and Scalable Trading",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.02937",
            "Abstract": "Distributed Ledger Technology (DLT) has an enormous potential but also downsides. One downside of many DLT systems, such as blockchain, is their limited transaction throughput that hinders their adoption in many use cases (e.g., real-time payments). State channels have emerged as a potential solution to enhance throughput by allowing transactions to process off-chain. While current proposals can increase scalability, they require high collateral and lack support for dynamic systems that require asynchronous state transitions. Additionally, the latency of channel initialisations can cause issues especially if fast interactions are required. In this paper, we propose an atomic, scalable and privacy-preserving protocol that enables secure and dynamic updates. We develop a smart contract-based Credit-Note System (CNS) that allows participants to lock funds before a state channel initialisation, which enhances flexibility and efficiency. We formalise our model using the Universal Composability (UC) framework and demonstrate that it achieves the stated design goals of privacy, scalability, and atomicity. Moreover, we implement a dispute process in the state channel to counter availability attacks. Finally, we analyse the protocol in the context of an asynchronous smart grid-based marketplace.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:ZpfHopiqs50C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application management framework in user centric smart card ownership model",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-10838-9_3",
            "Abstract": "The predominant smart card ownership model is the issuer centric, and it has played a vital role in the proliferation of the technology. However, recent developments of multi-application smart card technology lead to new potential ownership models. One of the possible models is the User Centric Smart Card Ownership Model. In this model, the ownership is with smart card users. To support user’s ownership, we require a framework that can assist cardholders to manage applications on their smart cards. In this paper, we present such a framework for managing application securely on a smart card.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:SP6oXDckpogC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An Introduction to Java Card Programming",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-7915-4_22",
            "Abstract": "Java Cards support a Java virtual machine that interprets code written in a subset of Java language. This may help programmers with prior knowledge of Java language to program smart cards. However, the programming paradigm of Java Card can be articulated as somewhat different than traditional Java programming. In this chapter, we will provide an introduction to smart card programming using Java Card and the subtleties of a restricted environment on application design.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:vRqMK49ujn8C",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Temporally Aware Behaviour-Based Security in Smart Cards Computational Intelligence and Security",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tag group authentication using bit-collisions",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6320447/",
            "Abstract": "Secure RFID systems should be able to authenticate individual tags to prevent genuine items from being replaced with forgeries. Conventional authentication protocols would require some form of challenge-response exchange with each individual tag. The extra transaction time needed to authenticate each individual tag sequentially might not be practically feasible, especially when readers are required to process an ever increasing volume of tagged items within a limited time. Our proposal works towards an approach that allows for multiple tags in a group to be authenticated simultaneously, as all the tags transmit their responses to a single challenge at the same time. This results in a controlled bit-collision pattern that can be used to verify that all the individual tags in a group are present and genuine.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security, Privacy and Safety Evaluation of Dynamic and Static Fleets of Drones",
            "Publication year": 2017,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2017arXiv170805732N/abstract",
            "Abstract": "Inter-connected objects, either via public or private networks are the near future of modern societies. Such inter-connected objects are referred to as Internet-of-Things (IoT) and/or Cyber-Physical Systems (CPS). One example of such a system is based on Unmanned Aerial Vehicles (UAVs). The fleet of such vehicles are prophesied to take on multiple roles involving mundane to high-sensitive, such as, prompt pizza or shopping deliveries to your homes to battlefield deployment for reconnaissance and combat missions. Drones, as we refer to UAVs in this paper, either can operate individually (solo missions) or part of a fleet (group missions), with and without constant connection with the base station. The base station acts as the command centre to manage the activities of the drones. However, an independent, localised and effective fleet control is required, potentially based on swarm intelligence, for the reasons: 1 …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:8EvVLpklxGMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure improved cloud-based RFID authentication protocol",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-17016-9_10",
            "Abstract": "Although Radio Frequency IDentification (RFID) systems promise a fruitful future, security and privacy concerns have affected the adoption of the RFID technology. Several studies have been proposed to tackle the RFID security and privacy concerns under the assumption that the server is secure. In this paper, we assume that the server resides in the cloud that might be insecure, thus the tag’s data might be prone to privacy invasion and attacks. Xie et al. proposed a new scheme called “cloud-based RFID authentication”, which aimed to address the security and privacy concerns of RFID tag’s data in the cloud. In this paper, we showed that the Xie et al. protocol is vulnerable to reader impersonation attacks, location tracking and tag’s data privacy invasion. Hence, we proposed a new protocol that guarantees that the tag’s data in the cloud are anonymous, and cannot be compromised. Furthermore, the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Extending emv tokenised payments to offline-environments",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7846978/",
            "Abstract": "Tokenisation has been adopted by the payment industry as a method to prevent Personal Account Number (PAN) compromise in EMV (Europay MasterCard Visa) transactions. The current architecture specified in EMV tokenisation requires online connectivity during transactions. However, it is not always possible to have online connectivity. We identify three main scenarios where fully offline transaction capability is considered to be beneficial for both merchants and consumers. Scenarios include making purchases in locations without online connectivity, when a reliable connection is not guaranteed, and when it is cheaper to carry out offline transactions due to higher communication/payment processing costs involved in online approvals. In this study, an offline contactless mobile payment protocol based on EMV tokenisation is proposed. The aim of the protocol is to address the challenge of providing secure offline …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:3UHJKpZgG5wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Emlog: tamper-resistant system logging for constrained devices with tees",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-93524-9_5",
            "Abstract": "Remote mobile and embedded devices are used to deliver increasingly impactful services, such as medical rehabilitation and assistive technologies. Secure system logging is beneficial in these scenarios to aid audit and forensic investigations particularly if devices bring harm to end-users. Logs should be tamper-resistant in storage, during execution, and when retrieved by a trusted remote verifier. In recent years, Trusted Execution Environments (TEEs) have emerged as the go-to root of trust on constrained devices for isolated execution of sensitive applications. Existing TEE-based logging systems, however, focus largely on protecting server-side logs and offer little protection to constrained source devices. In this paper, we introduce EmLog – a tamper-resistant logging system for constrained devices using the GlobalPlatform TEE. EmLog provides protection against complex software adversaries and …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:0dtNEdnCFDAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "E-voting with Blockchain: an e-voting protocol with decentralisation and voter privacy",
            "Publication year": 2018,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2018arXiv180510258S/abstract",
            "Abstract": "Technology has positive impacts on many aspects of our social life. Designing a 24hour globally connected architecture enables ease of access to a variety of resources and services. Furthermore, technology like Internet has been a fertile ground for innovation and creativity. One of such disruptive innovation is blockchain--a keystone of cryptocurrencies. The blockchain technology is presented as a game changer for many of the existing and emerging technologies/services. With its immutability property and decentralised architecture, it is taking centre stage in many services as an equalisation factor to the current parity between consumers and large corporations/governments. One of such potential applications of the blockchain is in e-voting schemes. The objective of such a scheme would be to provide a decentralised architecture to run and support a voting scheme that is open, fair and independently verifiable …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:6_6x9JMR98MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information Security Theory and Practices. Smart Devices, Convergence and Next Generation Networks: Second IFIP WG 11.2 International Workshop, WISTP 2008, Seville, Spain, May 13-16, 2008",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=hZ1uCQAAQBAJ&oi=fnd&pg=PR3&dq=info:ZhM1LiZQgQcJ:scholar.google.com&ots=Xqv3W4S6y7&sig=KOX_xECitFoRxJz1Yh2LsGSSG7Y",
            "Abstract": "With the rapid development of information technologies and the transition to next-generation networks, computer systems and in particular embedded s-tems are becoming more and more mobile and ubiquitous. They also strongly interact with the physical world. Ensuring the security of these complex and resource-constrained systems is a really challenging research topic. Therefore this Workshop in Information Security Theory and Practices was organized to bring together researchers and practitioners in related areas, and to encourage cooperation between the research and the industrial communities. This was the second edition of WISTP, after the? rst event in Heraklion, Greece, in 2007. This year again we had a signi? cant number of high-quality submissions coming from many di? erent countries. These submissions re? ected the major topics of the conference, ie, smart devices, convergence, and ne-generation networks. Submissions were reviewed by at least three reviewers, in most cases by four, and at least by? ve for the papers involving Program C-mittee members. This long and rigorousprocess could be achievedthanks to the hard work of the Program Committee members and additional reviewers, listed in the following pages. This led to the selection of high-quality papers that made up the workshop program and are published in these proceedings. A number of posters and short papers were also selected for presentation at the conference. The process was very selective and we would like to thank all those authors who submitted contributions that could not be selected.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer"
        },
        {
            "Title": "Smart Cards: Communication Protocols and Applications",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781118256107.ch16",
            "Abstract": "This chapter contains sections titled:   Introduction   Communication Protocols   Interfacing with Smart Card Applications   Managing Multiple Applications   Application Security   Conclusion   Glossary   Cross References  IntroductionCommunication ProtocolsInterfacing with Smart Card ApplicationsManaging Multiple ApplicationsApplication SecurityConclusionGlossaryCross References",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:bEWYMUwI8FkC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Evaluation of Apple iDevice sensors as a potential relay attack countermeasure for Apple Pay",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3055186.3055201",
            "Abstract": "Traditional countermeasures to relay attacks are difficult to implement on mobile devices due to hardware limitations. Establishing proximity of a payment device and terminal is the central notion of most relay attack countermeasures, and mobile devices offer new and exciting possibilities in this area of research. One such possibility is the use of on-board sensors to measure ambient data at both the payment device and terminal, with a comparison made to ascertain whether the device and terminal are in close proximity. This project focuses on the iPhone, specifically the iPhone 6S, and the potential use of its sensors to both establish proximity to a payment terminal and protect Apple Pay against relay attacks. The iPhone contains 12 sensors in total, but constraints introduced by payment schemes mean only 5 were deemed suitable to be used for this study. A series of mock transactions and relay attack attempts are …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:ZbXHRDTBJTgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Secure Channel protocol for multi-application smart cards based on public key cryptography",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-24486-7_6",
            "Abstract": "Smart card secure channel protocols based on public key cryptography are not widely utilised mainly due to processing overheads introduced in the underlying smart card microprocessors and the complexities introduced by the operation of a PKI infrastructure. In this paper we analyse the significance of public key secure channel protocols in multi-application smart cards. We believe that multi-application smart card technology (e.g. the GlobalPlatform smart card specification) should benefit more from the advantages of public key cryptography specifically for the initiation and maintenance of a secure channel. This paper introduces a public key based cryptographic protocol for secure entity authentication, data integrity and data confidentiality. The proposed secure channel protocol uses a combination of public key, secret key and the main idea behind the Diffie-Hellman key establishment protocols in order …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Security and resilience for smart devices and applications",
            "Publication year": 2014,
            "Publication url": "https://jwcn-eurasipjournals.springeropen.com/articles/10.1186/1687-1499-2014-123",
            "Abstract": "Recent advances in development of wireless communication technologies and embedded computing systems led us into the area of the next generation wireless networks and smart devices. In this context, it is widely argued that security has become a primary concern, in order to ensure dependable, secure communications and services to the end user. There are many open questions for these challenging issues such as security of protocols and applications, secure architecture, frameworks and methodologies for next generation wireless networks and respective smart devices.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:olpn-zPbct0C",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "P2PEdge: A Decentralised, Scalable P2P Architecture for Energy Trading in Real-Time. Energies 2021, 14, 606",
            "Publication year": 2021,
            "Publication url": "https://search.proquest.com/openview/bef7d8df1239ff19472fb803a9fa642d/1?pq-origsite=gscholar&cbl=2032402",
            "Abstract": "Current Peer-to-Peer (P2P) energy market models raise serious concerns regarding the confidentiality and integrity of energy consumption, trading and billing data. While Distributed Ledger Technology (DLT) systems (eg, blockchain) have been proposed to enhance security, an attacker could damage other parts of the model, such as its infrastructure: an adversarial attacker could target the communication between entities by, eg, eavesdropping or modifying data. The main goal of this paper is to propose a model for a decentralised P2P marketplace for trading energy, which addresses the problem of developing security and privacy-aware environments. Additionally, a Multi-Agent System (MAS) architecture is presented with a focus on security and sustainability. In order to propose a solution to DLT’s scalability issues (ie, through transaction confirmation delays), off-chain state channels are considered for the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:BzPC9jo9PWgC",
            "Publisher": "s Note: MDPI stays neu-tral with regard to jurisdictional clai-ms in published maps and institutio-nal affiliations."
        },
        {
            "Title": "Smart Cards",
            "Publication year": 2010,
            "Publication url": "https://research-information.bris.ac.uk/en/publications/smart-cards",
            "Abstract": "Smart Cards — University of Bristol Skip to main navigation Skip to search Skip to main content \nUniversity of Bristol Logo Help & Terms of Use Home Profiles Research Units Research \nOutputs Projects Student theses Datasets Activities Prizes Facilities/Equipment Search by \nexpertise, name or affiliation Smart Cards Konstantinos Markantonakis, Keith Mayes, Damien \nSauveron, Michael Tunstall Department of Computer Science Cryptography and Information \nSecurity Research output: Chapter in Book/Report/Conference proceeding › Chapter in a book \nOverview Translated title of the contribution Smart Cards Original language English Title of host \npublication Handbook of Technology Management Publisher Wiley Pages 248-264 Volume \n2 Publication status Published - 2010 Bibliographical note Other page information: 248-264 \nOther identifier: 2001133 Access to Document http://www.cs.bris.ac.uk/Publications/.jsp?id…",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:vkDViGfkvYEC",
            "Publisher": "Wiley"
        },
        {
            "Title": "Application management framework in user centric smart card ownership model",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-10838-9_3",
            "Abstract": "The predominant smart card ownership model is the issuer centric, and it has played a vital role in the proliferation of the technology. However, recent developments of multi-application smart card technology lead to new potential ownership models. One of the possible models is the User Centric Smart Card Ownership Model. In this model, the ownership is with smart card users. To support user’s ownership, we require a framework that can assist cardholders to manage applications on their smart cards. In this paper, we present such a framework for managing application securely on a smart card.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An introduction to smart cards and rfids",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-7915-4_1",
            "Abstract": " Security systems often include specialised modules that are used to build the foundations of attack-resistant security. One of the most common modules has been the smart card; however, there are often misconceptions about the definition of the smart card and related technologies, such as Radio Frequency Identification (RFID), as well as the requirement and justification for using them in the first place. These misconceptions are fuelled by the ever evolving nature of applications, security technology, personal devices and the growing threats that they must deal with. There is also a question of whether smart cards/RFIDs should really be in a book about embedded security, but we will see that the “embedded” aspect is growing ever stronger especially with developments in the mobile phone area. This chapter will consider a range of smart cards and RFIDs, and associated applications. It will also briefly cover …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Practical relay attack on contactless transactions by using NFC mobile phones",
            "Publication year": 2011,
            "Publication url": "https://eprint.iacr.org/2011/618",
            "Abstract": "Contactless technology is widely used in security sensitive applications, including identification, payment and access-control systems. Near Field Communication (NFC) is a short-range contactless technology allowing mobile devices to act primarily as either a reader or a token. Relay attacks exploit the assumption that a contactless token within communication range is in close proximity, by placing a proxy-token in range of a contactless reader and relaying communication over a greater distance to a proxy-reader communicating with the authentic token. It has been theorised that NFC-enabled mobile phones could be used as a generic relay attack platform without any additional hardware, but this has not been successfully demonstrated in practice. We present a practical implementation of an NFC-enabled relay attack, requiring only suitable mobile software applications. This implementation reduces the complexity of relay attacks and therefore has potential security implications for current contactless systems. We also discuss countermeasures to mitigate the attack.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:KVXOKlNwS8oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing the Conditional Access Module Security in Light of Smart Card Sharing Attacks",
            "Publication year": 2008,
            "Publication url": "https://www.oocities.org/mike.tunstall/presentation/EnhancingtheConditionalAccessModule.pdf",
            "Abstract": "Research Topics and Interests Page 1 Dr Konstantinos Markantonakis (BSc, MSc, MBA, PhD) \nK.Markantonakis@rhul.ac.uk http://www.markantonakis.eu Tel: +44(0)1784-414409 Information \nSecurity Group Smart Card Centre http://www.scc.rhul.ac.uk Enhancing the Conditional Access \nModule Security in Light of Smart Card Sharing Attacks Konstantinos Markantonakis, Michael \nTunstall, Keith Mayes Page 2 Agenda • Introducing the ISG and SCC • What is all about? • \nContent provision in the Sat TV Industry • A Changing World • Open Receivers and Threats • \nAssumptions • Notation • Enhanced CW Transfer Between CAM and Card • Security Analysis • \nConclusions Page 3 The ISG Smart Card Centre • Information Security Group – Royal \nHolloway, University of London, Egham, Surrey, UK – 14 full-time staff, 40 Phds, 200 Msc/Year \n– Taught by experts from industry and academia • Smart Card Centre – Founded in • , • (…",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:OC7j4ufeY2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimistic fair-exchange with anonymity for bitcoin users",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6982058/",
            "Abstract": "Fair-exchange and anonymity are two important attributes in e-commerce. It is much more difficult to expect fairness in e-commerce transactions using Bit coin due to anonymity and transaction irreversibility. Genuine consumers and merchants who would like to make and receive payments using Bit coin may be reluctant to do so due to this uncertainty. The proposed protocol guarantees strong-fairness while preserving anonymity of the consumer and the merchant, using Bit coin as a payment method which addresses the aforementioned concern. The involvement of the trusted third party (TTP) is kept to a minimum, which makes the protocol optimistic and the exchanged product is not revealed to TTP. It achieves dispute resolution within the protocol run without any intervention of an external judge. Finally we show how the protocol can be easily adapted to use other digital cash systems designed using public …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recovering from a lost digital wallet: A smart cards perspective extended abstract",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S157411921500125X",
            "Abstract": "Multi-application smart cards enable a user to potentially have a diverse set of applications on her smart card. The growing trend of services convergence fuelled by Near Field Communication and smart phones has made multi-application smart cards a tangible reality. In such an environment, cardholders might have a number of applications on their smart cards and if a card is lost, all of the applications would be lost with it. In addition, consumers might decide to upgrade their smart cards and require a seamless and secure framework to migrate their applications from the old smart card to the new one. Currently, the recovery of a smart card-based service might take from a day to a week at best as each of the lost cards can only be replaced by the respective card issuer, during which time the card issuer might lose business from the user because she is not able to access the provisioned services. Similarly, there is at …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Remote attestation mechanism for user centric smart cards using pseudorandom number generators",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-02726-5_12",
            "Abstract": "User Centric Smart Card Ownership Model (UCOM) gives the “freedom of choice” of respective applications to the smart card users. The user-centric architecture requires a trusted entity to be present on the smart card to provide security assurance and validation to the requesting application providers. In this paper, we propose the inclusion of a trusted computing platform for smart cards that we refer as the Trusted Environment & Execution Manager (TEM). This is followed by the rationale behind the changes to the traditional smart card architecture to accommodate the remote security assurance and validation mechanism. We propose an attestation protocol that provides an on-demand security validation of a smart card by its respective manufacturer. Finally, the attestation protocol is informally analysed, and its test implementation and performance measurements are presented.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:8AbLer7MMksC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A practical fair-exchange e-payment protocol for anonymous purchase and physical delivery",
            "Publication year": 2006,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/aiccsa/2006/01618453/12OmNywfKJU",
            "Abstract": "Consider a team of mobile agents monitoring large areas, eg in the ocean or the atmosphere, with limited sensing resources. Only the leader transmits information to other agents, and the leader has a role to monitor battery levels of all other agents. Every now and then, the leader commands all other agents to move toward or away from the leader with speeds proportional to their battery levels. The leader then simultaneously estimates the battery levels of all other agents from measurements of the relative distances between the leader and other agents. We propose a nonlinear system model that integrates a particle motion model and a dynamic battery model that has demonstrated high accuracy in battery capacity prediction. The extended Kalman filter (EKF) is applied to this nonlinear model to estimate the battery level of each agent. We improve the EKF so that, in addition to gain optimization embedded in the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "A novel consumer-centric card management architecture and potential security issues",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:PELIpwtuRlgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Location tracking using smartphone accelerometer and magnetometer traces",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3339252.3340518",
            "Abstract": "We demonstrate a breach in smartphone location privacy through the accelerometer and magnetometer's footprints. The merits or otherwise of explicitly permissioned location sensors are not the point of this paper. Instead, our proposition is that other non-location-sensitive sensors can track users accurately when the users are in motion, as in travelling on public transport, such as trains, buses, and taxis. Through field trials, we provide evidence that high accuracy location tracking can be achieved even via non-location-sensitive sensors for which no access authorisation is required from users on a smartphone.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:Sw8WaQuuSIgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Considerations for mobile authentication in the Cloud",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1363412711000604",
            "Abstract": "The Cloud promises significant benefits and opportunities for key players in the mobile communication industry as well as the end users. However, along with these opportunities comes a plethora of security issues including potential attacks, identity authentication, personal data management and privacy. There are issues with the use of legacy security mechanisms and interoperability of the various Smartphone platforms as well as the virtualisation products that are meant to assist with Smartphone security and stability. This paper first considers the general security concerns and how a Subscriber Identity Module-based security framework could be used. It goes on to introduce Smartphone virtualisation and proposes a framework for comparing product capabilities. Finally, use cases are discussed related to personal data security, including data on removable components.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Smart cards: State-of-the-art to future directions",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6781871/",
            "Abstract": "The evolution of smart card technology provides an interesting case study of the relationship and interactions between security and business requirements. This paper maps out the milestones for smart card technology, discussing at each step the opportunities and challenges. The paper reviews recently proposed innovative ownership/management models and the security challenges associated with them. The paper concludes with a discussion of possible future directions for the technology, and the challenges these present.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design, installation and execution of a security agent for mobile stations",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11733447_1",
            "Abstract": "In this paper we present a methodology and protocol for establishing a security context between a Mobile Operator’s application server and a GSM/UMTS SIM card. The methodology assumes that the already issued Mobile Station is capable but unprepared. The proposed scheme creates a secure entity within the Mobile Station “Over The Air” (OTA). This secure entity can then be used for subsequent SIM authentications enabling m-Commerce, DRM or web service applications. To validate our proposal we have developed a proof of concept model to install and execute the security context using readily available J2ME, Java Card, J2SE and J2EE platforms, with the KToolBar MIDP2.0 emulator tool from Sun, and a Gemplus Java Card.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Smart Cards, Tokens, and Applications",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=5531427015918164163&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:p2g8aNsByqUC",
            "Publisher": "University of London, UK"
        },
        {
            "Title": "Using the smart card web server in secure branchless banking",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38631-2_19",
            "Abstract": "In remote areas of developing countries, the mobile phone network may be the only connection with outside organizations such as banks. SMS messages are used in branchless banking schemes such as M-PESA in Kenya, but can be vulnerable to SMS spoofing exploits. This paper proposes a branchless banking system for withdrawal, deposit and transfer transactions, using an application on the phone’s tamper-resistant Subscriber Identity Module (SIM) equipped with a Smart Card Web Server (SCWS) and public key cryptography capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Removing epoxy underfill between neighbouring components using acid for component chip-off",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1742287618302767",
            "Abstract": "In addition to traditional high temperature eutectic soldering, the use of underfill epoxy to glue the electronic components to the PCB (memory, CPU, cryptographic chips) has now become the norm among mobile phone manufacturers, e.g. Apple, BlackBerry and Samsung. Currently, this technique is the best solution to protect components against various mechanical stresses and improve reliability. Unfortunately, traditional techniques (chip-off or lapping) have become impossible to apply to underfilled components without destroying them or without moving peripheral electronic components. These component movements make the board unusable or require many hours of expensive repairs and specific hardware.Acids and their use can be of interest in the digital forensics domain. Firstly, they can be used to de-capsulate the packaging of the electronic components before reading the chip (physical dump by chip-on …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:8moDcb_GFzgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Verifying software integrity in embedded systems: A side channel approach",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-10175-0_18",
            "Abstract": "In the last few decades embedded processors have invaded the modern lifestyle. Embedded systems have hardware and software components. Assuring the integrity of the software is very important as it is the component that controls what the hardware does through its instructions. Although there exist a number of software integrity verification techniques, they often fail to work in embedded environment. One main reason is, the memory read protection, frequently implemented in today’s microprocessors, that prevent the verifier from reading out the necessary software parts. In this paper we show that side channel leakage (power consumption) can be used to verify the integrity of the software component without prior knowledge of the software code. Our approach uses instruction-level power consumption templates to extract information about executed instructions by the processor. Then this information …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Secure and trusted application execution on embedded devices",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-27179-8_1",
            "Abstract": "Embedded devices have permeated into our daily lives and significant day-to-day mundane tasks involve a number of embedded systems. These include smart cards, sensors in vehicles and industrial automation systems. Satisfying the requirements for trusted, reliable and secure embedded devices is more vital than ever before. This urgency is also strengthened further by the potential advent of the Internet of Things and Cyber-Physical Systems. As our reliance on these devices is increasing, the significance of potential threats should not be underestimated, especially as a number of embedded devices are built to operate in malicious environments, where they might be in the possession of an attacker. The challenge to build secure and trusted embedded devices is paramount. In this paper, we examine the security threats to embedded devices along with the associated prevention mechanisms. We …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A comparative analysis of common threats, vulnerabilities, attacks and countermeasures within smart card and wireless sensor network node technologies",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72354-7_14",
            "Abstract": "A threat analysis framework and methodology was developed by the authors to catalogue threats, vulnerabilities, attacks and countermeasures for smart cards (contact and contactless) and wireless sensor network node technologies. The goal of this research was to determine “Security Lessons” learned from the world of smart cards that may be applied to wireless sensor network nodes and vice versa.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:Se3iqnhoufwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Nfc security threats",
            "Publication year": 2010,
            "Publication url": "http://www.crisptelecom.com/files/nfcthreat.pdf",
            "Abstract": "Near Field Communication is undoubtedly an interesting technology that can open the way to new applications for the benefit of users and service providers. Most anticipated services involve some aspect of security and privacy protection and so it is important that NFC systems provide adequate protection to sensitive data, functionality and communications. In this paper we discuss the security challenges posed by the current Security Element (SE) hardware architectures within the mobile device, SE ownership and management issues and reliance on the radio interface. Furthermore we discuss how NFC may become a favoured tool for attackers and illustrate this by means of a practical example.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the potential of high density smart cards",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S136341270600032X",
            "Abstract": "It is generally accepted that we live in a time of rapid change. Many advances are due to the introduction of new technologies that not only bring new opportunities but also can have a profound effect on human behaviours. Technology is always advancing steadily, but every so often there is evidence of a momentous leap forward. In fact this report is produced courtesy of a laptop, mobile phone and the Internet, i.e. powerful technologies that we regard as essential to modern life yet would have been considered science fiction only 30 years earlier. This “information technology” has empowered individuals like never before, however, it is indiscriminate and works just as well for those with good or bad intentions. Therefore, to safeguard the good from the bad, the field of Information Security was born. Information Security has been steadily evolving and has developed special technologies of its own to use in the fight to …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "An Efficient, Secure and Trusted Channel Protocol for Avionics Wireless Networks",
            "Publication year": 2016,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2016arXiv160804116N/abstract",
            "Abstract": "Avionics networks rely on a set of stringent reliability and safety requirements. In existing deployments, these networks are based on a wired technology, which supports these requirements. Furthermore, this technology simplifies the security management of the network since certain assumptions can be safely made, including the inability of an attacker to access the network, and the fact that it is almost impossible for an attacker to introduce a node into the network. The proposal for Avionics Wireless Networks (AWNs), currently under development by multiple aerospace working groups, promises a reduction in the complexity of electrical wiring harness design and fabrication, a reduction in the total weight of wires, increased customization possibilities, and the capacity to monitor otherwise inaccessible moving or rotating aircraft parts such as landing gear and some sections of the aircraft engines. While providing …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:YIdQ7BAI8VoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transport ticketing security and fraud controls",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1363412709000193",
            "Abstract": "For many years, public transportation systems have been an essential part of day-to-day life and so the principle of needing a “ticket” has been familiar to generations of travellers. However as technology has advanced it has become possible to make use of electronic tickets that have significant advantages both for travellers and for the transport system operators. There has been a lot of recent publicity regarding weaknesses in some electronic ticket solutions; which whilst based on some solid facts tend to suggest that transport ticket security and fraud control is primarily a smart card/RFID technology issue. However this cannot be the case as systems exist that do not use such technology; or use it along side legacy systems. This paper will consider technology problems, but will first establish the bigger picture of transport ticketing and will finally make suggestions for future evolution of such systems.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Information security best practices",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-7915-4_6",
            "Abstract": "We are increasingly reliant on the use of IT systems in our normal day- to-day business and personal activities. It is of paramount importance that these systems are sufficiently secure to protect sensitive, valuable and private data, and associated storage, communications and transactions. Therefore, the design and use of such systems should be in accordance with best practices for information security that have been developed by industry, government and the worldwide expert community. This chapter emphasises the need for system security and goes on to explain technical choices such as algorithms, key size and trust management, and concludes with a real-world case study.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Avatar Voting in Virtual Worlds",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6841982/",
            "Abstract": "Virtual Worlds (VWs) are persistent, immersive digital environments where users interact in online communities via avatars. Voting on VW issues is currently done outside the VW environment, as constant monitoring of avatar activities means the privacy of in-world voting cannot be guaranteed. This paper proposes a VW voting method using remote code voting processes situated in a Trusted Secure Layer external to the VW infrastructure, in conjunction with Vote Code Lists sent to a mobile phone application. This approach allows virtual votes to be cast privately and reliably even in a range of attack scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Countermeasures for attacks on satellite tv cards using open receivers",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.59.4465&rep=rep1&type=pdf",
            "Abstract": "Digital content providers seek to restrict usage by implementing conditional access. One such scenario is the security aspects of digital video broadcast (DVB-S). There has been a history of attacks on this technology to circumvent any security measures and some techniques have been countered by the deployment of customised/provider specific receivers. However, this leads to less choice and the duplication of equipment at the customer level. Open satellite receivers have been introduced to allow a single user to access several different services from a single piece of receiver equipment. These boxes provide a highly configurable environment with software emulations of conditional access systems that is open to abuse. The internet has allowed communities with in-depth expertise to grow up around open receiver equipment; effectively communicating attack methods as they evolve. A new level of emerging attack is a card sharing by which one legitimate user colludes to provide protected content to a larger group of illegitimate users. In this paper we propose countermeasures to protect DVB-S content against this species of attack by enforcing behavioural contracts and correct usage guidelines within the smart card. 1",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security and Performance Comparison of Different Secure Channel Protocols for Avionics Wireless Networks",
            "Publication year": 2016,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2016arXiv160804115N/abstract",
            "Abstract": "The notion of Integrated Modular Avionics (IMA) refers to inter-connected pieces of avionics equipment supported by a wired technology, with stringent reliability and safety requirements. If the inter-connecting wires are physically secured so that a malicious user cannot access them directly, then this enforces (at least partially) the security of the network. However, substituting the wired network with a wireless network-which in this context is referred to as an Avionics Wireless Network (AWN)-brings a number of new challenges related to assurance, reliability, and security. The AWN thus has to ensure that it provides at least the required security and safety levels offered by the equivalent wired network. Providing a wired-equivalent security for a communication channel requires the setting up of a strong, secure (encrypted) channel between the entities that are connected to the AWN. In this paper, we propose three …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:ipSP0SfFaZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ensuring secure application execution and platform-specific execution in embedded devices",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3284361",
            "Abstract": "The Internet of Things (IoT) is expanding at a large rate, with devices found in commercial and domestic settings from industrial sensors to home appliances. However, as the IoT market grows, so does the number of attacks made against it with some reports claiming an increase of 600% in 2017. This work seeks to prevent code replacement, injection, and exploitation attacks by ensuring correct and platform specific application execution. This combines two previously studied problems: secure application execution and binding hardware and software. We present descriptions of both problems and requirements for ensuring both simultaneously. We then propose a scheme extending previous work that meets these requirements, and describe our implementation of the soft-core Secure Execution Processor developed and tested on Xilinx Spartan-6 FPGA. Finally, we analyse the scheme and our implementation …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:BSZS1fLCB98C",
            "Publisher": "ACM"
        },
        {
            "Title": "Authentication based on a changeable biometric using gesture recognition with the Kinect™",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7139073/",
            "Abstract": "Biometric systems either use physiological or behavioural characteristics to identify an individual. However, if a biometric is compromised it could be difficult or impossible to change it. This paper proposes a biometric authentication system based on gesture recognition, where gestures can be easily changed by the user. The system uses a Kinect™ device to capture and extract features, as it provides 20 skeleton tracking points: we use just six of these in our system. The Dynamic Time Warping (DTW) algorithm is used to find an optimal alignment between gestures which are time-bound sequences. We tested the system on a sample of 38 volunteers. Ten volunteers provided reference gestures of their own design and 28 volunteers attempted to attack these reference gestures by both guessing and copying. Guessing the gesture was unsuccessful in all cases, but when the attacker had previously seen a video of the …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:ye4kPcJQO24C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Collaborative and ubiquitous consumer oriented trusted service manager",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7011281/",
            "Abstract": "Near Field Communication (NFC) enables a mobile phone to emulate a contactless smart card. This has reinvigorated the multiapplication smart card initiative. Trusted Service Manager (TSM) is an entity that is trusted by all stakeholders in the proposed and trialled NFC-based smart card ecosystem. However, TSM-based models have the potential to create market segregation that might lead to limited or slow adoption. In addition, all major stakeholders (e.g. Telecom and banks) are pushing for their own TSM models and this might hinder deployment. In this paper we present a Collaborative and Ubiquitous Consumer Oriented Trusted Service Manager (CO-TSM) based model that combines different TSM models while providing scalability to the overall architecture. In addition, our proposal also provides flexibility to both consumers and application providers. To support our proposal, we present a core architecture …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile Communication Security Controllers",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-7915-4_10",
            "Abstract": "Cellular communication via a traditional mobile handset is a ubiquitous part of modern life and as device technology and network performance continues to advance, it becomes possible for laptop computers, Personal Digital Assistants (PDAs) and even electrical meters to better exploit mobile networks for wireless communication. As the diverse demands for network access and value added services increase, so does the importance of maintaining secure and consistent access controls. A critical and well-proven component of the Global System for Mobile Communications (GSM) and Universal Mobile Telecommunications System (UMTS) security solution is the smart card in the form of the Subscriber Identity Module (SIM) or USIM, respectively. However, with the enlarged range of communications devices, some manufacturers claim that the hardware selection, chip design, operating system implementation …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Smart Card based authentication-Any future?",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10026179795/",
            "Abstract": "CiNii 論文 - Smart card based authentication-Any future? CiNii 国立情報学研究所 学術情報\nナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規\n登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 \n刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の\n再開について Smart card based authentication-Any future? MAYES K. 被引用文献: 1件 著者 \nMAYES K. 収録刊行物 Comput. Secur. Comput. Secur. 24(3), 188-191, 2005 被引用文献: 1件中 \n1-1件を 表示 1 A Context-Aware Seamless Interoperator Roaming Management Framework \nin 4G Networks LEE Minsoo , PARK Sehyun IEICE transactions on communications 90(11), \n3015-3023, 2007-11-01 参考文献25件 Tweet 各種コード NII論文ID(NAID) 10026179795 資料\n種別 雑誌論文 データ提供元 CJP引用 書き出し RefWorksに書き出し EndNoteに書き出し にRefer…",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Challenges of Security and Trust of Mobile Devices as Digital Avionics Component",
            "Publication year": 2016,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2016arXiv160500446N/abstract",
            "Abstract": "Mobile devices are becoming part of modern digital avionics. Mobile devices can be applied to a range of scenarios, from Electronic Flight Bags to maintenance platforms, in order to manage and configure flight information, configure avionics networks or perform maintenance tasks (including offloading flight logs). It can be argued that recent developments show an increased use of personal mobile devices playing an integral part in the digital avionics industry. In this paper, we look into different proposals for integrating mobile devices with various avionics networks--either as part of the Bring Your Own Device (BYOD) or Corporate Owned Personally Enabled (COPE) paradigms. Furthermore, we will evaluate the security and trust challenges presented by these devices in their respective domains. This analysis will also include the issues related to communication between the mobile device and the aircraft network …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:7xtfDMUJqJkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing EMV online PIN verification",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7345359/",
            "Abstract": "EMV (Europay MasterCard Visa) is a globally accepted standard for chip card-based payment transactions, which benefits from the intrinsic security characteristics of chip cards. The EMV specification is relatively flexible and can be deployed in both online and offline card acceptance environments. In the offline environment, payment terminals and cards only communicate with each other in order to approve/decline the payment transactions, whereas in the online environment authorisation entities are also involved in the overall process. An authorisation entity can either be the Card Issuing Bank (CIB) or the payment scheme operator (e.g. Visa, Master-Card). Aside from the transaction authorisation, the EMV specifications define offline-PIN verification as one of the main cardholder verification methods. However, in an online authorisation environment, the PIN verification process is referred to as Online-PIN …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Remote e-voting using the smart card web server",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/article/remote-e-voting-using-the-smart-card-web-server/109580",
            "Abstract": "Voting in elections is the basis of democracy, but voting at polling stations may not be possible for all citizens. Remote (Internet) e-voting uses the voter's own equipment to cast votes, but is potentially vulnerable to many common attacks, which affect the election's integrity. Security can be improved by distributing vote processing over many web servers installed in tamper-resistant, secure environments, using the Smart Card Web Server (SCWS) on a mobile phone Subscriber Identity Module (SIM). A generic voting model is proposed, using a SIM/SCWS voting application with standardised Mobile Network Operator (MNO) management procedures to process the votes cast. E-voting systems Prêt à Voter and Estonian I-voting are used to illustrate the generic model. As the SCWS voting application is used in a distributed processing architecture, e-voting security is enhanced: to compromise an election, an attacker …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "On the performance of certificate revocation protocols based on a java card certificate client implementation",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-25660-1_36",
            "Abstract": "The use of certificates for secure transactions in smart cards requires the existence of a secure and efficient revocation protocol. There are a number of existing protocols for online certificate revocation and validation, among which OCSP and SCVP are the most widely used. However there are not any real applications testing the efficiency of these protocols when run in a smart card, even though the advantages of such an implementation are promising. In this paper we examine the details of the implementation of these protocols, emphasising on the issues arisen from the limitations of the smart cards. We also discuss the performance results from the implementation of OCSP and SCVP in a multi-application smart card environment. Results from two different Java Card platforms are presented and analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "The BIOS and Rootkits",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-7915-4_16",
            "Abstract": "There exist many documents, guidelines and application-level programs attempting to secure various operating systems (OS), but there is much less documentation and software for protecting lower levels subsystems such as the Basic Input Output System (BIOS). Security professionals are well aware that the security on any system is as strong as its weakest link as an attacker will seek to break into a system with the least amount of effort. In this chapter we will focus on the BIOS, and describe its main functions as well as the potential for attacks and countermeasures. After discussing the BIOS and analysing how it might be compromised, we will go on to consider rootkits. Installing a rootkit is often the next stage of an attack once the BIOS has been compromised, allowing the attack to take full control of the target system. We will discuss what rootkits actually are, how to identify that a system has been infected …",
            "Abstract entirety": 0,
            "Author pub id": "NygekFcAAAAJ:08ZZubdj9fEC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "A user-centric m-payment solution",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1656674/",
            "Abstract": "In this paper, we present a user-centric m-payment solution over Internet. The main contribution of the proposed solution includes: 1: ensuring fair-exchange; 2: ensuring the user's anonymity and privacy protection; 3: implementing an embedded biometric authentication framework for high security requirement",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "K. and Markantonakis, K., A Practical User-Centric Solution to Realize M-Payment",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=16559064751830357282&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The secure and multiple payment system based on the mobile phone platform",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=12508988023869107807&hl=en&oi=scholarr",
            "Abstract": "In this paper, a secure proximity payment system based on the characteristics of the mobile phone is proposed. By combining the convenience and portability of the mobile phone with the strength of on-card-matching fingerprint authentication and public key infrastructure, we constructed a powerful, secure and practical payment system for both micro and macro payment methods. The first method is a simple, fast and efficient method for an electronic purse transaction whilst the second is aimed at higher value transactions such as credit card purchases.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A practical e-payment protocol to realize fair-exchange",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4978671198396493728&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present a user-centric m-payment solution over Internet. The main contribution of the proposed solution includes: 1: ensuring fair-exchange; 2: ensuring the user’s anonymity and privacy protection; 3: implementing an embedded biometric authentication framework for high security requirement.",
            "Abstract entirety": 1,
            "Author pub id": "NygekFcAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        }
    ]
}]