[{
    "name": "Κωνσταντίνος Μαργαρίτης",
    "romanize name": "Konstantinos Margaritis",
    "School-Department": "Εφαρμοσμένης Πληροφορικής",
    "University": "uom",
    "Rank": "Καθηγητής",
    "Apella_id": 6934,
    "Scholar name": "Konstantinos G. Margaritis",
    "Scholar id": "YAzF48oAAAAJ",
    "Affiliation": "Department of Applied Informatics, University of Macedonia",
    "Citedby": 3576,
    "Interests": [
        "Parallel and Distributed Computing",
        "Intelligent Systems",
        "Computer Mathematics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=YAzF48oAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "On Feature Extraction and Sign Recognition for Greek Sign Language",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:vbGhcppDl1QC",
            "Publisher": "ACTA Press"
        },
        {
            "Title": "Multimodal continuous recognition system for greek sign language using various grammars",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Implementing parallel LU factorization with pipelining on a multicore using OpenMP",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5692483/",
            "Abstract": "Recent developments in high performance computer architecture have a significant effect on all fields of scientific computing. Linear algebra and especially the solution of linear systems of equations lies at the heart of many applications in scientific computing. This paper describes and analyzes three parallel versions of the dense LU factorization method that is used in linear system solving on a multicore using OpenMP interface. More specifically, we present two naive parallel algorithms based on row block and row cyclic data distribution and we put special emphasis on presenting a third parallel algorithm based on the pipeline technique. Further, we propose an implementation of the pipelining technique in OpenMP. Experimental results on a multicore CPU show that the proposed OpenMP pipeline implementation achieves good overall performance compared to the other two naive parallel methods. Finally, in …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis of recommender systems algorithms",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/53864618/hercma2003.pdf",
            "Abstract": "In this work, we will provide a brief review of different recommender systems’ algorithms, which have been proposed in the recent literature. First, we will present the basic recommender systems’ challenges and problems. Then, we will give an overview of association rules, memorybased, model-based and hybrid recommendation algorithms. Finally, evaluation metrics to measure the performance of those systems will be discussed.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Parallel Memetic Library For Optimization Problems",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.25.2170&rep=rep1&type=pdf",
            "Abstract": "To solve real-world discrete optimization problems approximately metaheuristics such as memetic algorithms and other evolutionary and local search methods are commonly used. For large instances of these problems or those with a lot of hard constraints even fast heuristics require a considerable amount of computational time. We present PARA. MENOAS, an object-oriented memetic algorithms library based on C++ and using the MPI message passing interface. It provides an automatic, transparent way of parallelizing memetic algorithms. The efficient communication in PARAMENOAS is the main reason for its success in several real-world applications.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Generalized Performance Model for Flexible Approximate String Matching on a Distributed System",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A performance evaluation of the preprocessing phase of multiple keyword matching algorithms",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065069/",
            "Abstract": "Multiple keyword matching is an important problem in text processing that involves the location of all the positions of an input string where one or more keywords from a finite set occur. Modern multiple keyword matching algorithms can scan the input string in a single pass by preprocessing the keyword set, an essential phase that affects the overall performance of each algorithm. This paper presents a performance evaluation in terms of preprocessing of the well known Commentz-Walter, Wu-Manber, Set Backward Oracle Matching and Salmela-Tarhio-Kyt\\\"{o}joki multiple keyword matching algorithms for different types of keywords and for several problem parameters.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Parallel implementation of the wu-manber algorithm using the opencl framework",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33412-2_59",
            "Abstract": "One of the most significant issues of the computational biology is the multiple pattern matching for locating nucleotides and amino acid sequence patterns into biological databases. Sequential implementations for these processes have become inadequate, due to an increasing demand for more computational power. Graphic cards offer a high parallelism computational power improving the performance of applications. This paper evaluates the performance of the Wu-Manber algorithm implemented with the OpenCL framework, by presenting the running time of the experiments compared with the corresponding sequential time.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A parallel memetic algorithms for the maintenance scheduling problem",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=7119098930854428098&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance study of matrix computations using multi-core programming tools",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371316.2371353",
            "Abstract": "Basic matrix computations such as vector and matrix addition, dot product, outer product, matrix transpose, matrix-vector and matrix multiplication are very challenging computational kernels arising in scientific computing. In this paper, we parallelize those basic matrix computations using the multi-core and parallel programming tools. Specifically, these tools are Pthreads, OpenMP, Intel Cilk++, Intel TBB, Intel ArBB, SMPSs, SWARM and FastFlow. The purpose of this paper is to present an unified quantitative and qualitative study of these tools for parallel matrix computations on multicore. Finally, based on the performance results with compilation optimization we conclude that the Intel ArBB and SWARM parallel programming tools are the most appropriate because these give good performance and simplicity of programming. In particular, we conclude that the Intel ArBB is a good choice for implementing intensive …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrating condor desktop clusters with grid",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-79448-8_4",
            "Abstract": "Grid infrastructures today are expanding slowly because adding computing resources is sometimes an expensive and bureaucratic procedure. In contrast, desktop grid technologies like Condor and B.O.I.N.C provide an easy and inexpensive way of creating large distributed systems that provide their idle computing time for job execution. We successfully tested the interconnection of a Condor pool with an EGEE site and we are in the process of expanding this infrastructure inside the University. We will also investigate the possible security, reliability and connection issues as we envision the expansion of this infrastructure to other remote computing resources like school computer labs.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Performance evaluation of load balancing strategies for approximate string matching on a cluster of heterogeneous workstations",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=8083759076684915596&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:tKAzc9rXhukC",
            "Publisher": "Tech. Report, Dept. of Applied Informatics, University of Macedonia"
        },
        {
            "Title": "Comparison of Neural Network Optimizers for Relative Ranking Retention Between Neural Architectures",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-19823-7_22",
            "Abstract": " Autonomous design and optimization of neural networks is gaining increasingly more attention from the research community. The main barrier is the computational resources required to conduct experimental and production project. Although most researchers focus on new design methodologies, the main computational cost remains the evaluation of candidate architectures. In this paper we investigate the feasibility of using reduced epoch training, by measuring the rank correlation coefficients between sets of optimizers, given a fixed number of training epochs. We discover ranking correlations of more than 0.75 and up to 0.964 between Adam with 50 training epochs, stochastic gradient descent with nesterov momentum with 10 training epochs and Adam with 20 training epochs. Moreover, we show the ability of genetic algorithms to find high-quality solutions of a function, by searching in a perturbed …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:LwieBGrN4GEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Mapping between the speech signal and articulatory trajectories",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.60.2491&rep=rep1&type=pdf",
            "Abstract": "The main target of this paper is a comparison of parametric representations for the task of mapping the speech signal onto Electromagnetic Articulography trajectories. The principal method used for the mapping is Support Vector Regression, contrasting previous works that applied Neural Networks to the same speech inversion problem.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MULTIMEDIA AUTHORING TOOLS FOR EDUCATION: COST vs BENEFITS",
            "Publication year": 2005,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:xtRiw3GOFMkC",
            "Publisher": "WSEAS"
        },
        {
            "Title": "Parallel Algorithms Using Message Passing-Performance Analysis of Approximate String Searching Implementations for Heterogeneous Computing Platform",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=2992090718867325131&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Evolving graph convolutional networks for neural architecture search",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-021-05979-8",
            "Abstract": "As neural architecture search (NAS) becomes an increasingly adopted method to design network architectures, various methods have been proposed to speedup the process. Besides proxy evaluation tasks, weight sharing, and scaling down the evaluated architectures, performance-predicting models exhibit multiple advantages. Eliminating the need to train candidate architectures and enabling transfer learning between datasets, researchers can also utilize them as a surrogate function for Bayesian optimization. On the other hand, graph convolutional networks (GCNs) have also been increasingly adopted for various tasks, enabling deep learning techniques on graphs without feature engineering. In this paper, we employ an evolutionary-based NAS method to evolve GCNs for the problem of predicting the relative performance of various architectures included in the NAS-Bench-101 dataset. By fine-tuning the …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:ZVmBtQ9RJaQC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Parallel architecture for flexible approximate text searching",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/51295550/Parallel_Architecture_for_Flexible_Appro20170110-24282-ksmolu.pdf",
            "Abstract": "This paper presents a processor array design for flexible approximate string matching. Initially, a sequential algorithm is discussed which consists of two phases, ie preprocessing and searching. Then, starting from the computational schedule of the searching phase a parallel architecture is derived. Further, the preprocessing phase is also accomodated onto the same architecture.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Topology and simulations of a hierarchical markovian radial basis function neural network classifier",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020025514008147",
            "Abstract": "This paper presents a Hierarchical Markovian Radial Basis Function Neural Network (HiMarkovRBFNN) model that enables recursive operations. The hierarchical structure of this network is composed of recursively nested RBF Neural Networks with arbitrary levels of hierarchy. All hidden neurons in the hierarchy levels are composed of truly RBF Neural Networks with two weight matrices, for the RBF centers and the linear output weights, in contrast to the simple summation neurons with only linear weighted combinations which are usually encountered in ensemble models and cascading networks. Thus the neural network operation in every node is exactly the same at all levels of the hierarchical integration. The hidden RBF response units are recursive. The training methods also remain the same for all levels as in a typical single RBF Neural Network. The simplicity in the neural network construction process is …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:N7YTE_TVRugC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A performance study of a recognition system for greek sign language alphabet letters",
            "Publication year": 2004,
            "Publication url": "https://www.isca-speech.org/archive_open/specom_04/spc4_545.html",
            "Abstract": "Sign Languages (SLs) are the basic means of communication between deaf people all over the world. Sign Language recognition systems usually focus on recognizing sequences of hand morphs constituting signs. Recognizing hand morphs of Greek Sign Language (GSL) letters is the basis of the recognition system that we have developed.Visual-based systems have been used by many researchers, to increase naturalness in user's movement. In such systems images are captured by a camera, in a time sequential basis and they are used for training and recognition. Most times the acquired image cannot directly be used for recognition purposes. Some preprocessing is required in order to extract useful information from images. It is a crucial step, however, to select good features in any object recognition system. In our approach we obtain hand morph images that we capture with the use of a monochrome video …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accelerating kernel density estimation on the GPU using the CUDA framework",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-G-Margaritis/publication/282641171_Accelerating_Kernel_Density_Estimation_on_the_GPU_Using_the_CUDA_Framework/links/5614c2de08aed47facee85db/Accelerating-Kernel-Density-Estimation-on-the-GPU-Using-the-CUDA-Framework.pdf",
            "Abstract": "The main problem of the kernel density estimation methods is the huge computational requirements, especially for large data sets. One way for accelerating these methods is to use the parallel processing. Recent advances in parallel processing have focused on the use Graphics Processing Units (GPUs) using Compute Unified Device Architecture (CUDA) programming model. In this work we discuss a naive and two optimised CUDA algorithms for the two kernel estimation methods: univariate and multivariate. These optimised algorithms are based on the use of shared memory tiles and loop unrolling techniques. We also present exploratory experimental results of the proposed CUDA algorithms according to the several values of parameters such as number of threads per block, tile size, loop unroll level, number of variables and data (sample) size. The experimental results show significant performance gains of all proposed CUDA algorithms over serial CPU version and small performance speed-ups of the two optimised CUDA algorithms over naive GPU algorithms. Finally, based on extended performance results are obtained general conclusions of all proposed CUDA algorithms for some parameters.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:LI9QrySNdTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of standard SVD-based techniques for Collaborative Filtering",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.502.54&rep=rep1&type=pdf",
            "Abstract": "In this paper, we present and evaluate three SVD-based algorithms that can be used for the least-squares approximation of the user-item ratings matrix in the context of Collaborative Filtering (CF). The algorithms are adaptations of three standard techniques for matrix factorization: Standard Singular Value Decomposition (sSVD), Principal Component Analysis (PCA) and Correspondence Analysis (CA). PCA and CA can be described as singular value decompositions of appropriately transformed matrices. CA is conceptually similar to PCA and treats rating data using a consistent weighting scheme. To our knowledge, CA has not been previously used in the context of CF. The main purpose of this paper is to test how the corresponding CF variations behave under rating data sets of different sparsity and size. A series of experiments were executed, aiming to evaluate the three algorithms in terms of prediction accuracy. Experimental results on two benchmark data sets, MovieLens and Jester, indicated that CA-Cf outperforms SVD-Cf and PCA-Cf in terms of Mean Absolute Error (MAE) for small numbers of retained dimensions, regardless of the different data set characteristics. Nevertheless, SVD-Cf displayed the overall highest accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance models for matrix computations on networks of heterogeneous workstations",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/44389463/Performance_Models_for_Matrix_Computatio20160404-12610-1gkh4aq.pdf",
            "Abstract": "Matrix computations is one of the most important computational tasks in scientific computing. This paper discusses parallel implementations of two fundamental matrix computation kernels such as matrix-vector multiplication and matrix multiplication on a cluster of heterogeneous workstations. These parallel implementations are based on the master-worker paradigm using dynamic block distribution scheme. Furthermore, the parallel implementations are analyzed experimentally using the Message Passing Interface (MPI) library on homogeneous and heterogeneous clusters of workstations. Also, we propose a general analytical prediction model that can be used to predict the performance of two matrix computations for both types of clusters. The theoretical performance model has been checked against experimental results and it is shown that the model is able to predict the parallel performance accurately.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Flexible text searching",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=820792208708277144&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Nova Science Publ."
        },
        {
            "Title": "Local learning regularization networks for localized regression",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-016-2569-0",
            "Abstract": "Local learning algorithms use a neighborhood of training data close to a given testing query point in order to learn the local parameters and create on-the-fly a local model specifically designed for this query point. The local approach delivers breakthrough performance in many application domains. This paper considers local learning versions of regularization networks (RN) and investigates several options for improving their online prediction performance, both in accuracy and speed. First, we exploit the interplay between locally optimized and globally optimized hyper-parameters (regularization parameter and kernel width) each new predictor needs to optimize online. There is a substantial reduction of the operation cost in the case we use two globally optimized hyper-parameters that are common to all local models. We also demonstrate that this global optimization of the two hyper-parameters produces …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:7f0ks1Axv_QC",
            "Publisher": "Springer"
        },
        {
            "Title": "Metacomputing: technology and applications",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/771571.771576",
            "Abstract": "High performance computing deals with solving large computational problems. New and existing applications demand more and more computing resources, not found in any current computing system, be it a powerful workstation, a LAN or a single massively parallel platform. Metacomputing is an effort to utilize the overall existing inter-networked computing power. Supercomputers, parallel computers, powerful workstations, clusters as well as simple LANs may soon become part of global computing systems, ie, metacomputers.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:wbdj-CoPYUoC",
            "Publisher": "WIT Press"
        },
        {
            "Title": "Parallel text searching application on a heterogeneous cluster of workstations",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/951929/",
            "Abstract": "In this paper we propose a high-performance text searching implementation on a heterogeneous cluster of workstations using MPI message passing library. We test this parallel implementation and present experimental results for different text sizes and number of workstations. We also present a performance prediction model that agrees well with our experimental measurements.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recommender systems: An experimental comparison of two filtering algorithms'",
            "Publication year": 2003,
            "Publication url": "http://delab.csd.auth.gr/bci1/Panhellenic/152vozalis.pdf",
            "Abstract": "In this work we provide a review of the experiments we conducted on two contrasting recommender systems' algorithms: classic Collaborative Filtering and Item-based Filtering. We discuss the results extracted from the experiments and test the validity of the claim that Item-based Filtering improves significantly on the performance of classic Collaborative Filtering. Finally, the results are compared with a smart non-personalized algorithm in order to evaluate the methods' usefulness.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing acoustic-to-EPG mapping with lip position information",
            "Publication year": 2007,
            "Publication url": "http://www.toutios.com/pdfs/toutios2007enhancing.pdf",
            "Abstract": "This paper investigates the hypothesis that cues involving the positioning of the lips may improve upon a system that performs a mapping from acoustic parameters to electropalatographic (EPG) information; that is, patterns of contact between the tongue and the hard palate. We adopt a multilayer perceptron as a relatively simple model for the acoustic-toelectropalatographic mapping and demonstrate that its performance is improved when parameters describing the positioning of the lips recorded by means of electromagnetic articulography (EMA) are added to the input of the model.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A distributed asynchronous and privacy preserving neural network ensemble selection approach for peer-to-peer data mining",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371316.2371326",
            "Abstract": "This work describes a fully asynchronous and privacy preserving ensemble selection approach for distributed data mining in peer-to-peer applications. The algorithm builds a global ensemble model over large amounts of data distributed over the peers in a network, without moving the data itself, and with little centralized coordination. Only classifiers are transmitted to other peers. Here the test set from one classifier is the train set of the other and vice versa. Regularization Networks are used as ensemble member classifiers. The approach constructs a mapping of all ensemble members to a mutual affinity matrix based on classification rates between them. After the mapping of all members the Affinity Propagation clustering algorithm is used for the selection phase. A classical asynchronous peer-to-peer cycle is continually executed for computing the mutual affinity matrix. The cycle composed of typical grid …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:4MWp96NkSFoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative filtering through SVD-based and hierarchical nonlinear PCA",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15819-3_53",
            "Abstract": "In this paper, we describe and compare two distinct algorithms aiming at the low-rank approximation of a user-item ratings matrix in the context of Collaborative Filtering (CF). The first one implements standard Principal Component Analysis (PCA) of an association matrix formed from the original data. The second algorithm is based on h-NLPCA, a nonlinear generalization of standard PCA, which utilizes an autoassociative network, and constrains the nonlinear components to have the same hierarchical order as the linear components in standard PCA. We examine the impact of the aforementioned approaches on the quality of the generated predictions through a series of experiments. Experimental results show that the latter approach outperforms the standard PCA approach for most values of the retained dimensions.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Parallel implementation of the slope one algorithm for collaborative filtering",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6377387/",
            "Abstract": "Recommender systems are mechanisms that filter information and predict a user's preference to an item. Parallel implementations of recommender systems improve scalability issues and can be applied to internet-based companies having considerable impact on their profits. This paper implements two parallel versions of the collaborative filtering algorithm Slope One, which has advantages such as its efficiency and the ability to update data dynamically. The first presented version is parallely implemented with the use of the OpenMP API and its performance is evaluated on a multi-core system. The second is an hybrid approach using both OpenMP and MPI and its performance is evaluated in an homogeneous and an heterogeneous cluster. Experiments proved that the multithreaded version is 9,5 times faster than the sequential algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:kuK5TVdYjLIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Algorithm based fault tolerant matrix operations for parallel and distributed systems: Block checksum methods",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/8383437/checkblockabft7b8-4-20037d.pdf",
            "Abstract": "Algorithm Based Fault Tolerance (ABFT) have been proposed to perform fault tolerant matrix operations, form the heart of many computational processes and applications. The basic technique was based in column and row checksums. This paper presents two alternative block checksum schemes.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementing matrix multiplication on an MPI cluster of workstations",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.107.5365&rep=rep1&type=pdf",
            "Abstract": "The matrix multiplication is one of the most important computational kernels in scientific computing.Consider the matrix multiplication product C= A× B where A, B, C are matrices of size n× n. We propose four parallel matrix multiplication implementations on a cluster of workstations. These parallel implementations are based on the master–worker model using dynamic block distribution scheme. Experiments are realized using the Message Passing Interface (MPI) library on a cluster of workstations. Moreover, we propose an analytical prediction model that can be used to predict the performance metrics of the implementations on a cluster of workstations. The developed performance model has been checked and it has been shown that this model is able to predict the parallel performance accurately.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Contribution to statistical acoustic-to-EMA mapping",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080447/",
            "Abstract": "The availability of large corpora of parallel acoustic and articulatory data has enabled the use of statistical, data-driven, methods in the context of the speech inversion problem. This paper explores the use of Support Vector Regression for the mapping from acoustic parameters to electromagnetic articulograph trajectories and compares the outcoming results against those presented in other studies on the same problem and dataset.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A performance study of load balancing strategies for approximate string matching on an MPI heterogeneous system environment",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45825-5_61",
            "Abstract": "In this paper, we present three parallel approximate string matching methods on a parallel architecture with heterogeneous workstations to gain supercomputer power at low cost. The first method is the static master-worker with uniform distribution strategy, the second one is the dynamic master-worker with allocation of subtexts and the third one is the dynamic master-worker with allocation of text pointers. Further, we propose a hybrid parallel method that combines the advantages of static and dynamic parallel methods in order to reduce the load imbalance and communication overhead. This hybrid method is based on the following optimal distribution strategy: the text collection is distributed proportional to workstation’s speed. We evaluated the performance of four methods with clusters 1, 2, 4, 6 and 8 heterogeneous workstations. The experimental results demonstrate that the dynamic allocation of text …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Performance analysis of overheads for matrix–vector multiplication in cluster environment",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_23",
            "Abstract": "This paper presents the basic parallel implementation and a variation for matrix – vector multiplication. We evaluated and compared the performance of the two implementations on a cluster of workstations using Message Passing Interface (MPI) library. The experimental results demonstrate that the basic implementation achieves lower performance than the other variation. Further, we analyzed the several classes of overheads contribute to lowered performance of the basic implementation. These analyses have identified cost of reading of data from disk and communication cost as the primary factors affecting performance of the basic parallel matrix – vector implementation. Finally, we present a performance model for estimating the performance of two proposed matrix – vector implementations on a cluster of heterogeneous workstations.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:BqipwSGYUEgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An experimental study of benchmarking functions for genetic algorithms",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/pdf/10.1080/00207160210939",
            "Abstract": "This paper presents a review and experimental results on the major benchmarking functions used for performance control of Genetic Algorithms (GAs). Parameters considered include the effect of population size, crossover probability and pseudo-random number generators (PNGs). The general computational behavior of two basic GAs models, the Generational Replacement Model (GRM) and the Steady State Replacement Model (SSRM) is evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:e_rmSamDkqQC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "A Hybrid Parallel Implementation of the Aho–Corasick and Wu–Manber Algorithms Using NVIDIA CUDA and MPI Evaluated on a Biological Sequence Database",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213015400011",
            "Abstract": "Multiple matching algorithms are used to locate the occurrences of patterns from a finite pattern set in a large input string. Aho–Corasick and Wu–Manber, two of the most well known algorithms for multiple matching require an increased computing power, particularly in cases where large-size datasets must be processed, as is common in computational biology applications. Over the past years, Graphics Processing Units (GPUs) have evolved to powerful parallel processors outperforming Central Processing Units (CPUs) in scientific calculations. Moreover, multiple GPUs can be used in parallel, forming hybrid computer cluster configurations to achieve an even higher processing throughput. This paper evaluates the speedup of the parallel implementation of the Aho–Corasick and Wu–Manber algorithms on a hybrid GPU cluster, when used to process a snapshot of the Expressed Sequence Tags of the human …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:fhZv66dCuXAC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "A hybrid approach for improving prediction coverage of collaborative filtering",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-0221-4_57",
            "Abstract": "In this paper we present a hybrid filtering algorithm that attempts to deal with low prediction Coverage, a problem especially present in sparse datasets. We focus on Item HyCoV, an implementation of the proposed approach that incorporates an additional User-based step to the base Item-based algorithm, in order to take into account the possible contribution of users similar to the active user. A series of experiments were executed, aiming to evaluate the proposed approach in terms of Coverage and Accuracy. The results show that Item HyCov significantly improves both performance measures, requiring no additional data and minimal modification of existing filtering systems.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:sSrBHYA8nusC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Parallel processing of multiple pattern matching algorithms for biological sequences: methods and performance results",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=bdCcDwAAQBAJ&oi=fnd&pg=PA161&dq=info:8Yd5E0NJguQJ:scholar.google.com&ots=UKS49lGA0A&sig=POAq7SKtEQQkAYK9aP9g5MqYQwg",
            "Abstract": "Multiple pattern matching is the computationally intensive kernel of many applications including information retrieval and intrusion detection systems, web and spam filters and virus scanners. The use of multiple pattern matching is very important in genomics where the algorithms are frequently used to locate nucleotide or amino acid sequence patterns in biological sequence databases. For example, when proteomics data is used for genome annotation in a process called proteogenomic mapping (Jaffe et al., 2004), a set of peptide identifications obtained using mass spectrometry is matched against a target genome translated in all six reading frames.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementation of a programmable array processor architecture for approximate string matching algorithms on FPGAs",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1639474/",
            "Abstract": "Approximate string matching problem is a common and often repeated task in information retrieval and bioinformatics. This paper proposes a generic design of a programmable array processor architecture for a wide variety of approximate string matching algorithms to gain high performance at low cost. Further, we describe the architecture of the array and the architecture of the cell in detail in order to efficiently implement for both the preprocessing and searching phases of most string matching algorithms. Further, the architecture performs approximate string matching for complex patterns that contain don't care, complement and classes symbols. We also implement and evaluate the proposed architecture on a field programmable gate array (FPGA) device using the JHDL tool for synthesis and the Xilinx Foundation tools for mapping, placement, and routing. Finally, our programmable implementation achieves about …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multipopulation memetic model for the maintenance scheduling problem",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-G-Margaritis/publication/27383076_A_multipopulation_memetic_model_for_the_maintenance_scheduling_problem/links/0912f50dae25cc87ee000000/A-multipopulation-memetic-model-for-the-maintenance-scheduling-problem.pdf",
            "Abstract": "The thermal generator maintenance scheduling problem has been tackled by a variety of traditional optimisation techniques over the years. This paper proposes a method to solve the maintenance scheduling problem, called parallel co-operating memetic algorithm (PARME). In the proposed model used a variety of selection mechanism, operators, communication methods, local search procedures are applied to each solution generated by genetic operators, and parameters as it explained in the sequel. The PARME alone have been found to produce good quality results. High performance of our approach is demonstrated by applying it to maintenance scheduling problem.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On benchmarking functions for genetic algorithms",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207160108805080",
            "Abstract": "This paper presents experimental results on the major benchmarking functions used for performance evaluation of Genetic Algorithms (GAs). Parameters considered include the effect of population size, crossover probability, mutation rate and pseudorandom generator. The general computational behavior of two basic GAs models, the Generational Replacement Model (GRM) and the Steady State Replacement Model (SSRM) is evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:5nxA0vEk-isC",
            "Publisher": "GORDON & BREACH/HARWOOD ACADEMIC PUBLISHING"
        },
        {
            "Title": "Parallel and Distributed Computational Methods for Flexible Text Searching",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=XIfS7KnpNr8C&oi=fnd&pg=PA61&dq=info:7t7Yftu0LQ0J:scholar.google.com&ots=i1Z9H49Jlu&sig=BUvhiCNnhysvv4eY9ZSgl-a2XBs",
            "Abstract": "The exact and approximate string matching problem is a common and often repeated task in information retrieval and bioinformatics. As current free textual databases are growing almost exponentially over time, the string matching problem is becoming more expensive in terms computational times. We believe that recent advances in parallel and distributed processing techniques are currently mature enough and can provide powerful computing means convenient for overcoming this string matching problem.In this chapter we present a short survey for well known sequential exact and approximate string searching algorithms. Further, we propose four text searching implementations onto general purpose parallel computer like a cluster of heterogeneous workstations using MPI message passing library. The first three parallel implementations are based on the static and dynamic master-worker methods. Further, we propose a hybrid parallel implementation that combines the advantages of static and dynamic parallel methods in order to reduce the load imbalance and communication overhead. Moreover, we present linear processor array architectures for flexible exact and approximate string matching. These architectures are based on parallel realization of dynamic programming and non-deterministic finite automaton algorithms. The algorithms consist of two phases, ie preprocessing and searching. Then, starting from the data dependence graphs of the searching phase, parallel algorithms are derived, which can be realized directly onto special purpose processor array architectures for approximate string matching. Further, the preprocessing …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Nova Publishers"
        },
        {
            "Title": "A Parallel Implementation of the Revised Simplex Algorithm Using OpenMP: Some Preliminary Results",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-5134-1_11",
            "Abstract": "Linear Programming (LP) is a significant research area in the field of operations research. The simplex algorithm is the most widely used method for solving Linear Programming problems (LPs). The aim of this paper is to present a parallel implementation of the revised simplex algorithm. Our parallel implementation focuses on the reduction of the time taken to perform the basis inverse, due to the fact that the total computational effort of an iteration of simplex type algorithms is dominated by this computation. This inverse does not have to be computed from scratch at any iteration. In this paper, we compute the basis inverse with two well-known updating schemes: (1) The Product Form of the Inverse (PFI) and (2) A Modification of the Product Form of the Inverse (MPFI); and incorporate them with revised simplex algorithm. Apart from the parallel implementation, this paper presents a computational study that …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:gsN89kCJA0AC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Feature extraction and sign recognition for greek sign language",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-G-Margaritis/publication/27382525_On_Feature_Extraction_and_Sign_Recognition_for_Greek_Sign_Language/links/0912f50dae41a573ee000000/On-Feature-Extraction-and-Sign-Recognition-for-Greek-Sign-Language.pdf",
            "Abstract": "The work presented in this paper aims at developing a system that could recognize both isolated and continuous Greek Sign Language (GSL) sentences.A feature extraction method, that uses geometric properties of the morph of the hand, is used to derive descriptive features from each image, representing a GSL alphabet letter. The feature vectors produced by the method are given in sequences as input to Hidden Markov Models (HMMs). We distinguish four cases in the expreriments that have been performed: isolated letter",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Managing the computational cost of model selection and cross-validation in extreme learning machines via Cholesky, SVD, QR and eigen decompositions",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231218300195",
            "Abstract": "The typical model selection strategy applied in most Extreme Learning Machine (ELM) papers depends on a k-fold cross-validation and a grid search to select the best pair {L, C} of two adjustable hyper-parameters, namely the number L of hidden ELM nodes and the regularisation parameter, C, that minimizes the validation error. However, by testing only 30 values for L and 30 values for C via 10-fold cross-validation, the learning phase must build 9000 different ELM models, each with a different pair {L, C}. Since these models are not independent from one another, the essence of managing and drastically reducing the computational cost of the ELM model selection relies on matrix decompositions that avoid direct matrix inversion and allow producing reusable matrices during the cross-validations. Still, one can find many matrix decompositions and cross-validation versions that result in several combinations. In this …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:zBCjByih94YC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Novel Evolutionary Algorithm for Hierarchical Neural Architecture Search",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2107.08484",
            "Abstract": "In this work, we propose a novel evolutionary algorithm for neural architecture search, applicable to global search spaces. The algorithm's architectural representation organizes the topology in multiple hierarchical modules, while the design process exploits this representation, in order to explore the search space. We also employ a curation system, which promotes the utilization of well performing sub-structures to subsequent generations. We apply our method to Fashion-MNIST and NAS-Bench101, achieving accuracies of  and  respectively in a relatively small number of generations.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:F_tUKv7nyWgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Timely advances in evolving neural-based systems special issue",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s12530-016-9164-6.pdf",
            "Abstract": "The first paper “Locally Application of Naïve Bayes for Self-Training” was authored by Stamatis Georgios Karlos, Nikos Fazakis, Angeliki-Panagiota Panagopoulou, Sotiris Kotsiantis and Kyrgiakos Sgarbas, from the University of Patras, Greece. They present a novel Self—Labeled Weighted Variant Local Learner, which uses Naïve Bayes as the base classifier of the self-training scheme. A successful comparison with other established semi-supervised classification approaches has been performed, by using standard benchmark datasets. The second paper is by Athanasios Tsadiras and George Zitopoulos from the Aristotle University of Thessaloniki, Greece. It is entitled “Fuzzy Cognitive Maps as a Decision Support Tool for Container Transport Logistics”. It refers to an interesting financial application of Soft Computing, by presenting the employment of Fuzzy Cognitive Maps (an approach that combines Artificial …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:Nb0HLiwjfsIC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "IEEE Computer Society Learning Technology Task Force (LTTF)",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.129.7214&rep=rep1&type=pdf",
            "Abstract": "Asynchronous distance education appears as one of the most appealing instructional delivery methods as it combines flexibility to access teaching material with time to reflect, self-study techniques with peer-to-peer collaboration, and the use of low-cost technology. However, a number of pedagogical problems appear when confronted with asynchronous distance education (Ritchie and Hoffman, 1997; Wulf, 1996; Pernici and Casati, 1997; Relan and Gillani, 1997; Hunt 1999; Pritichard, 1998; Khan, 1997; Harasim, 1990; Hall, 1997b; Holden and Wedman, 1993).Students may feel isolated due to the distance factor or due to the lack of live interactions with the tutor or with classmates. On the other hand, due to the discontinuous character of asynchronous distance education, these sessions may also suffer from lack of intense supervision and lack of specialized feedback to students, according to their individual learning needs and preferences. So monitoring students’ performance may become a problematic process, while conclusions about the teaching effectiveness of a particular instructor may also be difficult to draw.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:YnriW4MgZhwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Realization of Back-Propagation on a Transputer Based System",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallelism, localization and chain gradient tuning combinations for fast scalable probabilistic neural networks in data mining applications",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30448-4_6",
            "Abstract": "This work investigates the scalability of Probabilistic Neural Networks via parallelization and localization, and a chain gradient tuning. Since PNN model is inherently parallel three common parallel approaches are studied here, namely data parallel, neuron parallel and pipelining. Localization methods via clustering algorithms are utilized to reduce the hidden layer size of PNNs. A problem of localization may be present in the case of multi-class data. In this paper we propose two simple fast approximate solutions. The first is using sigma smoothing parameters obtained from the parallel PNN initial training directly to clustering. In this case a substantial reduction of neurons is achieved without significant loss of recognition accuracy. The second is an effort for an additional tuning. Via confidence outputs we employ a chain training approach to tune for the best possible PNN architecture.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:URolC5Kub84C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A study of the two unit certainty neuron fuzzy cognitive map",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/543517.543523",
            "Abstract": "A study of the two unit certainty neuron fuzzy cognitive map | Neural, Parallel & Scientific \nComputations ACM Digital Library home ACM home Google, Inc. (search) Advanced Search \nBrowse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs \nConferences People More Search ACM Digital Library SearchSearch Advanced Search Neural, \nParallel & Scientific Computations Periodical Home Latest Issue Archive Authors Affiliations \nAward Winners More HomeBrowse by TitlePeriodicalsNeural, Parallel & Scientific \nComputationsVol. , No. A study of the two unit certainty neuron fuzzy cognitive map article A study \nof the two unit certainty neuron fuzzy cognitive map Share on Authors: Athanasios K. Tsadiras \nView Profile , Konstantinos G. Margaritis View Profile Authors Info & Affiliations Publication: \nNeural, Parallel & Scientific ComputationsMarch 2001 1citation 0 Downloads Metrics Total 1 .…",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:TFP_iSt0sucC",
            "Publisher": "Dynamic Publishers, Inc."
        },
        {
            "Title": "Collaborative filtering enhanced by demographic correlation",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/51295489/Collaborative_Filtering_enhanced_by_Demo20170110-15693-10w1j1i.pdf",
            "Abstract": "In this paper we explore how two existing collaborative filtering algorithms can be enhanced by the calculation of demographic correlations among the members of user or item neighborhoods. Experiments are executed to evaluate the performance of the proposed approach. Their results show that demographic data can, in some cases, lead to the generation of more accurate predictions.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On-line string matching algorithms: Survey and experimental results",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207160108805036",
            "Abstract": "In this paper we present a short survey and experimental results for well known sequential string matching algorithms. We consider algorithms based on different approaches including classical, suffix automata, bit-parallelism and hashing. We put special emphasis on algorithms recently presented such as Shift-Or and BNDM algorithms. We compare these algorithms in terms of the number of character comparisons and the running time for four different types of text: binary alphabet, alphabet of size 8, English alphabet and DNA alphabet.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Gordon and Breach Science Publishers"
        },
        {
            "Title": "Parallel Evolutionary Algorithms on Message-Passing Clusters",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.3.2539&rep=rep1&type=pdf",
            "Abstract": "Parallel Evolutionary algorithms have been developed to reduce the running time of serial Evolutionary algorithms. Two major paradigms for parallel programming, Message Passing and Shared Memory, are implemented and their performance observed. Message Passing Interface (MPI) and TreadMarks runtime libraries are chosen to implement parallel Evolutionary algorithms, based on a synchronous master-slave model, on a cluster of workstations. We then modify some parameters of the algorithms to observe their effects on the performance. Our objective is to show that, despite many believes that Message Passing scheme should give a better performance, Shared Memory scheme results in a similar performance in some conditions and thus can be considered as an excellent alternative for those who want to implement parallel Evolutionary algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Matrix Vector multiplication on a cluster of workstations",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.138.3493&rep=rep1&type=pdf",
            "Abstract": "The multiplication of a vector by a matrix is the kernel operation in many algorithms used in scientific computation. This paper outlines four parallel matrix–vector multiplication implementations on a cluster of workstations. These parallel implementations are based on the dynamic master–worker paradigm. Furthermore, the parallel implementations are analyzed experimentally using the Message Passing Interface (MPI) library on two kinds of high performance cluster of workstations: homogeneous and heterogeneous. Also, we propose a general analytical prediction model that can be used to predict the performance of the matrix–vector implementation for two kinds of cluster (homogeneous and heterogeneous). The developed performance model has been checked and it has been shown that this model is able to predict the parallel performance accurately.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance models for matrix computations on multicore processors using OpenMP",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5704454/",
            "Abstract": "The matrix computations such as matrix-vector and matrix multiplication are very challenging computational kernels arising in scientific computing. In this paper, we study and evaluate a number of different data decomposition schemes for matrix computations on multicore architectures using OpenMP programming model. Further, in this work we propose a simple and fast analytical model to predict the performance of matrix computations by taking memory access costs into account and data access schemes that appear in many scientific applications.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:HE397vMXCloC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance Study of Parallel Hybrid Multiple Pattern Matching Algorithms for Biological Sequences.",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/Papers/2012/37698/37698.pdf",
            "Abstract": "Multiple pattern matching is widely used in computational biology to locate any number of nucleotides in genome databases. Processing data of this size often requires more computing power than a sequential computer can provide. A viable and cost-effective solution that can offer the power required by computationally intensive applications at low cost is to share computational tasks among the processing nodes of a high performance hybrid distributed and shared memory platform that consists of cluster workstations and multi-core processors. This paper presents experimental results and a theoretical performance model of the hybrid implementations of the Commentz-Walter, Wu-Manber, Set Backward Oracle Matching and the Salmela-Tarhio-Kytöjoki family of multiple pattern matching algorithms when executed in parallel on biological sequence databases.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer simulators for teaching concurrent Programming",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=1054059557049529820&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel implementation of exact two dimensional pattern matching algorithms using MPI and OpenMP",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.712.3794&rep=rep1&type=pdf",
            "Abstract": "The need for processing power is constantly increas-ing as more processing-demanding and time-critical applications appear. Parallel processing has emerged as an efficient and costeffective solution, since low-end workstations and multiprocessors are cheaply available in the commodity market. In this paper, experimental results are presented on the parallel processing of the Naive, Karp and Rabin, Zhu and Takaoka, Baeza-Yates and Regnier and the Baker and Bird exact two dimensional on-line pattern matching algorithms. The algorithms are implemented using MPI and OpenMP, the two most widely used APIs for distributed and shared memory parallelization respectively. The performance of the parallel implementations is evaluated when used on a homogeneous cluster of workstations and a multicore processor.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel text searching applications on a heterogeneous cluster architecture",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCSE.2005.008910",
            "Abstract": "In this paper, we propose four text searching implementations on a cluster of heterogeneous workstations using MPI message passing library. The first three parallel implementations are based on the static and dynamic master-worker methods. Further, we propose a hybrid parallel implementation that combines the advantages of static and dynamic parallel methods in order to reduce the load imbalance and communication overhead. We test these parallel implementations and present experimental results for different text sizes and number of workstations. We also propose a performance prediction model of the four implementations that agrees well with our experimental measurements.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:eflP2zaiRacC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Experimental Results on Multiple Pattern Matching Algorithms for Biological Sequences.",
            "Publication year": 2011,
            "Publication url": "https://www.scitepress.org/papers/2011/31332/31332.pdf",
            "Abstract": "With the remarkable increase in the number of DNA and proteins sequences, it is very important to study the performance of multiple pattern matching algorithms when querying sequence patterns in biological sequence databases. In this paper, we present a performance study of the running time of well known multiple pattern matching algorithms on widely used biological sequence databases containing the building blocks of nucleotides (in the case of nucleic acid sequence databases) and amino acids (in the case of protein sequence databases).",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using SVD and demographic data for the enhancement of generalized collaborative filtering",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020025507001223",
            "Abstract": "In this paper we examine how Singular Value Decomposition (SVD) along with demographic information can enhance plain Collaborative Filtering (CF) algorithms. After a brief introduction to SVD, where some of its previous applications in Recommender Systems are revisited, we proceed with a full description of our proposed method which utilizes SVD and demographic data at various points of the filtering procedure in order to improve the quality of the generated predictions. We test the efficiency of the resulting approach on two commonly used CF approaches (User-based and Item-based CF). The experimental part of this work involves a number of variations of the proposed approach. The results show that the combined utilization of SVD with demographic data is promising, since it does not only tackle some of the recorded problems of Recommender Systems, but also assists in increasing the accuracy of …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Hidden Markov Models for Greek Sign Language Recognition",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-G-Margaritis/publication/27383112_Hidden_Markov_Models_for_Greek_Sign_Language_Recognition_a_Survey/links/00b4953874832a9e62000000/Hidden-Markov-Models-for-Greek-Sign-Language-Recognition-a-Survey.pdf",
            "Abstract": "Sign languages are the basic means of communication between hearing impaired people. A translator is usually needed when a deaf person wants to communicate with persons that do not speak sign language. The work presented in this paper aims at developing a system that could recognize and translate isolated and continuous Greek Sign Language (GSL) sentences. Input is obtained by using a feature extracting method from two-dimensional images. The feature vectors produced by the method are then presented as input to Hidden Markov Models (HMMs) for recognition. We use a vocabulary of 26 greek words (nouns, pronouns, adjectives, verbs) and achieve a recognition rate of 98% for isolated recognition and 85.7% for continuous recognition.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multimedia creation: An educational approach.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=7030309886398752782&hl=en&oi=scholarr",
            "Abstract": "Not so many years before, 'multimedia authoring systems' came to light. Not immediately, the term gave a boost to the market of multimedia authoring; a market seeking the most powerful tool ever. Since then, that market has evolved to a variety of choices. A plethora of tools is now offered, each hypothetically serving the same cause: The production of more interactive and powerful multimedia presentations. Leaving 'power' on the side, this article outlines a large variety of products through the scope of low costand effectiveness while underlining the need for cheaper and simpler tools for education. Based on a 44 multimedia tool survey, this attempt tries to shed some light to educational multimedia authoring and how it can-or cannot-be implemented through existing tools in the market.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A fast progressive local learning regression ensemble of generalized regression neural networks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801962",
            "Abstract": "The Generalized Regression Neural Network (GRNN) is a memory-based supervised learning neural network that performs non linear regressions and output estimation. However, if the number of the hidden layer neurons grows large, the evaluation of an unknown sample has a substantial computational cost. Whereas the GRNN run time can be reduced by parallelism, the computational load can be decreased by neuron reduction that compresses pattern neurons into fewer kernels. While such global models have been studied for a long time, there is another solution; that of local learning algorithms which use neighbourhoods to learn local parameters and create on the fly a local model specifically designed for any particular testing point. For this purpose we create a Progressive Local Learning Ensemble of many local GRNN models. Optimizing the number of k nearest neighbor neurons the method reduces …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:bXvxhPDrUX0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel computing of kernel density estimation with different multi-core programming models",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6498536/",
            "Abstract": "Kernel density estimation is nowadays very popular tool for nonparametric probabilistic density estimation. One of its most important disadvantages is computational complexity of computations needed, especially for large data sets. One way for accelerating these computations is to use the parallel computing with multi-core platforms. In this paper we parallelize two kernel estimation methods such as the univariate and multivariate kernel estimation from the field of the computational econometrics on multi-core platform using different programming frameworks such as Pthreads, OpenMP, Intel Cilk++, Intel TBB, SWARM and FastFlow. The purpose of this paper is to present an extensive quantitative (i.e., performance) and qualitative (i.e., the ease of programming effort) study of the multi-core programming frameworks for these two kernel estimation methods.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:M7yex6snE4oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Parallel Two-Dimensional Pattern Matching Algorithms Based on GPU",
            "Publication year": 2017,
            "Publication url": "https://www.dynamicpublishers.com/Neural/NPSC2017/02-npsc-be04.pdf",
            "Abstract": "The two-dimensional pattern matching problem is used to locate all the positions inside a two-dimensional text where a two-dimensional pattern of a smaller or equal size occurs. In this paper, we present a basic parallel implementation and different optimization techniques of two important two-dimensional pattern matching algorithms, Baker and Bird and Baeza-Yates and Regnier, on a Graphics Processing Unit (GPU) platform. The performance of the proposed parallel implementations is evaluated for the GPU architecture and for different problem parameters. Experimental results demonstrate that there is performance gain of the optimized GPU implementations over the unoptimized implementation. Additionally, it is shown that the parallel implementation of Baeza-Yates and Regnier has a significantly higher performance gain comparing to that of the Baker and Bird algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:GWiaReNCd0YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimating electropalatographic patterns from the speech signal",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0885230807000691",
            "Abstract": "Electropalatography is a well established technique for recording information on the patterns of contact between the tongue and the hard palate during speech, leading to a stream of binary vectors representing contacts or non-contacts between the tongue and certain positions on the hard palate. A data-driven approach to mapping the speech signal onto electropalatographic information is presented. Principal component analysis is used to model the spatial structure of the electropalatographic data and support vector regression is used to map acoustic parameters onto projections of the electropalatographic data on the principal components.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A multipopulation cultural algorithm for the electrical generator scheduling problem",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378475402000216",
            "Abstract": "The electrical generator maintenance scheduling problem has been tackled by a variety of traditional optimisation techniques over the years. This paper proposes a method to solve the maintenance scheduling problem, called the parallel co-operating cultural algorithm (PARCA). In the proposed model, a variety of selection mechanisms, operators, communication methods, and local search procedures are applied to each solution generated by genetic operators and parameters as explained in the sequel. Our cultural algorithm framework combines the weak search method with the knowledge representation scheme for collecting and reasoning knowledge about individual experience.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:YsMSGLbcyi4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A Regularization Network committee machine of isolated Regularization Networks for distributed privacy preserving data mining",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33409-2_11",
            "Abstract": "In this paper we consider large scale distributed committee machines where no local data exchange is possible between neural network modules. Regularization neural networks are used for both the modules as well as the combiner committee in an embedded architecture. After the committee training no module will know anything else except its own local data. This privacy preserving obligation is a challenging problem for trainable combiners but crucial in real world applications. Only classifiers in the form of binaries or agents can be sent to others to validate their local data and sent back average classification rates. From this fully distributed and privacy preserving mutual validation a coarse-grained matrix can be formed to map all members. We demonstrate that it is possible to fully exploit this mutual validation matrix to efficiently train another regularization network as a meta learner combiner for the …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:EYYDruWGBe4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the enhancement of collaborative filtering by demographic data",
            "Publication year": 2006,
            "Publication url": "https://content.iospress.com/articles/web-intelligence-and-agent-systems-an-international-journal/wia00083",
            "Abstract": "Demographic data regarding users and items exist in most available recommender systems data sets. Still, there has been limited research involving such data. This work sets the foundations for a novel filtering technique which relies on information of that kind. It starts by providing a general, step-by-step description of an approach which combines demographic information with existing filtering algorithms, via a weighted sum, in order to generate more accurate predictions. U-Demog and I-Demog are presented as an application of that general approach specifically on User-based and Item-based Collaborative Filtering. Several experiments involving different settings of the proposed approach support its utility and prove that it shows enough promise in generating predictions of improved quality.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:WF5omc3nYNoC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "An Introduction to Neural Architecture Search for Convolutional Networks",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2005.11074",
            "Abstract": "Neural Architecture Search (NAS) is a research field concerned with utilizing optimization algorithms to design optimal neural network architectures. There are many approaches concerning the architectural search spaces, optimization algorithms, as well as candidate architecture evaluation methods. As the field is growing at a continuously increasing pace, it is difficult for a beginner to discern between major, as well as emerging directions the field has followed. In this work, we provide an introduction to the basic concepts of NAS for convolutional networks, along with the major advances in search spaces, algorithms and evaluation techniques.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:23Hg5vt_rPQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A fusion method for combining low-cost IMU/magnetometer outputs for use in applications on mobile devices",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/325850",
            "Abstract": "This paper presents a fusion method for combining outputs acquired by low-cost inertial measurement units and electronic magnetic compasses. Specifically, measurements of inertial accelerometer and gyroscope sensors are combined with no-inertial magnetometer sensor measurements to provide the optimal three-dimensional (3D) orientation of the sensors’ axis systems in real time. The method combines Euler–Cardan angles and rotation matrix for attitude and heading representation estimation and deals with the “gimbal lock” problem. The mathematical formulation of the method is based on Kalman filter and takes into account the computational cost required for operation on mobile devices as well as the characteristics of the low-cost microelectromechanical sensors. The method was implemented, debugged, and evaluated in a desktop software utility by using a low-cost sensor system, and it was tested in an augmented reality application on an Android mobile device, while its efficiency was evaluated experimentally. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:IaRkJ05COeQC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Tight lower bund for matrix transposition on the reconfigurable mesh",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=4031171155743121188&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ipzZ9siozwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A rough guide to the acoustic-to-articulatory inversion of speech",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.723.6055&rep=rep1&type=pdf",
            "Abstract": "This article reviews a specific speech research area called acoustic-to-articulatory inversion of speech, or speech inversion, which refers to the problem of mapping the acoustic speech signal onto a space describing the configuration of the human vocal tract that actually produced this signal. This space may be modeled in a variety of ways, such as with trajectories of the movement of the articulators-certain parts of the human vocal tract-derived by means of some specialized medical imaging device, or by using linguistics-related abstract classes to describe the evolution of the articulatory state through time. The problem is by far non-trivial, mainly due to the one-to-many nature and the high non-linearity of the acoustic to articulatory mapping. Numerous approaches towards its solution have been proposed. Such a solution could have several applications, with most important the probability of improving the performance of current automatic speech recognition systems.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance comparison of memetic algorithms",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S009630030301004X",
            "Abstract": "Local search techniques have been applied in optimization methods. The effect of local search to the memetic algorithms can make multimodal and non-linear problems easier to solve. Parameters considered include the effect of population size and recombination mechanisms. Experiments comparing three local search techniques for a memetic algorithm are represent. Further, we have adopted a global parallelization approach that preserves the properties, behavior, and fundamental of the sequential algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Intelligent techniques for web applications: review and educational application.",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Manolis_Vozalis/publication/221157030_Intelligent_techniques_for_web_applications_review_and_educational_application/links/0046353878164c4958000000/Intelligent-techniques-for-web-applications-review-and-educational-application",
            "Abstract": "This paper is a review of current technologies, which aim to improve the adaptability of web applications. We will focus on personalization, intelligent web browsing and intelligent agents. Further, we will demonstrate the use of intelligent techniques by means of an educational application.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Unison-CF: A Multiple-Component",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=7590647254138356998&hl=en&oi=scholarr",
            "Abstract": "In this paper we present the Unison-CF algorithm, which provides an efficient way to combine multiple collaborative filtering approaches, draw-ing advantages from each one of them. Each collaborative filtering approach is treated as a separate component, allowing the Unison-CF algorithm to be easily extended. We evaluate the Unison-CF algorithm by applying it on three existing filtering approaches: User-based Filtering, Item-based Filtering and Hybrid-CF.Adaptation is utilized and evaluated as part of the filtering approaches combination. Our experiments show that the Unison-CF algorithm generates promising re-sults in improving the accuracy and coverage of the existing filtering algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:r655XaDZu5IC",
            "Publisher": "Springer"
        },
        {
            "Title": "Parallel evolutionary algorithms on MPI",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.14.8284",
            "Abstract": "Parallel Evolutionary algorithms have been developed to reduce the running time of serial Evolutionary algorithms. Two major paradigms for parallel programming, Message Passing and Shared Memory, are implemented and their performance observed. Message Passing Interface (MPI) and TreadMarks runtime libraries are chosen to implement parallel Evolutionary algorithms, based on a synchronous master-slave model, on a cluster of workstations. We then modify some parameters of the algorithms to observe their e# ects on the performance. Our objective is to show that, despite many believes that Message Passing scheme should give a better performance, Shared Memory scheme results in a similar performance in some conditions and thus can be considered as an excellent alternative for those who want to implement parallel Evolutionary algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Employing Case Based Reasoning in Asynchronous distance education, journal of Learning Technology",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=13328661206117368131&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An optimal scaling approach to collaborative filtering using categorical principal component analysis and neighborhood formation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16239-8_6",
            "Abstract": "Collaborative Filtering (CF) is a popular technique employed by Recommender Systems, a term used to describe intelligent methods that generate personalized recommendations. The most common and accurate approaches to CF are based on latent factor models. Latent factor models can tackle two fundamental problems of CF, data sparsity and scalability and have received considerable attention in recent literature. In this work, we present an optimal scaling approach to address both of these problems using Categorical Principal Component Analysis for the low-rank approximation of the user-item ratings matrix, followed by a neighborhood formation step. The optimal scaling approach has the advantage that it can be easily extended to the case when there are missing data and restrictions for ordinal and numerical variables can be easily imposed. We considered different measurement levels for the …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:WqliGbK-hY8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Learning articulation from cepstral coefficients",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.60.5386&rep=rep1&type=pdf",
            "Abstract": "We work on a special case of the speech inversion problem, namely the mapping from Mel Frequency Cepstral Coeeficients onto articulatory trajectories, derived by EMA. We employ Support Vector Regression, and use PCA and ICA as means to account for the spatial structure of the problem. Our results are comparable to those achieved by older attempts on the same task, indicating probably some natural limitation on the mapping itself.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using fuzzy cognitive maps as a decision support system for political decisions",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-38076-0_12",
            "Abstract": "In this paper we use Fuzzy Cognitive Maps (FCMs), a well-established Artificial Intelligence technique that incorporates ideas from Artificial Neural Networks and Fuzzy Logic, to create a dynamic model of the Former Yugoslavian Republic of Macedonia (FYROM) Crisis in March 2001. FCMs create models as collections of concepts and the various causal relations that exist between these concepts. The decision capabilities of the FCM structure are examined and presented using a model that is developed based on the beliefs of a domain expert. The model is first examined statically using graph theory techniques to identify the vicious or the virtuous cycles of the decision process. The model is also tested dynamically thought simulations, in order to support political analysts and decision makers to their political decisions concerning the crisis. Scenarios are introduced and predictions are made by viewing …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Processor array implementations for flexible approximate string matching",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=6871096042854711115&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multithreaded implementation of the slope one algorithm for collaborative filtering",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33409-2_13",
            "Abstract": "Recommender systems are mechanisms that filter information and predict a user’s preference to an item. Parallel implementations of recommender systems improve scalability issues and can be applied to internet-based companies having considerable impact on their profits. This paper implements a parallel version of the collaborative filtering algorithm Slope One, which has advantages such as its efficiency and the ability to update data dynamically. The presented version is parallely implemented with the use of the OpenMP API and its performance is evaluated on a multi-core system.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A grid-cluster framework for memetic algorithms",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=7159199083113589445&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the performance of svd-based algorithms for collaborative filtering",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5359137/",
            "Abstract": "In this paper, we describe and compare three Collaborative Filtering (CF) algorithms aiming at the low-rank approximation of the user-item ratings matrix. The algorithm implementations are based on three standard techniques for fitting a factor model to the data: Standard Singular Value Decomposition (sSVD), Principal Component Analysis (PCA) and Correspondence Analysis (CA). CA and PCA can be described as SVDs of appropriately transformed matrices,which is a key concept in this study. For each algorithm we implement two similar CF versions. The first one involves a direct rating prediction scheme based on the reduced user-item ratings matrix, while the second incorporates an additional neighborhood formation step. Next, we examine the impact of the aforementioned approaches on the quality of the generated predictions through a series of experiments. The experimental results showed that the …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The effect of reduced training in neural architecture search",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-020-04915-6",
            "Abstract": "As neural architecture search becomes an increasingly studied field, it has become apparent that it demands a great number of computational resources. These are usually devoted to computations and utilized to train and evaluate intermediate solutions during the search phase. Although most researchers focus on developing more efficient search methods, the main computational cost in terms of execution time percentage concerns the evaluation of candidate architectures. As such, many works utilize a smaller number of training epochs during search phase evaluations. In this work, we study the effect of reduced training in neural architecture search. We focus on the retention of relative rankings between architectures when they are trained with different optimizers and for various epochs. We discover relatively high rank correlations between various fully and partially trained, arbitrarily connected architectures …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:P_fFXc30I2UC",
            "Publisher": "Springer"
        },
        {
            "Title": "Applying SVD on Generalized Item-based Filtering.",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.104.241&rep=rep1&type=pdf",
            "Abstract": "In this paper we examine the use of a matrix factorization technique called Singular Value Decomposition (SVD) along with demographic information in Item-Based Collaborative Filtering. After a brief introduction to SVD and to some of its previous applications in Recommender Systems, we proceed with the presentation of two distinct but related algorithms. The first algorithm uses SVD in order to reduce the dimension of the active item's neighborhood. The second algorithm initially enhances Item-based Filtering with demographic information and then applies SVD at various points of the filtering procedure. The presentations of both algorithms include a detailed step-by-step description and a series of experiments. In both cases the results show that a reduction in the dimension of the item neighborhood via SVD, either by itself or combined with the usage of relevant demographic information, is promising, since it does not only tackle some of the recorded problems of Recommender Systems, but also assists in increasing the accuracy of systems employing it.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed privacy-preserving P2P data mining via probabilistic neural network committee machines",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6623688/",
            "Abstract": "This work describes a probabilistic neural network (PNN) committee machine for Peer-to-Peer data mining. The pattern neurons of the PNN committee are composed of locally trained class-specialized regularization network Peer classifiers. The training takes into account the asynchronous distributed and privacy-preserving requirements that can be met in P2P systems. The Peer classifiers are first trained in parallel based on their local data. While no local data exchange is possible among them, the peers can exchange their classifiers in the form of binaries, or agents. Then an asynchronous distributed computing P2P cycle is executed to construct a mutual validation matrix. The train set of one Peer becomes the validation set of the other and only average rates are returned back. From this matrix we demonstrate that it is possible to perform weight based ensemble selection of best peer members for every class …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:xtoqd-5pKcoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multimedia authoring tools: the quest for an educational package",
            "Publication year": 2007,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.10.3.135.pdf",
            "Abstract": "Since the explosion in multimedia computing, educators have been trying to work their way towards integrated human-computer interaction. Consequently, a large number of multimedia tools have been created, always following the trend of simpler and easier multimedia development. After outlining the transition from hardcore programming to modern multimedia authoring systems, this paper leads the way through a large variety of products, trying to determine the criteria upon which one should base a software investment. To facilitate this attempt, a series of variables is introduced and, based on these variables, a typical evaluation takes place. Following that pattern, each tool is examined separately so that a reasonable amount of data is gathered and treated as the basis for a 5-scale point system. Informal as this may be, it not only helps in ranking the tools examined, but also in extracting the necessary statistics …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IFETS"
        },
        {
            "Title": "Simulating parallel scalable probabilistic neural networks via exemplar selection and EM in a ring pipeline",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877750317308050",
            "Abstract": "We present a new scalable Probabilistic Neural Network (PNN) construction method suitable for data-neuron parallelism in a ring pipeline parallel topology that allows training a large scale distributed model on a large scale distributed dataset. First the recently proposed Kernel Gradient Subtractive Clustering (KG-SC) automatically selects representative exemplar centers and their number for the PNN kernels. Then Expectation Maximization (EM) refines the PNN parameters. Experimental simulations compare the proposed solution accuracy and performance with PNNs produced from other state-of-the-art k-center clustering algorithms. The parallel and distributed implementations produce speedups close to linear on increasing the number of processors and the dataset size.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:tsQ8sfJ2mf4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Towards an integrated teaching environment for parallel programming",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065054/",
            "Abstract": "In this paper we present the integration of state of the art, open source, production level tools into a parallel programming environment, used for teaching parallel programming in MPI and OpenMP. Based on experiences introduced during this case study, and opinions gathered by an online questionnaire, a refined set of missing features that would strengthen the environment's educational role is defined.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Parallel and Distributed Collaborative Filtering: A Survey",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2951952",
            "Abstract": "Collaborative filtering is among the most preferred techniques when implementing recommender systems. Recently, great interest has turned toward parallel and distributed implementations of collaborative filtering algorithms. This work is a survey of parallel and distributed collaborative filtering implementations, aiming to not only provide a comprehensive presentation of the field's development but also offer future research directions by highlighting the issues that need to be developed further.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:9LrdxYebArsC",
            "Publisher": "ACM"
        },
        {
            "Title": "Acoustic-to-articulatory inversion of speech: A review",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-G-Margaritis/publication/27383119_Acoustic-to-Articulatory_Inversion_of_Speech_A_Review/links/0c96052088b2395c2c000000/Acoustic-to-Articulatory-Inversion-of-Speech-A-Review.pdf",
            "Abstract": "In this article, we review a specific speech processing research area called acoustic-to-articulatory inversion of speech, or simply speech inversion, which has attracted many researchers and scientists during the last 35 years. The underlying problem refers to the mapping from the acoustic space, which is well-defined since it consists of acoustic signals, to the articulatory space. The latter is somewhat vague, since it may manifest itself in a variety of ways, though it is always assumed that it bears some kind of connection to the human speech production system and the relative position of the articulators-the parts of the human vocal tract. We consider three major classes of models for the articulatory space, be it theoretical models, classic but of little practical interest, medical scanning models, where articulatory data are derived directly from the human subject by means of a specialized device such as an electromagnetic articulograph or an electropalatograph, and, finally, linguistics-derived models, which relate a given phoneme to a vector of phonetic features. A number of approaches have been proposed in the quest for a solution to the speech inversion problem such as codebook approaches, neural network approaches, constrained optimization approaches, analytical approaches as well as stochastic modelling and statistical inference methods such as mixture density networks or Kalman filtering. The recovery of the articulatory space from the speech acoustic signal could have a variety of applications such as building visual aids for hearing impaired people or as a means of study in phonetics and phonology. And most of all, the additional …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multithreaded local learning regularization neural networks for regression tasks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23983-5_13",
            "Abstract": "We explore four local learning versions of regularization networks. While global learning algorithms create a global model for all testing points, the local learning algorithms use neighborhoods to learn local parameters and create on the fly a local model specifically designed for any particular testing point. This approach delivers breakthrough performance in many application domains. Usually however the computational overhead is substantial, and in some cases prohibited. For speeding up the online predictions we exploit both multithreaded parallel implementations as well as interplay between locally optimized parameters and globally optimized parameters. The multithreaded local learning regularization neural networks are implemented with OpenMP. The accuracy of the algorithms is tested against several benchmark datasets. The parallel efficiency and speedup is evaluated on a multi-core system.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:UwpDZDXJMDUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Processor array architectures for flexible approximate string matching",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1383762107000537",
            "Abstract": "In this paper, we present linear processor array architectures for flexible approximate string matching. These architectures are based on parallel realization of dynamic programming and non-deterministic finite automaton algorithms. The algorithms consist of two phases, i.e. preprocessing and searching. Then, starting from the data dependence graphs of the searching phase, parallel algorithms are derived, which can be realized directly onto special purpose processor array architectures for approximate string matching. Further, the preprocessing phase is also accommodated onto the same processor array designs. Finally, the proposed architectures support flexible patterns i.e. patterns with a “don’t care” symbol, patterns with a complement symbol and patterns with a class symbol.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:abG-DnoFyZgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Enhancing collaborative filtering with demographic data: The case of item-based filtering",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/51295481/Enhancing_Collaborative_Filtering_with_D20170110-15693-gb3jio.pdf",
            "Abstract": "Demographic data regarding users and items exist in most available recommender systems data sets. Still, there has been limited research involving such data. This work sets the foundations for a novel filtering technique which relies on information of that kind. It starts by providing a general, stepby-step description of an approach which combines demographic information with existing filtering algorithms, via a weighted sum, in order to generate more accurate predictions. I-Demog is presented as an application of that general approach specifically on Item-based Collaborative Filtering. Several experiments involving different settings of the proposed approach support its utility and prove that it shows enough promise in generating predictions of improved quality.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On-line approximate string searching algorithms: Survey and experimental results",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207160212111",
            "Abstract": "The problem of approximate string searching comprises two classes of problems: string searching with k mismatches and string searching with k differences. In this paper we present a short survey and experimental results for well known sequential approximate string searching algorithms. We consider algorithms based on different approaches including dynamic programming, deterministic finite automata, filtering, counting and bit parallelism. We compare these algorithms in terms of running time against pattern length and for several values of k for four different kinds of text: binary alphabet, alphabet of size 8, English alphabet and DNA alphabet. Finally, we compare the experimental results of the algorithms with their theoretical complexities.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "On Greek Sign Language Alphabet Character Recognition: using Back-Propagation Neural Networks",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=12994828910416678928&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Optimal Scaling Framework for Collaborative Filtering Recommendation Systems",
            "Publication year": 2012,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213012500339",
            "Abstract": "Collaborative Filtering (CF) is a popular technique employed by Recommender Systems, a term used to describe intelligent methods that generate personalized recommendations. Some of the most efficient approaches to CF are based on latent factor models and nearest neighbor methods, and have received considerable attention in recent literature. Latent factor models can tackle some fundamental challenges of CF, such as data sparsity and scalability. In this work, we present an optimal scaling framework to address these problems using Categorical Principal Component Analysis (CatPCA) for the low-rank approximation of the user-item ratings matrix, followed by a neighborhood formation step. CatPCA is a versatile technique that utilizes an optimal scaling process where original data are transformed so that their overall variance is maximized. We considered both smooth and non-smooth transformations for …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Text searching on a heterogeneous cluster of workstations",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45417-9_51",
            "Abstract": "In this paper we propose a high-performance flexible text searching implementation on a heterogeneous cluster of workstations using MPI message passing library. We test this parallel implementation and present experimental results for different text sizes and number of workstations.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:_B80troHkn4C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Making Political Decisions using Fuzzy Cognitive Maps: The FYROM crisis",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance analysis of approximate string searching implementations for heterogeneous computing platform",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1240368/",
            "Abstract": "This paper presents an analytical performance prediction model that can be used to predict the execution time, speedup and similar performance metrics of four approximate string searching implementations running on an MPI cluster of heterogeneous workstations. The four implementations are based on master-worker model using static and dynamic allocation of the text collection. The developed performance model has been validated on an 8-cluster of heterogeneous workstations and it has been shown that the model is able to predict the execution time and other performance metrics of four parallel implementations accurately.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimating tongue-palate contact patterns from the speech signal",
            "Publication year": 2004,
            "Publication url": "https://www.isca-speech.org/archive_open/specom_04/spc4_158.html",
            "Abstract": "Electropalatography (EPG) is a technique that determines the contact patterns between the tongue and the hard palate during speech. In one of its most common forms, it utilizes an artificial palate with 62 silver electrodes embedded in its tongue-facing surface. At small regular time intervals it is recorded whether a specific electrode is contacted or not by the tongue, leading to tongue-palate contact patterns. EPG is nowadays a relatively well-estabilshed tool in phonetic research, in the clinical treatment of people with articulation difficulties or cleft palate, and also in the teaching of second languages. Still, the derivation of EPG data is a rather expensive and difficult process. What is suggested herein is that a means of estimating EPG patterns directly from the acoustic speech signal-with no need of any special equipment-would be of great value to speech pathologists and phoneticians alike.This paper presents work …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applying SVD on item-based filtering",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1578828/",
            "Abstract": "In this paper we examine the use of a matrix factorization technique called singular value decomposition (SVD) in item-based collaborative filtering. After a brief introduction to SVD and some of its previous applications in recommender systems, we proceed with a full description of our algorithm, which uses SVD in order to reduce the dimension of the active item's neighborhood. The experimental part of this work first locates the ideal parameter settings for the algorithm, and concludes by contrasting it with plain item-based filtering which utilizes the original, high dimensional neighborhood. The results show that a reduction in the dimension of the item neighborhood is promising, since it does not only tackle some of the recorded problems of recommender systems, but also assists in increasing the accuracy of systems employing it.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Survey of software environments for parallel distributed processing: Parallel programming education on real life target systems using production oriented software tools",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600432/",
            "Abstract": "Parallel programming is the future of computer science. Now days shift to parallel processing makes it even more useful. This research effort aims at helping parallelism education on real life target systems, using production oriented software tools. On its beginning, a survey of software environments for parallel programming is presented. The surveyed software environments are categorized according to their main function. An identity is synthesized for each environment by software and project attributes. Based on it and a set of proper criteria there are selected two groups of tools, those of primary and those of secondary interest for this research. An analysis of functional characteristics is performed for both groups. From the first group an open source software environment is chosen as the basis platform that will be enriched with education oriented enhancements. The characteristics analysis is exploited for the …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "\"Listening to deaf\": A Greek sign language translator",
            "Publication year": 2006,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:epqYDVWIO7EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "String matching on a heterogeneous cluster of workstations: an experimental study on load balancing",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=14660669004880467686&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Parallel Radial Basis Probabilistic Neural Network for scalable data mining in distributed memory machines",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6495172/",
            "Abstract": "This work presents scalable algorithms for basic construction of parallel Radial Basis Probabilistic Neural Networks. The final goal is to build a neural network that can efficiently be implemented in distributed memory machines. Thus a fast simple parallel training scheme for RBPNNs is studied, that is based almost solely on Gaussian summations which can by their part be efficiently mapped on parallel as well as on pipeline distributed machines. The suggested training scheme is tested for accuracy and performance and can guarantee simplicity, parallelization and linear speed ups in common parallel implementations, namely neuron parallel and pipelining studied here.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental Study on Variants of the Zhu-Takaoka String Matching Algorithm",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/37574998/cpaper027.pdf",
            "Abstract": "String matching is the problem of finding all the occurrences of a pattern in a text. In this paper we present three efficient variants of the Zhu-Takaoka algorithm which are more efficient in practice. Then we compare the newly presented algorithms with some of the most recent and effective string matching algorithms. It turns out that the new proposed variants achieve very good results, especially in the case of small and medium alphabets.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scientific computations on multi-core systems using different programming frameworks",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016892741400213X",
            "Abstract": "Numerical linear algebra is one of the most important forms of scientific computation. The basic computations in numerical linear algebra are matrix computations and linear systems solution. These computations are used as kernels in many computational problems. This study demonstrates the parallelisation of these scientific computations using multi-core programming frameworks. Specifically, the frameworks examined here are Pthreads, OpenMP, Intel Cilk Plus, Intel TBB, SWARM, and FastFlow. A unified and exploratory performance evaluation and a qualitative study of these frameworks are also presented for parallel scientific computations with several parameters. The OpenMP and SWARM models produce good results running in parallel with compiler optimisation when implementing matrix operations at large and medium scales, whereas the remaining models do not perform as well for some matrix …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:D4n_APcuzvwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Open multi processing (openmp) of Gauss-Jordan method for solving system of linear equations",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6036782/",
            "Abstract": "Solving systems of linear equations is probably one of the most scientific applications of linear algebra and direct-based Gauss-Jordan method as a classical kernel of large system of linear equations has become the focus of research. This paper presents an OpenMP pipeline implementation of Gauss-Jordan method and the corresponding performance model. Then, we conduct an experimental evaluation of the pipeline implementation in comparison with the two other naive parallel versions of Gauss-Jordan method such as row block and row cyclic distribution on a multicore platform. From the experiments are obtained show that the proposed pipelined implementation is a good solution for solving large system of linear equations. Finally, the experimental results of the pipeline implementation confirm the proposed performance model.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the effect of data sparsity to the performance of a Collaborative Filtering algorithm on a GPU",
            "Publication year": 2015,
            "Publication url": "https://proceedings.ictinnovations.org/attachment/paper/386/on-the-effect-of-data-sparsity-to-the-performance-of-a-collaborative-filtering-algorithm-on-a-gpu.pdf",
            "Abstract": "One of the problems that are encountered in recommender systems applications is the high sparsity of the available data. In this paper we investigate the effect of the sparsity of datasets to the performance of a parallel implementation of the Collaborative Filtering Slope One algorithm. To represent the sparse data the Compressed Sparse Row (CSR) format is used and the implementation’s performance is evaluated on a Graphics Processing Unit using the MovieLens and artificially created datasets.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:p7qoFRH4VUUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A processor array for approximate limited expression matching",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Michailidis/publication/234032595_A_Processor_Array_for_Approximate_Limited_Expression_Matching/links/02bfe50e67f8065287000000/A-Processor-Array-for-Approximate-Limited-Expression-Matching.pdf",
            "Abstract": "¡¤£¦¥ § ©!\"# $¦%© &'¡(£) 1 0 § 2¡! 3 4 5¦ 687%%© &© &63# 9 &@% A¤ BC6 D¦ 6! E (F § GH 9£¦ I 0 § 2GP § Q£¦! RS'E5¦'© &© & § 26¡ T© U GH 9£¦ 7¥ § 2¡ VW § ¡ X 02 3¦ VY IB¦% a£¦'E (£¦ bT© &%©% c de § GP § £¦% Rf'E5 5¦%© &© & § 6Y¡ T© g 9¦ h¤© &iTbT© &£ p 6 Bq¦% VYï09 g'E5¦%© &© & § 6¡ T© $£¦¥ 9£ 3 T! 9 r 63BC£¦%¡ S § ¡ s 5@ 7'£¦ § 7% Ycp t $¥ T¤ 3 &@% As § © 1 b 3© &! Rs 6Y¡ u T 3@ 0 0% 0 § v! 3F£¦ § 6¡¤ 63B (¦% 7%%¡ 8£ w T 5¦ 6! Ë § GH 9£¦ 02 § GP § Q£¦! Rh'E5 5¦%© &© & § 6Y¡ x 0 V 6¦ § Q£¦¥ TGy\" g¥ T § 7¥ 7'6Y¡ T© & § ©£ g 63Bq£¢\" $6¤ T¥ 3© &%©%(§ c Yc)¦% 5¦ 687%%© &© & § ¡ TVa¡ RP© &! 9¦ 7¥ § ¡ TVcD t $¥© &% 3¦ 7@¥ T § ¡ TVI¥ 3© & h § © pb© &% RW 6Y¡ W bT § Q£ &F 0%% 0 R (Ä¡ T GP § 7r 5¦ 6YV3@ GPGP § ¡ TV 3 T 5¦ 6 7@¥ qc GP T0% GP'¡(£@ 9£¦ § 6Y¡ T© q 6 B£¦¥ T $5¦%¦ 687%'© &© & § 2¡ Vh 3¡ R© &% 3¦ 7@¥ F § ¡ VT¥ T© &%© h 3¦ I R5 § © &7% iT© &© &! RX 6Y¡ 8£¦ 6H£¦¥ T¤©¦ GP a 5¦ 687%%© &© &63 a 9 &@% AX 3 &F 7@¥ T § Q£¦% 7£¦ ï¦ h B 63 T 5¦ 6! Ë § GH 9£¦ h'E5¦%© &© & § 6¡ s GH 3£¦ 7@¥ T § ¡ TV5c",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of load balancing strategies for approximate string matching application on an MPI cluster of heterogeneous workstations",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X03001092",
            "Abstract": "In this paper, we present three parallel approximate string matching methods on a parallel architecture with heterogeneous workstations to gain supercomputer power at low cost. The first method is the static master–worker with uniform distribution strategy, the second one is the dynamic master–worker with allocation of subtexts and the third one is the dynamic master–worker with allocation of text pointers. Further, we propose a hybrid parallel method that combines the advantages of static and dynamic parallel methods in order to reduce the load imbalance and communication overhead. This hybrid method is based on the following optimal distribution strategy: the text collection is distributed proportional to workstation’s speed. We evaluated and compared the performance of the four methods with clusters one, two, four, six and eight heterogeneous workstations. The experimental results demonstrate that dynamic …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:Zph67rFs4hoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "On the acoustic-to-electropalatographic mapping",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11613107_16",
            "Abstract": "Electropalatography is a well established technique for recording information on the patterns of contact between the tongue and the hard palate during speech. It leads to a stream of binary vectors, called electropalatograms. We are interested in the mapping from the acoustic signal to electropalatographic information. We present results on experiments using Support Vector Classification and a combination of Principal Component Analysis and Support Vector Regression.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Regularized evolution for macro neural architecture search",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49186-4_10",
            "Abstract": " Neural Architecture Search is becoming an increasingly popular research field and method to design deep learning architectures. Most research focuses on searching for small blocks of deep learning operations, or micro-search. This method yields satisfactory results but demands prior knowledge of the macro architecture’s structure. Generally, methods that do not utilize macro structure knowledge perform worse but are able to be applied to datasets of completely new domains. In this paper, we propose a macro NAS methodology which utilizes concepts of Regularized Evolution and Macro Neural Architecture Search (DeepNEAT), and apply it to the Fashion-MNIST dataset. By utilizing our method, we are able to produce networks that outperform other macro NAS methods on the dataset, when the same post-search inference methods are used. Furthermore, we are able to achieve 94.46% test accuracy …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:WMj-6b1RDO4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Improving the Efficiency of Exact Two Dimensional On-Line Pattern Matching Algorithms",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4621568/",
            "Abstract": "This paper presents new efficient variants of the Baker and Bird and the Baeza-Yates and Regnier exact two dimensional pattern matching algorithms. Both the original algorithms and the variants are compared in terms of running time for different sets of data.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Development of a text-dependent speaker identification system with the ogi toolkit",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.5.8555&rep=rep1&type=pdf",
            "Abstract": "This paper discusses the development a text-dependent speaker identification system. In particular, we develop a neural network, collect the input corpus, train, and measure its efficiency. The development is done with the CSLU-NN environment, a set of programs in Tcl and C, part of the OGI toolkit, originally built for speech recognition tasks, and adapted to our speaker recognition needs. Thus we propose a well-described and quite simple way for building pattern recognizers that deal with. wav files, in general. Our results demonstrate the efficiency of our implementation.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:aqlVkmm33-oC",
            "Publisher": "Citeseer"
        },
        {
            "Title": "Algorithm based fault tolerance: Review and experimental study",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/44389920/Algorithm_Based_Fault_Tolerance_Review_a20160404-28018-steeyn.pdf",
            "Abstract": "Algorithm-Based Fault Tolerance (ABFT) is a technique developed by JA Abraham and K. Huang in 1984 [HA 84]. The technique focuses on matrix computations, and more specifically, on how we can detect and correct the probable faults in a matrix-vector or matrix-matrix multiplication. According to the [HA 84] Algorithm Based Fault Tolerance is distinguished by three characteristics: The encoding of the data used by the algorithm, the redesign of the algorithm to operate on the encoded data, and the distribution of the computation steps in the algorithm among computation units. In [KPD98], the authors present a technique, based on checksum and reverse computation called Rollback Recovery Method and they implement it on varius matrix operations (matrix multiplication, Cholesky, QR and LU factorization and Hessenberg reduction).In this paper we apply three different schemes, Basic ABFT, Rollback Recovery and Recomputation on matrix multiplication for different matrix dimensions, and we give experimental results on the error detection and recovery performance of every one of the three methods. We consider errors that occur during computation. We suppose these errors are random and we apply several values of error probability. We suppose that, errors occur because of transient hardware problems or faulty data propagation.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel and local learning for fast Probabilistic Neural Networks in scalable data mining",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2490257.2490269",
            "Abstract": "Probabilistic Neural Networks (PNN) represent knowledge in the form of simple well understood Bayesian models, which are most suitable for data mining applications that also need confidence levels. However if the number N of pattern neurons grows large, the evaluation of a single unknown sample has still O (N) complexity, which is not scale well. Parallelism can efficiently work towards speeding up the large neural networks. Whereas the PNN run time can be reduced by parallelism, its computational cost can be decreased by keeping only the globally most important pattern neurons. While such parsimonious global models have been studied for a long time, there is another way that is related to local learning algorithms. Maintain all N pattern neurons but to classify any unknown x use only the local ones, the k nearest neighbor to x neurons. This local learning PNN is investigated here. By using confidence ratio …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:SpbeaW3--B0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A recommender system using principal component analysis",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.103.6856&rep=rep1&type=pdf",
            "Abstract": "In this paper we examine the use of a mathematical procedure, called Principal Component Analysis, in Recommender Systems. The resulting filtering algorithm applies PCA on user ratings and demographic data, aiming to improve various aspects of the recommendation process. After a brief introduction to PCA, we provide a discussion of the proposed PCA-Demog algorithm, along with possible ways of combining it with different sources of filtering data. The experimental part of this work tests distinct parameterizations for PCA-Demog, identifying those with the best performance. Finally, the paper compares their results with those achieved by other filtering approaches, and draws interesting conclusions.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Student models: The transit to distance education",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-G-Margaritis/publication/27382761_Student_Models_the_transit_to_distance_education/links/0deec52315ba77521b000000/Student-Models-the-transit-to-distance-education.pdf",
            "Abstract": "Introduction: Uses and achievements of Student Models in Education Typical examples of Student Models Domain independent Student Models Student Models with domain dependency How can Student Models be useful in distance education? Criteria testing the applicability of Student Models in distance education Report of Student Models that may apply in distance education Summary",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Neural architecture search with synchronous advantage actor-critic methods and partial training",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3208068",
            "Abstract": "In recent years, deep neural networks have enabled researchers to solve many difficult learning tasks, including natural language processing, image recognition and translation. Although powerful and flexible tool for many automation tasks, their design requires intensive human effort. Furthermore, recent studies suggest that the architecture itself can contribute more to the network's performance than its training. It is thus easy to see the necessity of automating the task of architecture design, as it will lead to even further improvements in the field. In this paper we implement a synchronous Advantage Actor-Critic Reinforcement Learning method in order to generate fully convolutional architectures, inspired by recent research in Neural Architecture Search and Reinforcement Learning. Furthermore, we explore the possibility of partially training the evaluated architectures, in order to assess the network's quality, greatly …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:AbS6eEh_b9AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Flexible Approximate String Matching Application on a Heterogeneous Distributed Environment.",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.109.6012&rep=rep1&type=pdf",
            "Abstract": "In this paper, we present three parallel flexible approximate string matching methods on a parallel architecture with heterogeneous workstations to gain supercomputer power at low cost. The first method is the static masterworker with uniform distribution strategy, the second one is the dynamic master-worker with allocation of subtexts and the third one is the dynamic master-worker with allocation of text pointers. Further, we propose a hybrid parallel method that combines the advantages of static and dynamic parallel methods in order to reduce the load imbalance and communication overhead. This hybrid method is based on the following optimal distribution strategy: the text collection is distributed proportional to workstation’s speed. We evaluated the performance of four methods with clusters 1, 2, 4, 6 and 8 heterogeneous workstations. The experimental results demonstrate that the dynamic allocation of text pointers and hybrid methods achieve better performance than the two original ones.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Experimental Study for Parallelizing Basic Kernels From Scientific Computing using Multicore Libraries",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Michailidis/publication/234032770_An_Experimental_Study_for_Parallelizing_Basic_Kernels_From_Scientific_Computing_using_Multicore_Libraries/links/0fcfd50e68ad42779b000000/An-Experimental-Study-for-Parallelizing-Basic-Kernels-From-Scientific-Computing-using-Multicore-Libraries.pdf",
            "Abstract": "Basic kernels from scientific computing such as matrix computations (ie dot product, outer product, matrix transpose, matrix-vector product and matrix product) and solving linear systems (ie Gaussian elimination and Jacobi) lie at the core of many computational applications such as computational statistics and combinatorial optimization. Often, these kernels are computation-intensive, so the sequential execution time is quite large. Therefore, it is profitable to use a multi-core platform as a high performance system for the execution. For the parallelization of the kernels from scientific computing on multi-core platforms there are many representative parallel programming libraries. These libraries are Pthreads, OpenMP, Intel Cilk++, Intel TBB, Intel ArBB, SMPSs, SWARM and FastFlow. These libraries based on a small set of extensions to the C programming language and involve a relatively simple compilation phase and potentially much more complex runtime system. The question that is imposed by programmers is which is the appropriate libary for implementing computational kernels on multi-core so that there is a balance between easy programming effort and the high performance. The aim of this presentation is to show an unified and systematic quantitative and qualitative study of multi-core programming libraries for implementing basic kernels that based on row partitioning method. The quantitative study is based on the assess the performance of the multithread kernels on Dual Opteron 6128 CPU with eight processor cores (16 cores total) and we measured the execution time as a function of the number of cores (ie from 1 to 16) and of the …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:z0_F5_TITjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Results of employing CBR in SYIM",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=8991325495270018825&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A parallel memetic algorithm for solving optimization problems",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/49003557/A_parallel_memetic_algorithm_for_solving20160920-30941-3oth5k.pdf",
            "Abstract": "Optimization algorithms can be classified in heuristic and metaheuristic. In the class of heuristic algorithms, there are construction and improvement algorithms. Metaheuristic algorithms may manage a chain or flow of executions of classical heuristics, eg Tabu Search, Simulated Annealing, Genetic and Memetic Algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:_kc_bZDykSQC",
            "Publisher": "Portugal"
        },
        {
            "Title": "Implementing basic computational kernels of linear algebra on multicore",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6377394/",
            "Abstract": "This paper implements basic computational kernels of the scientific computing such as matrix - vector product, matrix product and Gaussian elimination on multi-core platforms using several parallel programming tools. Specifically, these tools are Pthreads, OpenMP, Intel Cilk++, Intel TBB, Intel ArBB, SMPSs, SWARM and Fast Flow. The aim of this paper is to present an unified quantitative and qualitative study of these tools for parallel computation of scientific computing kernels on multicore. Finally, based on this study we conclude that the Intel ArBB and SWARM parallel programming tools are the most appropriate because these give good performance and simplicity of programming.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:b1wdh0AR-JQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Learning electropalatograms from acoustics",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1660032/",
            "Abstract": "Electropalatography is a well established technique for recording information on the patterns of contact between the tongue and the hard palate during speech, leading to a stream of binary vectors called electropalatograms, consisting of elecropalatographic events - contacts or non-contacts between the tongue and the palate. A data-driven approach to mapping the speech signal onto electropalatographic information is presented. A combination of principal component analysis and support vector regression is used, yielding classification scores of more than 93% on individual electropalatographic events, for a single speaker. This may be viewed as a special case of the, well-known in the speech community, speech inversion problem which refers to inferring production parameters from the speech signal",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A support vector approach to the acoustic-to-articulatory mapping",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.935.414&rep=rep1&type=pdf",
            "Abstract": "We report work on mapping the acoustic speech signal, parametrized using Mel Frequency Cepstral Analysis, onto electromagnetic articulography trajectories from the MOCHA database. We employ the machine learning technique of Support Vector Regression, contrasting previous works that applied Neural Networks to the same task. Our results are comparable to those older attempts, even though, due to training time considerations, we use a much smaller training set, derived by means of clustering the acoustic data.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "See Yourself Improve (SYIM): Implementing an educational environment for individual distance education services and student modeling",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=16310108230021185336&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How SVD and demographic data can be used to enhance generalized Collaborative Filtering",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/8383403/voz-2004-cf-svd-gen-brief-techrep.pdf",
            "Abstract": "In this paper we examine how Singular Value Decomposition (SVD) along with demographic information can enhance plain Collaborative Filtering (CF) algorithms. After a brief introduction to SVD, where some of its previous applications in Recommender Systems are revisited, we proceed with a full description of our proposed method: it applies SVD in different stages of an algorithm, which can be described as CF enhanced by demographic data. We test the efficiency of the resulting approach on two commonly used CF approaches (User-based and Item-based CF). The experimental part of this work involves a number of variations of the proposed approach. The results show that the combined utilization of SVD with demographic data is promising, since it does not only tackle some of the recorded problems of Recommender Systems, but also assists in increasing the accuracy of systems employing it.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:lSLTfruPkqcC",
            "Publisher": "Tech. rep., University of Macedonia, Greece"
        },
        {
            "Title": "Recognition of greek sign language using geometrical properties of alphabet letters and hidden markov models",
            "Publication year": 2002,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimental results on algorithms for multiple keyword matching",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.713.2159&rep=rep1&type=pdf",
            "Abstract": "Multiple keyword matching is a basic problem in computer science and is used to locate all the appearances of a finite set of keywords (the so called``patterns'') inside an input string (the so called``text''). This paper presents experimental results for the well known Commentz-Walter, Wu-Manber, Set Backward Oracle Matching and Salmela-Tarhio-Kytöjoki multiple keyword matching algorithms. The algorithms are compared in terms of running time for random texts using a binary alphabet and texts using the English alphabet while the experimental results are validated against the theoretical complexity.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Breaking ties of plurality voting in ensembles of distributed neural network classifiers using soft max accumulations",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44654-6_2",
            "Abstract": "An ensemble of distributed neural network classifiers is composed when several different individual neural networks are trained based on their local training data. These classifiers can provide either a single class label prediction, or the normalized via the soft max real value class-outputs that represent posterior probabilities which give the confidence levels. To form the ensemble decision the individual classifier decisions can be combined via the well known majority (or plurality) voting that sums the votes for each class and selects the class that receives most of the votes. While the majority voting is the most popular combination rule many ties in votes can occur, especially in multi-class problems. Ties are usually broken either randomly where the unknown instance is assigned randomly to one of the tied classes or using the class proportions where the tied class with the largest proportion wins. We present …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:BHd7YmozNHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards an assistive tool for Greek sign language communication",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exact online two-dimensional pattern matching using multiple pattern matching algorithms",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2513148",
            "Abstract": "Baker and Bird and Baeza-Yates and Regnier are two of the most efficient and widely used algorithms for exact online two-dimensional pattern matching. Both use the automaton of the Aho-Corasick multiple pattern matching algorithm to locate all the occurrences of a two-dimensional pattern in a two-dimensional input string, a data structure that is considered by many as inefficient, especially when used to process long patterns or data using large alphabet sizes. This article presents variants of the Baker and Bird and the Baeza-Yates and Regnier algorithms that use the data structures of the Set Horspool, Wu-Manber, Set Backward Oracle Matching, and SOG multiple pattern matching algorithms in place of the automaton of Aho-Corasick and evaluates their performance experimentally in terms of preprocessing and searching time.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:Dip1O2bNi0gC",
            "Publisher": "ACM"
        },
        {
            "Title": "Exemplar Selection via Leave-One-Out Kernel Averaged Gradient Descent and Subtractive Clustering",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-44944-9_25",
            "Abstract": "Scalable data mining and machine learning require data abstractions. This work presents a scheme for automatic selection of representative real data points as exemplars. Currently few algorithms can select representative exemplars from the data. K-medoids and Affinity Propagation are such algorithms. K-medoids requires the number of exemplars to be given in advance, as well as a dissimilarity matrix in memory. Affinity propagation automatically finds exemplars as well as their k number but it requires a similarity matrix in memory. A fast algorithm, which works without the need of any matrix in memory, is Subtractive Clustering, but it requires user-defined bandwidth parameters. The essence of the proposed solution relies on a leave-one-out kernel averaged gradient descent that automatically estimates a suitable bandwidth parameter from the data in conjunction with Subtractive Clustering algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:_IwLajd9sWMC",
            "Publisher": "Springer"
        },
        {
            "Title": "A parallel implementation of the revised simplex algorithm using OpenMP: some preliminary results",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Vassilis-Kostoglou/publication/275338067_Proceedings_of_the_1st_International_Symposium_and_10th_Balkan_Conference_on_Operational_Research_BALCOR_vol_II_1-440_-_ISBN_978-960-87277-7-9/links/554270130cf234bdb21a13bb/Proceedings-of-the-1st-International-Symposium-and-10th-Balkan-Conference-on-Operational-Research-BALCOR-vol-II-1-440-ISBN-978-960-87277-7-9.pdf#page=398",
            "Abstract": "Linear Programming (LP) is a significant area in the field of operations research. The simplex method is the most widely used method for solving LP problems. The aim of this paper is to present a parallel implementation of the revised simplex algorithm. Our parallel implementation focuses on the reduction of the time taken to perform the basis inverse, due to the fact that the total computational effort of an iteration of simplex type algorithms is dominated by this computation. This inverse does not have to be computed from scratch at any iteration. In this paper, we compute the basis inverse with two well-known updating schemes:(i) The Product Form of the Inverse (PFI) and (ii) A Modification of the Product Form of the Inverse (MPFI); and incorporate them with revised simplex algorithm. Apart from the parallel implementation, this paper presents a computational study that shows the speedup among the serial and the parallel implementations in largescale LP problems. The test set used in the computational study is the Netlib set of linear problems. The parallelism is achieved using OpenMP in a shared memory multiprocessor architecture.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:_09KEOFGu60C",
            "Publisher": "Unknown"
        },
        {
            "Title": "MPI Implementations for Solving Dot-Product on Heterogeneous Platforms",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Michailidis/publication/234032729_MPI_Implementations_for_Solving_Dot_-_Product_on_Heterogeneous_Platforms/links/09e4150e6883aed214000000/MPI-Implementations-for-Solving-Dot-Product-on-Heterogeneous-Platforms.pdf",
            "Abstract": "This paper is focused on designing two parallel dot product implementations for heterogeneous master-worker platforms. These implementations are based on the data allocation and dynamic load balancing strategies. The first implementation is the dynamic master-worker with allocation of vectors where the master distributes vectors (data) and computations to the workers whereas the second one is the dynamic master-worker with allocation of vector pointers where the vectors are supposed to be replicated among participating resources beforehand and the master distributes computations to the workers. The obtained experimental results demonstrate that the dynamic allocation of vector pointers achieve better performance than the original one for computing dot product computation. The paper also presents and verifies an accurate timing model to predict the performance of the proposed implementations on arbitrary clusters of workstations.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real Coded Parallel Memetic Algorithms on Messages Passing Clusters",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/8383422/jason2005.pdf",
            "Abstract": "This paper analyzes some technical and practical issues concerning the heterogeneous execution of parallel island-based real coded memetic algorithms (PMAs). The parallel environment used is the Message Passing Interface (MPI). Capability and effectiveness of the PMAs method are discussed fourteen benchmarking functions. The effect of real code representation to the parallel memetic algorithms can make multimodal and non-linear problems easier to solve. In this paper, the characterisitics of the typical two models of parallel memetic algorithms are compared. Those models are the master slave model and the island model. In the master slave model, the ideal parallel efficiency cannot be reached to 100%. Therefore, it is concluded the island model is suitable for PC cluster systems. In addition, we study some special features of the running platforms for PMAs, and basically find out that heterogeneous computing can be as efficient or even more efficient than homogeneous computing for parallel memetic algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "NORD: A python framework for Neural Architecture Search",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2665963820300336",
            "Abstract": "Neural Architecture Search (NAS) is a research field investigating the generation and optimization of neural network architectures for specific tasks. As manually designing the architectures is quite laborious and challenging to execute without adequate experience, NAS enables discovering novel, state-of-the-art architectures. Nonetheless, successfully implementing NAS processes also requires extensive experience with both neural networks and optimization processes. Neural Operations Research and Development (NORD) decouples implementing and designing the networks, enabling the application of existing methods on novel datasets and fairly comparing results. Thus, it aims to make NAS more accessible to researchers, as well as industry practitioners.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:kyHTWmgVackC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Identifying the effects of SVD and demographic data use on generalized collaborative filtering",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207160701598438",
            "Abstract": "The purpose of this paper is to examine how singular value decomposition (SVD) and demographic information can improve the performance of plain collaborative filtering (CF) algorithms. After a brief introduction to SVD, where the method is explained and some of its applications in recommender systems are detailed, we focus on the proposed technique. Our approach applies SVD in different stages of an algorithm, which can be described as CF enhanced by demographic data. The results of a rather long series of experiments, where the proposed algorithm is successfully blended with user- and item-based CF, show that the combined utilization of SVD with demographic data is promising, since it does not only tackle some of the recorded problems of recommender systems, but also assists in increasing the accuracy of systems employing it.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "A performance comparison of parallel genetic and memetic algorithms using MPI",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/49003547/A_Performance_Comparison_of_Parallel_Gen20160920-12405-1walttq.pdf",
            "Abstract": "In this paper we propose a parallel memetic algorithm which combines population-based method with guided local search (GLS) procedure. In the proposed algorithm, a GLS procedure is applied to each solution generated by genetic operations. The performance of proposed method compared with parallel genetic approaches (ie global model, migration model for GA). The parallel implementation is based on message passing interface (MPI).",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "for Heterogeneous Computing Platform",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=12423703469562070434&hl=en&oi=scholarr",
            "Abstract": "This paper presents an analytical performance prediction model that can be used to predict the speedup and similar performance metrics of four approximate string searching implementations running on an MPI cluster of heterogeneous workstations. The four implementations are based on master-worker model using static and dynamic allocation of the text collection. The developed performance model has been validated on a 8-cluster of heterogeneous workstations and it has been shown that the model is able to predict the speedup of four parallel implementations accurately",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:vJdfVD8-6ZYC",
            "Publisher": "Springer"
        },
        {
            "Title": "String matching problem on a cluster of personal computers: Experimental results",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.136.8734&rep=rep1&type=pdf",
            "Abstract": "In this paper we present a parallel implementation for solving the string matching problem. Experiments are realized using the Message Passing Interface (MPI) library on a cluster of personal computers, interconnected by a high-performance Fast Ethernet network. Significant speedup was achieved using different text sizes and number of processors.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the combination of user-based and item-based collaborative filtering",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03057920412331272199",
            "Abstract": "In this paper, we propose two new filtering algorithms which are a combination of user-based and item-based collaborative filtering schemes. The first one, Hybrid-Ib, identifies a reasonably large neighbourhood of similar users and then uses this subset to derive the item-based recommendation model. The second algorithm, Hybrid-CF, starts by locating items similar to the one for which we want a prediction, and then, based on that neighbourhood, it generates its user-based predictions. We start by describing the execution steps of the algorithms and proceed with extended experiments. We conclude that our algorithms are directly comparable to existing filtering approaches, with Hybrid-CF producing favorable or, in the worst case, similar results in all selected evaluation metrics. ",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Hybrid Implementation of the Wu-Manber Algorithm Using OpenCL and MPI",
            "Publication year": 2012,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hidden markov model for sign language recognition: A review",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/8383423/343.pdf",
            "Abstract": "Hidden Marcov Models (HMMs) are statistical models of sequential data that have been successfully used in many applications in artificial intelligence, pattern recognition and speech recognition. Hidden Marcov Models have intrinsic properties, which make them very attractive for sign language recognition. Explicit segmentation on the word level is not necessary for either training or recognition. Language and context models can be applied on several different levels and much related development of this technology has already been done in the field of speech recognition. Consequently, sign language recognition seems an ideal machine vision application of HMM technology, offering the benefits of problem scalability, well defined meanings, a pre-determined language model, a large base of users and immediate applications for a recognizer. In this paper we present a review of the work that has been done in the field of gesture recognition and sign language recognition.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A New Balance Degree for Fuzzy Cognitive Maps",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.89.9092&rep=rep1&type=pdf",
            "Abstract": "In this paper a new balance degree is proposed for better evaluation of the conflicts that exist in the graph of Fuzzy Cognitive Maps (FCMs). FCMs are fuzzy weighted directed graphs with feedback that create models that emulate the behaviour of complex decision processes using fuzzy causal relations. The existence of two causal relations of opposite sign between two nodes makes the graph of the FCM imbalanced. The degree to which the whole digraph of the FCM is balanced or imbalanced is given by the Balance Degree. Various types of Balance Degree exist for signed directed graphs. We proposed a new type of Balance degree that is suitable for FCMs. The new degree is evaluated by exhaustively searching all the paths that are created in the graph and gives an indication of the dynamical behaviour that we should expect from the FCM. This is important because the conclusions that we draw from the FCM are coming from the study of its dynamical behaviour.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Kernel averaged gradient descent subtractive clustering for exemplar selection",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s12530-017-9197-5",
            "Abstract": "We describe Kernel gradient subtractive clustering (KG-SC), a scheme for automatic selection of most representative exemplar points from large scale datasets. Exemplar selection is required for abstractions in machine learning and data science. Exemplars are more interesting and informative than just dividing objects into clusters since the exemplars are real data points that form an abstract view of the whole dataset and are used to store compressed information. Selecting exemplars and clustering data around them is also important for enhancing the performance in evolutionary computation, multi-optima evolutionary search and differential evolution. Currently, algorithms like Affinity Propagation and k-medoids can select representative exemplars from the data. k-medoids requires the number k of exemplars to be given in advance, as well as a dissimilarity matrix in memory. Affinity propagation …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:-rwTIRUNLawC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Fuzzy cognitive map as a decision support system for political decisions: The case of\" Great Albania\".",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/50814928/Fuzzy_cognitive_map_as_a_decision_suppor20161210-16449-sr0ytq.pdf",
            "Abstract": "Fuzzy Cognitive Maps (FCMs) is an Artificial Neural Networks technique that incorporates ideas from Fuzzy Logic, to create a Decision Support System. Using this strucrure we develop a qualitative model of the relationships that exist in the field of political decisions in the case of “Great Albania”. The model that is constructed is examined statically using graph theory techniques to identify the direct vicious or virtuous cycles of the decision process. Additionally graph‘s density and the conceptual centrality of model’s concepts are calculated. The dynamical behavior of the model is studied through computer simulations and conclusions are drawn for decisions to be taken. The role of Greece in the case of “Great Albania” is examined and possible ways are identified that make FCM an important and useful tool for the decision makers. Conclusions are drawn for the use of FCM as a decision support system for political decisions in general.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational comparison of some multi-core programming tools for basic matrix computations",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6332170/",
            "Abstract": "The broad introduction of multi-core platforms into computing has brought a great opportunity to develop computationally demanding applications such as matrix computations on parallel computing platforms. Basic matrix computations such as vector and matrix addition, dot product, outer product, matrix transpose, matrix - vector and matrix multiplication are very challenging computational kernels arising in scientific computing. In this paper, we parallelize those basic matrix computations using the multicore and parallel programming tools. Specifically, these tools are Pthreads, OpenMP, Intel Cilk++, Intel TBB, Intel ArBB, SMPSs, SWARM and FastFlow. The purpose of this paper is to present a quantitative and qualitative study of these tools for parallel matrix computations. Finally, based on this study we conclude that the Intel ArBB and SWARM parallel programming tools are the most appropriate because these give …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:KUbvn5osdkgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Employing Case Based Reasoning in Asynchronous Distance Education",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=4845694684299557129&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithms for multiple keyword matching: Survey and experimental results",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=208237494710991507&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Technical report"
        },
        {
            "Title": "A Performance Study of Load Balancing",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=11629238074788000216&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present three parallel approximate string matching methods on a parallel architecture with heterogeneous work-stations to gain supercomputer power at low cost. The first method is the static master-worker with uniform distribution strategy, the second one is the dynamic master-worker with allocation of subtexts and the third one is the dynamic master-worker with allocation of text pointers. Fur-ther, we propose a hybrid parallel method that combines the advantages of static and dynamic parallel methods in order to reduce the load imbal-ance and communication overhead. This hybrid method is based on the following optimal distribution strategy: the text collection is distributed proportional to workstation's speed. We evaluated the performance of four methods with clusters 1, 2, 4, 6 and 8 heterogeneous workstations. The experimental results demonstrate that the dynamic allocation of text pointers and hybrid methods achieve better performance than the two original ones.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:rlwtDmSc194C",
            "Publisher": "Springer"
        },
        {
            "Title": "Isolated and Continuous Greek Sign Language Recognition with Hidden Markov Models",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=16833866339109051260&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:PELIpwtuRlgC",
            "Publisher": "DYNAMIC PUBLISHER, INC"
        },
        {
            "Title": "A parallel and hierarchical Markovian RBF neural network: preliminary performance evaluation",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41013-0_35",
            "Abstract": "This paper presents a hierarchical Markovian Radial Basis Function (RBF) Neural Network, having embedded nature with many levels. The hidden RBF neurons in all the tree nodes of the hierarchy are composed of fully functional RBF Neural Networks that have the classical two synaptic link sets, one for the RBF centers and the other for the linear output weights. The Markov chain rule is specifically used in the RBF summations and permits this hierarchical functionality in a fractal-like fashion which supports a clear recursion. Thus the Neural Network operation is exactly the same at all levels. We further analyze the general framework where classical RBF Neural Network training algorithms can be applied, specifically for finding the centers and calculating the linear output weights. This framework is fast, simple and facilitates easy parallel implementations which are the main targets of this study.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "New processor array architectures for the longest common subsequence problem",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11227-005-0158-6",
            "Abstract": "A longest common subsequence (LCS) of two strings is a common subsequence of two strings of maximal length. The LCS problem is to find an LCS of two given strings and the length of the LCS (LLCS). In this paper, we present a new linear processor array for solving the LCS problem. The array is based on parallelization of a recent LCS algorithm which consists of two phases, i.e. preprocessing and computation. The computation phase is based on bit-level dynamic programming approach. Implementations of the preprocessing and computation phases are discussed on the same processor array architecture for the LCS problem. Further, we propose a block processor array architecture which reduces the overall communication and time requirements. Finally, we develop a performance model for estimating the performance of the processor array architecture on Pentium processors.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A distributed privacy-preserving regularization network committee machine of isolated Peer classifiers for P2P data mining",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10462-013-9418-7.pdf",
            "Abstract": "For distributed data mining in peer-to-peer systems this work describes a completely asynchronous, scalable and privacy-preserving committee machine. Regularization neural networks are used for all the Peer classifiers and the combiner committee in an embedded architecture. The proposed method builds the committee machine using the large amounts of training data distributed over the peers, without moving the data, and with little centralized coordination. At the end of the training phase no Peer will know anything else besides its own local data. This privacy-preserving obligation is a challenging problem for trainable combiners but is crucial in real world applications. Only classifiers are transmitted to other peers to validate their data and send back average accuracy rates in a classical asynchronous peer-to-peer execution cycle. Here the validation set for one classifier becomes the training set of the …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:i2xiXl-TujoC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Two new variants of Christofides heuristic for the Static TSP and a computational study of a nearest neighbor approach for the Dynamic TSP",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Vassilis-Kostoglou/publication/275338067_Proceedings_of_the_1st_International_Symposium_and_10th_Balkan_Conference_on_Operational_Research_BALCOR_vol_II_1-440_-_ISBN_978-960-87277-7-9/links/554270130cf234bdb21a13bb/Proceedings-of-the-1st-International-Symposium-and-10th-Balkan-Conference-on-Operational-Research-BALCOR-vol-II-1-440-ISBN-978-960-87277-7-9.pdf#page=389",
            "Abstract": "The Traveling Salesman Problem (TSP) is a standard test-bed for algorithmic ideas. From this point of view we evaluate the computational behavior of two new variants of Christofides heuristic for the Symmetric TSP. Moreover, we compare these numerical results with those arose from known heuristics with same worst-case time complexity. As a further step, we consider the Symmetric Dynamic TSP in which the travel cost between specific pairs of nodes may change through time. In this case, we apply an algorithmic approach based on Nearest Neighbor heuristic in order to avoid a link which has affected negatively cause of a surcharge. Effective implementations were developed and tested on TSPLib 95 benchmark instances.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:aXwx4OqTWR4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bit-level processor array architecture for flexible string matching",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-G-Margaritis/publication/27382550_Bit-Level_Processor_Array_Architecture_for_Flexible_String_Matching/links/0fcfd50dae3bc067ad000000/Bit-Level-Processor-Array-Architecture-for-Flexible-String-Matching.pdf",
            "Abstract": "In this paper, we present a linear processor array architecture for flexible string matching. Initially, a bit-level sequential algorithm is discussed which consists of two phases, ie preprocessing and searching. Then, starting from the data-dependence graph of the searching phase a processor array architecture is derived. Further, the preprocessing phase is also accommodated onto the same processor array design.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Parallel Implementation for Finding the Longest Common Subsequence",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=18341829330355744540&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Unison-CF: a multiple-component, adaptive collaborative filtering system",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-27780-4_29",
            "Abstract": "In this paper we present the Unison-CF algorithm, which provides an efficient way to combine multiple collaborative filtering approaches, drawing advantages from each one of them. Each collaborative filtering approach is treated as a separate component, allowing the Unison-CF algorithm to be easily extended. We evaluate the Unison-CF algorithm by applying it on three existing filtering approaches: User-based Filtering, Item-based Filtering and Hybrid-CF. Adaptation is utilized and evaluated as part of the filtering approaches combination. Our experiments show that the Unison-CF algorithm generates promising results in improving the accuracy and coverage of the existing filtering algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Hands-On Ensemble Learning with Python: Build highly optimized ensemble machine learning models using scikit-learn and Keras",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=N4mkDwAAQBAJ&oi=fnd&pg=PP1&dq=info:U4eLqBn3PRoJ:scholar.google.com&ots=Z_ajXMdUDM&sig=cqsDYpZBDQI4EVo368RqVoIeodE",
            "Abstract": "Combine popular machine learning techniques to create ensemble models using Python Key Features Implement ensemble models using algorithms such as random forests and AdaBoost Apply boosting, bagging, and stacking ensemble methods to improve the prediction accuracy of your model Explore real-world data sets and practical examples coded in scikit-learn and Keras Book Description Ensembling is a technique of combining two or more similar or dissimilar machine learning algorithms to create a model that delivers superior predictive power. This book will demonstrate how you can use a variety of weak algorithms to make a strong predictive model. With its hands-on approach, you'll not only get up to speed on the basic theory but also the application of various ensemble learning techniques. Using examples and real-world datasets, you'll be able to produce better machine learning models to solve supervised learning problems such as classification and regression. Furthermore, you'll go on to leverage ensemble learning techniques such as clustering to produce unsupervised machine learning models. As you progress, the chapters will cover different machine learning algorithms that are widely used in the practical world to make predictions and classifications. You'll even get to grips with the use of Python libraries such as scikit-learn and Keras for implementing different ensemble models. By the end of this book, you will be well-versed in ensemble learning, and have the skills you need to understand which ensemble method is required for which problem, and successfully implement them in real-world scenarios. What you will …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:OP2qWFMeUpEC",
            "Publisher": "Packt Publ."
        },
        {
            "Title": "Parallel direct methods for solving the system of linear equations with pipelining on a multicore using OpenMP",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377042711004183",
            "Abstract": "Recent developments in high performance computer architecture have a significant effect on all fields of scientific computing. Linear algebra and especially the solution of linear systems of equations lie at the heart of many applications in scientific computing. This paper describes and analyzes three parallel versions of the dense direct methods such as the Gaussian elimination method and the LU form of Gaussian elimination that are used in linear system solving on a multicore using an OpenMP interface. More specifically, we present two naive parallel algorithms based on row block and row cyclic data distribution and we put special emphasis on presenting a third parallel algorithm based on the pipeline technique. Further, we propose an implementation of the pipelining technique in OpenMP. Experimental results on a multicore CPU show that the proposed OpenMP pipeline implementation achieves good …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:NhqRSupF_l8C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Using Fuzzy Cognitive Maps",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=8213097804068662067&hl=en&oi=scholarr",
            "Abstract": "In this paper we use Fuzzy Cognitive Maps (FCMs), a well-established Artificial Intelligence technique that incorporates ideas from Artificial Neural Networks and Fuzzy Logic, to create a dynamic model of the Former Yugoslavian Republic of Macedonia (FYROM) Crisis inMarch 2001. FCMs create models as collections of concepts and the various causal relations that exist between these concepts. The decision capabilities of the FCM structure are examined and presented using a model that is developed based on the beliefs of a domain expert. The model is first examined statically using graph theory techniques to",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:KxdiYzj_eL0C",
            "Publisher": "Springer"
        },
        {
            "Title": "Parallel string matching algorithm: A bibliographical review",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=8555696942573042481&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An experimental evaluation of a parallel genetic algorithm using MPI",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5298836/",
            "Abstract": "The aim of this paper is to present an experimental evaluation of a parallel genetic algorithm using MPI. The performance of the algorithm is verified by computational experiments on a real world data set, ran in a cluster of workstations. MPI seems to be appropriate for these kind of experiments as the results are reliable and efficient.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Confidence ratio affinity propagation in ensemble selection of neural network classifiers for distributed privacy-preserving data mining",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231214012302",
            "Abstract": "We consider distributed privacy-preserving data mining in large decentralized data locations which can build several neural networks to form an ensemble. The best neural network classifiers are selected via the proposed confidence ratio affinity propagation in an asynchronous distributed and privacy-preserving computing cycle. Existing methods usually need a shared to all classifiers dataset, in order to examine the classification accuracy of each pair of classifiers. This process is neither distributed nor privacy-preserving. On the other hand in the proposed distributed privacy-preserving solution the classifiers validate each other in a local way. The training set of one classifier becomes the validation set of the other and vice versa and only partial sums of confidences for the correctly and the falsely classified examples are collected. By locally defining a confidence ratio between each pair of classifiers the well …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:NRnkAyzcrGMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A parallel environment for optimization problems",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mapping the speech signal onto electromagnetic articulography trajectories using support vector regression",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11551874_41",
            "Abstract": "We report work on the mapping between the speech signal and articulatory trajectories from the MOCHA database. Contrasting previous works that used Neural Networks for the same task, we employ Support Vector Regression as our main tool, and Principal Component Analysis as an auxiliary one. Our results are comparable, even though, due to training time considerations we use only a small portion of the available data.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "String matching problem on a cluster of personal computers: Performance modeling",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.130.3147&rep=rep1&type=pdf",
            "Abstract": "This paper presents an analytical performance prediction model and methodology that can be used to predict the execution time, speedup and similar performance metrics of a string matching algorithm running on a cluster of personal computers. The developed performance model has been checked on a 6-cluster of computers and it has been shown that this model is able to predict the parallel run-time accurately.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient multi-core computations in computational statistics and econometrics",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6417303/",
            "Abstract": "The social researchers use computationally intensive statistical and econometric methods for data analysis. One way for accelerating these computations is to use the parallel computing with multi-core platforms. In this paper we parallelize some representative computational kernels from statistics and econometrics on multi-core platform using the programming libraries such as Pthreads, OpenMP, Intel Cilk++, Intel TBB, Intel ArBB, SWARM and Fast Flow. Specifically, these kernels are multivariate descriptive statistics (such as multivariate mean and multivariate covariance) and kernel density estimation (univariate and multivariate). The purpose of this paper is to present an extensive quantitative and qualitative study of the multi-core programming models for parallel statistical and econometric computations. Finally, based on this study we conclude that the Intel ArBB and the SWARM programming environments are …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:tuHXwOkdijsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards automated neural design: an open source, distributed neural architecture research framework",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3291533.3291564",
            "Abstract": "NORD (Neural Operations Research & Development) is an open source distributed deep learning architectural research framework, based on PyTorch, MPI and Horovod. It aims to make research of deep architectures easier for experts of different domains, in order to accelerate the process of finding better architectures, as well as study the best architectures generated for different datasets. Although currently under heavy development, the framework aims to allow the easy implementation of different design and optimization method families (optimization algorithms, meta-heuristics, reinforcement learning etc.) as well as the fair comparison between them. Furthermore, due to the computational resources required in order to optimize and evaluate network architectures, it leverage the use of distributed computing, while aiming to minimize the researcher's overhead required to implement it. Moreover, it strives to make …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:o_fBUN_Or78C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A programmable array processor architecture for flexible approximate string matching algorithms",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0743731506002140",
            "Abstract": "Approximate string matching problem is a common and often repeated task in information retrieval and bioinformatics. This paper proposes a generic design of a programmable array processor architecture for a wide variety of approximate string matching algorithms to gain high performance at low cost. Further, we describe the architecture of the array and the architecture of the cell in detail in order to efficiently implement for both the preprocessing and searching phases of most string matching algorithms. Further, the architecture performs approximate string matching for complex patterns that contain don’t care, complement and classes symbols. We also simulate and evaluate the proposed architecture on a field programmable gate array (FPGA) device using the JHDL tool for synthesis and the Xilinx Foundation tools for mapping, placement, and routing. Finally, our programmable implementation achieves about 8 …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Parallel implementations for string matching problem on a cluster of distributed workstations",
            "Publication year": 2002,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/639862.639865",
            "Abstract": "We present three parallel implementations for solving the string matching problem. The advantages of these three parallel implementations are combined and incorporated into our new hybrid parallel implementation to produce optimal performance than either of the original three. We compare the performance of the four implementations on a cluster of workstations, interconnected by a high-performance Fast Ethernet network. Moreover, we have checked that by using the theoretical performance model we can predict the behaviour of the experimental results of the parallel string matching implementations.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Dynamic Publishers, Inc."
        },
        {
            "Title": "Implementing string searching algorithms on a network of workstations using MPI",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=66794483745984802&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "String matching on a multicore gpu using cuda",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5298766/",
            "Abstract": "Graphics processing units (GPUs) have evolved over the past few years from dedicated graphics rendering devices to powerful parallel processors, outperforming traditional central processing units (CPUs) in many areas of scientific computing. The use of GPUs as processing elements was very limited until recently, when the concept of general-purpose computing on graphics processing units (GPGPU) was introduced. GPGPU made possible to exploit the processing power and the memory bandwidth of the GPUs with the use of APIs that hide the GPU hardware from programmers. This paper presents experimental results on the parallel processing for some well known on-line string matching algorithms using one such GPU abstraction API, the Compute Unified Device Architecture (CUDA).",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Large scale data mining models via parallel regularized RBF Neural Networks",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Vassilis-Kostoglou/publication/275338067_Proceedings_of_the_1st_International_Symposium_and_10th_Balkan_Conference_on_Operational_Research_BALCOR_vol_II_1-440_-_ISBN_978-960-87277-7-9/links/554270130cf234bdb21a13bb/Proceedings-of-the-1st-International-Symposium-and-10th-Balkan-Conference-on-Operational-Research-BALCOR-vol-II-1-440-ISBN-978-960-87277-7-9.pdf#page=69",
            "Abstract": "This paper investigates the development of non-linear data mining tools by means of different parallelization methods for regularized Radial Basis Function Neural Networks. Three different parallel approaches are studied, namely data parallel, neuron parallel as well as hybrid session parallel. A typical master-worker programming model is used for the implementation of all parallel structuring approaches discussed. The parallel neural networks are analyzed experimentally using the Message Passing Interface (MPI) library standard and measured for performance on a homogeneous Linux Cluster. For all cases, results are provided for speedup and scaling of the algorithms and discussed further in the text.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:Y1W0x10ZrwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance Evaluation of Multiple Approximate String Matching Algorithms Implemented with MPI Paradigm in an Experimental Cluster Environment",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4621557/",
            "Abstract": "This paper describes and analyzes two high performance multiple string searching algorithms that we have optimized for cluster of heterogeneous workstations. The proposed parallel algorithms are based on dynamic master-worker programming paradigm. Experimental results show that these parallel algorithms are efficient: their search time is cut down significantly, whereas their communication cost stay at a low level.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:SdhP9T11ey4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Free and Open Source Software Educational Perspectives.",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Dimitrios-Vagianos/publication/221387924_Free_and_Open_Source_Software_Educational_Perspectives/links/615c26cafbd5153f47dc7c64/Free-and-Open-Source-Software-Educational-Perspectives.pdf",
            "Abstract": "The ongoing installation of computer labs in our country’s schools will be followed by the provision of the necessary educational software. Our research team has already started an investigation and evaluation of available free or open source educational software solutions that fulfill the country’s education needs. After giving a description of the concept of open source software, we present the results of the first part of our research, a detailed investigation of all available software packages in the World Wide Web that could be adjusted for use in all levels of our country’s education program. The database where our investigations results were recorded is also described. Our future goals as well as some conclusions regarding why open source software should be used in education, are finally stated.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiple String Matching on a GPU using CUDA",
            "Publication year": 2015,
            "Publication url": "https://scpe.org/index.php/scpe/article/view/1085",
            "Abstract": "Multiple pattern matching algorithms are used to locate the occurrences of patterns from a finite pattern set in a large input string. Aho-Corasick, Set Horspool, Set Backward Oracle Matching, Wu-Manber and SOG, five of the most well known algorithms for multiple matching require an increased computing power, particularly in cases where large-size datasets must be processed, as is common in computational biology applications. Over the past years, Graphics Processing Units (GPUs) have evolved to powerful parallel processors outperforming CPUs in scientific applications. This paper evaluates the speedup of the basic parallel strategy and the different optimization strategies for parallelization of Aho-Corasick, Set Horspool, Set Backward Oracle Matching, Wu-Manber and SOG algorithms on a GPU.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:ult01sCh7k0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "COMPUTING DOT--PRODUCT ON HETEROGENEOUS MASTER--WORKER PLATFORMS",
            "Publication year": 2013,
            "Publication url": "http://ijpam.eu/contents/2013-84-1/9/",
            "Abstract": "This paper is focused on designing two parallel dot product implementations for heterogeneous master-worker platforms. These implementations are based on the data allocation and dynamic load balancing strategies. The first implementation is the dynamic master-worker with allocation of vectors where the master distributes vectors (data) and computations to the workers whereas the second one is the dynamic master-worker with allocation of vector pointers where the vectors are supposed to be replicated among participating resources beforehand and the master distributes computations to the workers. We also report a set of numerical experiments on a heterogeneous platform where computational resources have different computing powers. Also, the workers are connected to the master by links of same capacities. The obtained experimental results demonstrate that the dynamic allocation of vector pointers achieve better performance than the original one for computing dot product computation.The paper also presents and verifies an accurate timing model to predict the performance of the proposed implementations on clusters of heterogeneous workstations. Through this model the viability of the proposed implementations can be revealed without the extra effort that would be needed to carry out real testing.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Academic Publications, Ltd."
        },
        {
            "Title": "Performance Analysis and Optimization-A Performance Study of Load Balancing Strategies for Approximate String Matching on an MPI Heterogeneous System Environment",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=5624681816275645258&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:WbkHhVStYXYC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Multiple Pattern Matching: Survey and Experimental Results",
            "Publication year": 2014,
            "Publication url": "http://www.dynamicpublishers.com/Neural/NPSC2014/NPSC-21-2013-4/08-NPSC-34-SA-04.pdf",
            "Abstract": "This paper presents a survey of multiple pattern matching algorithms and experimental results of the well-known Aho-Corasick, Set Horspool, Set Backward Oracle Matching, Wu-Manber and SOG algorithms. The performance of the algorithms is evaluated in terms of preprocessing and searching time for randomly generated data, the genome of Escherichia coli, the FASTA Nucleic Acid (FNA) of the A-thaliana genome, the FASTA Amino Acid (FAA) of the A-thaliana genome, the Swiss Prot. Amino Acid sequence database and English language data for sets of 100 to 100.000 patterns.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:dw5aoL0HVgwC",
            "Publisher": "Dynamic Publishers"
        },
        {
            "Title": "On the combination of collaborative and item-based filtering'",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/51295479/On_the_Combination_of_Collaborative_and_20170110-18433-11t5nz3.pdf",
            "Abstract": "In the past, there has been discussion about an approach that combines the best of the Item-based and the User-based (classic Collaborative Filtering) worlds, by first identifying a reasonably large neighborhood of similar users and then using this subset to derive the item-based recommendation model. We have taken this brief approach outline and developed a full functioning hybrid method. In this paper we first describe the execution steps of this algorithm, then we proceed with extended experiments. The first part of our experiments involves checking various parameter combinations in order to understand the algorithm behavior. The second part of the experiments compares this hybrid approach mainly to plain Item-based Filtering as far as utility and performance are concerned.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Survey for Metaheuristic Algorithms",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=2917749728210553875&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Internal Report"
        },
        {
            "Title": "A Simple Algorithm Implementation for Pattern-Matching with Bounded Gaps in Genomic and Proteomic Sequences, on the Grid EGEE Platform, using an intuitive User Interface",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Dimitrios-Fotiadis/publication/220828079_Unification_of_Heterogeneous_Data_Towards_the_Prediction_of_Oral_Cancer_Reoccurrence/links/56531b6908ae4988a7af4eb7/Unification-of-Heterogeneous-Data-Towards-the-Prediction-of-Oral-Cancer-Reoccurrence.pdf#page=102",
            "Abstract": "In the last decade an unprecedented development in bioinformatics has been observed. An extremely high number of organisms have been sequenced and included in genomic databases. The huge amount of data produced needs to be stored and processed for further analysis. Scientists, have researched algorithms for finding complicated patterns in DNA sequences, but there is a need for computational power and large storage systems, in order to implement specific algorithms in as many as possible DNA sequences stored in large Databases and save the results produced for future use.Recently, a number of pattern matching algorithms that allowing gaps have been introduced and Grid is an emerging techology that seems to be helpful in this kind of biomedical research. In this paper, we present our effort towards the construction of a user friendly Interface for accessing the Grid EGEE platform. The Interface is a specific one and was built to perform Pattern-Matching with Bounded Gaps in Genomic and Proteomic Sequences. The algorithm and the Interface is tested with small and large DNA and protein sequences as an input, downloaded from a gene and protein repository, NCBI (National Center for Biotechnology Information) and the gathered results produced are presented.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personalized News Access",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-211-27389-1_96",
            "Abstract": "PENA (Personalized News Access) is an adaptive system for the personalized access to news. The aims of the system are to collect news from predefined news sites, to select the sections and news in the server that are most relevant for each user and to present the selected news. In this paper are described the news collection process, the techniques adopted for structuring the news archive, the creation, maintenance and update of the user model and the generation of the personalized web pages. This is a preliminary work that is based on the system that is described in [1].",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer, Vienna"
        },
        {
            "Title": "Parallelization of Multiple String Matching on a Cluster Platform",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.100.1893&rep=rep1&type=pdf",
            "Abstract": "This work proposes four parallel methods for multipattern matching which are executed on a heterogeneous cluster. These parallel methods are based on the master-worker paradigm and they implement different partitioning schemes such as static and dynamic load balancing. Furthermore, the parallel methods are analyzed experimentally using the Message Passing Interface (MPI) library on a cluster of heterogeneous workstations. Further, we propose a performance modeling of the parallel methods that can be used to predict the parallel performance on a cluster of workstations. The results by the theoretical performance models have been validated against experimental results of the four parallel methods.",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Big data regression with parallel enhanced and convex incremental extreme learning machines",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/coin.12136",
            "Abstract": "This work considers scalable incremental extreme learning machine (I‐ELM) algorithms, which could be suitable for big data regression. During the training of I‐ELMs, the hidden neurons are presented one by one, and the weights are based solely on simple direct summations, which can be most efficiently mapped on parallel environments. Existing incremental versions of ELMs are the I‐ELM, enhanced incremental ELM (EI‐ELM), and convex incremental ELM (CI‐ELM). We study the enhanced and convex incremental ELM (ECI‐ELM) algorithm, which is a combination of the last 2 versions. The main findings are that ECI‐ELM is fast, accurate, and fully scalable when it operates in a parallel system of distributed memory workstations. Experimental simulations on several benchmark data sets demonstrate that the ECI‐ELM is the most accurate among the existing I‐ELM, EI‐ELM, and CI‐ELM algorithms. We also …",
            "Abstract entirety": 0,
            "Author pub id": "YAzF48oAAAAJ:_WP0DvM6eX8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Parallel Hybrid Evolutionary Algorithm for electrical generator scheduling problem",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=17709173053990177922&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "YAzF48oAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        }
    ]
}]