[{
    "name": "Κωνσταντίνος Μουρλάς",
    "romanize name": "Konstantinos Mourlas",
    "School-Department": "Επικοινωνίας & Μέσων Μαζικής Ενημέρωσης",
    "University": "uoa",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 19426,
    "Scholar name": "Constantinos Mourlas",
    "Scholar id": "dpp4-kkAAAAJ",
    "Affiliation": "Associate Prof, Dept. of Communication and Media Studies, National and Kapodistrian University of",
    "Citedby": 1214,
    "Interests": [
        "User Profiling",
        "Personalization",
        "Recommender Systems",
        "Data Mining",
        "Computational Journalism"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=dpp4-kkAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Feedback Matters! Predicting the Appreciation of Online Articles A Data-Driven Approach",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-99740-7_10",
            "Abstract": "The current era of advanced computational mobile systems, continuous connectivity and multi-variate data has led to the deployment of rich information settings that generate constant and close to real-time feedback. Journalists and authors of articles in the area of Data Journalism have only recently acknowledged the influence that the audience reactions and opinions can bring to effective writing, so to be widely appreciated. Such feedback may be obtained using specific metrics that describe the user behavior during the interaction process like shares, comments, likes, claps, recommendations, or even with the use of specialized mechanisms like mood meters that display certain emotions of readers they experience while reading a story. However, which characteristics can reveal an article’s character or type in relation to the collected data and the audience reflection to the benefit of the author? In this …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A mobile agent approach for ubiquitous and personalized eHealth information systems",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/30674212/UM05-W6.pdf#page=73",
            "Abstract": "The past years have witnessed a heavy investment and research in the eHealth sector. The work of medical practitioners at all levels is becoming more information intensive as sophisticated medical equipment and computer applications are more widely used. At the same time, the demands of the patients/citizens are increasing due to the innovative medical and scientific advances. Digital technologies are becoming more important in health management aiming to reduce the cost and to deliver health care services at a distance. In addition, the Internet is increasingly used by citizens to obtain medical information, therefore it is critical that the Web-based eHealth content and services are developed efficiently, complying with the established quality criteria and being available for all in an adaptive and personalized manner delivered by multiple and ubiquitous delivery channels. In this context, the aim of this paper is to argue that in the face of the existing systems and platforms diversity and information sparsity, mobile agent technologies can provide the base for ubiquitous, transparent, secure, interoperable, and integrated eHealth information systems for the provision of adapted and personalized sustainable services to the citizens.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a human factors ontology for computer-mediated systems",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-88875-8_83",
            "Abstract": "Adapting to user context, individual features and behavior patterns is a topic of great attention nowadays in the field of Web-based and mobile mediated platforms, such as eTraining, eCommerce, eLearning and so on. A challenge is to design an expressive ontology that is composed of human factors that can be used in any application, whether that is the WWW or any other embedded information system. Based on that ontology, engineers will design and develop personalized and adaptive interfaces and software. This will enable easy access to any content while being sufficiently flexible to handle changes in users’ context, perception and available resources, optimizing the content delivery while increasing their comprehension capabilities and satisfaction. Therefore, this paper describes a human factors ontology that has been positively evaluated, called UPPC (User Perceptual Preference …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Specification and verification of quality requirements in distributed multimedia presentations",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1030789/",
            "Abstract": "Continuous media applications have an implied temporal dimension, i.e. they are presented at a particular rate for a particular length of time and if the required rate of presentation is not met the integrity of these media is destroyed. We present a set of language constructs suitable for the definition of the required QoS and the real-time dimension of the media that participate in a multimedia application. We propose a new modeling scheme where we can represent every different presentation by a periodic task and then we describe a method that provides low-level support to these language constructs. The emphasis of the proposed strategy is on deterministic guarantees and can be considered as a next step for the design and the implementation of predictable continuous media applications over a network.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Considering the new user requirements for apt mobile Internet services delivery",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/George-Samaras-2/publication/228911888_Considering_the_new_user_requirements_for_apt_mobile_Internet_services_delivery/links/0deec537f33cabad3e000000/Considering-the-new-user-requirements-for-apt-mobile-Internet-services-delivery.pdf",
            "Abstract": "The explosive growth in the size and use of the World Wide Web as a communication medium has been enthusiastically adopted by the mass market. New developments in ICT along with the growth of mobile and wireless communication allowed service providers to meet these challenges developing new ways of interactions through a variety of channels enabling users to become accustomed to new means of service consumption in an anytime, anywhere and anyhow manner. However, all these radical changes in the Internet services environment have driven service designers and providers to reconsider service delivery processes and interfaces since users’ requirements and demands have been significantly proliferated. This paper will investigate the emergence of the mobile and wireless technology and the new multi-channel constraints and opportunities created. A further examination of the new mobile Internet user needs and requirements will take place in order to ensure proper services Internet design for a sustainable, direct and effective delivery.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A preliminary study on learners physiological measurements in educational hypermedia",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5571136/",
            "Abstract": "This paper presents the findings of a preliminary study about the use of bio-feedback sensors in the context of an educational hypermedia environment, skin conductance, blood volume pulse and heart rate physiological data were gathered. The aim of the study was to examine learners' emotional arousal variability, and possible correlations of the physiological data with other psychological constructs such as trait and self-reported anxiety. Ten university students participated in two identical experiments, with a mixed between-within experimental design (20 samples). According to the findings, heart rate was significantly correlated with trait and self-reported state anxiety (in the second experiment), but not with academic performance in an on-line exam. Skin conductance and blood volume pulse had only marginal variations, perhaps due to the absence of intense stimuli.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital games as a learning tool for children with cognitive disabilities: Literature review and some preliminary methodological and experimental results",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=12622422835881619369&hl=en&oi=scholarr",
            "Abstract": "Through the mutual efforts of devoted game researchers and educational practitioners, the value of digital games for learning is starting to augment in formal education, even though considerable opposition persists. Previous studies have shown that an interactive tool tends to educate users better than a pure textual source and it can be argued that in the educational field of perpetual learners such as students with mental retardation, game is a basic form of pedagogy. However, despite the theoretical connection of existing digital game design with accepted general pedagogy methodologies and practices, the important sector of Special Education has not yet been the objective of considerable research.This paper outlines various theories of Special Educational Needs (SEN) pedagogy with a special interest in mental retardation, in order to demonstrate how educational and commercial games are able to embody the fundamental elements of SEN educational methodologies. More precisely, the paper examines how commercial and educational games support various SEN methodologies and theories regarding mental retardation pedagogy such as those described by Christakis (2002), Kalantzis (1985) and Soulis (2002).",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Embracing a human factor’s ontology in the e-commerce context",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=18259073441281172859&hl=en&oi=scholarr",
            "Abstract": "This paper1 focuses on integrating theories of individual differences in information processing within the context of eCommerce Web-sites. Accordingly, a design of a human factors’ ontology has been proposed, called UPPC (User Perceptual Preference Characteristics), and could be used in any Web-based application for returning an optimized adaptive result to the user. An existing commercial Web-site was filtered through an adaptive mechanism based on that ontology. This mechanism is described by a proposed Web browser extension set of custom xml tags for the imminent automatic transformation and enhancement of the Web-based content. The expected impact of the content reconstruction lies in the increase of users’ satisfaction and efficiency of information processing (both in terms of accuracy and task completion time), while users navigating in the personalized condition rather than the original one.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A real time attachment free, psycho physiological stress and heart rate measurement system",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/article/real-time-attachment-free-psycho/58067",
            "Abstract": "The challenges in the development of a system performing real time detection of physiological parameters are fundamentally aversive because of the incommodities caused by the wires and sensing attachments onto the user, making the measurement sessions uncomfortable. Another factor is that the sensing accessories influence the plausibility of the measurements. In this paper, the authors introduce a system based on a device that can acquire physiological signals from a computer user with no prerequisites, postural, kinetic, or other constraints in the environment of normal usage of the home computer for the detection of their psychosomatic state and optimally their affect and emotional responses. The authors also discuss issues that could otherwise compromise the credibility of the results. Redundancy and special adaptive and corrective algorithms have been developed to improve reliability and achieve …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:8k81kl-MbHgC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Designing location-based gaming applications with teenagers to address early school leaving",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=XQloCwAAQBAJ&oi=fnd&pg=PA50&dq=info:IMJRzPG_aKgJ:scholar.google.com&ots=G_h9RiSneX&sig=aSKBg8WZBE3MIMKGGplbul695OE",
            "Abstract": "Early school leaving (ESL) is an urgent and serious problem, both for individuals and society as a whole. Factors such as learning difficulties, social problems or a lack of motivation, guidance or support all contribute to ESL, although the situation varies across EU countries. High rates of ESL are detrimental to making lifelong learning a reality and increase the risk of unemployment, poverty and social exclusion. Since normally there is not a unique reason for leaving education or vocational training, answers are no easy. In response to these concerns, the Code RED project (http://www. coderedproject. eu) has been created to address the high proportion of drop out from Initial Vocational Education and Training (IVET) and ESL in the UK, Greece, Italy and Cyprus via the development of new games-based learning applications (both desktop and mobile) to inform young adults (aged 16+) of the issues surrounding ESL. Location-based gaming (LBG) applications represent a form of play that is designed to be undertaken on a device in motion which changes the game experience based on the location. The design of these products presents many challenges to developers surrounding user interfaces, processing power and the availability of space. The ARIS platform (Augmented Reality and Interactive Storytelling) covers a broad field of LBG design components such as geo-location data, location-sensitive informational objects, interactive dialogues and QR code input. As such, ARIS has been selected by Code RED researchers to teach LBG and mobile augmented reality design concepts and prototype new design ideas with young adults. This …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Cognitive and Emotional Processes in Web-Based Education: Integrating Human Factors and",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Theresa-Ochoa/publication/252065806_Fostering_Interactivity_through_Formative_Peer_Assessment_in_Web-Based_Collaborative_Learning_Environments/links/58739ddb08ae6eb871c64ecc/Fostering-Interactivity-through-Formative-Peer-Assessment-in-Web-Based-Collaborative-Learning-Environments.pdf",
            "Abstract": "Extant literature on collaborative learning shows that this instructional approach is widely used. In this chapter, the authors discuss the lack of alignment between collaborative learning and assessment practices. They will argue that peer assessment is a form of collaborative learning and a mode of assessment that perfectly fits the purpose of collaborative learning. As such, the authors purposefully depart from the more traditional application of assessment as a summative tool and advocate the consideration of formative peer assessment in collaborative learning. This shift towards formative assessment they believe has the potential to enhance learning. Their goal in this chapter is to review both shortcomings of current peer assessment practice as well as its potential for collaborative learning. Interactivity is central to foster the alignment between assessment and collaborative learning and the authors present a set of guidelines derived from research for increasing interactivity through formative peer assessment among peers in collaborative learning contexts.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Providing assistive ICT learning for people with disabilities through a personalised mobile application",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901549/",
            "Abstract": "ATLEC mobile application is a training and educational software targeted to people of all ages, including those with special needs and disadvantaged groups, regardless of their socio-economic background. ATLEC offers four different ways of accessing learning material about Assistive Technology products based on Information and Communications Technologies (ICT-AT): context based search (wizard based on situational parameters), free search, personalised search, list of favorites. Users are also able to upload their own content and demonstrate/teach others the use of ICT-AT.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrating serious games in the educational experience of students with intellectual disabilities: towards a playful and integrative model",
            "Publication year": 2013,
            "Publication url": "https://www.igi-global.com/article/integrating-serious-games-in-the-educational-experience-of-students-with-intellectual-disabilities/95079",
            "Abstract": "The purpose of this paper is to present a series of observations made by researchers and educators on the integration of serious games in the educational experience of users with intellectual disabilities (ID). Data were gathered from four different studies and different games were used, in order to identify a successful model of games based learning application. Moreover, results that highlight the motivational importance of playful integration towards the promotion of self determination in students with ID, will be presented. According to the authors’ findings, special education can be benefited from the successful integration of digital games in the educational scenario, creating a safe and personalized educational environment for the students, as well as a valuable motivational tool for the educator-especially when the educator takes a threefold role, able to support a hybrid model of digital and non digital play. Trying …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "An AdaptiveWeb System for Integrating Human Factors in Personalization of Web Content",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=6191695648723370277&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Feedback Matters! Predicting the Appreciation",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=661qDwAAQBAJ&oi=fnd&pg=PA147&dq=info:jo3z8jx9CqoJ:scholar.google.com&ots=PCwuappVgS&sig=3X1DDcdD_KGnQuKKeXCtBcO-xo0",
            "Abstract": "The current era of advanced computational mobile systems, continuous connectivity and multi-variate data has led to the deployment of rich information settings that generate constant and close to real-time feedback. Journalists and authors of articles in the area of Data Journalism have only recently acknowledged the influence that the audience reactions and opinions can bring to effective writing, so to be widely appreciated. Such feedback may be obtained using specific metrics that describe the user behavior during the interaction process like shares, comments, likes, claps, recommendations, or even with the use of specialized mechanisms like mood meters that display certain emotions of readers they experience while reading a story. However, which characteristics can reveal an article’s character or type in relation to the collected data and the audience reflection to the benefit of the author? In this paper, we investigate the relationships between the characteristics of an article like structure, style of speech, sentiment, author’s popularity, and its success (number of claps) by employing natural language processing techniques. We highlight the emotions and polarity communicated by an article liable to increase the prediction regarding its acceptability by the audience.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:08ZZubdj9fEC",
            "Publisher": "Springer"
        },
        {
            "Title": "16 Personalizing Web Environments on Cognitive Style",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=JU1P8KNWq8UC&oi=fnd&pg=PA237&dq=info:V-EkG5cHgj4J:scholar.google.com&ots=OeI0vHKWhc&sig=sMmy_q5TIJV0HwWFFtCEqXCmRSs",
            "Abstract": "Finding and presenting information on the World Wide Web (WWW) has been a challenging and urgent problem almost from the beginning of the proliferation of Web sites (Pitkow & Kehoe, 1996). The vast number of Web sites makes it hard, or indeed impossible, to find the appropriate site (Lawrence, Giles, & Bollacker, 1999). Similarly, the growing size and complexity of Web sites makes it very difficult to locate information within specific Web pages. The problem of finding and presenting information in a site has become an important area of research, with several solutions currently being pursued.This research has also provided a good basis for the developing notion of personalization and for the advent of adaptive hypermedia systems (Brusilovsky & Nejdl, 2004; Eklund & Sinclair, 2000) that take into account users’ individual characteristics, aiming to provide tailor-suited information. Therefore, Web adaptation and personalization techniques and paradigms are employed in order to alleviate such problems by presenting information based on the needs and preferences of users, by dynamically adapting the user’s view according to the task at hand. In parallel, Web-based educational applications have also proliferated throughout the extensive development of the Internet, along with a significant research interest on this channel of instruction. Individual differences in e-learning constitute an interdisciplinary research area, and most approaches derive from the fields of computer science and/or psychology, as a result of combined efforts to improve the effectiveness of Web-based education.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:SP6oXDckpogC",
            "Publisher": "Routledge"
        },
        {
            "Title": "An experimental assessment of the use of cognitive and affective factors in adaptive educational hypermedia",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5204072/",
            "Abstract": "In order to assess the positive effect and validity of personalization on the basis of users' cognitive and emotional characteristics, this study presents three subsequent experiments. The first experiment explores the relationship of cognitive style and users' eye gaze behavior as to validate this specific psychological construct in the context of educational hypermedia. The second and third experiments present the effect of a set of human factors (cognitive style, visual working memory span, control/speed of processing, and anxiety) in an adaptive educational system. The eye tracking experiment demonstrated that eye gaze patterns are robustly related to cognitive style (n = 21), while matching the instructional style to users' characteristics was revealed to be statistically significant in optimizing users' performance ( n = 219), with the exception of control/speed of processing. Based on this empirical assessment, this paper …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent User Interfaces: Adaptation and Personalization Systems and Technologies: Adaptation and Personalization Systems and Technologies",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vN2JfK-944UC&oi=fnd&pg=PP1&dq=info:IFjuMipYXi4J:scholar.google.com&ots=7QWKT1A2Q9&sig=cAemiYfOfirc5jTTXSR_pUxmK5o",
            "Abstract": "The field of intelligent user interfaces has received great attention from the research community in the last few years with the explosion of new applications and services designed to be executed in a dynamic and continuously changing environment and aligned to the demands and preferences of the users. Intelligent User Interfaces: Adaptation and Personalization Systems and Technologies innovatively combines broad research areas in intelligent user interfaces to provide an authoritative, comprehensive review of recent studies, state-of-the-art applications, and new methodologies and theories that support the issue of adaptation and personalization in various application levels.\"",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:u_35RYKgDlwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Assessment of Human Factors in Adaptive Hypermedia Environments",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/intelligent-user-interfaces/24468",
            "Abstract": "The plethora of information and services as well as the complicated nature of most Web structures intensify the navigational difficulties that arise when users navigate their way through this large information space. Personalized services that are highly sensitive to the immediate environment and the goals of the user can alleviate the orientation and presentation difficulties experienced by the relatively diverse user population. User profiles serves as the main component of most Web personalization systems. Main scope of this chapter is to present the various techniques employed by such systems with regards to user profiles extraction and introduce a comprehensive user profile, which includes User Perceptual Preference Characteristics. It further analyzes the main intrinsic users’ characteristics like visual, cognitive, and emotional processing parameters incorporated as well as the “traditional” user profile …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:ufrVoPGSRksC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Mapping User Engagement to States of Affect via an Unobtrusive Biofeedback Device-A Dynamic Visualization of Real-time Assessment",
            "Publication year": 2014,
            "Publication url": "https://scitepress.org/papers/2014/47263/",
            "Abstract": "The elicitation of affect can be regarded as an influencing factor upon a person’s cognition, emotional state, mood, attention and motivation. It is also recognizable as an inhibited physiological process expressed by the human brain as induced or suppressed hormonal and neural stimulation that subsequently instigates a physical and mental level of attentiveness attractiveness or aversiveness. Physical reactions to emotion causing events and stimuli in affective computing are classified by direct mapping of facial and postural expressions to corresponding patterns, by using visual and postural observation methods. Despite the fact that physiological assessment is generally more reliable and less error-prone, a higher amount of research has been devoted to visual and postural methods due to the greater complexity and specific knowledge requirements of the former. Concentrating more on the physiological aspect …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:bFI3QPDXJZMC",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "The role of affect in personalized learning",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5194322/",
            "Abstract": "Research on modelling affect and on interfaces adaptation based on affective factors has matured considerably over the past several years. Emotions are considered to play a central role in guiding and regulating learning, performance, behaviour and decision making, by modulating numerous cognitive and physiological activities. The basic objective of this paper is to analyse the way that individuals process their emotions and how they interact with other elements of their information-processing system. It will further underpin their significance taking into consideration the notion of emotion regulation, based on which users expect to receive the most apt personalized providerpsilas content. Special emphasis will be given in dispositional trait affect that serves as an overall estimation of an individualpsilas affective state and statistical evidence will be provided which suggest that affect can have both informational and …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Playing in the special education school: from gamers to game designers",
            "Publication year": 2016,
            "Publication url": "https://repository-edulll.ekt.gr/edulll/handle/10795/3615",
            "Abstract": "In a one year old study, students with mild and moderate intellectual disability, used serious games in their educational practice. Communication, interaction, participation and motivation have been documented in a qualitative study using two different classrooms as case studies. In this paper we describe the documented process of these endeavors, as students turned from gamers into game designers. During the study we were able to document changes in the educational atmosphere, including change of roles and communication re-enforcement between students and teachers. Co-operative game design workshops were organized, as part of the European Project Code RED , targeting students in the risk of early school leaving (ESL), by using game design workshops as a tool of motivation and inclusion.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Studying children’s experience during free-form and formally structured gameplay",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2212868921000015",
            "Abstract": "In this research, we present an assessment study exploring the hypothesis that psychophysiological responses and associated facial expressions should differ significantly while players are engaged in free-form versus formally structured digital games. In the context of this study, real-time psychophysiological measurements of skin trans-conductance (STC) and heart rate (HR) combined with a simultaneous assessment of facial expressions were employed to identify classifiers representing players’ arousal (i.e., excitement) and valence (i.e. pleasure). Formal assessment methods were also used, based on Self-Assessment Manikin (SAM) questionnaires. Experiments on two discrete types of gameplay involved free-form and formally structured games, respectively. The former, according to the model for the quantitative and qualitative assessment in adventure digital games, is considered as a freeform game …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Motivational Aspects of Gaming for Students with Intellectual Disabilities",
            "Publication year": 2013,
            "Publication url": "https://www.igi-global.com/chapter/content/70193",
            "Abstract": "The attention to learners with special needs, in particular those with intellectual disabilities, is an area of continuous development. It is considered important to develop adaptive educational solutions for the integration of people with educational difficulties according to their needs. Digital games provide an attractive and direct platform in order to approach students of every intellectual level. However, practical game based learning application in the special education classroom is still regarded with skepticism by educators, or has been treated solely as an extrinsic reinforcement. Moreover, the design and usage of digital games as a motivational tool for students with intellectual disabilities has not been thoroughly documented. This paper presents a review of the motivational theories and research findings regarding the usage of digital games in the educational experience of users with intellectual disabilities, with a …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:TFP_iSt0sucC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "An ontological cognitive user model for adapting generic Web structures",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5706845/",
            "Abstract": "Adaptation and Personalization systems can benefit with the incorporation of ontological knowledge, especially when it comes to modeling users. In this paper we present a cognitive approach to Web Personalization based on an ontology that contains users' cognitive factors. Accordingly, a human factors' ontology has been designed and developed using RDFa, and could be used in any Web-based application for returning an optimized adaptive result to the user. A commercial Website was filtered through an adaptive mechanism based on that ontology. This mechanism is described by a proposed set of RDFa objects for the imminent dynamic transformation and enhancement of the Web-based content. Consequently this describes the adaptation of user interfaces to the individualistic preferences and needs of users. The expected impact of the content reconstruction lies in the increase of users' satisfaction and …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A dynamic user centric framework for enhancing eservices effectiveness aiming at mass customization",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/dynamic-user-centric-framework-enhancing/38510",
            "Abstract": "Mass customization should be more than just configuring a specific component (hardware or software), but should be seen as the co-design of an entire system, including services, experiences and human satisfaction at the individual as well as at the community level. The main objective of this chapter is to introduce a framework, smartTag, for the dynamic reconstruction of Web content based on human factors. Human factors and users’ characteristics play the most important role during the entire design and implementation of the framework which has the inherent ability to interact with its environment and the user and transparently adapt its behaviour using intelligent techniques, reaching high levels of usability, user satisfaction, effectiveness and quality of service presentation. The initial results of the evaluation have proven that the proposed framework do not degrade the efficiency (in terms of speed and accuracy …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "New Fundamental Profiling Characteristics for Designing Adaptive Web-based Educational Systems.",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/40540616/New_Fundamental_Profiling_Characteristic20151201-29777-1y4m4o7.pdf",
            "Abstract": "There is a growing body of empirical evidence to suggest that users tend to make poor decisions in traditional educational systems as the navigational freedom given to the user leads to comprehension and orientation difficulties in the sense that users may become spatially disoriented, lose sight of educational objectives, skip important content, choose not to answer questions, look for stimulating rather than informative material or simply use the navigational features unwisely. Since the user population is relatively diverse, such traditional static hypermedia applications suffer from an inability to satisfy the heterogeneous needs of the many users. Moreover, with the growth of mobile and wireless communication allowed service providers to develop for users new ways of interactions through a variety of channels in an anyhow, anytime and anywhere manner, but developing also more demanding requirements. This paper makes an extensive reference to user profiling considerations. It underpins the emergence of the mobile and wireless technology and the “new” user profiling requirements that arise, with visual, emotional and cognitive processing parameters incorporated. Eventually, it proposes an adaptive Web-based educational environment based on the user perceptual preference characteristics identified.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards an Adaptive and Personalized Web Interaction using Human Factors, A chapter to appear in: Advances in Semantic Media Adaptation and Personalization, Vol. 2",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=16186488527653852609&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Incorporating human factors in the development of context-aware personalized applications: The next generation of intelligent user interfaces",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/ubiquitous-pervasive-computing/37794",
            "Abstract": "The notion of context in context-aware applications is not merely an issue of external situational circumstances or device/channel properties, but it could also refer to a wide array of user characteristics that have an effect throughout users’ interactions with a system. Human factors such as cognitive traits and current state, from a psychological point of view, are undoubtedly significant in the shaping of the perceived and objective quality of interactions with a system, and by defining context in that sense, personalization may as well become an essential function of context aware applications. The research that is presented in this chapter focuses on identifying human factors that relate to users’ performance in Web applications that involve information processing, and a framework of personalization rules that are expected to increase users’ performance is depicted. The environments that empirical results were derived …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:5nxA0vEk-isC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "ACLP: Abductive constraint logic programming",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0743106699000758",
            "Abstract": "This paper presents the framework of Abductive Constraint Logic Programming (ACLP), which integrates Abductive Logic Programming (ALP) and Constraint Logic Programming (CLP). In ACLP, the task of abduction is supported and enhanced by its non-trivial integration with constraint solving. This integration of constraint solving into abductive reasoning facilitates a general form of constructive abduction and enables the application of abduction to computationally demanding problems. The paper studies the formal declarative and operational semantics of the ACLP framework together with its application to various problems. The general characteristics of the computation of ACLP and of its application to problems are also discussed. Empirical results based on an implementation of the ACLP framework on top of the CLP language of ECLiPSe show that ACLP is computationally viable, with performance …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:M3NEmzRMIkIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Equilibrium State of Interaction: Maximizing User Experience through Optimum Adaptivity States",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3213586.3226195",
            "Abstract": "Nowadays, the role of the computer and the Internet has been upgraded in the lives of people, witnessing a paradigm shift on how users communicate with each other or with their service providers. Main characteristics of this reality include dynamic strategies and conditions, multivariate random interactions with instant feedback, and holistic activities with no clear origins across mixed realities. Thereupon, it seems that traditional human-computer interaction methods and adaptivity practices lack the appropriate dynamicity to fully address these aspects and to explicitly offer holistic solutions for enhancing user experience. In this paper, we propose an alternative model and formalization by combining concepts like equilibria and refocusing the core of investigation into the actual single objective interactions that are generated by the interplay of two (or more) participatory ends over a time interval and which cannot be …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessing the importance of cognitive learning styles over performance in multimedia educational environments",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=2847552524215136672&hl=en&oi=scholarr",
            "Abstract": "The aim of this paper is to introduce the “new” user profiling dimensions [1] that incorporate other than the “traditional” user characteristics, focusing on what we refer to as “user perceptual preference characteristics”. These characteristics consist of cognitive and emotional traits, which define a unique, for each user, information processing and learning procedure. We discuss some primary adaptive hypermedia design considerations and emphasize on vital adaptivity characteristics and implications in the information space. This paper also defines an Adaptive Web-based Educational System incorporating the aforementioned “new” user profiling. In support of these concepts, it lastly presents results of experiments taken place at the Laboratory of New Technologies of the University of Athens, assessing the importance of specific cognitive learning styles and adaptation techniques on Web-based multimedia content …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teachers Roles in Serious Games: Incorporating Serious Games in the Classroom of Students With Intellectual Disabilities",
            "Publication year": 2011,
            "Publication url": "https://search.proquest.com/openview/8842f14611cbdc9bfb0dc87f99b36e15/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "In this paper we revisit the belief that when using a serious game in the classroom, a motivating game used by an open minded teacher, will be more than enough. What we tend to forget is that in order to achieve integration to the educational setting, both the educator's needs and the students' abilities, should be taken into consideration. The purpose of this communication is to present a series of observations made by researchers and educators on the incorporation of serious games in the educational experience of users with intellectual disabilities.[PUBLICATION ABSTRACT]",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Proposing web design enhancements based on specific cognitive factors: An empirical evaluation",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5284912/",
            "Abstract": "The research that is described in this paper focuses on incorporating theories of individual differences in information processing within the context of generic Hypertext and Hypermedia Environments. The main objective of this paper is to introduce a framework for the automatic reconstruction of Web content based on human factors. It is supported that human factors may be used in order to enhance the design of generic hypertext (or hypermedia) content in a measurable and meaningful way. A Web Browser extension set of custom xml tags has been therefore developed in order for the browser to recognize and implement these set of tags for the imminent transformation and enhancement of Web content. An increase on users’ satisfaction as well as more efficient information processing (both in terms of accuracy and task completion time), has been observed in the personalized condition than the original one …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating the Role of News Content and Social Media Interactions for Fake News Detection",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-87031-7_9",
            "Abstract": "Societies across the globe suffer from the effects of disinformation campaigns creating an urgent need for a way of tracking falsehoods before they become widely spread. Although building a detection tool for online disinformation campaigns is a challenging task, this paper attempts to approach this problem by examining content-based features related to language use, emotions, and engagement features through explainable machine learning. We propose a model that, except for the textual attributes, harnesses the predictive power of the users’ interactions on the Facebook platform, and forecasts deceptive content in (i) news articles and in (ii) Facebook news-related posts. The findings of the study show that the proposed model is able to predict misleading news stories with a 98% accuracy based on features such as capitals in the main body, headline length, Facebook likes, the total amount of nouns …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Designing a gamified News Reader for mobile devices",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359614/",
            "Abstract": "Changes in news consumption across the globe show a rapid rise of news audiences accessing stories through their mobile devices, while social media play a huge role in distribution of online news. This paper examines a gamification approach for achieving the ultimate goal of engaging users with a social News Reader application that combines smartphones, social media and gamification in a promising and possibly successful way.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An individual differences approach in adaptive waving of user checkout process in retail eCommerce",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07293-7_44",
            "Abstract": "Developing a usable checkout process is pivotal for e-business success. However, recent research has shown that users frequently abandon their shopping carts and lacking a clear direction through the process. In this context, aiming to improve the usability and overall user experience of checkout processes in ecommerce Web-sites, this paper reports on a study, primarily inspired by concepts driven from theories of individual differences in cognitive processing, and considers content presentation and navigability as a measure of checkout usability and task quality. Concurrent think-aloud, short interviews and questionnaires were conducted with a convenient sample of 15 users to understand the preference of a particular type of checkout process, and users’ task completion time while interacting with ecommerce Web-sites for a set of different checkout scenarios. Preliminary results revealed that cognitive …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Web personalized intelligent user interfaces and processes an enabler of multi-channel ebusiness services sustainability.",
            "Publication year": 2005,
            "Publication url": "https://www.scitepress.org/Papers/2005/14213/14213.pdf",
            "Abstract": "The explosive growth in the size and use of the World Wide Web as a communication medium has been enthusiastically adopted by the mass market to provide an electronic connection between progressive businesses and millions of customers bringing to light the eBusiness sector. However, the nature of most Web structures is static and complicated, and users often lose sight of the goal of their inquiry. Hence, practitioners need to alleviate any navigational difficulties and satisfy the heterogeneous needs of the users to allow web applications of this nature to survive. Main emphasis is given at saving costs, improving efficiency and growth, competitiveness, expanding markets, create new infrastructures to support B2B and B2C Web activities and creating more business opportunities, for local and regional governments. This paper presents the research implications and challenges of the Web Personalization concept as an enabler of eBusiness Services sustainability with the development of Personalized Intelligent User Interfaces and processes.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personality and emotion as determinants of the learning experience: how affective behavior interacts with various components of the learning process",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39262-7_48",
            "Abstract": "The aim of the present study is to develop a model that grasps the complexity of the concepts of personality and affect in a web-based learning environment. Furthermore, it presents the implications that these theoretical and empirical representations can have in an experimental setting. We are investigating the connection between personality factors, emotion regulation and cognitive processing tasks, decision making and problem solving styles. Decision-making and problem solving are cognitive processes where the outcome is a choice between alternatives. They are both an indirect way to make inferences to a person’s learning pattern since learning includes continuous decision making and problem resolution. By implementing our model in the design of a web-based learning personalized setting, we provide evidence that behavior is altered by affective elements in decision making and problem …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An Assessment of Human Factors in Adaptive Hypermedia Environments Intelligent User Interfaces, 2009",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=4582413507879348630&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Incorporating serious games in the classroom of students with intellectual disabilities and the role of the educator",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962086/",
            "Abstract": "The purpose of this communication is to present a series of observations made by researchers and educators on the incorporation of serious games in the educational experience of users with intellectual disabilities.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Individual Learning and Emotional Characteristics in Web-based Communities of Practice",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/web-based-learning-solutions-communities/36359",
            "Abstract": "The knowledge management paradigm of communities of practice can be efficiently realized in Web-based environments, especially if one considers the extended social networks that have proliferated within the Internet. In terms of increasing performance through the exchange of knowledge and shared learning, individual characteristics, such as learners’ preferences that relate to group working, may be of high importance. These preferences have been summarized in cognitive and learning styles typologies, as well as emotional characteristics which define implications that could serve as personalization guidelines for designing collaborative learning environments. This chapter discusses the theoretical assumptions of two distinct families of learning style models, cognitive personality and information processing styles (according to Curry’s onion model), and the role of affection and emotion, in order to explore the …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Personalization systems and processes review based on a predetermined user interface categorization",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.581.3318&rep=rep1&type=pdf",
            "Abstract": "1. Introduction ince 1994, the Internet has emerged as a fundamental information and communication medium that has generated extensive enthusiasm. The Internet has been adopted by the mass market more quickly than any other technology over the past century and is currently providing an electronic connection between progressive businesses and millions of customers and potential customers whose age, education, occupation, interest, and income demographics are excellent for sales.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptation and personalization of web-based multimedia content",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/multimedia-transcoding-mobile-wireless-networks/27200",
            "Abstract": "A traditional multimedia system presents the same static content and suggests the same next page to all users, even though they might have widely differing knowledge of the subject. Such a system suffers from an inability to be all things to all people, especially when the user population is relatively diverse. The rapid growth of mobile and wireless communication allowed service providers to develop new ways of interactions, enabling users to become accustomed to new means of multimedia-based service consumption in an anytime, anywhere, and anyhow manner. This chapter investigates the new multichannel constraints and opportunities emerged by these technologies, as well as the new user-demanding requirements that arise. It further examines the relationship between the adaptation and personalization research considerations, and proposes a three-layer architecture for adaptation and personalization …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:qjMakFHDy7sC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Individual learning characteristics in web-based communities of practice",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.142.8005&rep=rep1&type=pdf",
            "Abstract": "The Knowledge Management paradigm of Communities of Practice can be efficiently realized in web-based environments, especially if one considers the extended social networks that have proliferated within the internet. In terms of increasing performance through the exchange of knowledge and shared learning, individual characteristics, such as learners’ preferences that relate to group working, may be of high importance. These preferences have been summarized in cognitive and learning styles typologies, which also define implications that could serve as personalization guidelines for designing collaborative learning environments. This paper discusses the theoretical assumptions of two distinct families of learning style models, cognitive personality and information processing styles (according to Curry’s onion model), in order to explore the possibilities of personalization at the group level of CoP.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Individual differences in Adaptive educational hypermedia: the effect of cognitive style and visual working memory",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/cognitive-emotional-processes-web-based/35963",
            "Abstract": "The purpose of this chapter is to experimentally explore the effect of individual differences in an adaptive educational hypermedia application. To that direction, the constructs of cognitive style (Cognitive Style Analysis) and visual working memory (visuo-spatial subsystem of Baddeley’s model) were employed as personalization parameters, thus rendering possible the provision of personalized learning environments according to users’ intrinsic characteristics. Two distinct experiments were conducted, with a total sample of 347 university students, seeking out to ground the hypothesis that matching the instructional style to learners’ preferences would increase their performance. Both experiments demonstrated that users in the personalized condition generally outperformed those that were instructed in a condition mismatched to their cognitive style or visual working memory ability.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Fingers on the Screen: game Based learning for students with intellectual disabilities",
            "Publication year": 2016,
            "Publication url": "http://edulll.ekt.gr/edulll/bitstream/10795/3617/2/3617_1.129_%CE%94%CE%97%CE%9C_11_7_11.pdf",
            "Abstract": "Game Based Learning in the special education classroom is still regarded with skepticism by educators, or has been used mainly as an extrinsic reinforcement. This communication presents a series of observations made by researchers and educators on the motivational impact of games in the educational experience of users with intellectual disabilities.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Flow, Fun and Frame in the Classroom: Redefining the Engagement and Self-Determination of Students with Intellectual Disability through Games",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6990189/",
            "Abstract": "The purpose of special education for students with intellectual disability is not only to introduce and improve academic skills but mainly to enhance the quality of the children's life and promote their autonomy and self-determination. Games have been used in special education classrooms as tools of gratification and extrinsic motivation. Contemporary game theorists have gone further to suggest that there is a mapping between the model of learning motivation and the experience of playing digital games. However the question remains: What happens in an educational setting when games are introduced, are digital games able to become an agent of change, enhance self-determination and the willpower to learn for students with intellectual disability? In order to address these questions, we ran a three years old qualitative study with students with mild and moderate intellectual disability and their educators, using …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Personalizing Web environments on user intrinsic characteristics",
            "Publication year": 2008,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/cp_20081173",
            "Abstract": "Individual differences in information processing, as derived from an approach that takes into account cognitive and emotional parameters, serve as a basis for setting a theoretical framework that addresses user profiling issues in web environments. This paper presents empirical results of two distinct efforts to built and evaluate personalized applications in the field of education and commercial web-sites respectively. In the educational context, this approach is shown to optimize learners' performance; the case of commercial environments seems more complex and elusive in measuring actual benefits. The theories involved in constructing a comprehensive information processing model are presented, and the adaptation rules and changes within the environment are discussed, in relation to the empirical results that were gathered throughout the development of the proposed model. It is argued that individual …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Dynamic business processes and virtual communities in wireless ehealth environments",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/dynamic-business-processes-virtual-communities/58829",
            "Abstract": "Computer Supported Collaborative Work (CSCW) related applications tend to be a trend for most successful businesses, organizations and domains nowadays, as is the Healthcare sector. Healthcare specialists often work in remote areas facing many problems and challenges driven mainly from the limitations and constraints of the mobile and wireless technologies in relation to the tasks at hand. Due to the sensitive area of healthcare provision, this chapter discusses that additional features need to be incorporated in current CSCW systems, like the dynamic creation of medical virtual teams, dynamic workflows and the automatic triggered events upon time expiration, in order to be more effective and efficient. In this respect and having in mind the new Web 2.0 characteristics, a set of new features applied in our proposed CSCW system, DITIS, is analyzed in an attempt to encapsulate all the needs of eHealth …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A framework for creating and playing distributed multimedia information systems with qos requirements",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=14783323273872601167&hl=en&oi=scholarr",
            "Abstract": "Costas Mourlas Department of Computer Science, University of Cyprus 75 Kallipoleos str., CY-1678 Nicosia, Cyprus mourlas@ ucy. ac. cy",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The role of emotions in the design of personalized educational systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4561860/",
            "Abstract": "Research on modelling affect and on interfaces adaptation based on affective factors has matured considerably over the past several years, so that designers of educational products are now considering the inclusion of components that take affect into account. Emotions are considered to play a central role in guiding and regulating behaviour by modulating numerous cognitive and physiological activities. This paper introduces a new model in the field of adaptive hypermedia, which integrates cognitive and emotional parameters and attempts to apply them on a web-based learning environment. Our purpose is to improve learning performance and, most importantly, to personalize web-content to userspsila needs and preferences, eradicating known difficulties that occur in traditional approaches. The specific article emphasizes on the emotional aspect of our model, since it presents results of our efforts to measure …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrating cognitive and emotional parameters into designing adaptive hypermedia environments",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.475.3803&rep=rep1&type=pdf",
            "Abstract": "This paper introduces a “new” user profiling model in the field of adaptive hypermedia, which integrates cognitive and emotional parameters, in particular (but not exclusively) when information perception and processing are involved in a Webbased learning environment. The proposed model combines theories from the field of cognitive psychology, applying them on Web-based interactions, in order to improve learning performance and, most importantly, to personalize Webcontent to users’ needs and preferences, eradicating known difficulties that occur in a “one size fits all” approach. The specific article emphasizes on the emotional aspect of our model, since it presents results of our efforts to measure and include Emotional Control parameters, by re-constructing a theory that addresses emotion and is feasible in Web-learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive Presentation and Scheduling of Media Streams on Parallel Storage Servers",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/intelligent-user-interfaces/24478",
            "Abstract": "One way to implement adaptive software is to allocate resources dynamically during run-time rather than statically at design time. Design of adaptive software and adaptive execution of processes are key factors that improve versatility of software and decrease maintenance costs. In this chapter we study the development of adaptive software focusing on a design strategy for the implementation of parallel media servers with an adaptable behaviour. This strategy makes the timing properties and the quality of presentation of a set of media streams predictable. The proposed adaptive scheduling approach exploits the performance of parallel environments and seems a promising method that brings the advantages of parallel computation in media servers. The proposed mechanism provides deterministic service for both Constant Bit Rate (CBR) and Variable Bit Rate (VBR) streams. We present an efficient placement …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:mB3voiENLucC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "EVALUATING THE SIGNIFICANCE OF AFFECTIVE PARAMETERS IN USER LEARNING BEHAVIOR THROUGH DECISION MAKING AND PROBLEM SOLVING PROCESSES",
            "Publication year": 2011,
            "Publication url": "https://aisel.aisnet.org/mcis2011/85/",
            "Abstract": "Research on modeling affect has matured considerably over the past several years, so that designers of interfaces and educational products are now considering the inclusion of components that take affect into account. Emotions are considered to play a central role in guiding and regulating behavior by modulating numerous cognitive and physiological activities. This paper introduces a model which integrates personality and emotional parameters and attempts to apply them on web-based appraisal systems. Our purpose is to improve user performance in various tasks and, most importantly, to investigate users’ affective needs and preferences. We present results of our efforts to measure and include emotional processing parameters, by constructing a theory that addresses emotion and personality and is feasible in Web-based learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adapting generic web structures with semantic web technologies: A cognitive approach",
            "Publication year": 2010,
            "Publication url": "http://www.vldb.org/archives/website/2010/proceedings/files/vldb_2010_workshop/PersDB_2010/resources/PersDB2010_6.pdf",
            "Abstract": "The research described in this paper focuses on adapting generic Hypermedia Environments with the use of Semantic Web technologies. The use of machine understandable semantics in Web applications is increasing significantly, ranging from semantic search queries to personalized product recommendations. Given the significance of human factors in Web structures’ transformations, we propose an Ontological Web Personalization and Adaptation Mechanism based on users’ cognitive parameters. This mechanism consists of a number of interrelated components; modeling users based on their cognitive parameters and providing content adaptation based on semantics. An RDFa schema has been designed that enables standard annotations in any XHTML Web-page, thus making structured data available for the adaptation process, but also for any service or tool that supports the same standard. Our work has been positively evaluated using an existing commercial Web-site that was filtered through the adaptation mechanism based on users’ cognitive parameters.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An individual differences approach in designing ontologies for efficient personalization",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-28977-4_1",
            "Abstract": "This article discusses the potential role of cognitive individual differences in the context of designing ontologies for personalization on users’ characteristics. The theoretical framework of the proposed approach is derived from the long tradition of psychometric testing, incorporating implications from the field of differential and cognitive psychology. The current state of the identification and systematization of mental abilities is depicted, with additional emphasis on the constructs of working memory and cognitive style, on which a proposed ontology is based upon. Also, a summary of previously conducted relevant empirical work is presented, providing support to the notion of introducing personalization into educational and commercial websites. To that end, the main argument of this work is that the enrichment of ontologies with cognitive factors may lead to efficient personalization and measurable benefits for …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Opening the black box of perceived quality: Predicting endorsement on a blog site",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8909487/",
            "Abstract": "Uncovering their readers' perceptions is of key importance for every news media organization to find methods to improve the quality of their product. It has the potential to facilitate journalists' work in attracting attention and gaining a loyal audience. Discovering which elements of a news story influence readers' perceptions has been a cross-disciplinary research goal for the past years, because it can play a crucial role in news dissemination and consumption in the digital age. Drawing upon literature in the various areas such as journalism, psychology, computer science, and AI, this paper proposes a machine learning approach that explores three dimensions of article features that can help predicting the online behavior of the reader. Results show that how the story is written, the topic, and certain aspects of the author's online reputation can affect reader endorsements and the perceived quality of an article.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deducing user states of engagement in real time by using a purpose built unobtrusive physiological measurement device: an empirical study and HCI design challenges",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07527-3_6",
            "Abstract": "Human emotion is a psycho-physiological state in most cases not obvious to the subject. Different permutations of emotional constituents sometimes cause similar outward expressions; therefore facial expression methods cannot achieve reliable estimates. Sensing physiological manifestations of hormonal and neural stimulations instigated by emotion and affect is widely accepted as a credible method of detecting psycho-physiological states. A major impediment in interactive environments employing physiological sensing affecting the credibility of measurements is the physical and psychological impairment caused by electrodes and wiring used for the acquisition of signals. In the system described in this paper, the above obstacle has been overcome. Physiological signals acquired via an in-house developed computer mouse and coinciding physiological patterns were investigated as reactions to …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Deterministic scheduling of CBR and VBR media flows on parallel media servers",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45706-2_114",
            "Abstract": "We study a new design strategy for the implementation of Parallel Media Servers with a predictable behavior. This strategy makes the timing properties and the quality of presentation of a set of media streams predictable. The proposed real-time scheduling approach exploits the performance of parallel environments and seems a promising method that brings the advantages of parallel computation in media servers. The proposed mechanism provides deterministic service for both Constant Bit Rate (CBR) and Variable Bit Rate (VBR) streams. A prototype implementation of the proposed parallel media server illustrates the concepts of server allocation and scheduling of continuous media streams.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Implementing affect parameters in personalized web-based design",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02580-8_35",
            "Abstract": "Researchers used to believe that emotional processes are beyond the scope of a scientific study. Recent advances in cognitive science and artificial intelligence, however, suggest that there is nothing mystical about emotional processes. Affective neuroscience and psychology have reported that human affect and emotional experience play a significant, and useful, role in human learning and decision making. Emotions are considered to play a central role in guiding and regulating learning, performance, behaviour and decision making, by modulating numerous cognitive and physiological activities. Our purpose is to improve learning performance and, most importantly, to personalize web-content to users’ needs and preferences, eradicating known difficulties that occur in traditional approaches. Affect parameters are implemented, by constructing a theory that addresses emotion and is feasible in Web …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Realtime BioSensing System Assessing Subconscious Responses of Engagement: An Evaluation Study",
            "Publication year": 2018,
            "Publication url": "https://www.igi-global.com/chapter/realtime-biosensing-system-assessing-subconscious-responses-of-engagement/199546",
            "Abstract": "Inferences of physiological responses are seen increasingly in dynamically adaptive environments, towards personalization, learning, and interactive instructional design. In search of conclusive interpretations, scientists consider bio-sensing and physiological metrics in addition to formal assessment methodologies. Devices developed for laboratory use impose limitations that yield them prohibitively unsuitable for wider use due to their strong dependence on electrodes and kinetic restrictions. Additionally, synchronisation, diverse format and frequencies of data produced by assorted equipment, contribute to precision concerns. The development cited in this chapter circumvents the above constraints by using a proprietary real-time system. An algorithm assessing coinciding excitation of two important physiological quantities is used to evaluate classifiers indicative to focused attention and engagement. Experiments …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:WbkHhVStYXYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "The effects of personality type in user-centered appraisal systems",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21602-2_42",
            "Abstract": "The basic objective of this paper is to make an extensive reference of a combination of concepts and techniques coming from different research areas, Psychology and Web personalization technologies, both of which focus upon the user. It has been attempted to approach the theoretical considerations and technological parameters that can provide the most comprehensive user profile, under a common filtering element, supporting the provision of the most apt and optimized user-centered web-based result. It further underpins the significance of the comprehensive user profile that incorporates not only the traditional user characteristics, but other intrinsic values of the user such as user psychological preferences (affect, personality and emotional processing parameters). Eventually, this paper introduces our first experimental results that concern the concept of personality and its effect on decision making and …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The Role of Human Factors in Web Personalization Environments",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/role-human-factors-web-personalization/14068",
            "Abstract": "The explosive growth in the size and use of the World Wide Web as a communication medium as well as the new developments in ICT allowed service providers to meet these challenges, developing new ways of interactions through a variety of channels enabling users to become accustomed to new means of service consumption in an “anytime, anywhere and anyhow” manner. However, the nature of most information structures is static and complicated, and users often lose sight of the goal of their inquiry, look for stimulating rather than informative material, or even use the navigational features unwisely. Hence, researchers and practitioners studied adaptivity and personalization to address the comprehension and orientation difficulties presented in such systems, to alleviate such navigational difficulties and satisfy the heterogeneous needs of the users, allowing at the same time Web applications of this nature to …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:dhFuZR0502QC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "The motivational circle of games: integrating location based games and computer games in the educational experience of users with educational disabilities",
            "Publication year": 2016,
            "Publication url": "http://edulll.ekt.gr/edulll/handle/10795/3613",
            "Abstract": "The purpose of this paper is to present a series of observations made by researchers and educators on the incorporation of games in the educational experience of users with mild and moderate intellectual disabilities (ID). We will describe findings that sketch motivational alteration of users with intellectual disabilities, as well as the role of the educator and caretakers regarding the integration of games in their educational scenarios. In a period of five years we had the opportunity to observe the application of serious games in classrooms and day care centers for students with mild and moderate intellectual disabilities. in four different studies. Specifically designed serious games were applied in different educational settings, in order to identify the motivational power of digital games in Special Education. During these four different studies, children and young adults with intellectual disability used digital online and standalone pc games, as well as location based games specifically designed for users with intellectual disability in formal and informal educational and social training settings. The outcomes revealed that games have the potentials to be a motivational tool for Special Education, especially when applied along with playful analog narrative as a holistic approach.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Gamified News Application for Mobile Devices: An Approach that Turns Digital News Readers into Players of a Social Network",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-40216-1_53",
            "Abstract": "Gamification is a well known approach nowadays for achieving the ultimate goal of motivating loyalty with a brand and engaging users with given tasks in a variety of fields. However, attempts made to use gamification techniques in news industry have given poor results, pointing to the conclusion that journalism may not an open field for gamification to thrive. At the same time changes in news consumption across the globe show a rapid rise of news audiences accessing stories through their mobile devices, while social media play a huge role in distribution of online news. This paper examines the combination of these three trends, gamification, smartphones and social media in a promising and possibly successful way.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:maZDTaKrznsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Innovative personalization issues for providing user-centric mGovernment services",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/George-Samaras-2/publication/228342158_Innovative_Personalization_Issues_for_Providing_User-Centric_mGovernment_Services/links/0deec537f33cc3941c000000/Innovative-Personalization-Issues-for-Providing-User-Centric-mGovernment-Services.pdf",
            "Abstract": "Advances in mGovernment oriented technologies and services are taking place with a considerable speed around the world. As communications and other IT usage becomes an integral part of many people’s lives and the available products and services become more varied and capable, users expect to be able to personalize a service to meet their individual needs and preferences. Therefore, due to the heterogeneous users’ needs and requirements user profiling could be considered an essential component of personalization systems as a successful step towards the identification of users’ preferences. However, could user profiling nowadays be considered complete enough, taking into account all the vital parameters of users’ characteristics, in order for these systems to provide them with the most user-centric result? This paper introduces a “new” comprehensive user profiling, incorporating the User Perceptual Preference Characteristics that serves as the core element for filtering raw mGovernment services content.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Human Factors As A Parameter For Improving Interface Usability And User Satisfaction.",
            "Publication year": 2009,
            "Publication url": "https://aisel.aisnet.org/cgi/viewcontent.cgi?article=1133&context=mcis2009",
            "Abstract": "The endeavour to optimize HCI should integrate a wide array of user characteristics that have an effect throughout users’ interactions with a system. Human factors such as cognitive traits and current state, from a psychological point of view, are undoubtedly significant in the shaping of the perceived and objective quality of interactions with a system. The research that is presented in this paper focuses on identifying human factors that relate to users’ performance in Web applications that involve information processing, and a framework of personalization rules that are expected to increase users’ performance is depicted. The empirical results that are presented are derived from environments both learning and commercial; in the case of e-learning personalization was beneficial, while the interaction with a commercial site needs to be further investigated due to the implicit character of information processing in the Web.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A semantic approach of an adaptive and personalized web-based learning content-The case of AdaptiveWeb",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4414389/",
            "Abstract": "Adapting to user context, individual features and behaviour patterns is a topic of great attention nowadays in the field of Web-based and mobile learning. A challenge is to design personalized interfaces and software enabling easy access to the learning content while being sufficiently flexible to handle changes in a user's context, perception and available resources. This paper presents a Web-based adaptation and personalization system, AdaptiveWeb, that uses cognitive aspects as its core filtering element. The proposed system focuses upon the creation of a comprehensive user profiling that combines parameters that analyze the most intrinsic users' characteristics like visual, cognitive, and emotional processing parameters as well as the \"traditional\" user profiling characteristics and together tend to give an optimized adapted and personalized result to the user. The use of semantics enables the openness of the …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Personalized Learning in Hypermedia Environments",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=y92dDwAAQBAJ&oi=fnd&pg=PA179&dq=info:cOiQ9oOgoo0J:scholar.google.com&ots=HER9rgbpTz&sig=xyZvZow-kK0xbT8zaItP12m3PIE",
            "Abstract": "Distance learning (or eLearning) is considered one of the most rapidly evolving application areas of the Web that improves the traditional educational processes and methodologies of knowledge transfer. In recent years, there has been significant research and experimentation around the adaptation and personalization of the eLearning hypermedia that mainly concerns the timely delivery and adjustment of the content to user’s needs and perceptual characteristics. This chapter provides a new comprehensive approach of reconstructing eLearning content; by creating a user profile based on specific metrics of cognitive processing parameters (such as cognitive style, cognitive processing speed efficiency, working memory factors and affective parameters) that have specific impact into the information space. Such approach may be proved to be very useful in assisting and facilitating a student to better understand eLearning content and therefore increase his/her academic performance. In view of that, an adaptation and personalization Web-based environment has been developed. It is detached into a number of interrelated components, each one representing a stand alone Web system. An evaluation of the proposed environment is presented with the results being highly promising and encouraging for the continuation of our research, since there has been identified significant increase of learners’ academic performance when interacting with the personalized eLearning environment that is matched to their cognitive and affective parameters as well as visual working memory span capabilities.Adapting to user context, individual features and …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Realizing comprehensive user profile as the core element of adaptive and personalized communication environments and systems",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8139985/",
            "Abstract": "Challenges today in the Web personalization and adaptation research area range from heterogeneous user needs and user environment issues such as current location and time to multi-channel delivery of applications concerning Web-based content related to services, educational multimedia, entertainment, commerce, etc. Nowadays, most Web personalization systems implement various techniques to extract the user profiles, which serve as the main component of such systems. Based on given user preferences and navigation behavior, the Web-based content returns the requested personalized result. The main scope of this paper is to present the various techniques employed by such systems with regard to extraction of user profiles and to introduce a comprehensive user profilethat includes user perceptual preference characteristics. It further analyzes the main intrinsic user characteristics such as visual …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:d1gkVwhDpl0C",
            "Publisher": "OUP"
        },
        {
            "Title": "Improving M-Commerce services Effectiveness with the use of user-Centric Content Delivery",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/article/improving-commerce-services-effectiveness-use/3504",
            "Abstract": "Advances in wireless communications and information technology have made the Mobile Web a reality. The Mobile Web is the response to the need for anytime, anywhere access to information and services. Many wireless applications have already been deployed and are available to customers via their mobile phones and wirelessly-connected PDAs. However, as communications and other IT usage becomes an integral part of many people’s lives and the available products and services become more varied and capable, users expect to be able to personalize a service to meet their individual needs and preferences. The involved sectors have to meet these challenges by reengineering their front-end and back-end office. This article will examine the interaction requirements regarding a friendlier, personalized and more effective multi-channel services environment. It will present the mobility challenges and …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Cognitive and emotional processes in Web-based education: Integrating human factors and personalization.",
            "Publication year": 2009,
            "Publication url": "https://psycnet.apa.org/record/2014-39381-000",
            "Abstract": "Web-based interactions are becoming more prominent in every aspect of a person’s activities, transforming both individuals’ lives and society as a whole. In this context, learning as an integral part of personal and social development should not be excluded from this phenomenal proliferation of Web-based activities. The availability of vast Web technologies and resources could potentially be turned to advantage in favor of better learning environments, available to all individuals regardless of demographic limitations. This notion of e-learning environments and applications that are accessible to anyone, anywhere, and anytime has indeed generated academic research and applicable realizations. All these efforts are quite differentiated from traditional instructional methods, due to the very different nature of the context and the medium. However, the extent of the success of these efforts is yet to be established, since it …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:WF5omc3nYNoC",
            "Publisher": "Information Science Reference/IGI Global"
        },
        {
            "Title": "An optimized review of adaptive hypermedia and web personalization–sharing the same objective",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.104.8885&rep=rep1&type=pdf",
            "Abstract": "A traditional system presents the same static explanation and suggests the same next page to all users, even though they might have widely differing knowledge of the subject. Such a system suffers from an inability to be all things to all people, especially when the user population is relatively diverse; users often lose sight of the goal of their inquiry, look for stimulating rather than informative material, or even use the navigational features unwisely. To this end, researchers and practitioners studied adaptivity and personalization to address the comprehension and orientation difficulties presented in such systems to alleviate such navigational difficulties and instead, satisfy the heterogeneous needs of the user population. This paper investigates the relationship between these two areas of research which effectively share the same goal: to adapt according to the specific user characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Capturing essential intrinsic user behaviour values for the design of comprehensive web-based personalized environments",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563207001343",
            "Abstract": "Advances in Web-based oriented technologies and services are taking place with a considerable speed around the world. As communications and IT usage become an integral part of many people’s lives and the available products and services become more varied and sophisticated, users expect to be able to personalize a service to meet their individual needs and preferences. Due to the heterogeneous users’ needs and requirements, user modeling could be considered as a successful step towards the identification of users’ preferences. However, could user profiling nowadays be considered complete enough? Are all the vital parameters of users’ characteristics are taken into account in order for the Web-based systems to provide them with the most user-centric result? This paper introduces a comprehensive user profiling, incorporating the User Perceptual Preference Characteristics, that serves as the core …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Embracing Cognitive Aspects in Web Personalization Environments--The AdaptiveWeb Architecture",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4281055/",
            "Abstract": "This paper presents a Web adaptation and personalization architecture that uses cognitive aspects as its core filtering element. The innovation of the proposed architecture focuses upon the creation of a comprehensive user profiling that combines parameters that analyze the most intrinsic users' characteristics like visual, cognitive, and emotional processing parameters as well as the \"traditional\" user profiling characteristics and together tend to give the most optimized adapted and personalized result to the user.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Intelligent Web-based Healthcare System: The Case of DYMOS",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-1274-9_3",
            "Abstract": "Today’s information age is accelerating at quantum speed. Advances, such as the Internet and high-speed networks, have propelled the never-ending quest for information. In this regard, eHealth services is a continuously growing sector, driving the need for advances in the dynamic working environment of different medical actors promoting the effective collaboration within the given contextual and technological constraints. Henceforth, this chapter defines and classifies the various virtual communities in the eHealth sector, analyses existing related approaches and identifies current problems, stressing emphasis on the notion of workflow management within the multi/cross-organizational environment. It further proposes an eHealth system, DYMOS, which has been based on a suggested extended collaboration model, with features that tend to tackle the identified weaknesses. Finally, it presents a positive …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Mapping User Engagement to States of Affect via an Unobtrusive Biofeedback Device",
            "Publication year": 2014,
            "Publication url": "https://www.scitepress.org/Papers/2014/47263/47263.pdf",
            "Abstract": "The elicitation of affect can be regarded as an influencing factor upon a person’s cognition, emotional state, mood, attention and motivation. It is also recognizable as an inhibited physiological process expressed by the human brain as induced or suppressed hormonal and neural stimulation that subsequently instigates a physical and mental level of attentiveness attractiveness or aversiveness. Physical reactions to emotion causing events and stimuli in affective computing are classified by direct mapping of facial and postural expressions to corresponding patterns, by using visual and postural observation methods. Despite the fact that physiological assessment is generally more reliable and less error-prone, a higher amount of research has been devoted to visual and postural methods due to the greater complexity and specific knowledge requirements of the former. Concentrating more on the physiological aspect of assessing affect, we have developed a biofeedback device, sensing reactions instigated by emotion-causing events and results have been assessed in real-time using suitable visualization methods. In previous attempts to acquire this type of measurements, human subjects were physically and psychologically impaired by the electrodes and wiring attachments used for the acquisition of signals and therefore validity of data was to some extent in question. In order to achieve an uncompromising assessment environment we designed a system that acquires heart rate and stress measurements via an ordinarily looking computer mouse. Certain combinations of heart rate precipitation and tonic level/phasic response of stress levels …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Predictability and resource management in distributed multimedia presentations",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45591-4_103",
            "Abstract": "The continuous media applications have an implied temporal dimension, i.e. they are presented at a particular rate for a particular length of time and if the required rate of presentation is not met the integrity of these media is destroyed. We present a set of language constructs suitable for the definition of the required QoS and a new real-time environment that provides low-level support to these constructs. The emphasis of the proposed strategy is given on deterministic guarantees and can be considered as a next step for the design and the implementation of predictable continuous media applications over a network.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Working memory span and e-learning: The effect of personalization techniques on learners’ performance",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13470-8_8",
            "Abstract": "This research paper presents the positive effect of incorporating individuals’ working memory (WM) span as a personalization factor in terms of improving users’ academic performance in the context of adaptive educational hypermedia. The psychological construct of WM is robustly related to information processing and learning, while there is a wide differentiation of WM span among individuals. Hence, in an effort to examine the role of cognitive and affective factors in adaptive hypermedia along with psychometric user profiling considerations, WM has a central role in the authors’ effort to develop a user information processing model. Encouraged by previous findings, a larger scale study has been conducted with the participation of 230 university students in order to elucidate if it is possible through personalization to increase the performance of learners with lower levels of WM span. According to the results …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Forecasting ÒIn the PocketÓ: Mobile Devices Can Improve Collaboration",
            "Publication year": 2014,
            "Publication url": "https://ideas.repec.org/a/for/ijafaa/y2014i32p13-18.html",
            "Abstract": "The increasing popularity of PDAs, smartphones, tablet computers, and other mobile devices opens up new opportunities for communication and collaboration on business forecasts. As the authors tell us, mobile forecasting (m-forecasting) applications may streamline approaches to collaboration between retailers and suppliers, thus contributing to the provision and exchange of product information, especially since forecasts are strongly tied to local context knowledge. In this article, we present specific approaches for the future of m-forecasting applications. Copyright International Institute of Forecasters, 2014",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "International Institute of Forecasters"
        },
        {
            "Title": "043 ADAPTING mLEARNING ENVIRONMENTS ON LEARNERS’COGNITIVE STYLES AND VISUAL WORKING MEMORY SPAN",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Germanakos/publication/221215697_Adapting_mLearning_Environments_on_Learners'_Cognitive_Styles_and_Visual_Working_Memory_Span/links/0a85e53c6b98f97268000000/Adapting-mLearning-Environments-on-Learners-Cognitive-Styles-and-Visual-Working-Memory-Span.pdf",
            "Abstract": "The research that is described in this paper focuses on incorporating theories of individual differences in information processing within the context of mobile hypertext and hypermedia interactive environments. Based on previous findings of the authors in the field of adaptive eLearning, the main purpose was to enhance the quality of information presentation and users’ interactions in the Web by matching their specific needs and preferences. Our more recent experiments, explore how to improve learning process by adapting course content presentation to student cognitive styles and capabilities in mobile environments such as PDA phones. A framework has been developed to comprehensively model student’s cognitive styles and visual working memory span and present the appropriate subject matter, including the content, format, guidance, etc. to suit an individual student by increasing efficiency during interaction. Main aim is to overcome constraints like small screen size and processing/memory capabilities for navigation enhancements that limit the presentation and guidance of the material. An increase on users’ satisfaction as well as more efficient information processing (both in terms of accuracy and task completion time), has been observed in the personalized condition than the original one. Consequently, it is supported that human factors may be used in order to enhance the design of mobile hypertext (or hypermedia) environments in a measurable and meaningful way.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent Authoring Tools for Enhancing Mass Customization of e-Services-The smarTag Framework.",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Germanakos/publication/220709297_Intelligent_Authoring_Tools_for_Enhancing_Mass_Customization_of_e-Services_-_The_smarTag_Framework/links/00b4953c6b814ef7ae000000/Intelligent-Authoring-Tools-for-Enhancing-Mass-Customization-of-e-Services-The-smarTag-Framework.pdf",
            "Abstract": "Mass customization should be more than just configuring a specific component (hardware or software), but should be seen as the co-design of an entire system, including services, experiences and human satisfaction at the individual as well as at the community level. The main objective of this paper is to introduce a framework for the automatic reconstruction of Web content based on human factors. Human factors and users’ characteristics play the most important role during the entire design and implementation of the framework which has the inherent ability to interact with its environment and the user and transparently adapt its behaviour using intelligent techniques, reaching high levels of usability, user satisfaction, effectiveness and quality of service presentation. The initial results of the evaluation have proven that the proposed framework do not degrade the efficiency (in terms of speed and accuracy) during the Web content adaptation process.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Engaging students with intellectual disabilities through location based games",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/33762213/g4l2013_08.pdf",
            "Abstract": "Learning, is both an emotional and cognitive process and according to researchers and teachers worldwide, when players are engaged in activities that are intrinsically motivating, they are more prone to demonstrate deep learning [1]. Since 1981 when Malone used digital games as a medium in order to analyze intrinsic motivation, digital games have been reported to stimulate the students’ interest, while motivating them to deploy control, curiosity and imagination [2][3].",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nikos Tsianos",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=4437899343009124120&hl=en&oi=scholarr",
            "Abstract": "The purpose of this chapter is to experimentally explore the effect of individual differences in an adaptive educational hypermedia application. To that direction, the constructs of cognitive style (Cognitive Style",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:LPZeul_q3PIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Eye-tracking users' behavior in relation to cognitive style within an e-learning environment",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5194241/",
            "Abstract": "Eye-tracking measurements may be used as a method of identifying userspsila actual behavior in a hypermedia setting. In this research, an eye-tracking experiment was conducted in order to validate the construct of cognitive style as a personalization parameter in adaptive e-Learning systems. The main research question was whether the verbalizer/imager axis of the cognitive style analysis theory reflects actual preferences in an e-learning environment and properly identifies learner types. The findings from a sample of 21 participants reveal statistically significant differences among types of learners; as hypothesized, imagers concentrate on visual content, verbalizers on text, while intermediates are placed in between.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Emotional web-based design: the concepts of emotional experience and emotional expression",
            "Publication year": 2011,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/54375",
            "Abstract": "For many years people have been trying to measure differences between individuals. Over the course of time, a combination of developments in statistical know-how and the evolution of thought within psychology enabled the refinement of measures, and subsequently the assessment of more specific factors in the field of individual differences like different kinds of ability, affect and emotion. This knowledge has been used in many areas within psychology and at the same time the advancement of technology has enabled the development of web-based systems that measure specific factors relevant to specific situations. Our research focuses on the emotional mechanisms that drive human behaviour in general and how we can implement a set of rules to web design so that we can promote system adaptability on the very important field of human emotions which is at the same time extremely difficult to describe and define. In this paper we introduce our model of emotion regulation and we present our first experimental results that concern the concepts of emotional experience and emotional expression and their effect on decision making and problem solving styles. Furthermore, we present the implications that these theoretical and empirical representations can have in web applications and design. © 2011 IADIS.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Event-driven coordination of real-time components",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1030834/",
            "Abstract": "The coordination paradigm has been used extensively as a mechanism for software composition and integration. However, relatively little work has been done for the cases where the software components involved have real-time requirements. The paper presents an extension to a state-of-the-art controller event-driven coordination language with real-time capabilities. It then illustrates the expressiveness of the proposed extensions by means of modeling a distributed multimedia application. Finally, it discusses how these extensions can be supported by the underlying architecture.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "User-centric profiling on the basis of cognitive and emotional characteristics: An empirical study",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-70987-9_24",
            "Abstract": "In order to clarify whether extending learners’ profiles in an adaptive educational system to cognitive and emotional characteristics may have a positive effect on performance, we conducted an empirical study that consists of two subsequent experiments. The human factors that were taken into consideration in the personalization process were cognitive style, visual working memory span, control/speed of processing and anxiety. With the exception of control/speed of processing, matching the instructional style to users’ characteristics was revealed to be statistically significant in optimizing their performance (n=219). On the basis of this empirical assessment, this paper argues that individual differences at this intrinsic level are important, and their main effect can be manipulated by taking advantage of adaptive technologies.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Working memory differences in e-learning environments: Optimization of learners’ performance through personalization",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02247-0_41",
            "Abstract": "Working memory (WM) is a psychological construct that has a major effect on information processing, thus signifying its importance when considering individual differences and adaptive educational hypermedia. Previous work of the authors in the field has demonstrated that personalization on human factors, including the WM sub-component of visuospatial sketchpad, may assist learners in optimizing their performance. To that end, a deeper approach in WM has been carried out, both in terms of more accurate measurements and more elaborated adaptation techniques. This paper presents results from a sample of 80 university students, underpinning the importance of WM in the context of an e-learning application in a statistically robust way. In short, learners that have low WM span expectedly perform worse than learners with higher levels of WM span; however, through proper personalization techniques …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Gamified mobile/online learning for personal care givers for people with disabilities and older people",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7399485/",
            "Abstract": "The paper examines how a gamification approach can enhance and enrich the learning experience of personal care givers (PCGs) for people with disabilities and older people (potential or in active employment). Using game elements that pervade the M-Care mobile PCG training application, users are given the opportunity to self-assess their newly acquired knowledge and through a rewards system they are motivated to follow further training courses. The gamified experience is embedded in a broader educational logic including an extensive training curriculum and innovative online and mobile training platforms.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptability management and deterministic scheduling of media flows on parallel storage servers",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1639427/",
            "Abstract": "We study a new design strategy for the implementation of parallel media servers with a predictable behavior. This strategy makes the timing properties and the quality of presentation of a set of media streams predictable. The proposed strategy provides deterministic guarantees and service reliability for each stream that can't be compromised by server contention. Our real-time scheduling approach exploits the performance of parallel environments and seems a promising method that brings the advantages of parallel computation in media servers. The proposed mechanism provides deterministic service for both constant bit rate (CBR) and variable bit rate (VBR) streams. We present an efficient placement strategy for data frames as well as an adaptability strategy that allows appropriate frames to be dropped without sacrificing the ability to present multimedia applications predictably in time. A prototype …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementing psychological parameters in a web-based appraisal system",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5571377/",
            "Abstract": "For many years people have been trying to measure differences between individuals. Over the course of time, a combination of developments in statistical know-how and the evolution of thought within psychology enabled the refinement of measures, and subsequently the assessment of more specific factors in the field of individual differences like different kinds of ability, affect and personality. This knowledge has been used in many areas within psychology and at the same time the advancement of technology has enabled the development of web-based appraisal systems that measure specific factors relevant to specific situations. This paper presents the theory behind a web-based assessment system and some first experimental results that will lead to the design of the web environment.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Engaging students with intellectual disabilities through location based games based learning",
            "Publication year": 2016,
            "Publication url": "http://repository.edulll.gr/edulll/handle/10795/3619",
            "Abstract": "Learning, is both an emotional and cognitive process and according to researchers and teachers worldwirde, when players are engaged in activities that are intrinsically motivating, they are more prone to demonstrate deep learning. Since 1981 when Malone used digital games as a medium in order to analyze intrinsic motivation, digital games have been reported to stimulate the students’ interest, while motivating them to deploy control, curiosity and imagination. Studies within our research grouping have shown that Digital Games Based Learning (DGBL) can have a positive effect on some of the core development needs of people with Intellectual disabilities and associated sensory impairments. One current are of interests is the expansion of DGBL activities on mobile platforms. The RECALL Project describes the development and evaluation of a novel route learning system for people with disabilities using locative based services (on the Android OS) and is the output of a EU award (504970-LLP-1-2009-1-UK-KA3-KA3MP). In the following paper we will present piloting findings from the piloting use of RouteMate application as well as an initial proposal of a playful locative DGBL integration in the educational experience of users with intellectual disabilities.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating the significance of cognitive and emotional parameters in e-learning adaptive environments",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/45507709/EVALUATING_THE_SIGNIFICANCE_OF_COGNITIVE20160510-9841-16s2nuc.pdf",
            "Abstract": "This paper presents experimental evidence supporting the notion that users’ individual information processing characteristics are significant in the context of e-learning environments. In the wider field of Adaptive Hypermedia research, we have implemented into our system a three dimension user model (consisted of cognitive and emotional parameters) as the main filter for personalization. Consequently, we conducted an experiment, consisted of two sequential phases, in order to measure the effect of adaptation on the basis of our model (User Perceptual Preferences), in contrast to web learning content that does not suit users’ needs and preferences. The dependent variable was performance in an exam procedure, as the main indicator of effective information perception and processing.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Motivating the demotivated classroom: gaming as a motivational medium for students with intellectual disability and their educators",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/motivating-demotivated-classroom/52520",
            "Abstract": "Findings from the educational literature and experimental observations, as well as case studies from field studies will be presented and discussed, in order to demonstrate how games are able to constitute a powerful educational and motivational medium in a SEN classroom.",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:Se3iqnhoufwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Enhancing eLearning Environments with Users’ Cognitive Factors: The case of EKPAIDEION",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/30908571/Enhancing_eLearning_Environments_with_Users__Cognitive_Factors_EKPAIDEION.pdf",
            "Abstract": "We are now witnessing an extensive and gradually increasing use of the World Wide Web space, proved to be a quite favourable way of communication, due to its speed, simplicity and efficiency. Distance learning (or eLearning) is considered one of the most rapidly evolving application areas of the Web that improves the traditional educational processes and methodologies of knowledge transfer. In recent years, there has been significant research and experimentation around the adaptation and personalization of the eLearning hypermedia that mainly concerns the timely delivery and adjustment of the content to user’s needs and perceptual characteristics. This paper provides a new comprehensive way of reconstructing eLearning content; by creating a user profile based on specific metrics of cognitive processing parameters (such as cognitive style, cognitive processing speed efficiency and working memory factors) that have specific impact into the information space. The combination of the cognitive user profile and the ‘traditional’user characteristics (eg age, gender, profession) could become the main personalization filter for eLearning environments. Such approach may be proved to be very useful in assisting and facilitating a student to better understand eLearning content.. In view of that, an adaptation and personalization Web-based environment, namely EKPAIDEION, has been developed. An evaluation with approximately 128 users has been conducted with the results being highly promising and encouraging, since there has been identified significant increase of learners’ academic performance when interacting with our personalized …",
            "Abstract entirety": 0,
            "Author pub id": "dpp4-kkAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Toward an Adaptive and Personalized Web Interaction Using Human Factors",
            "Publication year": 2009,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420076653-15/toward-adaptive-personalized-web-interaction-using-human-factors-panagiotis-germanakos-nikos-tsianos-zacharias-lekkas-constantinos-mourlas-mario-belk-george-samaras",
            "Abstract": "As the eServices sector rapidly evolves, the need for Web structures that satisfy the heterogeneous needs of its users becomes more evident (Germanakos et al., 2005).",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Auerbach Publications"
        },
        {
            "Title": "Forecasting “In The Pocket”: Mobile Devices Can Improve Collaboration",
            "Publication year": 2014,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dpp4-kkAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        }
    ]
}]