[{
    "name": "Λάζαρος  Μεράκος",
    "romanize name": "Lazaros  Merakos",
    "School-Department": "Πληροφορικής & Τηλεπικοινωνιών",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 18649,
    "Scholar name": "Lazaros Merakos",
    "Scholar id": "H5xlwE4AAAAJ",
    "Affiliation": "Professor of Informatics and Telecommunications, National and Kapodistrian University of Athens",
    "Citedby": 4874,
    "Interests": [
        "Communication Networks",
        "Wireless Networks",
        "Mobile Communications"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=H5xlwE4AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A generic architecture for'always best connected'UTMS/WLAN mobile networks",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWMC.2007.016719",
            "Abstract": "The 4G mobile era will be based on a heterogeneous infrastructure comprising different wireless (and wired) systems in a complementary manner, where users will enjoy ubiquitous access to applications in an 'Always Best Connected' (ABC) ? mode that utilises the most efficient combination of systems available (e.g. UMTS and WLAN). We analyse the 'ABC' concept in an interworked UMTS/WLAN network context and reveal important issues. Next, we identify major requirements of the 'ABC' capacity, point out the limitations of UTMS/WLAN standards and discuss key enabling technologies and research efforts. We develop an application model for 'ABC' and analyse its complexity proving that, in principle, being 'ABC' translates to a family of NP-hard problems. Next, we present the design of an object-oriented UML real-time model for an 'ABC' system and provide preliminary results from simulation scenarios. In …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:CHSYGLWDkRkC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Cooperative content caching in mec-enabled heterogeneous cellular networks",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9476036/",
            "Abstract": "Multimedia content delivery via the cellular infrastructure increases fast due to the very high volumes of mobile video traffic generated by the billions of end devices populating the mobile data network. A critical mass of mobile video content requests refers to the consumption of the same popular video content, which is consumed by different end terminals spanning small geographical regions. Such content requests place a great burden on the backhaul of content-agnostic cellular networks, which fail to exploit the correlation of video requests to decongest their backhaul links. This creates redundant retransmissions while fetching the same video content from a central server to the network edge, using the bandwidth-limited backhaul at peak-time periods. With the integration of multi-access edge computing (MEC) capabilities in 5G mobile cellular networks, mobile network operators can place popular video content …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:bUkhZ_yRbTwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptable resource management in wireless IP links",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1285300/",
            "Abstract": "Although the resource reservation protocol (RSVP) is considered efficient for fixed access networks, its performance is problematic over wireless links, due to the variable available bandwidth they provide, asking for adaptable resource management techniques. If, for example, the channel quality falls to a level that the available bandwidth cannot support all reservations of admitted flows, then none of them is operating properly. One solution to this problem is to reject one or more of the flows in order to maintain quality of service (QoS) to the rest. In this paper describes a flow rejection mechanism that is based on priorities and bandwidth requirements, and aims at minimizing the number of rejected flows. Simulation results have shown that, compared to a random rejection mechanism, the attained flow rejection probability is significantly reduced, especially for high priority flows, while, at the same time, the bandwidth …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:vDijr-p_gm4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance Analysis of NB-IoT Random Access Channel",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49932-7_105",
            "Abstract": "The existing LTE network is software upgraded to support Narrow Band Internet Of Things (NB-IoT), which is designed to incorporate a massive number of ultra-low-power consuming and ultra-low complex devices operating in the poor coverage area, and the devices communicate to the internet through the existing cellular infrastructure. The massiveness of devices in the network will cause a collision which will degrade the performance of the system. The question that arises is what are the network parameters which could be optimized to reduce the collision in the massive access scenario. In this context, we evaluated the performance of NB-IoT random access channel by modeling the access channel as a multi-channel slotted aloha system. Focusing on the success probability of NB-IoT random access channel, we figured out that the subframe repetition number, back-off window selection, and random-access …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:7cqQt8SKcR0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An enhanced EAP-SIM authentication scheme for securing WLAN",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.711.6794&rep=rep1&type=pdf",
            "Abstract": "This paper presents an enhanced EAP-SIM authentication scheme for securing WLAN. The proposed scheme uses the Internet Key Exchange version 2 (IKEv2) protocol to protect the authentication procedure of EAP-SIM by encapsulating its packets. In this way the vulnerabilities of EAPSIM authentication method are eliminated. After the employment of IKEv2, a Virtual Private Network (VPN) tunnel is established that protects data transferred over the air interface. The tunnel, which is based on IPsec, ensures confidentiality, authentication and integrity of the data exchanged in the WLAN environment. The proposed scheme has minimal impact on the existing network infrastructure. The user is still authenticated by proving the possession of a SIM card, in order to get subscribed in his home network for billing and charging purposes. The proposed scheme requires only that each end-point of the established VPN tunnel must have the appropriate IPsec software.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Alleviating control channel interference in femto-overlaid LTE-advanced networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6619583/",
            "Abstract": "Long Term Evolution ¿ Advanced (LTEAdvanced) is a prominent cellular network technology designed to meet the International Mobile Telecommunications ¿ Advanced (IMTAdvanced) requirements for enhanced wireless communications, offering high data rates under an all-Internet Protocol (IP) packet network. The dominant supporter of this effort is the significant improvement in spatial spectrum utilization and indoor coverage expected to be achieved through the penetration of femtocells inside the conventional macrocell areas. However, taking into account that femtocells will spatially reuse the spectrum assigned to macrocells in an unplanned deployment manner, the mitigation of the generated interferences becomes a major challenge. The problem is more severe in the case of closed subscriber group (CSG) femtocells, which serve only a limited set of subscribed users, and interfere with both data and …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:-_dYPAW6P2MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EURO-CITI security manager: Supporting transaction services in the e-government domain",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-46138-8_58",
            "Abstract": "Transaction services that enable the on-line acquisition of information, the submission of forms and tele-voting, are currently perceived as the future of E-Government. The deployment of these services requires platform independent access and communications security as a basis. This paper presents the methodology, network infrastructure and software kernel, which are used to achieve these objectives in the context of the EURO-CITI project. Well-known and established technologies such as SSL/TLS and IPsec are used. The internal design of the EURO-CITI Security Manager (ESM) kernel is discussed. This kernel is an advanced software platform, residing within EURO-CITI hosts. ESM supports the transaction services discussed in this paper but also takes provision for future services in the E-Government domain",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:yB1At4FlUx8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "GPRS+ IntServ/RSVP: an integrated architecture",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128601002328",
            "Abstract": "The general packet radio service (GPRS) is the current enhancement to the GSM infrastructure, capable of handling X.25 and Internet protocol (IP) traffic for mobile computing and communications. A major deficiency of the current GPRS specification is the lack of quality of service (QoS) support in the IP domain. In this paper an architecture for enhancing the GPRS core network with IP QoS support is presented. The proposed scheme is based on the integrated services (IntServ) architecture, processed in the IETF during the past years. The applicability of the proposed architecture as well as the required signalling enhancements and modifications in the components of the GPRS architecture are discussed. To identify the applicability of our proposal in a real GPRS network, a simulation model of the proposed IntServ architecture was developed in order to quantify the effect that signalling overhead has on GPRS …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:2P1L_qKh6hAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An efficient RSVP–mobile IP interworking scheme",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1023385429587",
            "Abstract": "During the past years, several attempts have been made to develop functionality for mobility management support and QoS provision in the realm of the IP networks. Since IP was not designed to support such functionality, new protocols have been specified and implemented to tackle these issues. Mobile IP is currently the dominant protocol that allows users to retain connectivity while roaming in IP networks. RSVP (Resource reSerVation Protocol) is a well established protocol for reserving network resources to support QoS requirements. These protocols, when deployed separately, can work quite efficiently. However, if their functionality is combined, several inefficiencies arise in terms of QoS deterioration and misuse of the network resources. To minimize these inefficiencies, we propose a new approach that limits mobility and QoS related network modifications inside the domain, in which a user moves …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Supporting the WWW in wireless communications through mobile agents",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1015415412405",
            "Abstract": "Mobile computing is considered of major importance to the computing industry for the forthcoming years due to the progress in wireless mobile communications. We present a proxy-based architecture that manages to accelerate Web browsing in wireless Customer Premises Networks (CPN). We discuss how such an architecture is implemented using the IBM Aglets framework for mobile agents. The suggested architecture relies heavily on proxy caches – maintained in base stations – which are relocated to follow a roaming user in other control areas (clusters of cells). The cache management scheme involves relocation of full caches to the most-likely-to-be visited control areas, but also fractions of the cache to less-likely-to-be-visited neighbours. A movement prediction algorithm, based on a learning automaton, is used to determine the future location of the terminal. The discussed architecture components …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Potential and limitations of a teleteaching environment based on H. 323 audio-visual communication systems",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138912860000164X",
            "Abstract": "The effective support of teleteaching services requires the development of multimedia collaboration systems that are capable of providing real-time and high quality audio-visual communication among distributed instructors and students. In the absence of such specialised systems, technologies tailored to other services are being considered for teleteaching services as well. Such a technology is the H.323 audio-visual communication technology developed to support video communication over IP. Although teleteaching and videoconferencing have similar QoS requirements, teleteaching functional requirements are a superset of those of videoconferencing. In this paper, the suitability of H.323 technology and currently available products to support teleteaching services is investigated, based on experience gained during a related deployment at the University of Athens.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:M3ejUd6NZC8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Metadata design for introspection-capable reconfigurable systems",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_113",
            "Abstract": "Global vision consensus on the next generation of wireless mobile communications, broadly termed 4G, sketches a hybrid infrastructure, comprising different wireless access systems in a complementary manner and vested with reconfiguration capabilities that facilitate a flexible and dynamic adaptation of the wireless infrastructure to meet the ever-changing service requirements. We identify essential metadata classes to support the reconfiguration of communication systems, introducing a respective object-oriented UML model. We elaborate on the design rationale that underpins the UML model, describing its classes and associations and discussing the possible metadata representation technologies and encoding formats. We proceed to identify existing metadata standards that are candidate for the representation of reconfiguration metadata, discussing and evaluating their suitability. Ultimately, we …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Exploiting user location for load balancing WLANs and improving wireless QoS",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1516533.1516537",
            "Abstract": "A “Smart Spaces System”, called MITOS, for improved user connectivity in large wireless LAN installations is proposed. MITOS extends the scope of resource management to the dynamic relocation of nomadic users: the system suggests to a user the best location to move to for obtaining a satisfactory quality of service level, when the controlling access point of its current location becomes congested. The system monitors the traffic and user location across the network, and formulates the appropriate relocation proposal urging specific users to move to better locations at reasonable distances. Two enhancements to the basic MITOS system are introduced for maintaining an almost uniform load level across the considered infrastructure: the first uses microeconomic concepts, while the second borrows game theoretic mechanisms from the Santa Fe Bar problem. Simulation results on the efficiency of the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:SP6oXDckpogC",
            "Publisher": "ACM"
        },
        {
            "Title": "Multi-parameter performance analysis for decentralized cognitive radio networks",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-013-0635-4",
            "Abstract": "In this paper, we investigate the impact of primary user activity, secondary user activity, interface switching, channel fading and finite-length queuing on the performance of decentralized cognitive radio networks. The individual processes of these service-disruptive effects are modeled as Markov chains based on cross-layer information locally available at the network nodes. A queuing analysis is conducted and various performance measures are derived regarding the packet loss, throughput, spectral efficiency, and packet delay distribution. Numerical results demonstrate the impact of various system parameters on the system performance, providing insights for cross-layer design and autonomous decision making in decentralized cognitive radio networks.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:vbGhcppDl1QC",
            "Publisher": "Springer US"
        },
        {
            "Title": "An integrated charging, accounting and billing management platform for the support of innovative business models in mobile networks",
            "Publication year": 2004,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJMC.2004.005864",
            "Abstract": "In the near future, it is expected that mobile operators will offer their subscribers a plethora of services as well as the ability to access value-added services offered by independent providers. However, until this goal is reached, there are several technical issues related to dynamic service provision and charging that have to be tackled. In order to examine in detail all the attributes of the aforementioned issues, we present the involved players and the prospective business models for flexible service provisioning. Furthermore, we outline the key concepts of such mechanisms and respective interdependencies between business entities, network/communication domains and the charging functionality. We also present the latest efforts undertaken by standardisation bodies to address these issues and the mechanisms that are planned to be deployed. Finally, we introduce a generic integrated architecture for charging …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:7PzlFSSx8tAC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "On the weibull distribution with arbitrary correlation",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4537293/",
            "Abstract": "This paper studies the performance of the quadri- variate Weibull distribution with arbitrary correlation assuming non-identical fading parameters and average powers. Novel infinite series representations for the joint probability density function (PDF), the cumulative distribution function (CDF) and the product moments are derived. Using these theoretical results, a performance analysis study in terms of outage probability, for receivers employing selection combining (SC) diversity techniques is presented. The proposed mathematical analysis is accompanied by various numerical results, with parameters of interest the fading severity and the power decay factor. Furthermore, equivalent performance evaluation results, obtained by various computer simulations have verified the accuracy of the proposed analytical method.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:Mojj43d5GZwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vulnerabilities and possible attacks against the GPRS backbone network",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11962977_21",
            "Abstract": "This paper presents the security weaknesses and the possible attacks, which threaten the GPRS backbone network and the data that either reside at the network or are transferred through it. These attacks may be performed by malicious third parties, mobile users, network operators or network operator personnel, which exploit the weaknesses of the employed technology and the security measures applied to the GPRS backbone. The possible attacks against the GPRS backbone may result in the compromise of end-users security, the users over billing, the disclosure or alteration of critical information, the services unavailability, the network breakdown, etc. The analyzed attacks and their consequences increase the risks associated with the usage of GPRS, and, thus, influence its deployment that realizes the concept of the mobile Internet.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:M3NEmzRMIkIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multi-user driven path prediction algorithm for mobile computing",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1232022/",
            "Abstract": "Nowadays, path prediction is being extensively examined for use in the context of mobile and wireless computing towards more efficient network resource management schemes. Path prediction allows the network and services to further enhance the quality of service levels that the user enjoys. In this paper we present a path prediction algorithm that exploits the machine learning automata. The decision of the learning automaton is driver by the movement patterns of a single user but is also affected by the aggregated patterns demonstrated by all users. Simulations of the algorithm, performed using a Realistic Mobility Pattern Generator, show increased prediction accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:XvxMoLDsR5gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity optimization through sensing threshold adaptation for cognitive radio networks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s11590-011-0345-8",
            "Abstract": "We propose capacity optimization through sensing threshold adaptation for sensing-based cognitive radio networks. The objective function of the proposed optimization is the maximization of the capacity at the secondary user subject to transmit power and sensing threshold constraints for protecting the primary user. After proving the concavity of capacity on sensing threshold, the problem is solved using the Lagrange duality decomposition method in conjunction with a subgradient iterative algorithm. The numerical results show that the proposed optimization can lead to significant capacity maximization for the secondary user as long as this is affordable to the primary user.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:08ZZubdj9fEC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Augmented RAN with SDN Orchestration of Multi-tenant Base Stations",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-017-4285-1",
            "Abstract": "Network virtualization (NV) has been successfully applied in wired networks, providing abstraction of the networking equipment and simplifying the network/resource management procedures. However, more light needs to be shed on how the emerging NV technologies, including software defined networking and network function virtualization, can be used by the mobile network operators to efficiently handle the ever-increasing demand for mobile data traffic. In this paper, we focus on the long term evolution system and present a NV-based framework that aims at bringing the access network closer to the end user. The proposed framework enables the dynamic sharing of base stations and radio resources among different mobile network operators, a.k.a. multi-tenant operation. Accordingly, we present novel NV triggering and decision algorithms to demonstrate how the proposed dynamic sharing of base …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:oJBA3oede64C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Optimized cross-layer adaptation for improved resource management in wireless networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5518786/",
            "Abstract": "The theoretical analysis of a cross-layer mechanism for improving the quality of service of real-time applications in wireless networks is presented. The mechanism coordinates adaptations of the modulation order at the Physical layer and the media encoding mode at the Application layer, to improve packet loss rate, throughput and mean delay. With the use of Continuous Flow Modeling, the system is considered as a “fluid” queue with inflow and outflow rates representing its traffic generation and service rates, respectively. Each data source is modeled as a Markov chain, from the steady-state of which the optimal adaptation thresholds of the cross-layer mechanism are derived. Performance evaluation results show that the optimized operation of the mechanism attains a significant performance improvement compared to both the sub-optimal mechanism, and a legacy system.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An XML-based platform for e-government services deployment",
            "Publication year": 2003,
            "Publication url": "https://journals.riverpublishers.com/index.php/JWE/article/view/4389",
            "Abstract": "Transaction services that enable the on-line acquisition of information, the submission of forms and televoting, are currently viewed as the future of E-Government. Deploying such services requires platform independent access and communications security as a basis. This paper presents a platform for supporting E-Government services in a highly distributed public network environment, based on XML protocols. We discuss the technical details of the developed software that implements these XML protocols. The platform relies on the well-established IPsec and SSL/TLS technologies for ensuring the security of the critical, egovernment related data, exchanged over the public network.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality of experience management in mobile cellular networks: key issues and design challenges",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7158278/",
            "Abstract": "Telecom operators have recently faced the need for a radical shift from technical quality requirements to customer experience guarantees. This trend has emerged due to the constantly increasing amount of mobile devices and applications and the explosion of overall traffic demand, forming a new era: “the rise of the consumer”. New terms have been coined in order to quantify, manage, and improve the experienced user quality, with QoE being the most dominant one. However, QoE has always been an afterthought for network providers, and thus numerous research questions need to be answered prior to a shift from conventional network-centric paradigms to more user-centric approaches. To this end, the scope of this article is to provide insights on the issue of network-level QoE management, identifying the open issues and prerequisites toward acquiring QoE awareness and enabling QoE support in mobile …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:bKqednn6t2AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy-Efficient Roaming for Heterogeneous Wireless Networks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-10314-3_4",
            "Abstract": "Heterogeneous networks enable multi-standard terminals to provide increased Quality of Experience with the ability to always stay connected. Nevertheless, the price paid for multiplicity of active radio interfaces and increased data rates is the rise in energy consumption of multi-standard terminals. This factor coupled with the slow progress in battery technology creates the so called energy trap, which at times can limit the mobile user to the nearest electricity socket creating a real paradox to the headlines of 4G and future generations in terms of unrestricted mobility. Therefore real solutions need to be in place that can support unrestricted roaming, but in an energy efficient manner whilst maintaining Quality of Service (QoS). Today’s mobile networking environment is already considering a HetNet (Heterogeneous networking) environment, with LTE release 12 considering the ABS (almost blank space …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:Dip1O2bNi0gC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Handover management architectures in integrated WLAN/cellular networks",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/48390989/Handover_management_architectures_in_int20160828-7151-15j7yqe.pdf",
            "Abstract": "The integration of existing cellular systems with new wireless access technologies, such as wireless LANs, has attracted considerable attention during the past few years. The challenges to be addressed include authentication, security, QoS support, and mobility management. Efficient mobility management, and especially handover management, is considered one of the major factors toward a seamless provision of multimedia applications across networks of different technologies. A large number of solutions have been proposed in an attempt to tackle all relevant technical issues concerning handover management. In order to evaluate these solutions, a more systematic categorization is needed. This survey gives an overview of the most recent handover management architectures for integrated WLAN/Cellular networks, focusing mainly on 802.11-based WLANs and GPRS/UMTS cellular networks. The various proposals are categorized based on the point of system integration, their main characteristics are presented, and their advantages and shortcomings are discussed in an overall evaluation section.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Discovering feasible protocol stack combinations in beyond 3G systems: Information model, search algorithms and performance",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394609/",
            "Abstract": "Beyond 3G wireless systems will be vested with dynamic reconfiguration capabilities capable of adapting their protocol stacks during runtime to optimize spectrum utilization and, thus, better meet the ever-changing service demands. For protocol stack reconfiguration to become a practical capability, a language for modeling, expressing and circulating data essential to reconfigurable protocol stacks is necessary. We present a generic object-oriented information model for describing the feasible combinctions of protocol layers into protocol stacks. The model supports the derivation of an associated ontology specified in standard W3C semantic languages (OWL). We introduce a novel algorithm for discovering all the feasible protocol layer combinations that render valid protocol stacks, thus facilitating the selection of suitable ones. We assess the performance of a prototypical implementation of our algorithm used to …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EURO-CITI Security Manager: Supporting",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=mgFtCQAAQBAJ&oi=fnd&pg=PA358&dq=info:mNtrll5qd50J:scholar.google.com&ots=x8n4tCLWZ0&sig=zAkHRw44Fs4DHV84EX75fCHPzqg",
            "Abstract": "Transaction services that enable the on-line acquisition of information, the submission of forms and tele-voting, are currently perceived as the future of E-Government. The deployment of these services requires platform independent access and communications Security as a basis. This paper presents the methodology, network infrastructure and software kernel, which are used to achieve these objectives in the context of the EURO-CITI project. Well-known and established technologies such as SSL/TLS and IPsec are used. The internal design of the EURO-CITI Security Manager (ESM) kernel is discussed. This kernel is an advanced software platform, residing within EURO-CITI hosts. ESM supports the transaction services discussed in this paper but also takes provision for future services in the E-Government domain",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:PVjk1bu6vJQC",
            "Publisher": "Springer"
        },
        {
            "Title": "An adaptive and distributed network selection mechanism for 5G networks",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128621000840",
            "Abstract": "5G networks aim to support a vast amount of data exchange, through network densification, including the integration of multiple radio access technologies (RATs) under a unified radio access and core network. This integration creates a heterogeneous environment where end devices dynamically select the most suitable RAT for consuming a service via a new or even an ongoing communication session. This paper proposes a distributed and adaptive network selection mechanism to address this challenge. The proposed mechanism comprises two co-operating algorithms, one located at the user equipment (UE), and the other at the core network. Its main objective is to satisfy user preferences regarding monetary cost, quality of service, security, energy consumption etc., while safeguarding an operator's traffic engineering policy to avoid congestion. A key feature of the mechanism is the use of a dynamic threshold …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:5ScXqYzV9GEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A secure mobile VPN scheme for UMTS",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5758225/",
            "Abstract": "In this paper, a mobile Virtual Private Network (VPN) scheme for the Universal Mobile Telecommunication System (UMTS) is proposed and analyzed from a security point of view. The proposed scheme improves the level of protection for data transfer that is currently supported in UMTS and facilitates the realization of Mobile Internet. The security functionality, which is based on the IPsec framework, is integrated to the mobile network infrastructure so as to eliminate the potential computational overhead on mobile devices. The proposed VPN scheme operates transparently to the mobile subscribers' movement. Moreover, the required enhancements can be integrated in the existing network infrastructure, and, therefore, the proposed security scheme can be employed as an add-on feature to the UMTS standard.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:VLnqNzywnoUC",
            "Publisher": "VDE"
        },
        {
            "Title": "Mobility management and control in intelligent wireless ATM networks",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366401003243",
            "Abstract": "This paper shows how the Asynchronous Transfer Mode (ATM) signaling and the Intelligent Network (IN) concept can be exploited to support mobility in an ATM-based network with wireless access parts and mobile users. The proposed architecture exploits the enhanced service control processing features offered by the IN technology to support location management. The access signaling protocol structure is based on the principles of separation between call and bearer channel control, employed in fixed broadband access networks. The design objective is to minimize the changes required to the wired network signaling, by taking advantage of the well-developed capability sets. This allows the easy introduction of the wireless ATM technology (W-ATM) into the real world. It is shown that the proposed signaling protocol model provides cost-effective implementations without degrading the agreed Quality of Service …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Integrated Wireless LANs (WLANs) and Cellular Networks: Managing Handovers.",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=7988235479908930748&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Metadata design for reconfigurable protocol stacks in systems beyond 3g",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-006-6173-y",
            "Abstract": "Global consensus on the next generation of wireless mobile communications, broadly termed “beyond 3G”, sketches a heterogeneous infrastructure comprising different wireless systems in a complementary manner and vested with reconfiguration capabilities, which support a flexible and dynamic adaptation of the wireless network and its spectrum resources to meet the ever-changing service requirements. For ubiquitous reconfiguration to become a practical capability of mobile communication systems, it is necessary to establish a global architecture for modeling, expressing, and circulating essential metadata related to reconfiguration, including reconfigurable device capabilities and semantic properties of protocol stacks. We outline the relevant standardization initiatives in the mobile domain, summarize existing work in reconfiguration-supporting architectures, and identify key shortcomings that may …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:a0OBvERweLwC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Improving QoS in a Multi-Hop Wireless Environment",
            "Publication year": 2002,
            "Publication url": "http://cgi.di.uoa.gr/~passas/Med-Hoc-Net_2002.pdf",
            "Abstract": "This paper focuses on the provision of QoS in a Multi-hop Wireless Network (MHWN) environment. The approach proposed here is based on the introduction of the Wireless Adaptation Layer (WAL), an intermediate layer between the IP layer and the DLC/PHY layers at each communication node within the MHWN. The scope of the WAL is to cope with the wireless channel impairments and provide improved QoS support to the lower layers while, at the same time, be independent and transparent to both higher and lower layers. In this way, the WAL provides a uniform QoS mechanism over a diverse environment such a MWHN.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure VPN deployment in GPRS mobile network",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.385.9048&rep=rep1&type=pdf",
            "Abstract": "The growth of the Internet and the success of mobile networks suggest that the next trend will be an increasing demand for mobile access to Internet applications. It is therefore increasingly important that mobile radio networks support these applications in an efficient manner. Moreover, in such a hybrid environment, where clients are connecting to ever growing networks in an ad-hoc fashion, the security requirements of such practices become even more important. An end-to-end Virtual Private Network (VPN) deployment scenario over the GPRS mobile network is presented and analyzed. The VPN deployment is based on the IPsec protocol suite. A specific protocol configuration of the IPsec is proposed, in order to make it operational on a mobile network environment. The potential incompatibility problems that may arise from the integration of different technologies are elaborated. Finally, a qualitative evaluation of the proposed VPN scheme and the outline of an alternative approach for future work are presented.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "UDS: A distributed RAT selection mechanism for heterogeneous wireless networks",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-012-0901-2.pdf",
            "Abstract": "The selection of the most suitable radio access technology to serve as the communication means for a service in a heterogeneous wireless access network is a complex task. It considers a number of different parameters and it involves numerous network technologies and entities. Several mechanisms have been proposed that focus on different aspects and follow different strategies. We introduce a policy based scheme that takes into consideration the user preferences, along with network conditions and user moving speed. Its ultimate goal is to support a session through the most desirable radio access technology, from the user perspective, while managing the overall network resources in an optimum way. It comprises a distributed algorithm running at the terminal and the network side. The performance of the proposed mechanism is evaluated against that of a typical load balancing scheme, commonly …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:p__nRnzSRKYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Shaping QoE in the 5G ecosystem",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7148089/",
            "Abstract": "5G is rapidly moving from vision to reality and there is already some consensus regarding the technical requirements of 5G. Traditionally, performance monitoring based on existing standards has been focusing on technical Key Performance Indicators (KPIs). However, it is actually more important to focus on Quality of Experience (QoE) directly. Service delivery in 5G should account for the sheer diversity of existing and emerging use cases as well as for the vast variety of demands per service type. These requirements would only be addressed by a shift from system-centric to user-centric architectures. Given this background, this paper aims to push towards integrating QoE requirements in the 5G ecosystem, and to highlight the importance of network designs that have the enduser at their epicenter. To this end, we identify and analyze the essential must-have attributes that can shape QoE-centric networks and …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:fFSKOagxvKUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Location management in wireless ATM customer premises networks",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366499002078",
            "Abstract": "This paper introduces a new location management protocol, called LAMPS (Location Agents and Mobile PNNI Scheme), that is suitable for wireless ATM customer premises networks. LAMPS takes advantage of the PNNI routing functionality to advertise the movement of mobile terminals within pre-defined areas. Furthermore, it uses specialized entities to store and retrieve the current location area of the mobile terminals. These entities are located within mobility enhanced switches, that provide to mobile terminals connectivity with the rest of the network and supervise the execution of all mobility related procedures.In this paper, we compare LAMPS with similar mechanisms and we present the advantages that arise from its application. The efficiency of the protocol is demonstrated by the results of an analytical model.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Parametric Dimensioning and Enhancements of a Path Prediction Algorithm",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394645/",
            "Abstract": "To meet the growing requirements for resource management schemes in the context of mobile and wireless computing, path prediction algorithms are gaining more attention and are being extensively examined. Path prediction allows the network to enhance the user quality of service. A parametric dimensioning of a path prediction algorithm based on learning automata is presented. The algorithmic parameter values are optimised for maximum prediction accuracy. Furthermore, two add-on mechanisms of the path prediction algorithm are introduced, and their performance is evaluated through simulations.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:M7yex6snE4oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance analysis of network-assisted D2D discovery in random spatial networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7469370/",
            "Abstract": "Device-to-device (D2D) discovery is the inextricable prelude for the direct exchange of local traffic between cellular users in proximity. The D2D discovery process can be based on either autonomous actions taken by D2D-enabled devices, also known as network-assisted D2D discovery or core network functionalities to estimate proximity, also known as network-assisted D2D discovery. A key advantage of network-assisted D2D discovery is its potential to reduce the energy, signaling, and interference required for D2D discovery, by exploiting knowledge of the network layout. We analyze the performance of network-assisted D2D discovery in random spatial networks and derive useful guidelines for its design. We derive approximate expressions for the distance distribution between two D2D peers conditioned on the core network's knowledge of the cellular network layout, assuming that the base stations are …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:1QvrP69o8OkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "E‐CLEMA: A cross‐layer design for improved quality of service in mobile WiMAX networks",
            "Publication year": 2009,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.699",
            "Abstract": "In this paper, an efficient cross‐layer design that performs joint adaptation of the physical (PHY) and application layers of a mobile WiMAX network is proposed. The design takes into account channel state and performance information from the PHY and medium access control (MAC) layers, respectively. It uses a decision algorithm to evaluate this information, specify unfavorable conditions regarding low channel quality and increased congestion, and take measures by coordinating modulation order, transmission power, and media encoding rate, toward improved overall quality of service (QoS) offered to the user. Extensive simulation results show that the proposed design achieves considerably reduced packet loss and power consumption, combined with increased throughput as compared to a typical mobile WiMAX system. Copyright © 2008 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:b0M2c_1WBrUC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Networking 2004: Networking Technologies, Services, and Protocols; Performance of Computer and Communications Networks; Mobile and Wireless Communications; Third International IFIP-TC6 Networking Conference, Athens, Greece, May 9-14, 2004; Proceedings",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=kz2A5E0tB_gC&oi=fnd&pg=PA1&dq=info:8Tawxg9BxYAJ:scholar.google.com&ots=ZEF_y-rPjI&sig=z-H-4DQIHTQY5VZ4w6f5gObHJEM",
            "Abstract": "This book contains the refereed proceedings of the 3rd International IFIP-TC6 Networking Conference, Networking 2004. Conferences in the Networking series span the interests of several distinct, but related, TC6 working groups, including Working Groups 6.2, 6.3, and 6.8. Re? ecting this, the conference was structured with three Special Tracks:(i) Networking Technologies, Services, and Protocols;(ii) Performance of Computer and Communication Networks; and (iii) Mobile and Wireless Communications. However, beyond providing a forum for the presentation of high-quality-search in various complementary aspects of networking, the conference was also targetedtocontributingtoauni? edviewofthe? eldandtofosteringtheinter-tion and exchange of fruitful ideas between the various related (and overlapping) specialized subcommunities therein. Towards this second objective, more than a few conference sessions (and thematic sections in this book)‘cut across’ the Special Tracks, along more generic or fundamental concepts. Networking 2004 was fortunate to attract very high interest among the c-munity, and the conference received 539 submissions from 44 countries in all? ve continents. These? gures correspond to a remarkable increase in subm-sions from the previous very successful events (roughly, a 156% increase over Networking 2000 and 71% over Networking 2002), and indicate that Netw-king conferences are progressively becoming established as worldwide reference events in the? eld.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:XoXfffV-tXoC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "MITOS: A smart spaces system for pervasive computing",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30192-9_37",
            "Abstract": "The popularity of wireless networks has increased in the recent years, as they become a common addition to fixed LAN infrastructures. In this paper we introduce a novel use for a wireless network based on the IEEE 802.11 standard: a smart spaces system that proposes to wireless users to assume optimum locations in order to obtain a satisfactory QoS level when the wireless hot-spot becomes saturated. The system, being kept up to date with the traffic across the network and the location of each user, is capable of making the appropriate proposal urging users to move to new locations at reasonable distances. In that way, user perceived QoS and wireless network load-balancing can be both achieved. MITOS is the name of the developed smart spaces system. We discuss the general system architecture and operation as well as the optimum proposal algorithm. The operation of the system was verified in …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Spatial spectrum reuse for opportunistic spectrum access in infrastructure-based systems",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-012-0661-z.pdf",
            "Abstract": "Opportunistic spectrum access (OSA) receives a constantly growing interest due to its potential to mitigate spectrum scarcity and meet the increasing communication needs of mobile users. OSA refers to identifying and exploiting spatiotemporal unused portions of licensed spectrum to allow communication among unlicensed–secondary users (SUs) without adverse impact to the licensees (primary users—PUs). Key parameters in OSA are the spectrum opportunities detection method used by the SUs, and the interference level perceived by the PUs. A spatial spectrum reuse framework is proposed, where broadcast messages of an infrastructure-based primary system are exploited and combined with location-aware methods to detect spectrum opportunities and establish interference-free secondary links. The study of secondary link establishment probabilities revealed a spectrum reuse of up to 25% for omni …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:tKAzc9rXhukC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Flexible resource allocation in IEEE 802.16 wireless metropolitan area networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541526/",
            "Abstract": "IEEE 802.16 is considered today as the most promising technology, to provide extension of wireless broadband communications into metropolitan environments. One of the main design challenges in 802.16 is the introduction of an efficient traffic scheduler that handles resource allocation in the wireless interface. This paper proposes such a scheduler, referred to as the \"frame registry tree scheduler\", that aims at providing differentiated treatment to data connections, based on their QoS characteristics. The scheduler uses a tree structure in order to prepare time frame creation and reduce processing needs at the beginning of each time frame. Simulation results show that the proposed scheduler can attain considerable improvement in terms of throughput and packet losses",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed QoS-sensitive band selection strategies for dynamic spectrum access in unlicensed CDMA networks",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128610001660",
            "Abstract": "Recent studies indicate the presence of a significant amount of idle licensed spectrum, in different time periods and geographic locations. Fixed spectrum allocation lacks efficient mechanisms for sharing spectral resources. Prompted by the recent regulatory changes and radio technology advances, opportunistic use of spectrum bands is becoming increasingly attractive, as it can alleviate the spectrum scarcity problem in the unlicensed bands. We study the dynamic spectrum access for a CDMA wireless environment, where unlicensed users run elastic data applications, i.e., throughput has to be within a range of acceptable values. Unlicensed users may transmit in idle licensed bands (i.e., not used by a licensed user). We focus on the band selection problem of unlicensed users. We propose a prediction-driven and a probabilistic, distributed strategy with which users might efficiently share the available resources …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:URolC5Kub84C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Extending an Open Source Learning Management System (Open eClass) as a Student Project",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8860875/",
            "Abstract": "Learning management systems (LMS) are predominant in supporting all levels of education. Many educational institutions rely on open source systems that are free. Even though such systems are mature enough, there is a constant need to be extended. In this work, we present our experiences in attempting to extend an open source e-learning system, Open eClass that is widely used in Greece, in the context of a student project. We expect that our work will help toward forming a framework for facilitating community contributions to open source e-learning systems such as Open eClass.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:VPl5zSG_J1oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unified QoS provision in wireless access networks",
            "Publication year": 2003,
            "Publication url": "http://cgi.di.uoa.gr/~passas/Passas-ANWIRE-workshop-CR.pdf",
            "Abstract": "(IAPP), currently standardized by IEEE, for path reestablishments after handover is proposed. According to this scheme, the Access Point that a Mobile Node moves to, can act as a proxy for the required RSVP signaling. The scheme is applicable to all IP-based wireless access systems, and can work in conjunction with the standard RSVP protocol, as well as partial re-establishment methods. The paper also includes a detailed description of the structure of the required messages. Besides reducing handover latency and signaling overhead, the proposed scheme also allows for the operation of advanced admission control algorithms in the new Access Point.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "LTE-A access, core, and protocol architecture for D2D communication",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-04963-2_2",
            "Abstract": "Considering the benefits arisen due to the proximity gain and the plethora of potential applications in modern mobile cellular networks, device-to-device (D2D) communications have currently drawn the interest of academia and standardization bodies. This chapter focuses on the Long Term Evolution—Advanced (LTE-A) system, and deals with open challenges in access, core, and protocol architecture that need investigation prior the adoption of the D2D communications. More specifically, this chapter provides a comprehensive literature review on coexistence issues between D2D and cellular communications, while describes the main D2D scenarios and architectures considered in current efforts for integrating D2D communications in LTE networks. Moving one step further, enhancements at the LTE-A access network are proposed, targeting at enabling centrally-controlled D2D transmissions inside an LTE …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:WZBGuue-350C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "SERVICE PROVISION AND RECONFIGURATION MANAGEMENT IN 4G MOBILE NETWORKS",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812791146_0005",
            "Abstract": "Global vision consensus on the next generation of wireless mobile communications, broadly termed 4G, sketches a heterogeneous infrastructure, comprising different wireless access systems in a complementary manner and vested with reconfiguration capabilities that will facilitate a more flexible and dynamic adaptation of the wireless infrastructure to meet the ever-changing service requirements. We present the generic stages of reconfiguration procedures and identify the management requirements in the context of these stages. Next, we introduce a generic, platform-independent reconfiguration management framework to be hosted on end systems and elaborate on its main components.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient micro-mobility solution for SIP networks",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1258803/",
            "Abstract": "SIP is evolving as the dominant protocol for multimedia call control in IP networks and is expected to be widely deployed in the near future. Using SIP for supporting mobility in SIP-based networks appears as a very attractive alternative to mobile IP, taking advantage of existing SIP infrastructure and signaling, while avoiding duplication of functionality. However, existing proposals for supporting mobility with SIP are not efficient in handling micro-mobility and do not cater for all types of traffic. In this paper, we introduce hierarchical mobile SIP (HMSIP), for efficient micro-mobility management in SIP environments. HMSIP is a SIP-based scheme that builds on existing IP mobility protocols, aiming at integrating their key concepts in the most beneficial way. Our proposed scheme minimizes the handoff latency and the backbone signaling overhead, while catering for all types of traffic. Moreover, HMSIP can be effectively …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Retrieving position from indoor WLANs through GWLC",
            "Publication year": 2003,
            "Publication url": "http://polos.di.uoa.gr/docs/Retrieving%20Position%20From%20Indoor%20WLANs%20Through%20GWLC.pdf",
            "Abstract": "Enabling context-aware applications requires the incorporation of users’ and objects’ location. Retrieving location data has been a field of on going research for both the outdoor and indoor wireless/mobile systems. The results in the cellular scenario are already matured and location architectures have been standardized. The cellular-based positioning mechanisms have similarities with the wireless LAN mechanisms, but are not appropriate to be operated in indoor scenarios. Resent research is ongoing for indoor positioning mechanisms, resulting in implementations that vary in several factors and offer specialised APIs. A platform that enables the deployment of Location Based Services in heterogeneous WLAN-based positioning systems will address difficulties cooperating with different systems. We have designed a novel entity, called Gateway WLAN Location Center (GWLC), which hides the heterogeneous …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cross-layer design in opportunistic spectrum access-based cognitive radio networks",
            "Publication year": 2012,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCNDS.2012.046359",
            "Abstract": "Cognitive radio is considered as one of the most important enablers for achieving enhanced spectral efficiency in wireless communications. In this work, we present a cross-layer design for reliable data transmission over a cognitive radio network which combines adaptive modulation at the physical layer and hybrid automatic repeat request at the data link layer. The cognitive radio network follows the principles of opportunistic spectrum access that utilises an optimal power adaptation policy for channel allocation. The obtained numerical results denote that the considered approach achieves significant spectral efficiency improvement and therefore it could be deployed in wireless communication networks that encompass cognitive capabilities. Furthermore, we assess the introduced interference and we show that it can be kept within levels that do not jeopardise our design.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:dTyEYWd-f8wC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "A Comprehensive Study on LPWANs With a Focus on the Potential of LoRa/LoRaWAN Systems",
            "Publication year": 2021,
            "Publication url": "https://www.techrxiv.org/articles/preprint/A_Comprehensive_Study_on_LPWANs_With_a_Focus_on_the_Potential_of_LoRa_LoRaWAN_Systems/16853893",
            "Abstract": "This publication offers a comprehensive survey on the topic of Low-Power Wide Area Networks (LPWANs). We discuss the scope of LPWAN connectivity and present numerous well-established technologies that can offer such a service. From this presentation, LoRa/LoRaWAN systems emerge as one of the dominant solutions, and hence we offer details about end-to-end LoRa/LoRaWAN-enabled networking. As an area being in its infancy, LPWANs in general and LoRa/LoRaWAN in specific undergo extensive research. We shed light in key contributions, whereas we also provide our findings regarding the main research focus and needs. Simulation studies appear to be a popular choice among researchers, whereas real system implementations are constantly emerging thanks to low deployment and operational cost. For the former, we offer a comparative overview of existing simulators, whereas for the latter we …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:cNepPnSnVCgC",
            "Publisher": "TechRxiv"
        },
        {
            "Title": "An innovative gateway for indoor positioning",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/ASP/2006/81714.pdf",
            "Abstract": "Enabling the pervasive paradigm requires the incorporation of location information. Retrieving location data has been a field of ongoing research for both the outdoor and indoor wireless systems. The results in the cellular scenario are already mature and location architectures have been standardized. Recent research is ongoing for indoor-positioning mechanisms, resulting in implementations that vary. A platform that enables the deployment of location-based services in heterogeneous indoor and WLAN-based communication systems will address difficulties in cooperating with different positioning systems. For that purpose, we have designed a novel entity, called Gateway WLAN Location Center (GWLC), which hides the heterogeneous functions of the indoor positioning architectures, incorporating a unified framework for retrieving location data of users and objects. The GWLC platform has been …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:Fu2w8maKXqMC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "A platform for charging, billing, and accounting in future mobile networks",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366405004573",
            "Abstract": "Current technological advances enable the modification of existing mobile telecommunications business models. In future mobile networks, mobile users will be able to choose from multiple network operators and service providers. This capability requires the extension of the existing charging collection information mechanisms and billing systems to assist the oncoming mass service offering by independent service providers. In this paper, we present a platform that extends the existing systems to provide for advanced and flexible charging mechanisms and pricing policies.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Extensible Platform for Location-Based Services Deployment and Provisioning",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/wireless-information-highways/31454",
            "Abstract": "Location-based services can be considered the most rapidly expanding field of the mobile communications sector. The proliferation of mobile-wireless Internet, the constantly increasing use of handheld, mobile devices and position-tracking technologies, and the emergence of mobile computing prepared the grounds for the introduction of this new type of services with an impressively large application domain and use range. The combination of position-fixing mechanisms with location-dependent, geographical information can offer truly customised, personal communication services through the mobile phone or other type of devices. In this chapter, motivated by the technology advances in the aforementioned areas, we present a generic platform for delivering Location-based services (LBSs) to the nomadic user. The platform features a modular architecture, which can be easily extended. Although the overall …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:EUQCXRtRnyEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Increasing spatial spectrum utilization through opportunistic user-to-user communications",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10776-012-0181-5.pdf",
            "Abstract": "The requirements for ubiquitous and highly reliable wireless services, combined with the low utilization of licensed spectrum, call for flexible and efficient spectrum management schemes. To this end, a lot of attention is paid in the literature on allowing secondary-external users to opportunistically access the licensed spectrum. In parallel to these efforts, the question is whether the licensed users could further improve their own spectrum utilization. In this paper, we focus on increasing the spatial spectrum utilization of an infrastructure-based wireless system by adding autonomous functionality to the primary (system) users. An opportunistic operation mode for the uplink (UL) period, totally transparent to the base station (BS) of the system, is introduced. Users operating in this mode identify spatial spectrum UL opportunities by interpreting BS broadcast messages, and exploit these opportunities by establishing …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:_Ybze24A_UAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A priority leaky-bucket regulator for virtual path traffic in ATM networks",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366401002869",
            "Abstract": "In integrated services networks (B-ISDN/ATM) incoming traffic streams with different Quality of Service (QoS) requirements, sharing a single contract for use of a policed virtual path, may be jointly regulated on the basis of their type and QoS requirements to make the best use of available bandwidth in the path. The shaping/policing mechanism may use the information about the network policer located at the User-Network Interface (UNI) to perform policing with a form of priority service to ensure satisfactory levels of cell loss and delay for both real-time and non-real time traffic. This paper proposes and analyzes such a priority, buffered leaky-bucket mechanism for shaping/policing high-priority and low-priority sources, which share an ATM virtual path under a single, common user-network connection contract. The proposed priority traffic regulator maintains a dedicated cell buffer for each type of traffic to be able to …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:eflP2zaiRacC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Ubiquitous service provision in next generation mobile networks",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/39133312/0c960517000acf22c9000000.pdf20151012-16080-12l9rra.pdf",
            "Abstract": "One of the most important aspects in the upcoming generations of mobile wireless telecommunications infrastructure is the Virtual Home Environment (VHE) a ubiquitous approach in the delivery of services. The universality of systems like UMTS and WLANs increases the need for efficient introduction of VHE. In this paper, we discuss the adoption of mobile agents for coping with the technical challenges associated with the VHE. We present the detailed design of an integrated, open and extensible architecture by taking into account a variety of use scenarios and technological alternatives (mobile devices, fixed terminals). Relevant implementations are presented to indicate the feasibility of the discussed technical orientation.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:ruyezt5ZtCIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MANAGEMENT OF NEXT-GENERATION WIRELESS NETWORKS AND SERVICES-AN ADVANCED LOCATION INFORMATION MANAGEMENT SCHEME FOR SUPPORTING FLEXIBLE SERVICE PROVISIONING IN RECONFIGURABLE MOBILE NETWORKS-The",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=9994894051999033455&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:uWiczbcajpAC",
            "Publisher": "[New York, Communications Society of Institute of Electrical and Electronics Engineers]"
        },
        {
            "Title": "An overlay smart spaces system for load balancing in wireless LANs",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-006-4476-6",
            "Abstract": "An overlay smart spaces system, called MITOS, is proposed for managing the use of the resources in wireless local area networks (WLAN). MITOS monitors the traffic load distribution in the different WLAN segments, as well as the location of each user, and when necessary, suggests to specific users to change their location in order to improve their quality of service. Enhancements to the basic MITOS architecture are introduced to intelligently manage local congestion, and maintain an almost uniform load level across the network. The approach used for load balancing is based on game theoretic mechanisms, such as the solutions to the Santa Fe Bar Problem. Simulation results are provided showing the efficiency of the proposed system.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "OpeNB: A framework for virtualizing base stations in LTE networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6883805/",
            "Abstract": "In this paper, we present a novel framework for virtualizing the Long Term Evolution (LTE) base stations to improve the user performance and lower the downlink interference. Our proposal, referred to as “OpeNB”, is an attempt to utilize the benefits of Software Defined Networking (SDN) and OpenFlow, introducing network virtualization in LTE networks with an adaptable, highly extensible, and less invasive manner. The proposed solution consists of a novel network architecture and a mechanism that allows the virtualization of LTE base stations depending on the network state. Simulation results show that the proposed framework improves the average interference, throughput and packet loss experienced by the end users.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:i2xiXl-TujoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "IP QoS frameworks in GPRS",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=16688719107083508454&hl=en&oi=scholarr",
            "Abstract": "General Packet Radio Service (GPRS) is the current enhancement in the GSM infrastructure, capable of handling IP traffic within the mobile context. A major deficiency of the current GPRS specification is the lack of QoS support. In this paper we discuss two different schemes for enhancing the GPRS architecture with IP tuned QoS frameworks, namely IntServ (RSVP) and DiffServ.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:_axFR9aDTf0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Realistic mobility pattern generator: design and application in path prediction algorithm evaluation",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1047325/",
            "Abstract": "A platform for the simulation of mobility functions (e.g., protocols, and application architectures) is presented. This platform, named RMPG, is based on the assumption that real humans exhibit considerable spatial and temporal regularity in their moves. We base our simulation environment on the random way-point algorithm incorporated in the ns tool. Using the Java-based RMPG we performed a series of simulations by considering a path prediction algorithm as a mobility function. We present our results.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multi-Tier and Multi-Band Heterogeneous Wireless Networks with Black Hole Attacks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9014028/",
            "Abstract": "Wireless networks are currently proliferated by multiple tiers and heterogeneous networking equipment that aims to support multifarious services ranging from distant monitoring and control of wireless sensors to immersive virtual reality services. The vast collection of heterogeneous network equipment with divergent radio capabilities (e.g. multi-GHz operation) is vulnerable to wireless network attacks, raising questions on the service availability and coverage performance of future multi-tier wireless networks. In this paper, we study the impact of black hole attacks on service coverage of multi-tier heterogeneous wireless networks and derive closed form expressions when network nodes are unable to identify and avoid black hole nodes. Assuming access to multiple bands, the derived expressions can be readily used to assess the performance gains following from the employment of different association policies and …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:CREiCvMVTUAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handover decision for small cells: Algorithms, lessons learned and simulation study",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128615004065",
            "Abstract": "More and more cellular network operators enable the unplanned deployment of small-sized cellular stations by the end users into the predominant macrocellular network layout. This increases the spatial capacity of the cellular system and reduces the costs for installing, managing, and operating the radio access network. However, the impact of such an unplanned network densification on the robustness of cell handover (HO) still remains unclear and needs to be studied. For this purpose, in this paper we highlight the key aspects of the cell HO process in the presence of small cells and identify the main issues that affect its robustness. We summarize lessons learned from the rich literature on HO decision algorithms for small cells, and present an algorithm for alleviating interference in the cellular uplink while prolonging the battery lifetime of the user terminal. Based on the evaluation methodology of the Small Cell …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:OR75R8vi5nAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Radio Access Selection in Integrated UMTS/WLAN Networks",
            "Publication year": 2009,
            "Publication url": "https://www.scirp.org/html/1056.html",
            "Abstract": "Heterogeneous networks combine different access technologies. An important problem in such networks is the selection of the most suitable radio access network. To perform this task efficiently, a lot of information is required, such as signal strength, QoS, monetary cost, battery consumption, and user preferences. These are well known issues and a considerable effort has been made to tackle them using a number of solutions. These efforts improve the performance of vertical handover but also add considerable complexity. In this paper, we introduce an enhanced algorithm for radio access network selection, which is simple, flexible and applicable to future mobile systems. Its main characteristics are the distribution of the radio access selection process among the mobile terminal and the core network, the evaluation of mobile terminal connections separately and the primary role of user preferences in the final decision. The performance of the algorithm is evaluated through simulation results, which show that the algorithm provides a high rate of user satisfaction. It decreases the messages required for the vertical handovers in the whole network and it alleviates the core network from the processing of unnecessary requests.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:nrtMV_XWKgEC",
            "Publisher": "Scientific Research Publishing"
        },
        {
            "Title": "An advanced service provision framework for reconfigurable mobile networks",
            "Publication year": 2003,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJMC.2003.003995",
            "Abstract": "The success of next generation mobile networks is highly dependent on the availability of a plethora of functionality-rich applications, accessible via a variety of network infrastructures and terminals. This can be achieved through the cooperation of various business players in addition to network operators and infrastructure providers. The specification by major standardisation organisations of open APIs for network access by third parties is a significant step in this direction. A critical issue in such architectures is reconfiguration management, which is regarded as the mean to enable new approaches to service provision, customisation and personalisation. In this paper, we present our proposal for a generic, open, flexible, service provision framework that supports context-aware service provision and reconfiguration management.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "An SDN-based virtual cell framework for enhancing the QoE in TD-LTE pico cells",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7148097/",
            "Abstract": "In this paper, we propose a Software Defined Network (SDN)-based framework for enhanced Quality of Experience (QoE) in the presence of Time Division-Long Term Evolution (TD-LTE) pico-cell hotspots. The proposed framework enables users to utilize radio-resources from multiple base stations and enhance their QoE, by utilizing the concept of virtual cells and by customizing the TD-LTE frame at the picocell stations. In this way, the proposed framework resolves pseudo-congestion and enables elastic radio-resource management while meeting the individual traffic requirements at the end users. The formation of virtual cells is driven by a QoE-centric approach that monitors whether the Mean-Opinion Score (MOS) of specific applications drops below a prescribed user-specific threshold. Accordingly, the TD-LTE frame is centrally optimized by an SDN Controller so as to meet the individual QoE requirements at …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:cWzG1nlazyYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advanced adaptability and profile management framework for the support of flexible mobile service provision",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1224979/",
            "Abstract": "The long-term vision of beyond 3G wireless communications describes a mobile service provision environment dramatically different from that of today. Users are expected to raise their demands to a significantly higher level, towards the situation-aware provision of ubiquitous personalized multimedia services. From this perspective, the need is emerging to apply, in a systematic way, adaptability and reconfigurability concepts for service delivery in largely diverse contexts. Generic dynamically extensible adaptation mechanisms that can be employed in a wide variety of situations and are independent of the subject and criteria of adaptation is a significant step in this direction. Moreover, effective profile representation and management becomes an increasingly important issue. In the present article we introduce an advanced adaptability and profile management framework aiming to fulfill these requirements. The …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A signaling architecture for wireless ATM access networks",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1019177212058",
            "Abstract": "A multiservice wireless Asynchronous Transfer Mode (ATM) access system is considered from a signaling protocol viewpoint. In an attempt to generalize and extend results and experiences obtained from the specification, design, and implementation of fixed ATM‐based access networks, we extend the concept of the broadband V interface (referred to as VB) for application to wireless ATM access networks. The proposed architecture follows the signaling structure of Broadband ISDN (B‐ISDN) User–Network Interface (UNI), thus offering the possibility for integration of the wireless ATM access system into fixed B‐ISDN. It is shown that the use of the proposed access signaling architecture provides cost effective implementations without degrading the agreed Quality of Service (QoS), and simplifies call/connection and handover control. The evaluation of the proposed access signaling protocol structure yields …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:J_g5lzvAfSwC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "SIP-based location aware services",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.19.8849",
            "Abstract": "In this paper, we investigate the prospects of using Session Initiation Protocol (SIP) in contextaware services. We focus on the location-based paradigm in which the users' location is the contextual parameter used for service adaptation and delivery.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using XML and related standards to support Location Based Services",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/967900.968226",
            "Abstract": "Location Based Services can be considered as the most rapidly expanding field of the mobile communications sector. The proliferation of the mobile/wireless Internet, the constantly increasing use of handheld, mobile devices and positioning technologies and the emergence of mobile computing, prepared the grounds for the introduction of this new type of services with impressively large application domain and use range. The combination of position fixing mechanisms with location-dependent, georgraphical information, can offer truly customized personal communication services through the mobile phone or other type of devices. Web Services have emerged as a set of open standards and gained a lot of momentum during the recent past. Many software vendors are announcing Web Service initiatives and adoption in their products. Many organizations are involved in the refinement of Web Service standards …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Next generation cognitive cellular networks, LTE, WiMAX and wireless broadband access",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-1827-2_12",
            "Abstract": "This chapter provides a brief but comprehensive overview of the cognitive radio characteristics that are met in Next generation networks (NGN) such as LTE and WiMAX networks. As the main problem that is going to be addressed by the cognitive radios (CR) is the spectrum underutilization, increasing spectrum utilization solutions that allow CR users to access unutilized spectrum portions of these networks are included. Also, the current literature identifies CR and context-awareness as a key enabler for employing femtocell in LTE systems and, thus, technical challenges of this effort is presented. Additionally, a lot of attention is paid on introducing the recent standardization efforts on cognitive radio-based networks. Finally, the future spectrum access challenges under the claim of ubiquitous, reliable and always available wireless services are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:1qzjygNMrQYC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Reconfiguration Management in 4G Mobile Networks: Requirements, Process And Architecture",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Lazaros-Merakos/publication/228717822_Reconfiguration_Management_in_4G_Mobile_Networks_Requirements_Process_And_Architecture/links/0c960517000ad82860000000/Reconfiguration-Management-in-4G-Mobile-Networks-Requirements-Process-And-Architecture.pdf",
            "Abstract": "Global vision consensus on the next generation of wireless mobile communications, broadly termed 4G, sketches a heterogeneous infrastructure, comprising different wireless access systems in a complementary manner and vested with reconfiguration capabilities that will facilitate a more flexible and dynamic adaptation of the wireless network infrastructure to better meet the ever-changing service requirements. In the present paper, we analyze and identify the functional requirements of reconfiguration, presenting a generic staged reconfiguration procedure and identifying the management requirements in the context of these stages. Next, we introduce a generic, reconfiguration management framework to be hosted on 4G mobile systems and elaborate on its main components.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "LIAISON Customised Billing Module",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394123/",
            "Abstract": "In the framework of the LIAISON (location bAsed services for the enhancement of wOrking enviroNment) IP project the existing legendary charging functionality is complemented with new features fulfilling the emerging charging requirements for an integrated environment providing mobile workers with location-based services. In that scope, LIAISON introduces the LIAISON customised billing module (namely the LCBM), an integrated customised billing module, which collects the charging information from each, potentially different, business domain, calculates the charges that are due to each involved business entity and shares the respective revenues. The LCBM covers the emerging requirements of an integrated environment enabling LIAISON solution to provide mobile workers with advanced location-based services. It receives charging information from heterogeneous environments through open application …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:35r97b3x0nAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Resource management in multicast OFDMA with proportional data rate and BER constraints",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7041892/",
            "Abstract": "The resource allocation problem for the downlink of orthogonal frequency division multiple access (OFDMA) wireless multicast systems is investigated. It is assumed that both the base station (BS) and a user are equipped with a single antenna, and the allocation unit is not the subcarrier, as in conventional OFDMA systems, but a set of contiguous subcarriers referred to as a \"chunk\". The multicasting technology is able to support several groups of users with flexible quality of service requirements. A general mathematical formulation is provided, but achieving the optimal solution has a high computational cost. Thus, a heuristic but efficient algorithm is proposed in order to maximize the total throughput; the novelty of this algorithm is that it is subject to constraints on the total available power, the average bit error rate over a chunk, and proportional data rates among multicast groups. In addition, it considers different user …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:0N-VGjzr574C",
            "Publisher": "IEEE"
        },
        {
            "Title": "ADAM: An Adaptive Access Mechanism for NB-IoT Systems in the 5G Era",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9505640/",
            "Abstract": "The technology of Narrow Band Internet of Things (NB-IoT) is expected to contribute towards the support of massive Machine Type Communications (mMTC), i.e., one of the fundamental performance objectives of 5G networks. However, that call for massiveness, requests a thorough revisit on the NB-IoT access procedure. Considering this, the performance of the NB-IoT access procedure is analysed under different network densities and for various combinations of the related configuration parameters. The analysis led to a useful reference table with 3GPP compliant configurations that maximize the access success probability in an NB-IoT system. The table enables an adaptive access mechanism, where the access parameters are adjusted according to the expected network density. The evaluation results quantify the gain that adaptiveness can provide to the performance of the access procedure.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:u76CbRzuV8AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A realistic mobility pattern generator for the performance evaluation of mobile computing mechanisms",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.633",
            "Abstract": "A platform for the simulation of mobility functions (e.g. protocols, application architectures) is presented. This platform, named RMPG, is based on the assumption that real humans exhibit considerable spatial and temporal regularity in their moves. We base our simulation environment on the random way‐point algorithm incorporated in the ns tool. We review other approaches, simulation tools and mobility models. Through the RMPG, that has been implemented in Java, we performed a series of simulations by considering a path prediction algorithm as a mobility function scheme. We present our results. Copyright © 2003 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:DUooU5lO8OsC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Dynamic channel assignment with delay and loss considerations for wireless TDMA LANs",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/881414/",
            "Abstract": "The scarce available bandwidth and the unpredictable, variable bit rate traffic in modern packet-switched wireless LANs, require an efficient channel allocation scheme. In this paper we make an overview of traditional call-by-call dynamic channel assignment (DCA) methods and propose a novel DCA method that aims at assigning channels in a more dynamic way, based on the quality-of-service (QoS) required by different connections. Although the method can be applied in different wireless environments, here it is used in a wireless ATM LAN, in conjunction with a TDMA/TDD medium access control protocol. Simulation results at the end of the paper show that this kind of methods can improve significantly the performance of the system.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Service Provision Evolution In Mobile Communication Networks",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.59.3746&rep=rep1&type=pdf",
            "Abstract": "Following the commercial deployment and worldwide success of 2nd generation mobile telecommunication systems, standardization bodies, industry partners and regulatory fora from around the globe joined forces in producing the standards for 3rd generation mobile telecommunication systems. In parallel, the academic research community has been gradually shifting its focus in defining the scope of 4th generation systems. The present paper highlights fundamental concepts and key market developments in 4th generation mobile networks, outlining their major high level requirements and identifying the fundamental building blocks of 4th generation system architectures in terms of technological solution sets, proposing also a set of priorities for the 4th generation research agenda.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:KUbvn5osdkgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A flexible UMTS/WLAN architecture for improved network performance",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-007-9254-7.pdf",
            "Abstract": "Current trends in cellular telecommunications suggest the incorporation of Wireless Local Area Networks (WLANs) as supplementary access technologies into the existing cellular infrastructure. Overlay network architectures are expected to improve both service provision and resource utilization under the condition that sophisticated architectural options are followed. Many proposals suggest that all active connections be handled through the same access network technology. However, this is not believed to be efficient in a heterogeneous environment. Therefore, a mechanism that allows each connection of a terminal to be served by different radio access technology is introduced. Based on a tight coupling architecture for interworking between Universal Mobile Telecommunications System (UMTS) and WLANs, the proposed scheme combines a sophisticated decision mechanism with flexible connection …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Building a Generic Broker for Location Retrieval",
            "Publication year": 2003,
            "Publication url": "http://polos.di.uoa.gr/docs/Building%20_a%20_Generic%20_Broker%20_for%20_Location%20_Retrieval%20.pdf",
            "Abstract": "Positioning is an essential component for the deployment of the evolving context-aware concepts. Information Society Technologies (IST) project PoLoS investigates existing schemes for Location-Based Services and latest technological achievements in the sector of Geographical Information Systems, positioning techniques and network interfaces (GSM/GPRS) in order to design and implement a platform capable of providing the full functionality needed to design and deploy Location Based Services. PoLoS’Positioning component (POS) offers undependability of the underlying heterogeneous network infrastructures and positioning techniques, establishing a generic, open, modular, and QoS enabled framework. This article illustrates the technical specifications, the design, the functionality and the prototype implementation of the POS component, its features and the services that the POS component offers to the …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "jor Self-Organising Base Stations in a Wireless ATM Unlicensed System",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=NcrSBwAAQBAJ&oi=fnd&pg=PA137&dq=info:bqLL0-ogcXsJ:scholar.google.com&ots=d85C7xWl-4&sig=FFrgXMnbjO8cRQpUdl70NezP0uM",
            "Abstract": "A distributed method for dynamic channel allocation in unlicensed wireless and mobile ATM systems, where base stations act as hubs to offer wireless ATM access to mobile units, is presented. In the proposed approach, base stations, operating in the unlicensed environment, are competing to access and reserve the wireless resources, ie, time on separate frequencies. The competition is based on local measurements performed by the self-organising base stations, whereas the access delay and the traffic demand of each base station are the parameters that define the result of the competition. Three alternative contention disciplines are introduced, and their performance is evaluated via simulation.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:ClCfbGk0d_YC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Device discovery in LTE networks: A radio access perspective",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128616302262",
            "Abstract": "Device discovery is an integral part of Device-to-Device communications and a key prerequisite for the introduction of proximity-aware services in Long Term Evolution (LTE) networks. In this concept, we provide a comprehensive study on device discovery protocols and we examine the key design aspects towards an LTE-tailored device discovery. We give insights into the radio access approach that can be used for device discovery, considering in-coverage synchronized devices that exploit a dedicated spectrum portion to discover each other. Useful remarks on the optimal theoretical performance in terms of the number of required discovery transmissions and time-slots are presented, while comparative simulation results for various radio access approaches are provided.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:D0NosnH9lYgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Increasing spectrum utilization in wireless infrastructure-based systems",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983898/",
            "Abstract": "Resent measurements and reports show that in most cases licensed spectrum is used sporadically resulting in large unutilized spectrum portions. Opportunistic spectrum access (OSA) is a promising solution providing methods to identify and exploit these portions. Most existing OSA proposals provide ways for unlicensed users to access the licensed spectrum. This paper describes a novel approach where licensed users of an infrastructure-based system exploit features of their system to detect spatial spectrum opportunities. Focusing on an interference-free solution, an alternative opportunistic operation mode is provided, allowing licensed users to increase utilization of their own spectrum.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "IPsec-based end-to-end VPN deployment over UMTS",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366404001951",
            "Abstract": "Next generation mobile users require flexible security mechanisms, which provide customized security services to data traffic, take into account end-user mobility and mobile network characteristics, and are available anywhere–anytime. An IPsec-based end-to-end Virtual Private Network (VPN) deployment scheme over the Universal Mobile Telecommunication System (UMTS) is proposed and analysed. The UMTS infrastructure provides the mobile users with access to public Internet, and allows them to employ IPsec tunnels to traverse firewalls, access private networks, and convey sensitive data securely. The VPN functionality is integrated in the communicating peers, which negotiate and apply security. For VPN establishment the Internet Key Exchange (IKE) protocol is employed, which has to operate in a mobile UMTS environment, where Network Address Translation (NAT) is used. The proposed scheme has …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:j3f4tGmQtD8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A generic framework for the management of Charging, Billing and Accounting process in heterogeneous networks",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.3.9723&rep=rep1&type=pdf",
            "Abstract": "The introduction of the IP in the mobile networks and furthermore the convergence of heterogeneous networks (eg UMTS, EDGE, WLAN) brings additional requirements and complexity for managing flexible service provision and charging in heterogeneous environments.To cope with such complexity the introduction of an integrated framework for at least charging process is required. In that context, this paper discusses the involved business players and the imposed requirements and describes a generic framework for all management aspects related to charging, billing and accounting in heterogeneous environments.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Seamless Service Continuity Scheme for Enhanced Network Performance in UMTS/WLAN Networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4022263/",
            "Abstract": "The proliferation of wireless access technologies, mostly wireless LANs, along with the ubiquitous coverage of cellular networks, has spurred many researchers to consider schemes for integrated network provision. In overlaying network environments, flexible resource management and service continuity during handover play a crucial role in the quality-of-service seen by the user. This paper describes an integrated UMTS/WLAN architecture that manages to establish every connection in a mobile terminal through the most appropriate access network, based on both network policies and user preferences. Moreover, connections are handed over independently between UMTS and WLAN, aiming at seamless service continuity. A detailed simulation model is used to measure the performance of the proposed architecture against existing schemes",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "TCP performance enhancement in wireless/mobile communications",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/990841/",
            "Abstract": "The operation of TCP in wireless/mobile environments is considered. After briefly presenting previous efforts to ameliorate TCP performance in the considered environments, we propose a new mechanism for tackling the problems caused by handovers. Our mechanism is based on stochastic datagram relocation. Traffic destined to the mobile terminal is tunneled to adjacent cells according to the output of a path prediction algorithm. To reduce the associated overhead, only percentages of inbound traffic are copied to the cell's neighborhood on the basis of estimated probabilities. Through simulations, we have measured the effects that stochastic datagram relocation has on TCP dynamics.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:6ZxmRoH8BuwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An SDN-based framework for elastic resource sharing in integrated FDD/TDD LTE-A HetNets",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6968980/",
            "Abstract": "Spectrum and infrastructure sharing among multiple mobile network operators have recently drawn significant attention from the industry and the academia sectors. Recent advances in the area of Software Defined Networking (SDN) launch the design of innovative SDN-based solutions for resource sharing in multi-tier networks of macrocell and small-sized base stations, a.k.a. HetNet. In this paper, we present a novel SDN-based framework that enables efficient and elastic spectrum utilization among multiple operators in 3GPP LTE-A HetNet scenario. Assuming a multi-operator environment of Frequency Division Duplex (FDD) macrocells complemented by multi-tenant Time Division Duplex (TDD) pico cells, we present a SDN-based architecture that allows efficient resource sharing among the TDD and FDD systems in a dynamic way. A TDD frame re-configuration mechanism is also employed, to optimize the ratio …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:YohjEiUPhakC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RSS: The reconfiguration support subsystem for next-generation mobile networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4024418/",
            "Abstract": "The technological race of boosting legacy and developing new air-interfaces, recent advancement of core network architectures, and evolution from software-defined and cognitive radio to reconfigurable systems put new complexions on the definition of \"next-generation\". This contribution envisages Next-Generation Mobile Networks as the class of multi-radio cognitive systems capable of absorbing the heterogeneity of wireless access, with advanced reconfiguration capabilities moved from edges to the core. Inline with 3GPP IMS rationale and ETSI TISPAN design extensions, a unified subsystem for offering reconfiguration services is proposed, adopting a multiplane and layer-based approach with clear separation of control and management concerns. The paper presents the signalling between the terminal and network elements in the course of an exemplary staged reconfiguration process, and discusses design …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "QoE-SDN APP: A rate-guided QoE-aware SDN-APP for HTTP adaptive video streaming",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8316960/",
            "Abstract": "While video streaming has dominated the Internet traffic, video service providers (VSPs) compete on how to assure the best quality of experience (QoE) to their customers. HTTP Adaptive Streaming (HAS) has become the de facto way that helps VSPs work-around potential network bottlenecks that inevitably cause stallings. However, HAS-alone cannot guarantee a seamless viewing experience, since this highly relies on the mobile network operators' (MNOs) infrastructure and evolving network conditions. Software-defined networking (SDN) has brought new perspectives to this traditional paradigm where VSPs and MNOs are isolated, allowing the latter to open their network for more flexible, service-oriented programmability. This paper takes advantage of recent standardization trends in SDN and proposes a programmable QoE-SDN App, enabling network exposure feedback from MNOs to VSPs towards network …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:pPdjnrZQtPEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Session I-Adaptation--Separation of Concerns-A Scheme for the Introduction of 3rd Party, Application-Specific Adaptation Features in Mobile Service Provision",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=1254171441130098680&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:N5tVd3kTz84C",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "A joint traffic scheduling and slot allocation algorithm for mobile WiMAX networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5671639/",
            "Abstract": "The IEEE 802.16e standard provides a high degree of flexibility for setting up and operating mobile WiMAX networks in metropolitan environments. While the standard supports differentiated Quality of Service (QoS), crucial functions such as traffic scheduling and slot allocation are left as open issues to the research community. This paper focuses on these two features, that consist an NP-Hard problem, and provides an integrated solution. The key component of the proposal is the “Colored OFDMA Frame Registry Tree Scheduler” (CO-FRTS) that achieves QoS-aware resource allocation by using an advanced tree structure to prepare the creation of time frames, and reduce processing requirements. An extended simulation model reveals the improved performance of the proposed solution, compared to other competent proposals.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distance distributions and proximity estimation given knowledge of the heterogeneous network layout",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7115167/",
            "Abstract": "Today's heterogeneous wireless network (HWN) is a collection of ubiquitous wireless networking elements (WNEs) that support diverse functional capabilities and networking purposes. In such a heterogeneous networking environment, proximity estimation will play a key role for the seamless support of emerging applications that span from the direct exchange of localized traffic between homogeneous WNEs (peer-to-peer communications) to positioning for autonomous systems using location information from the ubiquitous HWN infrastructure. Since most of the existing wireless networking technologies enable the direct (or indirect) estimation of the distances and angles between their WNEs, the integration of such spatial information is a natural solution for robustly handling the unprecedented demand for proximity estimation between the myriads of WNEs. In this paper, we develop an analytical framework that …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:_FM0Bhl9EiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic network-based secure VPN deployment in GPRS",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1045231/",
            "Abstract": "A dynamic network-based virtual private network (VPN) deployment, which is established between the general packet radio services (GPRS) border gateway and a corporate intranet gateway, is presented and analyzed. By relying on a sequence of concatenated protection mechanisms (GPRS ciphering and VPN deployment), it is possible to provide secure remote access to mobile users without requiring an extra tunnel overhead on the radio link or the implementation of computationally intense encryption algorithms in the mobile station. The VPN functionality is based on IPsec. For VPN initialization and key agreement procedures, an Internet key exchange (IKE) protocol proxy scheme is proposed, which enables the mobile user to initiate a VPN, while shifting complex key negotiation to the network infrastructure. The required enhancements for security service provision can be integrated in the existing network …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effective prediction for video traffic in joint WiMAX/satellite networks",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-012-0733-0.pdf",
            "Abstract": "Combining WiMAX with satellite networks can be advantageous, especially in rural areas or locations affected by environmental factors. However, a satellite network experiences large round trip delays that may deteriorate quality especially for real-time applications. This paper improves the video prediction mechanism used for prediction of the uplink real-time traffic of an integrated satellite and WiMAX network. After a bibliographic search on mechanisms for video prediction in WiMAX and satellite networks, the NLMS (normalized least mean square) algorithm is chosen to be used as part of the existing mechanism, studying three possible alternatives. The first one proposes the implementation of the NLMS algorithm in the WiMAX BS (base station), the second one proposes the implementation of the NLMS algorithm in the satellite terminal, while the third one proposes the implementation of the NLMS …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:tYavs44e6CUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Specification and dynamic introduction of 3rd party, service-specific adaptation policies for mobile applications",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-005-1554-0",
            "Abstract": "The development, delivery and management of mobile services are the subject of many research activities in both the academia and industry. The ultimate goal of these efforts is a dynamic environment that enables the delivery of situation-aware, personalised multimedia services over heterogeneous, ubiquitous infrastructures, commonly termed as systems beyond 3rd generation (3G). Reconfigurability and adaptability are key aspects of the mobile systems beyond 3G. Reconfigurable mobile systems and networks introduce additional requirements and complexity in service adaptation. Moreover, it is widely recognised that services will be increasingly developed by independent third parties, besides mobile operators and equipment vendors. The present contribution complements previous work by the authors, related to mediating service provision platforms and advanced adaptability and profile …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:eMMeJKvmdy0C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Mobile Telecom Networks",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9780470099742.ch19",
            "Abstract": "This chapter contains sections titled:   Introduction   Architectures Network   Security Architectures   Research Issues   Conclusions   References  IntroductionArchitectures NetworkSecurity ArchitecturesResearch IssuesConclusionsReferences",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:EkHepimYqZsC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "A metaheuristic approach for minimizing service creation time in slice-enabled networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9148914/",
            "Abstract": "A fundamental technology towards the next generation of mobile networks is the Network Slicing, i.e., the capability to “slice” network resources and functions and to offer isolated end-to-end network services over shared physical infrastructures. From the performance perspective, one of the main challenges in network slicing is the minimisation of the slice set up time; a factor that directly effects a key performance indicator for the 5G networks, namely, the service creation time. Treating a network slice as a set of Virtual Network Functions (VNFs) that are installed in different hosts (central/edge clouds) during the slice creation procedure, we examine a nature-inspired metaheuristic approach for scheduling the VNFs installation process. Simulation results prove that the proposed metaheuristic method can offer high quality solutions for VNF scheduling problems and optimize service creation time for a set of requested …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:JO0bfRJr_gQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Extensible platform for location based services provisioning",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1286788/",
            "Abstract": "Location based services can be considered as the most rapidly expanding field of the mobile communications sector. The proliferation of the mobile/wireless internet, the constantly increasing use of handheld, mobile devices and position tracking technologies and the emergence of mobile computing, prepared the grounds for the introduction of this new type of services with impressively large application domain and use range. Prompted by the avalanche of technology advances in the aforementioned areas in this paper we present a generic platform for delivering location based services (LBS). The platform features a modular architecture, which can be easily extended with additional functionality. The paper focuses on the technical specifications, the design and the prototype implementation of the platform's kernel, which is responsible for coordinating communication with various pluggable components in order to …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Multiagent Platform for Ubiquitous Service Provision",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10922-009-9141-5.pdf",
            "Abstract": "The Virtual Home Environment is very important in contemporary mobile telecommunications infrastructure as it caters for the ubiquitous provision of services irrespective of network, location and user device. The universality of systems like Universal Mobile Telecommunications System and wi-fi increases the need for the rapid introduction of efficient VHE schemes. In this paper, we study the adoption of Mobile Agents for handling the VHE functionality. Mobile agents are nicely harmonized with the broader idea of VHE as they allow the autonomous execution of tasks by components that roam from node to node and network to network. We present the detailed modeling of a VHE provisioning architecture and investigate its suitability for different use cases and technical options (e.g., end user devices). The adoption of mobile agents for the ubiquitous provision of telecommunication services is quite promising …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:g3aElNc5_aQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "An XML framework for multi-level access control in the enterprise domain.",
            "Publication year": 2004,
            "Publication url": "https://sefcom.asu.edu/publications/group-hierarchies-constrained-iceis2004.pdf#page=238",
            "Abstract": "Modeling security information has always been a fundamental part of every security system. A robust and flexible model is needed in order to guarantee both the easy management of security information and the efficient implementation of security mechanisms. In this paper, we present an XML-based framework, which can be used for controlling access to computer systems. The framework is mainly targeted to enterprise systems and aims to provide a fine-grained access control infrastructure for securing access to hosted services. The proposed framework supports both role-based and user-based access control on different levels. Although, the discussion focuses mainly on the data model, access control schemes and guidelines for implementing fitting security architectures are also provided.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A power consumption analysis of tight-coupled WLAN/UMTS networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394248/",
            "Abstract": "The proliferation of WLANs and the ubiquitous coverage of cellular networks have resulted in several integration proposals towards 4G networks. Among them, the tight- coupled WLAN/UMTS architectures promise seamless service continuity to users and enhanced network performance. Most of these solutions assume that only one interface is active at a time, while much fewer consider the concurrent use of both WLAN and UMTS interfaces as this is expected to consume more energy. This paper presents a detailed description of power consumption for the two different tight-coupled WLAN/UMTS approaches based on the states of the wireless devices. A simple analytical model is provided for estimating the power consumption in each approach, while a simulation model measures the power needs for more complicated cases. Moreover, the enhancement due to a power-saving mechanism in WLAN is also …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis and optimization of a cross-layer adaptation mechanism for real-time applications in wireless networks",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-011-0352-9",
            "Abstract": "The theoretical analysis of a cross-layer mechanism for improving the quality of service of real-time applications in wireless networks is presented. The mechanism coordinates adaptations of the modulation order at the Physical layer and the media encoding mode at the Application layer, to improve packet loss rate, throughput and mean delay. With the use of Continuous Flow Modeling, the system is considered as a “fluid” queue with inflow and outflow rates representing its traffic generation and service rates, respectively. Each data source is modeled as a Markov chain, from the steady-state of which the optimal adaptation thresholds of the cross-layer mechanism are derived. Extensive performance evaluation results show that the optimized operation of the mechanism attains a significant performance improvement compared to both the sub-optimal case, and a legacy system, which adjusts the modulation …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A distributed algorithm for sharing Web cache disk capacity",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1655692/",
            "Abstract": "A decentralized game theoretic framework applied to Web caching is discussed. The interaction of multiple clients with a caching server is modeled as a non-cooperative game, in which clients are viewed as players, and the caching server disk space as a resource for which players are competing. However, some clients may continuously request new objects, thus, occupying a considerable portion of the cache disk, enjoying high hit rates. Such an aggressive behavior may have significant impact to the overall cache performance, as few clients may monopolize the total disk space, and the remaining clients may suffer the eviction of their \"important\" resources from the cache, thus, experiencing numerous cache misses. Moreover, it is observed that the majority of hits in cache systems are due to shared objects, i.e., clients tend to refer to a \"pool\" of common resources. The objective of the proposed framework is to …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ANDSF-Assisted vertical handover decisions in the IEEE 802.11/LTE-Advanced network",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128616301888",
            "Abstract": "To address the challenging issues of energy-efficiency and seamless connectivity in heterogeneous networks, 3GPP and IEEE have recently incorporated several architectural and functional enhancements to the baseline operation of their standards for cellular and wireless local area network access, respectively. Based on the 3GPP Access Network Discovery and Selection Function (ANDSF) as well as the advanced measurement capabilities provided by the IEEE 802.11-2012 and the 3GPP Long Term Evolution–Advanced (LTE-A) Standards, we propose an ANDSF-assisted energy-efficient vertical handover decision algorithm for the heterogeneous IEEE 802.11-2012 / LTE-A network. The proposed algorithm enables multi-mode mobile terminals to select and associate with the network point of attachment that minimizes the average overall power consumption at the mobile terminal and guarantees a minimum …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:JkxM1axsR-IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A scheme for the introduction of 3rd party, application-specific adaptation features in mobile service provision",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-40010-3_2",
            "Abstract": "The long term vision of beyond 3G wireless communications describes an evolution towards beyond 3G systems. The ultimate goal of this evolution is a dynamic environment that enables the delivery of situation-aware, personalised multimedia services over heterogeneous, ubiquitous infrastructures. Under this perspective, the need is emerging for applying, in a systematic way, adaptability and reconfigurability concepts for service delivery in largely diverse contexts. Moreover, it is widely recognised that services will be increasingly developed by independent third parties. The present contribution complements previous work by the authors, related to mediating service provision platforms and advanced adaptability and profile management frameworks, by introducing mechanisms that allow third parties to dynamically enhance the service delivery and adaptation middleware in order to achieve application …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:J-pR_7NvFogC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "NB-IoT: A candidate technology for massive IoT in the 5G era",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8514963/",
            "Abstract": "The existing mobile network infrastructure is currently optimized to support the Narrow-Band Internet of Things (NB-IoT), which is meant to provide numerous services in poor coverage areas, with ultra-low power consumption. The question that arises is whether (and to what extent) NB-IoT can meet the requirement for massive Machine Type Communications (mMTC) in the 5G era. In view of this, we study coverage enhancement in NB-IoT. We describe the subframe structure for various physical channels of NB-IoT and explain the repetition mechanism used for downlink transmissions in poor coverage areas. Focusing on optimizing this mechanism, we analyze how the latency and user blockage can be reduced by a proper selection of the downlink radio resources.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:VHymtrwLyIYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ARCHON: An ANDSF-assisted energy-efficient vertical handover decision algorithm for the heterogeneous IEEE 802.11/LTE-advanced network",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6883808/",
            "Abstract": "To address the challenging issues of energy-efficiency and seamless connectivity in heterogeneous networks, 3GPP and IEEE have recently incorporated several architectural and functional enhancements to the baseline operation of their standards for cellular and wireless local area network access, respectively. Based on the 3GPP Access Network Discovery and Selection Function (ANDSF) and the advanced measurement capabilities provided by the IEEE 802.11-2012 and the 3GPP Long Term Evolution - Advanced (LTE-A) Standards, we propose an ANDSF-assisted energy-efficient vertical handover decision algorithm for the heterogeneous IEEE 802.11-2012 / LTE-A network. The proposed algorithm enables a multi-mode mobile terminal to select and associate with the network point of attachment that minimizes its average overall power consumption and guarantees a minimum supported quality of service …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:SpbeaW3--B0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Study on Spectral Efficiency of Physical Layer over Cognitive Radio",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1302.2577",
            "Abstract": "Despite the conclusive potential of cognitive radio for provisioning the dynamic and flexible spectrum/channel allocation, the research community should study the performance gain of physical layer over such a radio with cognition capabilities. To this end, several mechanisms of physical layers such as adaptive modulation, multiple-input multiple output antennas; channel coding and/or combination of them should be studied. These studies should be accomplished in terms of spectral efficiency. Therefore, the gain of cognitive radio in wireless networks available into the market will be identified practically. Another issue under consideration should be the performance evaluation of cognitive radio assuming a cross-layer combination between the cognitive physical and the upper layers. To this direction, this paper presents a study on spectral efficiency at the physical layer with cognitive capabilities. In sequel, we study a cross-layer combination of physical layer with upper layers in the same cognitive context. The performance gain of cognitive radio in such a physical layer is realized practically as well as a few cross-layer design issues have been raised.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A holistic solution for charging, billing and accounting in 4g mobile systems",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1390676/",
            "Abstract": "The introduction of open and more flexible business models in 4G mobile networks, as well as the integration of UMTS with WLAN increases the overall overhead and complexity for the dynamic management between heterogeneous networks. To cope with such complexity and enable the seamless provision of value added services the introduction of an integrated platform for at least charging accounting and billing is required. This paper proposes an holistic solution for all management aspects related to charging, billing and accounting in 4G systems. The main concept is the introduction of a platform to incorporate various charging functionalities. The proposed platform is suitable for any business model and is appropriate for the different levels of UMTS-WLAN interworking.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:OTBXYDkIvNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards efficient support of context-awareness in mobile systems",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1264390/",
            "Abstract": "Future mobile communication systems beyond 3rd generation (3G) are expected to signal the transition from inflexible, vertical infrastructures to reconfigurable, horizontally integrated networks that incorporates a vast, ubiquitous space of devices and radio technologies and will be able to deliver to end-users a previously unimaginable range of valuable services. A fundamental characteristic for systems and services that operate in such a pervasive, heterogeneous environment is context-awareness that enables dynamic adaptation according to rapidly changing situational parameters. Challenging technical issues, however, need to be solved on the route to realization of this feature, including the optimal representation, placement, replication and management of the corresponding context information. This paper discusses some of these problems and introduces data management schemes that facilitate the …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A distributed dynamic channel reservation framework for wireless ATM LANs",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/829240/",
            "Abstract": "A distributed method for dynamic channel reservation in wireless ATM is presented. The proposed method applies to wireless ATM LAN, where base stations act as hubs to offer wireless ATM access to mobile units. In the proposed method, base stations are competing to access and reserve time on separate frequencies. Competition disciplines are introduced, and their performance is evaluated and compared through simulations.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:evX43VCCuoAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TECHNOLOGY ADVANCES FOR 3G AND BEYOND-USING PATH PREDICTION TO IMPROVE TCP PERFORMANCE IN WIRELESS/MOBILE COMMUNICATIONS-After presenting previous efforts to ameliorate TCP performance in the",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=3235761593570889643&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:uLbwQdceFCQC",
            "Publisher": "[New York, Communications Society of Institute of Electrical and Electronics Engineers]"
        },
        {
            "Title": "An efficient location management protocol for wireless ATM customer premises networks",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1011496106405",
            "Abstract": "In this paper we present a new location management protocol for wireless ATM networks, called LMCP (Location Management and Control Protocol). This protocol is based on the PNNI (Private Network-to-Network Interface) routing functionality to advertise the movement of mobile terminals within predefined areas. Moreover, LMCP uses specialized entities to store and retrieve the current location area of the mobile terminals. These entities are located in mobility enhanced switches that control the execution of mobility procedures (e.g., handovers).The main benefit from the application of LMCP is the establishment of connections that do not contain any misrouted segments. Furthermore, it requires minor modifications to the PNNI and enables its inter-working with other location management mechanisms. The protocol is compared with other similar mechanisms, and its efficiency is demonstrated by …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:tS2w5q8j5-wC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "On fair and efficient power control in cdma wireless data networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4067673/",
            "Abstract": "We consider the uplink power control problem in a single cell, multi-user, CDMA wireless data system and formulate it as a cooperative game. We use the Nash bargaining solution concept, in order to determine the socially optimum solution, which is both Pareto efficient and fair. In our formulation, the BS plays the role of the arbitrator, Le., solves the power control problem, and broadcasts the relevant information to all users in order to enforce convergence to the optimal operating point. The comparison of the cooperative scheme to the non-cooperative scheme shows significant reduction in the transmission power of the mobile terminals.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quality of Experience-centric management in LTE-A mobile networks: The Device-to-Device communication paradigm",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6982309/",
            "Abstract": "Device-to-Device (D2D) communications are planned to become an indispensable part of future mobile networks. A lot of attention has been paid to this new communication paradigm, due to the important benefits it brings for both cellular operators and end-users. Standardization efforts towards enabling D2D connections have started in Release 12 of the Long Term Evolution-Advanced standard and are expected to continue in next releases. Under this perspective, and realizing that the main asset of D2D is the enhancement of the user experience, we propose a Quality of Experience driven framework for the management of this new type of communications. Simulation results show that this framework is able to capture and enhance the overall experience of mobile users, and, thus, allow for proportionate financial benefits for operators.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:HbR8gkJAVGIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advanced mobility management for reduced interference and energy consumption in the two-tier LTE-Advanced network",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128614003867",
            "Abstract": "Femtocell deployment will play a key role for the wide adoption of LTE-Advanced, as it brings the access network closer to the end user in a cost-effective manner. This disruptive communication paradigm, however, necessitates the employment of advanced interference and mobility management to cope with the comparably denser yet unplanned network layout. This paper describes an advanced mobility management approach for the two-tier LTE-Advanced network, aiming to resourcefully utilize the femtocell superior characteristics in an energy-efficient and interference-aware manner. The key features of the proposed approach are (a) the exchange and utilization of standard signal quality measurements during the handover decision phase, to accurately estimate the mean user equipment (UE) transmit power on a per candidate cell basis, and (b) the use of a novel handover decision algorithm that jointly …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:xtoqd-5pKcoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Towards the functional enhancement of 3GPP networks with reconfiguration capacities",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-009-9903-0.pdf",
            "Abstract": "Over the last decade, several wireless access systems, such as broadband WLAN and WMAN (e.g., IEEE 802.11 and 802.16), broadcast systems (e.g., DAB, DVB-T) and short-range connectivity systems (e.g., Bluetooth, UWB), have emerged to complement existing second (2G) and third (3G) generation cellular systems. The common objective is to migrate to a flexible connectivity platform that will support the disparate requirements of mobile applications in the next-generation era, commonly referred to as 4G. To achieve a versatile multi-radio and multi-protocol access from mobile devices of limited resources in 4G, the original software-radio concept has evolved into across-the-board reconfiguration, which includes not only radio-specific functionalities but supports also the dynamic modification of the entire protocol stack. The present article clarifies the fundamental aspects of reconfiguration and points …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Monitoring for Rare Events in a Wireless Powered Communication mmWave Sensor Network",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/741272",
            "Abstract": "The use of a wireless sensor network to monitor an area of interest for possible hazardous events has become a common practice. The difficulty of replacing or recharging sensor batteries dictates the use of energy harvesting as a means to extend the network’s lifetime. To this end, energy beamforming is used in a millimeter wave wireless power sensor network with randomly deployed nodes. A simple protocol is proposed that allows nodes to report their charging conditions in an effort to select efficient energy-beamforming strategies. Analytical expressions for the probability of successful information reception and successful reporting are provided for two benchmark schemes: the random and the circular energy-beamforming scheme. A Markov chain is used for the former to model the energy level of sensor nodes. Simple sector selection strategies are presented and their performance, in terms of delay and failure information delivery, is assessed through simulations. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:6nNZn6i0kyMC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Evolving perspectives of 4th generation mobile communication systems",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1046689/",
            "Abstract": "The last decade of the 20/sup th/ century has been witness to remarkable technological developments in the area of wireless communication technologies. Following the commercial deployment-and subsequent worldwide success-of 2/sup nd/ generation mobile telecommunication systems, such as GSM, standardization bodies, industry partners and regulatory fora from around the globe joined forces in producing the standards for 3/sup rd/ generation mobile telecommunication systems. In parallel, the academic research community has been gradually shifting its focus in defining the scope of 4/sup th/ generation systems. The present paper highlights fundamental concepts and presents key market developments in 4/sup th/ generation mobile communication environments. It outlines their major high level requirements and identifies the fundamental building blocks of 4/sup th/ generation system architectures in …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An algorithm for radio resources management in integrated cellular/WLAN networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394731/",
            "Abstract": "Radio resources management in integrated cellular and wireless networks is a very complex and important issue. Although a number of proposals exist in the literature that present considerable improvement in several aspects, they also present some disadvantages that affect their implementation and deployment. In an attempt to tackle this, we propose a simple distributed algorithm that enables terminals to build prioritised lists of target access network independently for each of their connections. The algorithm also provides specific details on how the core network components can treat each connection based on a number of parameters, which are of paramount importance for the operators. The final choice is a trade-off between the user preferences, the terminal capabilities, the network load and the location and speed of the terminal. The algorithm is designed to provide an easy method for defining user …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards quality of experience management in the next generation of mobile networks",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Eirini-Liotou/publication/306030439_Towards_Quality_of_Experience_Management_in_the_Next_Generation_of_Mobile_Networks/links/57ab2eff08ae42ba52ae9f0d/Towards-Quality-of-Experience-Management-in-the-Next-Generation-of-Mobile-Networks.pdf",
            "Abstract": "Quality of Experience (QoE) is a research area that has attracted genuine interest in the last few years. Particularly for mobile network operators, QoE awareness seems to be the most appealing way to better understand the quality that their customers perceive, and, thereafter, to improve their experience. This extended abstract is focusing on the problem of QoE management from a mobile network’s perspective, proposing a framework for controlling the end-users’ QoE and also reviewing mechanisms that put this into action. Finally, the proposed QoE management framework is re-visited from an SDN architectural perspective, revealing this way new challenges and opportunities.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:lw-us_wcTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A network independent broker for obtaining the position of nomadic users",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/967900.968144",
            "Abstract": "Positioning is an essential component for the deployment of the evolving context-aware concepts. Information Society Technologies (IST) project PoLoS investigates existing schemes for Location-Based Services, Geographical Information Systems, positioning techniques and network interfaces, in order to design and implement a platform catering for the majority of Location Based Services issues. Facilitating towards this direction, PoLoS'Positioning component (POS) is introduced as a generic, scalable portable, open, modular and efficient QoS enabled framework, offering independence from the underlying heterogeneous network infrastructures and positioning techniques.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient multiple access technique for wireless ATM networks with QoS guarantees",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/829265/",
            "Abstract": "The basic concepts of the MAC (medium access control) protocol and the underlying traffic scheduling algorithm developed within the ACTS (Advanced Communications Technologies and Services) project Magic WAND (Wireless ATM Network Demonstrator) are outlined. A novel multiple access technique for the radio interface of WAND is proposed. Simulation results, showing that the proposed technique significantly improves system performance, are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RMPG: a realistic mobility pattern generator for the performance assessment of mobility functions",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1569190X04000024",
            "Abstract": "A platform for the simulation of mobility functions (e.g., protocols, application architectures) is presented. This platform, named realistic mobility pattern generator (RMPG), is based on the assumption that real humans exhibit considerable spatial and temporal regularity in their moves. We base our simulation environment on the random way-point algorithm implemented in the network simulation (ns) tool. Through the RMPG, that has been implemented in Java, we performed a series of simulations by considering a path prediction algorithm as a mobility function. We present our results.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:9pM33mqn1YgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Performance evaluation of a mobile agent-based VHE architecture in 3G networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1506546/",
            "Abstract": "One of the most important aspects in the upcoming generations of mobile wireless telecommunications infrastructure is the virtual home environment (VHE) a ubiquitous approach in the delivery of services. In this paper, we study the performance benefits of mobile agents for coping with the technical challenges associated with the VHE. We investigate the performance of mobile agents in terms of response time for service provision in a 3G network against a conventional solution. We base our experiments in an integrated, open and extensible agent-based VHE architecture by taking into account a variety of service use scenarios. Finally, we present our results.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing end-users privacy in 3G networks",
            "Publication year": 2003,
            "Publication url": "http://cgi.di.uoa.gr/~xenakis/Published/10-10th-wwrf-meeting-NY-Oct-2003/WWRF-User-privacy-3G.pdf",
            "Abstract": "Mobile/wireless Internet is becoming available with the advent of third generation (3G) mobile communication systems. Along with the variety of new perspectives, mobile Internet also raises new concerns on security issues. The radio transmission is by nature more susceptible to eavesdropping and fraud in use than wireline transmission. The user mobility and the universal network access certainly provoke security treats. The introduction of IP-based transport technology to the core of 3G networks brings along new vulnerabilities and potential threats. Mobile network operators do not deploy their own private networks, but they rather rely on the existing Internet infrastructure for the establishment of intra-network, and inter-network communications. Furthermore, the complex network topologies and the heterogeneity of the involved technologies increase the dependability challenge.Security is a critical factor to realize the opportunities presented by the ubiquity of mobile devices and networks. It is therefore important to address information security concerns for wireless applications, especially for those applications that have anything to do with mobile e-business, e-government, e-finance and e-health. Moreover, seamless access to private networks by mobile workforce is expected to be a fashionable and valuable service. Telemetry and other un-tethered equipment, traveling sale forces, field maintenance crews, telecommuters, and other mobile professionals are driving demands for anywhereanytime secure access to corporate intranets, databases, and e-mail servers.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A graph-coloring secondary resource allocation for D2D communications in LTE networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6335378/",
            "Abstract": "The Long Term Evolution (LTE) system, and especially its current release, LTE-Advanced, is considered as the next step in mobile broadband networks. Two of the main challenges faced by the LTE system are: i) to offer ubiquitous and highly reliable wireless services, and ii) to efficiently utilize the assigned spectrum portion. A promising approach towards this direction is to allow the establishment of direct device-to-device (D2D) communications in the assigned spectrum. In this paper, we study how the traffic load between users located in the same cell (intra-cell communications) can be served by D2D transmissions utilizing uplink spatial spectrum opportunities. Aiming at decongesting the base station (or eNB) and letting more resources for the inter-cell traffic (e.g., web services) extra functionality is added to system users (or UEs) for providing interference information to eNB. The collected information is …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integrated management platform for the support of advanced Charging, Accounting & Billing schemes in Reconfigurable Mobile Networks",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.10.4841&rep=rep1&type=pdf",
            "Abstract": "The convergence of telecommunications industry and the Internet are about to alter the existing business models creating an open market, where a large number of independent application/service providers will offer their services to the users through a limited number of network providers. Furthermore, new concepts such as network reconfigurability and service adaptability require new advanced and holistic solutions for several technical issues related to dynamic service provision as well as flexible charging schemes. In that context, we present the involved business players and the prospective business models for flexible service provisioning and we introduce a generic integrated management platform for Charging, Accounting and Billing enabling flexible service provision in an open marketplace.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A generic characterization of the overheads imposed by IPsec and associated cryptographic algorithms",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128605004263",
            "Abstract": "This paper presents an assessment of the communication overheads of IPsec and evaluates the feasibility of deploying it on handheld devices for the UMTS architecture. A wide range of different cryptographic algorithms are used in conjunction with IPsec, such as Data Encryption Standard (DES), Advanced Encryption Standard (AES), Message Digest (MD5) and Secure Hash Algorithm 1 (SHA-1). We consider the processing and packetization overheads introduced by these algorithms and quantify their impact in terms of communication quality (added delay for the end-user) and resource consumption (additional bandwidth on the radio interface). We conduct a quantitive analysis based on a detailed simulation model of an IPsec enabled handheld device. We verify our simulation results by comparing against analytic results obtained from an approximate analytic model.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:YsMSGLbcyi4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An SDN QoE monitoring framework for VoIP and video applications",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8449801/",
            "Abstract": "Over the past years there has been a rapid rise of the mobile communications industry which, combined with the limitations of the current communications networks' structure, necessitates the development of new networks with increased capabilities, so that users can be served with optimal quality of service and network resources utilization. Software Defined Networking (SDN) is a networking approach which transforms the network elements to simple forwarding devices, making decisions centrally. The quality of service perceived by the user, or Quality of Experience (QoE), is considered to be a matter of great importance in software defined networks. This paper presents the SDN QoE Monitoring Framework (SQMF), an SDN application that monitors and preserves the QoE for VoIP and video applications, by periodically monitoring various network parameters and using QoE estimation models.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:TaWRl4-rBxwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using proxy cache relocation to accelerate web browsing in wireless/mobile communications",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/371920.371927",
            "Abstract": "Mobile computing is considered of major importance to the computing industry for the forthcoming years due to the progress in the wireless communications area. A proxy-based architecture for accelerating Web browsing in cellular customer premises networks (CPN) is presented. Proxy caches, maintained in base stations, are constantly relocated to accompany the roaming user. A cache management scheme is proposed, which involves the relocation of full caches to the most probable cells but also percentages of the caches to less likely neighbors. Relocation is performed according to a movement prediction algorithm based on a learning automaton. The simulation of the scheme demonstrates substantial benefits for the end user.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing the general packet radio service with IP QoS support",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44554-4_24",
            "Abstract": "The General Packet Radio Service (GPRS) is the current enhancement in the GSM infrastructure, capable of handling Internet Protocol (IP) traffic for mobile computing and communications. A major deficiency of the current GPRS specification is the lack of adequate IP Quality of Service (QoS) support. In this paper a QoS aware architecture for enhancing the GPRS core network with IP QoS support is presented. The proposed scheme is based on the Integrated Services (Intserv) architecture, processed in the IETF during the past years. The applicability of the proposed architecture as well as the required signalling enhancements and modifications in the components of the GPRS architecture are discussed. To identify the applicability of our proposal in a real GPRS network, a simulation model of the proposed IntServ architecture was developed in order to quantify the effect that signalling overhead has on the …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Enhanced path prediction for network resource management in wireless LANs",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1265854/",
            "Abstract": "Path prediction is currently being considered for use in the context of mobile and wireless computing toward more efficient network resource management schemes. Path prediction allows the network and services to further enhance the quality of service levels the user enjoys. Such mechanisms are mostly meaningful in infrastructures like wireless LANs. In this article we present a path prediction algorithm that exploits the machine learning algorithm of learning automata. The decision of the learning automaton is driven by the movement patterns of a single user but is also affected by the aggregated patterns demonstrated by all users. Simulations of the algorithm, performed using the realistic mobility pattern generator, show increased prediction accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:Ri6SYOTghG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Architecture and signaling protocol for migration to cognitive reconfigurable post-3G mobile systems",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1508285.1508289",
            "Abstract": "The advent of software-defined radio products and recent advances in cognitive radio research will facilitate the preservation or even improvement of user perception in volatile radio conditions while optimizing the use of network resources. Based on cognition techniques, the autonomic communication paradigm attempts to pave the way towards self-governed systems that will alleviate the shortcomings of present remotely managed user devices. This article identifies the challenges for such cognitive reconfigurable systems and introduces CORPS, a new end-to-end architecture that unifies software and cognitive radio themes enriched by self-ware capabilities. The manuscript discusses the adopted network-agnostic protocol-independent modeling approach, which is in line with best common practices in the industry, and presents the system architecture in terms of functional specification and UML modeling. Next …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:wbdj-CoPYUoC",
            "Publisher": "ACM"
        },
        {
            "Title": "Modeling and performance evaluation of reconfiguration decision making in heterogeneous radio network environments",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5371855/",
            "Abstract": "In heterogeneous radio network environments, the incorporation of dynamic adaptation capabilities in the protocol stack of mobile devices is an important challenge. In this direction, an appropriate model of the network decision-making process for mobile device adaptation is presented. Two main adaptation alternatives are assumed: (1) handover and (2) protocol reconfiguration. We consider two classes of mobile devices, i.e., reconfigurable and autonomous; the difference between them lies on the degree by which they support the decision-making functionality. An algorithmic framework for the management of the decision-making requests for reconfiguration or handovers is proposed. This work is based on the introduced metric of user satisfaction, which is based on the network response time for serving the decision-making requests. Such a framework is important for guiding the relocation of mobile terminals to …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quality of Service Negotiation in support of post-Download User Sessions",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Lazaros-Merakos/publication/266298089_Quality_of_Service_Negotiation_in_support_of_post-Download_User_Sessions/links/5680f1a408ae1e63f1ebf160/Quality-of-Service-Negotiation-in-support-of-post-Download-User-Sessions.pdf",
            "Abstract": "Software-defined radio enables mobile devices to upgrade their capabilities through over-the-air software download. Next-generation mobile networks are expected to support radio software download to SDR-enabled equipment, dynamic selection of radio access technologies, and online switching to new operational modes during user sessions. This contribution exploits a cohesive control and management framework for serving reconfigurable devices; the primary functional entities of this logical model are described, along with a physical realization in Beyond 3G networks. In order to assure end-to-end quality of service for user traffic generated upon radio software download and equipment reconfiguration, a novel negotiation control scheme for the core network is proposed. As reconfigurability will gradually stretch from end-user devices to base stations and, in the long term, to interior network elements, the considered mechanism employs an end-to-end label capturing key reconfiguration indicators. The paper raises the issue of self-awareness of network nodes on the end-to-end data path established after a reconfiguration and discusses the challenge of providing transparent operation over so-called reconfigurationignorant nodes.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:OTTXONDVkokC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A generic model for reconfigurable protocol stacks in beyond 3G",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Evangelos-Gazis-4/publication/3436118_A_generic_model_for_reconfigurable_protocol_stacks_in_beyond_3G/links/552ff3ba0cf2f2a588ab0423/A-generic-model-for-reconfigurable-protocol-stacks-in-beyond-3G.pdf",
            "Abstract": "Global consensus on the evolution of wireless communications beyond 3G sketches a heterogeneous infrastructure that comprises different wireless systems in a complementary manner and is vested with reconfiguration capabilities that enable the flexible and dynamic adaptation of the wireless network infrastructure and spectrum resources to meet the ever-changing service requirements. For ubiquitous reconfiguration to become commonplace in wireless mobile communications, a global architecture for modeling, expressing and circulating metadata essential to reconfiguration, including reconfigurable device capabilities and semantic properties of reconfigurable protocol stacks, is necessary. We outline relative standardization initiatives in the mobile domain, summarize existing work in reconfiguration architectures and identify key shortcomings that may hinder the advent of ubiquitously reconfigurable systems. Further on, we point out some major limitations of current metadata standards in the mobile domain for the representation of capability information pertaining to reconfigurable protocol stacks. We identify essential metadata classes in support of reconfigurable communication systems, and introduce an associated object-oriented UML model. We elaborate on the design rationale of the UML model, presenting and discussing the alternative metadata representation standards and suitable encoding formats. Finally, we demonstrate the suitability of our UML model by applying it for the cases of a standardized protocol stack of 3G mobile devices and stationary 3G cellular network elements.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fair allocation of cloud & physical resources for multi-class users",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6786760/",
            "Abstract": "In Future Networks, network cloud computing is expected to bring a disruptive change in satisfying the users QoS/QoE requirements, through resource virtualisation [1]-[3]. However, two important technical challenges remain to be resolved first: a) isolation, to ensure high performance for certain users groups and applications, and (b) dynamic reallocation of cloud and physical resources according to traffic and user requirements. To address both of these challenges, it is necessary to jointly manage both the virtual and physical resources, in an efficient automated way, as well as to fulfill the individual user requirements. For example, certain users may simultaneously consume virtual resources via WiFi and physical resources via 3G, while other users are only assigned limited virtual resources that cannot fulfill their QoS. Existing work in the literature focuses on techniques for fairness optimisation in specific systems …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:-FonjvnnhkoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The LIAISON Customised Billing System for Charging Location-based Services",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Athanassia-Alonistioti/publication/265223860_The_LIAISON_Customised_Billing_System_for_Charging_Location-based_Services/links/551328940cf23203199ba1a0/The-LIAISON-Customised-Billing-System-for-Charging-Location-based-Services.pdf",
            "Abstract": "In practice, mobile network operators, service and content providers, equipment vendors, handset manufacturers and software developers need to co-operate to bring efficient location-based services in the daily life of mobile consumers. The provision of advanced location-based services is a big opportunity for all business players involved to increase their revenues. Therefore, charging and billing for location-based services are crucial issues that should be addressed. Nevertheless, the charging criteria for location-based services seem to be different from the ones traditionally used in mobile networks such as measuring the connection time or data volume. The charging information related to the usage of location-based services should concern mainly the added value and the content of such a service and should be additional information to the transport level information. Definitely, the introduction of location-based services in service provisioning opens up a large variety of new pricing models that can apply. The present contribution introduces to the LIAISON Customised Billing Module, an integrated charging architecture that addresses the main charging issues for location-based services. The proposed architecture offers flexible charging and customised billing for the consumption of location-based services, while provides authorized trusted parties with open APIs enabling the easy transmission of charging records and access to the advanced charging services offered.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Alternative Schemes for Dynamic Secure VPN Deployment in UMTS",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-006-8864-9.pdf",
            "Abstract": "Three alternative schemes for secure Virtual Private Network (VPN) deployment over the Universal Mobile Telecommunication System (UMTS) are proposed and analyzed. The proposed schemes enable a mobile node to voluntarily establish an IPsec-based secure channel to a private network. The alternative schemes differ in the location where the IPsec functionality is placed within the UMTS network architecture (mobile node, access network, and UMTS network border), depending on the employed security model, and whether data in transit are ever in clear-text, or available to be tapped by outsiders. The provided levels of privacy in the deployed VPN schemes, as well as the employed authentication models are examined. An analysis in terms of cost, complexity, and performance overhead that each method imposes to the underlying network architecture, as well as to the mobile devices is presented …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:YFjsv_pBGBYC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Evaluating the RSVP mobility proxy concept",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1046703/",
            "Abstract": "Mobility and QoS provision are the two most important burdens to solve before IP becomes truly ubiquitous. Mobile IP and RSVP (resource reservation protocol) are the most visible proposals for those problems. Their interoperability, though, is inefficient. To ameliorate the compatibility problem and performance gap, we have proposed the introduction of the RSVP mobility proxy (see Paskalis, S. et al., \"RSVP Mobility Proxy\", Internet Draft, 2001; Workshop on Wireless Local Networks, 2001). We present a performance evaluation of our scheme versus the plain RSVP operation.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using path prediction to improve TCP performance in wireless/mobile communications",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1024415/",
            "Abstract": "The operation of TCP in wireless mobile environments is discussed. After presenting previous efforts to ameliorate TCP performance in the considered environments, we propose a new mechanism for tackling the transmission slowdown problems caused by handovers. Our proposal is based on stochastic datagram relocation. Traffic destined to the mobile terminal is tunneled to and cached into adjacent cells according to the output of a path prediction algorithm. To reduce the associated overhead, only percentages of inbound traffic are copied to the cell's neighborhood on the basis of estimated probabilities. The time scheduling for datagram relocation is also taken into account. Simulations of the proposed architecture show substantial performance improvements for TCP traffic.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security in third generation mobile networks",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366403003268",
            "Abstract": "In the last few years, we have witnessed an explosion in demand for security measures motivated by the proliferation of mobile/wireless networks, the fixed-mobile network convergence, and the emergence of new services, such as e-commerce. 3G-systems play a key role in this network evolution, and, thus, all stakeholders are interested in the security level supported in the new emerging mobile environment. This paper elaborates on the security framework in 3G mobile networks. The security requirements imposed by the different types of traffic, and by the different players involved (mobile users, serving network and service providers) are investigated. The security architecture, which comprises all the security mechanisms that are projected for the Universal Mobile Telecommunication System (UMTS) network, is analyzed. The employment of traditional security technologies, originally designed for fixed networking …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The beauty of consistency in radio-scheduling decisions",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7849059/",
            "Abstract": "Radio scheduling is a well-studied problem that has challenged researchers throughout the last decades. However, recent findings that stem from the Quality of Experience (QoE) domain come to give a new perspective to traditional radio scheduling approaches. In this paper, we take advantage of recent subjective results regarding the impact of throughput fluctuations on the QoE of interactive applications and revisit well-known scheduling algorithms. By quantifying the impact of traditional radio schedulers on user-perceived QoE, we manage to draw new conclusions regarding the radio scheduling problem, such as the importance and impact of consistency of the resource allocation decisions on the users' QoE. As main result, fair algorithms inherently seem to be more consistent than greedy ones, providing less throughput fluctuations and, thus, better QoE. Based on this outcome, we propose a new scheduling …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:RVsengBWOnMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey of dynamically adaptable protocol stacks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5415861/",
            "Abstract": "The continuous development of new networking standards over the last decade has resulted in an unprecedented proliferation of interfacing technologies and their associated protocol stacks. Never before was such a wide gamut of network architectures, protocol configurations and deployment options available to network designers. Alas, this significant increase in flexibility has come at the cost of an increased complexity in network management tasks, particularly with regard to the accommodation of performance requirements. Especially in mobile settings, this is due to the greater probability of unforeseen communication contexts that renders the efficient provisioning of multiple dissimilar protocol stacks a challenging task. To address this unpredictability, several approaches based on the dynamic adaptation of protocol stacks during runtime have been proposed and investigated over the years. This article …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless ATM",
            "Publication year": 2003,
            "Publication url": "http://cgi.di.uoa.gr/~passas/Encyclopedia-paper.pdf",
            "Abstract": "Broadband and mobile communications are presently the two major drivers in the telecommunications industry. Asynchronous Transfer Mode (ATM) is considered the most suitable transport technique for the Broadband Integrated Services Digital Network (B-ISDN), due to its ability to flexibly support a wide range of services with Quality-of-Service (QoS) guarantees. These services are categorized in five classes according to their traffic generation rate pattern: Constant Bit Rate (CBR), real-time Variable Bit Rate (rt-VBR), non-real-time Variable Bit Rate (nrt-VBR), Available Bit Rate (ABR) and Unspecified Bit Rate (UBR). On the other hand, wireless communications are enjoying a large growth in the last decade. Wireless Local Area Networks (LANs) in particular, are becoming popular for indoor data communications because of their tetherless feature and increasing transmission speed. The combination of wireless communications and ATM, referred to as “wireless ATM”, aims at providing freedom of mobility with service advantages and QoS guarantees.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:EYYDruWGBe4C",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Providing for QoS maintenance in wireless IP environments",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1258794/",
            "Abstract": "A flow rejection algorithm for the dynamic RSVP (dRSVP) is proposed. dRSVP is an enhanced version of RSVP, aiming at providing dynamic quality of service (QoS) support in a variable bandwidth environment through guarantees of ranges of bandwidth instead of specific values. Flow rejection occurs when the channel quality decreases to a level that even the minimum bandwidth requirements per flow cannot be fulfilled. The proposed algorithm aims at significantly improving the flow dropping probability, without affecting the bandwidth utilization. Its operation is based on setting priority classes and rejecting the minimum required number of flows per class, in order to guarantee QoS to the remaining. Both mathematical analysis and simulation results show that the overall flow rejection probability can be significantly reduced.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A QoS based distributed method for resource allocation in unlicensed wireless ATM systems",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-47728-4_43",
            "Abstract": "A decentralized multiple access technique for radio resource allocation for Base Stations (BSs) is presented. The proposed Distributed Dynamic Channel Reservation (DDCR) method applies to mutlicarrier wireless dynamic TDMA LANs, where self-organized BSs act as hubs offering wireless access to Mobile Terminals (MTs). The method is suitable for unlicensed wireless environment, and especially in scenaria where BSs of different providers are installed in a common coverage area. In the proposed approach, BSs are competing to access and reserve time on separate frequencies, using a dynamic TDMA/TDD technique. The paper introduces etiquette rules, and contention disciplines, whilst eliminates any hidden terminal phenomena. Additionally, it defines carrier selection rules, allowing BSs to select the less congested carrier, based on real time measurements. Finally, the paper evaluates and …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:kzcrU_BdoSEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Non-cooperative dynamic spectrum access for cdma networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4411589/",
            "Abstract": "Recent studies indicate the presence of a significant amount of idle licensed spectrum, in different time periods and geographic locations. Prompted by the latest regulatory changes and radio technology advances, dynamic spectrum access is becoming increasingly attractive, for alleviating the spectrum scarcity problem in the unlicensed bands. We study the dynamic spectrum access in a CDMA environment. We assume that users selfishly switch from one frequency band to another, so as to maximize their individual benefit, and model the studied problem as a non-cooperative game. We propose a probabilistic, distributed strategy with which users might share the available re sources to satisfy their quality of service requirements, and minimize their transmitted power. The comparison of the proposed strategy against other alternative strategies shows that it combines fast convergence, efficiency and stability, while …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A SIP-based method for intra-domain handoffs",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1285389/",
            "Abstract": "The mobility management issue in IP access networks can be dealt with from various perspectives. A possible approach includes the use of the session initiation protocol (SIP) and its associate entities for mobility signaling. Following this approach, existing SIP functionality in a network can be reused for mobility management purposes, providing efficient utilization of resources. In this paper we propose the hierarchical mobile SIP (HMSIP) framework, a SIP-based intra-domain mobility management approach that builds upon the general framework of SIP mobility management. The HMSIP agent is introduced as a border network entity providing the necessary mobility functionality. Detailed location and mobility management procedures are presented. The scheme is further enhanced with additional functionality for the support of multiple HMSIP agents across the border of a domain, maintaining a unique contact …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Database Technologies for Handling-XML-Information on the Web (DataX)-Pervasive Information Management (PIM)-MITOS: A Smart Spaces System for Pervasive Computing",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=2430865802369398009&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:dQ2og3OwTAUC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Enabling device discovery transmissions in LTE networks with fractional frequency reuse",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128615002030",
            "Abstract": "The major challenge in device-to-device (D2D) communications is the device discovery problem, i.e., the problem of meeting the communication peers in time, frequency and space. This requires frequent transmission of discovery signals, consuming expensive and scarce radio resources. To mitigate this consumption, we propose a coordination scheme that reuses uplink (UL) spectrum opportunities under a “blind” spatial spectrum reuse approach. Based on the low transmission demands of the discovery transmissions (low range and power, limited quality requirements, etc.), the scheme enables a number of discovery transmissions without continuously gathering and processing the actual interferences in the network. The focus is on a long term evolution (LTE) network that adopts the fractional frequency reuse (FFR) inter-cell interference coordination technique. In this case, the “blind” spatial spectrum reuse …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:DJbcl8HfkQkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "RSVP mobility proxy",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=4193138502753582213&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:8d8msizDQcsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ant colony optimization for resource sharing among D2D communications",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7033266/",
            "Abstract": "Device-to-Device (D2D) communication has been recently devised as a new paradigm that boosts spectrum reuse inside a cell, leading to enhanced quality of service and user experience. The design of proper D2D resource allocation schemes, which constitute the enablers towards this direction, is an open challenge. In this paper, we propose a D2D resource allocator based on the Ant Colony Optimization (ACO) theory. ACO is exploited towards identifying interference isolated D2D links that can safely share the same resources, consulting a graph representation of the network. Simulation studies demonstrate the self-learning nature of this method, which results to a comparable performance to that of an optimal resource allocator of significantly higher computational complexity.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:edDO8Oi4QzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A flexible handover mechanism for seamless service continuity in heterogeneous environments",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366405002926",
            "Abstract": "The success of wireless access technologies, such as wireless LANs, has forced mobile operators and manufacturers to consider their integration into 3G infrastructures. Nowadays, several research groups and standardization bodies are working to provide such integrated architectures. One of the main aims of these architectures is to provide seamless service continuity to users that move from one access system to another. Towards this end, new mobility management mechanisms are required to minimize transition time between systems and efficiently handle the scarce radio resources to guarantee specific Quality of Service (QoS). This paper specifies such an architecture, which will enable continuous QoS support in an integrated system of multiple access technologies. More specifically, the paper focuses on the network context information that has to be considered during a transition between these systems …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Dynamic programming based content placement strategy for 5G and beyond cellular networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8514960/",
            "Abstract": "Optimal caching strategies of popular contents in heterogeneous cellular networks are studied. The increasing demand for data traffic by users of the wireless network can be handled by rapaciously caching most frequently accessed contents by users. Hence, we propose an efficient popular content placement strategy, the first step in the content caching process, typically for popular video files. To do so, we introduce a novel approach for caching popular contents. This caching strategy follows a dynamic programming approach to tackle the optimization complexity of selecting most popular files among a wide range of files, under certain constraints. The proposed strategy gives the combination of popular files to be cached that maximizes the optimal cache hit probability with a pseudo-polynomial time complexity. To that end, we used the well-known resourcing algorithm, called the 0/1-Knapsack problem, assuming …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:DPkBdyRpVwQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Brokering positioning data from heterogeneous infrastructures",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:WIRE.0000049402.33897.15",
            "Abstract": "Over the last years, cellular operators, service and content providers, have been trying to identify the needs of a fully connected user, facilitating pervasiveness communications and ubiquitous computing concepts. One of the most promising directions is the so-called context-aware environment. Positioning is an essential component for the deployment of the evolving context-aware concepts. This article introduces a unified positioning component (POS), which establishes a generic, open, modular, and efficient quality of service (QoS) enabled framework, offering independence from the underlying heterogeneous network infrastructures and positioning techniques. The design objectives of POS are presented, as well as its functionality, the technical specifications and the prototype implementation of the POS component, elaborating on the features and services that it offers to the PoLoS platform and …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:M05iB0D1s5AC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Spectral efficiency of cognitive radio networks under interference constraint and QoS guarantees",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790611001078",
            "Abstract": "We study the problem of maximizing spectral efficiency of cognitive radio network deployments subject to an interference constraint and under specific quality of service (QoS) guarantees. The interference constraint corresponds to the upper limit of the received power that can be tolerated at the licensed users’ due to transmissions from unlicensed users. The QoS guarantees stem from the requirements imposed by the applications running at the users’ terminals. A cross-layer design is adopted that maps the user’s requirements into delay related QoS guarantees at the data link layer and error probability QoS guarantees at the physical layer. The obtained numerical results provide important insights regarding the impact of the considered constraint and guarantees on the achievable spectral efficiency of cognitive radio networks.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:hMod-77fHWUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "On jamming and black hole attacks in heterogeneous wireless networks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8820067/",
            "Abstract": "The proliferation of radio-enabled equipment, including sensors, controllers, actuators, mobile handhelds, etc., into the today's heterogeneous wireless network (HWN) has led to the support of different vertical services on-top of the same physical infrastructure. Such an approach increases the potential for enhanced multiplexing gains due to the joint utilization of multiple network tiers and their resources. However, it also links the availability of new services to the robustness of the HWN infrastructure against malicious attacks. In this paper, we study the impact of two prominent denial of service (DoS) attacks, the jamming and the black hole attack, on network coverage of multi-tier HWNs. In particular, we consider a HWN model of multiple tiers, where the locations of nodes belonging to each tier are modeled by a homogeneous Poisson point process (PPP) with known intensity. Each tier consists of regular nodes …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:VU60ks20i7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Coordinated handover initiation and cross-layer adaptation for mobile multimedia systems",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5235154/",
            "Abstract": "A cross-layer mechanism to improve the performance of real-time applications over IEEE 802.16e metropolitan area networks is presented. The proposed mechanism uses channel quality and service quality information from the physical and medium access control layers, respectively, to determine the most suitable burst profile, transmission power level and media encoding rate for a connection, or even initialize a handover execution. The main contribution of this mechanism is the integration of the handover initiation into the cross layer logic, aiming to improve the overall system performance. Extensive simulation results show that the proposed mechanism offers significant performance improvement in terms of packet loss rate, power consumption, throughput, and system capacity.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A QoS-oriented dynamic channel assignment method for wireless ATM LANs",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/904642/",
            "Abstract": "A centralized approach for dynamic channel assignment (DCA) in wireless systems is presented. The proposed method applies to structured wireless LANs, where base stations act as hubs to offer wireless access to mobile terminals. We focus on wireless ATM LANs, although the method applies also to other packet-based systems, offering quality-of-service (QoS) guarantees. A central scheduler for DCA (CSDCA) is introduced for the dynamic assignment of resources to the requesting base stations. This scheduler takes into account mutual interference constraints of the base stations, current resource usage, and delay constraints of active connections. Simulation results have shown the improved performance attained by the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobility management for femtocells in LTE-advanced: Key aspects and survey of handover decision algorithms",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6563279/",
            "Abstract": "Support of femtocells is an integral part of the Long Term Evolution - Advanced (LTE-A) system and a key enabler for its wide adoption in a broad scale. Femtocells are short-range, low-power and low-cost cellular stations which are installed by the consumers in an unplanned manner. Even though current literature includes various studies towards understanding the main challenges of interference management in the presence of femtocells, little light has been shed on the open issues of mobility management (MM) in the two-tier macrocell-femtocell network. In this paper, we provide a comprehensive discussion on the key aspects and research challenges of MM support in the presence of femtocells, with the emphasis given on the phases of a) cell identification, b) access control, c) cell search, d) cell selection/reselection, e) handover (HO) decision, and f) HO execution. A detailed overview of the respective MM …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:MLfJN-KU85MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proactive Resource Management for the Mitigation of Service Discontinuation in Mobile Networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4067665/",
            "Abstract": "A scheme for the proactive allocation of network resources to mobile users, based on a pricing framework, is proposed. The objective is the reduction of service discontinuation events attributed to handovers in the cellular infrastructure. The future base station, where network resources have to be reserved proactively, is determined by means of a path prediction algorithm. The network receives a fee for providing the advance reservation service to the user. The exact price is determined after a sequential bargaining procedure, modeled as a two-person non-cooperative game between the mobile user and the network The efficiency of the proposed scheme is evaluated through simulations.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Technology and communications strategy at the Athens 2004 olympic games",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1024409/",
            "Abstract": "With technology evolving at a rapid rate, the Olympic Games have become the mirror of the newest tested leadingedge technologies, and they combine all available media in a coherent whole, where each component complements the others. The coverage of the Athens 2004 Olympics, in the form of text, images, and sound, will exploit all technological means, both old and new, for the former must infallibly reach all parts of the planet, even those that have not fulfilled the standards of contemporary technology so far.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The trivariate Weibull distribution with arbitrary correlation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4023281/",
            "Abstract": "In this paper an analytical framework for analyzing the arbitrarily correlated trivariate Weibull distribution is introduced. For this distribution infinite series representations for the joint probability density function, the cumulative distribution function (CDF) and the moments are derived. Two special correlation cases of the distribution are studied: the exponential and the constant. These series representations are readily applicable to the performance analysis of a 3-branch selection combining (SC) receiver operating in a Weibull correlation fading environment and the outage probability is derived. The proposed mathematical analysis is complemented by various numerical results, showing the effects of fading severity, correlation and the power decay factor",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On demand network-wide VPN deployment in GPRS",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1081763/",
            "Abstract": "Mobile Internet requires enhanced security services available to all mobile subscribers in a dynamic fashion. A network-wide virtual private network deployment scenario over the General Packet Radio Service is proposed and analyzed from a security viewpoint. The proposed security scheme improves the level of protection that is currently supported in GPRS and facilitates the realization of mobile Internet. It secures data transmission over the entire network route from a mobile user to a remote server by utilizing the default GPRS ciphering over the radio interface, and by deploying an IP VPN over the GPRS core, as well as on the public Internet. Thus, on-demand VPN services are made available for all GPRS network subscribers and roaming users. The VPN functionality, which is based on the IPsec framework, is outsourced to the network infrastructure to eliminate the potential computational overhead on the …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel content placement strategy for heterogeneous cellular networks with small cells",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8889750/",
            "Abstract": "The proliferation of multimedia services creates an explosive growth of video traffic in cellular networks, which is oftentimes caused by requests from different users of the same (popular) video content. We model the problem of optimal placement of popular video files in the cache of small cells as a 0/1 Knapsack problem, and use dynamic programming to solve it. The performance of the obtained optimal solution is evaluated and compared with that of other ad-hoc placement strategies. Useful guidelines for the design of cache-enabled cellular networks are also given.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:flnLHN-H2asC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey on parametric QoE estimation for popular services",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804516302533",
            "Abstract": "As we are moving forward to the 5G era, we are witnessing a transformation in the way networks are designed and behave, with the end-user placed at the epicenter of any decision. One of the most promising contributors towards this direction is the shift from Quality of Service (QoS) to Quality of Experience (QoE) service provisioning paradigms. QoE, i.e., the degree of delight or annoyance of a service as this is perceived by the end-user, paves the way for flexible service management and personalized quality monitoring. This is enabled by exploiting parametric QoE assessment models, namely specific formula-based QoE estimation methods. In this paper, recognizing a gap in the literature between the lack of a proper manual regarding the objective QoE estimation and the ever increasing interest from network stakeholders for QoE intelligence, we provide a comprehensive guide to standardized and state-of-the …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:KFIQUvoPKFAC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Evaluation of an enhanced intelligent DCA technique for unlicensed WLANs and PAWNs",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1200577/",
            "Abstract": "Over the last years, a number of mechanisms have been proposed for scheduling different types of traffic over base stations-oriented wireless and mobile systems. The majority of these mechanisms focus on access control in the base station-to-mobile units part of the wireless and mobile system. Recent proposals for the unlicensed spectrum in the 5GHz band have redefined the problem, since base stations, operated by different operators in overlapping geographical areas, need access resolution mechanisms to allocate wireless resources. This issue is addressed here, and a novel mechanism for dynamic channel allocation in unlicensed wireless LANs (WLANs) or public area wireless networks (PAWNs) environments is presented. The proposed method exploits the learning automata technique for the efficient allocation of wireless resources in a distributed manner. Nearby base stations that compete to access …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:QYdC8u9Cj1oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the performance of network-assisted device-to-device discovery",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7417033/",
            "Abstract": "Device-to-Device (D2D) communications enable direct exchange of localized traffic between cellular users in proximity. Nonetheless, the employment of D2D communications heavily relies on the capability of the cellular devices to infer on their proximity. In this paper, we analyze the performance of network- assisted D2D discovery in random cellular networks and derive optimal deployment strategies for transforming the today's cellular network, which is optimized for coverage and capacity, into a D2D- centric network where the discovery and communications between cellular devices will be orchestrated by the core network. In this direction, we develop an analytical framework that exploits existing knowledge of the cellular network topology and effectively estimates the probability that two tagged devices are in proximity, a.k.a. D2D discovery probability. Also, we identify conditions under which the D2D discovery …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:FKJBpZmfD-IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Charging, accounting and billing management schemes in mobile telecommunication networks and the internet",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5342234/",
            "Abstract": "The current technological advances in mobile telecommunication networks and the Internet are about to alter existing business models. These different worlds converge and create an open market, where a large number of independent application/service providers will offer their services to users through a limited number of network providers. At the same time, the evolution of existing network technologies and the specification of new concepts requires new advanced and holistic solutions in several technical areas. One such area is related to the design and management of new sophisticated functions and protocols to support innovative, flexible, and efficient charging, accounting, and billing mechanisms. This survey article considers the key concepts of such mechanisms, and the requirements they impose upon the network infrastructure. The article presents the latest efforts undertaken by standardization bodies in …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance estimation of a decentralized mutlicarrier access framework in unlicensed wireless systems",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/936668/",
            "Abstract": "An analytic estimation on the performance of a proposed decentralized multiple access technique for radio resource management of self-organized base stations (BSs) is presented. the proposed distributed dynamic channel reservation (DDCR) method applies to multicarrier wireless ATM LANs, where base stations act as hubs to offer wireless ATM access to mobile terminals (MTs). The method is suitable for unlicensed wireless nodes, and especially in scenaria when BSs with different providers are installed in a common coverage area. The paper evaluates etiquette rules, contention disciplines, medium access control (MAC) mechanisms and carrier selection rules through simulations.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic resource allocation in adaptive wireless OFDMA systems",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.1030",
            "Abstract": "Modern wireless orthogonal frequency division multiple access (OFDMA) systems incorporate dynamic resource allocation (DRA), adaptive modulation and coding (AMC), and power control (PC) to exploit multiuser diversity and achieve higher system throughput. In the literature, only a few proposed algorithms deal with the contiguous DRA problem according to which a contiguous collection of resources can be allocated to each user. This paper formulates this high complexity problem, provides a suitable decision metric and a simple yet efficient solution. The proposed algorithm allocates in each step a contiguous collection of resources to the pending user that leads to the highest estimated correctly received number of bits. Simulation results show that, in this way, considerably improved performance can be achieved in terms of overall system throughput, spectral efficiency, and served traffic. Copyright © 2010 …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:AXPGKjj_ei8C",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "A distributed multiple access technique for radio resource allocation in unlicensed wireless ATM LANs",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/881415/",
            "Abstract": "A distributed multiple access technique for radio resource management is presented. The proposed distributed dynamic channel reservation (DDCR) method applies to multicarrier wireless ATM LANs, where base stations act as hubs to offer wireless ATM access to mobile units. The method is suitable for unlicensed wireless systems, where base stations are installed in a common coverage area. According to the proposed approach, base stations compete to access and reserve time on separate frequencies, using a dynamic TDMA/TDD technique, combined with listening and competing periods. Etiquette rules, contention disciplines and medium access control mechanisms are proposed. Procedures for terminal association and registration, and solutions for the hidden terminal problem are introduced. Finally, the performance of the presented contention disciplines is evaluated and compared through simulations.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the complexity of\" Always Best Connected\" in 4G mobile networks",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1285942/",
            "Abstract": "Global developments in wireless communications have shaped a novel, user-centric vision for the next generation of mobile systems and wireless access network broadly termed \"4G\". This widely accepted vision sketches a heterogeneous infrastructure comprising different wireless access systems in a complementary manner, where the user, supported by his/her personal intelligent agent(s), enjoys untethered connectivity and ubiquitous access to applications, value-added services and multimedia content over the most efficient combination of wireless and wireline systems available. We proceed to analyze the implications of this \"Always Best Connected\" vision to identify pivotal concepts and formulate an appropriate model. Furthermore, we proceed to analyze the complexity of our proposed model by showing that, in principle, being \"Always Best Connected\" translates to family of problems that are known to be …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy-efficient and interference-aware handover decision for the LTE-Advanced femtocell network",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6654902/",
            "Abstract": "Femtocells will play a key role for the wide adoption of the LTE-Advanced system, as they bring the access network closer to the end user in a cost-effective manner. This disruptive communication paradigm, however, dictates the use of advanced interference and mobility management algorithms to cope with the dense yet unplanned network layout. In this paper, we present an interference-aware handover decision algorithm for the LTE-Advanced femtocell network, which utilizes standard signal measurements to select the candidate cell that a) attains the minimum required channel gain for sustaining service continuity and b) minimizes the mean UE transmit power for a prescribed mean SINR target. The proposed algorithm attains backwards compatibility with the LTE-Advanced system, as it is deployed by using the private mechanism for non-standard use. Based on the evaluation methodology of the Small Cell …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A device discovery scheme for proximity services in LTE networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6912514/",
            "Abstract": "Device-to-Device (D2D) communications are currently attracting high interest from industry and academia, targeting at new commercial and public safety proximity services (ProSe). A major challenge under consideration is the device discovery problem, i.e., the problem of meeting the communication peers in time, frequency and space. In line with the current standardization efforts from the 3rd Generation Partnership Project (3GPP), we propose a centrally controlled device discovery scheme which consists of an application layer procedure and a set of access level enhancements. The target of the application layer procedure is to enable the ProSe discovery services, while the access level enhancements ensure the spectrum resources required for discovery transmissions. Evaluation results illustrate the impact of consuming cellular resources for device discovery on cellular network performance, while reveal the …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:PoWvk5oyLR8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic resource allocation in adaptive wireless multiuser multicarrier systems",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5483513/",
            "Abstract": "Modern wireless multiuser multicarrier systems (MU-MC) incorporate Dynamic Resource Allocation (DRA), Adaptive Modulation and Coding (AMC) and Power Control (PC) to exploit multiuser diversity and achieve higher system throughput. In the literature, only a few proposed algorithms deal with the contiguous DRA problem (contiguous collection of resources). This paper formulates this high complexity problem, provides suitable throughput estimation metrics and a simple yet efficient solution. The proposed algorithm allocates in each step a contiguous collection of resources to the pending user resulting in the highest estimated throughput. Simulation results show that in this way, considerably improved performance can be achieved in terms of overall system throughput and spectral efficiency, compared to more conventional approaches.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implications of proactive datagram caching on TCP performance in wireless/mobile communications",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366402001081",
            "Abstract": "The operation of TCP in wireless–mobile environments is discussed in this paper. After briefly presenting previous efforts to ameliorate TCP performance in the considered environments, we propose a new mechanism for tackling the slow-down problems caused by handovers. Our mechanism is based on stochastic datagram relocation. Traffic destined to the mobile terminal is tunneled to and cached into adjacent cells according to the output of a path prediction algorithm. To reduce the associated overhead, only percentages of inbound traffic are copied to the cell's neighborhood on the basis of estimated probabilities. The time scheduling for datagram relocation is also taken into account. Simulations of the proposed architecture show substantial performance improvements for TCP traffic.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:FAceZFleit8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A dynamic subchannel allocation algorithm for IEEE 802.16 e networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4556189/",
            "Abstract": "The paper describes a system architecture and formulation of the Dynamic Subchannel Allocation problem in IEEE 802.16e networks. According to it, the DSA algorithm operates as an extension of a IEEE 802.16 time scheduler, trying to exploit the benefits of the OFDMA mode. Simulation results show a considerable improvement, compated to the legacy system, especially in terms of channel errors.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic scheduling method, system and article of manufacture for a wireless access to an asynchronous transfer mode network",
            "Publication year": 2000,
            "Publication url": "https://patents.google.com/patent/US6141336A/en",
            "Abstract": "A method, system and article of manufacture for exchanging data between an asynchronous network and a synchronous network is presented. Data is exchanged between the networks in a sequence of time frames which are partitioned into downlink, uplink and contention periods. These downlink, uplink and contention periods are further divided into time slots, each of which carries either data or control cells between the networks. Cells of data are allocated to the time slots according to their cell deadlines which are proportional to the transmission delay of the network connection over which the cells are to be carried. This cell allocation is then stored in a slot map and communicated to all nodes within the networks in order to facilitate the data transmission.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A flow rejection algorithm for QoS maintenance in a variable bandwidth wireless IP environment",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1295058/",
            "Abstract": "A flow rejection algorithm for the dynamic resource reservation protocol (dRSVP) protocol is proposed. dRSVP is an enhanced version of RSVP, aiming at providing dynamic quality-of-service (QoS) support in a variable bandwidth environment (e.g., wireless) through guarantees of ranges of bandwidth instead of specific values. Flow rejection occurs when the channel quality decreases to a level that even the minimum bandwidth requirements per flow cannot be fulfilled. The proposed algorithm aims at improving the flow dropping probability of dRSVP, without affecting the bandwidth utilization. Its operation is based on setting priority classes and rejecting the minimum required number of flows per class, in order to guarantee QoS to the remaining. Both mathematical analysis and simulation results show that the overall flow dropping probability can be significantly reduced.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proxies+ Path Prediction: Improving Web Service Provision in Wireless–Mobile Communications",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1024583613701",
            "Abstract": "Mobile computing is considered of major importance to the computing industry for the forthcoming years due to the progress in the wireless communications area. A proxy-based architecture for accelerating Web browsing in wireless customer premises networks is presented. Proxy caches, maintained in base stations, are constantly relocated to follow the roaming user. A cache management scheme is proposed, which involves the relocation of full caches to the most probable cells but also percentages of the caches to less likely neighbors. Relocation is performed according to the output of a user movement prediction algorithm based on a learning automaton. The simulation of the scheme shows considerable benefits for the end user.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:4DMP91E08xMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "ProVa: A proximity validation approach for enhanced device discovery",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7794863/",
            "Abstract": "Towards the new era of communications, direct communications are intensively studied by industry and academia. One of the major challenges in this communication paradigm is the device discovery problem, referring to the mutual detection of neighboring devices prior the establishment of the direct communication. Recognizing the scarcity of the radio resources and the need for frequent discovery transmissions, we propose a validation approach as a complement to the device discovery process. Building on the idea that the neighboring relationship of some devices may last for long time, an enhanced radio resource allocation is applied for those devices, improving the overall performance of the discovery process.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:vpzZMdrIWDEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Triple-branch mrc diversity in weibull fading channels",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4408369/",
            "Abstract": "In this paper a performance analysis of triple-branch maximal ratio combining (MRC) diversity receivers operating over an arbitrarily correlated Weibull fading environment is presented. For the trivariate Weibull distribution infinite series representations for the joint probability density function (PDF) and the cumulative distribution function (CDF) are derived. Moreover, a novel analytical expression for the joint moment-generating function (MGF) is presented. It is assumed that the arbitrarily correlated variates do not necessarily have identical fading parameters and average powers. These series representations are readily applicable to the performance analysis of a triple-branch MRC receiver. Furthermore, the average bit error probability (ABEP) is then derived and analytically studied. The proposed mathematical analysis is accompanied by various numerical results, with parameters of interest the fading severity, the …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Autonomous mobile agent routing for efficient server resource allocation",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121208002719",
            "Abstract": "Mobile agents are becoming increasingly important in the highly distributed applications frameworks seen today. Their routing/dispatching from node to node is a very important issue as we need to safeguard application efficiency, achieve better load balancing and resource utilization throughout the underlying network. Selecting the best target server for dispatching a mobile agent is, therefore, a multi-faceted problem that needs to be carefully tackled. In this paper we propose distributed, adaptive routing schemes (next node selection) for mobile agents. The proposed schemes overcome risks like load oscillations, i.e., agents simultaneously abandoning a congested node in search for other, less saturated node. We try to induce different routing decisions taken by agents to achieve load balancing and better utilization of network resources. We consider five different algorithms and evaluate them through simulations …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:NhqRSupF_l8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Wireless Web Services using Mobile Agents and Ontologies.",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1652209/",
            "Abstract": "We discuss the integration of two contemporary service technologies: Web services and mobile agents. We exploit the capabilities offered by mobile agents to query and invoke semantically enriched Web services without the need for simultaneous, online presence of the service requestor. Such service setting is ideal for wireless/mobile computing, where user terminals are not necessarily online during their entire session. To improve the capabilities of service registries met in the Web services reference architecture, we exploit the advantages of the semantic Web framework. Specifically, we use enhanced registries enriched with semantic information that provide semantic matching to service queries and published service descriptions",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scheduling differentiated traffic in multicarrier unlicensed systems",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-47906-6_74",
            "Abstract": "Over the last few years, a number of mechanisms have been proposed for scheduling different type of traffic over base stations-oriented wireless and mobile systems. The majority of these mechanisms focus on access control in the base stations-to-mobile units part of the wireless and mobile system. Recent proposals for the unlicensed spectrum in the 5GHz band redefine the problem, since base stations operated by different operators and organizations in overlapping geographical areas need access resolution mechanisms to allocate wireless resources. This issue is addressed here, and a multicarrier access control scheme, called QoS based Dynamic Channel Reservation (QDCR), is proposed. QDCR allows base stations to select the least congested available carrier, to compete for carrier reservation based on QoS requirements, and to share the allocated carrier and time with its associated Mobile …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Opportunistic spectrum access over mobile WiMAX networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5686976/",
            "Abstract": "Opportunistic spectrum access (OSA) currently receives a constantly growing interest due to the under-utilization of the licensed spectrum. OSA refers to identifying and exploiting spatiotemporal underutilized spectrum portions in order to be occupied by unlicensed-secondary users. The efficiency of an OSA scheme is strongly correlated with the adopted sensing strategy and primary user activity model. A design focusing on a given (pre-specified) primary system is expected to result in improved performance, by exploiting system's specific operational features. This paper provides a suitable system model and a highly efficient opportunistic spectrum assignment algorithm under an infrastructure-based architecture, assuming a mobile WiMAX network as the primary system.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enabling D2D communications in LTE networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6666632/",
            "Abstract": "Device-to-Device (D2D) communications provide the means to users of cellular networks for spatially reusing licensed spectrum by establishing direct connections. Considering the benefits for operators and consumers, a plethora of resource and interference management approaches in the literature deal with parallel cellular and D2D transmissions. However, this feature is not yet supported by modern cellular systems, such as the Long Term Evolution (LTE). The current paper targets at filling this gap by enabling D2D transmissions in LTE networks. Standardized LTE capabilities are utilized to provide a comprehensive framework on which existing or future resource and interference management schemes for D2D communications may be applied. The proposed framework is assessed under a moderate scenario where the cellular resource management policy is not affected. Results show that multiple D2D …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:k8Z6L05lTy4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards qoe provisioning in next generation cellular networks",
            "Publication year": 2015,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.696.9366&rep=rep1&type=pdf#page=10",
            "Abstract": "Quality of Experience (QoE) is defined as “the degree of delight or annoyance of the user of an application or service”[1]. The inherent subjectivity in this definition explains the fact that QoE research has attracted interest from multiple disciplines and has been studied from various angles. In this work, we address QoE from a telecom operator’s perspective, providing insights towards enabling QoE provisioning in the next generations of cellular networks. In cellular networks, despite the catholic presence of inherently deployed Quality of Service (QoS) mechanisms, QoE has been more of an “afterthought”. This means that previous and existing network generations have not been inherently designed with QoE principles in mind. It is envisioned, however, that the next, ie 5th, generation of communication networks will be more user-centric, designed to deliver consistent experience to the users and to give them the perception of “infinite capacity”[2].",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:HtS1dXgVpQUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting IP QoS in the general packet radio service",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/871335/",
            "Abstract": "The General Packet Radio Service is the current enhancement in the GSM infrastructure, capable of handling Internet protocol traffic for mobile computing and communications. A major deficiency of the current GPRS specification is the lack of adequate IP quality of service support. Two schemes for enhancing the GPRS architecture with the existing IP QoS support architectures, IntServ and DiffServ, are proposed. Solutions are proposed to the problem of establishing QoS reservations across the GPRS core network, and the required signaling enhancements and modifications in the components of the GPRS architecture are identified. Of the two proposed schemes the IntServ one requires frequent refreshing of state information and extra signaling. To quantify the effect that signaling overhead has on GPRS operation and performance, a simulation model of the proposed IntServ architecture was developed, which …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:2VqYfGB8ITEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The emergence of experience packages in the 5G era",
            "Publication year": 2017,
            "Publication url": "http://futurenetworks.ieee.org/tech-focus/june-2017/emergence-of-experience-packages",
            "Abstract": "Handling Quality of Experience as a mean opinion score is not sufficient to meet the requirements of the 5 th generation of communication networks. In this direction, the concept of “experience package” emerges. Experience packages may be configured and delivered in a way that fine-grained differentiation is achieved, respecting the user, application and communication context.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:cnT3a81PI4sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey of internet QoS signaling",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5342297/",
            "Abstract": "The need for real-time services support over the Internet drives research efforts toward the provisioning of quality of service (QoS) guarantees in IP networks. Among the various aspects of QoS provisioning, QoS state establishment and maintenance in intermediate routers is a major factor, responsible for dynamic resource allocation. The dynamic manipulation of QoS state is possible through the utilization of appropriate QoS signaling that triggers the respective resource allocation in QoS-capable network elements. At first, protocol design assumed a homogeneous underlying network and resulted in end-to-end QoS protocols that applied a specific QoS configuration in all routers along the path. However, the need for accommodating network heterogeneity and flexibility led to a two-tier resource management model that utilizes separate signaling for intra- and inter-domain reservations and requires different …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generic system architecture for 4G mobile communications",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1207073/",
            "Abstract": "In the European Union, the debate about 4G mobile has spawned the vision of a system that enables an \"always best connected\" (ABC) mode of communication for the citizen of the forthcoming information society. This now widely accepted vision sketches a heterogeneous communication landscape comprising different wireless access system in a complementary manner, where the user, supported by his/her personal intelligent agent(s), enjoys untethered connectivity and ubiquitous access to applications over the most efficient combination of wireless systems available. In the present paper, we identify the major developments in the fourth generation mobile communication market, present the technical aspects of the fourth generation network architecture and analyze the implications of the \"ABC\" vision upon it in terms of functional requirements and overall service provision capabilities. In closing, we introduce a …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of a mobile agent-based platform for ubiquitous service provision",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1574119208000710",
            "Abstract": "The Virtual Home Environment (VHE) is a very important mechanism in the upcoming mobile telecommunications infrastructure, providing a ubiquitous approach in the delivery of services. The universality of systems like UMTS and WLANs increases the need for efficient introduction of VHE. In this paper, we discuss the adoption of Mobile Agents (MA) for coping with the VHE technical challenges. We present the detailed design of an integrated, open and extensible architecture, by taking into account a variety of use cases and technical alternatives (mobile devices, fixed terminals). Relevant implementations are presented to indicate the feasibility of the technical orientation discussed. Finally, we study and compare the performance of the proposed agent based framework with a conventional solution.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:4vMrXwiscB8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "LAMPS: Location Agents and Mobile-PNNI Scheme",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812793928_0030",
            "Abstract": "In this paper we introduce a new location management mechanism, called LAMPS (Location Agents and Mobile PNNI Scheme). This mechanism was designed for large private wireless ATM environments, where the switches are inter-connected using the PNNI (Private Network-to-Network Interface) protocol. In such an environment, it is expected that mobility enhanced switches will co-exist with standard switches (i.e., no support for mobility procedures), and that different sets of switches will form disjoint areas of continuous radio coverage. LAMPS takes advantage of the PNNI routing functionality to tackle the location management requirements. In addition, location agents located in the mobility enhanced switches, store when required, the location areas of the mobile terminals.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Toward a generic\" always best connected\" capability in integrated WLAN/UMTS cellular mobile networks (and beyond)",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1452851/",
            "Abstract": "The next generation of mobile communications, broadly referred to as 4G, is based on a heterogeneous infrastructure comprising different wireless (and wired) access systems in a complementary manner. 4G mobile users enjoys seamless mobility and ubiquitous access to applications in an always best connected (ABC) mode that employs the most efficient combination of available access systems. The ongoing commercialization of 3G cellular mobile networks and their upcoming enhancement with WLAN radio access provides a wireless platform suitable for the introduction of \"ABC\" capabilities. We analyze the implications of the \"ABC\" vision in a UMTS/WLAN network context, and reveal important issues that arise. Further on, we identify major requirements, point out the limitations of current UTMS/WLAN standards from an ABC viewpoint, and discuss key enabling technologies and research efforts. We formulate …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Communication Networks Laboratory, University of Athens, 15784, Athens, Greece",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=849pDQAAQBAJ&oi=fnd&pg=PA21&dq=info:92C-8n-Q_PAJ:scholar.google.com&ots=dY8wKYDnW7&sig=gBdsl1ZkUDl70NDEenD1TLvGUtU",
            "Abstract": "Global vision consensus on the next generation of wireless mobile communications, broadly termed 4G, sketches a heterogeneous infrastructure, comprising different wireless access systems in a complementary manner and vested with reconfiguration capabilities that will facilitate a more flexible and dynamic adaptation of the wireless infrastructure to meet the ever-changing service requirements. We present the generic stages of reconfiguration procedures and identify the management requirements in the context of these stages. Next, we introduce a generic, platform-independent reconfiguration management framework to be hosted on end systems and elaborate on its main components.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:3htObqc8RwsC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "A game theoretic approach to web caching",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_115",
            "Abstract": "In this paper, the Game Theoretic framework is applied to Web caching. The interaction of multiple clients with a caching subsystem is viewed as a non-cooperative game. Some clients may continuously request resources, occupy a large segment of the cache disk space and thus, enjoy high hit rates. Owing to this situation, the remaining clients may suffer the removal of their “important” resources from the cache, and, subsequently, experience numerous cache misses. A utility function is introduced and calculated by clients in a decentralized fashion to avoid such monopolizing s cenarios and guarantee similar performance levels for all users.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:UxriW0iASnsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A prediction-based scheduling mechanism for interconnection between WiMAX and satellite networks",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJAACS.2009.024414",
            "Abstract": "In this article, we describe and evaluate a scheduling mechanism that can be used in joint WiMax/satellite environments. The proposed mechanism consists of three parts. The first part requests satellite bandwidth based on an estimation of the needs of the WiMax network at the time the bandwidth is granted, the second part allocates bandwidth on the satellite channel, while the third distributes it to the WiMax users. Simulation results show considerably improved performance compared to a simpler mechanism without prediction, especially in terms of throughput and delay.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:pqnbT2bcN3wC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "A cooperative uplink power control scheme for elastic data services in wireless CDMA systems",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1140086.1140089",
            "Abstract": "We consider the uplink power control problem in a single cell CDMA wireless data system. Each user specifies upper and lower QoS bounds. We formulate the considered problem as a game, and first examine the non-cooperative case. We then compare it to its cooperative counterpart (through the Nash bargaining solution). The use of the cooperative scheme shows significant reduction in the transmission power of the mobile terminals, while the achieved QoS is slightly compromised, compared to the non-cooperative scheme.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:hFOr9nPyWt4C",
            "Publisher": "ACM"
        },
        {
            "Title": "The need for QoE-driven interference management in femtocell-overlaid cellular networks",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11569-6_46",
            "Abstract": "Under the current requirements for mobile, ubiquitous and highly reliable communications, internet and mobile communication technologies have converged to an all-Internet Protocol (IP) packet network. This technological evolution is followed by a major change in the cellular networks’ architecture, where the traditional wide-range cells (macrocells) coexist with indoor small-sized cells (femtocells). A key challenge for the evolved heterogeneous cellular networks is the mitigation of the generated interferences. In the literature, this problem has been thoroughly studied from the Quality of Service (QoS) point of view, while a study from the user’s satisfaction perspective, described under the term “Quality of Experience (QoE)”, has not received enough attention yet. In this paper, we study the QoE performance of VoIP calls in a femto-overlaid Long Term Evolution – Advanced (LTE-A) network and we examine …",
            "Abstract entirety": 0,
            "Author pub id": "H5xlwE4AAAAJ:e_rmSamDkqQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Addressing traffic demanding scenarios in cellular networks through QoE-based rate adaptation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7343494/",
            "Abstract": "Currently, cellular networks are evolving towards providing high quality mobile services in a ubiquitous manner. In this direction, increased robustness is required to face fluctuations at the service quality that follow traffic demanding events, such as an earthquake or a blackout. Dealing with this challenge, we propose a cross-layer scheme, which handles the traffic changes by adjusting dynamically the encoding rate at the application layer. The rate adjustments target at controlling the impact on the provided Quality of Experience (QoE), i.e., the key metric for assessing the perceptual quality of a provided service. The performance analysis conducted revealed a smooth QoE adaptation to traffic changes with quite low signaling cost for the exchange of the rate adaptation commands.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:H3xT48m3F74C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An advanced location information management scheme for supporting flexible service provisioning in reconfigurable mobile networks",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1179557/",
            "Abstract": "The evolution of third-generation mobile communications networks has nominated the requirements for flexible service provisioning, intelligent and customized charging, as well as location-aware service and data management as key enablers for the support of new advanced service offerings to mobile users. Our work is related to the design and implementation of a flexible service provisioning and reconfigurability management middleware for third-generation systems and beyond. The article focuses especially on the location-related features and functionality of our architecture, discussing the interactions required to accomplish location- and mobility-aware user profiling, service deployment and discovery, as well as charging and billing.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic web services and mobile agents integration for efficient mobile services",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/article/semantic-web-services-mobile-agents/2843",
            "Abstract": "The requirement for ubiquitous service access in wireless environments presents a great challenge in light of well-known problems like high error rate and frequent disconnections. In order to satisfy this requirement, we propose the integration of two modern service technologies: Web Services and Mobile Agents. This integration allows wireless users to access and invoke semantically enriched Web Services without the need for simultaneous, online presence of the service requestor. Moreover, in order to improve the capabilities of Service registries, we exploit the advantages offered by the Semantic Web framework. Specifically, we use enhanced registries enriched with semantic information that provide semantic matching to service queries and published service descriptions. Finally, we discuss the implementation of the proposed framework and present our performance assessment findings.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:RGFaLdJalmkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A Prediction-based Scheduling Mechanism for interconnection between WiMax and Satellite Networks Interactive Network",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4599943/",
            "Abstract": "In this paper, we describe and evaluate a scheduling mechanism that can be used in joint satellite/WiMax environments. The proposed mechanism consists of three parts. The first part requests satellite bandwidth based on an estimation of the needs of the WiMax network at the time the bandwidth is granted. The second part allocates bandwidth on the satellite channel, while the third distributes it to the WiMax users. Simulation results show considerably improved performance compared to a simpler mechanism, especially in terms of throughput and delay.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:gsN89kCJA0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handover support for TCP connections through path prediction",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/997437/",
            "Abstract": "The operation of TCP in wireless-mobile environments is discussed. After briefly presenting previous efforts to ameliorate TCP performance in the considered environments, we propose a new mechanism for tackling the slowdown problems caused by handovers. Our mechanism is based on stochastic datagram relocation. Traffic destined to the mobile terminal is tunneled to and cached into adjacent cells according to the output of a path prediction algorithm. To reduce the associated overhead, only percentages of inbound traffic are copied to the cell's neighborhood on the basis of estimated probabilities. The time scheduling for datagram relocation is also taken into account. Simulations of the proposed architecture show substantial performance improvements for TCP traffic.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security architecture standardization and services in UMTS",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.711.9906&rep=rep1&type=pdf",
            "Abstract": "Security is a primary concern in mobile communication systems. Wireless access is inherently less secure, and mobility implies higher security risks than static operation. The security framework for 3G mobile systems is considered, and its principles and security requirements are discussed. Furthermore, the security features that are currently being standardized in 3GPP, as well as the emerging 3G-security architecture are elaborated. The focus is on the various mechanisms and protocols, which are employed to provide security at different levels, and on their effect on network operation.",
            "Abstract entirety": 1,
            "Author pub id": "H5xlwE4AAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        }
    ]
}]