[{
    "name": "Λεωνίδας Γεωργιάδης",
    "romanize name": "Leonidas Georgiadis",
    "School-Department": "Ηλεκτρολόγων Μηχ & Μηχ Υπολογιστών ",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 6050,
    "Scholar name": "Leonidas Georgiadis",
    "Scholar id": "GjFfiVwAAAAJ",
    "Affiliation": "Aristotle University of Thessaloniki",
    "Citedby": 7131,
    "Scholar url": "https://scholar.google.com/citations?user=GjFfiVwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Multiuser broadcast erasure channel with feedback and side information, and related index coding results",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7028609/",
            "Abstract": "In this paper we consider the N-user broadcast erasure channel with public feedback and side information. Before the beginning of transmission, each receiver knows a function of the messages of some of the other receivers. This situation arises naturally in wireless and in particular cognitive networks where a node may overhear transmitted messages destined to other nodes before transmission over a given broadcast channel begins. We provide an upper bound to the capacity region of this system. When the side information is linear, this bound is tight for the case of two-user broadcast channels. The special case where each user knows the whole or nothing of the message of each other node, constitutes a generalization of the index coding problem. For this instance, and when there are no channel errors, we show that the bound reduces to the known Maximum Weighted Acyclic Induced Subgraph bound. We …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Broadcast erasure channel with feedback-capacity and algorithms",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5191394/",
            "Abstract": "We consider the two-user broadcast erasure channel where feedback in the form of ack messages is fed back to the transmitter. We provide an upper bound to the capacity region of this system. We then present two algorithms whose rate region (information bits per transmitted bit) becomes arbitrarily close to the upper bound for large packet sizes. The first algorithm relies on random coding techniques while the second relies only on XOR operations between pairs of packets. Complexity and feedback information tradeoffs for the two algorithms are discussed. For the case where, in addition to traffic destined exclusively to either one of the users there is additional multicast traffic, we present an algorithm that shows that the rate region of the system can be increased by allowing inter-session coding. Finally, for the case where there are random arrivals to the system we present an algorithm, based on the previous …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Internet Traffic Engineering",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=14803982624928678272&hl=en&oi=scholarr",
            "Abstract": "Traffic engineering encompasses a set of techniques that can be used to control the flow of traffic in data networks. We discuss several of those techniques that have been developed during the last few years. Some techniques are focused on pure IP networks while others have been designed with emerging technologies for scalable Quality of Service (QoS) such as Differentiated Services and MPLS in mind. We first discuss traffic engineering techniques inside a single domain. We show that by using a non-linear programming formulation of the traffic engineering problem it is possible to meet the requirements of demanding customer traffic, while optimising the use of network resources, through the means of an automated provisioning system. We also extend the functionality of the traffic engineering system through policies. In the following, we discuss the techniques that can be used to control the flow of packets between domains. First, we briefly describe interdomain routing and the Border Gateway Protocol (BGP). Second, we summarise the characteristics of interdomain traffic based on measurements with two different Internet Service Providers. We show by simulations the limitations of several BGP-based traffic engineering techniques that are currently used on the Internet. Then, we discuss the utilisation of BGP to exchange QoS information between domains by using the QOS-NLRI attribute to allow BGP to select more optimum paths. Finally, we consider the multi-homing problem and analyse the current proposed IPv6 multi-homing solutions are analysed along with their impact on communication quality.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality of service provisioning for supporting premium services in IP networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1189075/",
            "Abstract": "Given the emergence of IP networks and the Internet as the multi-service network of choice, it is plausible consider its use for transporting demanding multimedia traffic with high bandwidth and low delay and packet loss requirements. Emerging technologies for quality of service such as differentiated services and MPLS can be used for premium quality traffic. We present a traffic engineering and control system that starts from services agreed with customers and provisions the network according to the expected traffic demand so as to meet the requirements of contracted services while optimizing the use of network resources. We devise a non-linear programming formulation of the problem and show through simulations that we can achieve the objectives and meet the requirements of demanding customer traffic.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WiOpt 2007-Message from the Technical Program Chairs",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4480015/",
            "Abstract": "The design of wireless networks offers challenges not present in fixed networks: the offered traffic and the network topology depend of the mobility of the nodes; moreover, the network capacity may be time-varying and transmission interference from neighboring nodes must be considered. The designs should not only be functioning correctly, they are also expected to optimize the performance with respect to many criteria, such as energy efficiency, quality of service, and capacity utilization. The WiOpt symposium brings together researchers and practitioners working on the optimization of wireless networks from different perspectives, such as performance analysis, protocol design, wireless communication, and optimization theory. The reported research improves the state-of-the-art in design, analysis, dimensioning and operations of wireless networks. The contributions also provide insights into theoretical aspects as …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:WZBGuue-350C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Precomputation of constrained widest paths in communication networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_98",
            "Abstract": "We consider the problem of precomputing constrained widest paths in a communication network. Precomputing and storing of all relevant paths minimizes the computational overhead required to determine an optimal path when a new connection request arrives. We present three algorithms that precompute paths with maximal bandwidth (widest paths), which in addition satisfy given end-to-end delay constraints. We analyze and compare the algorithms both in worst case and through simulations using a wide variety of networks.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Robust network response to overload traffic fluctuations",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=9775881824355380692&hl=en&oi=scholarr",
            "Abstract": "Unpredictability in traffi c load variations, link capacity fluctuations, topology modi# fications, node failures or other types of intentional misbehavior may lead the network in overload conditions. Instantaneous system response in those stressful situations is essen# tial for effective crisis management in the system. We investigate the issue of overload response in an information collection network. We consider a network consisting of an arbitrary spatial arrangement of nodes. Information may be generated at any node in the network and needs to be forwarded to a collection of hub (sink) nodes. The spatial distri# bution of traffi c generation intensity is specified by the vector of traffi c generation rates at each node. In overload condition this vector may lie outside the feasibility region of the system, that is there may be no feasible flow to transfer the information to the sinks, given the capacity of the system. This may occur …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stability and capacity through evacuation times",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6404690/",
            "Abstract": "We consider a system where jobs (packets) arrive for processing using one of the policies in a given class. We study the connection between the minimal evacuation times and the stability region of the system under the given class of policies. The result is used to establish the equality of information theoretic capacity region and system stability region for the multiuser broadcast erasure channel with feedback.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "xor-Based Encoding With Instantaneous Decoding for the Broadcast Erasure Channel With Feedback: The Three-User Case",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6824263/",
            "Abstract": "We study the case of a three-user broadcast erasure channel with multiple unicast traffic sessions, where feedback from the users is fed back to the transmitter in the form of positive acknowledgment (ACK)/negative acknowledgment (NACK) messages. The capacity region of this system has been recently derived and two capacity-achieving coding algorithms employing intersession linear network coding have been proposed. Since these algorithms suffer from large computational complexity and decoding delay, our aim, in this paper, is to design a coding algorithm with reduced computational complexity and a low decoding delay that achieves a comparable rate region to the former algorithms. We exclusively consider algorithms that require no knowledge of channel statistics, only perform XOR operations among the packets, and allow for instantaneous decoding by any receiver that successfully receives a packet …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lexicographically optimal balanced networks",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/916257/",
            "Abstract": "We consider the problem of allocating bandwidth between two endpoints of a backbone network so that no parts of the network are unnecessarily loaded. We formulate the problem as lexicographic optimization, and develop algorithms for its solution. The solution consists of (a) identifying a cut in the network where the optimal load can be determined on all the links of the cut, and (b) considering the same problem in each of the subnetworks to which the cut is dividing the original network.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy detection under RF impairments for cognitive radio",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7247299/",
            "Abstract": "Direct-conversion radio receivers can offer highly integrated low-cost hardware solutions for spectrum sensing in cognitive radio systems. However, these receivers are susceptible to radio frequency (RF) impairments, such as in-phase and quadrature-phase imbalance, low-noise amplifier nonlinearities and phase noise, which limit the spectrum sensing capabilities. In this paper, we study the joint effects of RF impairments on energy detection based spectrum sensing in multi-channel environments. In particular, we provide an analytical framework for the evaluation of the probabilities of detection and false alarm, assuming Rayleigh fading and approximating the joint effects of RF impairments by a Gaussian distribution. Numerical results illustrate the detrimental effects of RF imperfections on the spectrum sensing performance, which bring significant losses in the spectrum utilization.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:hMsQuOkrut0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bottleneck multicast trees in linear time",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1246057/",
            "Abstract": "On a directed graph with arc costs and a given source node, s, we consider the problem of computing multicast (Steiner) trees spanning any given node subset, V, so that the maximum of the tree arc costs is minimized. We show that this problem can be solved by simply solving the bottleneck path problem, i.e., the problem of determining for each node, t/spl ne/s, a path from s to t so that the maximum of path arc costs is minimized. For the latter problem we provide an implementation of Dijkstra's algorithm that runs in linear time under mild assumptions on arc costs.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Minimal evacuation times and stability",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6798773/",
            "Abstract": "We consider a system where packets (jobs) arrive for processing using one of the policies in a given class. We study the connection between the minimal evacuation time and the stability region of the system and show that evacuation time optimal policies can be used for stabilizing the system (and for characterizing its stability region) under broad assumptions. Conversely, we show that while a stabilizing policy can be suboptimal in terms of evacuation time, one can always design a randomized version of any stabilizing policy that achieves an optimal evacuation time in the asymptotic regime when the number of evacuated packets scales to infinity.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Channel sharing by rate-adaptive streaming applications",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016653160300124X",
            "Abstract": "There are various techniques for adapting the transmission rate of an application while maintaining the perceived quality at the receiver at acceptable levels. Shared-channel systems can use this rate adaptation capability to increase the number of concurrent applications in the system. This can be achieved by appropriately modifying the rate of the already running applications when a new connection arrives in the system. In this paper we present an analytical model for a class of algorithms for channel sharing by rate-adaptive applications. We provide means for calculating performance measures related to the quality of reception of an application. We also present the design of algorithms that ensure fair channel sharing while keeping the application performance within acceptable levels.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "An efficient power constrained transmission scheme for hybrid OW/RF systems",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6883846/",
            "Abstract": "This paper investigates link layer transmission schemes for hybrid optical wireless (OW)/radio frequency (RF) systems with constraints on both per-link and total power consumption at the transmitter. Assuming timeslot structure and using a queue for storing the random data packet arrivals, we formulate a stochastic optimization problem where intelligent control decisions are taken by the hybrid transmitter in each slot, regarding the number of the packets admitted in its queue and the power levels used in each link. The aim of this formulation is to design a control policy that maximizes the transmitter throughput, while satisfying its power constraints as well. A solution is offered by using the Lyapunov optimization framework. An on-line transmission algorithm is derived, which takes control decisions based only on the status of the transmitter queue and the erasure probabilities of the OW and RF links. The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:URolC5Kub84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for providing user level quality of service guarantees in multi-class rate adaptive systems",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s10922-008-9101-5",
            "Abstract": "The problem of channel sharing by rate adaptive streams belonging to various classes is considered. Rate adaptation provides the opportunity for accepting more connections by adapting the bandwidth of connections that are already in the system. However, bandwidth adaptation must be employed in a careful manner in order to ensure that (a) bandwidth is allocated to various classes in a fair manner (system perspective) and (b) bandwidth adaptation does not affect adversely the perceived user quality of the connection (user quality). The system perspective aspect has been studied earlier. This paper focuses on the equally important user perspective. It is proposed to quantify user Quality of Service (QoS) through measures capturing short and long-term bandwidth fluctuations that can be implemented with the mechanisms of traffic regulators, widely used in networking for the purpose of controlling the …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "ROUTING AND CONTROL IN OPTICAL NETWORKS",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1016503927131",
            "Abstract": "OPTICAL NETWORKS MAGAZINE: ISSN 1388-6916 is published bimonthly by SPIE—The International Society for Optical Engineering, PO Box 10, Bellingham WA 98227-0010 USA and Kluwer Academic Publishers, 101 Philip Drive, Norwell, MA 02061 USA. Articles and reviews published herein reflect the opinion of the author (s); inclusion of articles and advertisements does not necessarily constitute endorsement or sanction by the editors or by SPIE/Kluwer Academic Publishers.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal relay control in power-constrained dual-hop transmissions over arbitrary fading channels",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4024753/",
            "Abstract": "This paper examines the performance of a dualhop, noise-limited, non-regenerative system where the relay gain is allowed to vary as an unknown deterministic function of the channel states, subject to instantaneous (i.e. peak) and average power constraints, the latter directly affecting battery lifetime in wireless systems. A convex optimization problem, in terms of a generic performance metric, is formulated and solved algorithmically for the Signal-to-Noise Ratio (SNR), Shannon rate and BPSK Bit-Error-Rate (BER) utilities. The presented model allows for arbitrary statistics of the fading channels, including correlation between them. Special emphasis is placed on the relation between the optimal solutions obtained when observing the channels of either the first or both hops. The regions in channel state space where zero and full power is allocated are determined in closed form, with numerical results being presented …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network coding techniques for primary-secondary user cooperation in cognitive radio networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9043900/",
            "Abstract": "In this paper, we investigate transmission techniques for a fundamental cooperative cognitive radio network, i.e., a cognitive radio system where a Secondary user may act as relay for messages sent by the Primary user, hence offering performance improvement of Primary user transmissions, while at the same time obtaining more transmission opportunities for its own transmissions. Specifically, we examine the possibility of improving the overall system performance by employing network coding techniques. The objective is to achieve this while affecting Primary user transmissions only positively, namely: 1) avoid network coding operations at the Primary transmitter, hence avoiding increase of its storage requirements and keeping its complexity low, 2) keep the order of packets received by the Primary receiver the same as in the non cooperative case and 3) induce packet service times that are stochastically smaller …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:HIFyuExEbWQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity and algorithms for a cognitive network with primary-secondary user cooperation",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1907.03444",
            "Abstract": "In this work, we examine cognitive radio networks, where secondary users may act as relays for messages sent by the primary user, hence offering performance improvement of primary transmissions, while at the same time obtaining more transmission opportunities for their own data. In particular, assuming the broadcast packet erasure model with feedback, we investigate the capacity of the fundamental cooperative cognitive radio network which consists of one primary and one secondary transmitter-receiver pairs. The primary transmitter is the owner of the channel and as such, we intend to keep its operations simple and to avoid increasing its storage requirements. Specifically, the primary transmitter does not receive data sent by the secondary transmitter and does not perform any coding operations. On the other hand, the secondary transmitter can overhear primary transmissions and is allowed to perform any coding operations. We develop an outer bound to the capacity of the fundamental cooperative cognitive radio network under consideration. Then, we propose a coding-scheduling algorithm suitable for this type of networks, which involves only XOR network coding operations. The complexity of the scheduling decisions of the proposed algorithm depends on the channel statistical parameters and three cases, depending on the relations between channel erasure probabilities, are distinguished. For the first two cases the rate region of the proposed algorithm coincides with the developed capacity outer bound, hence the algorithm is capacity achieving. For the third case, the rate region of the proposed algorithm is not identical to the outer …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Minimum-energy broadcasting in multi-hop wireless networks using a single broadcast tree",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-006-5189-6",
            "Abstract": "In this paper we address the minimum-energy broadcast problem in multi-hop wireless networks, so that all broadcast requests initiated by different source nodes take place on the same broadcast tree. Our approach differs from the most commonly used one where the determination of the broadcast tree depends on the source node, thus resulting in different tree construction processes for different source nodes. Using a single broadcast tree simplifies considerably the tree maintenance problem and allows scaling to larger networks. We first show that, using the same broadcast tree, the total power consumed for broadcasting from a given source node is at most twice the total power consumed for broadcasting from any other source node. We next develop a polynomial-time approximation algorithm for the construction of a single broadcast tree. The performance analysis of the algorithm indicates that the …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Algorithms for precomputing constrained widest paths and multicast trees",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1528503/",
            "Abstract": "We consider the problem of precomputing constrained widest paths and multicast trees in a communication network. Precomputing and storing of the relevant information minimizes the computational overhead required to determine an optimal path when a new connection request arrives. We evaluate algorithms that precompute paths with maximal bandwidth (widest paths), which in addition satisfy given end-to-end delay constraints. We analyze and compare both the worst case and average case performance of the algorithms. We also show how the precomputed paths can be used to provide computationally efficient solutions to the constrained widest multicast tree problem. In this problem, a multicast tree with maximal bandwidth (widest multicast tree) is sought, which in addition satisfies given end-to-end delay constraints for each path on the tree from the source to a multicast destination.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Stable and capacity achieving XOR-based policies for the broadcast erasure channel with feedback",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6620757/",
            "Abstract": "In this paper we describe a network coding scheme for the Broadcast Erasure Channel with multiple unicast stochastic flows, for the case of a single source transmitting packets to N users, where per-slot feedback is fed back to the transmitter in the form of ACK/NACK messages. This scheme performs only binary (XOR) operations and includes special rules for coding packets that ensure instantaneous decodability. Drawing on the results of network stability under statistical overhearing, we provide a stabilizing policy using this coding scheme. Furthermore, we show that, for N = 4 and i.i.d. erasure events, the stability region of such a system effectively coincides with its information-theoretic capacity region, and provide a stabilizing policy that employs this XOR-based scheme.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:9Nmd_mFXekcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Message-passing algorithms for optimal utilization of cognitive radio networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6649455/",
            "Abstract": "Cognitive Radio has been proposed as a key technology to significantly improve spectrum usage in wireless networks by enabling unlicensed users to access unused resource. We present new algorithms that are needed for the implementation of opportunistic scheduling policies that maximize the throughput utilization of resources by secondary users, under maximum interference constraints imposed by existing primary users. Our approach is based on the Belief Propagation (BP) algorithm, which is advantageous due to its simplicity and potential for distributed implementation. We examine convergence properties and evaluate the performance of the proposed BP algorithms via simulations and demonstrate that the results compare favorably with a benchmark greedy strategy.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:nrtMV_XWKgEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WIRELESS PROTOCOLS USING NETWORK CODING: REPORT ON ON STATE-OF-THE-ART",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/41536337/__20Book_20-_20Wireless_20Protocols_20Using_20Network_20Coding_20-_20Report_20on_20state-of-the-art.pdf",
            "Abstract": "We survey a representative subset of proposed protocols that use network coding in wireless environments. We provide a comparison of these with respect to the following aspects: supported communication primitives, backward compatibility, layers involved (from physical to transport layer), and implementation complexity. The report concludes with directions for future research.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "7 Final remarks",
            "Publication year": 2006,
            "Publication url": "https://go.gale.com/ps/i.do?id=GALE%7CA150091433&sid=googleScholar&v=2.1&it=r&linkaccess=abs&issn=1554057X&p=AONE&sw=w",
            "Abstract": "The cross-layer resource allocation model presented in this text was motivated by wireless communication networks. Nevertheless it has within its scope a number of other application areas and it can be extended in various ways. Some are outlined below.High speed switches with input queueing is an area that attracted a lot of attention [40, 72, 86, 88, 102, 103]. Packet scheduling in such a switch falls within the scope of our resource allocation model. The switch architecture imposes restrictions of a single packet transmission per slot for each input and output port, a restriction that is captured by the transmission conflict constraints of the resource allocation model. The capacity region characterization as well as the optimal control policies results apply in that case. Different applications pose different requirements on the scheduling policy regarding tolerable complexity and distributed versus centralized …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Now Publishers, Inc."
        },
        {
            "Title": "Is the Internet fractal? The multicast power law revisited",
            "Publication year": 2001,
            "Publication url": "https://hal.inria.fr/inria-00072466/",
            "Abstract": "One of the main benefits of multicast communication is the overall reduction of network load. To quantify this reduction, when compared to traditional unicast, experimental studies by Chuang and Sirbu indicated the so called power law which asserts that the number of links in a multicast delivery tree connecting a source to m (distinct) sites is in m^0.8. In order to explain theoretically this behavior, Phillips, Shenker, and Tangmunarunkit examined approximately the link number for a V-ary complete tree topology, and concluded that this number grows nearly linearly with m, thus not obeying the power law. We first re-examine the analysis by Phillips et.al. and provide precise asymptotic expansion for the link number that confirms the nearly linear (with some wobbling) growth. Claiming that the essence of the problem lies in the modeling assumptions, we replace the V-ary complete tree topology by a V-ary self-similar tree with similarity factor 0\\leq\\theta<1. In such a tree a node at level k is replicated CV^(D-k)\\theta times, where D is the depth of the tree and C is a constant. Under this assumption, we analyze again L(m) and prove that L(m)\\sim cm^1-\\theta where c is an explicitly computable constant. Hence self-similar trees provide a plausible explanation of the multicast power law. Next, we examine more general conditions for general trees, under which the power law still holds. We also discuss some experimental results in real networks that reaffirm the power law and show that in these networks the general conditions hold.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "NCRAWL: Network coding for rate adaptive wireless links",
            "Publication year": 2011,
            "Publication url": "https://arxiv.org/abs/1104.0645",
            "Abstract": "Intersession network coding (NC) can provide significant performance benefits via mixing packets at wireless routers; these benefits are especially pronounced when NC is applied in conjunction with intelligent link scheduling. NC however imposes certain processing operations, such as encoding, decoding, copying and storage. When not utilized carefully, all these operations can induce tremendous processing overheads in practical, wireless, multi-rate settings. Our measurements with prior NC implementations suggest that such processing operations severely degrade the router throughput, especially at high bit rates. Motivated by this, we design {\\bf NCRAWL}, a Network Coding framework for Rate Adaptive Wireless Links. The design of NCRAWL facilitates low overhead NC functionalities, thereby effectively approaching the theoretically expected capacity benefits of joint NC and scheduling. We implement and evaluate NCRAWL on a wireless testbed. Our experiments demonstrate that NCRAWL meets the theoretical predicted throughput gain while requiring much less CPU processing, compared to related frameworks.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Policy-based network dimensioning for IP differentiated services networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1045775/",
            "Abstract": "Given the emergence of IP networks and the Internet as the multi-service network of the future, it is plausible to consider its use for transporting demanding traffic with high bandwidth and low delay and packet loss requirements. Emerging technologies for scalable quality of service such as differentiated services (DiffServ) and MPLS can be used for premium quality traffic. We look at the problem of intra-domain provisioning in an automated manner from the point of view of an Internet service provider (ISP), i.e. we want to satisfy the contracts with our customers while optimizing the use of network resources. We also need to be able to guide the behavior of such an automated provisioning system dynamically in order to be able to meet the high-level business objectives. The emerging policy-based management paradigm is the means to achieve this requirement. We devise first a nonlinear programming formulation of …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Policy-based network dimensioning for IP differentiated services networks",
            "Publication year": 2003,
            "Publication url": "https://www.scipedia.com/public/Georgiadis_et_al_2003a",
            "Abstract": "Given the emergence of IP networks and the Internet as the multi-service network of the future, it is plausible to consider its use for transporting demanding traffic with high bandwidth and low delay and packet loss requirements. Emerging technologies for scalable quality of service such as differentiated services (DiffServ) and MPLS can be used for premium quality traffic. We look at the problem of intra-domain provisioning in an automated manner from the point of view of an Internet service provider (ISP), ie we want to satisfy the contracts with our customers while optimizing the use of network resources. We also need to be able to guide the behavior of such an automated provisioning system dynamically in order to be able to meet the high-level business objectives. The emerging policy-based management paradigm is the means to achieve this requirement. We devise first a nonlinear programming formulation of …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:bKqednn6t2AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting wireless channel state information for throughput maximization",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1208682/",
            "Abstract": "The problem of scheduling packets over a number of channels with time varying connectivity is considered. Policies proposed for this problem either stabilize the system when the arrival rates are within the stability region, or optimize an objective function under the assumption that all channel queues are saturated. We address the realistic situation where it is not known a priori whether the channel queues are saturated or not, and provide a scheduling policy that maximizes the weighted sum of channel throughputs. We employ a burstiness-constrained channel model that allows us to dispense of statistical assumptions and simplifies the proofs.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Stable XOR-based policies for the broadcast erasure channel with feedback",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6963508/",
            "Abstract": "In this paper, we describe a network coding scheme for the Broadcast Erasure Channel with multiple unicast stochastic flows, for a single source transmitting packets to N users with per-slot ACK/NACK feedback. This scheme performs only binary (XOR) operations and involves a network of queues, along with special rules for coding and moving packets among the queues, that ensure instantaneous decodability. Additionally, for the scheme to work, one has to specify which packets to select for encoding at each time, based on the received feedback. Contrary to prior work where this packet selection was explicitly specified a priori, we employ a backpressure-type policy that makes the selection based only on queue backlogs. We next provide a stability region outer bound for arbitrary N and erasure patterns and show that this bound effectively coincides with a bound on the system's information-theoretic capacity …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic Exchange of Communication Services",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2695533.2695548",
            "Abstract": "Motivation.The increasing mobile data demand and the proliferation of advanced user-owned network equipment have given rise to collaborative schemes, where users satisfy each other's communication needs whenever they have spare network resources [2]. A prerequisite for the success of these models is to ensure that users will share their resources in a fair fashion, and hence will agree to cooperate. Ideally, from a system design point of view, each user should receive resources (or, service) commensurate to his contribution. When this is not possible, e.g., due to asymmetries in resource availability, we would prefer to have a lexicographically optimal (or, lex-optimal) outcome that balances the resource exchanges as much as possible. Nevertheless, achieving such an allocation is an intricate task since: (i) the service exchange is constrained by an underlying graph that prescribes, for each node, the subset of …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "ACM"
        },
        {
            "Title": "Resource allocation and cross-layer control in wireless networks",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=5zZ_ySPE4k8C&oi=fnd&pg=PA1&dq=info:sSeyYXcETWAJ:scholar.google.com&ots=Glsh4t0kbQ&sig=lWzXpQGI56J434tg-d_6VBfUgWE",
            "Abstract": "Information flow in a telecommunication network is accomplished through the interaction of mechanisms at various design layers with the end goal of supporting the information exchange needs of the applications. In wireless networks in particular, the different layers interact in a nontrivial manner in order to support information transfer. In this text we will present abstract models that capture the cross-layer interaction from the physical to transport layer in wireless network architectures including cellular, ad-hoc and sensor networks as well as hybrid wireless-wireline. The model allows for arbitrary network topologies as well as traffic forwarding modes, including datagrams and virtual circuits. Furthermore the time varying nature of a wireless network, due either to fading channels or to changing connectivity due to mobility, is adequately captured in our model to allow for state dependent network control policies. Quantitative performance measures that capture the quality of service requirements in these systems depending on the supported applications are discussed, including throughput maximization, energy consumption minimization, rate utility function maximization as well as general performance functionals. Cross-layer control algorithms with optimal or suboptimal performance with respect to the above measures are presented and analyzed. A detailed exposition of the related analysis and design techniques is provided.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Now Publishers Inc"
        },
        {
            "Title": "Replicated server placement with QoS constraints",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/5984692/10.1.1.79.9424.pdf",
            "Abstract": "The network planning problem of placing replicated servers with QoS constraints is considered. Each server site may consist of multiple server types with varying capacities and each site can be placed in any location among those belonging to a given set. Each client can be served by more than one location as long as the round-trip delay of data requests satisfies predetermined upper bounds. Our main focus is to minimize the cost of using the servers and utilizing the link bandwidth, while serving requests according to their delay constraint. This is an NP-hard problem. A pseudopolynomial and a polynomial algorithm that provide guaranteed approximation factors with respect to the optimal for the problem at hand are presented.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:OcBU2YAGkTUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "QoS provisioning and tracking fluid policies in input queueing switches",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958329/",
            "Abstract": "The concept of tracking fluid policies by packetized policies is extended to input queueing switches. It is considered that the speedup of the switch is one. One of the interesting applications of the tracking policy in TDMA satellite switches is elaborated. For the special case of 2/spl times/2 switches, it is shown that a tracking nonanticipative policy always exists. It is found that, in general, nonanticipative policies do not exist for switches with more than two input and output ports. For the general case of N/spl times/N switches, a heuristic tracking policy is provided. The heuristic algorithm is based on two notions: port tracking and critical links. These notions can be employed in the derivation of other heuristic tracking policies as well. Simulation results show the usefulness of the heuristic algorithm and the two basic concepts it relies on.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Grid Management: Data Model Definition for Trouble Ticket Normalization",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02080-3_11",
            "Abstract": "Handling multiple sets of trouble tickets (TTs) originating from different participants in today’s GRID interconnected network environments poses a series of challenges for the involved institutions. Each of the participants follows different procedures for handling trouble incidents in its domain, according to the local technical and linguistic profile. The TT systems of the participants collect, represent and disseminate TT information in different formats. As a result, management of the daily workload by a central Network Operations Centre (NOC) is a challenge on its own. Normalization of TTs to a common format for presentation and storing at the central NOC is mandatory.In the present work we provide a model for automating the collection and normalization of the TT received by multiple networks forming the Grid. Each of the participants is using its home TT system within its domain for handling trouble …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:dshw04ExmUIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Optimally allocated power regions of a dual-hop relay system for different CSI dependencies",
            "Publication year": 2006,
            "Publication url": "http://users.auth.gr/~geokarag/pdf/regions.pdf",
            "Abstract": "This document provides further details on the optimal power regions for the constrained optimization problem of the dual-hop relay system, examined in [1]. This document is to be used in conjunction with [1] since the notation is copied verbatim from there. Our objective is to characterize, in closed form, the optimal regions for the SNR and Shannon rate utilities.2 g2 depends on both a, b",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic wireless network coding with overhearing and variable channel rates",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6991509/",
            "Abstract": "We study a one-hop broadcast channel with two receivers. The receivers have side information obtained by overhearing wireless channels. The relay takes control decisions by coding transmissions based on its knowledge of side information in the receivers. We consider two control mechanisms. In the ACK system, the relay has definite knowledge of side information announced via overhearing reports. In the NACK system, the relay has statistical knowledge of side information and receives feedback after every decoding failure. Our contribution is as follows. We provide the minimal evacuation times for the two systems and obtain analytical expressions of the throughput region for the ACK and the code-constrained region for the NACK system. When the transmission rates are the same (r 1  = r 2 ) or when the receiver with the highest transmission rate has perfect side information (p f =1), we show that the two …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:BwyfMAYsbu0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Internet traffic engineering",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45190-7_4",
            "Abstract": "Traffic engineering encompasses a set of techniques that can be used to control the flow of traffic in data networks. We discuss several of those techniques that have been developed during the last few years. Some techniques are focused on pure IP networks while others have been designed with emerging technologies for scalable Quality of Service (QoS) such as Differentiated Services and MPLS in mind. We first discuss traffic engineering techniques inside a single domain. We show that by using a non-linear programming formulation of the traffic engineering problem it is possible to meet the requirements of demanding customer traffic, while optimising the use of network resources, through the means of an automated provisioning system. We also extend the functionality of the traffic engineering system through policies. In the following, we discuss the techniques that can be used to control the flow of …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "BrainRun: A behavioral biometrics dataset towards continuous implicit authentication",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/455030",
            "Abstract": "The widespread use of smartphones has dictated a new paradigm, where mobile applications are the primary channel for dealing with day-to-day tasks. This paradigm is full of sensitive information, making security of utmost importance. To that end, and given the traditional authentication techniques (passwords and/or unlock patterns) which have become ineffective, several research efforts are targeted towards biometrics security, while more advanced techniques are considering continuous implicit authentication on the basis of behavioral biometrics. However, most studies in this direction are performed “in vitro” resulting in small-scale experimentation. In this context, and in an effort to create a solid information basis upon which continuous authentication models can be built, we employ the real-world application “BrainRun”, a brain-training game aiming at boosting cognitive skills of individuals. BrainRun embeds a gestures capturing tool, so that the different types of gestures that describe the swiping behavior of users are recorded and thus can be modeled. Upon releasing the application at both the “Google Play Store” and “Apple App Store”, we construct a dataset containing gestures and sensors data for more than 2000 different users and devices. The dataset is distributed under the CC0 license and can be found at the EU Zenodo repository. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:2VqYfGB8ITEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Network coding techniques in cooperative cognitive networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8635675/",
            "Abstract": "In this paper, we investigate transmission techniques for a fundamental cooperative cognitive radio network, i.e., a radio system where a Secondary user may act as relay for messages sent by the Primary user, hence offering performance improvement of Primary user transmissions, while at the same time obtaining more transmission opportunities for its own transmissions. Specifically, we examine the possibility of improving the overall system performance by employing network coding techniques. The objective is to achieve this while affecting Primary user transmissions only positively, namely: 1) avoid network coding operations at the Primary transmitter in order avoid increase of its complexity and storage requirements, 2) keep the order of packets received by the Primary receiver the same as in the non cooperative case and 3) induce packet service times that are stochastically smaller than packet service times …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:YohjEiUPhakC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A modular framework for implementing joint wireless network coding and scheduling algorithms",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1186/1687-1499-2013-187",
            "Abstract": "Intersession network coding (NC) can provide significant performance benefits via mixing packets at wireless routers; these benefits are especially pronounced when NC is applied in conjunction with intelligent scheduling. NC, however, imposes certain processing operations, such as encoding, decoding, copying, and storage. When not utilized carefully, all these operations can induce tremendous processing overheads in practical settings. Our testbed measurements suggest that such processing operations can severely degrade the router throughput, especially at high bit rates. Motivated by this, we design network coding framework for rate adaptive wireless links (NCRAWL). The design of NCRAWL facilitates low overhead NC operations, thereby effectively approaching the theoretically expected throughput benefits of joint NC and scheduling. We implement and evaluate NCRAWL on a wireless testbed. Our …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:7T2F9Uy0os0C",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "A fair workload allocation policy for heterogeneous systems",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0743731504000474",
            "Abstract": "We consider a new workload allocation policy addressing fairness for user level performance measures. More specifically the criterion used for optimal workload allocation is the one which minimizes the maximum expected response time at computer systems to which jobs are routed. The policy to attain this criterion is therefore referred to as the min–max policy (MMP). It is shown that this optimization criterion is tantamount to routing to the fastest M processors, where M depends on system statistics, and equalizing the expected response times on these processors. The algorithm to compute job routing probabilities is applicable to increasing continuous functions of system response time versus the job arrival rate. We next investigate some properties of the MMP and show that it results in minimizing the coefficient of variation of response time when the job processing times are exponentially distributed. We compare …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Exchange of services in networks: competition, cooperation, and fairness",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2745844.2745860",
            "Abstract": "Exchange of services and resources in, or over, networks is attracting nowadays renewed interest. However, despite the broad applicability and the extensive study of such models, eg, in the context of P2P networks, many fundamental questions regarding their properties and efficiency remain unanswered. We consider such a service exchange model and analyze the users' interactions under three different approaches. First, we study a centrally designed service allocation policy that yields the fair total service each user should receive based on the service it offers to the others. Accordingly, we consider a competitive market where each user determines selfishly its allocation policy so as to maximize the service it receives in return, and a coalitional game model where users are allowed to coordinate their policies. We prove that there is a unique equilibrium exchange allocation for both game theoretic formulations …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:g3aElNc5_aQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Motivation for weight-loss diets: A clustering, longitudinal field study using self-esteem and self-determination theory perspectives",
            "Publication year": 2006,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0017896906066067",
            "Abstract": "Background Gradual elevation of body weight leads numerous individuals to                 dieting and weight loss behaviours. Nevertheless, the prevalence of obesity                 continues to rise in industrialised countries. The examination of the motivational                 determinants of dietary modification (‘dieting’) in order to                 identify clusters of individuals in the first 6 months of their effort to control                 body weight was the aim of the current study. The theories of self-determination and                 self-esteem formation guided our analysis.Methods A longitudinal study was conducted with three data collection                 points (N1=256; N2=135; N3=75). Data were responses                 on the Treatment Self Regulation Questionnaire, Social Physique Anxiety Scale,                 Physical Self-Description Questionnaire, Kaiser Physical Activity Survey                 Questionnaire, and items assessing expectations of …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:9c2xU6iGI7YC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "A Monitoring and Measurement Architecture for Traffic Engineered IP Networks",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.23.565&rep=rep1&type=pdf",
            "Abstract": "With the constantly growing usage of the Internet, the need for deployment of value-added IP services has recently yielded a dramatic investigation effort in the field of IP traffic engineering. Traffic engineering can be defined as a collection of techniques that will allow service providers to use the network resources as efficiently as possible, according to the different quality levels that are associated with the range of services they provide. The monitoring activity can play an important role for assisting the operation of traffic engineered networks. This paper explains how to obtain and manage the measurement information which is required by traffic engineering algorithms in dimensioning the network, dynamic resource allocation and route management, and in-service verification of traffic and performance characteristics of value-added IP services. The paper focuses on the description of a monitoring and measurement architecture that is currently investigated within the context of the TEQUILA project, partly funded by the European Commission within the context of IST development program.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A management and control architecture for providing IP differentiated services in MPLS-based networks",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/920861/",
            "Abstract": "As the Internet evolves toward the global multiservice network of the future, a key consideration is support for services with guaranteed quality of service. The proposed differentiated services framework is seen as the key technology to achieve this. DiffServ currently concentrates on control/data plane mechanisms to support QoS, but also recognizes the need for management plane aspects through the bandwidth broker. In this article we propose a model and architectural framework for supporting DiffServ-based end-to-end QoS in the Internet, assuming underlying MPLS-based explicit routed paths. The proposed integrated management and control architecture will allow providers to offer both quantitative and qualitative services while optimizing the use of underlying network resources.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "6 Networking with general costs and rewards",
            "Publication year": 2006,
            "Publication url": "https://go.gale.com/ps/i.do?id=GALE%7CA150091432&sid=googleScholar&v=2.1&it=r&linkaccess=abs&issn=1554057X&p=AONE&sw=w",
            "Abstract": "Here we use Lyapunov optimization theory to develop a framework for optimizing stochastic networks with general cost and reward metrics. The results in this section are well suited to solve problems of energy optimal networking, including problems of minimizing average power expenditure in mobile ad-hoc networks, and problems of maximizing network throughput utility subject to average power constraints. The general solution to these problems integrates the basic Lyapunov stability and optimization concepts developed in previous sections, including the use of auxiliary variables and virtual cost queues.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:MLfJN-KU85MC",
            "Publisher": "Now Publishers, Inc."
        },
        {
            "Title": "A distributed algorithm for maximum lifetime routing in sensor networks with mobile sink",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4472016/",
            "Abstract": "We consider a noise-limited wireless sensor network that consists of battery-operated nodes which can route information to a mobile sink in a multi-hop fashion. The problem of maximizing the network's lifetime, defined as the period of time during which the network can route a feasible flow to each sink location subject to power/energy constraints, is cast into a linear program, reduced into a simpler equivalent form and solved via dual decomposition. The unknowns are the sink sojourn times and the routing flow vector for each sink location. The presence of a mobile sink presents new challenges but the problem structure can still be exploited to find the optimal solution. A distributed algorithm based on the subgradient method and using the sink as leader is proposed and its performance is evaluated through simulation for random networks. The algorithm's requirements in memory are also provided.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity and stable throughput regions for the broadcast erasure channel with feedback: An unusual union",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6166934/",
            "Abstract": "We consider a source node broadcasting to two receivers over a general erasure channel with receiver feedback. We characterize the capacity region of the channel and construct algorithms based on linear network coding (either randomized or depending on channel dynamics) that achieve this capacity. We then consider stochastic arrivals at the source for the two destinations and characterize the stable throughput region achieved by adapting the same algorithms that achieve capacity. Next, we modify these algorithms to improve their delay performance and characterize their stable throughput regions. Although the capacity and stability regions obtained by the algorithms are not always identical (because of the extra overhead needed for the algorithms to handle stochastic traffic), they are within a few bits of each other and have similar forms. This example exhibits an unusual relationship between capacity and …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal scheduling of pairwise XORs under statistical overhearing and feedback",
            "Publication year": 2011,
            "Publication url": "https://paschos.net/docs/C19.pdf",
            "Abstract": "We study the problem of scheduling transmissions of packets belonging to several flows traversing a given node while making local encoding decisions. Practical wireless network coding solutions rely on knowledge of key knowledge which is obtained at the transmitter/scheduler either by acknowledgments or statistically. In the latter case, the knowledge of overhearing events for each packet improves progressively with feedback from the transmissions. We propose a virtual network mechanism in order to characterize the throughput region of such a system for the case where we allow only pairwise XORing. We also provide the policy which achieves the throughput region.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiuser broadcast erasure channel with feedback—capacity and algorithms",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6522177/",
            "Abstract": "We consider the N-user broadcast erasure channel with N unicast sessions (one for each user) where receiver feedback is regularly sent to the transmitter in the form of ACK/NACK messages. We first provide a generic outer bound to the capacity of this system; we then propose a virtual-queue-based inter-session mixing coding algorithm, determine its rate region, and show that it achieves capacity under certain conditions on channel statistics, assuming that instantaneous feedback is known to all users. Removing this assumption results in a rate region that asymptotically differs from the outer bound by 1 bit as L → ∞, where L is the number of bits per packet (packet length). For the case of arbitrary channel statistics, we present a modification of the previous algorithm whose rate region is identical to the outer bound for N = 3, when instant feedback is known to all users, and differs from the bound by 1 bit as L → ∞ …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient qos routing",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138912860300286X",
            "Abstract": "We consider the problem of routing in a network where quality of service constraints are placed on network traffic. We provide two optimal algorithms that are based on determining the discontinuities of functions related to the optimization at hand. The proposed algorithms have pseudopolynomial worst case running time and for a wide variety of tested networks they have fairly satisfactory running times. They perform significantly better than the algorithm based on the direct application of the dynamic programming equations and can also be used in conjunction with known polynomial-time approximation algorithms to provide good average case behavior, in addition to guaranteeing polymonial worst-case running time.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:Se3iqnhoufwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The mutual benefits of primary-secondary user cooperation in wireless cognitive networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6850310/",
            "Abstract": "In cognitive radio networks, secondary users (SUs) may cooperate with the primary user (PU) in order to obtain more transmission opportunities and thus maximize their throughput. The synergy consists in the following: the SU opts to cooperate by using its own transmit power to improve the probability of successful transmission of the PU. By increasing the probability of successful packet transmission for the PU, the SU essentially increases the service rate of the PU queue and thus, for given packet arrival rate, it increases the chances that it will be empty, and the channel will be free to use. Due to power limitations however, SUs have to take intelligent decisions on whether to cooperate or not and at which power level. Cooperation policies in this framework require the solution of a constrained Markov decision problem with infinite state space. In our work, we restrict attention to the class of stationary policies that …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:zLWjf1WUPmwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive routing algorithm for lambda switching networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/content/pdf/10.1023/A:1016503927131.pdf#page=25",
            "Abstract": "Current developments in optical components’ technologies enable wavelengths to be very narrowly spaced, transforming the optical fiber into a multi-terabit capacity medium. A new generation of “all-Optical” Cross-Connects started to appear in the market leading to a number of advantages such as increased switching capacity, decreased overall network costs, scalability and transparency resulting in the capability to support any protocol. An additional advantage is the ability to configure the switching fabric and the wavelength converters in real time. For the control of Optical Cross-Connects, the MPLambdaS approach was proposed by IETF, according to which the MPLS traffic engineering control plane is used in Optical Cross Connects. New corporate services appear such as storage area networks, optical virtual private networks, while end-user broadband services like video on demand and peer-to-peer …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gain adaptation policies for dual-hop nonregenerative relayed systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4291821/",
            "Abstract": "We examine the performance of a dual-hop nonregenerative system with adjustable relay gain, subject to power constraints. An optimization problem is formulated and solved algorithmically for the binary phase-shift keying bit-error rate utility. The model allows for arbitrary channel statistics. Emphasis is placed on the relation between the optimal solutions obtained when observing the channels of either the first or both hops, as well as the comparison with easily implementable heuristic policies. Numerical results indicate that simple heuristics perform well for a wide range of signal-to-noise ratio (SNR), except for certain high-SNR cases. Finally, the effect of independent channel assumption on system performance is evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal downlink scheduling policies for slotted wireless time-varying channels",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1512137/",
            "Abstract": "We consider the problem of scheduling transmissions from the base station to a number of mobile users sharing the same wireless slotted time-varying multirate channel. As a performance measure, we consider the throughput assigned to each user and with each user, we associate a general reward function that reflects the level of satisfaction for a given throughput allocation. By exploiting the variations in the channel conditions and under reasonable statistical assumptions, we propose a policy that maximizes the long-term reward of the system. Specific choices of the reward functions lead to several fairness criteria.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network Planning and Dimensioning-Replicated Server Placement with QoS Constraints",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=17658600108046100882&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:_5tno0g5mFcC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Dynamic algorithms for cooperation in user-provided network services",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7943433/",
            "Abstract": "The ever increasing demand for Internet access, and the proliferation of advanced user-owned network equipment have given rise to collaborative schemes, where users satisfy each other's communication needs whenever they have spare network resources. In this paper, we consider such an autonomous model where users have random resource availability and decide independently how to serve each other. For this dynamic setting, we find that a myopic proportional allocation strategy, applied by each node in an asynchronous fashion based only on local information, converges to a stable equilibrium point. Moreover, we show through numerical examples, that the equilibrium exhibits a rich structure and coincides with the lexicographically maximum allocation of the users' resources. Accordingly, we consider a more sophisticated model where each user can pay for the services she receives, with service credits …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:KUbvn5osdkgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Broadcast erasure channel with feedback and message side information, and related index coding result",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7852439/",
            "Abstract": "We consider the N -receiver broadcast erasure channel with feedback and message side information at the receivers prior to beginning of transmission. Specifically, the transmitter must deliver different, independent messages to each of the receivers, and each receiver knows a function of these messages before transmission begins. This situation can arise in multi-hop wireless networks, where a receiver may overhear transmissions consisting of possibly encoded combinations of messages (e.g., encoded using a network coding technique) prior to beginning of transmission over a given broadcast channel. We provide an outer bound to the capacity region of this system. For the case, where each message consists of a number of symbols taking values in a finite field and each receiver knows linear combinations of these symbols, the outer bound is given in terms of ranks of matrices expressing the linear …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:Dip1O2bNi0gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Service level specification semantics and parameters",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=11254658302128360692&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy-aware routing to maximize lifetime in wireless sensor networks with mobile sink",
            "Publication year": 2006,
            "Publication url": "https://hrcak.srce.hr/index.php?show=clanak&id_clanak_jezik=266587",
            "Abstract": "In this paper we address the problem of maximizing the lifetime in a wireless sensor network with energy and power constrained sensor nodes and mobile data collection point (sink). Information generated by the monitoring sensors needs to be routed efficiently to the location where the sink is currently located across multiple hops with different transmission energy requirements. We exploit the capability of the sink to be located in different places during network operation in order to maximize network lifetime. We provide a novel linear programming formulation of the problem. We show that maximum lifetime can be achieved by solving optimally two joint problems: a scheduling problem that determines the sojourn times of the sink at different locations, and a routing problem in order to deliver the sensed data to the sink in an energy-efficient way. Our model provides the optimal solution to both of these problems and gives the best achievable network lifetime. We evaluate numerically the performance of our model by comparing it with the case of static sink and with previously proposed models that focus mainly on the sink movement patterns and sojourn times, leaving the routing problem outside the linear programming formulation. Our approach always achieves higher network lifetime, as expected, leading to a lifetime up to more than twice that obtained with models previously proposed as the network size increases. It also results in a fair balancing of the energy depletion among the sensor nodes. The optimal lifetime provided by the theoretical analysis of our model can be used as a performance measure in order to test the efficiency of other …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:mB3voiENLucC",
            "Publisher": "Udruga za komunikacijske i informacijske tehnologije, Fakultet elektrotehnike, strojarstva i brodogradnje, Sveučilište u Splitu"
        },
        {
            "Title": "Engineering the multi-service Internet: MPLS and IP-based techniques",
            "Publication year": 2001,
            "Publication url": "http://users.auth.gr/leonid/public/Publications/ConferencePapers/c42.pdf",
            "Abstract": "IP Differentiated Services (DiffServ) is seen as the framework to support quality of service (QoS) in the Internet in a scalable fashion, turning it to a global multiservice network. In this context, integrated service/network management and traffic control mechanisms are of paramount importance for service provisioning and network operation, aiming to satisfy the QoS requirements of contacted services while optimising the use of underlying network resources. In this paper, after briefly introducing an architectural framework for integrated service/network management and control, we concentrate in its traffic engineering aspects comparing and contrasting two different approaches: MPLS-based explicit routed paths and IP-based hop-by-hop routing. We consider relatively longterm network dimensioning based on the requirements of contracted services and subsequent dynamic route and resource management that react in shorter time scales to statistical traffic fluctuations and varying network conditions.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the efficiency of sharing economy networks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8665937/",
            "Abstract": "Exchange of resources (or, services) over sharing economy networks is attracting increasing interest. Despite their broad applicability, many fundamental questions about their properties remain unanswered. We consider a general sharing economy model and analyze the dynamic interactions of nodes under three different approaches in a stochastic environment. First, we study a centrally designed allocation policy that yields the fair resource each node should receive based on the resources it offers to others. Next, we consider a competitive market where each node determines its allocation strategy so as to maximize the service it receives in return, and a coalitional game model where nodes may coordinate their policies. We prove there is a unique equilibrium exchange allocation for both settings, which also coincides with the central fair allocation. We also characterize the properties of the long-term equilibrium …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:q3CdL3IzO_QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal overload response in sensor networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1638552/",
            "Abstract": "A single commodity network that models the information flow in an arbitrary topology sensor field that collects and forwards information to a backbone through certain designated gateway nodes is considered. Resilient operation in overload stress situations caused by unpredictable traffic or topology variations is investigated. That amounts to studying the network in instability mode, where the traffic load distribution is outside the throughput region. A fluid model is adopted where superflows model traffic forwarding and backlog formations at the network level. Quantitative performance metrics of the overload including throughput, lexicographic minimization, most balanced allocation, and amount of lost traffic due to buffer overflow are considered to capture the information loss process due to overflow in the network. Optimal superflows with respect to these metrics are characterized and a distributed asynchronous …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Throughput regions and optimal policies in wireless networks with opportunistic routing",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6576475/",
            "Abstract": "Opportunistic routing in wireless networks has been proposed as a method to combat the volatility of wireless links, by leveraging their broadcast nature and choosing the next hop for each transmitted packet post-facto, using the actual reception outcomes at the respective neighbors, rather than based on a priori information. Much of the research on the topic has focused on protocol design issues, e.g. coordination mechanisms among the next-hop candidates; however, the fundamental performance bounds of the scheme are not yet known. In this paper we study the theoretical throughput region of opportunistic routing, for a generic network model with an arbitrary matrix of packet erasure probabilities between any two nodes, which cannot be mapped onto any classical model due to the existence of undirected broadcast from each node. We introduce a generic technique involving a transformation into a virtual …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:2KloaMYe4IUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bandwidth Reservation in Multihop Wireless Networks: Complexity and Mechanisms",
            "Publication year": 2003,
            "Publication url": "https://hal.inria.fr/inria-00071707/",
            "Abstract": "We show that link interferences in wireless networks make multihop bandwidth reservation in such an environment an NP-complete problem. This is in sharp contrast to bandwidth reservation in wireline networks where efficient polynomial algorithms exist. We also consider the problem of slot allocation according to bandwidth requirements in a wireless slotted environment. In the context of Mobile Ad Hoc Networks, we propose simple heuristics applicable to the OLSR routing protocol in order to find routes that satisfies requirements without impairing the performance of other connections.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bandwidth Reservation in Multihop Wireless Networks: complexity, heuristics and mechanisms",
            "Publication year": 2004,
            "Publication url": "http://web.science.mq.edu.au/~bmans/BMans/Papers/AGJM_IJWMC.pdf",
            "Abstract": "We prove that link interferences in multihop wire-less networks make the problem of selecting a path satisfying bandwidth requirements an NP-complete problem, even under simplified rules for bandwidth reservation. This is in sharp contrast to path selection in wireline networks where efficient polynomial algorithms exist.We propose three heuristics to compute Quality of Service (QoS) routes in a multihop wireless networks considering interferences constraints. Our heuristics are based on Dijkstra’s shortest path algorithm in which we integrate the notion of node capacity in order to satisfy flow requirements. We show with several simulations that these heuristics allow computation of routes that save bandwidth of nodes with low capacity and thus result in increased number of QoS-flows accepted by the network. Finally, we also describe a distributed mechanism for the problem of slot allocation according to bandwidth reservation in a wireless slotted environment.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Capacity-achieving encoding for the broadcast erasure channel with multiple users",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6033803/",
            "Abstract": "We consider the N-user memoryless broadcast erasure channel with N unicast sessions (one for each user) where receiver feedback is sent to the transmitter in the form of ACK/NACK messages. We first provide a generic outer bound to the capacity of this system; using concepts from network coding, we then propose a session-mixing coding algorithm applied on specially constructed and maintained virtual queues (at the transmitter side), determine its throughput region and show that it achieves capacity under certain conditions on channel statistics (assuming that instantaneous feedback is known to all users). The algorithm requires no knowledge of channel statistics or future events.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "2 The network model and operational assumptions",
            "Publication year": 2006,
            "Publication url": "https://go.gale.com/ps/i.do?id=GALE%7CA150091428&sid=googleScholar&v=2.1&it=r&linkaccess=abs&issn=1554057X&p=AONE&sw=w",
            "Abstract": "Consider a general network with a set [??] of nodes and a set [??] of transmission links. We denote by N and L respectively the number of nodes and links in the network. Each link represents a communication channel for direct transmission from a given node a to another node b, and is labeled by its corresponding ordered node pair (a, b)(where a, b [member of] N). Note that link (a, b) is distinct from link (b, a). In a wireless network, direct transmission between two nodes may or may not be possible and this capability, as well as the transmission rate, may change over time due to weather conditions, mobility or node interference. Hence in the most general case one can consider that [??] consists of all ordered pairs of nodes, where the transmission rate of link (a, b) is zero if direct communication is impossible. However, in cases where direct communication between some nodes is never possible, it is helpful to …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Now Publishers, Inc."
        },
        {
            "Title": "Throughput-optimal link-layer design in power constrained hybrid OW/RF systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7105829/",
            "Abstract": "The aim of this paper is to develop link layer transmission schemes for hybrid optical wireless (OW)/radio frequency (RF) systems, with constraints on both per-link and total average power consumption at the transmitter. In this context, we adopt a timeslot structure with a queue for storing the data packets for transmission and model the hybrid channel as an erasure channel with parameters varying along the time-slots according to a Markov chain. Then, a stochastic optimization problem is formulated, where intelligent decisions regarding the number of the packets admitted in the queue and the power levels used in every link, are taken by the hybrid transmitter in each slot. The objective of this formulation is to design a control policy that maximizes the transmitter throughput, while satisfying the power constraints as well. A solution is offered by using the Lyapunov optimization framework and an on-line transmission …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:tYavs44e6CUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Arborescence optimization problems solvable by Edmonds’ algorithm",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397502008885",
            "Abstract": "We consider a general class of optimization problems regarding spanning trees in directed graphs (arborescences). We present an algorithm for solving such problems, which can be considered as a generalization of Edmonds’ algorithm for the solution of the minimum sum arborescence problem. The considered class of optimization problems includes as special cases the standard minimum sum arborescence problem, the bottleneck and lexicographically optimal arborescence problem, as well as the widest-minimum sum arborescence problem.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:4TOpqqG69KYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "3 Stability and network capacity",
            "Publication year": 2006,
            "Publication url": "https://go.gale.com/ps/i.do?id=GALE%7CA150091429&sid=googleScholar&v=2.1&it=r&linkaccess=abs&issn=1554057X&p=AONE&sw=w",
            "Abstract": "Here we establish the fundamental throughput limitations of a general multi-commodity network as defined in the previous section. Specifically, we characterize the network layer capacity region. This region describes the set of traffic rates that the network can stably support, considering all possible strategies for choosing the control decision variables that affect routing, scheduling, and resource allocation. We begin with a precise definition of stability for single queues and for queueing networks.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:tuHXwOkdijsC",
            "Publisher": "Now Publishers, Inc."
        },
        {
            "Title": "Scheduling with pairwise XORing of packets under statistical overhearing information and feedback",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s11134-012-9301-2",
            "Abstract": "We study the problem of scheduling packets from several flows traversing a given node which can mix packets belonging to different flows. Practical wireless network coding solutions depend on knowledge of overhearing events which is obtained either by acknowledgments or statistically. In the latter case, the knowledge about each packet improves progressively with feedback from the transmissions. We propose a virtual network mechanism in order to characterize the throughput region of such a system for the case where we allow only pairwise XORing. We also provide the policy which achieves the stability region and compare it to simple heuristics. The derived policy is a modification of the standard backpressure policy, designed to take into account the fact that in the proposed virtual network the destination of a transmitted packet is known only probabilistically. We demonstrate simulation results …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Asymptotically optimal policies for wireless networks with rechargeable batteries",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4599906/",
            "Abstract": "We consider the problem of cross-layer resource allocation for single-hop, time-varying, wireless networks operating with rechargeable batteries under general arrival, channel and recharge processes. The objective is to maximize total system utility, as a function of the long-term rate achieved per link, while satisfying energy and power constraints. A policy with decoupled admission control and power allocation decisions is proposed that achieves asymptotic optimality for sufficiently large battery capacity to maximum power ratio (explicit bounds are provided). This policy is particularly suitable for satellite downlinks or sensor networks, which are most likely to satisfy the above condition. An extension to multihop networks is briefly described as well.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The mediating role of self-determination in the relationship between goal orientations and physical self-worth in Greek exercisers",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17461390100071502",
            "Abstract": "This paper examines correlates of physical self-worth (PSW) in exercisers through employing two theoretical constructs popular in motivational psychology. Selfdetermination theory (SDT) and achievement goal orientation theory were adopted, and a cross-sectional survey was employed. Greek exercisers (N = 350, mean age = 30.8 years), participating in 1 of 4 different exercise activities were studied. Theoretical predictions established a model that was tested through path analysis. The selfdetermination continuum was hypothesized to mediate the relation between goal orientations and PSW. Task orientation predicted PSW through intrinsic motivation and identified regulation and, to a lesser extent, through introjected regulation. Ego orientation was related mainly to extrinsic regulation, and it predicted PSW only through the internally regulated variables of intrinsic and identified regulation. The model was found …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:yB1At4FlUx8C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Beyond uncertainty, quantum change is ahead SUPERCOMM 2001 points the way to challenges that could define your future",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/920857/",
            "Abstract": "As for the consequent applications and enabling technologies, Huber is reluctant to limit the possibilities. The ability to move any picture anywhere at full-motion speed is more profound than moving cable TV to digital packet networks. The most provocative applications are those yet to be described. As for wireless, optical, cable, and copper, Huber finds them “highly complementary technologies.” He puts little worth in forecasts that show a single technology triumphing according to a preset timetable.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cognitive, emotional, and behavioural connotations of task and ego goal orientation profiles: An ideographic approach using hierarchical class analysis",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Stuart-Biddle/publication/285746392_Cognitive_emotional_and_behavioural_connotations_of_task_and_ego_goal_orientation_profiles_An_ideographic_approach_using_hierarchical_class_Analysis/links/568b5ddd08aebccc4e1a4482/Cognitive-emotional-and-behavioural-connotations-of-task-and-ego-goal-orientation-profiles-An-ideographic-approach-using-hierarchical-class-Analysis.pdf",
            "Abstract": "The study of goal perspectives theory, mainly through the investigation of achievement goal orientations, is popular in contemporary sport and exercise psy-chology. Although results have been consistent and conceptually coherent, only nomothetic approaches have been used. This study used hierarchical class (hiclass) analysis to provide in-depth ideographic profiles o/four cricketers, chosen from a group of 72 players, who differed in their goal orientations profile. The four hiclass profiles showed similar psychological characteristics to the ones proposed by goal orientations theory. The high task oriented players (high task-high ego and high task-lou ego), and the high ego-low task player showed more adaptive profiles than the low task-low ego oriented player The players emphasised situations congruent with their goal orientations such that the high task-low ego oriented player emphasised personal situations …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:QYdC8u9Cj1oC",
            "Publisher": "EDIZIONE L POZZI"
        },
        {
            "Title": "Wireless network coding with partial overhearing information",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6567038/",
            "Abstract": "We study an 1-hop broadcast channel with two receivers. Due to overhearing channels, the receivers have side information which can be leveraged by interflow network coding techniques to provide throughput increase. In this setup, we consider two different control mechanisms, the deterministic system, where the contents of the receivers' buffers are announced to the coding node via overhearing reports and the stochastic system, where the coding node makes stochastic control decisions based on statistics and the performance is improved via NACK messages. We study the minimal evacuation times for the two systems and obtain analytical expressions of the throughput region for the deterministic and the code-constrained region for the stochastic. We show that maximum performance is achieved by simple XOR policies. For equal transmission rates r 1  = r 2 , the two regions are equal. If r 1  ≠ r 2 , we …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Most balanced overload response in sensor networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1523396/",
            "Abstract": "We consider the operation of a network in overload situations, that is, when the incoming traffic is outside the feasibility region determined by the network topology. In such a situation nodes will be overloaded and it is important to maintain a balanced network overload while ensuring that maximum amount of traffic reaches the sink nodes. We formulate the problem as lexicographic optimization of node overloads, study the properties of the solution and provide a distributed flow reallocation mechanism whose node overloads converge to the optimal solution",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Of daemons and men: A file system approach towards intrusion detection",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1568494614004311",
            "Abstract": "We present FI2DS a file system, host based anomaly detection system that monitors Basic Security Module (BSM) audit records and determines whether a web server has been compromised by comparing monitored activity generated from the web server to a normal usage profile. Additionally, we propose a set of features extracted from file system specific BSM audit records, as well as an IDS that identifies attacks based on a decision engine that employs one-class classification using a moving window on incoming data. We have used two different machine learning algorithms, Support Vector Machines (SVMs) and Gaussian Mixture Models (GMMs) and our evaluation is performed on real-world datasets collected from three web servers and a honeynet. Results are very promising, since FI2DS detection rates range between 91% and 95.9% with corresponding false positive rates ranging between 8.1× 10−2 % and …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:4MWp96NkSFoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multicast tree structure and the power law",
            "Publication year": 2002,
            "Publication url": "http://www.cs.purdue.edu/homes/spa/papers/multicast-new.pdf",
            "Abstract": "In this paper we investigate structural properties of multicast trees that give rise to the so called multicast power law. The law asserts that the ratio R (n) of the average number of links in a multicast tree connecting the source to n destinations to the average number of links in a unicast path, satisfies asymptotically R (n)≈ cnφ, 0< φ< 1. In order to obtain a better insight we first analyze some simple multicast tree topologies, which under appropriately chosen parameters give rise to the multicast power law. The asymptotic analysis of R (n) in this case, indicates that it is very difficult to infer the validity of power law by observing experimental graphs of R (n) alone. Next we introduce a new easy to measure metric of multicast tree topology which is applicable to general networks where the multicast trees are constructed as subtrees of a given spanning tree (global multicast tree). We show that this metric provides a more reliable means for inferring the validitity of the power law. Finally, we perform experiments on real and simulated networks to demonstrate the use of the new metric.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:3htObqc8RwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Is the internet fractal?",
            "Publication year": 2002,
            "Publication url": "http://www.cs.purdue.edu/homes/spa/papers/sigcomm01.pdf",
            "Abstract": "One of the main benefits of multicast communication is the overall reduction of network load. To quantify this reduction, when compared to traditional unicast, experimental studies by Chuang and Sirbu indicated the so called power law which asserts that the number of links L (m) in a multicast delivery tree connecting a source to m (distinct) sites satisfies L (m) ¼ cm0: 8 where c is a constant. In order to explain theoretically this behavior, Phillips, Shenker, and Tangmunarunkit examined approximately L (m) for a V-ary complete tree topology, and concluded that L (m) grows nearly linearly with m, thus not obeying the power law. We first re-examine the analysis by Phillips et. al. and provide precise asymptotic expansion for L (m) that confirms the nearly linear (with some wobbling) growth. Claiming that the essence of the problem lies in the modeling assumptions, we replace the V-ary complete tree topology by a V-ary self-similar tree with similarity factor 0· µ< 1. In such a tree a node at level k is replicated CV (DLk) µ times, where D is the depth of the tree and C is a constant. Under this assumption, we analyze again L (m) and prove that L (m)» cm1Lµ where c is an explicitly computable constant. Hence self-similar trees provide a plausible explanation of the multicast power law. Next, we examine more general conditions for general trees, under which the power law still holds. We also discuss some experimental results in real networks that reaffirm the power law and show that in these networks the general conditions hold. In particular, we experimentally establish that for the studied network µexp ¼ 0: 12, leading to the power law L (n)=£(n0: 88). Our …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Of daemons and men: reducing false positive rate in intrusion detection systems with file system footprint analysis",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-018-3550-x",
            "Abstract": "In this work, we propose a methodology for reducing false alarms in file system intrusion detection systems, by taking into account the daemon’s file system footprint. More specifically, we experimentally show that sequences of outliers can serve as a distinguishing characteristic between true and false positives, and we show how analysing sequences of outliers can lead to lower false positive rates, while maintaining high detection rates. Based on this analysis, we developed an anomaly detection filter that learns outlier sequences using k-nearest neighbours with normalised longest common subsequence. Outlier sequences are then used as a filter to reduce false positives on the  file system intrusion detection system. This filter is evaluated on both overlapping and non-overlapping sequences of outliers. In both cases, experiments performed on three real-world web servers and a honeynet show that …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:rmuvC79q63oC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Optimal primary-secondary user cooperation policies in cognitive radio networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7047230/",
            "Abstract": "In cognitive radio networks, secondary users (SUs) may cooperate with the primary user (PU) so that the success probability of PU transmissions are improved, while SUs obtain more transmission opportunities. However, SUs have limited power resources and, therefore, they have to take intelligent decisions on whether to cooperate or not and at which power level, to maximize their throughput. Cooperation policies in this framework require the solution of a constrained Markov decision problem with infinite state space. In our work, we restrict attention to the class of stationary policies that take randomized decisions of an SU activation and its transmit power in every time slot based only on spectrum sensing. Assuming infinitely backlogged SUs queues, the proposed class of policies is shown to achieve the maximum throughput for the SUs, while significantly enlarging the stability region of PU queue. The structure of …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bandwidth reservation in multihop wireless networks: Complexity and mechanisms",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1284119/",
            "Abstract": "We show that link interferences in multihop wireless networks make the problem of selecting a path satisfying bandwidth requirements an NP-complete problem, even under simplified rules for bandwidth reservation. This is in sharp contrast to path selection in wireline networks where efficient polynomial algorithms exist. We also describe a distributed mechanism for the problem of slot allocation according to bandwidth reservation in a wireless slotted environment.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:M7yex6snE4oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Channel sharing by multi-class rate adaptive streams: Performance region and optimization",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128606002490",
            "Abstract": "We consider the problem of channel sharing by rate adaptive streams belonging to various classes. The performance metric per class is the mean bandwidth allocated to connections in the class possibly scaled by appropriate factors. We first provide a bandwidth adaptation policy that maximizes a linear combination of class performance metrics; then, we use this result to characterize the region where the class performance metrics lie under any bandwidth adaptation policy. Based on the results above we use stochastic approximation techniques to provide a policy that optimizes a combination of concave rewards associated with class performance metrics. Finally, we propose a modification of the optimal policy to account for the case where connection holding times are unknown, and study its performance through simulations.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Replicated server placement with QoS constraints",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1687884/",
            "Abstract": "The network planning problem of placing replicated servers with QoS constraints is considered. Each server site may consist of multiple server types with varying capacities and each site can be placed in any location among those belonging to a given set. Each client can be served by more than one location as long as the round-trip delay of data requests satisfies predetermined upper bounds. Our main focus is to minimize the cost of using the servers and utilizing the link bandwidth, while serving requests according to their delay constraint. This is an NP-hard problem. A pseudopolynomial and a polynomial algorithm that provide guaranteed approximation factors with respect to the optimal for the problem at hand are presented",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Carrier-sense multiple access (csma) protocols",
            "Publication year": 2003,
            "Publication url": "http://users.auth.gr/users/9/8/004089/public_html/public/Publications/books-chapters/csma.pdf",
            "Abstract": "Communication of information between two or more parties takes place over a variety of physical media called channels. Such channels can be simple twisted pair cables, coaxial and optical cables, or the free space. Sometimes the channel is dedicated to a specific transmitter-receiver pair. This may be the case when two parties establish a telephone conversation over a dedicated cable. Channels of this type are called point-to-point. There are situations, however, where multiple users need to have access to the same channel. The most familiar one is human speech communication. When a number of humans are located in the same room they all use the same channel, the atmosphere, for their conversation exchange. Computer Local Area Networks (LANs) is another example: a common approach in this case is to attach a number of computers to the same cable as in Figure 1. Hence, each computer can listen to the transmission of every other computer attached to the same cable. For a third example, consider Satellite communication. As shown in Figure 2 a number of terminals need to communicate between each other but due to physical obstacles they cannot all listen to each other directly. Instead, each terminal first sends the information to the satellite through the upstream channel. The satellite listens to the upstream channel, receives the information and then retransmits to the downstream channel, to which all terminal can listen. Hence the upstream channel needs to be accessed by all terminals. Channels of this type are called multiple-access.If the terminals in a multiple-access channel are left unchecked so that they can transmit …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multicast tree structure and the power law",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1614080/",
            "Abstract": "In this paper, we investigate structural properties of multicast trees that give rise to the so-called multicast power law. The law asserts that the ratio R(n) of the average number of links in a multicast tree connecting the source to n destinations to the average number of links in a unicast path, satisfies asymptotically R(n)/spl ap/cn/sup /spl phi//, 0",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Signal Processing Letters, IEEE",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=16268644329042182984&hl=en&oi=scholarr",
            "Abstract": "subject: CMOS image sensors; integrated circuit noise; photon counting; CMOS image sensor process; conversion gain; dark current; deep subelectron read noise; electron level; photon-counting image sensor; quanta image sensor pixel; quanta image sensor pump-gate jot; Bit error rate; CMOS image sensors; Dark current; Histograms; Noise; CMOS Image Sensor; CMOS image sensor; High Conversion Gain; Jot Device; Low Dark Current; Low Read Noise; Photon Counting; Quanta Image Sensor; high conversion gain; jot device; low dark current; low read noise; photon counting; quanta image sensor;",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:yFnVuubrUp4C",
            "Publisher": "ieee"
        },
        {
            "Title": "Bandwidth reservation in multihop wireless networks: Complexity, mechanisms and heuristics",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Leonidas-Georgiadis/publication/248591983_Bandwidth_Reservation_in_Multihop_Wireless_Networks_Complexity_Heuristics_and_Mechanisms/links/02e7e53ce1a2d04cd9000000/Bandwidth-Reservation-in-Multihop-Wireless-Networks-Complexity-Heuristics-and-Mechanisms.pdf",
            "Abstract": "We prove that link interferences in multihop wire-less networks make the problem of selecting a path satisfying bandwidth requirements an NP-complete problem, even under simplified rules for bandwidth reservation. This is in sharp contrast to path selection in wireline networks where efficient polynomial algorithms exist.We propose three heuristics to compute Quality of Service (QoS) routes in a multihop wireless networks considering interferences constraints. Our heuristics are based on Dijkstra’s shortest path algorithm in which we integrate the notion of node capacity in order to satisfy flows requirements. We show with several simulations that these heuristics not only allows computation of routes that save bandwidth of nodes with low capacity but also that network can handle more QoS-flows. Finally, we also describe a distributed mechanism for the problem of slot allocation according to bandwidth reservation in a wireless slotted environment.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "5 Networking outside of the capacity region: utility optimization and fairness",
            "Publication year": 2006,
            "Publication url": "https://go.gale.com/ps/i.do?id=GALE%7CA150091431&sid=googleScholar&v=2.1&it=r&linkaccess=abs&issn=1554057X&p=AONE&sw=w",
            "Abstract": "Up to this point we have focused attention only on the problem of controlling a network to achieve stability. In this section we begin our treatment of stochastic network optimization, where the goal is to stabilize the network while additionally optimizing some performance metric and/or satisfying some additional constraints. Specifically, this section investigates the situation when the exogenous arrival rates are outside of the network capacity region [LAMBDA]. In this case, the network cannot be stabilized without a transport layer flow control mechanism to limit the amount of data that is admitted. The goal is to design a cross-layer strategy for flow control, routing, and resource allocation that provides stability while achieving optimal network fairness. Here, we measure fairness in terms of a general utility function of the long term admission rates of each session.The solution to this flow control problem involves three new …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:LI9QrySNdTsC",
            "Publisher": "Now Publishers, Inc."
        },
        {
            "Title": "Maximum lifetime routing to mobile sink in wireless sensor networks",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/5984680/_5bsoftcom2005_5d-mobilesensorsink-papadimitriou.pdf",
            "Abstract": "We address the problem of maximizing the lifetime in a wireless sensor network with energy-constrained sensor nodes and mobile data collection points (sinks). Information generated by the monitoring sensors needs to be routed efficiently to the location where the sink is currently located across multiple hops with different transmission energy requirements. We exploit the capability of the sink to be located in different places during network operation and give a novel linear programming formulation that maximizes network lifetime. We show that the maximum lifetime can only be achieved by solving optimally two joint problems: a scheduling problem that determines the sojourn times of the sink at different locations, and a routing problem in order to deliver the sensed data to the sink in an energy-efficient way. Our model provides the optimal solution to both of these problems and gives the best achievable network lifetime. We evaluate numerically the performance of our model by comparing it with the case of static sink and with previously proposed models that focus mainly on the sink movement patterns and sojourn times, leaving the routing problem outside the linear programming formulation. Our approach always achieves higher network lifetime, as expected, leading to a lifetime up to more than twice that obtained with models previously proposed as the network size increases. It also results in a fair balancing of the energy depletion among the sensor nodes.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Control of wireless networks with rechargeable batteries [transactions papers]",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5403539/",
            "Abstract": "We consider the problem of cross-layer resource allocation for wireless networks operating with rechargeable batteries under general arrival, channel state and recharge processes. The objective is to maximize total system utility, defined as a function of the long-term rate achieved per link, while satisfying energy and power constraints. A policy with decoupled admission control and power allocation decisions is proposed that achieves asymptotic optimality for sufficiently large battery capacity to maximum transmission power ratio (explicit bounds are provided). We present first a downlink resource allocation scenario; the analysis is then extended to multihop networks. The policy is evaluated via simulations and is seen to perform very well even in the non-asymptotic regime. This policy is particularly suitable for sensor networks, which typically satisfy the asymptotic conditions required by our methodology.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An architectural framework for providing QoS in IP differentiated services networks",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/918008/",
            "Abstract": "As the Internet evolves, a key consideration is support for services with guaranteed quality of service (QoS). The proposed differentiated services (DiffServ) framework, which supports aggregate traffic classes, is seen as the key technology to achieve this. DiffServ currently concentrates on control/data plane mechanisms to support QoS but also recognises the need for management plane aspects through the bandwidth broker (BB). In this paper we propose a model and architectural framework for supporting end-to-end QoS in the Internet through a combination of both management and control/data plane aspects. Within the network we consider control mechanisms for traffic engineering (TE) based both on explicitly routed paths and on pure node-by-node layer 3 routing. Management aspects include customer interfacing for service level specification (SLS) negotiation, network dimensioning, traffic forecasting and …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An adaptive framework for addressing fairness issues in wireless networks",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366404002749",
            "Abstract": "We present a framework for designing optimal policies addressing resource allocation problems in wireless networks. We consider a general utility function optimization objective. Specific choices of the utility functions lead to policies that satisfy several well-known fairness criteria, e.g. max–min and proportional-fair. Traditional approaches for solving these nonlinear optimization problems in an off-line manner, lead to nonadaptive policies that usually rely on system parameters, which may not be known a priory. Within our framework the development of such policies is based on the adaptive employment of policies that solve linear optimization problems. In several situations the development of policies for these linear problems is fairly simple and depends minimally on system parameters. Subsequently, we apply this method to three specific wireless resource allocation problems. In particular we consider wireless …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:RGFaLdJalmkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Service level specification semantics, parameters and negotiation requirements",
            "Publication year": 2000,
            "Publication url": "https://ci.nii.ac.jp/naid/10017229219/",
            "Abstract": "CiNii 論文 - Service Level Specification Semantics, Parameters and Negotiation Requirements \nCiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす \n日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる \nタイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで \n検索 検索 検索 Service Level Specification Semantics, Parameters and Negotiation \nRequirements GODERIS Danny 被引用文献: 1件 著者 GODERIS Danny 収録刊行物 Internet \nDraft, Work in progress Internet Draft, Work in progress, 2000 被引用文献: 1件中 1-1件を 表示 1 \nネットワークQoS保証実現に必要な SLA (Service Level Agreement) の管理と実現 Hashmani \nManzoor , 吉田 幹 , 池永 全志 , 尾家 祐二 電子情報通信学会技術研究報告. IN, 情報ネットワーク \n100(378), 55-62, 2000-10-20 参考文献22件 Tweet 各種コード NII論文ID(NAID) 10017229219 に/…",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "XOR-based coding for the 3-user broadcast erasure channel with feedback",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6260493/",
            "Abstract": "We study the case of the three-user broadcast erasure channel, with multiple unicast traffic, where feedback from the users is fed back to the transmitter in the form of ACK/NACK messages. The capacity region of this system has been recently derived and two capacity achieving algorithms, employing intersession linear network coding, have been proposed in [1], [2]. Since these algorithms suffer from large computational complexity and decoding delay, our aim in this paper is to design coding algorithms with reduced computational complexity and low decoding delay that achieve comparable throughput to the former algorithms. We exclusively consider algorithms that require no knowledge of channel statistics, perform only XOR operations between the packets and allow for instantaneous decoding by any receiver that successfully receives a packet. We present two algorithms with the above properties: the first one …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:9vf0nzSNQJEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiuser Broadcast Erasure Channel with Feedback and Side Information, and its Relation Index Coding",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Leonidas-Georgiadis/publication/259010318_Multiuser_Broadcast_Erasure_Channel_with_Feedback_and_Side_Information_and_its_Relation_Index_Coding/links/54730e290cf24bc8ea19af26/Multiuser-Broadcast-Erasure-Channel-with-Feedback-and-Side-Information-and-its-Relation-Index-Coding.pdf",
            "Abstract": "In this paper we consider the N-user broadcast erasure channel with public feedback and side information. Before the beginning of transmission, each receiver knows a function of the messages of some of the receivers. This situation arises naturally in wireless and in particular cognitive networks where a node may overhear transmitted messages destined to other nodes before transmission over a given broadcast channel begins. We provide an upper bound to the capacity region of this system. Furthermore, when the side information is linear, we show that the bound is tight for the case of two-user broadcast channels. The special case where each user may know the whole or nothing of the message of each other node, constitutes a generalization of the index coding problem. For this instance, and when there are no channel errors, we show that the bound reduces to the known Maximum Weighted Acyclic Induced Subgraph bound. We also show how to convert the capacity upper bound to transmission completion lower bound and provide examples of codes for certqain information graphs for which the bound is either achieved of closely approximated.",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:mlAyqtXpCwEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy-aware broadcast trees in wireless networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:MONE.0000042496.99241.53",
            "Abstract": "In this paper we address the problem of broadcasting in wireless networks, so that the power consumed by any node is as small as possible. This approach is motivated by the fact that nodes in such networks often use batteries and, hence, it is important to conserve energy individually, so that they remain operational for a long time. We formulate the problem as a lexicographic node power optimization one. The problem is in general NP-complete. We provide an optimal algorithm which runs in polynomial time in certain cases. We also provide a heuristic algorithm whose performance relative to the optimal one is fairly satisfactory. We next show that these algorithms can also be used to solve the problem of broadcasting so that the residual energy of any node after the broadcast process is as large as possible. Finally, we discuss the issues of implementing the above algorithms distributively, as well as their …",
            "Abstract entirety": 0,
            "Author pub id": "GjFfiVwAAAAJ:_kc_bZDykSQC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Service Level Specification and Usage Framework",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=12615306965760653587&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "GjFfiVwAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        }
    ]
}]