[{
    "name": "Λυσίμαχος-Παύλος Κόντης",
    "romanize name": "Lysimachos-Pavlos Kontis",
    "School-Department": "Μηχανικών Η.Υ. & Πληροφορικής",
    "University": "uoi",
    "Rank": "Καθηγητής",
    "Apella_id": 171,
    "Scholar name": "Lisimachos Kondi",
    "Scholar id": "VVz5ATwAAAAJ",
    "Affiliation": "Professor, University of Ioannina",
    "Citedby": 2080,
    "Interests": [
        "Multimedia communications",
        "Signal and Image Processing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=VVz5ATwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Weak Signal Watermark Detection Through Rao-T Hypothesis and Lightweight Detection",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8451705/",
            "Abstract": "In this work, we investigate an asymptotically optimal blind zero-bit watermark detector in the wavelet domain. More specifically, assuming that the marginal distribution of detail coefficients is non-Gaussian, we model it with the Student's t probability density function. Furthermore, we assume that the embedding power of the hidden information is unknown, suggesting in this way a new test statistic based on the Rao hypothesis test. The proposed detector exhibits better performance in terms of detection sensitivity and robust properties compared with other known methods in the framework of non-Gaussian environment. Additionally, we investigate a fixed-parameterization approach towards a lightweight detection with regard of time complexity.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:epqYDVWIO7EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Content‐Based Video Communications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8044684/",
            "Abstract": "This chapter contains sections titled:    Network‐Adaptive Video Object Encoding   Joint Source Coding and Unequal Error Protection   Joint Source‐Channel Coding with Utilization of Data Hiding   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Interpretable Deep Learning for Multimodal Super-Resolution of Medical Images",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-87231-1_41",
            "Abstract": "In medical image acquisition, hardware limitations and scanning time constraints result in degraded images. Super-resolution (SR) is a post-processing approach aiming to reconstruct a high-resolution image from its low-resolution counterpart. Recent advances in medical image SR include the application of deep neural networks, which can improve image quality at a low computational cost. When dealing with medical data, accuracy is important for discovery and diagnosis, therefore, interpretable neural network models are of significant interest as they enable a theoretical study and increase trustworthiness needed in clinical practice. While several interpretable deep learning designs have been proposed to treat unimodal images, to the best of our knowledge, there is no multimodal SR approach applied for medical images. In this paper, we present an interpretable neural network model that exploits …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Performance of practical Wyner-Ziv video codec under Flat-fading Rayleigh Channel",
            "Publication year": 2005,
            "Publication url": "http://www.cs.uoi.gr/~lkon/papers/WNY_05c.pdf",
            "Abstract": "In this paper; we analyze the performance of a prac-tical Wyner-Ziv video codec over a Flat-fading Rayleigh Channel. The performance of the same codec is also analyzed for different source coding rates. The performance Wyner-Ziv video coding is compared with pure H. 263 Intraframe coding which has similar complexity at the encoder and the superiority of the Wyner-Ziv codec over pure H. 263 intra coding is shown. Current video compression standards perform interframe predictive coding to exploit the similarities among successive frames. Since predictive coding makes use of motion estimation, the video encoder is typically five to ten times more complex than the decoder. This asymmetry in complexity is desirable for broadcasting or for streaming video-on-demand systems where video is compressed once and decoded many times. However, some future systems may require the dual scenario. Wyner-Ziv video coding is a step towards achieving this. We present our simulation results that show that Wyner-Ziv video coding performs much better than pure H. 263 intracoding under noisy conditions. The dependency of the decoder on the quantization of key (H. 263 Intra coded) frames is analyzed. The error resilience of the decoder to missing blocks in the key frames is also shown.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An image super-resolution algorithm for different error levels per frame",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1593663/",
            "Abstract": "In this paper, we propose an image super-resolution (resolution enhancement) algorithm that takes into account inaccurate estimates of the registration parameters and the point spread function. These inaccurate estimates, along with the additive Gaussian noise in the low-resolution (LR) image sequence, result in different noise level for each frame. In the proposed algorithm, the LR frames are adaptively weighted according to their reliability and the regularization parameter is simultaneously estimated. A translational motion model is assumed. The convergence property of the proposed algorithm is analyzed in detail. Our experimental results using both real and synthetic data show the effectiveness of the proposed algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Priority-based cross-layer optimization for multihop DS-CDMA visual sensor networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6467056/",
            "Abstract": "We propose a novel priority-based approach that enables the optimal control of the transmission power and the use of the available network resources of a multihop Direct Sequence Code Division Multiple Access (DS-CDMA) Wireless Visual Sensor Network (WVSN). TheWVSN nodes can either monitor different scenes (source nodes) or retransmit videos of other nodes (relay nodes). Moreover, in real environments the source nodes monitor different scenes that may be of dissimilar importance. Hence a higher end-to-end quality is demanded for those nodes that are assigned a higher priority. Overall, each node has different power and resource requirements, and therefore a global optimization approach is required. For the purpose of enhancing the delivered video quality of the source nodes with respect to their priorities, we define and suggest the use of priority-based optimization criteria. Experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interactive Video Communications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8044958/",
            "Abstract": "This chapter contains sections titled:    Video Conferencing and Telephony   Region‐of‐Interest Video Communications   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Resource Management in Visual Sensor Networks using Nash Bargaining Solution in Generalized Fading",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6488459/",
            "Abstract": "In this paper we consider the problem of resource management for a Direct Sequence Code Division Multiple Access (DS-CDMA) wireless Visual Sensor Network (VSN) in a generalized fading environment. In a VSN application, the primary goal is ensuring that maximum video quality is achieved in spite of the prevailing network resource constraints. The Nash Bargaining Solution (NBS) was used in determining the transmission power and source and channel coding rates for each node. The nodes in the network negotiate in order to determine their transmission parameters. The task is to optimize the transmission powers (which are continuous) and the source and channel coding rates (which are discrete) for all the network nodes. Particle Swarm Optimization (PSO) is used to solve the mixed-integer optimization that arises. The analysis was carried out for a myriad of wireless multipath fading environments using …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint source-channel coding for scalable video using models of rate-distortion functions",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/941185/",
            "Abstract": "A joint source-channel coding scheme for scalable video is developed in this paper. An SNR scalable video coder is used and unequal error protection (UEP) is allowed for each scalable layer. Our problem is to allocate the available bit rate across scalable layers and, within each layer, between source and channel coding, while minimizing the end-to-end distortion of the received video sequence. The resulting optimization algorithm we propose utilizes universal rate-distortion characteristic plots. These plots show the contribution of each layer to the total distortion as a function of the source rate of the layer and the residual bit error rate (the error rate that remains after the use of channel coding). Models for these plots are proposed in order to reduce the computational complexity of the solution. Experimental results demonstrate the effectiveness of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless Multimedia Communication-Low-Delay Low-Complexity Bandwidth-Constrained Wireless Video Transmission Using SVC Over MIMO Systems",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=3922080805154629804&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accurate image registration for MAP image super-resolution",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0923596512002299",
            "Abstract": "The accuracy of image registration plays a dominant role in image super-resolution methods and in the related literature, landmark-based registration methods have gained increasing acceptance in this framework. In this work, we take advantage of a maximum a posteriori (MAP) scheme for image super-resolution in conjunction with the maximization of mutual information to improve image registration for super-resolution imaging. Local as well as global motion in the low-resolution images is considered. The overall scheme consists of two steps. At first, the low-resolution images are registered by establishing correspondences between image features. The second step is to fine-tune the registration parameters along with the high-resolution image estimation, using the maximization of mutual information criterion. Quantitative and qualitative results are reported indicating the effectiveness of the proposed scheme …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:dshw04ExmUIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optimal bit allocation for joint texture-aware contour-based shape coding and shape-adaptive texture coding",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4453848/",
            "Abstract": "In this paper, an operationally optimal joint shape and texture coding algorithm is proposed that uses shape-adaptive texture coding as well as texture-aware shape coding. The solution is optimal in the operational rate distortion sense, i.e, given the coding setup, the solution will guarantee the smallest possible distortion for a given rate. The shape is approximated using polygons or higher order curves. We also consider biasing the cost function to favor horizontal and vertical edges for the case of polygon approximation (biased polygon approximation). The texture is encoded using shape-adaptive discrete cosine transform or shape-adaptive discrete wavelet transform of the MPEG-4 video codec. A comparison is drawn between the two techniques. Both a fixed-width and a variable-width tolerance band for shape coding are considered. The variable width of the tolerance band is a function of the texture profile, i.e …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Superresolution Color Image Reconstruction",
            "Publication year": 2018,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781315221526-29/superresolution-color-image-reconstruction-hu-lisimachos-kondi",
            "Abstract": "CONTENTS 21.1 Introduction...................................................................................................................... 483 21.2 Previous Research............................................................................................................ 484 21.3 Generalized Acquisition Model..................................................................................... 487 21.4 Joint MAP Registration Algorithm with Gaussian-Markov",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Optimal power allocation for scalable video transmission over multirate GMC-CDMA wireless links",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4106458/",
            "Abstract": "Generalized multi carrier code division multiple access (GMC-CDMA) is a promising technique for achieving high data rate transmission capacity in interference-limited cellular systems. A key challenge in a multirate GMC-CDMA system for video transmission is the optimal power allocation between the sub-channels that maximizes the received video quality subject to a data rate budget. In this paper, we propose a method for joint source and channel coding with optimal power allocation for scalable video transmission over multirate GMC-CDMA wireless links. A GMC-CDMA system offers deterministic elimination of multiple user interference (MUI). A scalable video source codec is used and a multirate setup is assumed i.e., each video user is allowed to occupy more than one GMC-CDMA channels. Each of the GMC-CDMA channels can utilize a different number of subcarriers. The optimal solution selects the set of …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rao based watermark detector through two-level hierarchical prior in transform domain",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3139367.3139444",
            "Abstract": "In this work, we propose a transform based blind zero-bit watermark detector, designed based on a hierarchical, two-level image prior. This model is applied through Rao hypothesis test, where we detect the hidden information with unknown amplitude. The proposed method is suitable for wavelet domain watermark detection without the need to estimate the appropriate parameters under the alternative hypothesis. The proposed system shows efficient robustness against a variety of known attacks. The experimental results show that the proposed detector has a good performance with or without attacks in terms of ROC (receiver operating characteristics) curves compared with other known state-of-the-art statistical detectors.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:35r97b3x0nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Resource management for wireless visual sensor networks based on individual video characteristics",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6115728/",
            "Abstract": "We propose a novel approach for the optimized network resource management of a Direct Sequence Code Division Multiple Access (DS-CDMA) visual sensor network. The visual sensors monitor different scenes of varying motion levels, thus different network resources need to be allocated to each sensor. For each recorded scene, our approach considers its individual content-related parameters, in contrast with previous methods that group the sensors according to the amount of motion present in the scene and assign the same transmission parameters to all members of a group. Cross-layer optimization is used across the physical, link and application layers. Based on quality-driven criteria (under the constraint of constant chip rate), we allocate to each node a suitable continuous power level, a discrete source coding rate and a discrete channel coding rate. The resulting problem is solved using the Particle …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Preconditioning for underdetermined linear systems with sparse solutions",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7008458/",
            "Abstract": "Performance guarantees for the algorithms deployed to solve underdetermined linear systems with sparse solutions are based on the assumption that the involved system matrix has the form of an incoherent unit norm tight frame. Learned dictionaries, which are popular in sparse representations, often do not meet the necessary conditions for signal recovery. In compressed sensing (CS), recovery rates have been improved substantially with optimized projections; however, these techniques do not produce binary matrices, which are more suitable for hardware implementation. In this paper, we consider an underdetermined linear system with sparse solutions and propose a preconditioning technique that yields a system matrix having the properties of an incoherent unit norm tight frame. While existing work in preconditioning concerns greedy algorithms, the proposed technique is based on recent theoretical results …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the improvement of no-reference mean opinion score estimation accuracy by following a frame-level regression approach",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7351121/",
            "Abstract": "In order to estimate subjective video quality, we usually deal with a large number of features and a small sample set. Applying regression on complex datasets may lead to imprecise solutions due to possibly irrelevant or noisy features as well as the effect of overfitting. In this work, we propose a No-Reference (NR) method for the estimation of the quality of videos that are impaired by both compression artifacts and packet losses. Particularly, in an effort to establish a robust regression model that generalizes well to unknown data and to increase Mean Opinion Score (MOS) estimation accuracy, we propose a frame-level MOS estimation approach, where the MOS estimate of a sequence is obtained by averaging the per-frame MOS estimates, instead of performing regression directly at the sequence-level. Since it is impractical to obtain the actual per-frame MOS values through subjective experiments, we propose an …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable H. 264 wireless video transmission over MIMO-OFDM channels",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-17691-3_4",
            "Abstract": "A cross-layer optimization scheme is proposed for scalable video transmission over wireless Multiple Input Multiple Output Orthogonal Frequency Division Multiplexing (MIMO-OFDM) systems. The scalable video coding (SVC) extension of H.264/AVC is used for video source coding. The proposed cross-layer optimization scheme jointly optimizes application layer parameters and physical layer parameters. The objective is to minimize the expected video distortion at the receiver. Two methods have been developed for the estimation of video distortion at the receiver, which is essential for the cross-layer optimization. In addition, two different priority mappings of the SVC scalable layers are considered. Experimental results are provided and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Balanced multiple description video coding using optimal partitioning of the DCT coefficients",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1458834/",
            "Abstract": "In this paper, we propose a balanced multiple description video coding scheme which is based on the partitioning of the discrete cosine transform (DCT) coefficients. Our scheme splits the single-layered stream generated by a standard coder into two correlated and balanced (virtually identical rates and distortions) substreams. The optimization is in the redundancy-rate-distortion sense using Lagrangian relaxation for optimum allocation of redundancy among the blocks in the frame. A greedy algorithm to meet the equal distortions criterion and an algorithm to optimally achieve equal bit rates for the two descriptions are proposed. Our simulation results substantiate our claim of achieving balanced descriptions at high peak signal-to-noise ratios values for any specified redundancy and any target bit rate. Our design complies with the existing motion-compensated DCT-based standards, i.e., each description can be …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Drift controlled scalable wavelet based video coding in the overcomplete discrete wavelet transform domain",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S092359650700015X",
            "Abstract": "Traditional video coders use the previous frame to perform motion estimation and compensation. Though they are less complex and have minimum coding delays, these coders lose their efficiency when subjected to scalability requirements. Recent 3D wavelet coders using lifting schemes offer high compression efficiency and scalability without significant loss in performance. The main drawback of 3D coders is that they process several frames at a time. This introduces additional delay, which makes them less suitable for real time applications.In this work, we propose a novel scheme to minimize drift in scalable wavelet based video coding, which gives a balanced performance between compression efficiency and reconstructed quality with less drift. Our drift control mechanism maintains two frame buffers in the encoder and decoder; one that is based on the base layer and one that is based on the base plus …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:abG-DnoFyZgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Drift-controlled scalable video coding in over-complete wavelet domain",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1345232/",
            "Abstract": "In this work, we propose a novel scheme to minimize drift in scalable wavelet based video coding, which gives a balanced performance between compression efficiency and quality. Our drift control mechanism maintains two frame buffers in the encoder and decoder; one for the base layer and the other for the enhancement layer. Drift control is achieved by switching between these two buffers for motion compensation and prediction. In the encoder, the residues are coded using the embedded zerotree wavelet (EZW) algorithm. Our prediction is based on the enhancement layer, which inherently introduces drift in the system, if part of the enhancement layer is not available at the receiver. A measure of drift is computed based on channel information, and a threshold is set. When the measure exceeds the threshold, i.e. when drift becomes significant, we switch the prediction to be based on the base layer, which is …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Resolution enhancement of video sequences with adaptively weighted low-resolution images and simultaneous estimation of the regularization parameter",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1326519/",
            "Abstract": "In many imaging systems, the resolution of the detector array of the camera is not sufficiently high for a particular application. Furthermore, the capturing process introduces additive noise and the point spread function of the lens and the effects of the finite size of the photo-detectors further degrade the acquired video frames. The goal of resolution enhancement is to estimate a high-resolution image from a sequence of low-resolution images while also compensating for the degradations. We propose a technique for image resolution enhancement with adaptively weighted low-resolution images (channels) and simultaneous estimation of the regularization parameter. The weight coefficients work as the cross-channel fidelity to each low-resolution image, while the regularization parameter acts as the within-channel balance between data and prior model for each channel. Experimental results are presented and …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable video transmission over Rayleigh fading channels using LDPC codes",
            "Publication year": 2005,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5685/0000/Scalable-video-transmission-over-Rayleigh-fading-channels-using-LDPC-codes/10.1117/12.587157.short",
            "Abstract": "In this paper, we investigate an important problem of efficiently utilizing the available resources for video transmission over wireless channels while maintaining a good decoded video quality and resilience to channel impairments. Our system consists of the video codec based on 3-D set partitioning in hierarchical trees (3-D SPIHT) algorithm and employs two different schemes using low-density parity check (LDPC) codes for channel error protection. The first method uses the serial concatenation of the constant-rate LDPC code and rate-compatible punctured convolutional (RCPC) codes. Cyclic redundancy check (CRC) is used to detect transmission errors. In the other scheme, we use the product code structure consisting of a constant rate LDPC/CRC code across the rows of the `blocks' of source data and an erasure-correction systematic Reed-Solomon (RS) code as the column code. In both the schemes …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:_kc_bZDykSQC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Video Coding and Communications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8043299/",
            "Abstract": "This chapter contains sections titled:    Digital Video Compression – Why and How Much?   Basics   Information Theory   Encoder Architectures   Wavelet‐Based Video Compression   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Effective resource management in visual sensor networks with MPSK",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6522865/",
            "Abstract": "The problem of resource management in a Direct Sequence Code Division Multiple Access (DS-CDMA) wireless Visual Sensor Network (VSN) with M-array Phase Shift Keying (MPSK) modulation in an Additive White Gaussian Network (AWGN) channel was considered in this paper. Achieving maximum video quality, in spite of the prevailing network resource constraints, is of utmost importance in VSN applications. Our optimization scheme is based on the Nash Bargaining Solution (NBS). The nodes in the network negotiate in order to determine their transmission parameters (transmission powers; source and channel coding rates for each node). The task is to optimize the transmission powers (which are continuous) and the source and channel coding rates (which are discrete) for all the network nodes, while taking advantage of the improved bandwidth spectral efficiency provided by the higher order constellation.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:eflP2zaiRacC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Layered video transmission over multirate DS-CDMA wireless systems",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5022/0000/Layered-video-transmission-over-multirate-DS-CDMA-wireless-systems/10.1117/12.476609.short",
            "Abstract": "n this paper, we consider the transmission of video over wireless direct-sequence code-division multiple access (DS-CDMA) channels. A layered (scalable) video source codec is used and each layer is transmitted over a different CDMA channel. Spreading codes with different lengths are allowed for each CDMA channel (multirate CDMA). Thus, a different number of chips per bit can be used for the transmission of each scalable layer. For a given fixed energy value per chip and chip rate, the selection of a spreading code length affects the transmitted energy per bit and bit rate for each scalable layer. An MPEG-4 source encoder is used to provide a two-layer SNR scalable bitstream. Each of the two layers is channel-coded using Rate-Compatible Punctured Convolutional (RCPC) codes. Then, the data are interleaved, spread, carrier-modulated and transmitted over the wireless channel. A multipath Rayleigh fading …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:MXK_kJrjxJIC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Improved hybrid blind IQA using alternative NSS characterization in the spatial domain",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9477453/",
            "Abstract": "The adoption of a Natural Scene Statistics (NSS) model has been an important research direction in the selection of perceptual features capable of giving satisfactory results in the problem of image quality assessment (IQA). In this work, trying to improve the performance of a blind IQA methodology, we simultaneously consider quality aware features from both the spatial and the transform domains. Moreover, for the first time, a statistical description of the spatial domain is investigated through the Student's t distribution, trying to predict the subjective evaluation of humans and to reduce the total number of features. In essence, a large number of features are used, which are optimized by the consequent characterization with the distribution's parameters. The proposed model is then fed to a tool to learn a simple regression model. In this way the extracted trained model is used to predict the graded image quality score …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Kalai-Smorodinsky bargaining solution for optimal resource allocation over wireless DS-CDMA visual sensor networks",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8305/83050T/Kalai-Smorodinsky-bargaining-solution-for-optimal-resource-allocation-over-wireless/10.1117/12.908702.short",
            "Abstract": "Surveillance applications usually require high levels of video quality, resulting in high power consumption. The existence of a well-behaved scheme to balance video quality and power consumption is crucial for the system's performance. In the present work, we adopt the game-theoretic approach of Kalai-Smorodinsky Bargaining Solution (KSBS) to deal with the problem of optimal resource allocation in a multi-node wireless visual sensor network (VSN). In our setting, the Direct Sequence Code Division Multiple Access (DS-CDMA) method is used for channel access, while a cross-layer optimization design, which employs a central processing server, accounts for the overall system efficacy through all network layers. The task assigned to the central server is the communication with the nodes and the joint determination of their transmission parameters. The KSBS is applied to non-convex utility spaces, efficiently …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:35N4QoGY0k4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Cross‐Layer Optimized Video Delivery Over 4G Wireless Networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8045666/",
            "Abstract": "This chapter contains sections titled:    Why Cross‐Layer Design?   Quality‐Driven Cross‐Layer Framework   Application Layer   Rate Control at the Transport Layer   Routing at the Network Layer   Content‐Aware Real‐Time Video Streaming   Cross‐Layer Optimization for Video Summary Transmission   Conclusions   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:yB1At4FlUx8C",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Resolution enhancement of video sequences with simultaneous estimation of the regularization parameter",
            "Publication year": 2004,
            "Publication url": "https://www.spiedigitallibrary.org/journals/journal-of-electronic-imaging/volume-13/issue-3/0000/Resolution-enhancement-of-video-sequences-with-simultaneous-estimation-of-the/10.1117/1.1762889.short",
            "Abstract": "We propose a technique for the estimation of the regularization parameter for image resolution enhancement (superresolution) based on the assumptions that it should be a function of the regularized noise power of the data and that its choice should yield a convex functional whose minimization would give the desired high-resolution image. The regularization parameter acts adaptively to determine the trade-off between fidelity to the received data and prior information about the image. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:_FxGoFyzp5QC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Geometric bargaining approach for optimizing resource allocation in wireless visual sensor networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6423876/",
            "Abstract": "Applications that include real-time video delivery are demanding on network performance, while the various network resources are usually constrained. This fact boosts the need for efficient resource management, aiming at the amelioration of the video quality that reaches the end-user. The present paper considers a wireless direct sequence code division multiple access visual sensor network, which employs a cross-layer design. The objective is the maximization of the nodes' utilities under the constraints of a maximum bit rate and a maximum power level for each node. In this vein, the Kalai-Smorodinsky bargaining solution is applied, which is geometrically derived from the graphical representations of the utility sets, under a centralized topology. Ultimately, we have to deal with an optimization problem that concerns the optimal determination of the source coding rates, channel coding rates, and power levels of all …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CORRESPONDENCE-Error Resilience and Channel Coding for Image and Video Systems-Cross-Layer Optimization for Video Transmission Over Multirate GMC-CDMA Wireless Links",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=13373982431664962196&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal bandwidth allocation for scalable H. 264 video transmission over MIMO systems",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4086529/",
            "Abstract": "In this paper we propose an optimal strategy for the transmission of scalable video over packet-based multiple-input multiple-output (MIMO) systems. The latest scalable H. 264 codec is used, which provides combined temporal, quality and spatial scalability. In this work, we propose different error concealment schemes to handle packet losses at the decoder. At the encoder we have developed a method for the estimation of the video distortion at the receiver for given channel conditions. We show the performance of our distortion estimation algorithm in comparison with simulated video transmission over wireless channels with packet errors. In the proposed system, we use a MIMO system with orthogonal space-time block codes (O-STBC) that provides spatial diversity and guarantees independent transmission of different symbols within the block code. Rate-compatible turbo codes (RCPT) are used for unequal error …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable video transmission over orthogonal frequency division multiplexing wireless channels",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1345207/",
            "Abstract": "We optimize a wireless system for video transmission over orthogonal frequency division multiplexing (OFDM) systems. A frequency-selective Rayleigh fading channel is assumed. Block transmissions using a cyclic prefix are used to eliminate interblock interference (IBI). Quadrature amplitude modulation (QAM) is used as modulation scheme. The MPEG-4 video coder is used to provide a two-layer SNR scalable video bit stream. Rate compatible punctured convolutional codes (RCPC codes) are used for error protection. We apply unequal error protection (UEP) to the layers of the scalable bitstream. We solve the problem of optimal bit allocation between source and channel coding and across scalable layers such that the overall distortion is minimized. The algorithm utilizes universal rate distortion characteristics which are obtained experimentally and show the sensitivity of the source encoder and decoder to …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-layer optimization for video transmission over multirate GMC-CDMA wireless links",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4483676/",
            "Abstract": "In this paper, we consider the problem of video transmission over wireless generalized multicarrier code division multiple access (GMC-CDMA) systems. Such systems offer deterministic elimination of multiple access interference. A scalable video source codec is used and a multirate setup is assumed, i.e., each video user is allowed to occupy more than one GMC-CDMA channels. Furthermore, each of these channels can utilize a different number of subcarriers. We propose a cross-layer optimization method to select the source coding rate, channel coding rate, number of subcarriers per GMC-CDMA channel and transmission power per GMC-CDMA channel given a maximum transmission power for each video user and an available chip rate. Universal rate distortion characteristics (URDC) are used to approximate the expected distortion at the receiver. The proposed algorithm is optimal in the operational rate …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "JOINT OPTIMAL CONTOUR-BASED SHAPE CODING AND SHAPE-ADAPTIVE TEXTURE CODING",
            "Publication year": 2004,
            "Publication url": "http://www.cs.uoi.gr/~lkon/papers/WNY_04.pdf",
            "Abstract": "In this paper, an optimal framework is proposed for the joint encoding of the texture and shape information in object based video. The solution is optimal in the operational rate distortion sense ie given one coding setup the solution will guarantee the smallest possible distortion for a given rate. The shape is approximated using polygons or higher order curves. The texture is encoded using Shape Adaptive Discrete Cosine Transform (SA-DCT) and Shape Adaptive Set Partitioning In Hierarchical Trees (SA-SPIHT) and a comparison drawn between the two techniques. Both a fixedwidth and a variable width tolerance band for shape coding were considered. The variable width of the tolerance band is a function of the texture profile, ie, the width is inversely proportional to the magnitude of the image gradient. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Contourlet Based Natural Scene Statistics Using Student'S T Distribution",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8461625/",
            "Abstract": "In this work, we consider contourlet based image decomposition as a convenient framework for localized representation of images simultaneously in space, frequency (scale) and orientation. Since the subband marginal distributions of natural images in the contourlet domain are highly non-Gaussian with leptokurtotic behavior, we propose the Student's t probability density function (pdf) as a prior for modeling the contourlet coefficients of natural images. As an extension, we also consider the bivariate form of Student's t pdf in order to capture the across scales dependencies of the contourlet transform. We validate our proposal by adopting subjective and objective measures.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:fEOibwPWpKIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint source-channel coding for scalable video over DS-CDMA multipath fading channels",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/959215/",
            "Abstract": "We extend our previous work on joint source-channel coding to scalable video transmission over wireless direct-sequence code-division-multiple-access (DS-CDMA) multipath fading channels. A SNR scalable video coder is used and unequal error protection (UEP) is allowed for each scalable layer. At the receiver-end an adaptive antenna array auxiliary-vector (AV) filter is utilized that provides space-time RAKE-type processing and multiple-access interference suppression. The choice of the AV receiver is dictated by realistic channel fading rates that limit the data record available for receiver adaptation and redesign. Our problem is to allocate the available bit rate of the user of interest between source and channel coding and across scalable layers, while minimizing the end-to-end distortion of the received video sequence. The optimization algorithm that we propose utilizes universal rate-distortion characteristic …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A no-reference bitstream-based perceptual model for video quality estimation of videos affected by coding artifacts and packet losses",
            "Publication year": 2015,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9394/93941F/A-no-reference-bitstream-based-perceptual-model-for-video-quality/10.1117/12.2077709.short",
            "Abstract": "In this work, we propose a No-Reference (NR) bitstream-based model for predicting the quality of H.264/AVC video sequences, affected by both compression artifacts and transmission impairments. The proposed model is based on a feature extraction procedure, where a large number of features are calculated from the packet-loss impaired bitstream. Many of the features are firstly proposed in this work, and the specific set of the features as a whole is applied for the first time for making NR video quality predictions. All feature observations are taken as input to the Least Absolute Shrinkage and Selection Operator (LASSO) regression method. LASSO indicates the most important features, and using only them, it is possible to estimate the Mean Opinion Score (MOS) with high accuracy. Indicatively, we point out that only 13 features are able to produce a Pearson Correlation Coefficient of 0.92 with the MOS …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:tkaPQYYpVKoC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Game theoretic wireless resource allocation for H. 264 MGS video transmission over cognitive radio networks",
            "Publication year": 2015,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9410/94100E/Game-theoretic-wireless-resource-allocation-for-H264-MGS-video-transmission/10.1117/12.2077117.short",
            "Abstract": "We propose a method for the fair and efficient allocation of wireless resources over a cognitive radio system network to transmit multiple scalable video streams to multiple users. The method exploits the dynamic architecture of the Scalable Video Coding extension of the H.264 standard, along with the diversity that OFDMA networks provide. We use a game-theoretic Nash Bargaining Solution (NBS) framework to ensure that each user receives the minimum video quality requirements, while maintaining fairness over the cognitive radio system. An optimization problem is formulated, where the objective is the maximization of the Nash product while minimizing the waste of resources. The problem is solved by using a Swarm Intelligence optimizer, namely Particle Swarm Optimization. Due to the high dimensionality of the problem, we also introduce a dimension-reduction technique. Our experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:eMMeJKvmdy0C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Transactions letters. A rate-distortion optimal hybrid scalable/multipledescription video codec",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1458833/",
            "Abstract": "We propose a novel hybrid scalable/multiple description codec which produces a base layer and two multiple description enhancement layers. The base layer is required for decoding. If one or two of the multiple description enhancement layers are also received, the signal-to-noise ratio of the received video sequence is improved. There is no hierarchy in the multiple description enhancement layers. Thus, in contrast with classic scalable coding (SC), if either enhancement layer is lost, the other enhancement layer is still useful to the decoder. This functionality comes at a minimal expense in compression efficiency compared with SC. The layers are constructed using a rate-distortion optimal partitioning of the discrete cosine transform coefficients. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal bit allocation for joint contour-based shape coding and shape adaptive texture coding",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1529819/",
            "Abstract": "In this paper, an optimal framework is proposed for the joint encoding of the shape and texture information in object based video. The solution is optimal in the operational rate distortion sense, i.e, given the coding setup, the solution guarantees the smallest possible distortion for a given rate. The shape is approximated using polygons or higher order curves. We also consider biasing the cost function to favor horizontal and vertical edges, for the case of polygon approximation (biased polygon approximation). The texture is encoded using shape adaptive discrete cosine transform (SA-DCT) or shape adaptive discrete wavelet transform (SA-DWT) of the MPEG-4 video codec. A comparison is drawn between the two techniques. Both a fixed-width and a variable-width tolerance band for shape coding are considered. The variable width of the tolerance band is a function of the texture profile, i.e, the width is inversely …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "SSIM-based distortion estimation for optimized video transmission over inherently noisy channels",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/article/ssim-based-distortion-estimation-for-optimized-video-transmission-over-inherently-noisy-channels/158110",
            "Abstract": "The authors present two methods for examining video quality using the Structural Similarity (SSIM) index: Iterative Distortion Estimate (IDE) and Cumulative Distortion using SSIM (CDSSIM). In the first method, three types of slices are iteratively reconstructed frame-by-frame for three different combinations of packet loss and the resulting distortions are combined using their probabilities to give the total expected distortion. In the second method, a cumulative measure of the overall distortion is computed by summing the inter-frame propagation impact to all frames affected by a slice loss. Furthermore, the authors develop a No-Reference (NR) sparse regression framework for predicting the CDSSIM metric to circumvent the real-time computational complexity in streaming video applications. The two methods are evaluated in resource allocation and packet prioritization schemes and experimental results show improved …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "4G wireless video communications",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=lOkBRVkQIHMC&oi=fnd&pg=PR5&dq=info:HoEqXrRvdbcJ:scholar.google.com&ots=hn7QwWwpSU&sig=cSeHaMfu-xeOKg7H1sdTdrBn7rI",
            "Abstract": "A comprehensive presentation of the video communication techniques and systems, this book examines 4G wireless systems which are set to revolutionise ubiquitous multimedia communication. 4G Wireless Video Communications covers the fundamental theory and looks at systems’ descriptions with a focus on digital video. It addresses the key topics associated with multimedia communication on 4G networks, including advanced video coding standards, error resilience and error concealment techniques, as well as advanced content-analysis and adaptation techniques for video communications, cross-layer design and optimization frameworks and methods. It also provides a high-level overview of the digital video compression standard MPEG-4 AVC/H. 264 that is expected to play a key role in 4G networks. Material is presented logically allowing readers to turn directly to specific points of interest. The first half of the book covers fundamental theory and systems, while the second half moves onto advanced techniques and applications. This book is a timely reflection of the latest advances in video communications for 4G wireless systems. One of the first books to study the latest video communications developments for emerging 4G wireless systems Considers challenges and techniques in video delivery over 4G wireless systems Examines system architecture, key techniques and related standards of advanced wireless multimedia applications Written from both the perspective of industry and academia",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:Y0pCki6q_DkC",
            "Publisher": "John Wiley & Sons"
        },
        {
            "Title": "Resolution enhancement of video sequences with simultaneous estimation of the regularization parameter",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5022/0000/Resolution-enhancement-of-video-sequences-with-simultaneous-estimation-of-the/10.1117/12.476613.short",
            "Abstract": "In this paper, we extend our previous resolution enhancement results by proposing a technique for the estimation of the regularization parameter based on the assumption that it should satisfy the following properties: It should be a function of the regularized noise power of the data and its choice should yield a convex functional whose minimization would give the desired high-resolution image. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:IWHjjKOFINEC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Advanced Video Coding (AVC)/H. 264 Standard",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8041286/",
            "Abstract": "This chapter contains sections titled:    Digital Video Compression Standards   AVC/H.264 Coding Algorithm   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Fairness issues in resource allocation schemes for wireless visual sensor networks",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8666/866601/Fairness-issues-in-resource-allocation-schemes-for-wireless-visual-sensor/10.1117/12.2004605.short",
            "Abstract": "This work addresses the problem of fairness and efficiency evaluation of various resource allocation schemes for wireless visual sensor networks (VSNs). These schemes are used to optimally allocate the source coding rates, channel coding rates, and power levels among the nodes of a wireless direct sequence code division multiple access (DS–CDMA) VSN. All of the considered schemes optimize a function of the video qualities of the nodes. However, there is no single scheme that maximizes the video quality of each node simultaneously. In fact, all presented schemes are able to provide a Pareto–optimal solution, meaning that there is no other solution that is simultaneously preferred by all nodes. Thus, it is not clear which scheme results in the best resource allocation for the whole network. To handle the resulting tradeoffs, in this study we examine four metrics that investigate fairness and efficiency under …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Improving 3D medical image compression efficiency using spatiotemporal coherence",
            "Publication year": 2020,
            "Publication url": "https://www.ingentaconnect.com/content/ist/ei/2020/00002020/00000010/art00007",
            "Abstract": "Advanced methodologies for transmitting compressed images, within acceptable ranges of transmission rate and loss of information, make it possible to transmit a medical image through a communication channel. Most prior works on 3D medical image compression consider volumetric images as a whole but fail to account for the spatial and temporal coherence of adjacent slices. In this paper, we set out to develop a 3D medical image compression method that extends the 3D wavelet difference reduction algorithm by computing the similarity of the pixels in adjacent slices and progressively compress only the similar slices. The proposed method achieves high-efficiency performance on publicly available datasets of MRI scans by achieving compression down to one bit per voxel with PSNR and SSIM up to 52:3 dB and 0:7578, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:uWiczbcajpAC",
            "Publisher": "Society for Imaging Science and Technology"
        },
        {
            "Title": "Quality-driven power control and resource allocation in wireless multi-rate visual sensor networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6467060/",
            "Abstract": "In the present paper, we deal with the problem of allocating the network resources in multi-rate Direct Sequence Code Division Multiple Access (DS-CDMA) Visual Sensor Networks (VSNs). We consider a single-cell system where each node uses the same chip rate, but can transmit at a different bit rate. In wireless VSNs, we face the constraints of limited power lifetime and of an error-prone environment, mainly due to attenuation and interference. The proposed cross-layer scheme enables the Centralized Control Unit (CCU) to jointly allocate the transmission power, the transmission bit rate and the source-channel coding rates for each VSN node in order to optimize the delivered video quality. The transmission power of each visual sensor assumes values from a continuous range, while the rest of the resources take values chosen from an available discrete set. The numerical results demonstrate the performance of …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Motion–related resource allocation in dynamic wireless visual sensor network environments",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6637033/",
            "Abstract": "This paper investigates quality-driven cross-layer optimization for resource allocation in direct sequence code division multiple access wireless visual sensor networks. We consider a single-hop network topology, where each sensor transmits directly to a centralized control unit (CCU) that manages the available network resources. Our aim is to enable the CCU to jointly allocate the transmission power and source-channel coding rates for each node, under four different quality-driven criteria that take into consideration the varying motion characteristics of each recorded video. For this purpose, we studied two approaches with a different tradeoff of quality and complexity. The first one allocates the resources individually for each sensor, whereas the second clusters them according to the recorded level of motion. In order to address the dynamic nature of the recorded scenery and re-allocate the resources whenever it …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal resource allocation for video transmission over DS-CDMA channels with multirate detection",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1327273/",
            "Abstract": "In this paper, we consider the transmission of video over multirate wireless direct-sequence code-division multiple access (DS-CDMA) channels. The performance of transmitting scalable video over a multipath Rayleigh fading channel via a combination of multi-code multirate CDMA and variable sequence length multirate CDMA channel system is considered. At the other end, the signal is collected by an antenna array front and despreading is done using adaptive space-time auxiliary-vector (AV) filters. AV filter configurations suitable for multirate detection are designed and the rate-distortion optimization is carried out for each configuration. The experimental results show a comparison of the performance of such multirate DS-CDMA systems for wireless video transmission.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DCT/DWT blind multiplicative watermarking through student-t distribution",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8296335/",
            "Abstract": "In this work, which addresses issues related to the efficient hiding of watermark information in the transform domain, we propose to model the transform coefficients with the Student-t distribution through the multiplicative rule of embedding. Based on the observation that the statistical distribution of the transform coefficients has heavy tailed behavior, we design a new class of watermark detectors following the multiplicative rule of embedding. We present experimental results that compare the proposed method with known state-of-the-art multiplicative watermark detectors and demonstrate its effectiveness in terms of sensitivity and robustness.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:7T2F9Uy0os0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-Layer Optimization for H. 264/AVC Video Transmission Over Space-Frequency (SF) Coded MIMO-OFDM Systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4599971/",
            "Abstract": "Multicarrier communication becomes a natural choice to transmit multimedia content at high data rates. Among multicarrier communication techniques, the combination of orthogonal frequency division multiplexing (OFDM) technology with multiple input multiple output (MIMO) systems is very effective for high data rate wireless communication. In this paper, we propose a cross layer optimization technique for transmitting H.264/AVC video data over a MIMO-OFDM wireless channel. A set of fast time-varying and frequency selective fading channels is considered. The channel is assumed to be unchanged for the duration of one OFDM block and change independently from one OFDM block to the other. The number of pilot symbols for each OFDM block is held constant and they are dispersed throughout the block for efficient channel estimation. The video transmission system uses a jointly optimal space frequency (SF …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless Communications and Networking",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8044205/",
            "Abstract": "This chapter contains sections titled:    Characteristics and Modeling of Wireless Channels   Adaptive Modulation and Coding   Orthogonal Frequency Division Multiplexing   Multiple‐Input Multiple‐Output Systems   Cross‐Layer Design of AMC and HARQ   Wireless Networking   Summary   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Joint optimal object shape estimation and encoding",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1281827/",
            "Abstract": "A major problem in object-oriented video coding and MPEG-4 is the encoding of object boundaries. Traditionally this problem is treated separately from the texture encoding problem. In this paper, we present a vertex-based shape coding method which is optimal in the operational rate-distortion sense and takes into account the texture information of the video frames. This is accomplished by utilizing a variable-width tolerance band whose width is a function of the texture profile. As an example, this width is inversely proportional to the magnitude of the image gradient. Thus, in areas where the confidence in the estimation of the boundary is low and/or coding errors in the boundary will not affect the application (e.g., object-oriented coding and MPEG-4) significantly, a larger boundary approximation error is allowed. We present experimental results which demonstrate the effectiveness of the proposed algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A study on visual sensor network cross-layer resource allocation using quality-based criteria and metaheuristic optimization algorithms",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1568494614004712",
            "Abstract": "Visual sensor networks (VSNs) consist of spatially distributed video cameras that are capable of compressing and transmitting the video sequences they acquire. We consider a direct-sequence code division multiple access (DS-CDMA) VSN, where each node has its individual requirements in compression bit rate and energy consumption, depending on the corresponding application and the characteristics of the monitored scene. We study two optimization criteria for the optimal allocation of the source and channel coding rates, which assume discrete values, as well as for the power levels of all nodes, which are continuous, under transmission bit rate constraints. The first criterion minimizes the average distortion of the video received by all nodes, while the second one minimizes the maximum video distortion among all nodes. The resulting mixed integer optimization problems are tackled with a modern …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:Mojj43d5GZwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optimal bit allocation for hybrid scalable/multiple-description video transmission over wireless channels",
            "Publication year": 2006,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6077/60770D/Optimal-bit-allocation-for-hybrid-scalable-multiple-description-video-transmission/10.1117/12.643605.short",
            "Abstract": "In this paper, we consider the problem of optimal bit allocation for wireless video transmission over fading channels. We use a newly developed hybrid scalable/multiple-description codec that combines the functionality of both scalable and multiple-description codecs. It produces a base layer and multiple-description enhancement layers. Any of the enhancement layers can be decoded (in a non-hierarchical manner) with the base layer to improve the reconstructed video quality. Two different channel coding schemes (Rate-Compatible Punctured Convolutional (RCPC)/Cyclic Redundancy Check (CRC) coding and, product code Reed Solomon (RS)+RCPC/CRC coding) are used for unequal error protection of the layered bitstream. Optimal allocation of the bitrate between source and channel coding is performed for discrete sets of source coding rates and channel coding rates. Experimental results are presented …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:D03iK_w7-QYC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Cross-layer optimization with power control in DS-CDMA visual sensor networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4106457/",
            "Abstract": "In this paper, we propose an approach for cross-layer optimization with power control for a direct sequence-code division multiple access (DS-CDMA) visual sensor network where nodes monitor scenes with varying levels of motion. Our technique simultaneously assigns a source coding rate, a channel coding rate, and a power level to all nodes in the network based on two criteria that maximize the quality of video of the entire network as a whole, subject to a constraint on the total chip rate. One method minimizes the average end-to-end distortion amongst all nodes, while the other method minimizes the maximum distortion of the network. To reduce the computational complexity of the solution, universal rate-distortion characteristics (URDCs) are obtained experimentally to relate bit errors probabilities to the distortion of corrupted video. The URDCs are used in conjunction with channel characteristic plots obtained …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Transmission of scalable H. 264 coded video over wireless MIMO systems with optimal bandwidth allocation",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4217213/",
            "Abstract": "We propose an optimal strategy for the transmission of scalable video over multiple-input multiple-output (MIMO) wireless systems. In this paper, we use the latest scalable H.264 codec which provides combined temporal, quality and spatial scalability. At the transmitter, we have developed a method for the estimation of the video distortion at the receiver for given channel conditions. The accuracy of this method is validated using experimental results. In our proposed system, we use a MIMO system with orthogonal space-time block codes (O-STBC) that provides spatial diversity and guarantees independent transmission of different symbols within the block code. Rate-compatible punctured convolutional (RCPC) codes are used for unequal error protection of the scalable layers. In the constrained bandwidth allocation framework considered here, we use the estimated decoder distortion to optimally select the …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital and Multirate Signal Processing Comments on “Closed Form Variable Fractional Time Delay Using FFT”.......................................... M. Blok 747 Stable Signal Recovery via Randomly Enhanced Adaptive Subspace Pursuit Method....... L. Liu, X. Du, and L. Cheng 823 Bregman Iteration Based Efficient Algorithm for MR Image Reconstruction From Undersampled K-Space Data........",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6548049/",
            "Abstract": "Table of Contents Page 1 AUGUST 2013 VOLUME 20 NUMBER 8 ISPLEM (ISSN 1070-9908) \nLETTERS Audio and Acoustic Signal Processing Two-Dimension Common Factor \nDecomposition of Head-Related Impulse Response ............ Z. Wang and C.-F. Chan 795 \nBiomedical Signal Processing \nEffectiveResourceManagementinVisualSensorNetworksWithMPSK .................................................... \n................................................................. OO Odejide, ES Bentley, LP Kondi, and JD Matyjas \n739 Digital and Multirate Signal Processing Comments on “Closed Form Variable Fractional \nTime Delay Using FFT” .......................................... M.Blok 747 Stable Signal Recovery via \nRandomly Enhanced Adaptive Subspace Pursuit Method ....... L. Liu, X. Du, and L. Cheng \n823 Bregman Iteration Based Efficient Algorithm for MR Image Reconstruction From \nUndersampled K-Space Data ........ .................................................................................................…",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An operational rate-distortion optimal single-pass SNR scalable video coder",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/967389/",
            "Abstract": "We introduce a new methodology for signal-to-noise ratio (SNR) video scalability based on the partitioning of the DCT coefficients. The DCT coefficients of the displaced frame difference (DFD) for inter-blocks or the intensity for intra-blocks are partitioned into a base layer and one or more enhancement layers, thus, producing an embedded bitstream. Subsets of this bitstream can be transmitted with increasing video quality as measured by the SNR. Given a bit budget for the base and enhancement layers the partitioning of the DCT coefficients is done in a way that is optimal in the operational rate-distortion sense. The optimization is performed using Lagrangian relaxation and dynamic programming (DP). Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Layered video transmission over wireless multirate DS-CDMA links",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1546009/",
            "Abstract": "In this paper, we consider the transmission of video over wireless direct-sequence code-division multiple access (DS-CDMA) channels. A layered (scalable) video source codec is used. The layers may be time-multiplexed and transmitted over a single CDMA channel or each layer can be transmitted over a different CDMA channel. For the latter case, spreading codes of different lengths are allowed for each CDMA channel (multirate CDMA). Thus, a different number of chips per bit can be used for the transmission of each scalable layer. For a given fixed energy value per chip and chip rate, the selection of a spreading code length affects the transmitted energy per bit and bit rate for each scalable layer. An MPEG-4 source encoder is used to provide a two-layer signal-to-noise-ratio scalable bit stream. Each of the two layers is channel-coded using rate-compatible punctured convolutional codes. Then, the data are …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable Video Transmission Over Wireless Channels Using 3-D SPIHT and LDPC Codes",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Lisimachos-Kondi/publication/228449833_Scalable_Video_Transmission_Over_Wireless_Channels_Using_3-D_SPIHT_and_LDPC_Codes/links/0deec52d6815dcb8a5000000/Scalable-Video-Transmission-Over-Wireless-Channels-Using-3-D-SPIHT-and-LDPC-Codes.pdf",
            "Abstract": "In this paper, an important problem of efficient utilization of the available resources for video transmission over wireless channels is investigated. The popular 3-D Set Partitioning In Hierarchical Trees (3-D SPIHT) is used to produce a completely embedded video bit stream. A new channel coding technique employing low-density parity check (LDPC) codes and rate-compatible punctured convolutional (RCPC) codes/cyclic redundancy check (CRC) is proposed for error-detection and correction. A flat-fading Rayleigh channel with additive white gaussian noise (AWGN) is modeled for transmission. The embedded bit stream is given unequal error protection (UEP) and the rate-distortion optimization algorithm is developed and carried out for the selection of source coding rate and the channel coding rate. The experimental results demonstrate the effectiveness of this system under different wireless channel conditions for video transmission and are seen to be better than the classical technique of using RCPC/CRC.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the improvement of image registration for high accuracy super-resolution",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5946570/",
            "Abstract": "Accurate image registration plays a preponderant role in image super-resolution methods and in the related literature landmark based registration methods have gained increasing acceptance in this framework. However, their solution relies on point correspondences and on least squares estimation of the registration parameters necessitating further improvement. In this work, a maximum a posteriori scheme for image super-re solution is presented where the image registration part is accomplished in two steps. At first, the low resolution images are registered by establishing correspondences between robust SIFT features. In the second step, the estimation of the registration parameters is fine-tuned along with the estimation of the high resolution image, in an iterative procedure, using the maximization of the mutual information criterion. Numerical results showed that the reconstructed image is consistently of higher …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint quality enhancement and power control for wireless visual sensor networks based on the nash bargaining solution",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1051200416000038",
            "Abstract": "We propose a cooperative method for resource allocation with power control in a multihop Direct Sequence Code Division Multiple Access Wireless Visual Sensor Network (WVSN). Typical multihop WVSNs consist of visual sensors that record different scenes and relay nodes that retransmit video data until the base station is reached. The error prone wireless environment contributes to the end-to-end video quality degradation. Moreover, the limited battery life span of the network nodes poses challenges on the management of power consumption. The different resource requirements of the WVSN nodes necessitate a quality-driven and power-aware resource allocation mechanism. We formulate the joint Quality Enhancement and Power Control problem based on a utility function that reflects both the benefit in terms of video quality and the cost in terms of transmission power. This function is employed by the Nash …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Accurate distortion estimation and optimal bandwidth allocation for scalable H. 264 video transmission over MIMO systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4682626/",
            "Abstract": "In this paper, we propose an optimal strategy for the transmission of scalable video over packet-based multiple-input multiple-output (MIMO) systems. The scalable extension of H.264/AVC that provides a combined temporal, quality and spatial scalability is used. For given channel conditions, we develop a method for the estimation of the distortion of the received video and propose different error concealment schemes. We show the accuracy of our distortion estimation algorithm in comparison with simulated wireless video transmission with packet errors. In the proposed MIMO system, we employ orthogonal space-time block codes (O-STBC) that guarantee independent transmission of different symbols within the block code. In the proposed constrained bandwidth allocation framework, we use the estimated end-to-end decoder distortion to optimally select the application layer parameters, i.e., quantization …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless visual sensor network resource allocation using cross-layer optimization",
            "Publication year": 2009,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/7257/72570G/Wireless-visual-sensor-network-resource-allocation-using-cross-layer-optimization/10.1117/12.805907.short",
            "Abstract": "In this paper, we propose an approach to manage network resources for a Direct Sequence Code Division Multiple Access (DS-CDMA) visual sensor network where nodes monitor scenes with varying levels of motion.  It uses cross-layer optimization across the physical layer, the link layer and the application layer.  Our technique simultaneously assigns a source coding rate, a channel coding rate, and a power level to all nodes in the network based on one of two criteria that maximize the quality of video of the entire network as a whole, subject to a constraint on the total chip rate.  One criterion results in the minimal average end-to-end distortion amongst all nodes, while the other criterion minimizes the maximum distortion of the network.  Our approach allows one to determine the capacity of the visual sensor network based on the number of nodes and the quality of video that must be transmitted.  For bandwidth …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Recent advances in video communications for 4G wireless systems",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.468",
            "Abstract": "In recent years, there has been a rapidly increasing demand for the development of advanced interactive multimedia applications such as video telephony, video games, and TV broadcasting. However, these applications are always stringently constrained by current wireless system architectures due to the need for high data rates for video transmission. To better serve this need, 4G broadband mobile systems are in planning and are expected to increase the mobile data transmission rates and bring higher spectral efficiency, lower cost per transmitted bit, and increased flexibility of mobile terminals and networks. The new technology strives to eliminate the distinction between video over wireless and video over wireline networks. In the meantime, great opportunities are provided for proposing novel wireless video protocols and applications, and developing advanced video coding and communications systems, and …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:70eg2SAEIzsC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Drift control in variable bitrate wireless channels for scalable wavelet based video coding in the overcomplete discrete wavelet transform domain",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1530372/",
            "Abstract": "In this work, we propose a novel scheme to minimize drift in scalable wavelet based video coding, which gives a balanced performance between compression efficiency and reconstructed quality with less drift. Our drift control mechanism maintains two frame buffers in the encoder and decoder; one that is based on the base layer and the one that is based on the base plus enhancement layers. Drift control is achieved by switching between these two buffers for motion estimation and compensation and base layer information is used for predicting enhancement layers. Our coder is designed for variable bit rate wireless channels and offers high compression efficiency and sustained video quality.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computationally efficient operational rate-distortion optimal SNR scalable codec",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5022/0000/Computationally-efficient-operational-rate-distortion-optimal-SNR-scalable-codec/10.1117/12.476450.short",
            "Abstract": "We present a new scalable video codec which features a computationally efficient decoder as well as an operational rate-distortion optimal encoder. The SNR scalability is accomplished by splitting the Discrete Cosine Transform (DCT) coefficients of the Displaced Frame Difference (DFD) into groups that correspond to the scalable layers. Our Operational Rate-Distortion optimal scalable codec partitions the DCT coefficients of the DFD (or the intensity for intra blocks) into a base layer and one or more enhancement layers. The base layer is constructed by subtracting a value from each quantized DCT coefficient. The subtracted values are then sent as enhancement. If more than two scalable layers are required, the values subtracted for the creation of the base layer are further broken into other values. The partitioning of the DCT coefficients into layers is accomplished by formulating a constrained optimization …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:J_g5lzvAfSwC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Distortion-aware joint scheduling and resource allocation for wireless video transmission",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6811478/",
            "Abstract": "The performance of Direct Sequence Code Division Multiple Access (DS-CDMA) based systems highly depends on the interference caused by multiple transmissions. Interference reduction may result by using time scheduling of the transmitting nodes and by allocating accordingly the power level, and the source and channel coding rate for each node. In this work, we study the joint intra-cell scheduling and resource allocation for wireless video transmission in a hybrid DS-CDMA over Time Division Multiple Access (TDMA) network. We examine the case according to which a subset of the network nodes are able to simultaneously transmit (at the same time slot). The key issue is to jointly select the subset of the nodes for transmission per time slot and to allocate the available resources so that a function of the end-to-end video distortion of each node over a time frame is minimized. The experimental results show that …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:q3oQSFYPqjQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improved Temporal Pooling for Perceptual Video Quality Assessment Using VMAF",
            "Publication year": 2020,
            "Publication url": "https://www.ingentaconnect.com/content/ist/ei/2020/00002020/00000011/art00002",
            "Abstract": "The Video Multimethod Assessment Fusion (VMAF) method, proposed by Netflix, offers an automated estimation of perceptual video quality for each frame of a video sequence. Then, the arithmetic mean of the per-frame quality measurements is taken by default, in order to obtain an estimate of the overall Quality of Experience (QoE) of the video sequence. In this paper, we validate the hypothesis that the arithmetic mean conceals the bad quality frames, leading to an overestimation of the provided quality. We also show that the Minkowski mean (appropriately parametrized) approximates well the subjectively measured QoE, providing superior Spearman Rank Correlation Coefficient (SRCC), Pearson Correlation Coefficient (PCC), and Root-Mean-Square-Error (RMSE) scores.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:vDijr-p_gm4C",
            "Publisher": "Society for Imaging Science and Technology"
        },
        {
            "Title": "Joint optimal pilot placement and space frequency (SF) code design for MIMO-OFDM systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4600065/",
            "Abstract": "In this paper, we propose an optimal power allocation scheme for joint pilot placement and space frequency (SF) code design for multiple input multiple output orthogonal frequency division multiplexing (MIMO-OFDM) wireless channels. OFDM is combined with multiple antennas to increase data diversity gain on a time varying multipath fading channel, resulting in a MIMO-OFDM system. A set of fast time-varying and frequency-selective fading channels is considered. The proposed pilot assisted transmission scheme multiplexes known symbols with information bearing data to estimate the channel in the presence of inter symbol interference (ISI). The channel is assumed to be unchanged for the duration of one OFDM block and change independently from one OFDM block to the other. The number of pilot symbols for each OFDM block is held constant and the symbols are dispersed throughout the block for efficient …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the use of clustering for resource allocation in wireless visual sensor networks",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8305/83050S/On-the-use-of-clustering-for-resource-allocation-in-wireless/10.1117/12.908743.short",
            "Abstract": "The present study is focused on the problem of quality-driven cross-layer optimization of Direct Sequence Code Division Multiple Access (DS-CDMA) Wireless Visual Sensor Networks (WVSNs). We consider a centralized topology where each sensor transmits directly to a Centralized Control Unit (CCU), which manages the network resources. In real environments, the visual sensors view and transmit scenes with varying amount of motion. Thus, each recorded video has its individual motion characteristics. Our aim is to enable the CCU to jointly allocate the transmission power and source-channel coding rates for each WVSN node under certain quality- driven criteria and constant chip rate. We consider two approaches for the cross-layer optimization scheme. In the first, the optimal set of network resources is assigned to each node according to its individual motion characteristics. In the second approach, the nodes …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:lSLTfruPkqcC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "New scaling coefficients for biorthogonal filter to control distortion variation in 3D wavelet based video coding",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4106919/",
            "Abstract": "In 3D based wavelet video coders that use longer filters, the PSNR of the reconstructed frames within a GOF varies significantly. This distortion variation is not directly related to the motion in the video sequence as in the case of hybrid video coding schemes. The paper focuses on the problem of controlling erratic variation of distortion in 3D coders. The wavelet filter properties are explored and scaling coefficients for the wavelet filter is calculated with the objective of smoothening the temporal PSNR. The biorthogonal 5/3 wavelet filter is considered in this paper and experimental results are presented for 2D+t and t+2D wavelet coders.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power-aware QoS enhancement in multihop DS-CDMA visual sensor networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6622748/",
            "Abstract": "We propose a quality-driven method for network resource allocation with transmission power control in a multihop Direct Sequence Code Division Multiple Access (DS-CDMA) Wireless Visual Sensor Network (WVSN). A multihop WVSN typically consists of source nodes that monitor different areas and relay nodes that retransmit recorded scenes. In order to achieve the best possible video quality at the receiver while consuming the least possible transmission power, we propose a joint optimization scheme that allocates the available resources among the nodes with respect to the imposed constraints. Moreover, we formulate a weighted bi-objective optimization problem and study the tradeoff between video quality and consumed transmission power. The simulation demonstrate that excessive transmission power is used when power control is omitted for a rather small quality gain for certain nodes.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Approximate equiangular tight frames for compressed sensing and CDMA applications",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1186/s13634-017-0501-0",
            "Abstract": "Performance guarantees for recovery algorithms employed in sparse representations, and compressed sensing highlights the importance of incoherence. Optimal bounds of incoherence are attained by equiangular unit norm tight frames (ETFs). Although ETFs are important in many applications, they do not exist for all dimensions, while their construction has been proven extremely difficult. In this paper, we construct frames that are close to ETFs. According to results from frame and graph theory, the existence of an ETF depends on the existence of its signature matrix, that is, a symmetric matrix with certain structure and spectrum consisting of two distinct eigenvalues. We view the construction of a signature matrix as an inverse eigenvalue problem and propose a method that produces frames of any dimensions that are close to ETFs. Due to the achieved equiangularity property, the so obtained frames can be …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:tKAzc9rXhukC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Robust transmission of packet-based H. 264/AVC video with data partitioning over DS-CDMA wireless channels",
            "Publication year": 2006,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6077/607725/Robust-transmission-of-packet-based-H264-AVC-video-with-data/10.1117/12.643591.short",
            "Abstract": "In this paper, we address the problem of robust transmission of packet based H.264/AVC video over direct sequence-code division multiple access (DS-CDMA) channels. H.264 based data partitioning is used to produce video packets of unequal importance with regards to their need in terms of the decoded video quality. In the proposed transmission system, the data partitioned video packets are packetized as per IP/UDP/RTP protocol stack and are sorted into different levels for giving unequal error protection (UEP) using Rate Compatible Punctured Convolutional (RCPC) codes. Constant size framing is done at the link layer and Cyclic Redundancy Check header (CRC) is attached for error detection. Link layer buffering and packet interleaving schemes are proposed to improve the efficiency of the system. A multipath Rayleigh fading channel with Additive White Gaussian Noise (AWGN) and interference from other …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:vV6vV6tmYwMC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "An EM Based Resolution Enhancement Algorithm Considering Partially Known Point Spread Function",
            "Publication year": 2004,
            "Publication url": "http://www.cs.uoi.gr/~lkon/papers/WNY_04b.pdf",
            "Abstract": "In this paper, we propose a resolution enhancement algorithm based on the Expectation Maximization (EM) framework. The objective of resolution enhancement (super-resolution) is to reconstruct a high-resolution image from a sequence of lowresolution (LR) images, under the assumption that there exists subpixel motion between the low-resolution frames. EM based image restoration has been studied in previous work, while its results can not be directly applied to the resolution enhancement scenario because of the subsampling (decimation) process in the acquisition model. This leads to a non-square degradation matrix which is not circulant as in the restoration case and hence cannot be diagonalized and operated on by the EM algorithm in the frequency domain. To overcome this difficulty, we propose to reorganize and interlace the low-resolution frames to construct an interlaced image using the registration parameters. This interlaced image is equivalent to a uniform blur process of the PSF blurred image. Now the resolution enhancement problem reduces to a restoration problem with two low-pass filters to deblur: one is the blur due to the point spread function (PSF) of the optical lens, and the other the uniform blur due to the decimation matrix. EM based restoration algorithm is thus computed efficiently in the frequency domain, considering the inaccurate estimate of the PSF and unknown power spectrum of both the high-resolution image and noise. Simulations using synthetic images are implemented to verify the proposed algorithm and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Shape error concealment based on a shape-preserving boundary approximation",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6177257/",
            "Abstract": "In object-based video representation, video scenes are composed of several arbitrarily shaped video objects (VOs), defined by their texture, shape and motion. In error-prone communications, packet loss results in missing information at the decoder. The impact of transmission errors is minimized through error concealment. In this paper, we propose a spatial error concealment technique for recovering lost shape data. We consider a geometric shape representation consisting of the object boundary, which can be extracted from the α-plane. Missing macroblocks result in a broken boundary. A B-spline curve is constructed to replace a missing boundary segment, based on a T-spline representation of the received boundary. We use T-splines because they produce shape-preserving approximations and do not change the characteristics of the original boundary. The representation ensures a good estimation of the first …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable video transmission over wireless DS-CDMA channels using minimum TSC spreading codes",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1336838/",
            "Abstract": "In this letter, we report results on the relative performance of scalable video transmission via a single-rate or a multirate direct sequence code-division multiple-access channel using minimum total squared correlation spreading codes. Our findings demonstrate the superiority of the multirate system on a wide range of chip rates of practical interest.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Shape encoding for edge map image compression",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7351063/",
            "Abstract": "A method for the efficient encoding and decoding of a shape with application to edge map image compression is proposed. The method relies on the modeling of the manifold of a shape by line segments. Then, encoding is performed by collecting the characteristic features of each line segment, namely the starting and ending points and the number of points contributing to the computation of the corresponding segment. The reconstruction of the shape may be obtained by uniform sampling of points from each line segment computed in the encoding process. Experimental analysis demonstrates that in case of employing a robust and efficient line segment detection algorithm, the proposed encoding/decoding scheme exhibits high compression rates, compared to widely used lossless compression methods, while providing low distortion values.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Video Error Resilience and Error Concealment",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8043251/",
            "Abstract": "This chapter contains sections titled:    Introduction   Error Resilience   Channel Coding   Error Concealment   Error Resilience Features of H.264/AVC   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Optimal power allocation and joint source-channel coding for wireless DS-CDMA visual sensor networks",
            "Publication year": 2011,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/7882/788206/Optimal-power-allocation-and-joint-source-channel-coding-for-wireless/10.1117/12.872415.short",
            "Abstract": "In this paper, we propose a scheme for the optimal allocation of power, source coding rate, and channel coding rate for each of the nodes of a wireless Direct Sequence Code Division Multiple Access (DS-CDMA) visual sensor network. The optimization is quality-driven, i.e. the received quality of the video that is transmitted by the nodes is optimized. The scheme takes into account the fact that the sensor nodes may be imaging scenes with varying levels of motion. Nodes that image low-motion scenes will require a lower source coding rate, so they will be able to allocate a greater portion of the total available bit rate to channel coding. Stronger channel coding will mean that such nodes will be able to transmit at lower power. This will both increase battery life and reduce interference to other nodes. Two optimization criteria are considered. One that minimizes the average video distortion of the nodes and one that …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:8AbLer7MMksC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "3D based video coding in the overcomplete discrete wavelet transform domain with reduced delay requirements",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1530371/",
            "Abstract": "In this work, we propose a new temporal filter set to minimize delay in 3D wavelet based video coding, which gives a performance at par with existing longer filters. Our filter set will not have any boundary effects at the group of frames (GOF). The length of the GOF can vary from five to any number of frames depending on delay requirements. We also propose a novel technique of assigning priorities to temporal subbands at different levels to control distortion fluctuation inside a GOF. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable Video Transmission Over Multi-Rate Multiple Access Channels",
            "Publication year": 2007,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA470529",
            "Abstract": "This effort demonstrated the interference mitigation capabilities of the auxiliary vector AV receiver for video transmission over direct-sequence code division multiple access DS-CDMA systems. The proposed receiver design is compared to the conventional RAKE matched-filter RAKE-MF and sample-matrix-inversion minimum-variance-distortionless-response SMI-MVDR receivers. The DS-CDMA video data stream is transmitted over an RF channel under realistic Rayleigh-faded multipath channel conditions, emulating open andor urban battlefield environments.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:RYcK_YlVTxYC",
            "Publisher": "STATE UNIV OF NEW YORK AT BUFFALO AMHERST RESEARCH FOUNDATION"
        },
        {
            "Title": "Construction of incoherent unit norm tight frames with application to compressed sensing",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6748087/",
            "Abstract": "Despite the important properties of unit norm tight frames (UNTFs) and equiangular tight frames (ETFs), their construction has been proven extremely difficult. The few known techniques produce only a small number of such frames while imposing certain restrictions on frame dimensions. Motivated by the application of incoherent tight frames in compressed sensing (CS), we propose a methodology to construct incoherent UNTFs. When frame redundancy is not very high, the achieved maximal column correlation becomes close to the lowest possible bound. The proposed methodology may construct frames of any dimensions. The obtained frames are employed in CS to produce optimized projection matrices. Experimental results show that the proposed optimization technique improves CS signal recovery, increasing the reconstruction accuracy. Considering that the UNTFs and ETFs are important in sparse …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Jointly optimal coding of texture and shape",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958059/",
            "Abstract": "A major problem in object oriented video coding and MPEG-4 is the encoding of object boundaries. Traditionally, and within MPEG-4, the encoding of shape and texture information are separate steps (the extraction of shape is not considered by the standards). We present a vertex-based shape coding method which is optimal in the operational rate-distortion sense and takes into account the texture information of the video frames. This is accomplished by utilizing a variable-width tolerance band which is proportional to the degree of trust in the accuracy of the shape information at that location. Thus, in areas where the confidence in the estimation of the boundary is not high and/or coding errors in the boundary will not affect the application (object oriented coding, MPEG-4, etc.) significantly, a larger boundary approximation error is allowed. We present experimental results which demonstrate the effectiveness of the …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Content Analysis for Communications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8041501/",
            "Abstract": "This chapter contains sectins titled:    Introduction   Content Analysis   Content‐Based Video Representation   Content‐Based Video Coding and Communications   Content Description and Management   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:738O_yMBCRsC",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Improved temporal filtering scheme to reduce delay and distortion fluctuation in 3-D wavelet based video coding",
            "Publication year": 2005,
            "Publication url": "http://www.cs.uoi.gr/~lkon/papers/WNY_05a.pdf",
            "Abstract": "In this work, we propose a new 3D temporal filter set that modifies the existing temporal filter structure, to achieve minimum delay and improve compression efficiency. The modified temporal filter set does not have any constraints on group of frame (GOF) size and it can be processed independently without using future or past GOFs. The proposed filter will not exhibit any boundary effects and has less distortion fluctuation.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Maximizing user utility in video streaming applications",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1186530/",
            "Abstract": "We study some of the design tradeoffs of video streaming systems in networks with QoS guarantees. We approach this problem by using a utility function to quantify the benefit a user derives from the quality of the received video sequence. We also consider the cost to the network user for streaming the video sequence. We have formulated this utility maximization problem as a joint constrained optimization problem where we maximize the difference between the utility and the network cost, subject to the constraint that the decoder buffer does not underflow. In this manner, we can find the optimal tradeoff between video quality and network cost. We present a deterministic dynamic programming approach for both the constant bit rate and renegotiated constant bit rate service classes. Experimental results demonstrate the benefits and the performance of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rate-distortion optimized video transmission over DS-CDMA channels with auxiliary vector filter single-user multirate detection",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4350306/",
            "Abstract": "In this paper, we consider the rate-distortion optimized resource allocation for video transmission over multi-rate wireless direct-sequence code-division-multiple-access (DS-CDMA) channels. We consider the performance of transmitting scalable video over a multipath Rayleigh fading channel via a combination of multi-code multirate CDMA and variable sequence length multirate CDMA channel system. At the receiver, despreading is done using adaptive space-time auxiliary-vector (AV) filters. We propose a new interference cancelling design that uses just a single AV filter for single-user mutirate despreading. Our experimental results show that the proposed interference cancelling design has excellent performance in scalable video transmission over DS-CDMA systems that use a combination of multicode multirate and variable processing gain multirate CDMA. The proposed design takes advantage of the fact …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Images of the Athenian Sun: Highlights From ICIP 2018 in Greece [Conference Highlights]",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8700670/",
            "Abstract": "104 IEEE SIgnal ProcESSIng MagazInE| May 2019| enjoyed a fine technical program, put together with the help of an outstanding technical program committee. The program included nine tutorials and five special sessions, which focused on emerging research areas. The technical program comprised 127 sessions arranged in thematic streams to avoid thematic overlaps and allow audience members to attend more sessions in their areas of interest. Sessions were very well attended, despite the competition from the food buffet, which remained well stocked throughout the conference. The conference offered three plenary talks on topics of great interest to our community, covering both academic and industrial trends. The plenary talks, enthusiastically received by ICIP attendees, were given by prominent scientists.■ C.-C. Jay Kuo, from the University of Southern California, shed light on the underlying operational …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:EkHepimYqZsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint source-channel coding for motion-compensated DCT-based SNR scalable video",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1036052/",
            "Abstract": "In this paper, we develop an approach toward joint source-channel coding for motion-compensated DCT-based scalable video coding and transmission. A framework for the optimal selection of the source and channel coding rates over all scalable layers is presented such that the overall distortion is minimized. The algorithm utilizes universal rate distortion characteristics which are obtained experimentally and show the sensitivity of the source encoder and decoder to channel errors. The proposed algorithm allocates the available bit rate between scalable layers and, within each layer, between source and channel coding. We present the results of this rate allocation algorithm for video transmission over a wireless channel using the H.263 Version 2 signal-to-noise ratio (SNR) scalable codec for source coding and rate-compatible punctured convolutional (RCPC) codes for channel coding. We discuss the …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Perceptual quality estimation of H. 264/AVC videos using reduced-reference and no-reference models",
            "Publication year": 2016,
            "Publication url": "https://www.spiedigitallibrary.org/journals/journal-of-electronic-imaging/volume-25/issue-5/053012/Perceptual-quality-estimation-of-H264-AVC-videos-using-reduced-reference/10.1117/1.JEI.25.5.053012.short",
            "Abstract": "Reduced-reference (RR) and no-reference (NR) models for video quality estimation, using features that account for the impact of coding artifacts, spatio-temporal complexity, and packet losses, are proposed. The purpose of this study is to analyze a number of potentially quality-relevant features in order to select the most suitable set of features for building the desired models. The proposed sets of features have not been used in the literature and some of the features are used for the first time in this study. The features are employed by the least absolute shrinkage and selection operator (LASSO), which selects only the most influential of them toward perceptual quality. For comparison, we apply feature selection in the complete feature sets and ridge regression on the reduced sets. The models are validated using a database of H.264/AVC encoded videos that were subjectively assessed for quality in an ITU-T …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:ZuybSZzF8UAC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Low-delay low-complexity bandwidth-constrained wireless video transmission using SVC over MIMO systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4689311/",
            "Abstract": "We propose an efficient strategy for the transmission of scalable video over multiple-input multiple-output (MIMO) wireless systems. In this paper, we use the latest scalable H.264 codec (SVC), which provides combined temporal, quality and spatial scalability. At the transmitter, we estimate the decoded video distortion for given channel conditions taking into account the effects of quantization, packet loss and error concealment. The proposed scalable decoder distortion algorithm offers low delay and low complexity. The performance of this method is validated using experimental results. In our proposed system, we use a MIMO system with orthogonal space-time block codes (O-STBC) that provides spatial diversity and guarantees independent transmission of different symbols within the block code. The bandwidth constrained allocation problem considered here is simplified and solved for one O-STBC symbol at a …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable H. 264 wireless video transmission using quasi-orthogonal space-time block codes",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4517707/",
            "Abstract": "We propose a low-delay low-complexity end-to-end video transmission system that integrates the latest scalable H.264 codec and the full-rate full-diversity quasi-orthogonal space-time block codes. At the encoder of the scalable H.264 codec, we have developed a low-delay low-complexity method for the estimation of the video distortion at the receiver for given channel conditions. The distortion estimation algorithm is validated using experimental results. In this work, we show clearly the advantage of using the quasi-orthogonal space-time block codes (STBC), which provide a higher rate compared to the orthogonal space-time block codes in a wireless video transmission system. This is in spite of the use of a non-optimal signal constellation structure. The performance results are obtained after addressing the bandwidth allocation problem that employs the scalable decoder distortion estimation algorithm for the …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network-wide md and network coding for heterogeneous video multicast",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6666770/",
            "Abstract": "Multiple Description coding (MD) has been proved to be very efficient for video multicast over random networks when combined with network coding. However, in the case where heterogeneous receivers are present in the network, the impact of the method is bounded by the fact that the solution to the inherent rate allocation problem is based on a compromise between low and high bandwidth receivers. To tackle this problem, we propose a novel video multicast scheme that enhances the combination of MD and network coding with a mechanism that allows all intermediate nodes to actively participate in MD coding by adjusting the size of the video descriptions. In this way, it is possible to tune the rate of the transmitted video stream in order to meet the needs of each receiver. The proposed method significantly improves the quality of the video delivered to all the receivers in the network, regardless of their …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Locally optimum detection for additive watermarking in the DCT and DWT domains through non-Gaussian distributions",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6622794/",
            "Abstract": "This work presents a new locally optimal blind detector for the additive transform-based image watermarking problem. Working in non-Gaussian environments, we introduce a new statistical model and its consequent application in the design of a locally optimum detection test. More specifically, we model the marginal distributions of the detail subband coefficients of DWT (Discrete Wavelet Transform) or DCT (Discrete Cosine Transform) with Student-t distribution. Since the watermark signal has low power, locally most powerful (LMP) detector is a valid choice. The experimental results show that the proposed detector has superior performance than alternative LMP detectors based on known state of the art statistical models.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:1qzjygNMrQYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint rate distortion optimal shape and texture coding",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1345245/",
            "Abstract": "In this paper, the problem of joint shape and texture coding in video compression is considered. The shape is approximated using polygons or higher order curves. The texture is encoded using the shape adaptive discrete cosine transform (SA-DCT). The solution is optimal in the operational rate distortion sense i.e. given a coding setup, the solution will guarantee the smallest possible total rate for a given distortion for both shape and texture coding or the smallest possible distortion for a given rate. Both a fixed-width and a variable width distortion band for shape coding were considered. The variable width of the distortion band is a function of the texture profile i.e. the width is inversely proportional to the magnitude of the image gradient. We present experimental results using the \"Kids\" and \"Bream\" sequences.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distortion fluctuation control for 3D wavelet-based video coding",
            "Publication year": 2006,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6077/607721/Distortion-fluctuation-control-for-3D-wavelet-based-video-coding/10.1117/12.643332.short",
            "Abstract": "In this work, we propose a method to control distortion fluctuation in 3D wavelet based video coding. A novel technique of assigning priorities to temporal subbands at different levels are used to smoothen the temporal PSNR. The wavelet filter properties are explored and an optimum criterion is derived to reduce the distortion fluctuation.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:r0BpntZqJG4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Optimal power allocation and joint source-channel coding for wireless DS-CDMA visual sensor networks using the Nash bargaining solution",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5946952/",
            "Abstract": "We consider the problem of resource allocation for a Direct Sequence Code Division Multiple Access (DS-CDMA) wireless visual sensor network (VSN). We use the Nash Bargaining Solution (NBS) from game theory in order to determine the transmission power and source and channel coding rate for each node. The NBS assumes that the nodes negotiate (using the help of a centralized control unit) in order to jointly determine their transmission parameters. The transmission powers are allowed to take continuous values, whereas the source and channel coding rate combination can only assume discrete values. Thus, the resulting optimization problem is a mixed-integer optimization task and is solved using Particle Swarm Optimization (PSO). Experimental results are provided and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A fully robust framework for MAP image super-resolution",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6467337/",
            "Abstract": "In this work, we propose an adaptive M-estimation scheme for robust image super-resolution. The proposed algorithm relies on a maximum a posteriori (MAP) framework and addresses the presence of outliers in the low resolution images. Moreover, apart from the robust estimation of the high resolution image, the contribution of the method is twofold: (i) the robust computation of the regularization parameters controlling the relative strength of the prior with respect to the data fidelity term and (ii) the robust estimation of the optimal step size in the update of the high resolution image. Experimental results demonstrate that integrating these estimations into a robust framework leads to significant improvement in the accuracy of the high resolution image.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust Interference Mitigation and Spread Spectrum Signaling",
            "Publication year": 2006,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA444129",
            "Abstract": "Transmission of direct-sequence code-division multiple access, DS-CDMA, video data streams over an actual RF channel environment with Rayleigh fading is studied to validate the superiority of auxiliary-vector, AV, filters over other filters. The AV filter is used at the receiver since it is known to outperform other filtering techniques in rapidly changing environments, where only a small data record size is available.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:pqnbT2bcN3wC",
            "Publisher": "STATE UNIV OF NEW YORK AT BUFFALO DEPT OF ELECTRICAL ENGINEERING"
        },
        {
            "Title": "DWT-based additive image watermarking using the Student-t prior",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6123147/",
            "Abstract": "In this work, a class of new blind watermark detectors is proposed for the DWT (Discrete Wavelet Transform)-based additive image watermarking problem. More specific, we model the marginal subband wavelet distributions with the Student-t probability density function (pdf) deriving a new watermark detector. The proposed detector shows high performance with regard to the watermark detection and increased robust properties against intentional or unintentional attacks. Experimental results on real images demonstrate these properties comparing the proposed detector with other state of the art methods in the transform domain.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quality optimization of H. 264/AVC video transmission over noisy environments using a sparse regression framework",
            "Publication year": 2015,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9410/94100D/Quality-optimization-of-H264-AVC-video-transmission-over-noisy-environments/10.1117/12.2077243.short",
            "Abstract": "We propose the use of the Least Absolute Shrinkage and Selection Operator (LASSO) regression method in order to predict the Cumulative Mean Squared Error (CMSE), incurred by the loss of individual slices in video transmission. We extract a number of quality-relevant features from the H.264/AVC video sequences, which are given as input to the LASSO. This method has the benefit of not only keeping a subset of the features that have the strongest effects towards video quality, but also produces accurate CMSE predictions. Particularly, we study the LASSO regression through two different architectures; the Global LASSO (G.LASSO) and Local LASSO (L.LASSO). In G.LASSO, a single regression model is trained for all slice types together, while in L.LASSO, motivated by the fact that the values for some features are closely dependent on the considered slice type, each slice type has its own regression model, in …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:Y5dfb0dijaUC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "AVC/H. 264 Application–Digital TV",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8043558/",
            "Abstract": "This chapter contains sections titled:    Introduction   Random Access   Bitstream Splicing   Trick Modes   Carriage of AVC/H.264 Over MPEG‐2 Systems   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Game-theoretic solutions through intelligent optimization for efficient resource management in wireless visual sensor networks",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0923596514000368",
            "Abstract": "We propose a quality-driven cross-layer optimization scheme for wireless direct sequence code division multiple access (DS-CDMA) visual sensor networks (VSNs). The scheme takes into account the fact that different nodes image videos with varying amounts of motion and determines the source coding rate, channel coding rate, and power level for each node under constraints on the available bit rate and power. The objective is to maximize the quality of the video received by the centralized control unit (CCU) from each node. However, since increasing the power level of one node will lead to increased interference with the rest of the nodes, simultaneous maximization of the video qualities of all nodes is not possible. In fact, there are an infinite number of Pareto-optimal solutions. Thus, we propose the use of the Nash bargaining solution (NBS), which pinpoints one of the infinite Pareto-optimal solutions, based on …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:XiVPGOgt02cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Choice of threshold of the Huber-Markov prior in map-based video resolution enhancement",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1345235/",
            "Abstract": "The MAP (maximum a posteriori) -based resolution enhancement technique with Huber-Markov random field (HMRF) as the image prior has been proposed in the literature, and better preserves image discontinuities when compared with a Gaussian prior model. The reconstruction relies on the choice of Huber function parameter, or threshold T. There is no explicit selection of T in the previous studies. In this paper, we propose a method for choosing the threshold of the HMRF image prior in MAP based resolution enhancement. The method is based on the fact that the threshold T of the Huber function in the HMRF image priors is physically the trade-off between high-frequency components and low-frequency components for imagery data. High-pass filtering using the discrete Laplacian kernel along with the Huber function is used as the smoothness measure. When the high-passed value is less than T, the measure …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless Video Streaming",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8043442/",
            "Abstract": "This chapter contains sections titled:    Introduction   Streaming System Architecture   Delay‐Constrained Retransmission   Considerations for Wireless Video Streaming   P2P Video Streaming   References  ",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:VLnqNzywnoUC",
            "Publisher": "Wiley Telecom"
        },
        {
            "Title": "Video Telephony",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/047134608X.W1919",
            "Abstract": "The sections in this article are",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:u_35RYKgDlwC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "MAP based resolution enhancement of video sequences using a Huber-Markov random field image prior model",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1246836/",
            "Abstract": "In this paper, we propose two approaches for video sequence resolution enhancement using maximum a posteriori (MAP) estimation. Huber-Markov random fields (HMRF) are used as prior models. These models can better preserve image discontinuities (edges) when compared with Gaussian prior models. The two proposed approaches differ in the selection of image smoothness measure. The first approach employs a measure that is based on a discrete Laplacian kernel, while the second approach uses a finite difference approximation of second order derivatives at each pixel of the high-resolution image estimate. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A super-resolution technique with motion estimation considering atmospheric turbulence",
            "Publication year": 2005,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5789/0000/A-super-resolution-technique-with-motion-estimation-considering-atmospheric-turbulence/10.1117/12.603918.short",
            "Abstract": "Image registration is a crucial part of the success of the super-resolution algorithms. In real applications, atmospheric turbulence is an important factor that brings further degradation to the low-resolution image sequence (video frames), besides other degradations such as global motion due to movement of the optical device, blurring due to the point spread function of the lens, and blurring due to the finite size of the detector array. In this paper, the degradation of the atmospheric turbulence to the low-resolution images is modeled as per-pixel motion in the high-resolution plane and is assumed to be spatially local and temporally quasi-periodic. The registration is a two-stage process: first, the global motion between frames is estimated using the phase-correlation method to remove \"jitter\" and stabilize the sequence; then, an optical flow method with quasi-periodic constraint is used to estimate the per-pixel motion. A …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:-f6ydRqryjwC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Scalable video transmission over multirate GMC-CDMA wireless channels",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1415400/",
            "Abstract": "We consider the problem of video transmission over wireless generalized multicarrier code division multiple access (GMC-CDMA) systems. Such systems offer deterministic elimination of multiple access interference (MAI). A scalable video source codec is used and a multirate setup is assumed, i.e., each video user is allowed to occupy more than one GMC-CDMA channel. Furthermore, each of these channels can utilize a different number of subcarriers. We solve an optimization problem to determine the source coding and channel coding rates for the user of interest, as well as the number of subcarriers for each GMC-CDMA channel. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New Temporal Filtering Scheme to Reduce Delay in Wavelet-Based Video Coding",
            "Publication year": 2007,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/10938",
            "Abstract": "Repository of UOI \"Olympias\": New Temporal Filtering Scheme to Reduce Delay in Wavelet-Based \nVideo Coding Skip navigation Home Browse Communities & Collections Browse Items by: \nIssue Date Author Title Subject Item Type Advanced Search Help About DSpace Sign on to: My \nDSpace Receive email updates Edit Profile Saved Searches Favorites Repository of UOI \n\"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Θετικών Επιστημών \n4.Τμήμα Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής 5.Άρθρα σε επιστημονικά \nπεριοδικά ( Ανοικτά) Ελληνικά English Please use this identifier to cite or link to this item: \nhttps://olympias.lib.uoi.gr/jspui/handle/123456789/10938 Institution and School/Department of \nsubmitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Θετικών Επιστημών. Τμήμα Μηχανικών Ηλεκτρονικών \nΥπολογιστών και Πληροφορικής URI: https://olympias.lib.uoi.gr/jspui/handle//10938 in -…",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality variation control for three-dimensional wavelet-based video coders",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2007/83068.pdf",
            "Abstract": "The fluctuation of quality in time is a problem that exists in motion-compensated-temporal-filtering (MCTF-) based video coding. The goal of this paper is to design a solution for overcoming the distortion fluctuation challenges faced by wavelet-based video coders. We propose a new technique for determining the number of bits to be allocated to each temporal subband in order to minimize the fluctuation in the quality of the reconstructed video. Also, the wavelet filter properties are explored to design suitable scaling coefficients with the objective of smoothening the temporal PSNR. The biorthogonal 5/3 wavelet filter is considered in this paper and experimental results are presented for 2D+t and t+2D MCTF wavelet coders.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Comparison of digital image resolution enhancement techniques",
            "Publication year": 2002,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4719/0000/Comparison-of-digital-image-resolution-enhancement-techniques/10.1117/12.477443.short",
            "Abstract": "In this paper, we compare two resolution enhancement techniques. The first technique is based on Maximum A Posteriori (MAP) estimation while the second technique performs Temporal Accumulation of Registered Image Data (TARID) followed by Wiener filtering. Both techniques and described and the merits of each one are discussed. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:ULOm3_A8WrAC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Resource allocation in visual sensor networks using a reinforcement learning framework",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6622817/",
            "Abstract": "In recent years, video delivery over wireless visual sensor networks (VSNs) has gained increasing attention. The lossy compression and channel errors that occur during wireless multimedia transmissions can degrade the quality of the transmitted video sequences. This paper addresses the problem of cross-layer resource allocation among the nodes of a wireless direct-sequence code division multiple access (DS-CDMA) VSN. The optimal group of pictures (GoP) length during the encoding process is also considered, based on the motion level of each video sequence. Three optimization criteria that optimize a different objective function of the video qualities of the nodes are used. The nodes' transmission parameters, i.e., the source coding rates, channel coding rates and power levels can only take discrete values. In order to tackle the resulting optimization problem, a reinforcement learning (RL) strategy that …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel cumulative distortion metric and a no-reference sparse prediction model for packet prioritization in encoded video transmission",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7532728/",
            "Abstract": "In this paper we propose a new quality metric to estimate the impact of packet loss on the perceptual quality of encoded video sequences transmitted over error-prone networks. The proposed metric, henceforth referred to as Cumulative Distortion using Structural Similarity (CDSSIM), quantifies the overall structural distortion resulting from bidirectional error propagation in predictively coded, motion compensated videos. Furthermore, we present a No-Reference (NR) sparse regression model to predict the proposed CDSSIM metric using pre-defined features associated with slice loss. The Least Absolute Shrinkage and Selection Operator (LASSO) method is applied for two resolution formats with features extracted solely from the encoded bit-stream. Standardized statistical performance measures show that the model can predict the cumulative distortion to a high degree of accuracy. We further evaluate the results …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:N5tVd3kTz84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Use of tight frames for optimized compressed sensing",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6334128/",
            "Abstract": "Compressed sensing (CS) theory relies on sparse representations in order to recover signals from an undersampled set of measurements. The sensing mechanism is described by the projection matrix, which should possess certain properties to guarantee high quality signal recovery, using efficient algorithms. Although the major breakthrough in compressed sensing results is obtained for random matrices, recent efforts have shown that CS performance could be improved with optimized non-random projections. Designing matrices that satisfy CS theoretical requirements is closely related to the construction of equiangular tight frames, a problem that has applications in various scientific fields like sparse approximations, coding, and communications. In this paper, we employ frame theory and propose an algorithm for the optimization of the projection matrix that improves sparse signal recovery.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A regularization framework for joint blur estimation and super-resolution of video sequences",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1530395/",
            "Abstract": "In traditional digital image restoration, the blurring process of the optic is assumed known. Many previous research efforts have been trying to reconstruct the degraded image or video sequence with either partially known or totally unknown point spread function (PSF) of the optical lens, which is commonly called the blind deconvolution problem. Many methods have been proposed in the application to image restoration. However, little work has been done in the super-resolution scenario. In this paper, we propose a generalized framework of regularized image/video iterative blind deconvolution / super-resolution (IBD-SR) algorithm, using some information from the more matured blind deconvolution techniques from image restoration. The initial estimates for the image restoration help the iterative image/video super-resolution algorithm converge faster and be stable. Experimental results are presented and …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint source-channel coding for scalable video",
            "Publication year": 2000,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/3974/0000/Joint-source-channel-coding-for-scalable-video/10.1117/12.382965.short",
            "Abstract": "An approach towards joint source-channel coding for wireless video transmission at low bit rates is proposed. An SNR scalable video coder is used and a different amount of error protection is allowed for each scalable layer. Our problem is to allocate the available bit rate across scalable layers and, within each layer, between source and channel coding, while minimizing the end-to-end distortion of the received video sequence. The distortion is due to both source coding (quantization) errors and channel noise errors, and is measured in terms of the Mean Squared Error (MSE). The optimization algorithm utilizes rate-distortion characteristic plots. These plots show the contribution of each layer to the total distortion as a function of the source rate of the layer and the residual bit error rate (the error rate that remains after the use of channel coding). The plots are obtained experimentally using representative video …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:UebtZRa9Y70C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Robust maximum a posteriori image super-resolution",
            "Publication year": 2014,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Journal-of-Electronic-Imaging/volume-23/issue-4/043016/Robust-maximum-a-posteriori-image-super-resolution/10.1117/1.JEI.23.4.043016.short",
            "Abstract": "A global robust M-estimation scheme for maximum a posteriori (MAP) image super-resolution which efficiently addresses the presence of outliers in the low-resolution images is proposed. In iterative MAP image super-resolution, the objective function to be minimized involves the highly resolved image, a parameter controlling the step size of the iterative algorithm, and a parameter weighing the data fidelity term with respect to the smoothness term. Apart from the robust estimation of the high-resolution image, the contribution of the proposed method is twofold: (1) the robust computation of the regularization parameters controlling the relative strength of the prior with respect to the data fidelity term and (2) the robust estimation of the optimal step size in the update of the high-resolution image. Experimental results demonstrate that integrating these estimations into a robust framework leads to significant improvement in …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:WA5NYHcadZ8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Spread spectrum visual sensor network resource management using an end-to-end cross-layer design",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5599303/",
            "Abstract": "In this paper, we propose an approach to manage network resources for a direct sequence code division multiple access (DS-CDMA) visual sensor network where nodes monitor scenes with varying levels of motion. It uses cross-layer optimization across the physical layer, the link layer, and the application layer. Our technique simultaneously assigns a source coding rate, a channel coding rate, and a power level to all nodes in the network based on one of two criteria that maximize the quality of video of the entire network as a whole, subject to a constraint on the total chip rate. One criterion results in the minimal average end-to-end distortion amongst all nodes, while the other criterion minimizes the maximum distortion of the network. Our experimental results demonstrate the effectiveness of the cross-layer optimization.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New temporal filtering scheme to reduce delay in wavelet-based video coding",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4358844/",
            "Abstract": "Scalability is an important desirable property of video codecs. Wavelet-based motion-compensated temporal filtering provides the most powerful scheme for scalable video coding and provides high-compression efficiency that competes with the current state of art codecs. However, the delay introduced by the temporal filtering schemes is sometimes very high, which makes them unsuitable for many real-time applications. In this paper, we propose a new temporal filter set to minimize delay in 3D wavelet-based video coding. The new filter set gives a performance at par with existing longer filters. The length of the filter can vary from two to any number of frames depending on delay requirements. If the frames are processed as separate groups of frames (GOFs), the proposed filter set will not have any boundary effects at the GOF. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rate-Distortion Optimized Video Transmission Over DS-CDMA Channels with Auxiliary Vector Filter Single-User Multirate Detection",
            "Publication year": 2007,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/10939",
            "Abstract": "Repository of UOI \"Olympias\": Rate-Distortion Optimized Video Transmission Over DS-CDMA \nChannels with Auxiliary Vector Filter Single-User Multirate Detection Skip navigation Home \nBrowse Communities & Collections Browse Items by: Issue Date Author Title Subject Item \nType Advanced Search Help About DSpace Sign on to: My DSpace Receive email updates \nEdit Profile Saved Searches Favorites Repository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \n\"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Θετικών Επιστημών 4.Τμήμα Μηχανικών Ηλεκτρονικών Υπολογιστών \nκαι Πληροφορικής 5.Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please \nuse this identifier to cite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/10939 \nInstitution and School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Θετικών \nΕπιστημών. Τμήμα Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής URI: …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interference resistant scalable video transmission over DS-CDMA channels",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1605750/",
            "Abstract": "In this work, we demonstrate the interference mitigation capabilities of the auxiliary vector (AV) receiver for scalable video transmission over direct-sequence code division multiple access (DS-CDMA) systems using a hardware testbed. The proposed receiver design is also compared to the conventional RAKE matched-filter (RAKE-MF) and minimum variance distortionless response (MVDR) receivers. The DS-CDMA video data stream is transmitted over an RF channel under ''real world'' Rayleigh-faded multipath channel conditions, emulating open and/or urban battlefield environments. The state-of-the-art Agilent E4438C vector signal generator and baseband studio fader is used to provide a configurable \"real time\" RF channel. In this work, the \"foreman\" video sequence is source encoded using an MPEG-4 compatible video codec and channel-coded using rate-compatible punctured convolutional (RCPC) codes …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-Layer Resource Allocation for Wireless Visual Sensor Networks and Mobile Ad Hoc Networks",
            "Publication year": 2014,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA619869",
            "Abstract": "In the context of this project, we worked on the development of a cross-layer resource management system over single hop and multihop Direct-Sequence Code Division Multiple Access DS-CDMA Visual Sensor Networks VSNs. The target was the optimal determination and allocation of the source and channel coding rates and the power levels among the nodes of the considered network. For the efficient allocation of the nodes transmission parameters, we applied various distortion-related criteria, drawing inspiration from game theory as well, and investigated fairness and efficiency under different perspectives for each of them. Computational intelligence optimization algorithms and reinforcement learning techniques were applied in order to solve the resulting optimization problems. All the solutions provided by the examined schemes were Pareto-optimal and thus, the choice about the most fair and efficient scheme is problem-dependent. Some of the approaches that were taken into account for further improving the end-to-end video distortion of a wireless multiple-access VSN included the time scheduling of transmitting nodes for interference mitigation, the optimal Instantaneous Decoding Refresh IDR frame placement during encoding, the content-based node prioritization, and the weighted bi-objective optimization for measuring the trade-off between video quality and consumed transmission power. The evaluation of all proposed approaches showed that enhanced end-to-end video quality can be achieved, by keeping power consumption at reasonable levels, when compared to the case of assigning equal values to the transmission …",
            "Abstract entirety": 0,
            "Author pub id": "VVz5ATwAAAAJ:PELIpwtuRlgC",
            "Publisher": "IOANNINA UNIV (GREECE)"
        },
        {
            "Title": "Game-theory-based cross-layer optimization for wireless DS-CDMA visual sensor networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5652947/",
            "Abstract": "We propose a game-theory-based cross-layer optimization scheme for wireless Direct Sequence Code Division Multiple Access (DS-CDMA) visual sensor networks. The scheme uses the Nash Bargaining Solution (NBS), which assumes that the nodes negotiate, with the help of a centralized control unit, on how to allocate resources. The NBS takes into account the video quality each node could achieve without making an agreement. The cross-layer optimization scheme determines the source coding rate, channel coding rate, and transmission power for each node. We compare the proposed game-theory-based scheme with competing schemes that minimize the average or maximum distortion among the nodes. Experimental results are presented and conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "VVz5ATwAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        }
    ]
}]