[{
    "name": "Ματτίας Μπούχερ",
    "romanize name": "Mattias Boucher",
    "School-Department": "Ηλεκτρονικών Μηχανικών & Μηχανικών Υπολογιστών",
    "University": "tuc",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 6511,
    "Scholar name": "Matthias Bucher",
    "Scholar id": "zgJbCb0AAAAJ",
    "Affiliation": "School of Electrical & Computer Engineering, Technical University of Crete (TUC), Chania, Greece",
    "Citedby": 1951,
    "Interests": [
        "low power",
        "analog integrated circuit design",
        "compact modeling",
        "noise",
        "variability"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=zgJbCb0AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "IEEE: Extending a 65nm CMOS process design kit for high total ionizing dose effects",
            "Publication year": 2018,
            "Publication url": "https://cds.cern.ch/record/2646286",
            "Abstract": "Standard CMOS Process Design Kits (PDKs) do not address degradation the technology incurs when exposed to high Total Ionizing Dose (TID). Front-end electronics for the High-Luminosity Large Hadron Collider are expected to be exposed up to ten-fold doses. Bulk CMOS at 65 nm is a strong contender for such electronics due to a favorable trade-off among cost, performance, and TID-sensitivity. The present paper presents the extension of a foundry-provided PDK to cover also high TID effects. TID experiments have been carried out up to 500 Mrad. The PDK is based on binned BSIM4 models, which are adapted to different TID levels. Hence, designers may choose among different TID levels for their designs, contributing importantly to radiation-hard design practice.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Open‐source circuit simulation tools for RF compact semiconductor device modelling",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jnm.1973",
            "Abstract": "MOS‐Modelle und Parameterextraktion Arbeitskreis (MOS‐AK) is a European, independent compact modelling forum created by a group of engineers, researchers and compact modelling enthusiasts to promote advanced compact modelling techniques and model standardization using high‐level behavioural modelling languages such as VHDL‐AMS and Verilog‐A. This invited paper summarizes recent MOS‐AK open‐source compact model standardization activities and presents advanced topics in metal–oxide–semiconductor field‐effect transistor modelling, focusing in particular on analogue/radio frequency applications. The paper discusses links between compact models and design methodologies, finally introducing elements of compact model standardization. The open‐source computer‐aided design tools Qucs, QucsStudio and ngspice all support Verilog‐A as a hardware description language for …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "CMOS small-signal and thermal noise modeling at high frequencies",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6626610/",
            "Abstract": "In this paper, the behavior of radio frequency (RF) CMOS noise up to 24 GHz is analyzed and verified with measurements over a wide range of bias voltages and channel lengths. For the first time, approaches for excess noise factor modeling are validated versus measurements. Furthermore, important RF CMOS figures of merit are examined over many CMOS generations. With the scaling of CMOS technology, optimum RF performance is shown to be shifted from higher moderate toward lower moderate inversion, providing important guidelines for RFIC design. The results are validated with the charge-based EKV3 compact model, which considers short-channel effects such as channel length modulation, velocity saturation, and carrier heating.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comparison of a BSIM3V3 and EKV MOSFET model for a 0.5/spl mu/m CMOS process and implications for analog circuit design",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1221897/",
            "Abstract": "Design requirements for high-density detector front-ends and other high-performance analog systems routinely force designers to operate devices in moderate inversion. However, CMOS models have traditionally not handled this operating region very well. In this paper, the Berkeley Short-Channel IFGET Model (BSIM3V3) and EKV 2.6 MOSFET models are evaluated in terms of their ability to model low-voltage analog circuits. Simulation results for a standard 0.5 /spl mu/m CMOS process are presented and compared to measured data. The data presented includes simulated and measured output conductance and transconductance efficiency for devices with channel lengths ranging from 0.5 /spl mu/m to 33 /spl mu/m. In addition, the models are compared in terms of their ability to handle the different operating regions of the MOS transistor (weak, moderate, and strong inversion). The results highlight the difficulty of …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On MOSFET Threshold Voltage Extraction Over the Full Range of Drain Voltage Based on Gm/ID",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2106.00747",
            "Abstract": "A MOSFET threshold voltage extraction method covering the entire range of drain-to-source voltage, from linear to saturation modes, is presented. Transconductance-to-current ratio is obtained from MOSFET transfer characteristics measured at low to high drain voltage. Based on the charge-based modeling approach, a near-constant value of threshold voltage is obtained over the whole range of drain voltage for ideal, long-channel MOSFETs. The method reveals a distinct increase of threshold voltage versus drain voltage for halo-implanted MOSFETs in the low drain voltage range. The method benefits from moderate inversion operation, where high-field effects, such as vertical field mobility reduction and series resistances, are minimal. The present method is applicable over the full range of drain voltage, is fully analytical, easy to be implemented, and provides more consistent results when compared to existing methods.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High‐frequency scalable compact modelling of Si RF‐CMOS technology",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200780121",
            "Abstract": "The aggressive downscaling of CMOS technologies offers record transit frequencies well above 100 GHz. Efficient RF circuit design, employing such technologies, demands non‐linear, scalable compact models with high accuracy up to high frequencies. EKV3 is an advanced MOSFET model, based on charge sheet theory, that meets such demands. Within this paper, the model is validated against DC and RF measurements up to 30 GHz, for various devices of a modern 180 nm CMOS technology. (© 2008 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "FOSS EKV 2.6 parameter extractor",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7208507/",
            "Abstract": "The design of advanced integrated circuits (IC) in particular for low power analog and radio-frequency (RF) application becomes more complex as the device level modeling confronting challenges in micro- and nano-meter CMOS processes. As present CMOS technologies continue geometry scaling the designers can benefit using dedicated SPICE MOSFET models and apply specific analog design methodologies. The EKV was developed especially to meet altogether the analog/RF design requirements. This paper describes a basic set of the DC parameter extraction steps for the EKV 2.6 model. The free open source software (FOSS) Profile2D tool was used to illustrate accurate EKV 2.6 DC extraction strategy.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:q3oQSFYPqjQC",
            "Publisher": "Ieee"
        },
        {
            "Title": "Design of Micropower Operational Transconductance Amplifiers for High Total Ionizing Dose Effects",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742031/",
            "Abstract": "The design of radiation-hard analog/mixed signal Integrated Circuits for high Total Ionizing Dose (TID) is a challenging task. Front-end electronics for the High-Luminosity Large Hadron Collider (HL-LHC) are expected to be exposed to doses exceeding 500 Mrad(SiO 2 ). Using a recently developed TID-Process Design Kit (PDK) in 65 nm bulk CMOS, the present paper illustrates the design of micropower, current-mirror and folded cascode CMOS Operational Transconductance Amplifiers (OTAs) using moderate inversion techniques to favor insensitivity to high TID.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:EkHepimYqZsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EKV3. 0: An advanced charge based MOS transistor model. A design-oriented MOS transistor compact model",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/1-4020-4556-5_3",
            "Abstract": "The EKV3. 0 MOS transistor compact model addresses the design and circuit simulation of analog, digital and RF integrated circuits using advanced sub-100 nm CMOS technologies. This chapter presents the physical foundation of the charge model, as well as its extensions to account for geometrical effects, gate current, noise etc. The model is compared to data ranging from 0.25 um to 90 nm CMOS generations. A parameter extraction procedure is outlined. EKV3. 0 has been developed in the Verilog-A behavioral language for reasons of portability among simulators.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Bias dependence of low frequency noise in 90nm CMOS",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Matt-Bucher/publication/252930455_Bias_Dependence_of_Low_Frequency_Noise_in_90nm_CMOS/links/54061c520cf23d9765a7eb2a/Bias-Dependence-of-Low-Frequency-Noise-in-90nm-CMOS.pdf",
            "Abstract": "The bias dependence of low frequency noise (LFN) is investigated with measurements in 90 nm CMOS. A recent charge-based LFN model combining carrier and mobility fluctuation components is compared to data from multifinger devices with a channel length of L= 70 nm. PMOS devices show higher 1/f noise than NMOS for input referred noise. The carrier number fluctuation model allows to well represent increased noise in strong inversion for either transistor type. Mobility fluctuation however is found to be significant in deep weak inversion. As a result, input referred noise shows a minimum in moderate inversion, and both carrier number and mobility fluctuation processes are required to represent noise over all the gate voltage range. The new model is implemented in the EKV3 MOS transistor compact model, and provides a good qualitative fit for both saturation and linear modes, from weak to strong inversion …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The EKV3. 0 MOSFET Model",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/4225635/ekv_cmc_june2004.pdf",
            "Abstract": "∎ Vertical/lateral non-uniform doping effects∎ Polydepletion/quantum effects∎ Vertical field mobility based on effective field∎ Velocity saturation/channel length modulation∎ DIBL, charge-sharing∎ RSCE, INWE, combined short&narrow-channel effects∎ Bias-dependent overlap charge/capacitance model∎ Bias-dependent series resistance model∎ Short-channel thermal noise model∎ Induced noise in gate and substrate∎ Non-quasistatic AC model--companion transient model under development",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measurement and compact modeling of 1/f noise in HV-MOSFETs",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6381479/",
            "Abstract": "This paper investigates 1/ f  noise behavior under low and high drain biases of high-voltage metal-oxide-semiconductor field-effect transistors (MOSFETs) (HV-MOSFETs). A dedicated setup is presented which allows measuring low-frequency (LF) noise of lateral double-diffused MOSFETs (LDMOSFETs) up to 200 V at the drain. LF noise spectra of n- and p-channel LDMOSFETs were measured over a large range of gate and drain bias conditions and modeled using a recently established physics-based compact model of HV-MOSFETs. The investigated devices confirm that the overall noise is mostly dominated by the noise originating in the channel, while the drift-region-generated noise only is apparent in linear operation.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EKV3 parameter extraction and characterization of 90nm RF-CMOS technology",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4286123/",
            "Abstract": "EKV3 is a circuit-design-oriented compact MOSFET model for analog/RF IC design. The paper presents parameter extraction guidelines and modelling using EKV3 for TOSHIBA's 90 nm RF-CMOS technology covering DC, CV and RF (S-parameter) and temperature scalability. RF verification was done by the use of multi-finger MOSFETs with many variations of gate length, width of unit fingers and number of fingers. A scalable RF model was successfully created. Extraction of RF parasitics and their scaling with RF layout is investigated. The EKV3 model successfully predicted high-frequency behaviour of 90 nm CMOS up to 20 GHz over a wide range of bias conditions.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Statistical compact modeling of Low Frequency Noise in Buried-Channel, Native, and standard MOSFETs",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7985942/",
            "Abstract": "In this paper, Buried-Channel and Native MOSFETs are thoroughly investigated in terms of Low Frequency Noise (LFN) variability for different bias and area conditions. These devices are compared with standard bulk CMOS transistors indicating lower levels of LFN regarding both its mean value and its variability. Moreover a recently proposed compact MOSFET model for LFN and its variability, is validated with excellent results. More specifically, it covers the increase of noise deviation in weak inversion and generally its strong bias-dependence in larger devices while it also gives consistent results regarding the scaling of LFN variability.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EKV3. 0 MOS transistor model for advanced analog IC design",
            "Publication year": 2004,
            "Publication url": "https://infoscience.epfl.ch/record/162142",
            "Abstract": "EKV3.0 MOS Transistor Model for Advanced Analog IC Design - Infoscience English Français \nlogin Home > EKV3.0 MOS Transistor Model for Advanced Analog IC Design Infoscience \nInformation Usage statistics Files EKV3.0 MOS Transistor Model for Advanced Analog IC \nDesign Bucher, Matthias ; Krummenacher, François ; Bazigos, Antonios Presented at: EKV \nModel Users’ Group Meeting and Workshop, EPFL, Lausanne, Switzerland, November 4-5 \n2004 Year: 2004 Laboratories: IEL Record appears in: Scientific production and competences \n> STI - School of Engineering > IEL - Institute of Electrical Engineering > UNATTRIBUTED-IEL - \nIEL - Unattributed publications Presentations & Talks Work outside EPFL Published URL Export \nas: BibTeX | MARC | MARCXML | DC | EndNote | NLM | RefWorks | RIS View as: MARC | \nMARCXML | DC Add to your basket: Back to search Record created 2011-01-06, last modified --…",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Temperature scaling of CMOS analog design parameters",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6196410/",
            "Abstract": "The scaling of key analog properties of CMOS technology under low-voltage conditions, in weak and moderate inversion, is investigated with emphasis on temperature behavior. Design parameters, such as weak inversion slope factor, threshold voltage, mobility, transconductance to current ratio, DIBL, and intrinsic gain, are examined with respect to bias conditions, geometry and temperature. Guidelines are provided to analog designers for the estimation of the variation of fundamental analog design parameters versus temperature. Measured data from NMOS and PMOS transistors of an advanced CMOS technology are provided.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compact modelling of ultra deep submicron CMOS devices",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Matt-Bucher/publication/268654991_Compact_modelling_of_ultra_deep_submicron_CMOS_devices/links/5a3d1669a6fdcce197ff5388/Compact-modelling-of-ultra-deep-submicron-CMOS-devices.pdf",
            "Abstract": "The technology of CMOS very large-scale integrated circuits (VLSI) has achieved remarkable advances over last 25 year and the progress is expected to continue well into this century. However, even before the minimum feature sizes of the active VLSI devices reach the fundamental limits, this evolution is expected to encounter severe technological and economic problems when the dimensions go below sub-quarter micron, the so called ultra deep submicron (UDSM). There are many physical effects that need to be addressed while modelling UDSM devices, such as quantization of the inversion layer, mobility degradation, carrier velocity saturation and overshoot, polydepletion effects. In this paper, the advances in compact MOSFET devices will be illustrated using application examples of the EPFL-EKV model.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FOSS EKV2. 6 Verilog-A Compact MOSFET Model",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8901822/",
            "Abstract": "The EKV2.6 MOSFET compact model has had a considerable impact on the academic and industrial community of analog integrated circuit design, since its inception in 1996. The model is available as a free open-source software (FOSS) tool coded in Verilog-A. The present paper provides a short review of foundations of the model and shows its capabilities via characterization and modeling based on a test chip in 180 nm CMOS fabricated via Europractice.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:vDijr-p_gm4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design-oriented characterization of CMOS over the continuum of inversion level and channel length",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/911508/",
            "Abstract": "A methodology for small signal characterization of CMOS processes over the full range of inversion level and channel length is presented. Measured transconductance and output conductance of a 0.5 /spl mu/m standard CMOS process are presented from deep weak inversion to deep strong inversion for both NMOS and PMOS devices for channel lengths ranging from 0.5 /spl mu/m to 33.4 /spl mu/m. The data is presented in normalized form permitting device evaluation at any inversion level, channel length, and drain current. This characterization is useful for modern analog CMOS design anywhere in the continuum of inversion level and channel length. This method furthermore presents a novel and rigorous benchmark for evaluating the accuracy of compact MOS models. Initial results are given illustrating EKV MOS model transconductance accuracy. The characterization methodology can be extended to deeper …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recent Advances in the EKV3. 0 MOSFET Model",
            "Publication year": 2006,
            "Publication url": "https://infoscience.epfl.ch/record/162140",
            "Abstract": "Recent Advances in the EKV3.0 MOSFET Model (invited) - Infoscience English Français \nlogin Home > Recent Advances in the EKV3.0 MOSFET Model (invited) Infoscience \nInformation Usage statistics Files Recent Advances in the EKV3.0 MOSFET Model (invited) \nBucher, Matthias ; Bazigos, Antonios ; Kitonaki, Eleni ; Krummenacher, François Presented \nat: NSTI-Nanotech 2006, Workshop on Compact Modeling, Boston, Massachusetts, 8-11 \nMay 2006 Year: 2006 Laboratories: IEL Record appears in: Scientific production and \ncompetences > STI - School of Engineering > IEL - Institute of Electrical Engineering > \nUNATTRIBUTED-IEL - IEL - Unattributed publications Presentations & Talks Work outside \nEPFL Published URL Export as: BibTeX | MARC | MARCXML | DC | EndNote | NLM | \nRefWorks | RIS View as: MARC | MARCXML | DC Add to your basket: Back to search \nRecord created 2011-01-06, last modified 2020--(…",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Compact model of drain current in short-channel triple-gate FinFETs",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6202679/",
            "Abstract": "An analytical compact drain current model for undoped (or lightly doped) short-channel triple-gate fin-shaped field-effect transistors (finFETs) is presented, taking into account quantum-mechanical and short-channel effects such as threshold-voltage shifts, drain-induced barrier lowering, and subthreshold slope degradation. In the saturation region, the effects of series resistance, surface roughness scattering, channel length modulation, and saturation velocity were also considered. The proposed model has been validated by comparing the transfer and output characteristics with device simulations and with experimental results. The good accuracy and the symmetry of the model make it suitable for implementation in circuit simulation tools.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Variability of low frequency noise and mismatch in enclosed-gate and standard nMOSFETs",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7954285/",
            "Abstract": "Variability of Low Frequency Noise (LFN) and Random Telegraph Noise (RTN) is an important concern for many analog CMOS integrated circuits. In this paper, transistors with enclosed gate layout are examined and compared with standard layout transistors, with particular emphasis on weak inversion region. Enclosed gate transistors show an improved gate voltage mismatch in weak inversion. A compact MOSFET model for LFN and its variability, based on number fluctuation theory, is shown to cover well the behavior of either type of transistors. Lower levels of noise as well as lower variability of noise are observed in enclosed gate transistors.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Charge-Based Modeling of Symmetric Double-Gate Junction Field-Effect Transistors–Part II: Total Charges and Transcapacitances",
            "Publication year": 2017,
            "Publication url": "https://infoscience.epfl.ch/record/231913",
            "Abstract": "Charge-Based Modeling of Symmetric Double-Gate Junction Field-Effect Transistors – Part II: \nTotal Charges and Transcapacitances English Français login Menu Search Personalize Your \nalerts Your baskets Your searches Browse Collections Help English Français login Infoscience \nRecord thumbnail image Charge-Based Modeling of Symmetric Double-Gate Junction \nField-Effect Transistors – Part II: Total Charges and Transcapacitances Markis, Nikolaos; Jazaeri, \nFarzan; Sallese, Jean-Michel; Bucher, Matthias 2017 Formats Format BibTeX View Download \nMARC View Download MARCXML View Download DublinCore View Download EndNote \nView Download NLM View Download RefWorks View Download RIS View Download Details \nTitle Charge-Based Modeling of Symmetric Double-Gate Junction Field-Effect Transistors \n– Part II: Total Charges and Transcapacitances Author(s) Markis, Nikolaos ; Jazaeri, ; , -; , -…",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Institute of Electrical and Electronics Engineers"
        },
        {
            "Title": "Re-interpreting the MOS transistor via the inversion coefficient and the continuum of g/sub ms//I/sub d",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1046463/",
            "Abstract": "A method of interpreting MOS transistor behavior is described which is simple yet fundamental and universal. Device currents are normalized to the inversion coefficient (IC) and interpreted via g/sub ms//I/sub d/. Measurements confirm this behavior, and demonstrate the need for the development of proper model forms for usage of this description. This interpretation also connects directly with modern analog CMOS design needs, allowing for the positive use of moderate and weak inversion, in a manner which permits a coherent evolution of a design toward the final goals.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigation of scaling and temperature effects in total ionizing dose (TID) experiments in 65 nm CMOS",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8436809/",
            "Abstract": "Ten-fold radiation levels are expected in the upgrade of the High-Luminosity Large Hadron Collider (HL-LHC) at CERN. Bulk silicon CMOS at 65 nm offers appreciable advantages among cost, performance, and resilience to high Total Ionizing Dose (TID). In the present paper, geometrical scaling of key analog design parameters of MOS transistors irradiated at high TID is investigated. Experiments are carried out for TID of 100, 200 and up to 500 Mrad(SiO 2 ) and at -30°C, 0°C, and 25°C. We find that parameters are least degraded at -30°C. However, short-channel NMOSTs show a significant degradation of slope factor, which is more severe at 0°C than at 25°C. In contrast, the slope factor in short-channel PMOSTs shows lowest sensitivity to high TID.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:XD-gHx7UXLsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PMOS drain-bulk connected loads for Subthreshold Source-Coupled Logic",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6016036/",
            "Abstract": "This paper aims to prove the usefulness of PMOS drain-bulk connected transistors for use as loads in implementing Subthreshold Source-Coupled Logic (STSCL) circuits. Measurements performed on a 180nm wafer as well as simulations with the EKV 301.02 model following a parameter extraction on the used technology, confirm that the desirable output voltage swing needed for robust operation in the subthreshold (weak inversion) region, can only be achieved through the use of PMOS drain-bulk connected transistors as loading elements.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Simple 1/f noise parameter extraction method for high-voltage MOSFETs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6842092/",
            "Abstract": "A 1/f noise parameter extraction method for high-voltage (HV-)MOSFETs at 3V drain bias is presented in this paper. In this region the overall noise is mostly dominated by the noise originating in the channel. The bias dependence of flicker noise, related to transconductance-to-current ratio, allows for an easy means to determine related noise parameters. Though measured data is limited, parameters related to carrier number fluctuation effect may be found. 50 V N-channel HV-MOSFETs are investigated for long as well as short channel lengths. The parameter extraction method is applied to a recently established 1/f noise model for HV-MOSFETs, showing a good agreement among model and experimental data.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scaling Issues In An 0.15/spl mu/m CMOS Technology With EKV3. 0",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1706557/",
            "Abstract": "Application of the EKV3.0 model to 0.15mum CMOS technology with single poly, and buried channel PMOS, is presented with emphasis on scaling properties of the technology and the model. The EKV3.0 model is illustrated for its fit to NMOS and PMOS drain current, transconductances and output characteristics in weak, moderate and strong inversion over a large temperature range. Scaling properties of the technology and the model are illustrated with fits versus channel length and width. The model is also compared to measured capacitance-voltage characteristics. Furthermore, some comparisons to a BSIM3v3 model for the same technology are provided",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EKV3 MOSFET compact model documentation, model version 301.02",
            "Publication year": 2008,
            "Publication url": "https://infoscience.epfl.ch/record/162144",
            "Abstract": "EKV3 MOSFET Compact Model Documentation, Model Version 301.02 - Infoscience English \nFrançais login Home > EKV3 MOSFET Compact Model Documentation, Model Version 301.02 \nInfoscience Information Usage statistics Files EKV3 MOSFET Compact Model Documentation, \nModel Version 301.02 Bazigos, Antonios ; Bucher, Matthias ; Krummenacher, François ; Sallese, \nJean-Michel ; Roy, Ananda Sankar ; Enz, Christian Year: 2008 Publisher: Chania, Greece, \nTechnical University of Crete Laboratories: EDLAB ICLAB Record appears in: Scientific \nproduction and competences > STI - School of Engineering > IEL - Institute of Electrical \nEngineering > EDLAB - Group of Electron Device Modeling and Technology Scientific production \nand competences > STI - School of Engineering > IMT - Institute of Microengineering > ICLAB \n- Integrated Circuits Laboratory Work outside EPFL Technical Reports Published Export -…",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:ldfaerwXgEUC",
            "Publisher": "Technical University of Crete"
        },
        {
            "Title": "Compact modeling of nanoscale trapezoidal FinFETs",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6632876/",
            "Abstract": "An analytical compact model for the drain current of undoped or lightly doped nanoscale FinFETs with trapezoidal cross section is proposed. The compact model of rectangular FinFETs is extended to trapezoidal FinFETs using equivalent nonplanar device parameters and corner effects. The model has been validated by comparing the results with those of 3-D numerical device simulations. The very good accuracy of the drain current and transcapacitances makes the proposed model suitable for implementation in circuit simulation tools.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generalized constant current method for determining MOSFET threshold voltage",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9187566/",
            "Abstract": "A novel method for extracting threshold voltage and substrate effect parameters of MOSFETs with constant current bias at all levels of inversion is presented. This generalized constant-current (GCC) method exploits the charge-based model of MOSFETs to extract threshold voltage and other substrate-effect-related parameters. The method is applicable over a wide range of current throughout weak and moderate inversion, and to some extent in strong inversion. This method is particularly useful when applied for MOSFETs presenting edge conduction effect (subthreshold hump) in CMOS processes using shallow trench isolation (STI).",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:p__nRnzSRKYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultra-low voltage drain-bulk connected MOS transistors in weak and moderate inversion",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6463711/",
            "Abstract": "This paper aims to demonstrate the basic characteristics of NMOS and PMOS drain-bulk connected transistors for ultra-low voltage applications. On-wafer measurements were done on 180nm CMOS process, while TCAD simulations were done for 180nm and 45nm technology nodes. Analytical expressions for Early voltage and intrinsic gain in weak-moderate inversion are provided, showing that these quantities are dominated by the substrate effect and are insensitive to bias and geometry. Furthermore, the analytical model as well as the EKV3 MOSFET compact model, following suitable parameter extraction, show a close agreement to measured and TCAD simulated data.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Variability of low frequency noise in moderately-sized MOSFETs—A model for the area-and gate voltage-dependence",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7288578/",
            "Abstract": "In this paper, a thorough statistical investigation of low frequency noise (LFN) variability in MOSFETs is presented. In smaller-sized devices, noise fluctuations are area-dominated. In moderate- to large-sized transistors (Area ≫ 1μm 2 ), normalized noise fluctuations are roughly independent of area, but show a distinct degradation towards weak inversion (subthreshold). A new model is proposed for the gate-voltage dependence of 1/f noise variations in moderately-sized transistors. We show that the gate-voltage dependence may be related to transconductance-to-current ratio g m /I D . Extensive measurements of low frequency noise variability in experimental 180nm CMOS confirm the newly proposed model.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Large-Signal RF Modeling with the EKV3 MOSFET Model",
            "Publication year": 2010,
            "Publication url": "http://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-article-BATA-0008-0024",
            "Abstract": "EN This paper presents a validation of the EKV3 MOSFET model under load-pull conditions with high input power at 5.8 GHz, as well as S-parameter measurements with low input power up to 20 GHz. The EKV3 model is able to represent coherently the large-and small-signal RF characteristics in advanced 90 nm CMOS technology. Multifinger devices with nominal drawn gate length of 70 nm are used.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accounting for quantum effects and polysilicon depletion from weak to strong inversion in a charge-based design-oriented MOSFET model",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1196085/",
            "Abstract": "This paper presents a simple, physics-based, and continuous model for the quantum effects and polydepletion in deep-submicrometer MOSFETs with very thin gate oxide thicknesses. This analytical design-oriented MOSFET model correctly predicts inversion and depletion charges, transcapacitances, and drain current, from weak to strong inversion and from nonsaturation to saturation. One single additional parameter is used for polysilicon doping concentration, while the quantum correction does not introduce any new parameter. Comparison to experimental data of deep-submicrometer technologies is provided, showing accurate fits both for I-V and C-V data. The model offers simple relationships among effective electrical parameters and physical device parameters, providing insight into the physical phenomena. This new model thereby supports device engineering, analog circuit design practice, as well as …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A MOS transistor model for mixed analog-digital circuit design and simulation",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/1-4020-7929-X_3",
            "Abstract": "In the design cycle of complex integrated circuits, the compact device simulation models are the privileged vehicle of information between the foundry and the designer. Effective circuit design, particularly in the context of analog and mixed analog-digital circuits using silicon CMOS technology, requires a MOS transistor (MOST) circuit simulation model well adapted both to the technology and to the designer’s needs. The MOST model itself should also help portable design, since design-reuse becomes a major advantage in the fast development of new products. Clearly, the MOST model must be based on sound physical concepts, and be parameterized in such a way that it allows easy adaptation to very different CMOS technologies, and provides the designer with information on important parameters for design. This chapter describes an analytical, scalable compact MOST model, called ‘EKV’ MOST model …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Design-oriented characterization and parameter extraction methodologies for the EKV3 MOSFET model",
            "Publication year": 2007,
            "Publication url": "https://infoscience.epfl.ch/record/162139",
            "Abstract": "Design-Oriented Characterization and Parameter Extraction Methodologies for the EKV3 \nMOSFET Model (invited) - Infoscience English Français login Home > Design-Oriented \nCharacterization and Parameter Extraction Methodologies for the EKV3 MOSFET Model (invited) \nInfoscience Information Usage statistics Files Design-Oriented Characterization and Parameter \nExtraction Methodologies for the EKV3 MOSFET Model (invited) Bucher, Matthias ; Bazigos, \nAntonios ; Diamantakos, Dimitrios ; Krummenacher, François Presented at: NSTI-Nanotech \n2007, Workshop on Compact Modeling, Boston, Massachusetts, 20-24 May 2007 Year: 2007 \nLaboratories: IEL Record appears in: Scientific production and competences > STI - School of \nEngineering > IEL - Institute of Electrical Engineering > UNATTRIBUTED-IEL - IEL - Unattributed \npublications Presentations & Talks Work outside EPFL Published URL Export as: | | | DC …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Device design engineering for optimum analog/RF performance of nanoscale DG MOSFETs",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6256737/",
            "Abstract": "Analog/RF performance of double-gate MOSFETs in the sub-20-nm regime is investigated using ATLAS device simulator. It is shown that graded channel dual material double gate (GCDMDG) achieves higher drain current, peak transconductance, and higher values of cutoff frequency at lower drain currents. This novel architecture also provides better intrinsic gain for an amplifier. A new analog/RF figure of merit, gain transconductance frequency product (GTFP) is proposed that includes both the switching speed and intrinsic gain of the device and is very useful for circuit design. The peak GTFP is observed at the higher end of moderate inversion, slightly above threshold. The GCDMDG device outperforms in terms of GTFP and is more favorable for shorter channel length devices.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MOSFET Compact Model Model’s Documentation",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Antonios-Bazigos/publication/49460066_EKV3_MOSFET_compact_model_documentation_model_version_30102/links/56d9ad6808aee1aa5f828f32/EKV3-MOSFET-compact-model-documentation-model-version-30102.pdf",
            "Abstract": "Dear reader, this document is prepared by the EKV Team in order to accompany the Verilog-A code of the EKV3 model. Its aim is to provide helping information for the reader who wants to use and understand the model and the coding. The building of this document is still at an early stage and more things are intended to be a part of it upon its conclusion. Please, feel free to get in contact with us for any comment or question or anything else on this. This specific version of the document describes the version 301.02 of the EKV3 model.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comprehensive analysis of nanoscale single-and multi-gate MOSFETs",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269216000550",
            "Abstract": "Analog/RF performance of nanoscale triple gate FinFETs and planar single-gate (SG) and double-gate (DG) SOI MOSFETs is examined via extensive 3D device simulations. Well-designed DG MOSFETs attain higher values of cut-off frequency for both lower and higher drain currents, whereas triple-gate (TG) FinFETs offer higher intrinsic gain while compromising cut-off frequency. For longer channel lengths, SG MOSFETs show slightly higher cut-off frequency in comparison to multi-gate (MG) MOSFETs, whereas MG MOSFETs exhibit higher cut-off frequency for lower channel lengths. A unique figure of merit, gain transconductance frequency product (GTFP) for best trade-off among gain, transconductance, and speed is compared. Double-gate MOSFETs exhibit higher GTFP over a wide range of device scaling, thus remain a good candidate for analog/RF applications. Furthermore, the RF linearity performance of …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:bnK-pcrLprsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multi-objective low-noise amplifier optimization using analytical model and genetic computation",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s00034-017-0634-2",
            "Abstract": "The purpose of this paper is to introduce a methodology for multi-objective radio frequency (RF) low-noise amplifier (LNA) optimization using an analytical model of the MOS transistor in combination with genetic computation. The optimum performance is defined by a figure of merit (FoM) that considers both the power efficiency and the RF performance of the system. Using a short-channel EKV model, the analysis of this FoM suggests that the optimum MOS inversion level lies in the moderate inversion. This knowledge can be used as a strong starting point for the design and optimization procedures. Initially, the LNA component values are extracted using the analytical model. The model does not fully take into consideration the parasitic behaviour of the components in a real design; thus, it produces an approximation of the optimum design. The final circuit fine tuning is achieved with the use of a genetic …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:7T2F9Uy0os0C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Compact Modeling of Low Frequency Noise and Thermal Noise in Junction Field Effect Transistors",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8901775/",
            "Abstract": "This paper presents a novel charge-based approach to modeling bias-dependent noise in junction field-effect transistors (JFETs). Low frequency noise as well as thermal noise aspects are modeled within the recent charge-based model of the double-gate (DG) JFET. For low frequency noise, mobility fluctuations according to the Hooge model is addressed. Thermal noise is expressed within the charge-based modeling approach. The models are validated with respect to TCAD simulations and show correct dependence over a range of gate and drain bias. A custom setup for low frequency noise measurement of JFETs is described. Noise measurements of n-JFETs are discussed, and the compact model is compared with the measurement.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:Z5m8FVwuT1cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The EKV3. 0 model code and parameter extraction",
            "Publication year": 2004,
            "Publication url": "https://www.epfl.ch/labs/iclab/wp-content/uploads/2019/02/EKV3UMW2004_Bazigos_EKV3_code_parameter_extraction_2004.pdf",
            "Abstract": "❑ Contained in one file “ekv3. va”❑~ 1400 lines (46KB)❑~ 50 intrinsic model parameters❑ BSIM4-like junction diode models & effects❑ Optional source/drain, gate, substrate resistors❑ Developed using ELDO and SPECTRE❑ Used as the reference code for all model implementations❑ ADMS is being used in order to obtain “standard” C code versions for various simulators.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improved analytical modeling of polysilicon depletion in MOSFETs for circuit simulation",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003811010000023X",
            "Abstract": "Polysilicon gate depletion is an important effect that degrades the circuit performance of deep submicron standard CMOS technologies. A new approach to analytically modeling the polysilicon depletion effect on drain current and transconductances as well as node charges and transcapacitances is presented. The model is based on a clear physical analysis of the charges in the MOS transistor structure. Using the modeling framework and the fundamental variables of the EKV MOS transistor model formalism and that of the related charges models, a continuous model is achieved that is valid in all operating regions from weak inversion to strong inversion and from non-saturation to saturation. The asymptotic behavior of the transcapacitances is improved with respect to former model formulations. Only the doping concentration in the polygate is used in addition to the other physical device model parameters. The …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:9yKSN-GCB0IC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "EKV 3.0: An analog design-oriented MOS transistor model",
            "Publication year": 2002,
            "Publication url": "https://infoscience.epfl.ch/record/149512",
            "Abstract": "EKV 3.0: an Analog Design-Oriented MOS Transistor Model - Infoscience English Français \nlogin Home > EKV 3.0: an Analog Design-Oriented MOS Transistor Model Infoscience \nInformation Usage statistics Files EKV 3.0: an Analog Design-Oriented MOS Transistor \nModel Bucher, M. ; Sallese, J.-M. ; Krummenacher, F. ; Kazazis, D. ; Lallement, C. ; Grabinski, \nW. ; Enz, C. Published in: 9th International Conference on Mixed Design of Integrated \nCircuits and Systems (MIXDES) Year: 2002 Laboratories: EDLAB LSI2 Record appears in: \nScientific production and competences > STI - School of Engineering > IEL - Institute of \nElectrical Engineering > EDLAB - Group of Electron Device Modeling and Technology \nScientific production and competences > Archives > I&C - School of Computer and \nCommunication Sciences > LSI2 - Integrated Systems Laboratory 2 (STI/IC) Scientific \nproduction and competences > STI - School of > …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Statistical analysis of 1/f noise in enclosed-gate N-and PMOS transistors",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7986018/",
            "Abstract": "Low frequency noise (LFN) characteristics can limit the performance of conventional CMOS designs. In the context of this paper enclosed gate N- and P-MOS transistors will be examined regarding LFN mean value and its variability in various biasing conditions. In subthreshold region enclosed gate PMOS transistors show a significantly reduced LFN variability compared to the NMOS counterpart. Both devices present an improved noise performance. The LFN compact MOSFET model applied proved to be well suited to statistically model LFN in enclosed gate transistors.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:Fu2w8maKXqMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A compact model for silicon carbide JFET",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Zekentes/publication/260385243_A_COMPACT_MODEL_FOR_SILICON_CARBIDE_JFET/links/53e2986e0cf275a5fdda31fc/A-COMPACT-MODEL-FOR-SILICON-CARBIDE-JFET.pdf",
            "Abstract": "This paper presents work on developing a compact model for SiC JFET devices. The proposed model will be capable to characterize a SiC JFET device, which will be used in the design of inverters for photovoltaic (PV) systems. The model is validated against measured data at 25oC for normallyon SiC-JFETs. Also, temperature parameters are obtained from high-temperature data from the datasheet of the foundry. The proposed model combines a subcircuit built around the EKV3 MOSFET compact model adapted for the purpose.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Charge-based modeling of long-channel symmetric double-gate junction FETs—Part I: Drain current and transconductances",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8371530/",
            "Abstract": "The double-gate (DG) junction field-effect transistor (JFET) is a classical electron device, with a simple structure that presents many advantages in terms of not only device fabrication but also its operation. The device has been largely used in low-noise applications, but also more recently, in power electronics. Physics-based compact models for JFETs, contrary to MOSFETs, are, however, scarce. In this paper, an analytical, charge-based model is established for the mobile charges, drain current, and transconductances of symmetric DG JFETs, covering all regions of device operation. The model is unified and continuous from subthreshold to linear and saturation operation and is valid over a large temperature range. This charge-based model constitutes the basis of a full compact model of the DG JFET.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Starting over: gm/ID-based MOSFET modeling as a basis for modernized analog design methodologies",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Matt-Bucher/publication/228717878_Starting_Over_gmId-Based_MOSFET_Modeling_as_a_Basis_for_Modernized_Analog_Design_Methodologies/links/02e7e526ef42f1d87b000000/Starting-Over-gm-Id-Based-MOSFET-Modeling-as-a-Basis-for-Modernized-Analog-Design-Methodologies.pdf",
            "Abstract": "A method of interpreting MOSFET behavior is described which is more coherent for modern analog CMOS circuit design. This method supercedes the use of simple but antiquated equations in design, and replaces them with an approach based on the inversion coefficient of the individual transistors in the design. Measurements and modeling confirm that this method can be used directly to arbitrate among the various countervailing requirements of demanding analog designs.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in MOSFET Charges Modeling. EKV3. 0 MOSFET Model",
            "Publication year": 2005,
            "Publication url": "https://infoscience.epfl.ch/record/162141",
            "Abstract": "Advances in MOSFET Charges Modeling. EKV3.0 MOSFET Model (invited) - Infoscience \nEnglish Français login Home > Advances in MOSFET Charges Modeling. EKV3.0 MOSFET \nModel (invited) Infoscience Information Usage statistics Files Advances in MOSFET \nCharges Modeling. EKV3.0 MOSFET Model (invited) Bucher, Matthias ; Bazigos, Antonios ; \nKrummenacher, François ; Sallese, Jean-Michel ; Enz, Christian ; Grabinski, Wladyslaw \nPresented at: NSTI-Nanotech 2005, Workshop on Compact Modeling, Anaheim, California, \n10-12 May 2005 Year: 2005 Laboratories: EDLAB ICLAB Record appears in: Scientific \nproduction and competences > STI - School of Engineering > IEL - Institute of Electrical \nEngineering > EDLAB - Group of Electron Device Modeling and Technology Scientific \nproduction and competences > STI - School of Engineering > IMT - Institute of \nMicroengineering > ICLAB - Integrated Circuits & as…",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Total ionizing dose effects on analog performance of 65 nm bulk CMOS with enclosed-gate and standard layout",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8383790/",
            "Abstract": "High doses of ionizing irradiation cause significant shifts in design parameters of standard bulk silicon CMOS. Analog performance of a commercial 65 nm CMOS technology is examined for standard and enclosed gate layouts, with Total Ionizing Dose (TID) up to 500 Mrad(SiO 2 ). The paper provides insight into geometrical and bias dependence of key design parameters such as threshold voltage, DIBL, transconductance efficiency, slope factor, and intrinsic gain. A modeling approach for an efficient representation of saturation transfer characteristics under TID from weak through moderate and strong inversion and over channel length is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Free Carrier Mobility, Series Resistance, and Threshold Voltage Extraction in Junction FETs",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9215023/",
            "Abstract": "In this brief, extraction methods are proposed for determining the essential parameters of double gate junction field-effect transistors (FETs). First, a novel method for determining free carrier effective mobility, similar to a recently proposed method for MOSFETs, is developed. The same method is then extended to cover also the case when series resistance is present, while series resistance itself may be determined from the measurement from two FETs with different channel lengths. The key technological and design parameter is the threshold voltage, which may be unambiguously determined from the transconductance-to-current ratio with a constant-current method. The new methods are shown to be effective over a wide range of technical parameters, using technology computer-aided design simulations.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:vbGhcppDl1QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "System level analysis of a direct-conversion WiMAX receiver at 5.3 GHz and corresponding mixer design",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4600917/",
            "Abstract": "The growing demand for WiMAX integrated circuits has motivated the system level analysis of a direct-conversion receiver at 5.3 GHz and the corresponding mixer circuit design. The specifications set by the IEEE WirelessMAN 802.16 protocol are met. The corresponding mixer circuit is designed using MOSFETs in a 0.25μm SiGe BiCMOS technology. Inductive resonance technique is used to succeed optimum conversion gain, as well as minimum noise figure and maximum linearity. The double-balanced Gilbert Cell mixer experiences a conversion gain of 8.5 dB, a noise figure of 5.4 dB and a input 3 rd  order intercept point of 3 dBm, while consuming 12.5 mW. The mixer’s overall performance is exceptional compared to other published work.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling of high‐frequency noise of silicon CMOS transistors for RFIC design",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jnm.1959",
            "Abstract": "This work presents high‐frequency noise measurements and compact modeling for a 90‐nm silicon complementary metal–oxide–semiconductor (CMOS) technology in terms of radio frequency (RF) figures of merit (FoMs). Minimum noise figure (NFmin), equivalent noise resistance (Rn), optimum source reflection coefficient (Γopt), thermal noise excess factor and a recently introduced FoM for common‐source low‐noise amplifier (LNA) design are presented from a circuit design perspective. For this purpose, the behavior of the above mentioned RF FoMs is investigated over the level of channel inversion, providing insight from a circuit design point of view. The EKV3 MOSFET advanced compact model has been used in Spectre simulator, and results are validated over a large range of frequencies, channel lengths and bias points, for both N‐type and P‐type MOS devices. Optimum performance is shown to be shifted …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RF compact modeling of high-voltage MOSFETs",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.4103/0377-2063.97329",
            "Abstract": "The High-Voltage MOSFET is used in a wide variety of applications covering from power systems up to RF-IC. Compact models that describe the high-frequency behavior of the device are required to predict high-frequency operation and switching capabilities of these elements in HV state-of-the-art systems. In this paper, an RF model is presented and verified against extensive Y-parameter measurements, which were carried out on a long channel Lateral double-Diffusion MOS device. Assessment of the model with measurements confirms the validity of this approach.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:maZDTaKrznsC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Modeling of an integrated active feedback preamplifier in a 0.25/spl mu/m CMOS technology at cryogenic temperatures",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1237113/",
            "Abstract": "This paper describes the modeling of a standard 0.25/spl mu/m CMOS technology at cryogenic temperatures. In the first step of the work, the parameters of the EKV v2.6 model were extracted at different temperatures (300, 150, and 70 K). The extracted parameters were then used to optimize the performance of a room temperature designed active feedback front-end preamplifier (AFP) at 130 K. The results show that with a small adjustment of the extracted parameters it is possible to have a reasonable model at low temperatures. By optimizing the bias conditions at 130 K, a fall time down to 1.5 ns and a double pulse resolution of 6.5 ns were measured for NA60 proton beamscope. The proposed approach will also allow a low temperature design optimization for future projects, which will not be possible using only standard models provided by the foundry.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "EKV3. 0 Model Code, Parameters & Case Studies",
            "Publication year": 2004,
            "Publication url": "https://infoscience.epfl.ch/record/162143",
            "Abstract": "EKV3.0 Model Code, Parameters & Case Studies - Infoscience English Français login Home > \nEKV3.0 Model Code, Parameters & Case Studies Infoscience Information Usage statistics \nFiles EKV3.0 Model Code, Parameters & Case Studies Bazigos, Antonios ; Bucher, Matthias \nPresented at: EKV Model Users’ Group Meeting and Workshop, EPFL, Lausanne, Switzerland, \nNovember 4-5 2004 Year: 2004 Laboratories: IEL Record appears in: Scientific production and \ncompetences > STI - School of Engineering > IEL - Institute of Electrical Engineering > \nUNATTRIBUTED-IEL - IEL - Unattributed publications Presentations & Talks Work outside \nEPFL Published URL Export as: BibTeX | MARC | MARCXML | DC | EndNote | NLM | RefWorks \n| RIS View as: MARC | MARCXML | DC Add to your basket: Back to search Record created \n2011-01-06, last modified 2020-04-20 External link: Download fulltext URL Rate this document…",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Inversion-Coefficient Based Design of RF CMOS Low-Noise Amplifiers",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4263307/",
            "Abstract": "This paper presents a methodology for the design of a CMOS low-noise amplifier (LNA) operating at 5.5GHz. As an example, the design of a narrow-band cascode LNA intended for WiMax application in the frequency range from 5-6GHz is analyzed, using an 120nm CMOS technology. Trade-offs in the design, such as noise figure, gain, linearity are explored, based on the inversion coefficient and channel length of the MOS transistors. The design accounts for the effect of induced gate noise in the MOSFETs using the EKV3 model and accounts for non-ideal inductors. It is clearly shown how reduced channel length also leads to lower levels of inversion for best LNA performance.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Why‐and how‐to integrate Verilog‐A compact models in SPICE simulators",
            "Publication year": 2013,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cta.1833",
            "Abstract": "This article presents a fast and accurate way to integrate and validate Verilog‐A compact models in SPICE‐like simulators. Modifications in the models' Verilog‐A source code may be required prior to their conversion into low‐level C language by a code generator. The most common of these modifications is discussed. The generated C code is then directly compiled in the target simulator resulting in an equivalent SPICE model. The comparison between Verilog‐A and SPICE models in the same simulation environment, for simple and complex circuits, validates the procedure. Performance tests for demanding designs are carried out for both models. Results highlight the higher simulation speed and lower memory consumption of SPICE models. Copyright © 2012 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Determining MOSFET parameters in moderate inversion",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4295310/",
            "Abstract": "Deep submicron CMOS technology scaling leads to reduced strong inversion voltage range due to non-scalability of threshold voltage, while supply voltage is reduced. Moderate inversion operation therefore becomes increasingly important. In this paper, a new method of determining MOSFET parameters in moderate inversion is presented. Model parameters are determined using a constant current bias technique, where the biasing current is estimated from the transconductance-to-current ratio. This technique is largely insensitive to mobility effects and series resistance. Statistical data measured on 40 dies a 0.25 um standard CMOS technology are used for the illustration of this method.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Symmetrical unified compact model of short-channel double-gate MOSFETs",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110111003492",
            "Abstract": "An explicit charge-based unified compact drain current model for lightly doped or undoped DG MOSFETs is proposed. It takes into account the short-channel effects, the subthreshold slope degradation, the drain-induced barrier lowering and the channel length modulation effects. The model is valid and continuous in all regimes of operation and it has been validated by developing a Verilog-A code and comparing the model results of transfer and output characteristics with simulation results exhibiting an average error of about 3%. The efficient solution of the Lambert W function for the inversion charge and the symmetry of the model make it suitable for circuit simulation and allow fast and accurate simulations of the transistor characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Compact modeling of SiC and GaN junction FETs at high temperature",
            "Publication year": 2019,
            "Publication url": "https://www.scientific.net/MSF.963.683",
            "Abstract": "High temperatures and other harsh environments are domains of predilection for Junction FETs, particularly when wide band-gap semiconductors such as SiC or GaN are used. The present work describes the new compact model of double gate (DG) JFETs which is compared to TCAD simulations of SiC and GaN JFETs over a wide temperature range up to 500oC. The compact model is shown to be predictive of device behavior, for static (current-voltage) as well as dynamic (capacitance-voltage) behavior of long-channel DG JFETs.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:zLWjf1WUPmwC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Analog/RF Performance: Are SOI FinFETs better than DG SOI MOSFETs?",
            "Publication year": 2012,
            "Publication url": "http://mined.physics.auth.gr/project/wp-content/uploads/2014/09/23.-Analog-RF-Performance-Are-SOI-FinFETs-better-than-DG-SOI-MOSFETs.pdf",
            "Abstract": "FinFETs and planar single gate and double gate SOI MOSFETs is examined via extensive 3D device simulations. Well-designed DG MOSFETs attain higher values of cut-off frequency for both lower and higher drain currents, whereas FinFETs offer higher intrinsic gain while compromising cutoff frequency. For longer channel lengths, SG MOSFETs show slightly higher cut-off frequency in comparison to multi-gate (MG) MOSFETs, whereas MG MOSFETs exhibit higher cut-off frequency for lower channel lengths. A unique figure of merit, gain transconductance frequency product (GTFP) for best trade-off among gain, transconductance, and speed is compared. DG MOSFETs exhibit higher GTFP over a wide range of device scaling, thus remain a good candidate for analog/RF applications. Furthermore, the RF linearity performance of these devices has been examined.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measurement and modelling of 1/f noise in 180 nm NMOS and PMOS devices",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5733863/",
            "Abstract": "Bias dependence and scaling of 1/f noise is an important subject for the design of analog/RF integrated circuits in scaled CMOS technology. In this paper, we report on the behavior of low frequency noise, including experimental characterization and compact modeling for NMOS and PMOS devices in 180 nm CMOS technology. Aspects of bias dependence and scaling are examined. Input referred noise shows an important increase in strong inversion and a minimum in moderate inversion. The compact model approach is based on the charge-based model, including carrier number fluctuation, mobility fluctuation and resistance fluctuation noise mechanisms. The low frequency noise model is related closely to the underlying charge-based model, and is implemented in the context of the EKV3 compact MOSFET model. As a result, 1/f noise bias dependence and scaling is covered over a wide range of geometry and …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "4H-SiC VJFETs with self-Aligned contacts",
            "Publication year": 2015,
            "Publication url": "https://www.scientific.net/MSF.821-823.793",
            "Abstract": "Trenched-implanted-gate 4H–SiC vertical-channel JFET (TI-VJFET) have been fabricated with self-aligned nickel silicide source and gate contacts using a process sequence that greatly reduces process complexity as it includes only four lithography steps. The effect of the channel geometry on the electrical characteristics has been studied by varying its length (0.3 and 1.2 μm) and its width (1.5-5μm). The transistors exhibited high current handling capabilities (Direct Current density 330A/cm 2). The output current reduces with the increase of the measurements temperature due to the decrease of the electron mobility value. The voltage breakdown exhibits a triode shape, which is typical for a static-induction transistor operation.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:eflP2zaiRacC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "EKV3 compact modeling of MOS transistors from a 0.18 μm CMOS technology for mixed analog–digital circuit design at low temperature",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0011227508002129",
            "Abstract": "The standard version of the EKV3 compact model is evaluated for simulation of mixed analog–digital circuits working at low temperature (77–200 K). This evaluation is performed on a dual gate oxide CMOS technology with 0.18 μm/1.8 V and 0.35 μm/3.3 V MOSFET transistors. A detailed temperature analysis of some physical effects is performed. Specific effects, such as anomalous narrow channel effect, freeze-out in Lightly Doped drain (LDD) regions or quantization of the inversion charge, are observed at low or intermediate temperature. Some improvements of this compact model will allow a more accurate description of MOS transistors at low temperature.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:_kc_bZDykSQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Review of the EKV3. 0 MOSFET Model",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=13863837380917340037&hl=en&oi=scholarr",
            "Abstract": "❒ Pinch-off voltage is a function of gate voltage❒ Vp can be measured--moderate inversion method, M. Bucher ea. ICMTS’96❒ Used for parameter extraction (Vto, γ, Ψ0)❒ Slope factor is related to substrate effect & inverse weak inversion slope: S= 2.3* n v* Ut n v V",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Charge-Based Compact Model for Bias-Dependent Variability of 1/  Noise in MOSFETs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7579563/",
            "Abstract": "Variability of low frequency noise (LFN) in MOSFETs is bias-dependent. Moderate-to-large-sized transistors commonly used in analog/RF applications show 1/f-like noise spectra, resulting from the superposition of random telegraph noise. Carrier number and mobility fluctuations are considered as the main causes of LFN. While their effect on the bias-dependence of LFN has been well investigated, the way these noise mechanisms contribute to the bias-dependence of variability of LFN has been less well understood. LFN variability has been shown to be maximized in weak inversion (subthreshold), while increased drain bias also increases LFN variability. However, no compact model has been proposed to explain this bias-dependence in detail. In combination with the charge-based formulation of LFN, this paper proposes a new model for bias-dependence of LFN variability. Comparison with experimental data …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:N5tVd3kTz84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis of transconductances in deep submicron cmos with ekv 3.0",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=6848250134494809010&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimization of RF low noise amplifier design using analytical model and genetic computation",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8005220/",
            "Abstract": "This paper introduces a methodology for optimum low noise amplifier (LNA) design, using a combination of analytical model and genetic algorithms. The optimum operation is defined by a figure of merit (FoM) that considers both the power efficiency and the RF performance of the device. This FoM suggests that the optimum region of operation lies in the moderate inversion. This knowledge can be used as a strong starting point for the design and optimization procedures. Initially, the LNA component values are determined using the analytical model. The analytical procedure does not account for all parasitics of the active and in particular the passive components, leading to a sub-optimal design. Therefore, the final LNA design is generated using full circuit simulation, where a genetic algorithm takes the analytical design as a starting point, aiming at faster convergence. To demonstrate the effectiveness of the …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:NJ774b8OgUMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analytical MOS transistor modelling for analog circuit simulation",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Matt-Bucher/publication/37412857_Analytical_MOS_transistor_modelling_for_analog_circuit_simulation/links/573acc8208aea45ee83f9ba8/Analytical-MOS-transistor-modelling-for-analog-circuit-simulation.pdf",
            "Abstract": "La modélisation précise de transistors MOS pour la conception et la simulation de circuits est un défi constant à cause de la nature continuellement évolutive de la technologie CMOS. La modélisation avec maintien du sens physique est un défi encore plus grand pour la conception et la simulation de circuits analogiques. Dans ce cas, sont importantes non seulement les caractéristiques grand-signal du composant, mais encore plus les caractéristiques petit-signal, ainsi que le bruit. La simulation de circuits analogiques implique une utilisation créative de l'opération complexe et fortement non-linéaire du composant MOS. Les régimes opératoires optimaux doivent être choisis en faisant un compromis entre plusieures contraintes variables et souvent contradictoires.Ce sont des modèles de transistors MOS formulés de manière analytique qui sont utilisés le plus souvent pour aider à la conception de circuits CMOS analogiques et analogiques-digitaux mixtes. Les modèles disponibles dans les simulateurs de circuits les plus utilisés contiennent des expressions basées sur la physique et un degré variable d'empirisme. Ces modèles peuvent être adaptés aux différentes technologies CMOS en adaptant un certain nombre de paramètres, pour que le modèle puisse décrire les caractéristiques électriques du composant. Afin de rendre pratique l'utilisation d'un modèle, ce dernier doit être accompagné par des méthodes d'extraction de paramètres. Un mode1 de transistor MOS représente généralement un compromis entre les aspects de simplicité, de complexité, de base physique et d'empirisme, du nombre d'effets inclus, du nombre de paramètres, d …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ECSCRM 2016 Chairpersons",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7921199/",
            "Abstract": "The 11th European Conference on Silicon Carbide and Related Materials 2016 (ECSCRM 2016) was held at Porto Carras Resort, Halkidiki, Greece. The Conference involved 274 abstracts including 15 plenary and invited talks as well as 3 invited posters. The conference provided a scientific forum for 480 participants from 26 countries. ECSCRM is a biannual conference, which interleaves with the biannual International Conference on Silicon Carbide and Related Materials (ICSCRM). ECSCRM started at Heraklion, Crete, Greece, in 1996. The idea to organize a European conference on silicon carbide was born during discussions between partners of TECSICA, the first SiC related project funded by European Commission. Two of them (University of Montpellier II and Foundation for Research & Technology-Hellas/FORTH), have submitted a proposal to the European Commission requesting funding for launching …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending a 65nm CMOS process design kit for high total ionizing dose effects",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376561/",
            "Abstract": "Standard CMOS Process Design Kits (PDKs) do not address degradation the technology incurs when exposed to high Total Ionizing Dose (TID). Front-end electronics for the High-Luminosity Large Hadron Collider are expected to be exposed up to ten-fold doses. Bulk CMOS at 65 nm is a strong contender for such electronics due to a favorable trade-off among cost, performance, and TID-sensitivity. The present paper presents the extension of a foundry-provided PDK to cover also high TID effects. TID experiments have been carried out up to 500 Mrad. The PDK is based on binned BSIM4 models, which are adapted to different TID levels. Hence, designers may choose among different TID levels for their designs, contributing importantly to radiation-hard design practice.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:j8SEvjWlNXcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Charge-based modeling of long-channel symmetric double-gate junction FETs—Part II: Total charges and transcapacitances",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8374091/",
            "Abstract": "A compact model for the dynamic operation of double-gate junction field-effect transistors is established in this paper. Analytical model expressions are developed for the total node charges and transcapacitances valid from subthreshold to above threshold and from linear to saturation operation. The model is shown to conserve symmetry among source and drain, and circumvents problems at zero drain-to-source bias.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The foundations of the EKV MOS transistor charge-based model",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Jean-Michel-Sallese/publication/44795442_The_Foundations_of_the_EKV_MOS_Transistor_Charge-Based_Model/links/0046351f117a06ecfd000000/The-Foundations-of-the-EKV-MOS-Transistor-Charge-Based-Model.pdf",
            "Abstract": "THE FOUNDATIONS OF THE EKV MOS TRANSISTOR CHARGE-BASED MODEL Page 1 1 THE \nFOUNDATIONS OF THE EKV MOS TRANSISTOR CHARGE-BASED MODEL C. Enz, M. Bucher, \nA.-S. Porret, J.-M. Sallese and F. Krummenacher christian.enz@csem.ch S w is s Ce nter fo r E \nle c tro n ic s a n d Mic rotec hn o logy ÉCOLE POLYTECHNIQUE FÉDÉRALEDELAUSANNE \nÉCOLE POLYTECHNIQUE FÉDÉRALEDELAUSANNE ÉCOLE POLYTECHNIQUE \nFÉDÉRALEDELAUSANNE © C. Enz, April 2002 THE FOUNDATIONS OF THE EKV MOS \nTRANSISTOR CHARGE-BASED MODEL 2 TECHNOLOGY AND VOLTAGE SCALING Power \nSupply Voltage [V] 1.0 0.8 0.6 0.4 0.2 0.0 Lithography [µm] 6 5 4 3 2 1 0 6 5 4 3 2 1 0 3.3 Supply \nvoltage Threshold Voltage [V] Threshold voltage Page 2 2 © C. Enz, April 2002 THE \nFOUNDATIONS OF THE EKV MOS TRANSISTOR CHARGE-BASED MODEL 3 ❖ Technology in '…",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CMOS LNA design at 30 GHz—A case study",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6188915/",
            "Abstract": "This paper presents a case study of LNA design at 30 GHz. Two single-stage LNA topologies are implemented, namely a magnetic feedback LNA and a cascode LNA. The simulation results reveal that a single-stage LNA can deliver adequate power gain along with low noise figure and high linearity even at mm-wave frequencies. The cascode LNA topology, using SNIM is analyzed and described in detail. The post layout simulations give a forward gain (S 21 ) of 5.9 dB, a reverse isolation (-S 12 ) of 18.1 dB, an input reflection (S 11 ) of -11.8 dB and an output reflection (S 22 ) of -11.4 dB. The NF of the circuit is 3.9 dB while the corresponding IIP3 is 4.9 dBm. The power consumption is 7.2 mW and the circuit occupies 0.37 mm 2  including the pads. The design is implemented in TSMC's LP 90 nm CMOS process.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advances in MOSFET Charges Modeling",
            "Publication year": 2005,
            "Publication url": "https://pdfs.semanticscholar.org/3389/9faf30620f3df5057d3a8bfd6ce6716ad9c1.pdf",
            "Abstract": "Advances in MOSFET Charges Modeling Page 1 Workshop on Compact Models – Anaheim, \nMay 10-12, 2005 Advances in MOSFET Charges Modeling EKV3.0 MOSFET Model Matthias \nBucher Technical University of Crete (TUC) Antonios Bazigos National Technical University of \nAthens (NTUA) F. Krummenacher, J.-M. Sallese, C. Enz , W. Grabinski Swiss Federal Institute \nof Technology, Lausanne (EPFL) Page 2 © M. Bucher TUC 2005 2 Workshop on Compact \nModels – Anaheim, 10-12 May 2005 Outline ❖ Basic charge model structure – EKV model ❖ \nExtensions to charge model ✓ Total charges modeling ✓ Mobility modeling ✓ Noise modeling \n❖ Summary EKV3.0 ❖ Outlook: Double Gate (DG) modeling ❖ Summary Page 3 © M. Bucher \nTUC 2005 3 Workshop on Compact Models – Anaheim, 10-12 May 2005 Charge model \nextensions ❖ Charge model extensions for <100nm CMOS: ✓ Bias-dependent overlap & ✓ …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Moderate inversion: Analog and RF benchmarking with the EKV3 compact model",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6842122/",
            "Abstract": "In this paper the validity of the EKV3 advanced compact MOSFET model is verified with DC and RF measurements of a 90 nm CMOS low-power (LP) process. The model is capable of describing the edge conduction effect, mainly occurring in moderate levels of channel inversion. Non-linearities are extracted from DC measurements and the robustness of the model is also proven, in terms of RF figures of merit (FoM) suitable for RFIC design, for both n- and p-type MOS devices.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An adjusted constant-current method to determine saturated and linear mode threshold voltage of MOSFETs",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6003772/",
            "Abstract": "The constant-current (CC) method uses a current criterion to determine the threshold voltage ( V TH ) of metal-oxide-semiconductor (MOS) field-effect transistors. We show that using the same current criterion in both saturation and linear modes leads to inconsistent results and incorrect interpretation of effects, such as drain-induced barrier lowering in advanced CMOS halo-implanted devices. The generalized adjusted CC method is based on the theory of the charge-based MOS transistor model. It introduces an adjusted current criterion, depending on  V DS , allowing to coherently determine  V TH  for the entire range of  V DS  from linear operation to saturation. The method uses commonly available  I D  versus  V G  data with focus on moderate inversion. The method is validated with respect to the ideal surface potential model, and its suitability is demonstrated with technology-computer-aided-design data from a …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Aspects of High-Frequency Modeling of MOSFETs with EKV3",
            "Publication year": 2008,
            "Publication url": "https://infoscience.epfl.ch/record/162100",
            "Abstract": "Aspects of High-Frequency Modeling of MOSFETs with EKV3 - Infoscience English Français \nlogin Home > Aspects of High-Frequency Modeling of MOSFETs with EKV3 Infoscience \nInformation Usage statistics Files Aspects of High-Frequency Modeling of MOSFETs with \nEKV3 Bucher, Matthias ; Chalkiadaki, Maria-Anna ; Bazigos, Antonios Presented at: MOS-AK/ESSDERC/ESSCIRC \nWorkshop 2008, Edinburgh, Scotland, 19 September 2008 Year: 2008 Laboratories: IEL \nRecord appears in: Scientific production and competences > STI - School of Engineering > \nIEL - Institute of Electrical Engineering > UNATTRIBUTED-IEL - IEL - Unattributed publications \nPresentations & Talks Work outside EPFL Published URL Export as: BibTeX | MARC | \nMARCXML | DC | EndNote | NLM | RefWorks | RIS View as: MARC | MARCXML | DC Add \nto your basket: Back to search Record created 2011-01-06, last modified 2020-04-20 link: …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring theLight Edition’of the EKV3. 0 MOSFET Model",
            "Publication year": 2004,
            "Publication url": "https://infoscience.epfl.ch/record/162138",
            "Abstract": "Exploring the `Light Edition’ of the EKV3.0 MOSFET Model - Infoscience English Français login \nHome > Exploring the `Light Edition’ of the EKV3.0 MOSFET Model Infoscience Information \nUsage statistics Files Exploring the `Light Edition’ of the EKV3.0 MOSFET Model Bucher, \nMatthias ; Bazigos, Antonios ; Krummenacher, François ; Grabinski, Wladyslaw Presented at: \nMOS-AK Meeting 2004, Stuttgart, Germany, 7 May 2004 Year: 2004 Laboratories: IEL Record \nappears in: Scientific production and competences > STI - School of Engineering > IEL - Institute \nof Electrical Engineering > UNATTRIBUTED-IEL - IEL - Unattributed publications Presentations \n& Talks Work outside EPFL Published URL Export as: BibTeX | MARC | MARCXML | DC | \nEndNote | NLM | RefWorks | RIS View as: MARC | MARCXML | DC Add to your basket: Back \nto search Record created 2011-01-06, last modified 2020-04-20 External link: fulltext : 1 …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "CJM: A compact model for double-gate junction FETs",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8854243/",
            "Abstract": "The double-gate (DG) junction field-effect transistor (JFET) is a classical electron device, with a simple structure that presents many advantages in terms of device fabrication but also its principle of operation. The device has been largely used in low-noise applications, but also more recently, in power electronics. Furthermore, co-integration of JFET with CMOS technology is attractive. Physics-based compact models for JFETs are however scarce. In this paper, an analytical, charge-based model is established for the mobile charges, drain current, transconductances and transcapacitances of symmetric DG JFETs, covering all regions of device operation, continuously from subthreshold to linear and saturation operation. This charge-based JFET model (called CJM) constitutes the basis of a full compact model of the DG JFET for analog, RF, and digital circuit simulation.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analog performance of advanced CMOS in weak, moderate, and strong inversion",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5551298/",
            "Abstract": "Reduced overdrive voltage in advanced CMOS technology requires analog circuitry to operate in moderate and weak inversion. A systematic analysis of scaling of transconductance, output conductance and intrinsic gain with technology, channel length but also bias conditions is presented for a deep submicron CMOS process. The analog properties are represented versus normalized current, so as to provide an easy means of interpretation and comparison. Measured transconductances and derived quantities such as intrinsic gain are investigated for NMOS and PMOS devices of an 110 nm CMOS technology, covering a large range of channel length and inversion conditions. This reveals novel properties of advanced CMOS technology and some useful guidelines for designers are given.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A scalable advanced RF IC design‐oriented MOSFET model",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mmce.20288",
            "Abstract": "This article presents a validation of the EKV3 MOSFET compact model dedicated to the design of analogue/RF ICs using advanced CMOS technology. The EKV3 model is compared with DC, CV and RF measurements up to 20 GHz of a 110 nm CMOS technology. The scaling behaviour over a large range of channel lengths and bias conditions is presented. Long‐channel devices show significant non‐quasi static effects while in short‐channel devices the parasitics modelling is critical. This is illustrated with Y‐parameters and ft vs. ID in NMOS and PMOS devices, showing good overall RF modelling abilities of the EKV3 MOSFET model. © 2008 Wiley Periodicals, Inc. Int J RF and Microwave CAE, 2008.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:Se3iqnhoufwC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "CMOS RF noise, scaling, and compact modeling for RFIC design",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6569520/",
            "Abstract": "This work presents an analysis of high frequency noise and linearity performance of a 90 nm CMOS process. Measurements are performed for a wide range of nominal gate lengths and bias points at high frequency. Modeling is based on the EKV3 compact model in Spectre RF circuit simulator from Cadence. The model shows correct scalability for noise and linearity accounting for short channel effects (SCEs), such as velocity saturation (VS) and channel length modulation (CLM). Results are presented versus a common measure of channel inversion level, named inversion coefficient. Optimum performance is shown to gradually shift from higher to lower levels of moderate inversion, when scaling from 240 nm to 100 nm. The same trend is observed from investigating the transconductance frequency product (TFP) of a common-source (CS) LNA for technology nodes ranging from 180 nm to 22 nm.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Geometry-and Bias-Dependence of Normalized Transconductances in Deep Submicron CMOS",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=13464745470453324206&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The EKV 3.0 compact MOS transistor model: accounting for deep-submicron aspects",
            "Publication year": 2002,
            "Publication url": "http://epicentertech.com/Research/Device_Modeling/EKV_MOS_Model/EKV_Modeling_Docs/EKV_Intro.pdf",
            "Abstract": "The EKV 3.0 compact MOS transistor model for advanced IC design is presented. Its basis is an ideal analytical charge-based model including static to non-quasistatic dynamic aspects and noise. The ideal model is extended to account for the major second-order effects in deep-submicron CMOS technologies resulting from technology scaling and from short-channel effects. It is shown how these nonidealities affect the ideal device characteristics. The increasingly important moderate and weak inversion operation are emphasized. The hierarchical structure of the model is presented, essential features and effects are outlined and illustrated with respect to device characteristics in deepsubmicron CMOS.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Compact model for variability of low frequency noise due to number fluctuation effect",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7599686/",
            "Abstract": "Variability of low frequency noise (LFN) in MOSFETs is both geometry- and bias-dependent. RTS noise prevails in smaller devices where noise deviation is mostly area-dominated. As device dimensions increase, operating conditions determine noise variability maximizing it in weak inversion and increasing it with drain voltage. This dependence is shown to be directly related with fundamental carrier number fluctuation effect. A new bias- and area-dependent, physics-based, compact model for 1/f noise variability is proposed. The model exploits the log-normal behavior of LFN. The model is shown to give consistent results for average noise, variance, and standard deviation, covering bias-dependence and scaling over a large range of geometry.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scaling issues in an 0.1 μm CMOS technology with EKV3. 0",
            "Publication year": 2006,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/35174",
            "Abstract": "Scaling issues in an 0.1μm CMOS technology with EKV3.0 Αρχική Σελίδα → Κεντρική \nΒιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε συνέδρια → \nΕμφάνιση Τεκμηρίου HEAL DSpace Scaling issues in an 0.1μm CMOS technology with \nEKV3.0 Αποθετήριο DSpace/Manakin Scaling issues in an 0.1μm CMOS technology with \nEKV3.0 Kitonaki, E; Bazigos, A; Bucher, M; Puchner, H; Bhardwaj, S; Papananos, Y URI: http://hdl.handle.net/123456789/35174 \nΗμερομηνία: 2006 Εμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος \nΜορφότυπο Προβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το \nτεκμήριο εμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε συνέδρια \nΠεριήγηση Σε όλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς \nΤίτλοι Θέματα Αυτή η Συλλογή Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Ο / …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:4MWp96NkSFoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Compact capacitance model of undoped or lightly doped ultra-scaled triple-gate FinFETs",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6352877/",
            "Abstract": "A charge-based compact capacitance model has been developed describing the capacitance-voltage characteristics of undoped or lightly doped ultra-scaled triple-gate fin field-effect transistors. Based on a unified expression for the drain current and the inversion sheet charge density, i.e., the Ward-Dutton linear-charge-partition method and the drain current continuity principle, all trans-capacitances are analytically derived. The developed capacitance model is valid in all regions of operation, from the subthreshold region to the strong inversion region and from the linear region to the saturation region. The gate and source trans-capacitances have been validated by 3-D numerical simulations over a large range of device dimensions. The parameters of the capacitance model can be used to accurately predict the transfer and output characteristics of the transistors, making this compact model very useful for circuit …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MOS-AK: Open Compact Modeling Forum",
            "Publication year": 2007,
            "Publication url": "https://www.iue.tuwien.ac.at/pdf/ib_2007/hashed_links/5d4PPhrSJGXXQJr4Y_us.pdf",
            "Abstract": "MOS-AK is an European, independent compact modeling forum created by a group of the engineers, researchers and compact modeling enthusiasts to promote advanced compact modeling techniques and the model standardization using the high level behavioral modeling languages such as VHDL-AMS and Verilog-A. This invited paper summarizes recent MOS-AK activities and presents advanced topics on the MOSEFTs modeling for low power, analog/RF as well as high voltage applications, gate-all-around MOSFETs ballistic nanoscale modeling solutions, multidomain microsystem modeling, discusses links between compact models and design methodologies and finally introduces elements of the compact models standardization.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FOSS EKV2. 6 at GitHub",
            "Publication year": 2019,
            "Publication url": "http://repository.londonmet.ac.uk/5412/",
            "Abstract": "The EKV2.6 MOSFET compact model has had a considerable impact on the academic and industrial community of analog integrated circuit design, since its inception in 1996. The model is available as a free open-source software (FOSS) tool coded in Verilog-A. The present paper provides a short review of foundations of the model and shows its capabilities via characterization and modeling based on a test chip in 180 nm CMOS fabricated via Europractice.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:BwyfMAYsbu0C",
            "Publisher": "MOS-AK"
        },
        {
            "Title": "Methodology for 1/f noise parameter extraction for high-voltage MOSFETs",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110114001968",
            "Abstract": "This paper proposes a detailed low frequency noise (LFN) parameter extraction method for high-voltage (HV) MOSFETs at low (50 mV) and medium (3 V) drain biases. In Vd = 3 V region, noise coming from the channel is dominant while in linear region there is an extra contribution of noise from the drift region part especially for long-channel devices in strong inversion region. Flicker noise of 50 V and 20 V N- and P-channel HV-MOSFETs was measured over a large current range from weak to strong inversion, making possible the extraction of the noise parameters related to the different noise contributions, such as mobility fluctuations in low current regime, carrier number fluctuations and Coulomb scattering in medium and high current regime. In some cases, series resistance noise contribution especially at high current is apparent as well. The parameter extraction procedure is devised for a recently established …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:uWQEDVKXjbEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Variability of Low Frequency Noise and mismatch in CORNER DOPED and standard CMOS technology",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7985953/",
            "Abstract": "Variability of Low Frequency Noise (LFN) and Random Telegraph Noise (RTN) is a main concern in analog CMOS integrated circuits. For instance circuits such as current reference, SRAM, ring oscillators are ultimately limited by noise level and mismatch. In this work, CORNER DOPED devices have been fabricated, measured, and finally compared with standard CMOS technology with particular emphasis on weak inversion region. The proposed device shows improved gate voltage mismatch in weak inversion with respect to standard CMOS for a given geometry. Relying on the carrier number fluctuation theory, the Low Frequency Noise and its variability have been represented by a compact model.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:kzcrU_BdoSEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advancements in DC and RF Mosfet modeling with the EPFL-EKV charge based model",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=8556579795305185978&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A physics-based analytical compact model for the drift region of the HV-MOSFET",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5741835/",
            "Abstract": "This paper presents a novel physics-based analytical compact model for the drift region of a high-voltage metal-oxide-semiconductor field-effect transistor (HV-MOSFET). According to this model, the drift region is considered as a simple 1-D problem, just as that of a low-voltage inner MOS transistor. It exploits the charge-sheet approximation and performs linearization between the charge in the drift region and the surface potential. The drift region model combined with the standard charge-sheet MOS model for the low-voltage part adds up to a complete HV-MOSFET model, which is verified against technology computer-aided design simulations and measurements of HV-MOS transistors. The comparisons demonstrate its accurate physics foundations and underline that this novel approach to the modeling of the drift region of the HV-MOSFET is promising.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MOSFET modeling and parameter extraction for low temperature analog circuit design",
            "Publication year": 2002,
            "Publication url": "https://jp4.journaldephysique.org/articles/jp4/abs/2002/03/jp4Pr3p51/jp4Pr3p51.html",
            "Abstract": "SPICE parameters needed for simulation of CMOS readout circuits used in infrared image sensors cooled at low temperature are extracted using a specific MOSFET model based on the EKV 2.6 compact charge model. It is used below 200 K and is very well adapted to analog simulation in weak and moderate inversion regimes. It was successively applied on different CMOS processes from different foundries. The model's performance is demonstrated in this work for a 0.35 m N+ single gate process. Experimental results on the evolution of the low frequency noise and the transistor matching parameters between 300 K and 77 K are also presented. Contrary to the NMOS transistors, the threshold voltage differences of buried channel PMOS transistors are less scattered as the temperature is lowered. The same trend with temperature is observed on the flicker noise parameter.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:5nxA0vEk-isC",
            "Publisher": "EDP sciences"
        },
        {
            "Title": "Advanced compact modeling of the deep submicron technologies",
            "Publication year": 2000,
            "Publication url": "http://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-article-BPS2-0011-0055",
            "Abstract": "EN The technology of CMOS large-scale integrated circuits (LSI's) achieved remarkable advances over last 25 year and the progress is expected to continue well into the next century. The progress has been driven by the downsizing of the active devices such as MOSFETs. Approaching these dimensions, MOSFET characteristics cannot be accurately predicted using classical modeling methods currently used in the most common MOSFET models such as BSIM, MM9 etc, without introducing large number of empirical parameters. Various physical effects that needed to be considered while modeling UDSM devices: quantization of the inversion layer, mobility degradation, carrier velocity saturation and overshoot, polydepletion effects, bias dependent source/drain resistances and capacitances, vertical and lateral doping profiles, etc. In this paper, we will discuss the progress in the CMOS technology and the anticipated difficulties of the sub-0.25 žm LSI downsizing. Subsequently, basic MOSFET modeling methodologies that are more appropriate for UDSM MOSFETs will be presented as well. The advances in compact MOSFET devices will be illustrated using application examples of the EPFL EKV model",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Charge-based model for junction FETs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8357582/",
            "Abstract": "We present a unified charge-based model for double-gate and cylindrical architectures of junction field-effect transistors (JFETs). The central concept is to consider the JFET as a junctionless FET (JLFET) with an infinitely thin insulating layer, leading to analytical expressions between charge densities, current, and voltages without any fitting parameters. Assessment of the model with numerical technology computer-aided design simulations confirms that holding the JFET as a special case of the JLFET is justified in all the regions of operation, i.e., from deep depletion to flat-band and from linear to saturation.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:fEOibwPWpKIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling of high total ionizing dose (TID) effects for enclosed layout transistors in 65 nm bulk CMOS",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8539806/",
            "Abstract": "High doses of ionizing radiation drastically impair the electrical performance of CMOS technology. Enclosed gate layout remains an effective means to reduce this impact. Nevertheless, high total ionizing dose (TID) effects remain strong. The paper presents an effective approach to analytically model high TID effects in both NMOS and PMOS transistors with enclosed-gate layout in 65 nm commercial CMOS.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:yB1At4FlUx8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Inversion charge linearization in MOSFET modeling and rigorous derivation of the EKV compact model",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110102003362",
            "Abstract": "In this paper, the implications of inversion charge linearization in compact MOS transistor modeling are discussed. The charge-sheet model provides the basic relation among inversion charge and applied potentials, via the implicit surface potential. A rigorous derivation of simpler relations among inversion charge and applied external potentials is provided, using the technique of inversion charge linearization versus surface potential. The new concept of the pinch-off surface potential and a new definition of the inversion charge linearization factor are introduced. In particular, we show that the EKV charge-based model can be considered as an approximation to the more general approach presented here. An improvement to the EKV charge-based model is proposed in the form of a more accurate charge–voltage relationship. This model is analyzed in detail and shows an excellent agreement with the charge sheet …",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An Unified Charge-Based Common Core for Junctionless and Junction FETs",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=4438812974981594849&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:2KloaMYe4IUC",
            "Publisher": "Institute of Electrical and Electronics Engineers"
        },
        {
            "Title": "Scalable high-frequency modelling with EKV3",
            "Publication year": 2008,
            "Publication url": "https://www.mos-ak.org/eindhoven/papers/03_Bucher_MOS-AK_Eindhoven.pdf",
            "Abstract": "Scalable high-frequency modelling with EKV3 Page 1 Scalable high-frequency modelling with \nEKV3 Matthias Bucher Technical University of Crete, Chania, Greece Antonios Bazigos National \nTechnical University of Athens, Athens, Greece MOS-AK High-Tech Campus, Eindhoven, 4 \nApril 2008 Page 2 M. Bucher TUC MOS-AK Eindhoven 4/4/2008 2 Acknowledgments ❖ \nCooperations with: ❑ S. Yoshitomi, Toshiba ❑ W. Kraus, Atmel, M. Schroter, TU Dresden, P. \nSakalas, FPL ❖ EKV3 model Team: ❑ F. Krummenacher, J.-M. Sallese, C. Enz, A.-S. Roy, EPFL \n❑ W. Grabinski, GMC Suisse ❖ EDA support: ❑ Mentor Graphics, Dolphin Integration, Cadence \nPage 3 M. Bucher TUC MOS-AK Eindhoven 4/4/2008 3 Outline ❖ Introduction ❖ EKV3 \ncompact MOSFET model ❖ RF measurements in advanced RFCMOS ∎ 180nm RF CMOS ∎ \n110nm RF CMOS ∎ 90nm RF CMOS ❖ Conclusions Page 4 M. Bucher TUC MOS-AK 4/4/4 '…",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of harmonic distortion in deep submicron CMOS",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1399701/",
            "Abstract": "This paper presents a study of harmonic distortion measurement and modeling in an 0.14 um CMOS technology. Measurements and simulation of DC characteristics, as well as high-frequency harmonic distortion are presented. The new EKV3.0 compact MOSFET model is used to model DC and harmonic distortion characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Impact of design engineering on RF linearity and noise performance of nanoscale DG SOI MOSFETs",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6523504/",
            "Abstract": "The influence of different design engineering on linearity and noise performance of nanoscale double gate MOSFETs is analyzed using TCAD device simulations. We observe that graded channel (GC) architecture improves the RF linearity and noise performance of DG MOSFETs when compared with dual material gate (DMG) engineering. The performance of DMG devices is comparable to GC only for longer channel lengths. The combination of GC and DMG, i.e. Graded channel dual material gate (GCDMG) outperforms other device configurations over a wide range of scaling.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Forward and Reverse Operation of Enclosed-Gate MOSFETs and Sensitivity to High Total Ionizing Dose",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8787098/",
            "Abstract": "Frond-end electronics at the High Luminosity-Large Hadron Collider (HL-LHC) at CERN, will be exposed to ten-fold radiation doses. The use of enclosed gate (EG) MOSFETs of 65 nm Bulk CMOS process, is considered to be a viable solution in order to suppress performance degradation effects that occur after high TID exposure. The present paper presents a detailed analysis of the functionality of EG MOSFETs operating under high TID, taking into accountspecific layout characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:epqYDVWIO7EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient channel segmentation approach for a large-signal NQS MOSFET model",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110107002985",
            "Abstract": "This paper presents an efficient formulation of a channel segmentation based approach to non-quasi-static modelling of the MOS transistor, in the context of a charge-based MOSFET model. In this minimal channel segmentation approach, only the essential charge equations are evaluated for each channel segment while other effects are handled at device level. As a result, simulation time is drastically reduced compared to a full channel segmentation approach. The model is validated versus measurement up to 10 GHz and passes relevant benchmark tests.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:kNdYIx-mwKoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Modelling of 4H-SiC VJFETs with self-aligned contacts",
            "Publication year": 2016,
            "Publication url": "https://www.scientific.net/MSF.858.913",
            "Abstract": "Purely vertical 4H-SiC JFETs have been modeled by using three different approaches: the analytical model, the finite element model and the compact model. The results of the modeling have been compared with experimental results on a series of fabricated self-aligned devices with two different channel lengths (0.3 and 1.1 μm) and various channel widths (1.5, 2, 2.5, 3, 4 and 5 μm). For all the considered models IV and CV characteristics could be satisfactorily simulated.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:XiVPGOgt02cC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Analysis of transconductances at all levels of inversion in deep submicron CMOS",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1046464/",
            "Abstract": "This paper presents an in-depth analysis of transconductances in CMOS for advanced analog IC design. Transconductances in a 0.25 /spl mu/m CMOS technology have been measured over a large range of geometries and bias conditions. Gate (g/sub mg/), source (g/sub ms/), drain (g/sub md/) and bulk (g/sub mb/) transconductances are consistently normalized and represented vs. inversion coefficient (IC) from very weak to moderate and strong inversion. The ideal transconductance behavior in particular in weak inversion is analyzed via the analytical structure of the EKV MOSFET model. The new EKV 3.0 MOSFET model shows excellent abilities to correctly represent transconductances at all levels of inversion and channel lengths.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analog/RF figures of merit of advanced DG MOSFETs",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6188900/",
            "Abstract": "Analog/RF performance of gate stack dual material double gate (GSDMDG) and graded channel gate stack double gate (GCGSDG) has been examined by ATLAS device simulation, including quantum confinement. We propose two new analog/RF figures of merit, 1) gain frequency product (GFP) which combines both low- and high-frequency aspects of device operation, 2) gain transconductance frequency product (GTFP) that includes both the switching speed and intrinsic gain of the device and is very useful for circuit design. The GCGSDG shows higher transconductance frequency product (TFP) and is a good candidate for high speed switching applications. However, GSDMDG outperforms other devices in terms of GTFP.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Accounting for quantum effects and polysilicon depletion in an analytical design-oriented MOSFET model",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-7091-6244-6_66",
            "Abstract": "An analytical MOSFET model is presented that accounts for energy quantization in inversion charge and depletion in the poly gate. The model consistently describes effects on charges, transcapacitances, drain current and transconductances in all regions of operation, depending on five physical device parameters and bias conditions. Compari-son to experimental data is provided and parameter extraction briefly discussed. The model offers manageable equations providing insight into the physical phenomena, thereby supporting analog circuit design practice as well as efficient circuit simulation.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer, Vienna"
        },
        {
            "Title": "The EKV3 MOS Transistor Model",
            "Publication year": 2006,
            "Publication url": "https://infoscience.epfl.ch/record/162101",
            "Abstract": "The EKV3 MOS Transistor Model - Infoscience English Français login Home > The EKV3 \nMOS Transistor Model Infoscience Information Usage statistics Files The EKV3 MOS \nTransistor Model Bazigos, Antonios ; Bucher, Matthias ; Krummenacher, François Presented \nat: MOS-AK/ESSDERC/ESSCIRC Workshop 2006, Montreux, Switzerland, 22 September \n2006 Year: 2006 Laboratories: IEL Record appears in: Scientific production and \ncompetences > STI - School of Engineering > IEL - Institute of Electrical Engineering > \nUNATTRIBUTED-IEL - IEL - Unattributed publications Presentations & Talks Work outside \nEPFL Published URL Export as: BibTeX | MARC | MARCXML | DC | EndNote | NLM | \nRefWorks | RIS View as: MARC | MARCXML | DC Add to your basket: Back to search \nRecord created 2011-01-06, last modified 2020-07-30 External link: Download fulltext URL \nRate this document: 1 2 3 4 5 (Not yet reviewed) , -…",
            "Abstract entirety": 0,
            "Author pub id": "zgJbCb0AAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of drain bias dependence of 1/f noise in HV-MOSFETs",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7288615/",
            "Abstract": "The behavior and dependence of 1/f noise versus drain bias in high-voltage (HV-)MOSFETs is examined in this paper. Low frequency noise of 50V N-and P-channel HV-MOSFETs was measured over a large range of gate and drain bias conditions. Drain voltage steps were chosen very small in linear region while enough points were also measured in saturation regime up to 20V. Recent work on characterization and modelling on flicker noise of HV devices proved that while the overall noise is mostly dominated by the noise originating in the channel, the drift-region-generated noise is apparent only in linear operation especially in strong inversion region of long channel devices. In order this to be clear, this work focuses on the behavior of flicker noise vs. drain bias for all inversion regime.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comparison of 0.35 and 0. 21µm CMOS technologies for low temperature operation (77 K–200 K) and Analog Circuit Design",
            "Publication year": 2004,
            "Publication url": "https://brionnais.fr/pm/doc/33.pdf",
            "Abstract": "This paper deals with the simulation of hybrid CMOS readout circuits working at low or at intermediate temperature, typically 77 K, 130 K or 200 K, such as those used in high performance infrared image sensors. SPICE parameters of transistors, including DC, AC, 1/f noise and matching parameters, are mandatory for design and simulation of such circuits. However CMOS foundries do not provide full sets of MOSFET parameters for simulation at temperature lower than-55 C (≈ 220 K). So these MOSFET parameters must be extracted prior to circuit simulation. Furthermore the used MOSFET model must address the important weak and moderate inversion regimes where most of the transistors of the CMOS readout circuits are operating. In this work we use a specific model based on the EKV 2.6 compact charge model formalism [1]. This model was previously described and applied to different CMOS bulk processes such as 0.7 µm/5 V [2], 0.5-0.35 µm/3.3 V [3] and 0.21 µm/1.8 V [4] from different foundries optimized for room temperature operation. The model’s performance is described in this paper for two commercial processes from the same foundry, namely a 0.35 µm/3.3 V and a 0.21 µm/1.8 V CMOS technology. As noise is a key concern in analog circuits, experimental results on the low frequency noise parameters for both NMOS and PMOS transistors at low temperature from these two processes are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "European Project",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=7814469543665640597&hl=en&oi=scholarr",
            "Abstract": "Accurate simulation of CMOS RF integrated circuits requires dedicated RF MOSFET models. In the GHz frequency range, the effects related to the extrinsic parasitic effects are becoming increasingly important with respect to the intrinsic operation of the device. Special attention has to be paid to the effects related to gate and substrate resistivities. In the present approach two additional resistances, one in series with the Gate terminal and one in series with the Bulk terminal are used to model the gate and substrate resistivities. The EPFL-EKV MOSFET model (http://legwww. epfl. ch/ekv/) is used to represent the intrinsic part of the MOSFET.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A compact model for static and dynamic operation of symmetric double-gate junction FETs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8486848/",
            "Abstract": "The present work describes a novel charge-based compact model of the symmetric double-gate junction field effect transistor (DG JFET) for circuit simulation. The model is physics-based and addresses static and capacitive behavior of the JFET. The model covers all regions of device operation of the depletion mode JFET, relies only on physical and electrical parameters of the device, and includes short-channel effects. The model is validated with respect to TCAD simulation as well as with respect to measurements from JFETs. The model is implemented in SPICE circuit simulators using Verilog-A based code.",
            "Abstract entirety": 1,
            "Author pub id": "zgJbCb0AAAAJ:9Nmd_mFXekcC",
            "Publisher": "IEEE"
        }
    ]
}]