[{
    "name": "Μαρία Νικολαϊδη",
    "romanize name": "Maria Nikolaidi",
    "School-Department": "Πληροφορικής και Τηλεματικής",
    "University": "hua",
    "Rank": "Καθηγητής",
    "Apella_id": 19523,
    "Scholar name": "Maria Nikolaidi",
    "Scholar id": "0O0Nu2cAAAAJ",
    "Affiliation": "University of Greenwich",
    "Citedby": 662,
    "Scholar url": "https://scholar.google.com/citations?user=0O0Nu2cAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "An ecological stock-flow-fund modelling framework",
            "Publication year": 2014,
            "Publication url": "http://www.postkeynesian.net/downloads/soas15/YD290515.pdf",
            "Abstract": "This paper develops an ecological stock-flow-fund (ESFF) modelling framework that provides an integrated platform for the analysis of the interactions between the ecosystem, the financial system and the macroeconomy. The ESFF framework has three distinct features. First, it formulates explicitly the monetary stocks and flows and the physical stocks and flows taking into account the accounting principles and the laws of thermodynamics. Second, it pays particular attention to the distinction between stock-flow resources and fund-service resources and formulates the interaction of funds with monetary and physical stocks and flows. Third, it allows an explicit analysis of the various stock-flow-fund channels through which the stability of the ecosystem, the financial system and the macroeconomy are interconnected. The paper illustrates how the ESFF framework can form the basis for the combined examination of ecological, financial and macroeconomic issues. In so doing, the suggested framework contributes to the development of an ecological macroeconomics in which finance plays a nonneutral role and physical and monetary variables are examined in an interconnected and consistent way.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How can green differentiated capital requirements affect climate risks? A dynamic macrofinancial analysis",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1572308921000310",
            "Abstract": "Using an ecological macrofinancial model, we explore the potential impact of the ‘green supporting factor’ (GSF) and the ‘dirty penalising factor’ (DPF) on climate-related financial risks. We identify the transmission channels by which these green differentiated capital requirements (GDCRs) can affect credit provision and loan spreads, and we analyse these channels within a dynamic framework in which climate and macrofinancial feedback effects play a key role. Our main findings are as follows. First, GDCRs can reduce the pace of global warming and decrease thereby the physical financial risks. This reduction is quantitatively small, but is enhanced when the GSF and the DPF are implemented simultaneously or in combination with green fiscal policies. Second, the DPF reduces banks’ credit provision and leverage, making them less fragile. Third, both the DPF and the GSF generate some transition risks: the GSF …",
            "Abstract entirety": 0,
            "Author pub id": "0O0Nu2cAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How can green differentiated capital requirements affect climate risks?",
            "Publication year": 2021,
            "Publication url": "https://ideas.repec.org/p/imk/fmmpap/63-2021.html",
            "Abstract": "Using an ecological macrofinancial model, we explore the potential impact of the `green supporting factor' (GSF) and the `dirty penalising factor' (DPF) on climate-related financial risks. We identify the transmission channels by which these green differentiated capital requirements (GDCRs) can affect credit provision and loan spreads, and we analyse these channels within a dynamic framework in which climate and macrofinancial feedback effects play a key role. Our main findings are as follows. First, GDCRs can reduce the pace of global warming and decrease thereby the physical financial risks. This reduction is quantitatively small, but is enhanced when the GSF and the DPF are implemented simultaneously or in combination with green fiscal policies. Second, the DPF reduces banks' credit provision and leverage, making them less fragile. Third, both the DPF and the GSF generate some transition risks: the GSF increases bank leverage because it boosts green credit and the DPF increases loan defaults since it reduces economic activity. These effects are small in quantitative terms and are attenuated when there is a simultaneous implementation of the DPF and the GSF. Fourth, fiscal policies that boost green investment amplify the transition risks of the GSF and reduce the transition risks of the DPF; the combination of green fiscal policy with the DPF is thereby a potentially effective climate policy mix from a financial stability point of view.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:dhFuZR0502QC",
            "Publisher": "IMK at the Hans Boeckler Foundation, Macroeconomic Policy Institute"
        },
        {
            "Title": "Climate change, financial stability and monetary policy",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921800917315161",
            "Abstract": "Using a stock-flow-fund ecological macroeconomic model, we analyse (i) the effects of climate change on financial stability and (ii) the financial and global warming implications of a green quantitative easing (QE) programme. Emphasis is placed on the impact of climate change damages on the price of financial assets and the financial position of firms and banks. The model is estimated and calibrated using global data and simulations are conducted for the period 2016–2120. Four key results arise. First, by destroying the capital of firms and reducing their profitability, climate change is likely to gradually deteriorate the liquidity of firms, leading to a higher rate of default that could harm both the financial and the non-financial corporate sector. Second, climate change damages can lead to a portfolio reallocation that can cause a gradual decline in the price of corporate bonds. Third, climate-induced financial instability …",
            "Abstract entirety": 0,
            "Author pub id": "0O0Nu2cAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Current account imbalances and financial fragility in the Eurozone: a stock-flow consistent approach",
            "Publication year": 2018,
            "Publication url": "https://www.boeckler.de/pdf/v_2018_10_26_mantes.pdf",
            "Abstract": "This paper builds a stock-flow consistent (SFC) macrodynamic model of the Eurozone that (i) can analyse simultaneously the role of credit and competitiveness in the widening of current account imbalances and (ii) can offer a comparative evaluation of wage, fiscal and macroprudential policies that have been suggested to address these imbalances. The model consists of a Northern and a Southern region. The Northern region is characterised by high export capacity and a large tradable sector while the Southern region has limited export capacity and a small tradable sector. Our preliminary simulation analysis shows that an increase in the credit inflows from the Northern region into the Southern region leads to a temporary increase in economic growth in the Southern region. However, this is accompanied by an increase in the leverage of firms and an increase in the current account deficit that ultimately lead to lower economic growth. Similar effects are found in the case in which there is a reduction in the interbank interest rate at which the Southern commercial banks borrow. Our model is also used to examine the effects of wage, fiscal and macroprudential policies on financial fragility and current account imbalances.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The financial fragility and the crisis of the Greek government sector",
            "Publication year": 2014,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/02692171.2013.858667",
            "Abstract": "The purpose of this paper is to develop Minskyan financial fragility indices for the government sector and to examine the financial structure of the Greek government before and after the onset of the sovereign debt crisis in 2009. We provide empirical evidence that clearly shows the growing financial fragility of the Greek public sector in the 2000s. We also assess the effectiveness of the implemented bailout adjustment programmes in Greece and claim that the conducted austerity measures and fiscal consolidation have not significantly improved the financial posture of the Greek government sector. We argue that the implementation of fiscal and wage austerity in an economy that lacks structural competitiveness produces prolonged recession and unemployment with adverse feedback effects on the financial fragility of the government.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Decarbonising is easy: Beyond market neutrality in the ECB's corporate QE",
            "Publication year": 2020,
            "Publication url": "https://eprints.soas.ac.uk/34178",
            "Abstract": "Christine Lagarde, the President of the European Central Bank (ECB), has recently promised to explore every avenue for greening the ECB’s operations, including its quantitative easing (QE) programme. Yet the current corporate QE programme remains biased towards carbon-intensive sectors: these sectors are over-represented in the ECB purchases, when compared to their contribution to the euro area employment and economic activity. An important consequence of the carbon bias is that it may lower the cost of borrowing (an implicit subsidy) and encourage more debt issuance by the most carbon intensive firms relative to low-carbon firms. By favouring access to finance for highly polluting companies, this carbon bias is an important barrier to the decarbonisation of the euro area economies. We argue that the ECB should abandon its market neutrality approach, the key driver of this carbon bias, and adopt alternative low-carbon strategies. We suggest two such strategies in which carbon-intensive bonds are replaced with more climate-friendly bonds. These strategies would significantly reduce the climate footprint of the ECB corporate QE and would make companies’ access to finance more aligned with the targets of the Paris Agreement.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:aqlVkmm33-oC",
            "Publisher": "New Economics Foundation"
        },
        {
            "Title": "Fiscal policy and ecological sustainability: A post-Keynesian perspective",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-23929-9_7",
            "Abstract": "Fiscal policy has a strong role to play in the transition to an ecologically sustainable economy. This contribution critically discusses the way that green fiscal policy has been analysed in both conventional and post-Keynesian approaches. It then uses a recently developed post-Keynesian ecological macroeconomic model in order to provide a comparative evaluation of three different types of green fiscal policy: carbon taxes, green subsidies and green public investment. We show that (i) carbon taxes reduce global warming but increase financial risks due to their adverse effects on the profitability of firms and credit availability; (ii) green subsidies and green public investment improve ecological efficiency, but their positive environmental impact is partially offset by their macroeconomic rebound effects; and (iii) a green fiscal policy mix derives better outcomes than isolated policies. Directions for future heterodox …",
            "Abstract entirety": 0,
            "Author pub id": "0O0Nu2cAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effects of income distribution and fiscal policy on aggregate demand, investment and the budget balance: the case of Europe",
            "Publication year": 2019,
            "Publication url": "https://academic.oup.com/cje/article-abstract/44/6/1221/5760730",
            "Abstract": "This paper develops a multi-country post-Kaleckian model that incorporates the role of the government. One key novelty of the model is that it integrates cross-country effects of changes in both income distribution and fiscal policy. The model is used to estimate econometrically the effects of income distribution and fiscal policy on the components of aggregate demand and the budget balance in EU15 countries. The results show that a simultaneous increase in the wage share in all EU15 countries would increase demand and the primary budget balance in all countries. A simultaneous increase in government spending turns out to boost economic activity in all the EU15 countries, indicating the positive economic effects of expansionary fiscal policy. Moreover, a progressive tax policy that would be implemented simultaneously at the EU level would lead to an increase in output in all countries.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:4TOpqqG69KYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Minsky models: a structured survey",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/joes.12222",
            "Abstract": "Minsky's ideas have recently gained prominence in the mainstream as well as in the heterodox literature. However, there exists no agreement upon the formal presentation of Minsky's insights. The aim of this paper is to survey the literature and identify differences and similarities in the ways through which Minskyan ideas have been formalized. We distinguish between the models that focus on the dynamics of debt or interest, with no or a secondary role for asset prices, and the models in which asset prices play a key role in the dynamic behavior of the economy. Within the first category of models, we make a classification between (i) the Kalecki–Minsky models, (ii) the Kaldor–Minsky models, (iii) the Goodwin–Minsky models, (iv) the credit rationing Minsky models, (v) the endogenous target debt ratio Minsky models and (vi) the Minsky–Veblen models. Within the second category of models, we distinguish between (i …",
            "Abstract entirety": 0,
            "Author pub id": "0O0Nu2cAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Greening the eurosystem collateral framework",
            "Publication year": 2021,
            "Publication url": "https://www.greenpeace.de/sites/www.greenpeace.de/files/publications/studie_greening_the_eurosystem_collateral_framework_03_2021.pdf",
            "Abstract": "For some, money is the “root of all evil”, while others have suggested “money is power”. What is definitely true is that our economy simply cannot function without it. At the centre of our monetary system lies central bank money, because it is what banks use to make payments to each other. The collateral framework specifies the rules via which central banks inject money into the banking system, so that banks can make these payments. Furthermore, as modern financial markets are increasingly organised around collateral, central banks’ treatment of collateral–the terms on which they accept bonds or loans posted by banks–sends a powerful signal to private financial markets. Central banks’ collateral rules have significant knock-on effects for monetary and financial conditions in the wider economy.The collateral framework of the Eurosystem− the European Central Bank (ECB) and the euro area national central banks− is at the heart of the ECB’s monetary policy implementation. Problematically, the rules dictating this central component to the ECB’s monetary policy operations are not fit-for-purpose.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:QIV2ME_5wuYC",
            "Publisher": "New Economics Foundation, London"
        },
        {
            "Title": "Three decades of modelling Minsky: what we have learned and the way forward",
            "Publication year": 2017,
            "Publication url": "https://www.elgaronline.com/downloadpdf/journals/ejeep/14-2/ejeep.2017.02.05.pdf",
            "Abstract": "This paper intends to contribute to the contemporary discussions about Minsky’s economics by reviewing how the key ideas of Minsky have been formalised in the heterodox literature over the last three decades or so. First, a distinction is made between the different models based on (a) the source of financial instability they focus on,(b) the type of heterodox macroeconomic framework into which Minskyan ideas are incorporated and (c) the purpose and the nature of the dynamic analysis. Second, the key lessons learned from modelling Minsky are outlined. Finally, the paper calls for more empirically driven models, points out the usefulness of agent-based approaches and highlights the need for the development of Minsky models on open economy, shadow banking and environmental issues.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:8k81kl-MbHgC",
            "Publisher": "Edward Elgar Publishing"
        },
        {
            "Title": "Bank liquidity and macroeconomic fragility: Empirical evidence for the EMU",
            "Publication year": 2016,
            "Publication url": "https://edulll.ekt.gr/edulll/handle/10795/3267",
            "Abstract": "The supervision of bank liquidity has been one of the core topics in the recently developed regulatory framework of banks (Basel III). This paper investigates two issues that have not been addressed in Basel III and which are of particular importance for the attainment of a more effective liquidity regulation. The first is the need for a dynamic definition of liquidity that takes into account the time-varying liquidity and stability of banks’ balance sheet items. The paper develops a new liquidity ratio that explicitly considers this changing nature of liquidity, by assigning weights that depend on financial risks and perceptions. The ratio is estimated and assessed for the EMU-12 countries. The second issue is the need for macro fragility-related liquidity requirements. We provide empirical evidence which suggests that the banking sector does not self-impose such requirements. Based on this evidence, it is argued that the regulatory agents should introduce a positive link between bank liquidity and macroeconomic fragility.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new ecological macroeconomic model: Analysing the interactions between the ecosystem, the financial system and the macroeconomy",
            "Publication year": 2015,
            "Publication url": "https://research.gold.ac.uk/22314/1/08ec800b159197d7a3_qlm6i2e5v.pdf",
            "Abstract": "Our economy, environment and financial system cannot be viewed in isolation: each interacts with the other. However, the current models that inform policy making lack a clear understanding of the links between these systems. This is a significant gap. It’s time to develop a new modelling framework that can analyse these links in an integrated way.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:WF5omc3nYNoC",
            "Publisher": "New Economics Foundation"
        },
        {
            "Title": "The Demise of Finance-dominated Capitalism: Explaining the Financial and Economic Crises",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=5431745410468543742&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:_FxGoFyzp5QC",
            "Publisher": "ECONOMIC ISSUES EDUCATION FUND"
        },
        {
            "Title": "Decarbonising is easy",
            "Publication year": 2020,
            "Publication url": "https://apo.org.au/node/310186",
            "Abstract": "In July 2020, Christine Lagarde, the President of the European Central Bank (ECB), promised to explore every avenue for greening the ECB’s operations, including the asset purchase scheme undertaken to help stimulate the Eurozone economy. Indeed, the rapid and profound economic devastation brought on by the coronavirus pandemic illustrates the vulnerability of our economies to catastrophic shocks and should prompt central banks to hasten progress towards a low-carbon transition. The ECB simply cannot afford to address one crisis whilst neglecting–if not worsening–another.The authors of this report, argue that the ECB should adopt alternative low-carbon strategies. They suggest two such strategies in which carbon-intensive bonds are replaced with more climate-friendly bonds. These strategies would significantly reduce the climate footprint of the ECB corporate Quantitative Easing (QE) and would …",
            "Abstract entirety": 0,
            "Author pub id": "0O0Nu2cAAAAJ:mVmsd5A6BfQC",
            "Publisher": "New Economics Foundation"
        },
        {
            "Title": "Debt crisis, fiscal austerity and the financial fragility and instability in the Greek economy",
            "Publication year": 2016,
            "Publication url": "http://repository.edulll.gr/edulll/handle/10795/3265",
            "Abstract": "Drawing on Minsky’s theoretical framework, we critically assess the effectiveness of the currently implemented fiscal austerity measures in the Greek economy. We develop and apply two indexes that encapsulate the financial fragility in the public sector and the macroeconomy. The statistical evidence suggests that over the last 5-6 years prior to the onset of the crisis the public sector was situated in the ultra-ponzi area and the financial fragility of the Greek economy was steadily increasing, making the economy extremely vulnerable to potential shocks. We show that the fiscal austerity measures do not produce a substantial decline in the financial fragility of the public sector; they also set the stage for chronic financial instability in the economy. We call for a fundamental change in the policy mix currently implemented in the Greek economy",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Financial Fragility and Banking Sector in a Macroeconomic Model with Minskyan Insights",
            "Publication year": 2016,
            "Publication url": "http://repository.edulll.gr/edulll/handle/10795/3250",
            "Abstract": "In light of the recent global financial crisis, the notion of financial fragility has become a cornerstone in current research programs of the dynamics of modern monetary production economies. This paper intends to contribute to the literature that focuses on the macroeconomic modelling of financial fragility drawing on Minsky’s theoretical framework. Our aim is to extend this literature whereby considerable emphasis has been placed on the fragility of firms, but much less attention has been paid to the fragility of banks and its impact on macroeconomic performance. The paper develops a simple macroeconomic model that links the fragility of banks with the level of output. We put forward a Minskyan categorization for the economy’s financial structure, which takes into account both the fragility of banks and the fragility of firms. Our analysis intends to illustrate under what conditions the interaction between banks and the real economy is likely to lead to financial structures that are susceptible to financial instability.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Can Green Quantitative Easing (QE) Reduce Global Warming?",
            "Publication year": 2018,
            "Publication url": "http://research.gold.ac.uk/id/eprint/25412/",
            "Abstract": "The idea of a green QE (quantitative easing) programme has gained a lot of traction over the last years. It has been argued that by implementing such a programme central banks could contribute to the fight against climate change. Our recent research shows that a green QE programme that involves the purchase of green corporate bonds can indeed reduce global warming. The programme will be more effective if green investment responds strongly to changes in the interest rates. Yet, green QE cannot by itself prevent severe climate change: even with optimistic assumptions about the role of interest rates, the path of global atmospheric temperature is not very likely to change substantially by such a programme. Many other types of environmental policies and strategies are necessary to keep global warming close to 2° C.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:_kc_bZDykSQC",
            "Publisher": "Foundation for European Progressive Studies"
        },
        {
            "Title": "Essays on financial fragility, instability and the macroeconomy",
            "Publication year": 2016,
            "Publication url": "http://repository.edulll.gr/edulll/handle/10795/3269",
            "Abstract": "The aim of this thesis is to shed some new theoretical and empirical light on the issues of financial fragility and instability of the macroeconomic systems. The thesis consists of four independent essays. The first essay develops a macrodynamic model in which firms’ and banks’ desired margins of safety play a central role in macroeconomic performance. Mathematical analysis and numerical simulations illustrate that the endogeneity of the desired margins of safety during the investment cycles is conducive to instability. Moreover, it is indicated that fiscal policy can reduce the destabilising forces in the macroeconomic system. The second essay explores, via a stock-flow consistent model, the macroeconomic channels through which securitisation and wage stagnation can jointly affect financial fragility. The results from simulation experiments provide support to the view that the combination of risky financial practices and higher inequality can substantially increase the likelihood of financial instability in the macro system. The third essay proposes a new bank liquidity ratio that explicitly considers the time-varying nature of liquidity by assigning weights on banks’ balance sheet items that depend on financial risks and perceptions. This ratio is estimated and assessed for the EMU-12 countries. Furthermore, the essay investigates the link between macroeconomic fragility and bank liquidity for the EMU. The empirical results suggest that banks in the EMU do not self-impose higher liquidity requirements when macroeconomic fragility increases. The fourth essay puts forward a liquidity index that extends Minsky’s well-known financial taxonomy of economic …",
            "Abstract entirety": 0,
            "Author pub id": "0O0Nu2cAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effects of income distribution and fiscal policy on growth, investment and budget balance: the case of Europe, Post Keynesian Economics Study Group",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=10316337530875830264&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:Zph67rFs4hoC",
            "Publisher": "Working Paper 1703"
        },
        {
            "Title": "A stock-flow-fund ecological macroeconomic model",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921800916301343",
            "Abstract": "This paper develops a stock-flow-fund ecological macroeconomic model that combines the stock-flow consistent approach of Godley and Lavoie with the flow-fund model of Georgescu-Roegen. The model has the following key features. First, monetary and physical stocks and flows are explicitly formalised taking into account the accounting principles and the laws of thermodynamics. Second, Georgescu-Roegen's distinction between stock-flow and fund-service resources is adopted. Third, output is demand-determined but supply constraints might arise either due to environmental damages or due to the exhaustion of natural resources. Fourth, climate change influences directly the components of aggregate demand. Fifth, finance affects macroeconomic activity and the materialisation of investment plans that determine ecological efficiency. The model is calibrated using global data. Simulations are conducted to …",
            "Abstract entirety": 0,
            "Author pub id": "0O0Nu2cAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Finance and climate change: A progressive green finance strategy for the UK",
            "Publication year": 2019,
            "Publication url": "https://eprints.soas.ac.uk/34607/1/Gabor%20et%20al%20%282019%29%20Finance%20and%20climate%20change.pdf",
            "Abstract": "The rapid decarbonization of the UK economy requires a wider range of policies, from fiscal interventions to a green industrial strategy, a green plan for a National Investment Bank and environmental regulations that will restrict carbon-intensive consumption. These policies need to be accompanied by a rapid transformation of the UK financial system.The UK’s official Green Finance Strategy, published by the Conservative government in July 2019, does not go far enough. It offers a market-led, too much carrot, too little stick, deregulated decarbonisation approach. Yet an ambitious transition to low-carbon will not take place via the market because of a series of market failures that include incompatible time horizons between private finance and climate crisis, incomplete capital markets, corporate market power, and subjective private classifications of green assets. To climate-align private finance, we offer a set of recommendations that aim to (i) establish a robust institutional framework,(ii) green Bank of England/commercial banking and (iii) green shadowbanking/market-based finance (see Figure 1).",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Labour Party"
        },
        {
            "Title": "Securitisation, wage stagnation and financial fragility: a stock-flow consistent perspective",
            "Publication year": 2015,
            "Publication url": "http://gala.gre.ac.uk/id/eprint/14078/",
            "Abstract": "Securitisation and wage stagnation have been viewed as two main root causes of the global financial crisis. This paper develops a stock-flow consistent model that allows the investigation of the macroeconomic channels through which securitisation and wage stagnation can jointly affect financial fragility. Particular attention is paid to their role in enhancing a borrowing-induced expansion, a housing boom and an appreciation in the prices of mortgage-backed securities that are of temporary nature. The results from simulation experiments provide support to the view that the combination of risky financial practices with wage stagnation can increase the likelihood of financial instability in a macro system.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "University of Greenwich"
        },
        {
            "Title": "Securitization, household debt and financial instability in a stock-flow consistent model",
            "Publication year": 2010,
            "Publication url": "https://www.boeckler.de/pdf/v_2010_10_29_nikolaidi.pdf",
            "Abstract": "This paper develops a stock-flow consistent model that encompasses a three-sector financial system and explicitly integrates the process of securitization into the workings of the macroeconomy. An endogenously determined rate of default on loans is introduced and the implications of securitization for the credit availability to households are explicitly analyzed. The model pays particular attention to the dynamic interplay between the housing market and the financial sector in order to illuminate, among others, the interconnection between household lending and the developments in the securities market. With the aid of simulations it explores the channels through which exogenous institutional changes within the financial system are likely to generate financial fragility and to eventually bring about instability in the economy.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Can green QE reduce global warming?",
            "Publication year": 2018,
            "Publication url": "http://eprints.soas.ac.uk/34609/",
            "Abstract": "The idea of a green QE (quantitative easing) programme has gained a lot of traction over the last years. It has been argued that by implementing such a programme central banks could contribute to the fight against climate change. Our recent research shows that a green QE programme that involves the purchase of green corporate bonds can indeed reduce global warming. The programme will be more effective if green investment responds strongly to changes in the interest rates. Yet, green QE cannot by itself prevent severe climate change: even with optimistic assumptions about the role of interest rates, the path of global atmospheric temperature is not very likely to change substantially by such a programme. Many other types of environmental policies and strategies are necessary to keep global warming close to 2 degrees Celsius.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Foundation for European Progressive Studies (FEPS)"
        },
        {
            "Title": "Decarbonising the Bank of England's pandemic QE:'Perfectly sensible'",
            "Publication year": 2020,
            "Publication url": "http://eprints.soas.ac.uk/34177/",
            "Abstract": "According to the new governor of the Bank of England, Andrew Bailey, aligning the Bank’s corporate bond purchase scheme with the government’s climate goals is a ‘perfectly sensible thing to do’ and should be made a ‘priority’. Yet in its current framework, the pandemic corporate bond purchase programme is heavily biased towards carbon-intensive sectors – and thus at odds with the government’s environmental objectives. This carbon bias means the programme may lower the cost of borrowing (an implicit subsidy) and encourage more debt issuance by the most carbon-intensive firms relative to low-carbon firms. To help support the governor’s efforts, this briefing sets out two alternative purchase strategies – the ‘Lower-carbon pandemic QE’ scenario and the ‘Low-carbon pandemic QE’ scenario − that would help decarbonise the Bank’s corporate bond purchases (boosting green investment in the process) and ensure that the Bank’s policy interventions are consistent with its rhetoric.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:4DMP91E08xMC",
            "Publisher": "New Economics Foundation"
        },
        {
            "Title": "PKSG",
            "Publication year": 2016,
            "Publication url": "http://www.postkeynesian.net/downloads/working-papers/PKWP1612.pdf",
            "Abstract": "This paper develops a stock-flow-fund ecological macroeconomic model that combines the stock-flow consistent approach of Godley and Lavoie with the flow-fund model of Georgescu-Roegen. The model has the following key features. First, monetary and physical stocks and flows are explicitly formalised taking into account the accounting principles and the laws of thermodynamics. Second, Georgescu-Roegen’s distinction between stock-flow and fund-service resources is adopted. Third, output is demand-determined but supply constraints might arise either due to environmental damages or due to the exhaustion of natural resources. Fourth, climate change influences directly the components of aggregate demand. Fifth, finance affects macroeconomic activity and the materialisation of investment plans that determine ecological efficiency. The model is calibrated using global data. Simulations are conducted to investigate the trajectories of key environmental, macroeconomic and financial variables under (i) different assumptions about the sensitivity of economic activity to the leverage ratio of firms and (ii) different types of green finance policies.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Margins of safety and instability in a macrodynamic model with Minskyan insights",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0954349X14000344",
            "Abstract": "This paper develops a stock-flow consistent macrodynamic model in which firms’ and banks’ desired margins of safety play a central role in macroeconomic performance. The model incorporates an active banking sector and pays particular attention to the leverage of both firms and banks. It is shown that the endogenous change in the desired margins of safety of firms and banks is likely to transform an otherwise stable debt-burdened economy into an unstable one. The endogeneity of the desired margins of safety can also produce, under certain conditions, investment and leverage cycles during which investment and leverage move both in the same and in the opposite direction. Furthermore, the paper investigates the potential stabilising role of fiscal policy. It is indicated that fiscal policy can reduce the destabilising forces in the macroeconomy when government expenditures adjust adequately to variations in the …",
            "Abstract entirety": 0,
            "Author pub id": "0O0Nu2cAAAAJ:UeHWp8X0CEIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Fiscal policy and ecological sustainability",
            "Publication year": 2019,
            "Publication url": "https://ideas.repec.org/p/imk/fmmpap/52-2019.html",
            "Abstract": "Fiscal policy has a strong role to play in the transition to an ecologically sustainable economy. This paper critically discusses the way that green fiscal policy has been analysed in both conventional and post-Keynesian approaches. It then uses a recently developed post-Keynesian ecological macroeconomic model in order to provide a comparative evaluation of three different types of green fiscal policy: carbon taxes, green subsidies and green public investment. We show that (i) carbon taxes reduce global warming but increase financial risks due to their adverse effects on the profitability of firms and credit availability; (ii) green subsidies and green public investment improve ecological efficiency, but their positive environmental impact is partially offset by their macroeconomic rebound effects; and (iii) a green fiscal policy mix derives better outcomes than isolated policies. Directions for future heterodox macroeconomic research on the links between fiscal policy and ecological sustainability are suggested.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IMK at the Hans Boeckler Foundation, Macroeconomic Policy Institute"
        },
        {
            "Title": "Post-Keynesian stock-flow consistent modelling: theory and methodology",
            "Publication year": 2017,
            "Publication url": "https://docs.gre.ac.uk/__data/assets/pdf_file/0025/122875/Nikolaidi-PK-SFC-modelling.pdf",
            "Abstract": "There is currently a lot of research that takes place on theoretical SFC modelling. This is partly explained by the fact that SFC models are characterised by a high exibility that allows them to be deployed for the analysis of a wide range of topics.",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Banking System and Financial Fragility in a Post Keynesian Model",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "0O0Nu2cAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        }
    ]
}]