[{
    "name": "Μαλαματή Λούτα",
    "romanize name": "Malamati Louta",
    "School-Department": "Ηλεκτρολόγων Μηχανικών & Μηχανικών Υπολογιστών",
    "University": "uowm",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 8334,
    "Scholar name": "Malamati Louta",
    "Scholar id": "5yvGyGsAAAAJ",
    "Affiliation": "Asc. Professor, Dep. of Electrical & Computer Eng., Univ. of Western Macedonia Greece",
    "Citedby": 861,
    "Interests": [
        "Wireless Networks",
        "Telecommunication Networks"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=5yvGyGsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Series Editorial: Data Science and Artificial Intelligence for Communications",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9446678/",
            "Abstract": "Future networks, empowered with Artificial Intelligence (AI) and Machine Learning (ML) capabilities, are expected to become cognitive, autonomously thinking, learning, remembering and adapting to ever changing conditions. Knowledge acquisition and intelligent decision making are enabled, effectively supporting next generation networks in achieving their end-to-end goals and objectives in a highly dynamic and heterogeneous environment of increasing complexity. AI/ML and data science are generally considered key technologies for communications; still, many research challenges need to be adequately addressed, before they can evolve to their full potential.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "IFAISTOS: A fair and flexible resource allocation policy for next-generation passive optical networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7002071/",
            "Abstract": "In modern, competitive, and dynamic access networks the underlying bandwidth distribution mechanism has to be capable of understanding user requirements, meeting stringent quality of service (QoS) demands, and satisfying a broad spectrum of user traffic dynamics. Undoubtedly, optical fiber is the dominant transmission medium enabling practical and cost-effective optical infrastructures in the last mile. Passive optical networks (PONs) represent one of the most promising player towards the fiber to the home (FTTH) vision allowing users to experience high quality, demanding multimedia services and applications. The 10-gigabit-capable passive optical network (XG-PON), one of the latest PON standard, incorporates a set of profound conditions a contemporary PON should ensure. Fairness provisioning constitutes one of the most critical features a PON should provide. However, ensuring fairness in an access …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring the intra-frame energy conservation capabilities of the horizontal simple packing algorithm in IEEE 802.16 e networks: an analytical approach",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-012-0484-6",
            "Abstract": "The power saving capabilities of the mobile devices in broadband wireless networks constitute a challenging research topic that has attracted the attention of researchers recently, while it needs to be addressed at multiple layers. This work provides a novel analysis of the intra-frame energy conservation potentials of the IEEE 802.16e network. Specifically, the power saving capabilities of the worldwide interoperability for microwave access downlink sub-frame are thoroughly studied, employing the well-known simple packing algorithm as the mapping technique of the data requests. The accurate mathematical model, cross-validated via simulation, reveals the significant ability to conserve energy in this intra-frame fashion under different scenarios. To the best of our knowledge, this is the first work providing intra-frame power-saving potentials of IEEE 802.16 networks. Additionally, this is the first study …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Architectures and bandwidth allocation schemes for hybrid wireless-optical networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6898810/",
            "Abstract": "The combination of the most prestigious optical and wireless technologies for implementing a modern broadband integrated access network has been progressively gaining ground. By extending the network coverage in a cost-efficient way, hybrid wireless-optical networks are able to enclose a larger number of potential subscribers than standalone access architectures. Hence, they are capable of increasing revenue levels and facilitating commercial penetration to the telecom market. At the same time, hybrid wireless-optical networks pose an ambitious, alternative, and efficient solution to coping with new bandwidth-hungry user applications. Hybrid wireless-optical networks incorporate sophisticated modules, fabrics, and network entities to effectively provide adequate quality of service (QoS) provisioning. This survey endeavors to classify the main features of wireless-optical integration. We provide a …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards an incentive-compatible, reputation-based framework for stimulating cooperation in opportunistic networks: a survey",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/document/8245945/",
            "Abstract": "In opportunistic networks (OppNets), routing and data forwarding among mobile devices are facilitated by relays or next-hop forwarders. To guarantee end-to-end data delivery it is important to provide participation. However, in sparsely connected OppNets, it is extremely challenging to monitor the behaviour of the relays and identify selfish/malicious relays cooperating with each other in order to forge routing information or drop useful data. Cooperation enforcement schemes are seen as a lightweight alternative to conventional secure forwarding techniques that involve cryptographically signed certificate exchanges, providing a `softer' security layer to protect basic networking operations. In general, cooperation enforcement schemes fall into two broad categories: trust establishment via a reputation system and pricing or credit-based schemes. This study offers a comprehensive survey of representative cooperation …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:f2IySw72cVMC",
            "Publisher": "IET"
        },
        {
            "Title": "An effective Negotiation Strategy for simple buyer response in E-commerce environment",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1344807/",
            "Abstract": "Electronic commerce is expected to dominate the market if coupled with the appropriate technologies and mechanisms. Mobile agents are one of the means that may enhance the intelligence and improve the efficiency of systems in the e-marketplace. We propose a dynamic multilateral negotiation model and an efficient negotiation strategy that can be used to extend the functionality of autonomous agents, so that they reach to an agreement aiming to maximise their owner's utility. The framework considers contract and decision issues, is based on real market conditions, adopts a light ranking mechanism that does not require a complicated rationale on behalf of the buyer agents, and has been empirically evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Trust management framework for intelligent agent negotiations in ubiquitous computing environments",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-009-9155-z",
            "Abstract": "In dynamic ubiquitous computing environments, system entities may be classified into two main categories that are, in principle, in conflict. These are the Service Resource Requestors (SRRs) wishing to use services and/or exploit resources offered by the other system entities and the Service Resource Providers (SRPs) that offer the services/resources requested. Seeking for the maximisation of their welfare, while achieving their own goals and aims, entities may misbehave (intentionally or unintentionally), thus, leading to a significant deterioration of system’s performance. In this study, a reputation mechanism is proposed which helps estimating SRPs trustworthiness and predicting their future behaviour, taking into account their past performance in consistently satisfying SRRs’ expectations. Thereafter, under the assumption that a number of SRPs may handle the SRRs requests, the SRRs may decide on …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Alleviating the high propagation delays in FiWi networks: a prediction-based DBA scheme for 10G-EPON-WiMAX systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7320478/",
            "Abstract": "Fiber Wireless (FiWi) networks constitute a very promising, cost-effective solution to cope with modern demanding services and applications in access networks. One of the most challenging objective lies in the design of a robust, efficient and effective bandwidth allocation. The design of such a Dynamic Bandwidth Allocation (DBA) scheme should take into account the large propagation delays between mobile users and the Central Office (CO). In this work, we endeavor to address this challenge by proposing a prediction-aware DBA scheme for FiWi networks, where the optical domain is implemented by a 10Gbps Ethernet PON (10G-EPON) and the wireless domain is supported by WiMAX access stations. In order to ensure an effective DBA scheme a hidden Markov chain model is devised for estimating the surplus traffic requests of each mobile user during the coordination message exchange between the optical …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a QoS-Aware IEEE 802.16 downlink sub-frame mapping scheme",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5700136/",
            "Abstract": "IEEE 802.16 (WiMAX) is considered as one of the most promising wireless access technologies supporting high-capacity and long-distance communications as well as user mobility. A problem that should be addressed in the context of multi-access communications is the efficient accommodation of traffic requests to the downlink subframe. The allocation operation in downlink sub-frame is not standardized, while only restrictions on the usage of downlink sub-frame's bandwidth are defined. The most noticeable restriction is the rectangular restriction, requiring all downlink allocations to be mapped in a two-dimensions rectangular shaping. This study is a first step towards defining a QoS-aware mapping scheme, prioritizing traffic requests in accordance with the strict delay requirements they pose. The mapping scheme applies horizon scheduling, permitting bursts to be scheduled efficiently and in a simple way …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RLAM",
            "Publication year": 2014,
            "Publication url": "http://ikee.lib.auth.gr/record/263472",
            "Abstract": "WiMAX (Worldwide Interoperability for Microwave Access) constitutes a candidate networking technology towards the 4G vision realization. By adopting the Orthogonal Frequency Division Multiple Access (OFDMA) technique, the latest IEEE 802.16 x amendments manage to provide QoS-aware access services with full mobility support. A number of interesting scheduling and mapping schemes have been proposed in research literature. However, they neglect a considerable asset of the OFDMA-based wireless systems: the dynamic adjustment of the downlink-to-uplink width ratio. In order to fully exploit the supported mobile WiMAX features, we design, develop, and evaluate a rigorous adaptive model, which inherits its main aspects from the reinforcement learning field. The model proposed endeavours to efficiently determine the downlink-to-uplinkwidth ratio, on a frame-by-frame basis, taking into account both the …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:dshw04ExmUIC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Analysing the optical network unit power consumption in the 10 GB-capable passive optical network systems",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/document/7490470/",
            "Abstract": "The standardisation of the 10 GB-capable passive optical network (XG-PON) system is accompanied by a rigorous set of recommendations. Power reduction in XG-PONs is considered a quite important topic by the telecommunication standardisation sector (ITU-T), thus, with importance of energy saving, XG-PON recommendation describes power management processes in detail. The core power management process comprises distinct states representing the desired power management transitions, while two modes: namely, the doze and the cyclic sleep mode, are defined. This study provides an analytical model for power consumption computation of an optical network unit (ONU), assuming that the two modes are enabled in the ONU operation. The presented analytical findings are verified by conducting extensive simulation experiments. Concurrently, the average time spent on doze and cyclic sleep states is …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IET"
        },
        {
            "Title": "The role of organizational cultures in information‐systems security management: A goal‐setting perspective",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jls.20042",
            "Abstract": "The aim of this research is to investigate the role of strong organizational cultures in setting information‐systems security goals. In doing so, we explore and discuss the concept of culture within three financial organizations with different social and organizational structures, and seek to demonstrate the importance of having a cohesive culture in efficiently setting information‐security goals. The relationship between goal setting, culture strength, and performance is also discussed, as there have been studies that indirectly indicate that such a relationship may exist. The contribution of this work to interpretive information‐systems research consists of its study of culture and goal setting in a security‐management context, and its grounding within an interpretive epistemology. In addition, this research promotes an interdisciplinary and interorganizational theory to foster dialogue that transcends industry‐specific contexts …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Towards an effective energy efficient passive optical network",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983869/",
            "Abstract": "Communication networks' energy consumption poses a considerable threat to the environment stability. The expansion of access networks, which constitute the main playground of the Internet backhaul, is accompanied by numerous energy inefficient devices and equipments. Passive optical networks (PONs) is a potential dominant technology on the field of access networking, hence the reduction of the consumed energy of the optical devices forms a critical issue. In this paper, an efficient green PON is introduced, having two main targets: a) to reduce the energy consumption, by allowing optical devices to operate longer in sleep mode, and b) to maintain PON's good performance. Beyond the green provisioning, the proposed scheme is able to increase occasionally the network performance in terms of mean packet delay and packet drop ratio. This is accomplished by reducing the amount of control messages …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cost-effective service task assignment in multidomain distributed computing environments.",
            "Publication year": 2005,
            "Publication url": "http://users.uowm.gr/louta/CONFERENCES/C14.pdf",
            "Abstract": "Highly competitive and open environments should encompass mechanisms that will assist service providers in accounting for their interests, ie, offering at a given period of time adequate quality services in a cost efficient manner which is highly associated to efficiently managing and fulfilling current user requests. In this paper, service task assignment problem is addressed from one of the possible theoretical perspectives, while new functionality is introduced in service architectures that run in open environments in order to support the proposed solution. The pertinent problem aiming to find the most appropriate assignment of service tasks to service nodes is concisely defined, mathematically formulated and empirically evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effect of global and local influence models on the quality of recommendations",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8823538/",
            "Abstract": "The quality of recommendations on social networks is a combination of the richness of the available information and the ability of algorithms and architectures to take advantage of this information in favor of the users. Recommendation algorithms have to address several problems, such as information sparsity, scalability of algorithms, concept drift etc. ln this dynamic and complex environment, it is important to provide solutions that enrich information when it is necessary to fill the gaps and at the same time to scale solutions so that they can handle the ever increasing data sizes and flows. ln this work, we extend our previous work on recommender systems for social networks that studied global influence and trust metrics and their applications. More specifically, we introduce a local influence model, which is relied on the formation of local user networks based on common interests and study the performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Personalized Audio Web Service using MPEG-7 and MPEG-21 standards",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065051/",
            "Abstract": "This paper presents a web service which delivers personalized audio information. The personalization process is automated and decentralized. The metadata which support personalization are separated in two categories: the metadata describing user preferences stored at each user and the resource adaptation metadata stored at the web service host. The multimedia models MPEG-21 and MPEG-7 are used to describe metadata information and the Web Ontology Language (OWL) to produce and manipulate ontological descriptions. SPARQL is used for querying the OWL ontologies. The MPEG Query Format (MPQF) is also used, providing a well-known framework for applying queries to the metadata and to the ontologies.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient service provisioning in a multi-domain network environment",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1344808/",
            "Abstract": "Highly competitive and open environments should encompass mechanisms that will assist service providers in accounting for their interests, i.e., offering at a given period of time adequate quality services in a cost efficient manner which is highly associated to efficiently managing and fulfilling current user requests. In this paper, service task assignment problem is addressed from one of the possible theoretical perspectives, while new functionality is introduced in service architectures that run in open environments in order to support the proposed solution. The pertinent problem is concisely defined, mathematically formulated, computationally efficient solved and evaluated through simulation experiments.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of an effective QoS-aware mapping scheme using persistent allocation probing",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6364291/",
            "Abstract": "Mobile Worldwide Interoperability for Microwave Access (WiMAX) constitutes an attractive trademark for supporting wireless access to Intranets and the Internet. Scheduling and mapping processes are of paramount importance since they dramatically affect the network performance. This work endeavors to provide a robust mapping scheme for the downlink sub-frame with respect to various Quality of Service (QoS) constraints. Each downlink request creates rectangular regions, called Horizons, and the mapping technique applies a persistent probing of the Horizons recorded. The evaluation experiments conducted indicate that the scheme designed beneficially affects the system performance.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Application of social network metrics to a trust-aware collaborative model for generating personalized user recommendations",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-7091-1346-2_3",
            "Abstract": "Social network analysis has emerged as a key technique in modern sociology, but has recently gained a lot of interest in Web mining research, because of the advent and the increasing popularity of social media, such as blogs, social networks, micro-blogging, customer review sites etc. Such media often serve as platforms for information dissemination and product placement or promotion. One way to improve the quality of recommendations provided to the members of social networks is to use trustworthy resources. In this environment, community-based reputation can help estimating the trustworthiness of individual users. Consequently, influence and trust are becoming essential qualities among user interactions. In this work, we perform an extensive study of various metrics related to the aforementioned elements, and of their effect in the process of information propagation in social networks. In order to …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Vienna"
        },
        {
            "Title": "Cost-efficient design of future broadband fixed wireless access systems",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1026012603024",
            "Abstract": "In future broadband fixed wireless access systems the overall design procedure is critical for their successful commercial deployment as well as their efficient operation and management. The problem addressed in this paper is twofold. Specifically, at a first phase the radio access network planning problem is addressed, which aims at finding the minimum-cost configuration of Access Point Transceivers (APTs) given thegeographical layout of the area to be covered. At the second phase, the interconnecting planning problem is addressed and aims at finding the minimum-cost configuration of the AccessPoint Controllers (APCs) and Inter-Working Units (IWUs) given the Access PointTransceivers layout. Both problems are formally defined, optimally formulated, and solved by computationally efficient heuristics. Finally, results are provided and subsequent conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:0EnyYjriUFMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "To-wards the development of a smart plant protection solution for im-proved pest management of dry beans (Phaseolus vulgaris L.) in Northern Greece Proceedings 2021, 68, x",
            "Publication year": 2021,
            "Publication url": "https://sciforum.net/manuscripts/10568/manuscript.pdf",
            "Abstract": "In the present work we present the initial stages and first results of the development of a site-specific intelligent plant protection system for bean cultivation. The aim of the system is to be used as a decision tool for rational management of the major key pests of bean crop and with the view to reduce plant protection costs and to mitigate side effects and negative impact on the environment. Currently, we have established a telemetric meteorological network which consists of seven meteorological stations which are distributed in the major bean cultivation area of Greece and over the border area of the Prespes National Park. Through climate sensors the network delivers real time weather data to a cloud server to be further used to establish real time risk thresholds of pest occurrence during the bean growth season. Additionally, the system is passing a stage of pest models development and risk thresholds using in field phenology data along with weather data and Growing Degree-days. Particularly, for the development and validation of the pest risk thresholds we have established experimental fields. The risk thresholds include the pests: Helicoverpa armigera, Thrips sp. and Tetranychus urticae. Pest phenology is observed in four experimental fields which consist of two conventional as well as two organic fields serving as control. The current results will contribute to a better exploitation of the established meteorological station network and their real time microclimate data to provide important information on the rational use of pesticides.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:p2g8aNsByqUC",
            "Publisher": "s Note: MDPI stays neu-tral with regard to jurisdictional claims in published maps and institu-tional affiliations."
        },
        {
            "Title": "Personal mobility support in future service architectures",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.510",
            "Abstract": "Support for personal mobility will be among the key factors for success in the competitive communications market of the future. This paper proposes enhancements to the personal mobility support capabilities of service architectures. The TINA service architecture is used as a reference, even though our approach is applicable to other models as well. Our starting point is a business case that falls into the realm of personal mobility. The aim of the business case is to enable users that are found outside their home domain to access services by choosing the best visited retailer, i.e. the one offering adequate quality services in the most cost‐efficient manner. In the sequel the following key issues are addressed. First, the introduction of the additional functionality that is required for supporting the business case, and the realisation through appropriate service components. Second, the integration of the new service …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "The Role of Strong Cultures to Information Security Management: A Goal Setting Perspective",
            "Publication year": 2008,
            "Publication url": "http://users.uowm.gr/louta/JOURNALS/J11.pdf",
            "Abstract": "The aim of this research is to investigate the role of strong organizational cultures in setting information systems security goals. In doing so, it explores and discusses the concept of strong culture within three financial organizations with different social organizational structures and seeks to demonstrate the importance of having a strong culture in setting efficiently information security goals. The determinants of a strong organizational culture are also discussed. This research contributes to interpretive information systems research with the study of strong culture and goal setting in a security management context and its grounding within an interpretive epistemology.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Personalized Audio Server using MPEG-7 and MPEG-21 standards",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5706844/",
            "Abstract": "This paper presents a semantic model which delivers personalized audio information. The personalization process is automated and decentralized. The metadata which support personalization are separated in two categories: the metadata describing user preferences stored at each user and the resource adaptation metadata stored at the server. The multimedia models MPEG-21 and MPEG-7 are used to describe metadata information. The Web Ontology Language (OWL) language is used to produce and manipulate the relative ontological descriptions.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quality of service management in IP networks through dynamic service rate reconfiguration.",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/41507492/Quality_of_service_management_in_IP_netw20160124-11242-1gc44ka.pdf",
            "Abstract": "The DiffServ architecture provides a scalable mechanism for QoS introduction in an IP network. The idea of DiffServ is based on the aggregation of traffic flows at an ingress (or egress) point of a network and the IP packet marking for distinct priority flows, according to several classification criteria. In this paper the problem of the improvement and fairness of absolute QoS provisioning to paths established along a DiffServ network on a per router basis is considered. Specifically, the dynamic service rate reconfiguration problem of a router’s output link is formally defined, mathematically formulated and solved by means of efficient heuristic algorithms, providing good solutions in reasonable time. Two versions of the problem are addressed. First, a confined version, which exploits the available resources of service classes in order to improve QoS characteristics of the problematic flows. Second, an extended version of the problem, in which the strict constraints of the lower classes are relaxed in order to strictly meet the absolute QoS requirements of the higher order service classes.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "AUGEIAS: Intelligent IoT management platform for treated wastewater reuse in precision agriculture",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9566274/",
            "Abstract": "This work presents the project AUGEIAS, an intelligent internet of things (IoT) management platform for reuse of treated wastewater in precision agriculture. The AUGEIAS project aims to create an intelligent ecosystem, which enables and optimizes the safe and efficient re-use of wastewater from the output of the wastewater treatment plant (WWTP) for irrigation purposes. Advanced IoT systems, combined with low power wide area networks, cloud computing, data analytics and artificial intelligence technologies are utilized to improve the involved decision-making processes for farmers and utility companies. In this paper, we discuss AUGEIAS, objectives, operational requirements, architecture and the experimental testbed developed for initial project testing and to identify potential issues and improvements.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A robust reputation-based computational model for trust establishment in pervasive systems",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6923471/",
            "Abstract": "Distributed systems built in open competitive and highly dynamic pervasive environments are composed of autonomous entities that act and interact in an intelligent and flexible manner so as to achieve their own goals and aims. System entities may be classified into two main categories that are, in principle, in conflict. These are the service resource requestors (SRRs) wishing to use services and/or exploit resources offered by the other system entities and the service resource providers (SRPs) that offer the services/resources requested. Seeking for the maximization of their welfare, entities may misbehave, thus leading to a significant deterioration of system's performance. The scope of this paper is to present a computational model for trust establishment based on a reputation mechanism, which incorporates direct SRRs' experiences and information disseminated from witness SRRs on the basis of their past …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "ParkCar: A smart roadside parking application exploiting the mobile crowdsensing paradigm",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8316447/",
            "Abstract": "In this paper, we design and implement a mobile crowdsensing smart roadside parking system, called ParkCar, exploiting the key elements that a mobile crowdsensing system (MCS) should possess. We present its architecture and basic operational characteristics, placing emphasis on the specific solutions adopted to respond to specific MCS open challenges, related mostly to efficient task assignment process, data quality and integrity, energy efficiency, security and privacy and incentive provisioning.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Foreword to the SMAP'09 Special Session on Intelligence, Adaptation and Personalization on the Web",
            "Publication year": 2009,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/smap/2009/05381689/12OmNyGKUlh",
            "Abstract": "For the purpose of the SMAP’09 Special Session on Intelligence, Adaptation and Personalization on the Web, 5 high quality papers authored by 12 researchers from Greece, Spain, Belgium and Slovakia were selected",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "A trust-aware system for personalized user recommendations in social networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6549154/",
            "Abstract": "Social network analysis has recently gained a lot of interest because of the advent and the increasing popularity of social media, such as blogs, social networking applications, microblogging, or customer review sites. In this environment, trust is becoming an essential quality among user interactions and the recommendation for useful content and trustful users is crucial for all the members of the network. In this paper, we introduce a framework for handling trust in social networks, which is based on a reputation mechanism that captures the implicit and explicit connections between the network members, analyzes the semantics and dynamics of these connections, and provides personalized user recommendations to the network members.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a collaborative reputation based service provider selection in ubiquitous computing environments",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-69293-5_41",
            "Abstract": "From a market based perspective, entities composing dynamic ubiquitous computing environments may be classified into two main categories that are, in principle, in conflict. These are the Service Resource Requestors (SRRs) wishing to use services and/or exploit resources offered by other system entities and the Service Resource Providers (SRPs) that offer the services/resources requested. Under the assumption that a number of SRPs may handle the SRRs requests, the SRRs may decide on the most appropriate SRP for the service / resource requested on the basis of a weighted combination of the evaluation of the quality of their offer (performance related factor) and of their reputation rating (reliability related factor). In this context, a reputation mechanism is proposed, which rates SRPs with respect to whether they honoured or not the agreements they have established with the SRRs. The reputation …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards a collaborative ranking mechanism for efficient and personalized internet search service provisioning",
            "Publication year": 2011,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm00368",
            "Abstract": "The aim of this paper is, in accordance with efficient web search service operation objectives, to propose enhancements to the sophistication of the functionality that can be offered by search engine services. A meta-search third-party result ranking mechanism is proposed, which is capable of adapting over the continuous changes that occur on the web, providing in parallel personalized information acquisition considering the user's navigation behaviour. Transparency is achieved for both personalization and web evolution adaptation mechanisms, requiring virtually none effort from the user's part. In essence, the proposed meta search engine rates, re-organises and combines the results acquired from search services for a specific user information resource request in accordance with a weighted combination of a performance related factor (tightly related to the ranking of the web result as given by the search engine …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:BqipwSGYUEgC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Predicting multimedia traffic in wireless networks: a performance evaluation of cognitive techniques",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6878802/",
            "Abstract": "Traffic engineering in networking is defined as the process that incorporates sophisticated methods in order to ensure optimization and high network performance. One of the most constructive tools employed by the traffic engineering concept is the traffic prediction. Having in mind the heterogeneous traffic patterns originated by various modern services and network platforms, the need of a robust, cognitive, and error-free prediction technique becomes even more pressing. This work focuses on the prediction concept as an autonomous, functional, and efficient process, where multiple cutting-edge methods are presented, modeled, and thoroughly assessed. To this purpose, real traffic traces have been captured, including multiple multimedia traffic flows, so as to comparatively assess widely used methods in terms of accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic forecasting in cellular networks using the lstm rnn",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3291533.3291540",
            "Abstract": "In this work we design and implement a Neural Network that can identify recurrent patterns in various metrics which can be then used for cellular network traffic forecasting. Based on a custom architecture and memory, this Neural Network can handle prediction tasks faster and more accurately in real life scenarios. This approach offers a solution for service providers to enhance cellular network performance, by utilizing effectively the available resources. In order to provide a robust conclusion about the performance and precision of the proposed Neural Network, multiple predictions were made using the same data-set and the results were compared against other similar algorithms from the literature.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Efficient Negotiation Strategy in E-Commerce Context Based on Simple Ranking Mechanism.",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/41388542/An_Efficient_Negotiation_Strategy_in_E-C20160121-13078-h6z6c8.pdf",
            "Abstract": "Electronic commerce is expected to dominate the market if coupled with the appropriate technologies and mechanisms. Mobile agents are one of the means that may enhance the intelligence and improve the efficiency of systems in the e-marketplace. In this paper, we propose a dynamic multilateral negotiation model and we construct an efficient negotiation strategy based on a ranking mechanism that does not require a complicated rationale on behalf of the buyer agents. This strategy can be used to extend the functionality of autonomous agents, so that they reach to an agreement aiming to maximise their owner’s utility. The framework considers both contract and decision issues, is based on real market conditions, and has been empirically evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating the application of multi-objective optimisation and multi-criteria decision making to future concepts of intelligent mobility and telecommunications",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7785390/",
            "Abstract": "Designing an urban environment involves a multitude of diverse principles, among which vehicle dynamics, pedestrian dynamics and telecommunications play a very important role. However, these are rarely considered together in studies for intelligent mobility. On top of that, optimising such a multi-disciplinary system is a very challenging task because of the number of principles and interfacing among the participating components. This work introduces a scalable research methodology that combines all of the above, so as to assess the effectiveness of the application and to provide an alternative approach to design an urban environment that could be equally applied at scale. This is expected to provide deeper insight to traffic planners and researchers both in academia and industry, so as to generate new designs that could yield higher performance solutions in intelligent mobility problems.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blog rating as an iterative collaborative process",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11684-1_11",
            "Abstract": "The blogosphere is a part of the World Wide Web, enhanced with several characteristics that differentiate blogs from traditional websites. The number of different authors, the multitude of user-provided tags, the inherent connectivity between blogs and bloggers, the high update rate, and the time information attached to each post are some of the features that can be exploited in various information retrieval tasks in the blogosphere. Traditional search engines perform poorly on blogs since they do not cover these aspects. In an attempt to exploit these features and assist any specialized blog search engine to provide a better ranking of blogs, we propose a rating mechanism, which capitalizes on the hyperlinks between blogs. The model assumes that the intention of a blog owner who creates a link to another blog is to provide a recommendation to the blog readers, and quantifies this intention in a score …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Application of Social Network Metrics to",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=rWlEAAAAQBAJ&oi=fnd&pg=PA49&dq=info:eaGI_SmViXAJ:scholar.google.com&ots=VsakqIN651&sig=2CLAW8v68SVBhhB5PYANaUhLPKc",
            "Abstract": "Social network analysis has emerged as a key technique in modern sociology, but has recently gained a lot of interest in Web mining research, because of the advent and the increasing popularity of social media, such as blogs, social networks, micro-blogging, customer review sites etc. Such media often serve as platforms for information dissemination and product placement or promotion. One way to improve the quality of recommendations provided to the members of social networks is to use trustworthy resources. In this environment, community-based reputation can help estimating the trustworthiness of individual users. Consequently, inﬂuence and trust are becoming essential qualities among user interactions. In this work, we perform an extensive study of various metrics related to the aforementioned elements, and of their effect in the process of information propagation in social networks. In order to better understand the properties of links and the dynamics of social networks, we distinguish between permanent and transient links and in the latter case, we consider the link freshness. Moreover, we distinguish between the propagation of trust in a local level and the effect of global inﬂuence and compare suggestions provided by locally trusted or globally inﬂuential users.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "A metaheuristic bandwidth allocation scheme for FiWi networks using Ant Colony Optimization",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7374242/",
            "Abstract": "Optical-wireless access networks constitute a quite attractive solution to meet the ever-increasing bandwidth requirements of end-users, offering significant benefits such as ubiquitous coverage in the wireless domain and huge bandwidth in the optical domain. However, converging optical and wireless networking technologies, with Passive Optical Networks (PONs) and 4G wireless standards, such as the Worldwide Interoperability for Microwave Access (WiMAX) and the Long Term Evolution (LTE), entails major challenges that need to be addressed. In this context, designing an efficient and fair bandwidth distribution with Quality of Service (QoS) support is a difficult task due to the interdependence of resource allocation process to both optical and wireless domains. Specifically, the bandwidth distribution in the optical domain has to be aware of the mobile user heterogeneity in the wireless domain, while in the …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data Science and Artificial Intelligence",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9141187/",
            "Abstract": "The articles in this special section are dedicated to the application of artificial intelligence AI), machine learning (ML), and data analytics to address different problems of communication systems, presenting new trends, approaches, methods, frameworks, systems for efficiently managing and optimizing networks related operations. Even though AI/ML is considered a key technology for next generation networks, still many research challenges need to be solved before it could reach its full potential.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the use of learning automata in tuning the channel split ratio of WiMAX networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6637012/",
            "Abstract": "The Worldwide Interoperability for Microwave Access (WiMAX) family of standards have introduced a flexible, efficient, and robust wireless interface. Among other interesting features, WiMAX access networks bring into play a flexible determination of the ratio between the downlink and uplink directions, allowing a relation width from 3 : 1 to 1 : 1, respectively. However, this promising feature is not properly utilized, since hitherto scheduling and mapping schemes proposed neglect it. In this paper, this challenging issue is effectively addressed by proposing an adaptive model that attempts to adequately adjust the downlink-to-uplink subframe width ratio according to the current traffic conditions. In the context of a mobile WiMAX wireless access network, the base station is enhanced with an error-aware learning automaton in order to be able to identify the magnitude of the incoming and outgoing traffic flows and, in turn …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On effectively determining the downlink-to-uplink sub-frame width ratio for mobile wimax networks using spline extrapolation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065040/",
            "Abstract": "One of the most valuable design issues of the Worldwide Interoperability for Microwave Access (WiMAX) standard is its flexibility. It allows multiple downlink-to-uplink duration definitions concerning the width of the corresponding sub-frames, thus, the telecommunication companies and businesses are able to define the downlink-to-uplink width from 3:1 to 1:1 respectively to meet the traffic demands of the connected subscribers. However, the decision on defining the most appropriate ratio is not yet solved, since current efforts on developing scheduling and mapping schemes consider it as fixed. In this work, a novel adaptive mapping approach - based on cubic spline extrapolation - is proposed in order to dynamically determine the most appropriate downlink-to-uplink width ratio in accordance to the downlink and uplink traffic demands. The method proposed is evaluated through realistic simulation scenarios …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient service provisioning through dynamic service task assignment in a multi-domain distributed computing environment",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJIPT.2008.02095",
            "Abstract": "Highly competitive and open environments should encompass mechanisms that will assist Service Providers (SPs) in accounting for their interests, i.e., offering at a given period of time the adequate quality services in a cost-efficient manner. Assuming that a user wishes to access a specific service composed of a distinct set of service tasks, which can be served by various Candidate Service Nodes (CSNs), a problem that should be addressed is the assignment of service tasks to the most appropriate service nodes. The pertinent problem is concisely defined, optimally formulated and evaluated through simulation experiments on a real network test bed.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:qUcmZB5y_30C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "An efficient negotiation model for the next generation electronic marketplace",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1347005/",
            "Abstract": "E-commerce is expected to dominate the market if coupled with the appropriate technologies and mechanisms. Mobile agents are one of the means that may enhance the intelligence and improve the computational efficiency of systems in the e-marketplace. In this paper, we propose a dynamic multilateral negotiation model that can be used to extend the functionality of autonomous agents, so that they can reach an agreement that maximises their owner's utility. The model considers both the contract and decision issues based on the real market conditions and has been empirically evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proportional delay differentiation employing the CBQ service discipline",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1215861/",
            "Abstract": "The DiffServ architecture provides a scalable mechanism for QoS introduction in a TCP/IP network. The idea of DiffServ is based on the aggregation of traffic flows at an ingress (or egress) point of a network and the IP packet marking for different priority flows, according to several classification criteria. Two approaches exist in the DiffServ architecture: the absolute and the relative. In absolute DiffServ, an admission control scheme is used to provide QoS guarantees as absolute bounds of specific QoS parameters. The relative DiffServ model provides QoS guarantees per class expressed with reference to guarantees given to the other classes defined. Our study targets at providing relative proportional delay differentiation service based on class based queue (CBQ) scheduler. The main idea is to frequently adjust the service rates allocated to classes of a CBQ scheduler in order to achieve relative delay spacing …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient Service Task Assignment in Grid Computing Environments",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/efficient-service-task-assignment-grid/41266",
            "Abstract": "The availability of powerful computers and highspeed network technologies is changing the way computers are used. These technology enhancements led to the possibility of using distributed computers as a single, unified computing resource, leading to what is popularly known as Grid computing (Foster, 2001). The term Grid is adopted from the power Grid which supplies transparent access to electric power regardless of its source. Cloud computing, scalable computing, global computing, internet computing, and more recently peer-to-peer computing are well known names describing the Grid technology in distributed systems.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Implications of 3G licensing to mobile telecommunications market dynamics",
            "Publication year": 2003,
            "Publication url": "http://admin.contel.hr/2003/review/bspa/87-final.pdf",
            "Abstract": "In this paper, the implications of 3G licensing to the telecommunication business roles involved in the 3G market chain are exposed. The traditional licensing models are described and compared, while the outcome of their adoption over the world is presented. An innovative licensing scheme is proposed, which aims to present the advantages of all existing methods used for the assignment of the 3G licences. This scheme claims to have the adaptability potential for any objective that the regulatory authorities may have. It is assessed via a simulation example based on the 3G licensing procedure of the United Kingdom, the candidates and results.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards realization of the ABC vision: A comparative survey of Access Network Selection",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983882/",
            "Abstract": "Access Network Selection (ANS) providing the most appropriate networking technology for accessing and using services in a heterogeneous wireless environment constitutes the heart of the overall handover management procedure. The aim of this paper is to survey representative vertical handover schemes proposed in related research literature with emphasis laid on the design of the ANS mechanism. Schemes' distinct features are analyzed and the authors discuss on their relative merits and weaknesses.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "QoS Differentiation Provisioning & Management System Exploiting Mobile Agent Technology",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4116614/",
            "Abstract": "The DiffServ architecture provides a scalable mechanism for QoS introduction in a TCP/IP network. DiffServ model is based on the aggregation of traffic flows at an ingress (or egress) point of a network and the IP packet marking for different priority flows, according to several classification criteria. Two approaches exist in the DiffServ architecture: the absolute and the relative. In absolute DiffServ, an admission control scheme is used to provide QoS guarantees as absolute bounds of specific QoS parameters. The relative DiffServ model provides QoS guarantees per service class expressed with reference to guarantees given to other classes defined. Our study presents a QoS absolute and relative differentiation provisioning & management system aiming to provide QoS differentiation (absolute and relative) in IP DiffServ based Networks. The proposed system has been applied and performed well on a real network …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of the ATM‐based interconnecting network of the access segment of future cellular systems",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.447",
            "Abstract": "An important issue in future cellular communication systems is the design of the interconnecting network of their access segment. This problem aims at finding the minimum-cost configuration of cell site switches (CSSs) and local exchanges (LEs) given the base transceiver station (BTS) layout. An extended version of the problem may also comprise the deployment of mobility and service control points-access (MSCPs-A), based on the assumption that CSSs and LEs are not fully capable of handling the logic of the cellular system. In this paper we solve the extended problem, under the additional assumption that the communication among the network elements is based on the ATM technique. The problem is formally defined, optimally formulated, and solved by computationally efficient heuristics. Finally, results are provided and subsequent conclusions are drawn. Copyright© 2001 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Social CLWPR: A socially enhanced position based routing protocol for handling misbehaviour inVANETs",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8316449/",
            "Abstract": "In this paper, we enhance CLWPR, a cross-layer optimized position-based routing protocol for urban VANET environments, introducing social aspects to its design so as to efficiently address misbehaving (selfish or malicious) nodes that intentionally drop packets and ultimately promote cooperation in the network. The proposed Social CLWPR protocol favors nodes with close favorable social relationship (family members, friends, users with trust connections) as next forwarder nodes, while nodes with explicit distrust connections as indicated from online social media are not preferred in the network. Social CLWPR performance is comparatively evaluated against CLWPR and it demonstrates improved performance in terms of packet delivery ratio.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of Cloud Radio Access Networks by jointly considering communicational and computational network resources",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9566269/",
            "Abstract": "With the introduction of 5G technology, telecommunications industry enters a stage where remarkable changes occur. The rapid increase of traffic load combined with the emergence of new network requirements has led to the need of developing a network architecture capable of supporting a network of high efficiency, improved transmission rates and low latency. C-RAN architecture is able to meet all these challenges, while focuses on the innovation of a functional split in the Base Station (BS) where the Baseband Units - BBU is detached from the Remote Radio Heads - RRH. Its successful implementation is able to bring significant benefits where among them cost reduction, the entrance of new network requirements and services as well as enhanced network flexibility, are the ones that dominate. In this paper, we perform the analysis of this type of network through the application of specific Teletraffic Models: the …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An intelligent agent negotiation strategy in the electronic marketplace environment",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377221706008411",
            "Abstract": "E-commerce will strongly penetrate the market if coupled with appropriate technologies and mechanisms. Mobile agents may enhance the intelligence and improve the efficiency of systems in the e-marketplace. We propose a dynamic multi-lateral negotiation model and construct an efficient negotiation strategy based on a ranking mechanism that does not require a complicated rationale on behalf of the buyer agents. This strategy can be used to extend the functionality of autonomous intelligent agents, so that they quickly reach to an agreement aiming to maximise their owner’s utility. The framework proposed considers both contract and decision issues, is based on real market conditions, and has been empirically evaluated. Moreover, it is shown that in a linear framework like the one we employ, more elaborate ranking mechanisms do not necessarily improve efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:u5HHmVD_uO8C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "RLAM: A dynamic and efficient reinforcement learning-based adaptive mapping scheme in mobile WiMAX networks",
            "Publication year": 2014,
            "Publication url": "https://content.iospress.com/articles/mobile-information-systems/mis00177",
            "Abstract": "WiMAX (Worldwide Interoperability for Microwave Access) constitutes a candidate networking technology towards the 4G vision realization. By adopting the Orthogonal Frequency Division Multiple Access (OFDMA) technique, the latest IEEE 802.16 x amendments manage to provide QoS-aware access services with full mobility support. A number of interesting scheduling and mapping schemes have been proposed in research literature. However, they neglect a considerable asset of the OFDMA-based wireless systems: the dynamic adjustment of the downlink-to-uplink width ratio. In order to fully exploit the supported mobile WiMAX features, we design, develop, and evaluate a rigorous adaptive model, which inherits its main aspects from the reinforcement learning field. The model proposed endeavours to efficiently determine the downlink-to-uplink width ratio, on a frame-by-frame basis, taking into account both the …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:dhFuZR0502QC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Analyzing the mobile WiMAX system resource exploitation of the downlink direction",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-013-1557-2.pdf",
            "Abstract": "Worldwide interoperability for microwave access (WiMAX) constitutes a viable networking technology, providing wireless connectivity in an efficient manner. In this work, on the grounds of the defined frame structure, a novel performance analysis of the mobile WiMAX standard in terms of the downlink resource utilization is presented. The analysis is validated via simulation, the results of which are also provided along with numerical results, studying the effectiveness of the OFDMA-based downlink mapping. The results reveal the relationship among the frame dimensions, the mapped request size, and the number of unexploited OFDMA slots.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Bringing always best connectivity vision a step closer: challenges and perspectives",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6461201/",
            "Abstract": "\"Always best connectivity,\" which constitutes a key challenge in the context of 4G systems, solicits service access and provisioning through the most appropriate access network any time, any place. In this relatively well investigated area, the problem of dynamically selecting the most suitable network for a specific service, referred to as access network selection (ANS), has recently received considerable attention. However, the several ANS proposals in the literature, which have explored relevant ANS criteria, methodologies, and techniques, point out that some related technical issues are still open challenges to be resolved. The aim of this article is to identify and discuss critical aspects and research challenges involved in the design of ANS decision schemes. At the same time, current research efforts are revisited, and potential enabling technologies/solutions are highlighted, in particular the ones associated with …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data quality in mobile crowd sensing systems: Challenges and perspectives",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8633627/",
            "Abstract": "Mobile Crowd Sensing (MCS) has become a new sensing paradigm, which leverages on the ubiquity of mobile devices with advanced multi-modal sensing features in conjunction with human intelligence so as to cost-efficiently monitor and analyze large-scale phenomena. MCS core characteristic is user involvement in data collection, processing, analysis and sharing. Due to the opt-in nature of MCS systems, a number of critical concerns is raised that should be efficiently addressed so as to enable MCS unimpeded advancement. Data reported by users could be unintentionally inaccurate and/or deliberately falsified. Thus, ensuring data quality and integrity in MCS constitutes one of its key challenges. This paper firstly discusses on the data quality challenge and identifying its interdependencies with different underlying key issues. Subsequently, we comprehensively survey representative reputation-based trust …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient internet search engine service provisioning exploiting a collaborative web result ranking mechanism",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4811494/",
            "Abstract": "In the context of this paper, a meta-search third-party Web result ranking mechanism is proposed, which is capable of adapting over the continuous changes that occur on the Web, providing in parallel personalized information acquisition considering the user's navigation behaviour. The designed meta search engine service rates, re-organises and combines the results acquired from search services for a specific user information resource request in accordance with a weighted combination of a performance related factor (tightly related to the ranking of the Web result as given by the search engine service) and a reliability related factor (corresponding to the user's satisfaction stemming from the specific Web result that he/she browses), while the performance of each search engine with respect to adequately adapting to the Web evolution is taken into account. Assuming a group of users falling within the same …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "2019 International Symposium on Performance Evaluation of Computer and Telecommunication Systems (SPECTS)",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7570528/",
            "Abstract": "A warm welcome from all the organizers of the 2016 International Symposium on Performance Evaluation of Computer and Telecommunication Systems, SPECTS 2016. This year marks the 19th anniversary of SPECTS, a significant date that shows the maturity of a conference that has become a leading international event on performance evaluation of computer and telecommunication systems. We are delighted to see the great progress this conference has made, and the excellent international reputation it has achieved. SPECTS 2016 offers an exceptional forum for worldwide researchers and practitioners from academia, industry, business, and government to share their expertise results and research findings in all areas of performance evaluation of computer and telecommunication systems and networks including their modeling, simulation and measurement/testing.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personalized multimedia web services in Peer to Peer networks using MPEG-7 and MPEG-21 standards",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-28977-4_13",
            "Abstract": "Multimedia information has been increased in the recent years while new content delivery services enhanced with personalization functionalities are provided to users. Several standards are proposed for the representation and retrieval of multimedia content. This paper makes an overview of the available standards and technologies. Furthermore a prototype semantic P2P architecture is presented which delivers personalized audio information. The metadata which support personalization are separated in two categories: the metadata describing user preferences stored at each user and the resource adaptation metadata stored at the P2P network’s web services. The multimedia models MPEG-21 and MPEG-7 are used to describe metadata information and the Web Ontology Language (OWL) to produce and manipulate ontological descriptions. SPARQL is used for querying the OWL ontologies. The MPEG …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An overview of self-organization aspects in femtocell deployments",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7785391/",
            "Abstract": "Femtocells are considered as a basic part in LTE and LTE Advanced systems and their importance will be leveraged in future 5G systems. Their specific characteristics allow for their independence in administration and optimization. Femtocell deployment aims at providing better indoor coverage, enhance spectral efficiency, and offload macrocell traffic. Despite their benefits for both users and operators femtocell introduction into the network is associated with many challenges such as interference management and resource partitioning, due mainly to their dynamic nature and large number of employed base stations. To deal effectively with such issues self-organization techniques are proposed and devised from the research community. In this work we provide an overview of the self-organization techniques and methods applied in femtocell deployment both from standardization bodies as well as from the research …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A study on social network metrics and their application in trust networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5562776/",
            "Abstract": "Social network analysis has recently gained a lot of interest because of the advent and the increasing popularity of social media, such as blogs, social networks, micro logging, or customer review sites. Such media often serve as platforms for information dissemination and product placement or promotion. In this environment, influence and trust are becoming essential qualities among user interactions. In this work, we perform an extensive study of various metrics related to the aforementioned elements, and their effect in the process of information propagation in the virtual world. In order to better understand the properties of links and the dynamics of social networks, we distinguish between permanent and transient links and in the latter case, we consider the link freshness. Moreover, we distinguish between local and global influence and compare suggestions provided by locally or globally trusted users.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Service Decomposition and Task Allocation in Distributed Computing Environments",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-74161-1_10",
            "Abstract": "Highly competitive and open environments should encompass mechanisms that will assist service providers in accounting for their interests, i.e., offering at a given period of time adequate quality services in a cost efficient manner. Assuming that a user wishes to access a specific service composed of a distinct set of service tasks, which can be served by various candidate service nodes, a problem that should be addressed is the allocation of service tasks to the most appropriate service nodes. This scenario accounts for both the user and the service provider. Specifically, service providers succeed in efficiently managing their resources, while users implicitly exploit in a seamless way the otherwise unutilized power and capabilities of the provider’s network. In general, service task allocation is founded on general and service specific user preferences, service provider’s specific service logic deployment and …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Efficient call admission control methods in diffserv architecture",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1346987/",
            "Abstract": "In order to achieve absolute QoS guarantees in the DiffServ architecture, admission control procedures have been developed. Their role is to ensure that the admittance of a new flow into the network does not violate service commitments of already established flows and the network could satisfy the constraints of the new flow. In this paper we discuss related work of parameter and measurement based admission control techniques, while a set of results indicative of their performance is provided.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data Science and Artificial Intelligence for Communications",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9247523/",
            "Abstract": "Nguyen, and Choong Seon Hong begin with a discussion of the key design aspects for enabling FL at network edge. The discussion is followed by a presentation of mechanisms that incentivize users to participate in FL. The authors propose a game-theoretic incentive mechanism to select a set of IoT devices willing to join the model training process. Then the selected set collaboratively trains a global model while minimizing the overall training costs. The last article of this issue is “Intelligent Resource Scheduling Based on Locality Principle in Data Center Networks.” Contributed by Weibei Fan, Jing He, Zhijie Han, Peng Li, and Ruchuan Wang, this article addresses the application of artificial intelligence to the allocation of resources in data centers while taking the locality principle into consideration. The authors provide a synopsis of challenges and an overview of the most prominent approaches for resource …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel fair mapping scheme for IEEE 802.16 downlink sub-frame",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5676550/",
            "Abstract": "A novel fair mapping scheme is proposed in this paper for the IEEE 802.16 downlink sub-frame. The mapping process is critical since it allocates the users' requests into the downlink sub-frame in order to be sent to the mobile stations. One of the most noticeable issues in this area lies on the fairness aspect. Giving that the mapping process defines the order and the way that the users' requests are being serviced, some users may be treated unfairly. In this work this issue is considered and a new mapping scheme is introduced. The proposed scheme encloses fair and more efficient mapping process, compared to the leading scheme, according to the presented simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient negotiation framework and strategies for the next generation electronic marketplace",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=11041597598885160626&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a personalized blog site recommendation system: a collaborative rating approach",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5381709/",
            "Abstract": "The blogosphere is a part of the Web, enhanced with several characteristics that differentiate blogs from traditional websites. The number of different authors, the multitude of user-provided tags, the inherent connectivity between blogs and bloggers, the high update rate, and the time information attached to each post are some of the features that can be exploited in various information retrieval tasks. Traditional search engines perform poorly on blogs since they do not cover these aspects. In an attempt to exploit these features, this paper proposes a personalized recommendation model, which capitalizes on a collaborative rating mechanism that exploits the hyperlinks between blogs. The model assumes that the intention of a blog owner who creates a link to another blog is to provide a recommendation to the blog readers and quantifies this intention in a local score for the blog being pointed. A set of implicit and …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive sensing policies for cognitive wireless networks using learning automata",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6754991/",
            "Abstract": "This paper introduces an adaptive spectrum sensing method for cognitive radio wireless networks. The proposed method enhances previously proposed random-based sensing policies, effectively selecting the licensed channels to be sensed by accurately estimating channels' availability, resulting, thus, to high system's resources utilization. The core mechanism of the adaptive method is an enhanced learning automaton, which efficiently interacts with the environment and provides accurate decisions on selecting the channel to be sensed on behalf of the secondary users. A thorough description of the introduced method is provided, while the performance of the enhanced sensing policies is verified through extensive simulation experiment.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using agents to enable personal mobility in TINA",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Malamati-Louta/publication/233791110_Using_agents_to_enable_personal_mobility_in_TINA/links/0c960514c8360d4b67000000/Using-agents-to-enable-personal-mobility-in-TINA.pdf",
            "Abstract": "Support for personal mobility will be among the key factors for success in the competitive communications market of the future. This paper proposes enhancements to the personal mobility support capabilities of standardised service architectures, like TINA. The key issues described in this paper are the following: 1. the introduction of the required functionality and realisation through appropriate service components; 2. the use of mobile intelligent agent technology for the implementation of the new components; 3. the integration among the standard TINA and the agent based personal mobility support components. In summary, a software framework that supports advanced personal mobility scenarios is proposed and justified in this paper.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IOS press"
        },
        {
            "Title": "Proportional delay differentiation provision by bandwidth adaptation of class‐based queue scheduling",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.675",
            "Abstract": "Supporting quality of service (QoS) over the Internet is a very important issue and many mechanisms have already been devised or are under way towards achieving this goal. One of the most important approaches is the so‐called Differentiated Services (DiffServ) architecture, which provides a scalable mechanism for QoS support in a TCP/IP network. The main concept underlying DiffServ is the aggregation of traffic flows at an ingress (or egress) point of a network and the marking of the IP packets of each traffic flow according to several classification criteria. Diffserv is classified under two taxonomies: the absolute and the relative. In absolute DiffServ architecture, an admission control scheme is utilized to provide QoS as absolute bounds of specific QoS parameters. The relative DiffServ model offers also QoS guarantees per class but in reference to the guarantees given to the other classes defined. In this paper …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:IjCSPb-OGe4C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Mobile crowd sensing architectural frameworks: A comprehensive survey",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7785385/",
            "Abstract": "Mobile Crowd Sensing has emerged as a new sensing paradigm, efficiently exploiting human intelligence and mobility in conjunction with advanced capabilities and proliferation of mobile devices. In order for MCS applications to reach their full potentials, a number of research challenges should be sufficiently addressed. The aim of this paper is to survey representative mobile crowd sensing applications and frameworks proposed in related research literature, analyze their distinct features and discuss on their relative merits and weaknesses, highlighting also potential solutions, in order to take a step closer to the definition of a unified MCS architectural framework.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Load dependent resource allocation in cooperative multiservice wireless networks: Throughput and delay analysis",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983838/",
            "Abstract": "Cooperative wireless networks supporting multiple services necessitate the application of a robust bandwidth allocation policy to ensure Quality of Service (QoS) provision to different applications. In this work, a load dependent bandwidth allocation technique is presented considering traffic priority and buffer load in the relay nodes of a cooperative communication network. An analytical approach for bandwidth sharing is provided along with a delay analysis, verifying that the proposed scheme can efficiently provide traffic differentiation, satisfying, also, the QoS requirements in terms of bandwidth, packet transmission rate and delay. The results obtained by the analysis are validated via simulations, confirming the improved network performance in terms of throughput and delay.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile intelligent agent technology for QoS provisioning and network management",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Angelos-Michalas/publication/262396471_Mobile_intelligent_agent_technology_for_QoS_provisioning_and_network_management/links/56a6231a08ae6c437c1adc3c/Mobile-intelligent-agent-technology-for-QoS-provisioning-and-network-management.pdf",
            "Abstract": "The DiffServ architecture provides a scalable mechanism for QoS introduction in a TCP/IP network. DiffServ model is based on the aggregation of traffic flows at an ingress (or egress) point of a network and the IP packet marking for different priority flows, according to several classification criteria. Two approaches exist in the DiffServ architecture: the Absolute and the Relative. In Absolute DiffServ, an admission control scheme is used to provide QoS guarantees as absolute bounds of specific QoS parameters. The Relative DiffServ model provides QoS guarantees per service class expressed with reference to guarantees given to other classes defined. Our study presents a QoS Provisioning & Network Management System. This system is based on an extension of the network management architecture followed and implemented within the scope of the European IST Project MANTRIP. MANTRIP network management system supports quality of service configuration and monitoring in IP networks. Our extension provides QoS Differentiation (Absolute and Relative) in IP DiffServ based Networks. The proposed system has been applied and performed well on a real network testbed.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An adaptive power management scheme for Ethernet Passive Optical Networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6912460/",
            "Abstract": "Undoubtedly, energy consumption in communication networks poses a significant threat to the environmental stability. Access networks contribute to this consumption by being composed of numerous energy inefficient devices and network equipment. Passive Optical Networks (PONs), one of the most promising candidates in the field of access networking, should avoid this bottleneck in the backhaul power consumption by lowering the energy use of the optical devices. In this paper, we move towards that direction by introducing an energy efficient power management scheme that encompasses two major goals: a) to reduce the energy consumption by allowing the optical devices to enter the sleep mode longer, and b) to concurrently maintain the network performance. To this end, we focus on the energy consumed by the optical network units (ONUs). The intelligence of the ONUs is stimulated by enhancing the …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Retailer Selection and Pricing Mechanisms in E-Business Context",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.195.1749&rep=rep1&type=pdf",
            "Abstract": "The highly competitive communications markets of the future should encompass mechanisms for enabling users to find and associate with the most appropriate retailers, ie, those offering at a certain time period adequate quality services in a cost efficient manner. This paper presents such mechanisms. In this context, key factor for retailers’ success is the strategy adopted regarding service provision, since it forms a means of gaining new customers and enhancing existing customers’ loyalty. Our starting point is the definition of a business case, through which the role of the best candidate-retailer selection problem is explained, while the alternative strategies a retailer may adopt under different circumstances in order to generate attractive offers are described. The identified components of the best candidateretailer selection problem involve the evaluation of the quality of a retailer offer, which is concisely defined, mathematically formulated and solved. At the final sections results are provided and concluding remarks are made.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using learning automata for adaptively adjusting the downlink-to-uplink ratio in IEEE 802.16 e wireless networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983863/",
            "Abstract": "IEEE 802.16e allows for flexibly defining the relation of the downlink and uplink sub-frames' width from 3:1 to 1:1, respectively. However, the determination of the most suitable ratio is left open to the network designers and the research community. Existing scheduling and mapping schemes are inflexibly designed. In this paper, a novel adaptive mapping scheme is proposed aiming to dynamically adjust the downlink-to-uplink ratio, following adequately the modification of the load requests with respect to both downlink and uplink directions. A learning automaton is exploited in order to sense the performance of the downlink and uplink mapping processes and to determine the most appropriate length ratio of both sub-frames in order to maximize the network performance. The suggested ratio determination scheme is evaluated through realistic scenarios and it is compared with static schemes that maintain a fixed ratio …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On forecasting the ONU sleep period in XG-PON systems using exponential smoothing techniques",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7037196/",
            "Abstract": "Power management has been advanced on a crucial factor in the design of modern access networks. Furthermore, the proliferation of optical networking in the last mile led major Telecom unions, such as the International Telecommunication Union (ITU), to emerge energy consumption as a critical objective of the next generation passive optical networks (NG-PONs). In particular, the standardization of the 10-gigabit-capable PON (XG-PON) entails well-defined specifications towards power management and energy reduction, especially regarding the power control of optical terminal devices such as the optical network units (ONUs). In this way, the optical line terminator (OLT) along with ONUs are able to cooperate with each other in order to succeed energy reduction, by applying doze or cyclic sleep periods to idle ONUs. However, the sleep period determination remains a quite challenging research area. In this …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced CLWPR Protocol with Social Properties Exploiting Physical Proximity in VANETs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8633619/",
            "Abstract": "Opportunistic mobile networks have attracted a lot of attention and several routing protocols have been proposed. However, most algorithms do not consider the importance of users' properties of human mobility in physical world. Given this fact, in this work we enhance CLWPR, a cross-layer optimized position-based routing protocol for urban VANET environments, combining social properties and users' individual mobility traces in order to design an efficient content dissemination scheme. We introduce an offline social metric (OSM), which is based on physical proximity and opportunistic contacts of nodes. Our proposed protocol favors nodes with close offline social relationship as next forwarder nodes. We present a comprehensive study of the performance of our enhanced CLWPR protocol routing against other routing protocols in distributed vehicular networks using realistic representative urban scenarios with …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Series Editorial: Artificial Intelligence and Data Science for Communications",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9530492/",
            "Abstract": "Owing to the unprecedented amount of data and abundant computing resources, artificial intelligence (AI) and machine learning (ML) are widely adopted and used in many disciplines. Since the inaugural issue of this Series in May 2019, we have seen a multitude of studies applying AI and ML techniques to diverse areas of communications. Starting with this issue, we have made a slight change in the title of the series to become “Artificial Intelligence and Data Science for Communications.” We considered that most of the submitted manuscripts are related to AI and ML and fewer submissions are related to data science (DS). This is why we moved AI ahead of DS.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Time synchronization in XG-PON systems: An error analysis",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7517980/",
            "Abstract": "Synchronization in modern optical systems is of paramount importance. The sharing of a common time between different network components constitutes a crucial factor towards system stability. Latest advancements in optical access networks, such as Passive Optical Networks (PONs), allow transmission rates of 10 Gbps. Hence, a very accurate synchronization method is required in order to keep the network free of blocking and collisions. In this work, we focus on 10-gigabit-capable passive optical network (XG-PON) systems, one of the most popular standards for PONs. A rigorous analytic approach is devised so as to investigate the required precision of underlying synchronization method. Closed equations for computing the no blocking and blocking probabilities are developed. The devised analytic framework is verified using simulation methods.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Negotiation of Intelligent Agents: Dynamic Model and Contract Ranking Strategy for Electronic Commerce environments",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Malamati-Louta/publication/233833121_Negotiation_of_Intelligent_Agents_Dynamic_Model_and_Contract_Ranking_Strategy_for_Electronic_Commerce_environments/links/00b7d514b6dbb430ed000000/Negotiation-of-Intelligent-Agents-Dynamic-Model-and-Contract-Ranking-Strategy-for-Electronic-Commerce-environments.pdf",
            "Abstract": "The electronic commerce market segment will further expand, if coupled with the appropriate technologies and mechanisms. The intelligence and efficiency of systems in the e-marketplace can be drastically enhanced by introducing mobile agents in various levels. In this paper, we propose a dynamic multilateral negotiation model and we build an effective seller agent negotiation strategy on the grounds of a weighted ranking mechanism adopted by the buyer agents. The objective of this strategy is to extend the functionality of autonomous agents, so that they reach to an agreement aiming to maximise their owner’s utility. This approach considers both contract and decision issues, is based on real market conditions, and has been empirically evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trust management framework for efficient service provisioning in dynamic distributed computing environments",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4545665/",
            "Abstract": "In dynamic distributed computing environments, system entities may be classified into two main categories that are, in principle, in conflict. These are the Service Resource Requestors (SRRs) wishing to use services and/or exploit resources offered by the other system entities and the Service Resource Providers (SRPs) that offer the services/resources requested. Seeking for the maximisation of their welfare, while achieving their own goals and aims, entities may misbehave (intentionally or unintentionally), thus, leading to a significant deterioration of system's performance. In this study, a reputation mechanism is proposed which helps estimating SRPs trustworthiness and predicting their future behaviour, taking into account their past performance in consistently satisfying SRRs' expectations. The reputation mechanism is distributed, considers both first-hand information (acquired from the SRR's direct past …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reputation Based Intelligent Agent Negotiation Frameworks in the e-Marketplace.",
            "Publication year": 2006,
            "Publication url": "https://www.scitepress.org/papers/2006/14266/14266.pdf",
            "Abstract": "E-commerce is expected to achieve high market penetration if coupled with the appropriate technologies. Mobile Agent Technology (MAT) may enhance the intelligence and improve the efficiency of systems in the e-marketplace. Such a highly competitive and extremely dynamic market should encompass mechanisms for enabling users (Buyers) to find the most appropriate service providers (Sellers), ie, those offering adequate quality services at a certain time period in a cost efficient manner. In this study, the Buyers’ decision on the “best” Seller is based on a weighted combination of the evaluation of the quality of the Sellers’ offer (performance related factor) and of their reputation rating (reliability related factor). Efficient negotiation frameworks are enhanced with a Sellers’ collaborative reputation mechanism, which helps estimating their trustworthiness and predicting their future behaviour, taking into account the Sellers’ past performance in satisfying the Buyers’ expectations. In essence, Sellers are rated with respect to whether they honoured or not the agreements they have established with the Buyers, thus introducing the concept of trust among the negotiators. The reputation mechanism considers both first-hand information (acquired from the Buyer’s past experiences with the Sellers) and second-hand information (disseminated from other Buyers’ based on their own past experiences with the Sellers), while spurious reputation ratings are taken into account.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel medium access Control Protocol for radio-over-fiber access networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6503520/",
            "Abstract": "Radio over fiber (RoF) technology is considered as an energy and cost-effective solution to cover the users' rapidly increasing demands for bandwidth and mobility. However, integration of a wireless and an optical network into a hybrid one needs the design of new protocols. In this work, a novel MAC protocol based on the MultiPoint Control Protocol (MPCP) is proposed. The network's decision center receives feedback from the mobile clients via MPCP's GATE/REPORT mechanism so as to efficiently allocate the bandwidth and the wavelength resources in a dynamic manner. The proposed MAC protocol adapts its operation according to the actual client traffic demands. Simulation results reveal the superior performance of the proposed protocol compared to other similar competing proposals reported in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Agent based support of advanced personal mobility features",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46525-1_21",
            "Abstract": "Support for personal mobility will be among the key factors for success in the competitive communications market of the future. This paper proposes enhancements to the personal mobility support capabilities of existing service architectures. The TINA service architecture is considered to be our starting point. The key issues in this paper are the following. First, the definition of the required functionality and its design by means of appropriate service components. Second, the use of mobile intelligent agent technology for the implementation of the new components. Third, the integration of the agent based personal mobility support components to the “standard” TINA.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On analyzing the intra-frame power saving potentials of the IEEE 802.16 e downlink vertical mapping",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128613000339",
            "Abstract": "Worldwide Interoperability for Microwave Access (WiMAX) is generally considered as a competitive candidate networking technology for the realization of the 4G vision. Among the key factors towards its successful and widespread deployment are the effective support of mobility and the provision of mechanisms for enabling service access at a high quality level in an efficient and cost-effective manner. Nonetheless, this effort should take into account and adequately address strict and severe energy limitations that the mobile devices are currently facing. Power saving constitutes an issue of vital importance, as mobile terminals continue to incorporate more and more functionalities and energy-hungry features in order to support the ever increasing user requirements and demands. The standard employs variations of power saving classes in a frame-to-frame basis, while recent power saving mechanisms proposed in …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A survey on reputation-based cooperation enforcement schemes in wireless ad hoc networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5741493/",
            "Abstract": "Mobile ad hoc networks rely on node cooperation to perform and support basic functions like packet forwarding, routing and network management. In general, nodes' misbehaviour can significantly degrade the performance of the network. Cooperation enforcement schemes are seen as a lightweight alternative to conventional security techniques, providing a “softer” security layer to protect basic networking operations. The aim of this paper is to survey representative cooperation enforcement schemes exploiting a reputation system proposed in related research literature. Their distinct features are analyzed and their relative merits and weaknesses are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimation of the Buyer's contract space incorporating learning from experience techniques to the Seller's rationale in e-commerce context",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1565617/",
            "Abstract": "Various state-of-the-art technologies are necessary to enhance the efficiency and increase the interest for e-commerce transactions. Mobile agents are one of the means that may enhance the intelligence and improve the effectiveness of systems in the e-marketplace. This paper aims to present the basic elements of the designed dynamic multilateral negotiation model and strategies that do not require a complicated rationale on behalf of the buyer agents. It focuses on the enhancement of the seller's reasoning component by incorporating to the designed negotiation strategies a novel mechanism for the estimation of the mutually acceptable contract region by exploiting relative market data combined with knowledge acquired from previous experience. This technique is used to extend the functionality of autonomous agents, so that they reach to an agreement faster aiming to maximise their owner's utility. The …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Retailer selection in future open competitive communications environments",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366401003930",
            "Abstract": "The highly competitive communications markets of the future should encompass mechanisms for enabling users to find and associate with the most appropriate retailers, i.e. those offering at a certain time period adequate quality services in a cost efficient manner. This paper presents such mechanisms. Our starting point is the definition of a business case, through which the role of the best candidate-retailer selection problem is explained. In the sequel, the problem is analysed and the identified sub-problems are concisely defined, mathematically formulated and solved. The identified components of the best candidate-retailer selection problem involve the evaluation of the quality of a retailer offer and the reduction of the set of candidate retailers by exploiting learning from experience notions. In the final sections, results are provided and concluding remarks are made.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Towards efficient trust aware e-marketplace frameworks",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/towards-efficient-trust-aware-marketplace/41189",
            "Abstract": "In the liberalized and deregulated e-marketplace some key factors for service providers’ success are the following. First, the efficiency with which services will be developed. Second, the quality level, in relation with the corresponding cost, of new services. Third, service providers’ reliability with respect to service provisioning. Fourth, the efficiency with which the services will be operated (controlled, maintained, administered, etc.). The aim of this paper is, in accordance with efficient service operation objectives, to propose enhancements to the sophistication of the negotiation functionality that can be offered by e-commerce systems in open competitive communications environments. In the highly competitive and dynamic emarketplaces, Service/Product Requestors (SPRs) should be provided with mechanisms that enable them to find and associate with the most appropriate Service/Product Providers (SPPs), ie, those …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Quality of Service Management in IP networks",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1215860/",
            "Abstract": "The DiffServ architecture provides a scalable mechanism for QoS introduction in an IP network. The idea of DiffServ is based on the aggregation of traffic flows at an ingress (or egress) point of a network and IP packet marking for different priority flows, according to several classification criteria. In this paper the problem of the improvement and fairness of absolute QoS provisioning to paths established along a DiffServ network on a per router basis is considered. The service rate reconfiguration problem of a router's output link is formally defined, mathematically formulated and solved by means of efficient heuristic algorithms, providing good solutions in reasonable time. Finally, an indicative set of results is provided and concluding remarks are made.",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive task scheduling in grid computing environments",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5381681/",
            "Abstract": "In this study the task scheduling problem in Grid computing environments has been addressed. To resolve the problem a set of Grid Services are defined and implemented conforming to the OGSA standards. The proposed scheduling architecture is semantically enhanced and provides the most appropriate assignment of tasks to computing resources, given the current load conditions of each computing resource and the network status. The Ant Colony Optimization algorithm (ACO) was used to effectively assign tasks to computing resources. First experimental results indicate that the proposed framework produces good results in comparison to other well known schemes considered (e.g. round robin).",
            "Abstract entirety": 1,
            "Author pub id": "5yvGyGsAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The impact of social distance on utility based resource allocation in next generation networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6078935/",
            "Abstract": "Social networks have rapidly grown over the last years. The socio-technical information that they include may be exploited to improve the performance of the underlying communication network. This is of utmost importance especially in Next Generation Networks (NGNs), which provide multiple services with increased bandwidth requirements. In this paper, the problem of resource allocation in a bottleneck link of a NGN is examined. To this end, a utility based technique is proposed, which integrates the information of an overlaid social network expressed by the social distance parameter. In this case, the utility function employed is reformed, so as to incorporate this parameter, which in this study is determined by the users' average popularity. Network users are classified into friendship classes according to the social distance parameter. Then, the users' resource allocation objective is formulated as an optimization …",
            "Abstract entirety": 0,
            "Author pub id": "5yvGyGsAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        }
    ]
}]