[{
    "name": "Μιχαήλ  Λογοθέτης",
    "romanize name": "Michail  Logothetis",
    "School-Department": "Ηλεκτρολόγων Μηχ & Τεχνολογίας Υπολογιστών",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 8497,
    "Scholar name": "Michael D. Logothetis",
    "Scholar id": "ybBA1ZIAAAAJ",
    "Affiliation": "Professor, ECE, University of Patras",
    "Citedby": 2376,
    "Interests": [
        "Communication Networks",
        "Teletraffic Engineering"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=ybBA1ZIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Bandwidth reservation in the Erlang multirate loss model for elastic and adaptive traffic",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/43198947/aict_2013_7_20_10056.pdf",
            "Abstract": "In this paper, we consider a single-link multirate loss system, which accommodates K service-classes with different traffic and peak-bandwidth requirements. Calls of each service-class arrive in the system according to a Poisson process and have an exponentially distributed service time. The",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "QoS Equalization in a W-CDMA Cell Supporting Calls of Innite or Finite Sources with Interference Cancelation",
            "Publication year": 2014,
            "Publication url": "https://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-6c9fdf58-316f-4cff-8fd1-333f400eccff",
            "Abstract": "In this paper, a multirate loss model for the calculation of time and call congestion probabilities in a Wideband Code Division Multiple Access (W-CDMA) cell is considered. It utilizes the Bandwidth Reservation (BR) policy and supports calls generated by an infinite or finite number of users. The BR policy achieves QoS equalization by equalizing congestion probabilities among calls of different service-classes. In the proposed models a multiple access interference is considered, and the notion of local blocking, user’s activity and interference cancelation. Although the analysis of the proposed models reveals that the steady state probabilities do not have a product form solution, the authors show that the calculation of time and call congestion probabilities can be based on approximate but recursive formulas, whose accuracy is verified through simulation and found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A parametric linear programming model describing bandwidth sharing policies for ABR traffic",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Moscholios/publication/228956181_A_parametric_linear_programming_model_describing_bandwidth_sharing_policies_for_ABR_traffic/links/5649b22408ae451880af67bb/A-parametric-linear-programming-model-describing-bandwidth-sharing-policies-for-ABR-traffic.pdf",
            "Abstract": "We consider the fair bandwidth allocation problem of ABR calls by a Connection Admission Controller (CAC) at call setup. Its general solution is given by applying the “max-min fairness allocation policy”. Extensions of this policy take into account the Minimum Cell Rate (MCR) and the Peak Cell Rate (PCR) traffic description parameters, which are essential for ABR. These extensions are distinguished according to the existence or non-existence of weights in the policy. The weights may be defined independent of MCR or dependent on MCR.In this paper firstly we present a linear programming model, which describes in a parametric way both weighted and unweighted bandwidth allocation policies for ABR services. Because of the parametric nature of the LP model, it can be easily extended in order to take into account various bandwidth allocation policies. Secondly, we propose an unweighted fair bandwidth allocation policy in which ABR calls are grouped in categories, according to their traffic description parameters and the max-min fairness allocation policy is applied among the groups while the MCR and PCR can be taken into account for each group. Thirdly we propose a weight-based fair bandwidth allocation policy in which the number of links of an ABR connection stands for the weight.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teletraffic-Theory and Applications Teletraffic-Theory and Applications, 1993",
            "Publication year": 2007,
            "Publication url": "https://ci.nii.ac.jp/naid/10026176770/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 \n出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について <no title> AKIMARU H. 被引用\n文献: 1件 著者 AKIMARU H. 収録刊行物 Teletraffic-Theory and Applications Teletraffic-Theory \nand Applications, 1993 Springer Verlag 被引用文献: 1件中 1-1件を 表示 1 An ON-OFF \nMulti-Rate Loss Model of Finite Sources MOSCHOLIOS Ioannis D. , LOGOTHETIS Michael D. \n, KOUKIAS Michael N. IEICE transactions on communications 90(7), 1608-1619, 2007-07-01 \n参考文献34件 大学共同利用機関シンポジウム Tweet 各種コード NII論文ID(NAID) 10026176770 \n資料種別 図書全体 データ提供元 CJP引用 書き出し RefWorksに書き出し EndNoteにに/で| …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On channel sharing policies in LEO mobile satellite systems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8269248/",
            "Abstract": "We consider a low earth orbit (LEO) mobile satellite system with “satellite-fixed” cells that accommodates new and handover calls of different service-classes. We provide an analytical framework for the efficient calculation of call blocking and handover failure probabilities under two channel sharing policies, namely the fixed channel reservation and the threshold call admission policies. Simulation results verify the accuracy of the proposed formulas. Furthermore, we discuss the applicability of the policies in software-defined LEO satellites.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Call blocking probabilities of elastic and adaptive traffic with retrials",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Mohamed-Mourad-Lafifi/post/Could-NS-3-be-used-to-simulate-Analog-Network-Coding-ANC-or-Physical-Layer-Network-Coding-PNC-in-mesh-wireless-networks/attachment/59d647e279197b80779a2aaf/AS%3A464560902676481%401487771358498/download/aict_2012_full.pdf#page=103",
            "Abstract": "We study a single-link multirate loss system, which accommodates both elastic and adaptive traffic of Poisson arriving calls, with exponentially distributed service time and flexible bandwidth requirements. If the available link bandwidth is not enough to accept a new call with its peak-bandwidth requirement, then the call can retry one or more times (single/multi-retry loss models) to be connected in the system with reduced bandwidth. If its last bandwidth requirement remains higher than the available link bandwidth, the call can still be accepted in the system, by compressing the bandwidth of all in-service calls together with its last bandwidth requirement. The proposed models do not have a product form solution, and therefore we propose approximate recursive formulas for the efficient calculation of call blocking probabilities. The consistency and the accuracy of our models are verified by simulation, and found to be very satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance modelling and analysis of passive optical networks for poisson traffic",
            "Publication year": 2008,
            "Publication url": "http://komunikacie.uniza.sk/index.php/communications/article/view/1102",
            "Abstract": "Passive Optical Networks (PONs) are the most important class of fiber-based access systems, capable of delivering services with numerous applications, such as high-definition video and video conferencing. In this paper we perform call-level performance analysis of the upstream direction in TDMA-based PONs and hybrid TDMA-WDM PONs. The proposed analysis is based on well-established recursive teletraffic models and leads to Call Blocking Probabilities determination. We consider the case where the optical access network accommodates multiple serviceclasses with Poisson arriving calls. The accuracy of the proposed analytical models is validated by simulation and is found to be absolutely satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiservice Loss Models for Cloud Radio Access Networks",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9517044/",
            "Abstract": "In this paper, a cloud radio access network (C-RAN) is considered where the remote radio heads (RRHs) are separated from the baseband units which form a common pool of computational resource units. Depending on their capacity, the RRHs may form one or more clusters. Each RRH accommodates multiservice traffic, i.e., calls from different service-classes with different radio and computational resource requirements. Arriving calls follow a Poisson process and simultaneously require radio and computational resource units in order to be accepted in the serving RRH. If their resource requirements cannot be met then calls are blocked and lost. Otherwise, calls remain in the serving RRH for a generally distributed service time. Assuming the single-cluster C-RAN, we model it as a multiservice loss system, prove that a product form solution exists for the steady-state probabilities and determine call blocking …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:FPJr55Dyh1AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest Editorial: SDN and NFV Based 5G Heterogeneous Networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/iel7/6072580/8180523/08245942.pdf",
            "Abstract": "While 5G development and standardisation activities are still at their early stage, it is widely acknowledged that 5G systems are going to rely extensively on heterogeneous networking technologies, which would exploit network functions virtualisation (NFV) and software defined networking (SDN) paradigms. The adoption of NFV and SDN technologies by next-generation heterogeneous mobile networks introduces new virtual network elements, each affecting the logic of the network management and operation, enabling the creation of new generation services with substantially higher data rates and lower delays. On the other hand, new challenges are also introduced in terms of design, operation, management and security of the next-generation mobile networks.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:tS2w5q8j5-wC",
            "Publisher": "INST ENGINEERING TECHNOLOGY-IET"
        },
        {
            "Title": "CONTEL 2019-15TH INTERNATIONAL CONFERENCE ON TELECOMMUNICATIONS, PROCEEDINGS",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=10212903405700812577&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Call‐level performance analysis of a W‐CDMA cell with finite population and interference cancellation",
            "Publication year": 2011,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.1446",
            "Abstract": "We study the effect of Interference Cancellation (IC) on the Call Blocking Probabilities (CBP), in the uplink of W‐CDMA networks supporting multiple service‐classes with finite number of traffic sources. We propose an approximate but recurrent formula for the calculation of the system state probabilities and CBP that captures the IC efficiency parameter, as well as other parameters peculiar to W‐CDMA networks such as soft blocking and user activity. To this end, we describe the state transition diagram of the W‐CDMA system by one‐dimensional Markov chain. The analytical CBP results are compared with simulation results in order to verify the validity of the proposed formulas and reveal their accuracy. In addition, we show the consistency of our analysis when the number of traffic sources becomes infinite. Copyright © 2010 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:ye4kPcJQO24C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Transmission Networking: SONET and the Synchronous Digital Hierarchy Transmission Networking: SONET and the Synchronous Digital Hierarchy, 1992",
            "Publication year": 2003,
            "Publication url": "https://ci.nii.ac.jp/naid/10010554479/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 <no title> SEXTON \nM. 被引用文献: 1件 著者 SEXTON M. 収録刊行物 Transmission Networking : SONET and the \nSynchronous Digital Hierarchy Transmission Networking : SONET and the Synchronous Digital \nHierarchy, 1992 Artech House 被引用文献: 1件中 1-1件を 表示 1 New Algorithms for Working \nand Spare Capacity Assignment in Integrated Self-Healing Networks LOGOTHETIS Michael \n, NIKOLAOU Ioannis IEICE transactions on communications 86(4), 1346-1355, 2003-04-01 \n参考文献17件 Tweet 各種コード NII論文ID(NAID) 10010554479 資料種別 図書全体 CJP/(…",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Connection Dependent Threshold Model in a fixed routing network",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=t9zOAwAAQBAJ&oi=fnd&pg=PA55&dq=info:eAgf96Tu8WEJ:scholar.google.com&ots=FdNlNEP-om&sig=iX2bYNzctzV2H__B51JS1ymj3UI",
            "Abstract": "The call-level QoS assessment in communication networks remains an open issue, due to elastic services. We have proposed the Connection Dependent Threshold Model (CDTM) as a generalization of the Erlang Multirate Loss Model, in order to assess the call-level performance of elastic service-classes accommodated in a single link. In this paper we extend the CDTM in fixed-routing multirate loss networks. In the CDTM, calls of each service-class that arrive in the network can reduce their bandwidth, while increase their service time requirement, according to a set of thresholds which indicates the occupied bandwidth in each link of their route (sequence of links). The absence of a product form solution in the CDTM, leads us to an approximate but recurrent formula for the calculation of the call-level performance index, namely the call blocking probabilities. To overcome the complexity of the proposed recurrent formula, the reduced load approximation method is used. Simulation results validate our analytical methodology.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Lulu. com"
        },
        {
            "Title": "Scalable bloom-filter based content dissemination in community networks using information centric principles",
            "Publication year": 2016,
            "Publication url": "http://repository.uwl.ac.uk/id/eprint/2828/",
            "Abstract": "Information-Centric Networking (ICN) is a new communication paradigm that shifts the focus from content location to content objects themselves. Users request the content by its name or some other form of identifier. Then, the network is responsible for locating the requested content and sending it to the users. Despite a large number of works on ICN in recent years, the problem of scalability of ICN systems has not been studied and addressed adequately. This is especially true when considering real-world deployments and the so-called alternative networks such as community networks. In this work, we explore the applicability of ICN principles in the challenging and unpredictable environments of community networks. In particular, we focus on stateless content dissemination based on Bloom filters (BFs). We highlight the scalability limitations of the classical single-stage BF based approach and argue that by enabling multiple BF stages would lead to performance enhancements. That is, a multi-stage BF based content dissemination mechanism could support large network topologies with heterogeneous traffic and diverse channel conditions. In addition to scalability improvements, this approach also is more secure with regard to Denial of Service attacks.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the end-to-end delay analysis of the IEEE 802.11 distributed coordination function",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4271762/",
            "Abstract": "The IEEE 802.11 protocol is the dominant standard for wireless local area networks (WLANs) and has generated much interests in investigating and improving its performance. The IEEE 802.11 medium access control (MAC) is mainly based on the distributed coordination function (DCF). DCF uses a carrier sense multiple access with collision avoidance (CSMA/CA) protocol in order to resolve contention between wireless stations and to verify successful transmissions. In this paper we present an extensive investigation of the performance of the IEEE 802.11b MAC protocol, in respect of end-to-end delay. The end-to-end delay analysis of the IEEE 802.11b has not been completed, because no adequate queuing delay is provided. Our delay analysis is based on Bianchi's model for the DCF, while a more comprehensive model could be used as well. We use z-transform of backoff duration to get mean value, variance …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobility-aware QoS assurance in software-defined radio access networks: An analytical study",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7116192/",
            "Abstract": "Software-defined networking (SDN) has gained a tremendous attention in the recent years, both in academia and industry. This revolutionary networking paradigm is an attempt to bring the advances in computer science and software engineering into the information and communications technology (ICT) domain. The aim of these efforts is to pave the way for completely programmable networks and control-data plane separation. Recent studies on feasibility and applicability of SDN concepts in cellular networks show very promising results and this trend will most likely continue in near future. In this work, we study the benefits of SDN on the radio resource management (RRM) of future-generation cellular networks. Our considered cellular network architecture is in line with the recently proposed Long-Term Evolution (LTE) Release 12 concepts, such as control-data plane split, heterogeneous networks (HetNets …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Static and Dynamic Analysis of WannaCry Ransomware",
            "Publication year": 2018,
            "Publication url": "https://ci.nii.ac.jp/naid/230000001861/",
            "Abstract": "CiNii 論文 - Static and Dynamic Analysis of WannaCry Ransomware CiNii 国立情報学研究所 \n学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす \n新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID \n著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 Static \nand Dynamic Analysis of WannaCry Ransomware Maxat Akbanov University of York Vassilios \nG. Vassilakis University of York Ioannis D. Moscholios University of Peloponnese Michael D. \nLogothetis University of Patras 著者 Maxat Akbanov University of York Vassilios G. Vassilakis \nUniversity of York Ioannis D. Moscholios University of Peloponnese Michael D. Logothetis \nUniversity of Patras 収録刊行物 IEICE Proceeding Series IEICE Proceeding Series (32), \nSESSION02_2, 2018 The Institute of Electronics, Information and Communication Engineers (…",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:q3CdL3IzO_QC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Call Blocking Probabilities in Multi-Cluster C-RAN Supporting Poisson Traffic",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9249504/",
            "Abstract": "In this paper, a cloud radio access network (C-RAN) is considered where the remote radio heads (RRHs) are separated from the baseband units (BBUs). The RRHs are grouped in different clusters according to their capacity while the BBUs form a centralized pool of computational resource units. Each RRH accommodates Poisson arriving calls which require a radio and a computational resource unit in order to be accepted in the C-RAN. If these units are not available, call blocking occurs. To compute call blocking probabilities we propose a convolution algorithm which performs quite satisfactory, in terms of computational time.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:SpbeaW3--B0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Equalization of congestion probabilities in a W-CDMA cell supporting calls of finite sources with interference cancellation",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6923801/",
            "Abstract": "In this paper, we consider a multirate teletraffic loss model for the calculation of congestion probabilities in a Wideband Code Division Multiple Access (W-CDMA) cell that utilizes the Bandwidth Reservation (BR) policy and supports calls generated by a finite number of users. The BR policy is used particularly to equalize congestion probabilities among calls of different service-classes. In the proposed model we consider multiple access interference, the notion of local blocking, user's activity and interference cancellation. We show that the calculation of congestion probabilities is based on approximate but recursive formulas, whose accuracy is verified through simulation and found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On call admission control in W-CDMA networks supporting handoff traffic",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.360.9272&rep=rep1&type=pdf",
            "Abstract": "In this paper, we evaluate a Call Admission Control (CAC) scheme suitable for W-CDMA networks accommodating multiple service-classes. In such networks, the distinction between new and handoff traffic is very important. A simple CAC scheme can distinguish calls between the two traffic types by setting different thresholds for call admission. This simple CAC scheme is evaluated in respect of blocking probabilities of both new and handoff calls. To this end, we formulate aggregated Markov chains, which describe both new-call and handoff-call arrival processes, under the assumption that they are Poisson or quasi-random. Based on these Markov chains we derive recurrent and computationally efficient formulas for the calculation of the system state probabilities. Consequently, we calculate newcall and handoff-call blocking probabilities. The analytical results are verified through simulation and found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Engset multi-rate state-dependent loss models",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0166531604000768",
            "Abstract": "Call blocking probabilities (CBP) are a key index of quality of service assessment in multi-rate networks. We focus on the CBP calculation in single link loss models where calls of each service-class come from finite sources and compete for the available link bandwidth under the complete sharing policy. We review the Engset multi-rate loss model (EnMLM) and the single-retry loss model for finite sources (f-SRM) in which blocked calls of a service-class may immediately retry once, in order to be connected in the system, with reduced bandwidth and increased service time requirements. We extend the f-SRM to the multi-retry loss model for finite sources (f-MRM) to cover multiple retrials. Furthermore, we propose the single- and multi-threshold finite source models (f-STM, f-MTM) in which calls, prior to being blocked, may adjust their traffic requirements according to a common set of thresholds, which indicate the …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:K3LRdlH-MEoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Special issue on'teletraffic engineering in communication systems'",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/document/6808267/",
            "Abstract": "This Special Issue on Teletraffic Engineering in Communications Systems brings together six of the best research papers from academia, and reflects some of the latest and original achievements, with three very different papers concentrating on the resource allocation for quality of service (QoS) guarantee, traffic modelling, Internet traffic anomalies modelling and traffic-aware routing in cognitive radio (CR) network.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IET"
        },
        {
            "Title": "Delay performance of WDM-EPON for multi-dimensional traffic under the IPACT fixed service and the multipoint control protocol",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Moscholios/publication/317015316_Delay_Performance_of_WDM-EPON_for_Multi-dimensional_Traffic_Under_the_IPACT_Fixed_Service_and_the_MultiPoint_Control_Protocol/links/591f10fd4585151c0816e06c/Delay-Performance-of-WDM-EPON-for-Multi-dimensional-Traffic-Under-the-IPACT-Fixed-Service-and-the-MultiPoint-Control-Protocol.pdf",
            "Abstract": "Passive Optical Networks (PONs) gain ever more ground in the Telecom market, because of their low cost and significant advantages over legacy broadband access systems. We concentrate on the performance evaluation of Ethernet PONs (EPONs) and particularly on Wavelength Division Multiplexing (WDM)-EPONs which support Internet traffic. We consider traffic of multiple service-classes and focus on the calculation of the mean total delay from the so-called Optical Network Unit (ONU) to the Optical Line Terminator (OLT). The PON operates under the fixed service of the IPACT (Interleaved Polling With Adaptive Cycle) algorithm, which uses the MultiPoint Control Protocol (MPCP). The delay analysis is based on a unified approach for EPONs and WDM-EPONs, through the formation of two classical queuing models: an M/D [x]/C for the packets waiting in the local queues of the ONUs and an M/D/C for the frame transmission to the OLT. The number of servers C corresponds to the number of wavelengths used in the uplink. Through simulation, we verify our analysis and show the accuracy and the consistency of the results.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network simulation with fair bandwidth allocation policy and centralized path bandwidth control for elastic traffic",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.123.7950&rep=rep1&type=pdf",
            "Abstract": "We simulate the call-level operations of connection-oriented networks supporting both CBR and elastic services. For traffic engineering, we include a Call Admission Control (CAC), which incorporates Fair Bandwidth Allocation (FBA) with three implementation scenarios, according to the number of paths between the switching pairs. We also include centralized Path Bandwidth Control (PBC) that minimizes the maximum Call Blocking Probability (CBP) of the service-classes among all end-to-end links. The aim is to evaluate the co-existence of the two controls in terms of the resultant maximum CBP in the whole network. The results show significant reduction of the maximum CBP when CAC incorporates FBA than without such FBA. The presence of PBC further improves the maximum CBP.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New connection dependent threshold model–A generalization of the Erlang multirate loss model",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Moscholios/publication/317015259_NEW_CONNECTION_DEPENDENT_THRESHOLD_MODEL_-_A_GENERALIZATION_OF_THE_ERLANG_MULTIRATE_LOSS_MODEL/links/591f14930f7e9bd09ea3578b/NEW-CONNECTION-DEPENDENT-THRESHOLD-MODEL-A-GENERALIZATION-OF-THE-ERLANG-MULTIRATE-LOSS-MODEL.pdf",
            "Abstract": "Elastic services keep the call-level QoS assessment an open issue in contemporary telecom networks. In the Connection Dependent Threshold Model (CDTM), calls arriving at a communication link can reduce their bandwidth while increasing their service time requirement, according to a set of thresholds indicating the occupied link bandwidth. We’ve already proposed approximate and recursive calculation of the call blocking probabilities (CBP) based on: 1) the local balance between adjacent system-states, 2) the migration approximation (calls accepted in the system with other than the initial bandwidth are negligible within a space, called the migration space) and 3) the upward approximation (calls accepted in the system with their initial bandwidth are negligible within a space, called the upward space). Because of these three assumptions, significant relative CBP approximation errors occur. Therefore, we propose a new approximation method (new CDTM) whereby we improve the accuracy of the existing CDTM substantially. This is done, by considering that the population of calls in the migration and upward spaces is not negligible; thus, reducing the migration and upward approximation errors. Simulation results show that the CBP relative approximation errors of the new CDTM are significantly reduced, especially under realistic traffic-load conditions.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiservice Loss Models in Single or Multi-Cluster C-RAN Supporting Quasi-Random Traffic",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1271588",
            "Abstract": "In this paper, a cloud radio access network (C-RAN) is considered where the baseband units form a pool of computational resource units and are separated from the remote radio heads (RRHs). Based on their radio capacity, the RRHs may form one or many clusters: a single cluster when all RRHs have the same capacity and multi-clusters where RRHs of the same radio capacity are grouped in the same cluster. Each RRH services the so-called multiservice traffic, i.e., calls from many service classes with various radio and computational resource requirements. Calls arrive in the RRHs according to a quasi-random process. This means that new calls are generated by a finite number of mobile users. Arriving calls require simultaneously computational and radio resource units in order to be accepted in the system, i.e., in the serving RRH. If their requirements are met, then these calls are served in the (serving) RRH for a service time which is generally distributed. Otherwise, call blocking occurs. We start with the single-cluster C-RAN and model it as a multiservice loss system, prove that the model has a product form solution, and determine time congestion probabilities via a convolution algorithm whose accuracy is validated with the aid of simulation. Furthermore, the previous model is generalized to include the more complex case of more than one clusters.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Performance behaviour of IEEE 802.11 distributed coordination function",
            "Publication year": 2008,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-cds_20070047",
            "Abstract": "The authors present an extensive investigation of the performance of the IEEE 802.11 medium access control (MAC) protocol, with respect to throughput and delay. For the protocol analysis, a new model, which describes the protocol's behaviour to a great extent by incorporating and extending the existing models, is proposed. The authors also present a detailed analysis of the end-to-end delay through the study of the MAC delay and the queueing delay. The authors use the Z-transform of backoff duration to obtain the mean value, the variance and the probability distribution of the MAC delay. For the queueing analysis, first the authors consider an M/G/1 queue in order to provide a first look at the queueing delay. Second, the authors modify the input process of the queue so that the packet arrival process is described by an ON–OFF model, which expresses the bursty nature of traffic. In the investigations, data rates …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "On the Fixed Channel Reservation Policy in LEO Mobile Satellite Systems",
            "Publication year": 2017,
            "Publication url": "http://hosting.uop.gr/~nsagias/images/articles/C1_2017.pdf",
            "Abstract": "Satellite System (MSS) with “satellite-fixed” cells that accommodates new and handover Poisson arriving calls of different service-classes. By modelling the LEO-MSS as a multirate loss system, we provide an analytical framework for the recursive calculation of call blocking and handover failure probabilities under the Fixed Channel Reservation (FCR) policy. In the FCR policy, an integer number of channels is reserved in order to benefit calls of high channel requirements. The loss model under the FCR policy does not have a Product Form Solution (PFS) for the steady state probabilities. However, we show that the channel occupancy distribution can be calculated via an approximate but recursive formula. Simulation results verify the accuracy of the proposed formulas.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:ruyezt5ZtCIC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "A secure scheme for group communication of wireless IoT devices",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8471871/",
            "Abstract": "The emergence of the Internet of Things (IoT) is expected to significantly advance the technology development in many application domains such as agriculture, home automation, and healthcare. However, in the IoT era, this development faces serious research challenges in terms of handling large amounts of data, designing efficient system architectures, and implementing appropriate mechanisms for privacy and security assurance. Especially the network security aspect of the IoT is of major importance due to huge amounts of data that the IoT is expected to generate and handle, and considering the limited resources of typical IoT devices. One of the serious security threats are the physical attacks on the IoT devices that operate in remote locations. These are known in the literature as the node capture attacks. Motivated by the aforementioned issues, this paper first introduces the background of IoT security and …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Derivatives of blocking probabilities in multirate access tree networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6292664/",
            "Abstract": "We consider a multirate access tree network accommodating K service-classes of Poisson traffic, and focus on the determination of derivatives of Call Blocking Probabilities (CBP) with respect to offered traffic-load of any service-class. Based on the derivatives, we further show how we can successfully approximate CBP for small variations of offered traffic-load.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of Dynamic wavelength allocation scenarios in WDM-TDMA PONs servicing ON-OFF traffic of finite sources",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5969954/",
            "Abstract": "In this paper we present and analyze four dynamic wavelength allocation scenarios in a hybrid Wavelength Division Multiplexing (WDM) Time Division Multiple Access (TDMA) Passive Optical Network (PON). For each scenario we propose new teletraffic loss models for the calculation of call-level performance measures, such as connection failure probabilities (due to the unavailability of a wavelength) and call blocking probabilities (due to the restricted bandwidth of the wavelength) The PON accommodates independent service-classes of ON-OFF type and of finite traffic source population. The accuracy of the proposed models is validated through simulation and is found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest Editorial: Traffic Engineering and Optimisation in Next Generation Networks",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=3709523594237088104&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:fEOibwPWpKIC",
            "Publisher": "INST ENGINEERING TECHNOLOGY-IET"
        },
        {
            "Title": "Network flow programming Network flow programming, 1980",
            "Publication year": 2003,
            "Publication url": "https://ci.nii.ac.jp/naid/10010554475/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 <no title> JENSEN PA 被引用文献: 1件 著者 JENSEN \nPA 収録刊行物 Network flow programming Network flow programming, 1980 Wiley 被引用文献: \n1件中 1-1件を 表示 1 New Algorithms for Working and Spare Capacity Assignment in Integrated \nSelf-Healing Networks LOGOTHETIS Michael , NIKOLAOU Ioannis IEICE transactions on \ncommunications 86(4), 1346-1355, 2003-04-01 参考文献17件 Tweet 各種コード NII論文\nID(NAID) 10010554475 資料種別 図書全体 データ提供元 CJP引用 書き出し RefWorksに書き出し \nEndNoteに書き出し Mendeleyに書き出し Refer/BiblXで表示 RISで表示 BibTeXで表示 TSVで| …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finite Multirate Elastic Adaptive Loss Models",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742762/",
            "Abstract": "This chapter considers multirate loss models of quasi‐random arriving calls with fixed bandwidth requirements and elastic bandwidth allocation during service. In the elastic engset multirate loss model, the chapter considers a single link of capacity  C  b.u. that accommodates elastic calls of  K  service classes. Calls of each service class  k  come from a finite source population  N k . The chapter also considers the multiservice system of the elastic adaptive engset multirate loss model under the BR Policy. A new service‐class  k  call is accepted in the link if, after its acceptance, the occupied link bandwidth j ≤ T ‐ t k , where t k  refers to the BR parameter used to benefit calls of other service‐classes apart from  k . The chapter discusses the applicability of the models under SDN technology with the advanced 5G features of Cloud‐RAN and the self‐organizing network. It presents the reference architecture for the …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "Calculating distributed denial of service attack probability in bloom-filter based information-centric networks",
            "Publication year": 2016,
            "Publication url": "https://sciendo.com/pdf/10.1515/ipc-2016-0001",
            "Abstract": "Information-Centric Networking (ICN) is an emerging networking technology that has been designed to directly operate on named content/information objects, rather than relying on the knowledge of the content location. According to the ICN principles, a user requests the information object by its name or some other form of object identifier. After that, the ICN system is responsible for finding the particular object and sending it back to the user. Despite a large number of works on ICN in recent years, ICN systems still face security challenges. This is especially true when considering different types of alternative networks, such as the wireless community networks (WCNs). In this work, we explore the applicability of ICN principles in the challenging and unpredictable environments of WCNs. We consider stateless content dissemination using Bloom filters (BFs) and analyze two BF based approaches: the traditional single-stage BF and its generalization, the multi-stage BF. We focus on the security aspects of BF based approaches and in particular on distributed denial of service (DDoS) attacks. Finally, we investigate the attack probability for various system and network parameters, such as the number of hash functions, the BF maximum fill factor, and the number of hops toward the victim node.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance analysis of CDMA-based networks with interference cancellation, for batched Poisson traffic under the bandwidth reservation policy",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7231218/",
            "Abstract": "CDMA-based technologies deserve assiduous analysis and evaluation. We study the performance, at call-level, of a CDMA cell with interference cancellation capabilities, while assuming that the cell accommodates different service-classes of batched Poisson arriving calls. The partial batch blocking discipline is applied for Call Admission Control (CAC). To guarantee certain Quality of Service (QoS) for each service-class, the Bandwidth Reservation (BR) policy is incorporated in the CAC; i.e., a fraction of system resources is reserved for highspeed service-classes. We propose a new multirate loss model for the calculation of time and call congestion probabilities. The notion of local (soft) and hard blocking, users activity, interference cancellation, as well as the BR policy, are incorporated in the model. Although the steady state probabilities of the system do not have a product form solution, time and call congestion …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Call–burst blocking of ON–OFF traffic sources with retrials under the complete sharing policy",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016653160400077X",
            "Abstract": "In this paper we calculate both call and burst blocking probabilities of ON–OFF traffic sources with retrials. Calls of service-classes arrive to a single link according to a Poisson process and compete for the available link bandwidth under the complete sharing policy. Blocked calls may immediately retry one or more times to enter the system, with reduced bandwidth and increased mean service time requirements. Call blocking occurs when a call cannot enter the system with its last bandwidth requirement, due to lack of bandwidth. Accepted calls enter the system via state ON and may alternate between states ON and OFF, or remain always in state ON. When a call is transferred to state OFF it releases the bandwidth held in state ON, so that this bandwidth becomes available to new arriving calls. When a call tries to return to state ON, it re-requests its bandwidth. If it is available a new ON-period (burst) begins …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:bnK-pcrLprsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Call-level analysis of hybrid WDM-OCDMA PONs",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4598687/",
            "Abstract": "We study a hybrid WDM-OCDMA Passive Optical Network (PON) with dynamic wavelength allocation, and propose analytical models for calculating connection failure probabilities (due to unavailability of a wavelength) and call blocking probabilities (due to interference of neighboring calls). The PON accommodates multiple service-classes with infinite number of traffic sources. The springboard of our analysis is well-established teletraffic models, developed for WCDMA wireless systems. We describe the PONpsilas service-system by forming one-dimensional Markov chains, and solve them to derive the analytical models. We also provide the wavelengths occupancy in the PON. The proposed models are validated through simulation and their accuracy was found to be absolutely satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Thorough analysis of downlink capacity in a WCDMA cell",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03819-8_1",
            "Abstract": "In WCDMA networks, the Call Blocking Probability (CBP) assessment is necessary for proper cell capacity determination, in respect of traffic load in erlangs, and network dimensioning. This paper focuses on the downlink capacity estimation, through CBP calculation in a WCDMA cell. To this end, we study an analytical model for the WCDMA cell by taking into consideration the effects of the following: the multi-service environment, the soft blocking, the imperfect power control and multipath propagation. In this model, the maximum transmission power of a base station in the downlink is considered as the shared system resource. To analyze the system, we follow the methodology proposed by Mäder & Staehle, and describe the WCDMA cell by a Markov chain, where each system state represents a certain number of resources occupied by mobile users. We solve the Markov chain and provide an efficient …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An ON-OFF multi-rate loss model of finite sources",
            "Publication year": 2007,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e90-b_7_1608",
            "Abstract": "Bursty traffic is dominant in modern communication networks and keeps the call-level QoS assessment an open issue. ON-OFF traffic models are commonly used to describe bursty traffic. We propose an ON-OFF traffic model of a single link which accommodates service-classes of finite population (f-ON-OFF). Calls compete for the available link bandwidth under the complete sharing policy. Accepted calls enter the system via state ON and then may alternate between ON-OFF states. When a call is transferred to state OFF it releases the bandwidth held in state ON, while when a call tries to return to state ON, it re-requests its bandwidth. If it is available a new ON-period (burst) begins; otherwise the call remains in state OFF (burst blocking). We prove that the proposed f-ON-OFF model has a product form solution, and we provide an accurate recursive formula for the call blocking probabilities calculation. For the burst …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "An analytical framework of a C-RAN supporting bursty traffic",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9149219/",
            "Abstract": "In this paper we consider a cloud radio access network (C-RAN) architecture where the baseband signal processing servers, named baseband units (BBUs) are separated from the remote radio heads (RRHs). The RRHs form a single cluster while the BBUs form a centralized pool of data center resources. Each RRH of the C-RAN accommodates bursty traffic which is expected to play a dominant role in 5G networks. We approximate bursty traffic via the compound Poisson process according to which batches of calls, with a generally distributed batch size, occur at time points that follow a negative exponential distribution. Each call of a new batch is treated separately from the other calls of the same batch. A new call requires a computational resource unit from the centralized pool of BBUs and a radio resource unit from the serving RRH. If both units are available, then the call is accepted in the RRH for an …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:i2xiXl-TujoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Teletraffic models beyond Erlang",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6847860/",
            "Abstract": "In the era where call-level traffic is not anymore of single and constant bandwidth per call, but multidimensional traffic with very different bandwidth per call requirements, or each call may have several alternative contingency bandwidth requirements, while in-service calls may have adaptive features of bandwidth and holding time, or may experience bandwidth compression-expansion, the term Erlang in teletraffic models seems to be obsolete, since it refers to telephone networks or, precisely speaking, to single service systems. Needless to mention the bursty nature of traffic and the necessity of considering apart from Poisson traffic, quasi-random traffic or Batched Poisson call arrival processes, while, in any case, the call admission can be based on several bandwidth sharing policies; all these are far from Erlang. Nevertheless, the term Erlang is still kept, even for multirate teletraffic loss models, thanks to a model …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improvement of the Connection Dependent Threshold Model with the Aid of Reverse Transition Rates.",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=12639648854412266281&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Engset multi‐rate state‐dependent loss models with QoS guarantee",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.748",
            "Abstract": "We consider a single link loss system of quasi‐random input, described by the Engset multirate loss model (EnMLM). Blocked calls may once reattempt to be connected to the system requiring less bandwidth; then the system is described by the single retry model for finite sources (f‐SRM). The EnMLM and the f‐SRM are extended with the single threshold finite source model (f‐STM), where calls may attempt to be connected to the system with less bandwidth requirements, according to the link occupancy, before blocking occurs. We focus on CBP equalization in the EnMLM, f‐SRM and f‐STM, under the bandwidth reservation (BR) policy. For this analysis, we apply two approximate methods, the Roberts' method and the method of reverse transition rates (RTR), which lead to a recursive CBP calculation. We evaluate the accuracy of the above models under the BR policy by comparing the analytical with simulation …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:UxriW0iASnsC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Batched Poisson Multirate Elastic Adaptive Loss Models",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742751/",
            "Abstract": "This chapter considers multirate loss models of batched Poisson arriving calls with fixed bandwidth requirements and elastic bandwidth allocation during service. In the batched Poisson process, simultaneous call‐arrivals (batches) occur at time‐points following a negative exponential distribution. Elastic calls can reduce their bandwidth and simultaneously increase their service time. Adaptive calls can tolerate bandwidth compression without altering their service time. In the elastic Erlang multirate loss model with batched Poisson arrivals, the chapter considers a link of capacity  C  b.u. that accommodates elastic calls of  K  different service‐classes. In the elastic adaptive Erlang multirate loss model with batched Poisson arrivals under the BR policy a new service‐class  k  call is accepted in the link if, after its acceptance, the link bandwidth j ≤ T ‐ t k , where t k  is the BR parameter of service‐class  k .",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:vbGhcppDl1QC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "The priority wavelength release protocol for dynamic wavelength allocation in WDM-TDMA PONs supporting random and quasi-random bursty traffic",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6582876/",
            "Abstract": "Passive Optical Networks (PONs) are attractive fiber-based access systems providing broadband access solutions at a low cost. A hybrid Wavelength Division Multiplexing (WDM) - Time Division Multiple Access (TDMA) PON is a favorite PON configuration, in which the researchers have drawn much attention. We have analysed and proposed several protocols for dynamic wavelength allocation in a WDM-TDMA PON, by separately considering random or quasi-random input-traffic. By modelling the bursty in-service traffic as an ON-OFF model, we have proposed three protocols for random call arrivals. The same protocols have also been proposed for quasi-random call arrivals, resulting however in different evaluation conclusions (than in the case of random arriving calls). This fact gave rise to a fourth protocol, the Priority Wavelength Release (Pr-WR) Protocol, suitable for quasi-random input-traffic. According to this …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "eLIBRARY ID: 20706235 ISBN: 9781457714733",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=13464778109188592770&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Congestion probabilities in OFDM wireless networks with compound Poisson arrivals",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/iel7/4105970/9003652/09003710.pdf",
            "Abstract": "The authors study the downlink of an orthogonal frequency division multiplexing (OFDM) based cell that services calls from different service-classes with various resource requirements. They assume that calls arrive in the cell as batches according to a compound Poisson process. They consider that the batch size is generally distributed while each call of a batch is treated separately from the other calls of the same batch, according to the complete sharing policy. To determine the most important performance metrics, ie congestion probabilities and resource utilisation in this OFDM-based cell, they model it as a multirate loss model, show that the steady-state probabilities can be determined via a product form solution (PFS) and propose recursive formulas which reduce the complexity of the calculations. In addition, they study the bandwidth reservation (BR) policy which can be used for the reservation of subcarriers in …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:tuHXwOkdijsC",
            "Publisher": "The Institution of Engineering and Technology"
        },
        {
            "Title": "Blocking probabilities of elastic and adaptive calls in the Erlang multirate loss model under the threshold policy",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11235-015-0056-z.pdf",
            "Abstract": "In this paper, we propose a new multirate teletraffic loss model of a single link with certain bandwidth capacity that accommodates Poisson arriving calls, which can tolerate bandwidth compression, under the threshold policy of admission control. When compression occurs, the service time may increase (elastic calls) or not (adaptive calls). The threshold policy can provide different QoS among service-classes by limiting the number of calls of a service-class up to a predefined threshold, which can be different for each service-class. The proposed model does not have a product form solution for the determination of the steady state probabilities. However, we approximate the model by a reversible Markov chain, and provide recursive formulas for the efficient calculation of the call-level performance metrics, such as call blocking probabilities and link utilization. In addition, we provide similar formulas when the …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A Call Admission Control procedure incorporating a Fair Bandwidth Allocation policy for telecom networks",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=5307952042883597001&hl=en&oi=scholarr",
            "Abstract": "We examine the applicability of a fair bandwidth allocation policy on a Virtual Circuit (VC) routing network. Having examined several bandwidth allocation policies among calls of different serviceclasses, in a single link, we choose the max-min fairness policy (MMF) with minimum and maximum bandwidth requirements (GMMF–generalizedMMF) in order to apply it on a whole network. To achieve it, we propose a Call Admission Control (CAC) procedure consisting of several scenarios, dependent on the number of paths between the origindestination network nodes. To evaluate the proposed CAC scheme we compare the maximum Call Blocking Probability (CBP) of the whole network when we apply the GMMF policy, with the maximum CBP when we do not apply any fair bandwidth allocation policy. The results, obtained through simulation, show significant reduction of the maximum CBP in the case of GMMF policy.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality of service differentiation in heterogeneous CDMA networks: a mathematical modelling approach",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-016-1411-z",
            "Abstract": "Next-generation cellular networks are expected to enable the coexistence of macro and small cells, and to support differentiated quality-of-service (QoS) of mobile applications. Under such conditions in the cell, due to a wide range of supported services and high dependencies on efficient vertical and horizontal handovers, appropriate management of handover traffic is very crucial. Furthermore, new emerging technologies, such as cloud radio access networks (C-RAN) and self-organizing networks (SON), provide good implementation and deployment opportunities for novel functions and services. We design a multi-threshold teletraffic model for heterogeneous code division multiple access (CDMA) networks that enable QoS differentiation of handover traffic when elastic and adaptive services are present. Facilitated by this model, it is possible to calculate important performance metrics for handover and …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The wireless Engset multi-rate loss model for the handoff traffic analysis in W-CDMA networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4699540/",
            "Abstract": "The call-level performance modelling and evaluation of 3G cellular networks is important for the proper network dimensioning and efficient use of the network resources, such as bandwidth and power. In the case of the wideband code division multiple access (W-CDMA) cellular networks, this task is complicated, not only because of the so called soft blocking, the multiple access interference (MAI) and the heterogeneous traffic, but also due to the handoff process. In this paper, we propose a new teletraffic model for the call-level analysis of handoff traffic in the uplink of W-CDMA networks where multiple services with finite number of traffic sources are accommodated. Parameters related to the soft blocking and MAI are included into the model. The proposed model is described by a discrete time Markov chain. An efficient recurrent formula for the calculation of the system state probabilities is derived. Based on this …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New algorithms for performance measures derivatives in the erlang multirate loss model including the bandwidth reservation policy,”",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.222.6799&rep=rep1&type=pdf",
            "Abstract": "We consider a single-link loss system with fixed bandwidth capacity accommodating K service-classes of Poisson traffic with different bandwidth-per-call requirements. Calls of all service-classes compete for the available link bandwidth, under two different policies: a) the complete sharing (CS) policy and b) the bandwidth/trunk reservation (BR) policy. In the CS policy, a call is blocked and lost if and only if the available link bandwidth is less than the call’s bandwidth requirement. Such a single-link loss system has been analytically described by the Erlang Multirate Loss Model (EMLM). On the other hand, the BR policy is used in order to achieve call blocking probability (CBP) equalization among service classes, or, alternatively, guarantee a certain quality of service for each service-class. Such a single-link loss system has been analytically described by the EMLM under the BR policy (EMLM/BR). In this paper, we focus on the problem of determining, in an efficient analytical way, derivatives of blocking probabilities, throughput rates and average number of calls in the system, with respect to offered traffic-load, arrival rate and service rate of any service-class under both the EMLM and EMLM/BR models. We further show through analytical formulas how derivatives can be used to successfully approximate the above mentioned performance measures when small variations of offered traffic-load are considered.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Multirate Loss Model of Quasi-Random Input for the X2 Link of LTE Networks",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Moscholios/publication/329884869_A_Multirate_Loss_Model_of_Quasi-Random_Input_for_the_X2_Link_of_LTE_Networks/links/5c20734c92851c22a341d8aa/A-Multirate-Loss-Model-of-Quasi-Random-Input-for-the-X2-Link-of-LTE-Networks.pdf",
            "Abstract": "In this paper, first we review a multirate loss model, whereby we can assess the call-level Quality of Service (QoS) of the Long Term Evolution (LTE) X2 link supporting calls of different service-classes with fixed bandwidth requirements. The X2 interface connects directly two neighboring evolved NodeBs and is mainly responsible for the transfer of user-plane and control-plane data during a handover. In the model, the X2 interface is modelled as a link of fixed capacity. Handover calls are accepted in the X2 link whenever available bandwidth exists. Secondly, we propose a multirate loss model where calls arrive in the X2 link according to a quasi-random process and compete for the available bandwidth under the Complete Sharing (CS) policy. The CS policy allows calls to enter the system when available bandwidth exists. We propose recursive formulas for the calculation of time and call congestion probabilities as well as link utilization for the CS policy.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teletraffic Engineering in Communication Systems",
            "Publication year": 2014,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=28745495",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New algorithms for working and spare capacity assignment in integrated self-healing networks",
            "Publication year": 2003,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e86-b_4_1346",
            "Abstract": "Modern network technologies gave rise to intelligent network reconfiguration schemes for restoration purposes and several network self-healing schemes, exploiting the capabilities of network elements (NE), have already been proposed. Each self-healing scheme has its own characteristics, regarding restoration time, flexibility, restoration cost and exploitation of NEs. Integrated self-healing networks, which combine more than one survivability techniques, mainly the Shared Self-Healing Rings (SSR) with the Dynamic Self-Healing Networks (DSN), can achieve higher network survivability and cost-effective network design. In this paper, we propose two algorithms for the design of spare and working channel capacities for integrated self-healing networks. In the first algorithm, A1, we do not take into account the capacity of network nodes, while in the second algorithm, A2, we take into account the limited capacity of …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Evaluation of multi-rate loss models for elastic traffic",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/43249456/P24.pdf",
            "Abstract": "In this paper we review two extensions of the Erlang Multirate Loss Model (EMLM), whereby we can assess the call-level QoS of telecom networks supporting elastic service-classes. The first extension is the Connection Dependent Threshold Model (CDTM) where calls arriving at a communication link can reduce their bandwidth while increase their service time requirement, according to a set of thresholds indicating the link occupied bandwidth; the in-service calls do not alter the assigned bandwidth. The second extension is the Extended Erlang Multirate Loss Model (E-EMLM), where an arriving call at a communication link requires certain bandwidth and, if not available, the call can reduce its bandwidth requirement while increase its service time requirement; this is done in accordance with the bandwidth reduction of the in-service calls. For the evaluation of the two models, we compare the call-level QoS index of Call Blocking Probability (CBP), when the average allocated bandwidth of a link is the same for the two models. Our results show that if both stream and elastic traffic are present, the CDTM performs better than the E-EMLM for the elastic traffic. If only elastic services are accommodated in the link, the models perform equally well.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Communication systems, networks and digital signal processing",
            "Publication year": 2008,
            "Publication url": "https://search.proquest.com/openview/9146d94f4ddb7afb79e4142e4a8c1109/1?pq-origsite=gscholar&cbl=1936358",
            "Abstract": "This article brings together a few selected best papers presented at the 5th International Symposium on Communication Systems, Networks and DSP which was in July 2006 in Patras, Greece. It is has been somewhat difficult task for the authors to place these papers covering a range of topics in some sort of coherent order, but they have done their best to ensure that there some order as follow: communication networks and protocols, wireless system and optical transmission. They sincerely hope that this selection of papers has given some idea of the variety of topics presented at CSNDSP06. They would like to thank the authors for extensively revising the original papers presented at the conference, the referees for their extensive comments and advise on the technical content of the papers.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:Se3iqnhoufwC",
            "Publisher": "The Institution of Engineering & Technology"
        },
        {
            "Title": "Multirate Elastic Adaptive Loss Models",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742760/",
            "Abstract": "This chapter considers multirate loss models of random arriving calls with fixed bandwidth requirements and elastic bandwidth allocation during service. It considers two types of calls, elastic and adaptive. Elastic calls that can reduce their bandwidth, while simultaneously increasing their service time, compose the so‐called elastic traffic (e.g., file transfer). Adaptive calls that can tolerate bandwidth compression, but their service time cannot be altered, compose the so‐called adaptive traffic (e.g., adaptive video). In the elastic Erlang multirate loss model (E‐EMLM), the chapter considers a link of capacity  C  b.u. that accommodates elastic calls of  K  different service classes. It also considers the multiservice system of the E‐EMLM under the BR policy and TH policy. The bandwidth compression/expansion mechanism and the CAC of the EA‐EMLM are the same as those of the E‐EMLM.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:URolC5Kub84C",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "Performance modelling of W-CDMA networks supporting elastic and adaptive traffic",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.107.9146&rep=rep1&type=pdf",
            "Abstract": "We propose a new model, named Wideband Threshold Model (WTM) for the analysis of WCDMA networks supporting elastic and adaptive traffic. Mobile users generate Poisson arriving calls that compete for the acceptance to a W-CDMA cell under the complete sharing policy. A newly arriving call can be accepted with one of several possible Quality-of-Service (QoS) requirements depending on the resource availability in the cell. We propose an approximate method, which is an extension of the Kaufman-Roberts algorithm, for the calculation of call blocking probabilities in the uplink direction. The accuracy of the proposed approximation is verified by simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of priority-based CDMA systems in the presence of multirate Poisson traffic",
            "Publication year": 2015,
            "Publication url": "https://www.ieice.org/publications/proceedings/summary.php?iconf=ICTF&session_num=SESSION4&number=SESSION4-5&year=2015",
            "Abstract": "Next-generation cellular networks are expected to support a wide range of communication technologies and user devices. Under such conditions, proper modelling of user traffic and system performance evaluation is of major importance. In this paper, we employ mathematical modelling techniques to analyse the performance of a single CDMA cell under the presence of user-generated multirate Poisson traffic. We also explicitly consider different traffic priority classes in the system. The considered model, enables us to determine the resource occupancy of the cellular system at different system states and to accurately calculate call blocking probabilities for different services. In particular, we describe the CDMA system as a continuous-time Markov chain and derive formulas for system state probabilities.We also perform a thorough simulation experiments to validate the accuracy of the derived equations.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:P5F9QuxV20EC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Efficient Call-level Assessment of Multirate Loss Systems Including Cooperative Users",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Moscholios/publication/317400263_Efficient_Call-level_Assessment_of_Multirate_Loss_Systems_Including_Cooperative_Users/links/5938f6cfaca272bcd1a0353e/Efficient-Call-level-Assessment-of-Multirate-Loss-Systems-Including-Cooperative-Users.pdf",
            "Abstract": "We consider a multirate loss system that accommodates Poisson arriving calls of many service-classes with cooperative and non-cooperative users.“Cooperative” users can retry to be connected in the system with a reduced bandwidth, when they are blocked with their initial peakbandwidth requirement. This behavior increases the quality of service perceived by other users. Due to the existence of retrials, the system model does not have a product form solution for the steady state distribution. However, we propose an efficient calculation of system’s occupancy distribution and Call Blocking Probabilities (CBP), while avoiding complex state space enumeration and processing. The proposed recursive formula is consistent and quite accurate, as it is shown through simulation. As a reference (for comparison), we use the conventional trunk reservation control for CBP equalization.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:yD5IFk8b50cC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "End-to-end delay analysis of the IEEE 802.11 e with MMPP input-traffic",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5207380/",
            "Abstract": "We investigate the performance of the IEEE 802.11e in respect of end-to-end delay, which is estimated by the sum of queuing delay and MAC delay. The MAC delay analysis is performed based on elementary probability theory (conditional probabilities) while avoiding the complex Markov Chain method. A comprehensive study of the MAC delay is presented by providing higher moments of the MAC delay distribution. To this end, we use the Z-transform of the backoff duration. The first moment corresponds to the mean MAC delay, while the second moment corresponds to the standard deviation of the MAC delay; the latter depicts the jitter. We also estimate the probability mass function (pmf) of the MAC delay through the lattice Poisson algorithm. As far as the queuing delay is concerned, we provide the mean queuing delay by considering a queuing system with one queue per Access Category (AC) per mobile …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Multirate System of Quasi-Random Arrivals and a Threshold Call Admission Policy",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9249590/",
            "Abstract": "We consider a link that services multirate quasirandom traffic. Calls are distinguished to handover and new calls. New calls compete for the available bandwidth under a threshold call admission policy. In that policy, new calls of a service-class are blocked if the in-service handover and new calls of the same service-class including the new call, exceeds a predefined threshold. Handover calls compete for the available bandwidth under the complete sharing policy. The steady state probabilities in the proposed model have a product form solution which leads to a convolution algorithm for the accurate calculation of congestion probabilities and link utilization.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:xtoqd-5pKcoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Call-burst blocking probabilities of ON-OFF traffic sources under the bandwidth reservation policy",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_127",
            "Abstract": "We calculate call and burst blocking probabilities (CBP and BBP respectively) in a single link loss system accommodating service-classes of ON-OFF traffic calls, either of high or low bandwidth requirements. To benefit high speed calls the bandwidth reservation (BR) policy is considered (ON-OFF/BR model). Poisson arriving calls enter the system via state ON and may alternate between states ON and OFF. When a call passes to state OFF it releases the bandwidth held in state ON which becomes available for new arrivals. When the call tries to return to state ON it re-requests its bandwidth. If it is available a new burst begins; otherwise, the burst is blocked and the call remains in state OFF. The CBP/BBP calculation is based on approximate formulas.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Handoff modeling in cellular CDMA with finite sources and state-dependent bandwidth requirements",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7033199/",
            "Abstract": "It is envisioned that small cells are going to play an important role in future cellular networks. Due to limited coverage areas of small cells and increased user mobility, a proper analysis and evaluation of handoff traffic is of major importance. In this paper, we propose a novel teletraffic model for the analysis of handoff traffic in cellular CDMA networks. When the cell load is above a predefined threshold, we allow the handoff calls to reduce their bandwidth requirements in order to avoid blocking. Our model also realistically assumes a finite number of traffic sources in the cell and enables analytical determination of uplink blocking probabilities for new and handoff calls. To this end, the CDMA system has been described as a continuous-time Markov chain in order to derive an efficient recursive formula for the calculation of system state probabilities. The proposed analytical model has been validated through simulation …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The wireless Engset multi-rate loss model for the call-level analysis of W-CDMA networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394384/",
            "Abstract": "We propose a new teletraffic model, named Wireless Engset Multi-rate Loss Model (W-EnMLM) for the call-level analysis of W-CDMA networks, supporting heterogeneous service-classes of finite population of traffic sources. Quasi- random arriving calls (generated by mobile users), compete for their admission to a W-CDMA cell under the Complete bandwidth Sharing (CS) policy. We present an approximate but recurrent formula for the efficient calculation of the system state probabilities and the call blocking probabilities in the uplink direction. The accuracy of the proposed model is verified by simulation results and found to be completely satisfactory. Moreover, the proposed model performs much better than the corresponding model of infinite number of traffic sources.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "International Journal on Advances in Telecommunications Volume 6, Number 3 & 4, 2013",
            "Publication year": 2013,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.641.5384&rep=rep1&type=pdf",
            "Abstract": "International Journal on Advances in Telecommunications Volume 6, Number 3 & 4, 2013 Page \n2 The International Journal on Advances in Telecommunications is published by IARIA. ISSN: \n1942-2601 journals site: http://www. iariajournals. org contact: petre@ iaria. org Responsibility \nfor the contents rests upon the authors and not upon IARIA, nor on IARIA volunteers, staff, or \ncontractors. IARIA is the owner of the publication and of editorial aspects. IARIA reserves the \nright to update the content for quality improvements. Abstracting is permitted with credit to the \nsource. Libraries are permitted to photocopy or print, providing the reference is mentioned \nand that the resulting material is made available at no cost. Reference should mention: \nInternational Journal on Advances in Telecommunications, issn 1942-2601 vol. 6, no. 3 & 4, \nyear 2013, http://www. iariajournals. org/telecommunications/ The copyright for each paper . …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ransomware detection and mitigation using software-defined networking: The case of WannaCry",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790618323164",
            "Abstract": "Modern day ransomware families implement sophisticated encryption and propagation schemes, thus limiting chances to recover the data almost to zero. We investigate the use of software-defined networking (SDN) to detect and mitigate advanced ransomware threat. We present our ransomware analysis results and our developed SDN-based security framework. For the proof of concept, the infamous WannaCry ransomware was used. Based on the obtained results, we design an SDN detection and mitigation framework and develop a solution based on OpenFlow. The developed solution detects suspicious activities through network traffic monitoring and blocks infected hosts by adding flow table entries into OpenFlow switches in a real-time manner. Finally, our experiments with multiple samples of WannaCry show that the developed mechanism in all cases is able to promptly detect the infected machines and …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:yB1At4FlUx8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A probabilistic threshold-based bandwidth sharing policy for wireless multirate loss networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7442785/",
            "Abstract": "We propose a probabilistic bandwidth sharing policy, based on the threshold (TH) policy, for a single cell of fixed capacity in a homogeneous wireless cellular network. The cell accommodates random input-traffic originated from K service-classes. We distinguish call requests to new and handover, and therefore, the cell supports 2K types of arrivals. If the number of in-service calls (new or handover) of a service-class exceeds a threshold (different for new and handover calls of a service-class), a new or handover arriving call of the same service-class is not always blocked, as it happens in the TH policy, but it is accepted in the system with a predefined state-dependent probability. The cell is analyzed as a multirate loss system, via a reversible continuous-time Markov chain, which leads to a product form solution (PFS) for the steady state distribution. Thanks to the PFS, the calculation of performance measures is …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An analytical framework of a C-RAN supporting random, quasi-random and bursty traffic",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128620306484",
            "Abstract": "We consider a cloud radio access network (C-RAN) where the baseband signal processing servers, named baseband units (BBUs) are separated from the remote radio heads (RRHs). The RRHs form a single cluster while the BBUs form a pool of resources. Each RRH may accommodate random (Poisson) or quasi-random or bursty traffic. The latter is approximated via the compound Poisson process according to which batches of calls, with a generally distributed batch size, follow a Poisson process. A call requires a computational resource and a radio resource unit from the BBUs and the serving RRH, respectively. If any of the two units is unavailable, call blocking occurs. Otherwise, the new call is accepted in the RRH. We model this C-RAN as a loss system and study two different cases: i) all RRHs accommodate bursty traffic and ii) some RRHs accommodate random traffic, some quasi-random traffic and the rest …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:-FonjvnnhkoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Finite ON–OFF Multirate Loss Models",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742761/",
            "Abstract": "This chapter considers ON‐OFF multirate loss models of quasi‐random arriving calls with fixed bandwidth requirements. In‐service calls do not constantly keep their assigned bandwidth but alternate between transmission periods (ON) and idle periods (OFF). ON‐OFF loss models can be used for the analysis of the call‐level behavior of bursty traffic. The finite ON‐OFF multirate loss models are based on the EnMLM; their recurrent form facilitates their computer implementation. In the finite ON‐OFF multirate loss model, one considers a link of capacity C b.u. that accommodates  K  service‐classes of ON‐OFF‐type calls. Calls of a service‐class  k  (k = 1, ..., K) come from a finite source population  N k . Before proceeding with the determination of the various performance measures, the chapter shows the relationship between the finite‐ON‐OFF model and the EnMLM.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:p__nRnzSRKYC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "International Journal on Advances in Telecommunications Volume 5, Number 1 & 2, 2012",
            "Publication year": 2012,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.638.7957&rep=rep1&type=pdf",
            "Abstract": "International Journal on Advances in Telecommunications Volume 5, Number 1 & 2, 2012 Page \n2 The International Journal on Advances in Telecommunications is published by IARIA. ISSN: \n1942-2601 journals site: http://www. iariajournals. org contact: petre@ iaria. org Responsibility \nfor the contents rests upon the authors and not upon IARIA, nor on IARIA volunteers, staff, or \ncontractors. IARIA is the owner of the publication and of editorial aspects. IARIA reserves the \nright to update the content for quality improvements. Abstracting is permitted with credit to the \nsource. Libraries are permitted to photocopy or print, providing the reference is mentioned \nand that the resulting material is made available at no cost. Reference should mention: \nInternational Journal on Advances in Telecommunications, issn 1942-2601 vol. 5, no. 1 & 2, \nyear 2012, http://www. iariajournals. org/telecommunications/ The copyright for each paper . …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An analytical framework in LEO mobile satellite systems servicing batched Poisson traffic",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/document/8248734/",
            "Abstract": "The authors consider a low earth orbit (LEO) mobile satellite system (MSS) that accepts new and handover calls of multirate service-classes. New calls arrive in the system as batches, following the batched Poisson process. A batch has a generally distributed number of calls. Each call is treated separately from the others and its acceptance is decided according to the availability of the requested number of channels. Handover calls follow also a batched Poisson process. All calls compete for the available channels under the complete sharing policy. By considering the LEO-MSS as a multirate loss system with `satellite-fixed' cells, it can be analysed via a multi-dimensional Markov chain, which yields to a product form solution (PFS) for the steady-state distribution. Based on the PFS, they propose a recursive and yet efficient formula for the determination of the channel occupancy distribution, and consequently, for the …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:D03iK_w7-QYC",
            "Publisher": "IET"
        },
        {
            "Title": "ON-OFF traffic models for a hybrid TDM-WDM PON with dynamic wavelength allocation",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5580307/",
            "Abstract": "Future access networks will have to meet the ever increasing demand for capacity. Optical access systems are now considered as a viable alternative solution to the xDSL technologies for delivering future integrated broadband services. Nowadays, passive optical networks are the most promising and cost-effective class of fiber access systems. In this paper we develop teletraffic loss models for calculating connection failure probabilities (due to unavailability of a wavelength) and call blocking probabilities (due to the restricted bandwidth capacity of a wavelength) in hybrid TDM-WDM passive optical networks with dynamic wavelength allocation. The optical access network accommodates bursty services of ON-OFF (transmission or no transmission) type. The proposed models are derived from one-dimensional Markov chains which describe the wavelengths occupancy in the optical access network. The accuracy of …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:1qzjygNMrQYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A study on dynamic load balance for IEEE 802.11 b wireless LAN",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.463.7642&rep=rep1&type=pdf",
            "Abstract": "We study the problem of load balancing in 802.11-based wireless networks, operating in infrastructure mode. In a large wireless network with multiple collocated Access Points (AP), a load balancing policy is necessary for the distribution of the wireless stations (WS) to the AP’s, so as the network performance to be maximized. Already proposed algorithms, which are based only on the received signal strength indicator (RSSI), may cause all the WS to be associated to a single or to a very few number of AP, and result in an overall network performance degradation. In this paper, we propose a load balancing procedure, which acts in two separate levels. First, the AP’s are either distributed across the channels (if the number of AP is small) or located in the same channel that is specified by taking into account the channel-location and the received RSSI of the neighbor AP. Second, the WS are distributed across all the available AP based not only on RSSI measurements but also on the number of WS already associated to the AP and other link quality measurements. Besides, in this paper we describe the signaling extension needed for the implementation of the proposed load balancing procedure.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An ON-OFF Multi-Rate Loss Model with a mixture of service-classes of finite and infinite number of sources",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1494375/",
            "Abstract": "We consider an ON-OFF traffic model of a single link which accommodates service-classes of finite population. Calls arrive according to a quasi-random process and, if accepted, enter the system via state ON; then calls may alternate between ON-OFF states. When a call is transferred to state OFF, it releases the bandwidth held in state ON, while when it tries to return to state ON it re-requests its bandwidth. If it is available a new ON-period (burst) begins; otherwise burst blocking occurs and the call remains in state OFF. We prove that the proposed finite source ON-OFF model (f-ON-OFF) has a product form solution and provide an accurate recursive formula for the call blocking probabilities calculation. For the burst blocking probabilities calculation we propose an approximate formula. Finally, we generalize the f-ON-OFF model to include a mixture of service-classes of finite and infinite number of sources. Simulation …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blocking performance of multi-rate OCDMA passive optical networks",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/John-Vardakas/publication/261237445_Blocking_performance_of_Multi-rate_OCDMA_PONs/links/0deec533a96f727895000000/Blocking-performance-of-Multi-rate-OCDMA-PONs.pdf",
            "Abstract": "Optical Code Division Multiple Access (OCDMA) is one promising candidate for the provision of moderate security communications with large dedicated bandwidth to each end user. We present a new teletraffic model for the call-level performance of an OCDMA Passive Optical Network (PON) configuration that accommodates multiple serviceclasses. Parameters related to the local blocking, Multiple Access Interference (MAI) and user activity are incorporated to our analysis, which is based on a two-dimensional Markov chain. In this paper we focus on the derivation of recursive formulas for the efficient calculation of blocking probabilities. To evaluate the proposed model, the analytical results are compared with simulation results to reveal that the model’s accuracy is quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Call-level analysis of W-CDMA networks supporting elastic services of finite population",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4533096/",
            "Abstract": "We present a new model, named Wireless Finite Connection-Dependent Threshold Model, for the call-level analysis of W-CDMA networks that support both elastic and stream traffic. Calls generated by service-classes of finite source population (quasi-random call arrival process) compete for their acceptance to a W-CDMA cell, under the complete sharing policy. An arriving call can be accepted with one of several contingency Quality-of-Service (QoS) requirements, depending on the resource availability in the cell; the latter is indicated by thresholds. We present an approximate but recurrent formula for the efficient calculation of the system state probabilities; consequently, the call blocking (time congestion) probabilities and other performance metrics in the uplink direction are provided. The model's accuracy is verified by simulation and found to be quite satisfactory. Moreover, the proposed model performs much …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A state-dependent multi-rate loss model of finite sources with QoS guarantee for wireless networks",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=9090832438167188431&hl=en&oi=scholarr",
            "Abstract": "We focus on the computation of Call Blocking Probabilities (CBP) in a single link loss model, where calls come from service-classes of finite sources, as it happens in the environment of wireless/cellular networks. We review the Engset Multirate Loss Model and the Single Retry Loss Model for finite sources, in which blocked calls may immediately retry once to be connected in the system with reduced bandwidth and increased service time requirements. We extend these models to the Single-and Multi-Threshold Model for finite sources (f-MTM), which are state dependent models where calls, prior to being blocked, may adjust their traffic requirements according to a common set of thresholds (or a single threshold), which indicates the occupied bandwidth. The f-MTM does not have a product form solution; therefore we prove approximate but recursive formulas for the CBP calculation. Furthermore we apply in the f …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "CHANNEL CAPACITY DESIGN IN INTEGRATED SELF-HEALING NETWORKS",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=10975705356036561727&hl=en&oi=scholarr",
            "Abstract": "Integrated self-healing networks combine more than one survivabilitytechniques and can achieve higher network reliability and cost-effective design. `Wepresent three pure heuristics algorithms for the design of spare and working channelcapacities of integrated self-healing networks. All algorithms are based on theshortest path principle. Algorithm l and 2, contrarily to algorithm 3 do not takeinto account possible restrictions in node capacities. In comparison to othershortest-path based algorithms they are more homogeneous, perform better and achieveconsiderable savings in total channel capacity of the backbone network. Algorithm 2performs best under specific communication demand requirements, while algorithm 1 isnot sensitive to the communication demands.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Call Blocking Probabilities of Multirate Elastic Traffic under the Threshold and Bandwidth Reservation Policies",
            "Publication year": 2015,
            "Publication url": "https://www.ieice.org/publications/proceedings/summary.php?expandable=6&iconf=ICTF&session_num=SESSION4&number=SESSION4-6&year=2015",
            "Abstract": "We propose a multirate teletraffic loss model of a link that accommodates different service-classes of elastic calls. Calls arrive in the link according to a Poisson process, can tolerate bandwidth compression and have an exponentially distributed service time. When bandwidth compression occurs, the service time of new and in-service calls increases. All calls compete for the available link bandwidth under the combination of the Threshold (TH) and the Bandwidth Reservation (BR) policies. The TH policy can provide different QoS among service-classes by limiting the number of calls of a service-class up to a predefined threshold, which can be different for each service-class. The BR policy reserves part of the available link bandwidth to benefit calls of high bandwidth requirements. The analysis of the proposed model is based on approximate but recursive formulas, whereby we determine call blocking probabilities …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:hMod-77fHWUC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "The Engset Multirate Loss Model",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742764/",
            "Abstract": "This chapter begins with the simple case of a loss system that accommodates calls of a single service‐class, and presents the study of multirate teletraffic loss models. In the Engset multirate loss model (EnMLM), a single link of capacity  C  b.u. accommodates calls of  K  service‐classes under the CS policy. The chapter considers the multiservice system of the EnMLM under the TH policy (EnMLM/TH). The call admission is exactly the same as that of the EMLM/TH. Since the TH policy is a coordinate convex policy the steady state probabilities in the EnMLM/TH have a PFS whose form is exactly the same as that of the EnMLM. The chapter presents a recent application of the EnMLM for the calculation of TC and CC probabilities in the X2 link of LTE networks. The main components of an LTE network are the evolved packet core and the evolved terrestrial radio access network.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:uWiczbcajpAC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "Teletraffic Loss/Queueing Models in LEO Mobile Satellite Systems: a Short Survey",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9249490/",
            "Abstract": "In this paper we present teletraffic loss/queueing models that can be applied in low earth orbit mobile satellite systems (LEO-MSS) with \"satellite-fixed\" cells for the determination of call blocking probabilities of new and handover calls. We study two different model categories: a) those that focus on single-rate traffic where calls belong to a single service-class and require one channel for service and b) those that focus on multirate traffic where the LEO-MSS accommodates many service-classes whose calls may require more than one channels for service.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:PoWvk5oyLR8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance analysis of OCDMA PONs supporting multi-rate bursty traffic",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6549242/",
            "Abstract": "Optical Code Division Multiple Access (OCDMA) provides increased security communications with large dedicated bandwidth to end users and simplified network control. We analyse the call-level performance of an OCDMA Passive Optical Network (PON) configuration, which accommodates multiple service-classes with finite traffic source population. The considered user activity is in accordance with the bursty nature of traffic, so that calls may alternate between active (steady transmission of a burst) and passive states (no transmission at all). Parameters related to multiple access interference, additive noise, user activity and number of traffic sources are incorporated to our analysis, which is based on a two-dimensional Markov chain. An approximate recursive formula is derived for efficient calculation of call blocking probability. Furthermore, we determine the burst blocking probability; burst blocking occurs when a …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "State-dependent bandwidth sharing policies for wireless multirate loss networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7942058/",
            "Abstract": "We consider a reference cell of fixed capacity in a wireless cellular network while concentrating on next-generation network architectures. The cell accommodates new and handover calls from different service-classes. Arriving calls follow a random or quasi-random process and compete for service in the cell under two bandwidth sharing policies: 1) a probabilistic threshold (PrTH) policy or 2) the multiple fractional channel reservation (MFCR) policy. In the PrTH policy, if the number of in-service calls (new or handover) of a service-class exceeds a threshold (difference between new and handover calls), then an arriving call of the same service-class is accepted in the cell with a predefined state-dependent probability. In the MFCR policy, a real number of channels is reserved to benefit calls of certain service-classes; thus, a service priority is introduced. The cell is modeled as a multirate loss system. Under the PrTH …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic savings through a cac procedure incorporating a fair bandwidth allocation policy for elastic services",
            "Publication year": 2004,
            "Publication url": "http://komunikacie.uniza.sk/index.php/communications/article/view/1314",
            "Abstract": "We apply the max-min fairness policy (MMF) for elastic services with min and max bandwidth requirements (approximated MMF) not to a single link but to a whole connection-oriented network. To achieve it we propose a Call Admission Control (CAC) procedure consisting of several scenarios dependent on the number of paths between the origin-destination (OD) network nodes. We evaluate the global network performance at the call level by comparing the maximum Call Blocking Probability (CBP) of the proposed scheme with that of a no fair bandwidth allocation policy scheme. Simulation results show significant traffic savings in the case of the approximated MMF policy.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:e_rmSamDkqQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proceedings of the Fourth IARIA Advanced International Conference on Telecommunications, AICT 2008, Athens, Greece, 8-13 June 2008",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=15882743612813277688&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:0N-VGjzr574C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Call-level Performance Modeling and QoS Assessment of W-CDMA Networks",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=6870983405277720539&hl=en&oi=scholarr",
            "Abstract": "The access control of different service-classes to network resources and especially the bandwidth allocation among service-classes has been widely recognized as a necessary solution for Quality of Service (QoS) guarantee both in existing and future next generation networks. The Calllevel performance modelling and QoS assessment can give the answer on what vastly increased traffic will mean for network design and management. It is crucial for the avoidance of too costly overdimensioning of the network (of wasting cell resources, ie bandwidth and power) and the prevention, through traffic engineering mechanisms, of excessive throughput degradation. Despite of its importance, the call-level performance modelling and QoS assessment remains an open issue in WCDMA networks, because it requires purpose built teletraffic models which will take into account: a) the so-called soft capacity of the cell, b) the …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:blknAaTinKkC",
            "Publisher": "Nova Science Publishers"
        },
        {
            "Title": "Network Resource Optimisation with Emphasis on Optical Networks",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=5627133323974915489&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:7T2F9Uy0os0C",
            "Publisher": "INST ENGINEERING TECHNOLOGY-IET"
        },
        {
            "Title": "Performance evaluation of a C-RAN supporting quasi-random traffic",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8903712/",
            "Abstract": "In this paper we consider a cloud radio access network (C-RAN) where the remote radio heads (RRHs) are separated from the baseband signal processing servers, named baseband units (BBUs). The latter forms a centralized pool of high-performance data center resources. To benefit from network function virtualization, we consider virtualized BBU (V-BBU) resources where the BBU functionality and services have been virtualized in the form of virtual network functions. We consider all RRHs in the C-RAN as a single cluster. Each RRH of such a cluster accommodates quasi-random traffic. This means that new calls in a RRH are generated by a finite number of mobile users. An arriving call requires a radio resource unit from the serving RRH and a computational resource unit from the V-BBU. If these resource units are available, then the call is accepted and remains in the system for a generally distributed service …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:kuK5TVdYjLIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "International Journal on Advances in Telecommunications Volume 6, Number 1 & 2, 2013",
            "Publication year": 2013,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.360.7786&rep=rep1&type=pdf",
            "Abstract": "International Journal on Advances in Telecommunications Volume 6, Number 1 & 2, 2013 Page \n2 The International Journal on Advances in Telecommunications is published by IARIA. ISSN: \n1942-2601 journals site: http://www. iariajournals. org contact: petre@ iaria. org Responsibility \nfor the contents rests upon the authors and not upon IARIA, nor on IARIA volunteers, staff, or \ncontractors. IARIA is the owner of the publication and of editorial aspects. IARIA reserves the \nright to update the content for quality improvements. Abstracting is permitted with credit to the \nsource. Libraries are permitted to photocopy or print, providing the reference is mentioned \nand that the resulting material is made available at no cost. Reference should mention: \nInternational Journal on Advances in Telecommunications, issn 1942-2601 vol. 6, no. 1 & 2, \nyear 2013, http://www. iariajournals. org/telecommunications/ The copyright for each paper . …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A software-defined architecture for next-generation cellular networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7511018/",
            "Abstract": "In the recent years, mobile cellular networks are undergoing fundamental changes and many established concepts are being revisited. New emerging paradigms, such as Software-Defined Networking (SDN), Mobile Cloud Computing (MCC), Network Function Virtualization (NFV), Internet of Things (IoT), and Mobile Social Networking (MSN), bring challenges in the design of cellular networks architectures. Current Long-Term Evolution (LTE) networks are not able to accommodate these new trends in a scalable and efficient way. In this paper, first we discuss the limitations of the current LTE architecture. Second, driven by the new communication needs and by the advances in aforementioned areas, we propose a new architecture for next-generation cellular networks. Some of its characteristics include support for distributed content routing, Heterogeneous Networks (HetNets) and multiple Radio Access …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of IEEE 802.11 e based on ON-OFF traffic model.",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/48981429/Performance_evaluation_of_IEEE_802.11e_b20160920-11326-e7yv3i.pdf",
            "Abstract": "We investigate the performance of the IEEE 802.11 e while emphasizing on the end-to-end delay performance. In our MAC delay analysis, we are based on elementary conditional probabilities, avoiding the complex Markov Chains method. For a thoroughly study of the MAC delay, we take the Z-transform of the backoff duration in order to provide higher moments of the MAC delay distribution. The first moment corresponds to the mean MAC delay, while the second moment to the Standard Deviation of the MAC delay, which depicts the jitter. We also estimate the Probability Mass Function (PMF) of the MAC delay through the Lattice Poisson Algorithm. For the queuing delay, we consider a queue for each Access Category (AC) with one common server and an input process which is described by an O-OFF model depicting the bursty nature of traffic. The service time follows the MAC delay distribution. Analyzing this queue, we provide results both for saturated and non-saturated channel condition. The end-toend delay is estimated by the sum of queuing and MAC delay. The analytical results are validated through simulation.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Erlang-Engset multirate retry loss models for elastic and adaptive traffic under the bandwidth reservation policy",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.589.6843&rep=rep1&type=pdf#page=22",
            "Abstract": "In this paper, we consider a single-link multirate loss system, which accommodates different service-classes with different traffic and peak-bandwidth requirements. Calls of each service-class arrive in the system according to a random (Poisson) or a quasi-random process, and have an exponentially distributed service time. Poisson or quasi-random arriving calls belong to service-classes of infinite or finite number of traffic sources, respectively. The service-classes are also distinguished, according to the behaviour of calls under service, in elastic and adaptive service-classes. Elastic calls can compress their bandwidth by simultaneously increasing their service time, while, adaptive calls do not affect their service time. A new call (either elastic or adaptive) is accepted in the system with its peak-bandwidth requirement, if there is available link bandwidth. If not, the call retries one or more times (single and multi-retry loss model, respectively) with a reduced bandwidth. If the available link bandwidth is lower than the call’s last bandwidth requirement, the call can still compress its last bandwidth requirement (down to a certain bandwidth), together with the bandwidth of all inservice calls. Call blocking occurs, if, after compression, the call’s bandwidth still exceeds the available link bandwidth. The system incorporates the Bandwidth Reservation (BR) policy, whereby we can achieve certain Quality of Service (QoS) for each serviceclass, through a proper bandwidth allocation defined by the BR parameters. To calculate in an approximate but efficient way, time and call congestion probabilities, as well as link utilization, we propose recurrent formulas for the …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation in single or multi-cluster C-RAN supporting quasi-random traffic",
            "Publication year": 2020,
            "Publication url": "https://hrcak.srce.hr/index.php?show=clanak&id_clanak_jezik=348941",
            "Abstract": "In this paper, a cloud radio access network (C-RAN) is considered where the remote radio heads (RRHs) are separated from the baseband units (BBUs). The RRHs in the C-RAN are grouped in different clusters according to their capacity while the BBUs form a centralized pool of computational resource units. Each RRH services a finite number of mobile users, ie, the call arrival process is the quasi-random process. A new call of a single service-class requires a radio and a computational resource unit in order to be accepted in the C-RAN for a generally distributed service time. If these resource units are unavailable, then the call is blocked and lost. To analyze the multi-cluster C-RAN, we model it as a single-rate loss system, show that a product form solution exists for the steady state probabilities and propose a convolution algorithm for the accurate determination of congestion probabilities. The accuracy of this algorithm is verified via simulation. The proposed model generalizes our recent model where the RRHs in the C-RAN are grouped in a single cluster and each RRH accommodates quasi-random traffic.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Udruga za komunikacijske i informacijske tehnologije, Fakultet elektrotehnike, strojarstva i brodogradnje, Sveučilište u Splitu"
        },
        {
            "Title": "An Analytical Study of an All-Optical Packet Switch with QoS Support",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5489806/",
            "Abstract": "Optical Packet Switching (OPS) is a promising technology that efficiently utilizes the raw bandwidth provided by the Wavelength Division Multiplexing (WDM) technique. OPS is expected to support the radically increasing bandwidth demands of the Next Generation Internet backbone. Since realtime applications demand various but certain levels of Quality of Service (QoS), optical networks based on OPS should provide service differentiation. In this paper we investigate the performance of an all-optical packet switch, in terms of the packet blocking probability. We analyse several QoS differentiation schemes, including wavelength conversion, packet dropping and wavelength reservation. We demonstrate the accuracy of the proposed analysis by comparing the analytical results with that of simulation; the results found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "International Journal on Advances in Telecommunications Volume 5, Number 3 & 4, 2012",
            "Publication year": 2012,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.303.5808&rep=rep1&type=pdf",
            "Abstract": "The session initiation protocol (SIP) is a general-purpose protocol that can be used for video conferencing, instant messaging and gaming. However, its primary use today is in VoIP systems, where it serves as a support protocol for registering and locating users, and for call set up and management. Conventional SIP implementations in servers and softphones require the support of an operating system (OS) such as Windows or Linux, or some form of an OS kernel. SIP phones are also frequently implemented in hardware/firmware typically with an embedded OS. The SIP implementations in OS-based systems take advantage of their rich supporting environment and capabilities, and are convenient to use.Bare PC systems (also known as bare machine computing systems) enable self-supporting applications to run directly on the hardware of an ordinary PC (desktop or laptop) without using an OS or kernel. A bare PC provides immunity against OS-based attacks, and bare PC applications perform better than applications running on conventional systems due to the elimination of OS overhead. We describe the design, implementation and performance of a SIP user agent (UA) for secure VOIP on bare PC systems. The SIP UA is integrated with the bare PC softphone application. In [1], the design and implementation of a SIP server and UA for VoIP on a bare PC were described. However, that study did not consider UA performance or the elimination of additional protocols such as TLS or IPsec to secure the key exchange over SIP to protect the VoIP call. Other studies [2],[3] dealt extensively with bare PC SIP server (but not SIP UA) implementation and …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Erlang Multirate Loss Model",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742765/",
            "Abstract": "This chapter starts with random arriving calls of fixed bandwidth requirements and fixed bandwidth allocation during service. Before the study of multirate teletraffic loss models where multiple service‐classes of different bandwidth per call requirements are accommodated in a service system, the chapter presents the simpler case where all calls belong to just one service‐class, and considers the multi‐service system. When aiming at QoS equalization among service‐classes, the recursive CBP calculation of the Erlang multirate loss model under the BR policy according to the Roberts method can be improved by the following method proposed by Stasiak and Glabowski. According to ITU‐T, a fixed routing network is a network in which a route providing a connection between an originating node and a destination node is fixed for every service‐class (or for every traffic flow of the same service‐class). The chapter also …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "Static and dynamic analysis of WannaCry ransmware",
            "Publication year": 2018,
            "Publication url": "https://www-users.cs.york.ac.uk/~vasili/ePrints/ictf_2018_WannaCry.pdf",
            "Abstract": "Nowadays ransomware presents a huge and the fastest growing problem for all types of users from small households to large corporations and government bodies. Modern day ransomware families implement sophisticated encryption and propagation schemes, thus limiting chances to recover the data almost to zero. In order to design and develop appropriate detection and mitigation mechanisms it is important to perform ransomware analysis and indemnify its features. In this work, we present our ransomware analysis results focusing on the infamous WannaCry ransomware. In particular, the presented research examines the WannaCry behaviour during its execution in a purpose-built virtual lab environment. We perform static and dynamic analysis using a wide range of malware analysis tools. The obtained results can be used for developing appropriate detection and mitigation mechanisms for WannaCry or other ransomware families that exhibit similar behaviour.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of Multirate Loss Models for Elastic and Adaptive Services",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Moscholios/publication/228894604_Evaluation_of_multi-rate_loss_models_for_elastic_and_adaptive_services/links/5649b22508ae54697fbf04b3/Evaluation-of-multi-rate-loss-models-for-elastic-and-adaptive-services.pdf",
            "Abstract": "For the analysis of stream traffic in a single link loss system, the well-known Erlang Mutirate Loss Model (EMLM) is used. In this paper we review two extensions of the EMLM, proposed for the analysis of heterogeneous traffic in telecom networks. The first extension is the Connection Dependent Threshold Model (CDTM), where calls arriving at a communication link can reduce their bandwidth while increase their service time requirement, according to a set of thresholds indicating the link occupied bandwidth. The second extension is the Extended Erlang Multirate Loss Model (E-EMLM), where an arriving call at a communication link requires certain bandwidth and, if not available, the call can reduce its bandwidth requirement while increasing (elastic traffic) or keeping unchanged (adaptive traffic) its service time requirement; this is done in accordance with the bandwidth reduction of the in-service calls. For the evaluation of the two models, we compare the call-level QoS index of Call Blocking Probability (CBP), when the average allocated link bandwidth is the same for the two models. Our results show that if both elastic and adaptive traffic are present, the Extended EMLM performs better than the CDTM.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Call-level QoS assessment in ATM networks supporting elastic traffic",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/937097/",
            "Abstract": "The call-level QoS assessment in ATM networks remains an open issue, due to elastic services. We consider the coexistence of available bit rate (ABR) services with QoS guarantee services in a virtual path (VP) link and evaluate the call blocking probabilities (CBP). To this end, firstly, we review two extensions of the Erlang multirate loss model and examine their applicability on ABR services. In the first extension, the retry models, blocked calls can retry with reduced resource requirements and increased arbitrary mean residency requirements. In the second extension, the threshold models, request sizes and residency times are state dependent. For both models, we present expressions for efficient calculation of the final CBP. Secondly, we propose the connection-dependent threshold model, which resembles the threshold models, but the state dependency is individualized among call connections. Finally we …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Connection-dependent threshold model: a generalization of the Erlang multiple rate loss model",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0166531602000378",
            "Abstract": "In this paper first, we review two extensions of the Erlang multi-rate loss model (EMLM), whereby we can assess the call-level quality-of-service (QoS) of ATM networks. The call-level QoS assessment in ATM networks remains an open issue, due to the emerged elastic services. We consider the coexistence of ABR service with QoS guarantee services in a VP link and evaluate the call blocking probability (CBP), based on the EMLM extensions. In the first extension, the retry models, blocked calls can retry with reduced resource requirements and increased arbitrary mean residency requirements. In the second extension, the threshold models, for blocking avoidance, calls can attempt to connect with other than the initial resource and residency requirements which are state dependent. Secondly, we propose the connection-dependent threshold model (CDTM), which resembles the threshold models, but the state …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:aqlVkmm33-oC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Congestion probabilities in CDMA-based networks supporting batched Poisson input traffic",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-014-1923-8.pdf",
            "Abstract": "We propose a new multirate teletraffic loss model for the calculation of time and call congestion probabilities in CDMA-based networks that accommodate calls of different service-classes. The call arrival process follows a batched Poisson process, which is more “peaked” and “bursty” than the ordinary Poisson process. The call-admission-control policy is based on the partial batch blocking discipline. This policy accepts a part of the batch (one or more calls) and discards the rest, if the available resources are not enough to accept the whole batch. The proposed model takes into account multiple access interference, both the notion of local (soft) and hard blocking, the user’s activity, as well as interference cancellation. Although the analysis of the model does not lead to a product form solution of the steady state probabilities, we show that the call-level performance metrics, time and call congestion …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:Mojj43d5GZwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Call blocking probabilities in a W-CDMA cell with fixed number of channels and finite number of traffic sources",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4610704/",
            "Abstract": "This paper focuses on the call blocking probabilities calculation in a W-CDMA cell with fixed number of channels and finite number of traffic sources. To this end, the use of the Engset multirate loss model (EnMLM) is proposed in the uplink direction. To apply the EnMLM we need to extend it by incorporating the so called  local blockings . Arriving calls compete for their successful admission to a W-CDMA cell. The call admission depends on the availability of the required channels. To analyze the system, we formulate an aggregate one-dimensional Markov chain, and based on it, we determine the system state probabilities by an efficient recurrent formula. Consequently, we determine the call blocking probabilities in the uplink direction. Although the proposed model is approximate, its accuracy is found to be quite satisfactory. The evaluation is done through simulation. Moreover, the model performs better than the …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multi-rate loss model for OCDMA PONs",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5970874/",
            "Abstract": "We propose a new teletraffic loss model for the calculation of blocking probabilities in an OCDMA Passive Optical Network (PON) configuration that supports multiple service-classes according to the parallel mapping technique of data rate differentiation. Our analysis includes parameters related to both the local and hard blocking, as well as to Multiple Access Interference and user activity. We form a two-dimensional Markov chain, and solve it to derive recursive formulas for the efficient calculation of blocking probabilities. To evaluate the proposed model, the analytical results are compared with simulation results. The comparison reveals that the accuracy of the proposed analysis is quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The extended connection-dependent threshold model for elastic and adaptive traffic",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/30097070/3._the_extended_connection-dependent_threshold_model_for_elastic_and_adaptive_traffic_(csndsp_2006).pdf",
            "Abstract": "In this paper we present a new model for the calculation of link occupancy distribution and blocking probabilities in a single-link multi-rate loss system. In this model K different service-classes compete for the available link bandwidth under the complete sharing policy. A serviceclass can be either of elastic or of adaptive type. Calls arrive to the link with several contingency bandwidth requirements, which depend on thresholds that indicate the occupied link bandwidth. It is possible for a call, while in service with a certain bandwidth, to reduce it, in order to allow the acceptance of new calls in the link. The accuracy of the new model is verified by simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finite Multirate Retry Threshold Loss Models",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742754/",
            "Abstract": "This chapter considers multirate loss models of quasi‐random arriving calls with elastic bandwidth requirements and fixed bandwidth allocation during service. Calls may retry several times upon arrival in order to be accepted for service. Alternatively, new calls may request less bandwidth according to the occupied link bandwidth indicated by threshold(s). In the finite multi‐retry model (f‐MRM), calls of service‐class k can retry more than once to be connected in the system. Compared to the finite single‐retry model under BR policy, in the f‐MRM under the BR policy, blocked calls of service‐class  k  can retry more than once to be connected in the system. In the finite connection dependent threshold model under the BR policy (f‐CDTM/BR), t k  b.u. are reserved to benefit calls of all other service‐classes apart from service‐class  k . The application of the BR policy in the f‐CDTM/BR is similar to that of the finite multi …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:vDijr-p_gm4C",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "Call blocking probabilities of multirate elastic and adaptive traffic under the Threshold and Bandwidth Reservation policies",
            "Publication year": 2016,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.baztech-ed878660-1b64-4a83-b5dc-423e22ab4649",
            "Abstract": "This paper proposes multirate teletraffic loss models of a link that accommodates different service-classes of elastic and adaptive calls. Calls follow a Poisson process, can tolerate bandwidth compression and have an exponentially distributed service time. When bandwidth compression occurs, the service time of new and in-service elastic calls increases. Adaptive calls do not alter their service time. All calls compete for the available link bandwidth under the combination of the Threshold (TH) and the Bandwidth Reservation (BR) policies. The TH policy can provide different QoS among service-classes by limiting the number of calls of a service-class up to a predefined threshold, which can be different for each service-class. The BR policy reserves part of the available link bandwidth to benefit calls of high bandwidth requirements. The analysis of the proposed models is based on approximate but recursive formulas, whereby authors determine call blocking probabilities and link utilization. The accuracy of the proposed formulas is verified through simulation and found to be very satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Connection Dependent Threshold Model for Finite Sources—A Generalization of the Engset Multirate Loss Model",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_128",
            "Abstract": "Call Blocking Probabilities (CBP) are the key index of the call-level QoS in multirate networks supporting either CBR or elastic traffic. We review the Engset Multirate Loss Model, in a single link, for CBR traffic, and for elastic traffic we propose the Connection Dependent Threshold Model with finite sources (f-CDTM). In f-CDTM, calls may adjust their traffic and bandwidth requirements according to sets of thresholds. Furthermore, we present the f-CDTM for a mixture of service-classes of finite and infinite sources. The proposed models don’t have a product form solution; therefore the СВР calculation is based on approximate but recursive formulas used for the link occupancy distribution determination. The latter is complex since it requires enumeration and processing of the system state space. Simulation results validate our analysis.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Qos guarantee in a multirate loss model of batched Poisson arrival processes",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=oCHVqHiMk3sC&oi=fnd&pg=PA387&dq=info:m9MTauY0A0gJ:scholar.google.com&ots=Kcgm4xMbZL&sig=uZUXme7rVamvE4KcBrwK3cO8gH8",
            "Abstract": "Bandwidth Reservation (BR) is a sine qua non of multi-service loss systems, in order to guarantee a certain Quality of Service (QoS) for each service accommodated in the system/link. First, we review an extension of the Erlang Multirate Loss Model (EMLM), namely the Batched Poisson Erlang Multirate Loss Model (BP-EMLM), in which calls of each service arrive in a link of certain capacity, following a batch Poisson process and compete for the available link bandwidth under the Complete Sharing (CS) policy. The batch size is generally distributed while the partial batch blocking discipline is applied, ie depending on the available link bandwidth a part of an arriving batch can be accepted while the rest of it is discarded. Second, we propose the BP-EMLM under BR policy. The importance of this proposal is not only that we can guarantee specific call-level QoS for each service, but also that we strengthen the applicability of the BP-EMLM to overflow traffic modeling of alternate route systems, where BR policy must be applied in the overflow routes to protect direct traffic from overflow traffic. For the application of the BR policy in the BP-EMLM, we study two methods:(1) the Roberts and (2) the Stasiak–Glabowski (S&G) method. The new model (with BR) does not have a product form solution and therefore we propose approximate but recursive formulas for the calculation of various performance measures,",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security requirements modelling for virtualized 5G small cell networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7998269/",
            "Abstract": "It is well acknowledged that one of the key enabling factors for the realization of future 5G networks will be the small cell (SC) technology. Furthermore, recent advances in the fields of network functions virtualization (NFV) and software-defined networking (SDN) open up the possibility of deploying advanced services at the network edge. In the context of mobile/cellular networks this is referred to as mobile edge computing (MEC). Within the scope of the EU-funded research project SESAME we perform a comprehensive security modelling of MEC-assisted quality-of-experience (QoE) enhancement of fast moving users in a virtualized SC wireless network, and demonstrate it through a representative scenario toward 5G. Our modelling and analysis is based on a formal security requirements engineering methodology called Secure Tropos which has been extended to support MEC-based SC networks. In the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance Evaluation of Two-Link Multirate Loss Models with Restricted Accessibility",
            "Publication year": 2020,
            "Publication url": "http://yadda.icm.edu.pl/yadda/element/bwmeta1.element.baztech-6937e6ba-91c6-4573-99a9-8d96ba4a53d7",
            "Abstract": "We consider a two-link communication system with restricted accessibility that services Poisson arriving calls of many service-classes and propose a multirate teletraffic loss model for its analysis. In a restricted accessibility system, call blocking occurs even if available resources do exist at the time of a call’s arrival. In the two-link system under consideration, each link has two thresholds (offloading and support) which express the in-service calls in a link. The offloading threshold represents the point from which a link offloads calls. The support threshold (which is lower than the offloading threshold) defines the point up to which a link supports offloaded calls. The two-link system with restricted accessibility is modeled as a loss system whose steady state probabilities do not have a product form solution. However, approximate formulas for the determination of call blocking probabilities are proposed. In addition, we also provide a corresponding analysis related to the case of quasi-random traffic (ie traffic generated by a finite number of users). The accuracy of all formulas is verified through simulation and is found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:WZBGuue-350C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Battery drain denial-of-service attacks and defenses in the Internet of Things",
            "Publication year": 2019,
            "Publication url": "http://yadda.icm.edu.pl/yadda/element/bwmeta1.element.baztech-7ee72696-2a33-457c-be37-b7e6802a9a0f",
            "Abstract": "IPv6 Routing Protocol for Low-Power and Lossy Networks (RPL) is a popular routing protocol used in wireless sensor networks and in the Internet of Things (IoT). RPL was standardized by the IETF in 2012 and has been designed for devices with limited resources and capabilities. Open-source RPL implementations are supported by popular IoT operating systems (OS), such as ContikiOS and TinyOS. In this work, we investigate the possibility of battery drain Denial-of-Service (DoS) attacks in the RPL implementation of ContikiOS. In particular, we use the popular Cooja simulator and implement two types of DoS attacks, particularly version number modification and “Hello” flooding. We demonstrate the impact of these attacks on the power consumption of IoT devices. Finally, we discuss potential defenses relying on distributed intrusion detection modules.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:EYYDruWGBe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Fourth Advanced International Conference on Telecommunications, AICT 2008, 8-13 June 2008, Athens, Greece",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=15632289652982197678&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:edDO8Oi4QzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Congestion probabilities in a batched Poisson multirate loss model supporting elastic and adaptive traffic",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s12243-012-0326-7",
            "Abstract": "The ever increasing demand of elastic and adaptive services, where in-service calls can tolerate bandwidth compression/expansion, together with the bursty nature of traffic, necessitates a proper teletraffic loss model which can contribute to the call-level performance evaluation of modern communication networks. In this paper, we propose a multirate loss model that supports elastic and adaptive traffic, under the assumption that calls arrive in a single link according to a batched Poisson process (a more “bursty” process than the Poisson process, where calls arrive in batches). We assume a general batch size distribution and the partial batch blocking discipline, whereby one or more calls of a new batch are blocked and lost, depending on the available bandwidth of the link. The proposed model does not have a product form solution, and therefore we propose approximate but recursive formulas for the …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:J-pR_7NvFogC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A Simple Analytical Model for the Calculation of Packet Blocking Probability in an Optical Packet Switching Netw",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600458/",
            "Abstract": "Optical packet switching is a promising all-optical network technology for future large-scale networks, due to good resource utilization and the ability to handle high data rates in a cost-efficient way. In this paper we investigate the performance of an optical packet switching network, in respect of the packet blocking probability. The network supports the wavelength conversion technique, in order to reduce packet losses. We derive an analytical model for the calculation of blocking probability, based on the reduced load approximation method. The demonstration of the accuracy of the proposed analysis is realized by comparing the analytical results with that of simulation; the results found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Calculating blocking probabilities in single-hop WDM traffic groomed optical networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4296352/",
            "Abstract": "Traffic grooming in Wavelength Division Multiplexing (WDM) optical networks is a promising technology for improving the performance and reducing the network cost. We study the blocking performance of a single-hop WDM traffic groomed optical network, by considering that different connections request service through a single optical link. In each connection the generated calls may come from a single or multiple service-classes. For the case of a single service-class we develop a novel analytical loss model to calculate Connection Blocking Probabilities (ConBP) and Call Blocking Probabilities (CBP). Also, we extend this model to support multiple service-classes. The accuracy of the calculations is verified by simulation and found to be absolutely satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Uplink blocking probabilities in priority-based cellular CDMA networks with finite source population",
            "Publication year": 2016,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e99-b_6_1302",
            "Abstract": "Fast proliferation of mobile Internet and high-demand mobile applications necessitates the introduction of different priority classes in next-generation cellular networks. This is especially crucial for efficient use of radio resources in the heterogeneous and virtualized network environments. Despite the fact that many analytical tools have been proposed for capacity and radio resource modelling in cellular networks, only a few of them explicitly incorporate priorities among services. We propose a novel analytical model to analyse the performance of a priority-based cellular CDMA system with finite source population. When the cell load is above a certain level, low-priority calls may be blocked to preserve the quality of service of high-priority calls. The proposed model leads to an efficient closed-form solution that enables fast and very accurate calculation of resource occupancy of the CDMA system and call blocking …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:kRWSkSYxWN8C",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "An analytical approach for dynamic wavelength allocation in WDM–TDMA PONs servicing ON–OFF traffic",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-3-4-347",
            "Abstract": "Optical access systems are now considered a feasible alternative to the predominant broadband access technologies, while, at the same time, passive optical networks (PONs) are viewed as an attractive and promising type of fiber access system. In this paper we present and analyze three basic dynamic wavelength allocation scenarios for a hybrid wavelength division multiplexing–time division multiple access (WDM–TDMA) PON. We propose new teletraffic loss models for calculating call-level performance measures, like connection failure probabilities (due to unavailability of a wavelength) and call blocking probabilities (due to the restricted bandwidth capacity of a wavelength). The PON accommodates bursty service-classes of ON–OFF traffic. The proposed models are extracted from one-dimensional Markov chains, which describe the wavelength occupancy in the PON, and two-dimensional Markov chains …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:olpn-zPbct0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Efficient radio resource allocation in SDN/NFV based mobile cellular networks under the complete sharing policy",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/document/8352954/",
            "Abstract": "Novel networking paradigms, such as software-defined networking (SDN) and network function virtualisation (NFV), introduce new opportunities in the design of next-generation mobile networks. The present work investigates the benefits of the emerging SDN and NFV technologies on the radio resource management (RRM) in mobile cellular networks. In particular, the aim of the proposed RRM scheme is to enable an efficient and flexible radio resource allocation in order to assure quality of experience of mobile users. The authors consider the orthogonal frequency division multiple access scheme and the complete radio resource sharing policy. To enable time- and space-efficient resource allocation, the authors investigate the applicability of the well-known Kaufman-Roberts recursion in the context of new architectural and functional changes of SDN/NFV based mobile environments. Finally, they discuss the …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IET"
        },
        {
            "Title": "QoS guarantee in a batched poisson multirate loss model supporting elastic and adaptive traffic",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6363934/",
            "Abstract": "In this paper, we consider a single link that supports both elastic and adaptive traffic of Batch Poisson arriving calls, under the Bandwidth Reservation (BR) policy, whereby we can achieve specific QoS per service-class. Arriving batches have a generally distributed batch size, and can be serviced either as a whole or in part (partial batch blocking discipline), depending on the available link bandwidth. Blocked calls are lost. Accepted calls of a batch can compress or expand their bandwidth; elastic calls expand or compress their service time accordingly, while adaptive calls do not alter their service time. This system does not have a Product Form Solution. For the efficient calculation of time and call congestion probabilities as well as link utilization, we derive approximate but recursive formulas. The accuracy of the model is completely satisfactory and is verified together with the model's consistency, through simulation …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance metrics in OFDM wireless networks supporting quasi-random traffic",
            "Publication year": 2020,
            "Publication url": "https://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-36e67f21-a5cb-4c38-81f7-c21250e54fc4",
            "Abstract": "We consider the downlink of an orthogonal frequency division multiplexing (OFDM) based cell that accommodates calls from different service-classes with different resource requirements. We assume that calls arrive in the cell according to a quasi-random process, ie, calls are generated by a finite number of sources. To calculate the most important performance metrics in this OFDM-based cell, ie, congestion probabilities and resource utilization, we model it as a multirate loss model, show that the steady-state probabilities have a product form solution (PFS) and propose recursive formulas which reduce the complexity of the calculations. In addition, we study the bandwidth reservation (BR) policy which can be used in order to reserve subcarriers in favor of calls with high subcarrier requirements. The existence of the BR policy destroys the PFS of the steady-state probabilities. However, it is shown that there are recursive formulas for the determination of the various performance measures. The accuracy of the proposed formulas is verified via simulation and found to be satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal resource management in ATM networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-306-47023-3_8",
            "Abstract": "In the beginning an overview of network/traffic control in ATM networks is presented, based on the fact that traffic control is distinguished in two levels, the Call-level and the Cell-level control, according to the distinction of ATM traffic in call and cell components, respectively. Afterwards, the paper concentrates on the Call-level and the impact of Virtual Path Bandwidth (VPB) control on ATM network performance. In particular the optimal VPB control is presented, minimizing the worst Call Blocking Probability of all Virtual Paths (VP) of the network. A VPB controller solves a large network optimization problem by a rigorous analytical procedure, while can assure network reliability. The procedure for optimal VPB allocation is clarified, step-by-step, in a tutorial application example. In a more realistic example, the optimal VPB control is applied on a model ATM network.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "International Journal on Advances in Telecommunications Volume 4, Number 3 & 4, 2011",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.436.6265&rep=rep1&type=pdf",
            "Abstract": "International Journal on Advances in Telecommunications Volume 4, Number 3 & 4, 2011 Page \n2 The International Journal on Advances in Telecommunications is published by IARIA. ISSN: \n1942-2601 journals site: http://www. iariajournals. org contact: petre@ iaria. org Responsibility \nfor the contents rests upon the authors and not upon IARIA, nor on IARIA volunteers, staff, or \ncontractors. IARIA is the owner of the publication and of editorial aspects. IARIA reserves the \nright to update the content for quality improvements. Abstracting is permitted with credit to the \nsource. Libraries are permitted to photocopy or print, providing the reference is mentioned \nand that the resulting material is made available at no cost. Reference should mention: \nInternational Journal on Advances in Telecommunications, issn 1942-2601 vol. 4, no. 3 & 4, \nyear 2011, http://www. iariajournals. org/telecommunications/ The copyright for each paper . …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On–Off Multirate Loss Models",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742757/",
            "Abstract": "This chapter considers ON‐OFF multirate loss models of random arriving calls with fixed bandwidth requirements. In the ON‐OFF loss models, in‐service calls do not constantly keep their assigned bandwidth but alternate between transmission periods (ON) and idle periods (OFF). The basic characteristics of these ON‐OFF loss models are: they can be used for the analysis of the call‐level behavior of bursty traffic (the ON‐OFF model is a simple representation of bursty traffic) and their analysis is based on the classical EMLM (a fact that facilitates their computer implementation). The chapter presents an interesting application of the ON‐OFF model. It proposes three basic DWA scenarios and corresponding analytical models. Each DWA scenario introduces an alternative wavelength release procedure based on the bandwidth occupancy of the wavelength that is assigned to an optical network unit.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:4MWp96NkSFoC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "Path bandwidth management for large scale telecom networks",
            "Publication year": 2000,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e83-b_9_2087",
            "Abstract": "This paper presents a Path Bandwidth Management (PBM) model for large-scale networks that leads to an almost optimal PB allocation, under constraints posed by the installed bandwidth in the transmission links of the network. The PB allocation procedure is driven from a traffic demand matrix and consists of three phases. In the first phase, a suitable decomposition of the whole network takes place, where the large-scale network is split to a set of one-level sub-networks. In the second phase, the optimization algorithm developed for one-level telecommunication networks is applied to each sub-network in order to define the optimal PB allocation. The criterion for optimization is to minimize the worst Call Blocking Probability (CBP) of all switching pairs of the sub-network. In the third phase, composition of the sub-networks takes place in a successive way, which leads to the final PB allocation of the large-scale …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:roLk4NBRz8UC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Call-level blocking of on-off traffic sources in a shared resource environment with batched Poisson arrival processes",
            "Publication year": 2005,
            "Publication url": "https://cpfd.cnki.com.cn/Article/CPFDTOTAL-ZGTH200508001017.htm",
            "Abstract": "正 We analyse a call-level traffic model of a single link that accommodates bursty services of ON-OFF (transmission-no transmission) type. Calls of each service arrive to the link according to a batch Poisson process and compete for the available link bandwidth under the complete sharing policy. The batch size is generally distributed, while the batch blocking discipline is the partial batch blocking, ie depending on the available link bandwidth a part of an arriving batch is accepted while the rest of it is discarded. Accepted calls enter the system via state ON and can alternate between ON-OFF states. We prove that the proposed batched Poisson ON-OFF (BP-ON-OFF) model has a product form solution and provide an accurate recursive formula for the determination of various call-level performance measures such as the time and call congestion probabilities and link utilization. Simulation results validate our analysis.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A single-threshold model for handoff traffic analysis in cellular CDMA networks",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.677.9055&rep=rep1&type=pdf",
            "Abstract": "Small cells are expected to play an important role in future mobile networks. In such environments, proper handling of handoff traffic is of major importance. In this paper, we propose the single-threshold model for the analysis of handoff traffic in cellular CDMA networks. Based on this model, we are able to determine analytically the uplink blocking probabilities of handoff and new calls. This is done by describing the CDMA system as a Discrete-Time Markov Chain and by deriving an efficient recursive formula for the calculation of system state probabilities. The proposed analytical model is verified via simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the handoff-call blocking probability calculation in W-CDMA cellular networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4545522/",
            "Abstract": "In this paper, we investigate the call blocking probability calculations in the uplink of W-CDMA mobile cellular networks. In these networks, we distinguish two types of blocking, the new-call blocking, which concerns the initial call establishment request, and the handoffcall blocking, due to the users' mobility from one cell to the other. To analyze the system, we describe it by a Discrete Time Markov Chain, and based on it, we derive a recursive formula for the calculation of the state probabilities. Consequently, the new-call blocking probabilities and the handoffcall blocking probabilities are determined. To evaluate the proposed formulas, the analytical results are compared with simulation results. This comparison shows that the accuracy of the proposed formulas is very satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Analytical Model for Elastic Service-classes in W-CDMA Networks",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=lKm6A-aNJewC&oi=fnd&pg=PA277&dq=info:_t_Howy0TNoJ:scholar.google.com&ots=LBLwQdU5E2&sig=8T2KWkUuI6BeCTv3qus49mHcP0Y",
            "Abstract": "In this article we present a teletraffic model, named Wideband Threshold Model, for the analysis of W-CDMA networks supporting elastic traffic. Mobile users generate Poisson arriving calls that compete for the acceptance to a W-CDMA cell under the complete sharing (CS) policy. A newly arriving call can be accepted with one of several possible Quality-of-Service (QoS) requirements, depending on the resource availability in the cell that is indicated by thresholds. Aiming at the efficient calculation of the system state probabilities and mainly the call blocking probabilities (CBP), for the uplink connection, we provide recurrent formulas. The accuracy of the analytical CBP results is verified by simulation results and is found to be absolutely satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Performance Behavior of IEEE 802.11 Distributed Coordination Function",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/John-Vardakas/publication/256842507_On_the_Performance_Behavior_of_the_IEEE_80211_Distributed_Coordination_Function/links/00b7d533a8ce13e648000000/On-the-Performance-Behavior-of-the-IEEE-80211-Distributed-Coordination-Function.pdf",
            "Abstract": "The basis of the Medium Access Control (MAC), proposed in IEEE 802.11 standard for wireless local area networks, is the Distributed Coordination Function (DCF). DCF uses Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) to resolve contention between wireless stations and to verify successful transmissions. In this work we present an analytical model of the IEEE 802.11 MAC protocol validated by simulation results for the DCF throughput, for both packet transmission schemes employed by DCF, the basic access and the RTS/CTS access mechanism. Moreover, we depict the saturation throughput and the average packet delay for 1, 5.5 and 11 Mbps in order to highlight the effect of the bit rate on network performance for both mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "12th GI/ITG CONFERENCE ON MEASURING, MODELLING AND EVALUATION OF COMPUTER AND COMMUNICATION SYSTEMS 3rd POLISH-GERMAN TELETRAFFIC SYMPOSIUM",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vsjqcAOJdHgC&oi=fnd&pg=PA55&dq=info:xpHhZ5LajgMJ:scholar.google.com&ots=rr2JoUaIGU&sig=CzOjFklz-SygIwGatUrStRu-MXs",
            "Abstract": "We assess the call-level performance of communication networks accommodating elastic services by generalizing the Erlang Multirate Loss Model with the Connection Dependent Threshold Model (CDTM). The call-level performance index, the Call Blocking Probability (CBP), is calculated through the CDTM by a recurrent formula, which is extracted approximately, due to the absence of a product form solution in the model. In the CBP calculation significant errors occur for several trafficload conditions. Therefore, we propose a new approximation method whereby we substantially improve the accuracy of the existing CDTM. This is done by introducing Reverse Transition Rates in concrete states of the one-dimensional Markov chain. Simulation results show that the errors of the new model are significantly reduced, especially under realistic traffic-load conditions. Keywords",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:foquWX3nUaYC",
            "Publisher": "Margret Schneider"
        },
        {
            "Title": "Performance metrics of a multirate resource sharing teletraffic model with finite sources under the threshold and bandwidth reservation policies",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/document/7110460/",
            "Abstract": "The authors propose a new multirate teletraffic loss model of a single link with certain capacity that accommodates different service-classes whose calls come from finite traffic sources. Calls compete for the available link bandwidth under the combination of the threshold (TH) and the bandwidth reservation (BR) policies. The TH policy can provide different quality of service among service-classes by limiting calls of each service-class up to a certain number, which is a predefined TH, which can be different for each service-class. The BR policy reserves part of the available link bandwidth to benefit calls of high bandwidth requirements. They show that the proposed model, without the BR policy, has a product form solution (PFS) and prove recursive formulas for the efficient calculation of the call-level performance metrics, such as time and call congestion probabilities as well as link utilisation. The combination of the TH …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:a0OBvERweLwC",
            "Publisher": "IET"
        },
        {
            "Title": "Interdependency of the Teletraffic Models",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742756/",
            "Abstract": "Interdependency of the Teletraffic Models - Wiley-IEEE Press books IEEE.org IEEE Xplore \nIEEE-SA IEEE Spectrum More Sites Create Account Personal Sign In Personal Sign In For IEEE \nto continue sending you helpful information on our products and services, please consent to \nour updated Privacy Policy. I have read and accepted the IEEE Privacy Policy. Accept & Sign In \nEmail Address Password Sign In Forgot Password? Interdependency of the Teletraffic Models \nArticle #: ISBN Information: Online ISBN: 9781119426974 Electronic ISBN: 9781119426912 \nElectronic ISBN: 9781119426905 Print ISBN: 9781119426882 INSPEC Accession Number: \nPersistent Link: https://xplorestaging.ieee.org/servlet/opac?punumber=8742745 More » \nPublisher: Wiley-IEEE Press IEEE Account Change Username/Password Update Address \nPurchase Details Payment Options Order History View Purchased Documents Profile and ? : -…",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:epqYDVWIO7EC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "A quasi-random multirate loss model supporting elastic and adaptive traffic under the bandwidth reservation policy",
            "Publication year": 2013,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.442.3722&rep=rep1&type=pdf#page=56",
            "Abstract": "In this paper, we propose a multirate teletraffic loss model of a single link that accommodates elastic and adaptive services whose calls come from a finite traffic-source population. This call arrival process is known as a quasi-random process and is used in traffic modelling when the number of users who generate traffic is relatively small compared to the system capacity. In-service elastic and adaptive calls can tolerate bandwidth compression by extending their remaining servicetime (elastic calls) or not (adaptive calls). In this loss system, we study the effect of the bandwidth reservation policy on time congestion probabilities, call congestion probabilities and link utilization. The bandwidth reservation policy is considered when a certain quality of service for each service-class is required and is essential to be guaranteed. The proposed model does not have a product form solution, and therefore we propose approximate but recursive formulas for the efficient calculation of the above mentioned performance measures. The accuracy and consistency of the proposed model are verified by simulation and is found to be quite satisfactory. Finally, we generalize the proposed model to include calls from both finite and infinite number of traffic sources.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Need of a semi-self evaluation scheme for education in Electrical/Computer Engineering in Europe",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCEELL.2008.019646",
            "Abstract": "Several studies have already been carried out worldwide on the Quality of (engineering) Education (QoE) and the Quality of Vocational Training (QoVOT) due to the urgency of reforms in both areas. However, these studies either refer to individual academic institutions or evaluate universities by comparing each other on a national basis only, or report loosely the general level of QoE within a country, or present the educational systems of different countries providing data without conclusions. Moreover, although most of these studies are carried out by independent experts, the resultant recommendations, in many cases, are not adopted by the academic institutes, unless the academic institutions are obliged by an accreditation board to adopt them. Taking the above into consideration, the aim of this paper is to propose a semi-self evaluation scheme for an in-depth evaluation of the QoE and QoVOT on a trans …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:ldfaerwXgEUC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Performance metrics in OFDM wireless networks under the bandwidth reservation policy",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-31254-1_30",
            "Abstract": "In this paper we study the downlink of an Orthogonal Frequency Division Multiplexing (OFDM) based cell that accommodates calls from different service-classes with different resource requirements. We assume that calls arrive in the system according to a Poisson process while the call admission is based on the Bandwidth Reservation (BR) policy. The BR policy is used for the reservation of subcarriers in favor of calls of high subcarrier requirements. To determine the most important performance metrics, i.e., Call Blocking Probabilities (CBP) and resource utilization in this system, we model it as a multirate loss model and propose recursive formulas which reduce the complexity of the calculations. The accuracy of the formulas is verified via simulation and found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:hMsQuOkrut0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Call-level performance modelling of elastic and adaptive service-classes",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4288709/",
            "Abstract": "We propose a new teletrafflc model for the calculation of link occupancy distribution and determine the call blocking probabilities and link utilization in a single-link multi-rate loss system. We consider  K  different service-classes, either of elastic or of adaptive type, that compete for the available link bandwidth under the complete sharing policy. Calls arrive to the link with several contingency bandwidth requirements that depend on thresholds, which indicate the total link occupied bandwidth. It is possible for a call, while in service with a certain bandwidth to reduce it, in order for new calls to be accepted in the link. The accuracy of the new model is verified by simulation results. Moreover, the proposed model performs much better than the existing model for elastic and adaptive traffic.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Call blocking probabilities for Poisson traffic under the multiple fractional channel reservation policy",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7573910/",
            "Abstract": "In this paper, we study the performance of the Multiple Fractional Channel Reservation (MFCR) policy, which is a bandwidth reservation policy that allows the reservation of real (not integer) number of channels in order to favor calls of high channel (bandwidth) requirements. We consider a link of fixed capacity that accommodates Poisson arriving calls of different service-classes with different bandwidth-per-call requirements. Calls compete for the available bandwidth under the MFCR policy. To determine call blocking probabilities, we propose approximate but recursive formulas based on the notion of reserve transition rates. The accuracy of the proposed method is verified through simulation.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of multirate loss systems supporting cooperative users with a probabilistic behavior",
            "Publication year": 2017,
            "Publication url": "https://www.jstage.jst.go.jp/article/transcom/advpub/0/advpub_2017EBP3017/_article/-char/ja/",
            "Abstract": "We consider a multirate loss system that accommodates several service-classes with cooperative and non-cooperative users, which generate random or quasi-random arriving calls (depending on the users population). The term “cooperative” refers to users that can retry (with a certain probability, when the total occupied bandwidth of the system is below a predefined threshold) to be connected in the system with a reduced bandwidth, if they are blocked with their initial peak-bandwidth requirement. This behavior increases the quality of service (QoS) perceived by other users. Due to the retries, the system model does not have a product form solution for the steady state distribution. However, we propose an efficient calculation of system’s occupancy distribution, congestion probabilities and system’s utilization, while avoiding complex state space enumeration and processing. As it is shown through simulation, the proposed recursive formulas are consistent and quite accurate. For evaluation, we use the conventional trunk/bandwidth reservation control to equalize the congestion probabilities and compare them with the results of the proposed models. Besides, we generalize the proposed models by considering the coexistence of random and quasi-random arrivals. Furthermore, we propose (a) a heuristic method for the determination of desired retry probabilities according to a fairness index and (b) an optimization procedure whereby we assess the retry threshold so that the QoS of the least speed non-cooperative calls is guaranteed for certain retry probabilities of cooperative calls.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:p2g8aNsByqUC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Performance Evaluation of the Threshold Call Admission Policy in Multi-rate Loss Systems",
            "Publication year": 2020,
            "Publication url": "https://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-8cd520bd-b368-4f76-9432-b17887f7e405",
            "Abstract": "In this paper we consider a link, characterized by specific capacity, that services multi-rate random or quasirandom traffic. Random traffic is generated by an infinite number of traffic sources, while quasi-random traffic is generated by a finite population of traffic sources. The link is modeled as a multi-rate loss system. Handover and new calls are distinguished. New calls compete for the available bandwidth under a threshold call admission policy. In that policy, a new call of a particular service-class is not allowed to enter the system if the in-service handover and new calls of the same service-class plus the new call, exceed a predefined threshold (which can be different for each service-class). On the other hand, handover calls compete for the available bandwidth based on the complete sharing policy. We show that the steady state probabilities in the proposed models have a product form solution (PFS). The PFS leads to a convolution algorithm for accurate calculation of congestion probabilities and link utilization.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:M7yex6snE4oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Qos guarantee in the erlang multirate loss model based on derivatives of blocking probabilities",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5580312/",
            "Abstract": "We consider a single-link loss system of capacity C bandwidth units, accommodating K service-classes of Poisson traffic with different bandwidth-per-call requirements. Calls of all service-classes compete for the available link bandwidth under the bandwidth reservation (BR) policy. The BR policy is used in teletraffic engineering in order to achieve call blocking probability (CBP) equalization among different service classes. Such a single-link loss system has been analytically described by the Erlang Multirate Loss Model under the BR policy (EMLM/BR). In this paper, we focus on the problem of determining, in an efficient analytical way, derivatives of blocking probabilities with respect to offered traffic-load of any service-class under the BR policy. We further show through an analytical formula how CBP derivatives can be used to determine approximate CBP when small variations of offered traffic-load are considered.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A batched Poisson multirate loss model supporting elastic traffic under the bandwidth reservation policy",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962734/",
            "Abstract": "We present a new loss model for the call-level analysis of a single link, which accommodates calls of different service-classes with elastic bandwidth requirements. Calls arrive in the link according to a Batch Poisson process, a process that can be used to model traffic, which is more 'peaked' and 'bursty' than the Poisson process. The available link bandwidth is shared to calls according to the Bandwidth Reservation policy, whereby we can guarantee certain Quality-of-Service for each service-class. In the proposed model, we assume a general batch size distribution and the Partial Batch Blocking discipline. According to this discipline, one or more calls of an arriving batch can be accepted, while the rest can be discarded, depending on the available link bandwidth. New and in-service calls tolerate bandwidth compression/expansion. The analysis of the system is based on Markov chains. Since no Product Form …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of a C-RAN supporting a mixture of random and quasi-random traffic",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-020-02301-7",
            "Abstract": "In this paper we consider a cloud radio access network (C-RAN) where the remote radio heads (RRHs) are separated from the baseband signal processing servers, named baseband units (BBUs). The latter forms a centralized pool of high-performance data center resources. To benefit from network function virtualization, we consider virtualized BBU (V-BBU) resources where the BBU functionality and services have been virtualized in the form of virtual network functions. All RRHs in the C-RAN form a single cluster. Each RRH of such a cluster may accommodate random or quasi-random traffic. That means that new calls in a RRH can be generated by an infinite number of mobile users (random traffic) or by a finite number of mobile users (quasi-random traffic). An arriving call requires a radio resource unit from the serving RRH and a computational resource unit from the V-BBU. If these resource units are available …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:LI9QrySNdTsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "On code reservation in multi-rate OCDMA passive optical networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6292722/",
            "Abstract": "We present an analytical model for the determination of blocking probabilities in an OCDMA Passive Optical Network (PON) that accommodates multiple service-classes, under a code reservation policy. The analysis considers fixed-length and fixed-weight codewords, while the provision of multi-rate differentiation is realized through the application of the parallel mapping technique. The user activity and different sources of additive noise are incorporated in our study. The model accuracy is completely satisfactory and is verified through simulation.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:tkaPQYYpVKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "QoS equalization in the connection dependent threshold model",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=8895268875504651733&hl=en&oi=scholarr",
            "Abstract": "We consider a single-link loss system with fixed bandwidth capacity carrying K service-classes of Poisson traffic with elastic properties. We focus on the problem of equalizing the call blocking probabilities (CBPs) among the service-classes based on the Connection Dependent Threshold Model",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of a Dynamic Wavelength Allocation protocol in WDM-TDM PONs servicing Pareto ON-OFF traffic",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6876420/",
            "Abstract": "Hybrid Wavelength-Time Division Multiplexing (WDM-TDM) Passive Optical Networks (PONs) become strong candidates for Next Generation PONs and, therefore, merit deep performance evaluation. In this paper, we concentrate on the performance of a Dynamic Wavelength Allocation (DWA) protocol, under multi-dimensional traffic which is modeled by a Pareto ON-OFF model; it resembles the bursty nature of traffic by considering ON and OFF transmission periods, whose duration is Pareto distributed. The investigated protocol may cause service delay to existing connections, if they will be found in state OFF, while no connection is found in state ON at the same time. In this case, the occupied wavelength is released, and a new wavelength (however, not always available, hence the delay) will be allocated to OFF connections, upon request from a connection to return to state ON. The delay caused by the so-called …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Simplified Blocking Probability Calculation in the Retry Loss Models for Finite Sources",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=6231804545218030587&hl=en&oi=scholarr",
            "Abstract": "We consider the single and multi-retry loss models for finite sources (f-SRM, f-MRM, respectively) in which calls of K service-classes are accommodated in a link of capacity C and compete for the available bandwidth under the complete sharing (CS) policy. Blocked calls can immediately retry one or more times to be connected in the system with reduced bandwidth and increased service time requirements. In both f-SRM and f-MRM the calculation of the link occupancy distribution can be quite complex since it requires enumeration and processing of the state space. To simplify this calculation and consequently the calculation of blocking probabilities, we present an approximate method based on the corresponding retry loss models of infinite sources. Simulation results verify the method’s accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applicability of the extensions of the Erlang multirate loss model on ABR services in ATM networks",
            "Publication year": 2000,
            "Publication url": "https://www.ee.ucl.ac.uk/lcs/previous/LCS2000/lcs049.pdf",
            "Abstract": "In this paper, we evaluate three extensions of the Erlang Multirate Loss Model by comparing them, based on the resultant call blocking probabilities for ABR services in ATM networks. In the first extension, the retry models, blocked calls can retry with reduced resource requirements and increased arbitrary mean residency requirements. In the second one, the threshold models, request sizes and residency times are state dependent. We propose a third extension, the connection-dependent threshold model, which resembles the threshold models, but the state dependency is individualized among call connections. Our investigation shows that the retry models can hardly approach the behavior of ABR services, while the proposed model performs much better than the other two extensions.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Call-level Analysis of Hybrid WDM-OCDMA Passive Optical Networks with Finite Traffic Sources",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/43947679/Call-level_20Analysis_20of_20Hybrid_20WDM-OCDMA_20Passive_20Optical_20Networks_20with_20Finite_20Traffic_20Sources.pdf",
            "Abstract": "Passive Optical Network (PONs) are becoming a mature concept for the provision of enormous bandwidth to endusers with low cost. In this paper we study the call-level performance of two PON configurations: the OCDMA-PON and the Hybrid WDM-OCDMA PON. We propose analytical models for calculating connection failure probabilities (due to unavailability of a wavelength) and call blocking probabilities (due to the total interference on a call that may exceed a permissible threshold) in the upstream direction. The PONs are described/modeled by one-dimensional Markov chains. By solving them, we derive recurrent formulas for the blocking probabilities. The proposed analytical models are validated through simulation; their accuracy was found to be absolutely satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New algorithm for the Generalized Max-Min fairness policy based on linear programming",
            "Publication year": 2005,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e88-b_2_775",
            "Abstract": "The Generalized Max-Min Fairness policy (GMM) allocates in a fair way the available bandwidth among elastic calls by taking into account their minimum and maximum rate requirements. The GMM has been described in a five-step procedure, which has the advantage of an easy presentation, but does not come into details, as far as its computer implementation is concerned, and fails to describe the policy in a clear mathematical way. We propose a new algorithm for the GMM policy, in a clear mathematical way, based on Linear Programming (LP). The new algorithm is directly convertible into software. Numerical examples clarify our algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:5nxA0vEk-isC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Congestion probabilities of elastic and adaptive calls in Erlang-Engset multirate loss models under the threshold and bandwidth reservation policies",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128615003205",
            "Abstract": "In this paper, we consider a single link of fixed capacity that accommodates calls of different service-classes with different bandwidth-per-call requirements. The link behaves as a multirate loss system. Calls of each service-class arrive in the link according to a Poisson (random) or a quasi-random process and have an exponentially distributed service time. Poisson or quasi-random arriving calls are generated by an infinite or finite number of traffic sources, respectively. Service-classes are also distinguished according to the behavior of in-service calls, in elastic and adaptive service-classes. Elastic calls can compress their bandwidth by simultaneously increasing their service time. Adaptive calls tolerate bandwidth compression without affecting their service time. All calls compete for the available link bandwidth under the combination of the Threshold (TH) and the Bandwidth Reservation (BR) policies. The TH policy …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:NhqRSupF_l8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multirate Elastic Adaptive Retry Loss Models",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742755/",
            "Abstract": "This chapter considers multirate loss models of random arriving calls not only with elastic bandwidth requirements upon arrival but also elastic bandwidth allocation during service. Calls may retry several times upon arrival, requiring less bandwidth each time, in order to be accepted for service. If call admission is not possible with the last (least) bandwidth requirement then bandwidth compression is attempted. Compared to the elastic single‐retry model under the BR Policy, in the elastic multi‐retry model (E‐MRM) under the BR policy with BR parameter t k  for service‐class  k  calls, blocked calls of service‐class  k  can retry more than once to be connected in the system. The call admission in the elastic adaptive multi‐retry model is the same as the E‐MRM with the exception that adaptive calls do not alter their service time when their bandwidth is compressed/expanded.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "International Journal on Advances in Telecommunications Volume 4, Number 1 & 2, 2011",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.225.3116&rep=rep1&type=pdf",
            "Abstract": "International Journal on Advances in Telecommunications Volume 4, Number 1 & 2, 2011 Page \n2 The International Journal on Advances in Telecommunications is published by IARIA. ISSN: \n1942-2601 journals site: http://www. iariajournals. org contact: petre@ iaria. org Responsibility \nfor the contents rests upon the authors and not upon IARIA, nor on IARIA volunteers, staff, or \ncontractors. IARIA is the owner of the publication and of editorial aspects. IARIA reserves the \nright to update the content for quality improvements. Abstracting is permitted with credit to the \nsource. Libraries are permitted to photocopy or print, providing the reference is mentioned \nand that the resulting material is made available at no cost. Reference should mention: \nInternational Journal on Advances in Telecommunications, issn 1942-2601 vol. 4, no. 1 & 2, \nyear 2011, http://www. iariajournals. org/telecommunications/ The copyright for each paper . …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A convolution algorithm for a multirate loss system with Poisson arrivals and a threshold call admission policy",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8471771/",
            "Abstract": "In this paper we study a single link, modelled as a loss system, that accommodates Poisson traffic originated from different service-classes. Calls of a service-class are distinguished to new and handover calls. New calls compete for the available link bandwidth under a threshold call admission policy. In this policy, new calls of a service-class are not allowed to enter the system if the number of in-service new and handover calls of the same service-class plus the new call, exceeds a threshold (different for each service-class). On the other hand, handover calls compete for the available link bandwidth under the complete sharing policy. The steady state probabilities in this model have a Product Form Solution (PFS). Due to the existence of a PFS, a convolution algorithm is proposed for the accurate calculation of call blocking probabilities and link utilization.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Call blocking probabilities in a W-CDMA cell with interference cancellation and bandwidth reservation",
            "Publication year": 2014,
            "Publication url": "https://www.ieice.org/publications/proceedings/summary.php?expandable=8&iconf=ICTF&session_num=COMM1&number=COMM1-4&year=2014",
            "Abstract": "In this paper, we study a multirate loss model for the calculation of Call Blocking Probabilities (CBP) in a W-CDMA cell that accommodates Poisson arriving calls of different service-classes under the Bandwidth Reservation (BR) policy. The latter is used to equalize CBP among service-classes or achieve a certain QoS. The proposed model takes into account multiple access interference, the notion of local (soft) blocking, user’s activity and interference cancellation. Due to the existence of local blocking and the BR policy the steady state probabilities of the model do not have a product form solution. However, we show that the CBP calculation is based on an approximate but recursive formula whose accuracy is verified through simulation and found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "An On-Off Multirate Loss Model of Poisson Traffic under the Bandwidth Reservation Policy.",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=7917853997890852463&hl=en&oi=scholarr",
            "Abstract": "We consider an ON-OFF multirate loss model in a single link under the bandwidth reservation (BR) policy (ON-OFF/BR). Poisson arriving ON-OFF calls of different service-classes enter the system via state ON and may alternate between states ON and OFF. When a call passes to state OFF it releases the bandwidth held in state ON which becomes available for new arrivals. When the call tries to return to state ON it re-requests its bandwidth. If it is available a new burst begins; otherwise, the burst is blocked and the call remains in state OFF. We calculate call blocking probabilities (CBP) of the service-classes under the BR policy, in order to benefit high speed calls. We also calculate burst blocking probabilities (BBP) of the service-classes. The proposed ON-OFF/BR model does not have a product form solution and therefore the CBP and BBP calculation is based on approximate formulas. Simulation results validate …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Blocking analysis in hybrid TDM-WDM PONs supporting elastic traffic",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4545558/",
            "Abstract": "The passive optical network (PON) is an attractive solution for delivering services with numerous applications, such as high-definition video, video conferencing and data traffic. In this paper we develop teletraffic loss models for calculating connection failure probabilities (due to unavailability of a wavelength) and call blocking probabilities (due to the restricted bandwidth capacity of a wavelength) in hybrid TDM-WDM PONs with dynamic wavelength allocation. We consider either stream or elastic traffic. The proposed models are derived from one-dimensional Markov chains which describe the service system in the PON. The wavelengths occupancy in the PON is also provided. The accuracy of the proposed models is validated by simulation and was found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multirate Retry Threshold Loss Models",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742753/",
            "Abstract": "This chapter considers multirate loss models of random arriving calls with elastic bandwidth requirements and fixed bandwidth allocation during service. Calls may retry several times upon arrival (requiring less bandwidth each time) in order to be accepted for service. Alternatively, calls may request less bandwidth upon arrival, according to the occupied link bandwidth indicated by threshold(s). In the single‐retry model (SRM) under the BR policy, t k  b.u. are reserved to benefit calls of all other service‐classes apart from service‐class  k . The application of the BR policy in the SRM is similar to that of the EMLM/BR. In the connection dependent threshold model (CDTM) under the BR policy, t k  b.u. are reserved to benefit calls of all other service‐classes apart from service‐class  k . The application of the BR policy in the CDTM is similar to that of the MTM/BR.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "WannaCry ransomware: Analysis of infection, persistence, recovery prevention and propagation mechanisms",
            "Publication year": 2019,
            "Publication url": "http://yadda.icm.edu.pl/yadda/element/bwmeta1.element.baztech-889d4f5a-9a65-4ba4-854d-31f810fd5ab1",
            "Abstract": "In recent years, we have been experiencing fast proliferation of different types of ransomware targeting home users, companies and even critical telecommunications infrastructure elements. Modern day ransomware relies on sophisticated infection, persistence and recovery prevention mechanisms. Some recent examples that received significant attention include WannaCry, Petya and BadRabbit. To design and develop appropriate defense mechanisms, it is important to understand the characteristics and the behavior of different types of ransomware. Dynamic analysis techniques are typically used to achieve that purpose, where the malicious binaries are executed in a controlled environment and are then observed. In this work, the dynamic analysis results focusing on the infamous WannaCry ransomware are presented. In particular, WannaCry is examined, during its execution in a purpose-built virtual lab environment, in order to analyze its infection, persistence, recovery prevention and propagation mechanisms. The results obtained may be used for developing appropriate detection and defense solutions for WannaCry and other ransomware families that exhibit similar behaviors.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mediator-assisted multi-source routing in information-centric networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7573905/",
            "Abstract": "Among the new communication paradigms recently proposed, information-centric networking (ICN) is able to natively support content awareness at the network layer shifting the focus from hosts (as in traditional IP networks) to information objects. In this paper, we exploit the intrinsic content-awareness ICN features to design a novel multi-source routing mechanism. It involves a new network entity, the ICN mediator, responsible for locating and delivering the requested information objects that are chunked and stored at different locations. Our approach imposes very limited signalling overhead, especially for large chunk sizes (MBytes). Simulations show significant latency reduction compared to traditional routing approaches.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "QoS equalization in a multirate loss model of elastic and adaptive traffic with retrials",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Moscholios/publication/317015322_QoS_Equalization_in_a_Multirate_Loss_Model_of_Elastic_and_Adaptive_Traffic_with_Retrials/links/591f11fc0f7e9bd09ea356c7/QoS-Equalization-in-a-Multirate-Loss-Model-of-Elastic-and-Adaptive-Traffic-with-Retrials.pdf",
            "Abstract": "In this paper, we consider a single-link modeled as a loss system, which accommodates multirate traffic of elastic and adaptive calls. Calls arrive in the link according to a Poisson process, have a peak-bandwidth requirement while their service time is exponentially distributed. If the available link bandwidth is lower than the peak-bandwidth requirement of a new call, then the call can retry to be connected in the link with reduced bandwidth, one or more times (single/multi-retry loss model). If the available link bandwidth is still lower than the last bandwidth requirement of the call, then the call can be accepted in the link by compressing the bandwidth of all inservice calls (of all service-classes) together with its last bandwidth requirement. In this multirate loss system, we study the effect of the bandwidth reservation (BR) policy on Call Blocking Probabilities (CBP) and link utilization. The BR policy achieves CBP equalization among calls of different service-classes, or guarantees a certain quality of service for each service-class. The proposed single/multi-retry loss models under the BR policy do not have a product form solution, and therefore we propose approximate recursive formulas for the efficient calculation of CBP and link utilization. Simulation results validate the results obtained by the analytical models.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "International Journal on Advances in Telecommunications Volume 3, Number 1 & 2, 2010",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.439.4216&rep=rep1&type=pdf",
            "Abstract": "International Journal on Advances in Telecommunications Volume 3, Number 1 & 2, 2010 Page \n2 The International Journal on Advances in Telecommunications is published by IARIA. ISSN: \n1942-2601 journals site: http://www. iariajournals. org contact: petre@ iaria. org Responsibility \nfor the contents rests upon the authors and not upon IARIA, nor on IARIA volunteers, staff, or \ncontractors. IARIA is the owner of the publication and of editorial aspects. IARIA reserves the \nright to update the content for quality improvements. Abstracting is permitted with credit to the \nsource. Libraries are permitted to photocopy or print, providing the reference is mentioned \nand that the resulting material is made available at no cost. Reference should mention: \nInternational Journal on Advances in Telecommunications, issn 1942-2601 vol. 3, no. 1 & 2, \nyear 2010, http://www. iariajournals. org/telecommunications/ The copyright for each paper . …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the calculation of blocking probabilities in the multirate state-depedent loss models for finite sources",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=130199430414099416&hl=en&oi=scholarr",
            "Abstract": "We consider a single link loss system of capacity C which accommodates calls of K different service-classes. Calls of each service-class come from finite sources and compete for the available link bandwidth under the complete sharing (CS) policy. This system is described by the Engset multirate loss model (EnMLM). We also consider that blocked calls can immediately retry one or more times to be connected in the system with reduced bandwidth and increased service time requirements; this is the case of the single or multi-retry finite source models (f-SRM, f-MRM, respectively. Furthermore, we consider the threshold models, namely the single-threshold, multi-threshold and the connection dependent threshold models for finite sources (f-STM, f-MTM and f-CDTM, respectively) in which calls, prior to being blocked, may adjust their traffic requirements according to a set of thresholds which can be common to all …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An analytical framework in ofdm wireless networks servicing random or quasi-random traffic",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/591602",
            "Abstract": "We consider the downlink of an orthogonal frequency division multiplexing (OFDM)-based cell that services calls from many service-classes. The call arrival process is random (Poisson) or quasi-random, ie, calls are generated by an infinite or a finite number of sources, respectively. In order to determine congestion probabilities and resource utilization, we model the cell as a multirate loss model. Regarding the call admission, we consider the restricted accessibility, the bandwidth reservation (BR), and the complete sharing (CS) policies. In a system of restricted accessibility, a new call may be blocked even if resources do exist. In a BR system, subcarriers can be reserved in favor of calls of high subcarrier requirements. Finally, in a CS system, a new call is blocked due to resource unavailability. In all three policies, we show that there exist recursive formulas for the determination of the various performance measures. Based on simulation, the accuracy of the proposed formulas is found to be quite satisfactory. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "International Journal On Advances in Telecommunications Volume 1, Number 1, 2008",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.153.9598&rep=rep1&type=pdf",
            "Abstract": "With this 2008, Vol. 1 No. 1, we open a long series of hopefully interesting and useful articles on advanced topics covering both industrial tendencies and academic trends. The publication is byinvitation-only and implies a second round of reviews, following the first round of reviews during the paper selection for the conferences.Starting with 2009, quarterly issues are scheduled, so the outstanding papers presented in IARIA conferences can be enhanced and presented to a large scientific community. Their content is freely distributed from the www. iariajournals. org and will be indefinitely hosted and accessible to everybody from anywhere, with no password, membership, or other restrictive access.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A single retry multirate loss model for impatient calls",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9249569/",
            "Abstract": "We consider a link that services Poisson arriving calls from different service-classes. Calls have a peak-bandwidth requirement and an exponentially distributed service time. If there is no available bandwidth in the link, a call is blocked but retries with a lower bandwidth requirement at the cost of an increased service time. To allow for the fact that a blocked call may leave the link due to impatience, we consider the case that a blocked call retries with a probability. To determine call blocking probabilities, we prove an approximate but recursive formula which provides quite satisfactory results compared to simulation.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:Dip1O2bNi0gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Toward information-centric software-defined cellular networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8000045/",
            "Abstract": "The concept of software-defined networking (SDN) is able to offer important advantages over the traditional communication paradigms. This is achieved by decoupling the decision-making process from the underlying network infrastructure that forwards the traffic. Recently, there have been efforts in applying the SDN approach to wireless and cellular networks. In fact, SDN is considered as one of the key enablers for future 5G communication networks. Information-centric networking (ICN) is another emerging communication paradigm that has been proposed to improve the content delivery efficiency compared to the traditional host-centric communication protocols. ICN decouples the data from their location, application, and means of transportation. This feature makes ICN particularly suitable for efficient dissemination of large volumes of data, especially in highly dynamic and heterogeneous mobile environments. In …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A batch‐type time‐true ATM‐network simulator—design for parallel processing",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.560",
            "Abstract": "This paper presents a new type of network simulator for simulating the call‐level operations of telecom networks and especially ATM networks. The simulator is a pure time‐true type as opposed to a call‐by‐call type simulator. It is also characterized as a batch‐type simulator. The entire simulation duration is divided into short time intervals of equal duration, t. During t, a batch processing of call origination or termination events is executed and the time‐points of these events are sorted. The number of sorting executions is drastically reduced compared to a call‐by‐call simulator, resulting in considerable timesaving. The proposed data structures of the simulator can be implemented by a general‐purpose programming language and are well fitted to parallel processing techniques for implementation on parallel computers, for further savings of execution time. We have first implemented the simulator in a sequential …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:u_35RYKgDlwC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Delay analysis of converged optical-wireless networks with quality of service support",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/document/6942336/",
            "Abstract": "The convergence of two popular access technologies, namely Worldwide interoperability for Microwave Access (WiMAX) and passive optical network (PON) is a promising access solution that combines the mobility feature of WiMAX and the ample bandwidth of PONs. In such a converged optical-wireless access network, the provision of quality of service (QoS) support is a challenging issue, mainly because of the different bandwidth allocation mechanisms of the two access technologies. Since the considered convergence seems to be dominant, it deserves assiduous analysis and evaluation. In this study, the authors investigate the delay performance of a converged optical-wireless network that provides QoS support by considering multiple service-classes with different priorities. In the wireless domain, the IEEE 802.16 standard is applied, whereas in the optical domain a wavelength division multiplexing ethernet …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IET"
        },
        {
            "Title": "Retry loss models supporting elastic traffic",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/John-Vardakas/publication/232259133_1_Retry_Loss_Models_Supporting_Elastic_Traffic/links/0046352de615d00917000000/1-Retry-Loss-Models-Supporting-Elastic-Traffic.pdf",
            "Abstract": "We consider a single-link loss system of fixed capacity, which accommodates K service-classes of Poisson traffic with elastic bandwidth-per-call requirements. When a new call cannot be accepted in the system with its peak-bandwidth requirement, it can retry one or more times (single and multiretry loss model, respectively) to be connected in the system with reduced bandwidth requirement and increased service time, exponentially distributed. Furthermore, if its last bandwidth requirement is still higher than the available link bandwidth, it can be accepted in the system by compressing not only the bandwidth of all in-service calls (of all service-classes) but also its last bandwidth requirement. The proposed model does not have a product form solution and therefore we propose an approximate recursive formula for the calculation of the link occupancy distribution and consequently call blocking probabilities. The accuracy of the proposed formula is verified by simulation and is found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Poznan University of Technology"
        },
        {
            "Title": "Mitigating distributed denial-of-service attacks in named data networking",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Vassilios-Vassilakis/publication/302878160_Mitigating_Distributed_Denial-of-Service_Attacks_in_Named_Data_Networking/links/5757220608ae05c1ec16cf53/Mitigating-Distributed-Denial-of-Service-Attacks-in-Named-Data-Networking.pdf",
            "Abstract": "Named Data Networking (NDN) is a novel networking approach that aims at overcoming some of the limitations of the current Internet. In particular, NDN aims at providing better privacy and security by focusing on the data items themselves rather than on the location of data. This is achieved by using soft states at the routers, which record the requests/interests for data from users in the Pending Interest Table (PIT). However, this new networking concept opens up avenues for launching Distributed Denial-of-Service (DDoS) attacks on PITs. That is, an attacker may flood the network with a large number of Interest packets that would overflow the PITs at the routers, thus preventing legitimate users from receiving the requested data. This type of DDoS attack is known as the Interest Flooding Attack (IFA) and, if not adequately dealt with, may severely disrupt the normal operation of an NDN system. In this paper, we first show that the basic NDN mechanism is vulnerable to IFA even when the attacker has very limited resources. Next, we propose a mitigation technique that allows routers to quickly identify and block such DDoS attempts, by detecting anomalous user behaviour. We also introduce an additional security layer by using public-key based router authentication. We evaluate our proposed scheme by means of computer simulations and show that a sufficient level of security can be achieved with little processing and storage overhead.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The extended connection‐dependent threshold model for call‐level performance analysis of multi‐rate loss systems under the bandwidth reservation policy",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.1292",
            "Abstract": "Firstly, we reviewed two extensions of the Erlang multi‐rate loss model, whereby we can assess the call‐level QoS of telecom networks supporting elastic traffic: (i) the extended Erlang multi‐rate loss model, where random arriving calls of certain bandwidth requirements at call setup can tolerate bandwidth compression while in service; and (ii) the connection‐dependent threshold model, where arriving calls may have several contingency bandwidth requirements, whereas in‐service calls cannot tolerate bandwidth compression. Secondly, we proposed a new model, the extended connection‐dependent threshold model. Calls may have alternative bandwidth requirements at call setup and can tolerate bandwidth compression while in service. We proposed a recurrent formula for the efficient calculation of link occupancy distribution and consequently call blocking probabilities, link utilization, and throughput per …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:isC4tDSrTZIC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Call-level Multi-rate Loss Models for Elastic Traffic",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/43947674/4._20Call-level_20Multi-rate_20Loss_20Models_20for_20Elastic_20Traffic_20FITCE_202006.pdf",
            "Abstract": "Multi-rate teletraffic models aim at the call-level QoS assessment of modern telecom networks. This assessment is important for the bandwidth allocation among serviceclasses, the avoidance of too costly over-dimensioning of the network and the prevention, through traffic engineering mechanisms, of excessive throughput degradation. Despite of its importance, the call-level QoS evaluation remains an open issue, due to the presence of elastic traffic in modern telecom networks.In this paper we consider elastic traffic in connectionoriented networks at call level, ie a) calls which have contingency alternative bandwidth requirements at the call setup phase and b) the ability of in-service calls to reduce their bandwidth (elastic bandwidth), while increasing simultaneously their service time. According to the call arrival process, the bandwidth requirements of calls and their behavior during their lifetime, we distinguish the study of multi-service loss models into four categories: A: Random arriving calls with either fixed or elastic bandwidth requirements, and constant use of their assigned bandwidth (constant-bit-rate) during their lifetime. B: Random arriving calls with either fixed or elastic bandwidth requirements, and elastic bandwidth during their lifetime.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Principles of Operations Research Principles of Operations Research, 1969",
            "Publication year": 2000,
            "Publication url": "https://ci.nii.ac.jp/naid/10006498977/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について <no title> WAGNER HW \n被引用文献: 1件 著者 WAGNER HW 収録刊行物 Principles of Operations Research Principles \nof Operations Research, 1969 Prentice Hall 被引用文献: 1件中 1-1件を 表示 1 Path Bandwidth \nManagement for Large Scale Telecom Networks LOGOTHETIS Michael D. , KOKKINAKIS \nGeorge K. IEICE transactions on communications 83(9), 2087-2099, 2000-09-25 参考文献\n19件 被引用文献3件 Tweet 各種コード NII論文ID(NAID) 10006498977 資料種別 図書全体 データ\n提供元 CJP引用 書き出し RefWorksに書き出し EndNoteに書き出し Mendeleyに書き出し Refer…",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Loss models in traffic-groomed WDM all-optical networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4610831/",
            "Abstract": "The performance evaluation of wavelength division multiplexing (WDM) all-optical networks becomes an exceptionally important research topic, especially when the traffic grooming technique is used. In this paper we develop analytical loss models for calculating route establishment failure probabilities and call blocking probabilities in traffic-groomed WDM networks. We consider both single optical links and mesh all-optical networks with wavelength conversion capabilities. For single links, the proposed models are based on Markov chains and well-established teletraffic models, while, for mesh all-optical networks, they are also based on a reduced load approximation method (RLA). Their recursive nature makes them computationally efficient. In the input process of the models we assume that traffic is originated from service-classes with either infinite or finite traffic-source population. We demonstrate the accuracy …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On call blocking probabilities and resource utilization in OFDM wireless networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8471839/",
            "Abstract": "In this paper we consider the downlink of an Orthogonal Frequency Division Multiplexing (OFDM) based cell that accommodates Poisson arriving calls generated from different service-classes and having different traffic description parameters. The system is modelled as a multirate loss model. To determine Call Blocking Probabilities (CBP) and resource utilization in this system, we propose a recursive formula which reduces substantially the complexity of the calculations. This fact makes the formula attractive for network planning and dimensioning procedures. Besides, as we show in this paper, the proposed formula can be used as the springboard for the analysis of more complicated subcarrier sharing policies, such as the Multiple Fractional Channel Reservation (MFCR) policy. The MFCR policy can be used for the reservation of subcarriers in order to reduce CBP and therefore favor calls of high subcarrier …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Erlang multirate loss model with Batched Poisson arrival processes under the bandwidth reservation policy",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366410002173",
            "Abstract": "The Erlang Multirate Loss Model (EMLM) has been widely used as a springboard in the study of multirate loss systems. In this paper, we study an extension of the EMLM in order to ensure QoS guarantee per service-class in the heterogeneous environment of telecom networks. The proposed model is named Batched Poisson EMLM under Bandwidth Reservation (BR) policy (BP-EMLM/BR), since its input process is a Batched Poisson arrival process; that is, calls of each service-class arrive to a fixed-capacity link as batches. The distribution of the batch size can be general. The batch blocking discipline is the partial batch blocking, i.e. depending on the available link bandwidth, a part of an arriving batch can be accepted while the rest of it is discarded. The Call Admission Control is based on the BR policy, whereby we can achieve our goal to guarantee specific QoS for each service-class at call-level. In order to …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A cache-aware routing scheme for information-centric networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6923921/",
            "Abstract": "In recent years, the information-centric networking (ICN) concept has been attracting increasing attention of the research community. The aim is to overcome intrinsic inefficiencies of the existing host-to-host communication paradigm, as well as to provide new and enhanced services to mobile and fixed users. A key feature of ICN is the support for in-network content caching. In this paper, we present a new cache-aware routing scheme for ICN. Our scheme takes into account the information about the locations of caches in the network and constructs delivery paths for efficient content dissemination. The proposed approach does not impose additional signaling overhead in the network; while at the same time it is agnostic of the cached contents. The performance of the proposed scheme is verified by simulation studies, which show an up to 50% delay reduction compared to traditional routing approaches.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "AICT 2009",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5072389/",
            "Abstract": "The following topics are dealt with: radio networks; quality of service; traffic engineering; computer networks; telecommunication network management; signal processing; modulation; multimedia communication; optical communication; antennas; electromagnetic wave propagation; protocols; software tools; codes; broadband communications; and telecommunication network planning.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teletraffic Models of Batched Poisson Input",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742752/",
            "Abstract": "Teletraffic Models of Batched Poisson Input - Wiley-IEEE Press books IEEE.org IEEE Xplore \nIEEE-SA IEEE Spectrum More Sites Create Account Personal Sign In Personal Sign In For IEEE \nto continue sending you helpful information on our products and services, please consent to \nour updated Privacy Policy. I have read and accepted the IEEE Privacy Policy. Accept & Sign In \nEmail Address Password Sign In Forgot Password? Teletraffic Models of Batched Poisson Input \nArticle #: ISBN Information: Online ISBN: 9781119426974 Electronic ISBN: 9781119426912 \nElectronic ISBN: 9781119426905 Print ISBN: 9781119426882 INSPEC Accession Number: \nPersistent Link: https://xplorestaging.ieee.org/servlet/opac?punumber=8742745 More » \nPublisher: Wiley-IEEE Press IEEE Account Change Username/Password Update Address \nPurchase Details Payment Options Order History View Purchased Documents Profile and …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "A multirate batched Poisson loss model of ON-OFF traffic sources: Call-level performance evaluation",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.511.348&rep=rep1&type=pdf",
            "Abstract": "In this paper we consider an ON-OFF traffic model of a single link which accommodates service-classes whose calls arrive according to a batch Poisson process with generally distributed batch size. Calls of each serviceclass compete for the available link bandwidth under the complete sharing policy. The batch blocking discipline is the partial batch blocking, ie depending on the available bandwidth a part of the batch (one or more calls) is accepted. Accepted calls enter the system via state ON and can alternate between ON-OFF states. When a call is transferred to state OFF it releases its bandwidth in state ON, which becomes available to other calls. We show that the proposed batched Poisson ON-OFF (BP-ON-OFF) model has a product form solution and provide an accurate recursive formula for the determination of various call-level performance measures such as the time and call congestion probabilities. Furthermore we show the relation between the BP-ON-OFF model and other multirate loss models that exist in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Packet delay analysis for priority-based passive optical networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5369994/",
            "Abstract": "Passive optical network (PON) systems are rapidly becoming the most promising and cost-effective class of fiber access systems. In this paper we investigate the performance of a simple PON configuration, in respect of the end-to-end packet delay. The network supports multiple service-classes with priorities, in terms of the number of packets that can be transmitted in each transmission period. We calculate the mean queueing delay of a packet, by taking into account the fact that packets are serviced in batches. The queueing delay is defined through the formulation of two queuing models; an M/D/1 model for the batches, and an M/D/m model for the individual packets. We also study the effect of the packet arrival rate of different service-classes, and the effect of the distribution of the packets into a frame, on the end-to-end packet delay. The accuracy of the proposed model is validated by simulation and was found to …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiservice loss models for broadband telecommunication networks Multiservice loss models for broadband telecommunication networks, 1995",
            "Publication year": 2007,
            "Publication url": "https://ci.nii.ac.jp/naid/10026176764/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について <no title> ROSS Keith \nW. 被引用文献: 1件 著者 ROSS Keith W. 収録刊行物 Multiservice loss models for broadband \ntelecommunication networks Multiservice loss models for broadband telecommunication \nnetworks, 1995 Springer 被引用文献: 1件中 1-1件を 表示 1 An ON-OFF Multi-Rate Loss Model \nof Finite Sources MOSCHOLIOS Ioannis D. , LOGOTHETIS Michael D. , KOUKIAS Michael N. \nIEICE transactions on communications 90(7), 1608-1619, 2007-07-01 参考文献34件 大学共同\n利用機関シンポジウム Tweet 各種コード NII論文ID(NAID) 10026176764 資料種別 図書全体 に/| …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient multirate teletraffic loss models beyond Erlang",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=6VyHDwAAQBAJ&oi=fnd&pg=PR19&dq=info:e3S1Src8kMwJ:scholar.google.com&ots=mJHqiZlcw8&sig=8tIC-Kc5bEt_dyYSXJOPTkMG3dc",
            "Abstract": "A comprehensive study in efficient multi-rate teletraffic loss models used for designing, performance analysis, and optimization of systems and networks Efficient Multirate Teletraffic Loss Models Beyond Erlang is an easy-to-read book filled with numerous efficient teletraffic loss models. Presented in three sections—Teletraffic Models of Random Input, Teletraffic Models of Quasi-Random Input, and Teletraffic Models of Batched Poisson Input—it covers everything that a professional experienced with optimization and dimensioning of telecom networks could ever need to know. This unique book provides a detailed explanation on how efficient multirate teletraffic loss models are extracted and applied, and guides readers through almost all network technologies and services. Starting from the basics, it steadily increases in difficulty to keep the book self-contained and to provide a better understanding to those who might be new to the subject. It includes detailed explanations of the complex teletraffic models—many of which were developed by the authors. Tutorial examples, several backed by supplementary software, are accompanied by intermediate results and figures. Additionally, end-of-chapter applications describe the applicability of the models to modern network technologies, updating the incorporated teletraffic models of commercial packages/tools. Uses the classic EMLM (Erlang Multirate Loss Model) as its base to present a comprehensive range of teletraffic models through detailed explanation and numerical examples Filled with the authors’ own original teletraffic models—making for a wholly unique learning experience Offers a clear, self …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:9Nmd_mFXekcC",
            "Publisher": "John Wiley & Sons"
        },
        {
            "Title": "International Symposium on Communication Systems, Networks and DSP",
            "Publication year": 2008,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=20192266",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D03 Electronics/001D03F Semiconductor electronics. Microelectronics. Optoelectronics. Solid state devices/001D03F06 Integrated circuits/001D03F06B Integrated circuits by function (including memories and processors)",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teletraffic Models of Quasi‐Random Input",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742750/",
            "Abstract": "Teletraffic Models of Quasi‐Random Input - Wiley-IEEE Press books IEEE.org IEEE Xplore \nIEEE-SA IEEE Spectrum More Sites Create Account Personal Sign In Personal Sign In For IEEE \nto continue sending you helpful information on our products and services, please consent to \nour updated Privacy Policy. I have read and accepted the IEEE Privacy Policy. Accept & Sign In \nEmail Address Password Sign In Forgot Password? Teletraffic Models of Quasi‐Random Input \nArticle #: ISBN Information: Online ISBN: 9781119426974 Electronic ISBN: 9781119426912 \nElectronic ISBN: 9781119426905 Print ISBN: 9781119426882 INSPEC Accession Number: \nPersistent Link: https://xplorestaging.ieee.org/servlet/opac?punumber=8742745 More » \nPublisher: Wiley-IEEE Press IEEE Account Change Username/Password Update Address \nPurchase Details Payment Options Order History View Purchased Documents Profile and ? -…",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:EkHepimYqZsC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "Call level blocking of ON-OFF traffic sources with retrials under the complete sharing policy",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1388343703802305",
            "Abstract": "We study the coexistence of CBR services with bursty services of ON-OFF type, in a single link and evaluate the call blocking probabilities (CBP). Calls of each service arrive to the link according to a Poisson process and compete for its available bandwidth under the complete sharing policy. Blocked calls may retry one or more times to enter the system, with reduced bandwidth and increased mean service time requirements. An accepted call may alternate between states ON and OFF or remain always in state ON. Calls enter the system only via state ON. When a call is transferred to state OFF it releases the bandwidth holding in state ON which becomes available for new arriving calls. The new model does not have a product form solution and therefore the CBP calculation is based on approximate recursive formulas, proposed in this paper. Simulation results validate our analytical methodology.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:35N4QoGY0k4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Call Blocking Probabilities in a Two-Link Loss Model with Restricted Accessibility",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8848554/",
            "Abstract": "In this paper we study the impact of restricted accessibility in a system of two parallel links that accommodates Poisson arriving calls from a single service-class. In a restricted accessibility system, a new call may be blocked even if available bandwidth units do exist at the time of its arrival. In the two-link system, each particular link has a low and a high threshold. Both thresholds express the number of in-service calls in the link. The low threshold shows the point up to which the link can support offloaded calls from the other link. The high threshold shows the point where one link starts offloading calls to the other link. The two-link system with restricted accessibility is modelled as a loss model whose steady state probabilities do not have a product form solution. In order to determine the main teletraffic performance metric in this model which is call blocking probabilities, we propose an approximate method. The …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the digital certificate management in advanced metering infrastructure networks",
            "Publication year": 2017,
            "Publication url": "https://eprints.whiterose.ac.uk/119043/",
            "Abstract": "The smart grid (SG), generally referred to as the next-generation power system, is considered as a revolutionary and evolutionary regime of existing power grids. Among the emerging SG applications, the advanced metering infrastructure (AMI) enables automated, two-way communication between a smart meter (SM) and a public utility company. To authenticate a message, the sender (e.g., a SM) signs the message with its private key using a pre-defined digital signature algorithm. To verify the message, the recipient verifies the sender's certificate and then the sender's signature using the sender's public key. In some cases, however, a previously issued certificate for a network node needs to be revoked. In this paper we investigate two possible approaches for the certificate management of SMs in AMI networks. These are based on the traditional certificate revocation lists (CRLs) and on the Bloom filters. We compare the two approaches in terms of the required packet size for the distribution of the revoked certificate serial numbers. We also discuss the advantages and limitations of each approach.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:Y0pCki6q_DkC",
            "Publisher": "York"
        },
        {
            "Title": "Multirate Retry Loss Models Supporting Elastic Traffic of Quasi-Random Input",
            "Publication year": 2014,
            "Publication url": "https://www.ieice.org/publications/proceedings/summary.php?iconf=ICTF&session_num=COMM1&number=COMM1-5&year=2014",
            "Abstract": "We propose a teletraffic loss model of a single link that accommodates multirate service-classes of elastic calls. New calls arrive in the link according to a quasi-random process (calls are generated by a finite number of traffic sources), have elastic bandwidth requirements and an exponentially distributed service time. A new call is accepted in the system with its peak-bandwidth requirement if there is available link bandwidth. If not, the call retries one or more times (single and multi-retry loss model, respectively) to be accepted in the link with reduced bandwidth. If the available link bandwidth is lower than the call’s last bandwidth requirement, the call can still try to be connected in the link by compressing its last bandwidth requirement (down to a certain bandwidth) together with the bandwidth of all in-service calls. If, after compression, the call’s bandwidth exceeds the available link bandwidth, then the call is blocked …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:WA5NYHcadZ8C",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Congestion probabilities in W-CDMA networks supporting calls of finite sources",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Moscholios/publication/317014950_Congestion_probabilities_in_W-CDMA_networks_supporting_calls_of_finites_sources/links/591f0c47458515405963c4c7/Congestion-probabilities-in-W-CDMA-networks-supporting-calls-of-finites-sources.pdf",
            "Abstract": "We study a multirate teletraffic loss model for the calculation of time and call congestion probabilities in W-CDMA networks that accommodate calls of different service-classes whose arrival follows a quasi-random process. The latter is smoother than a Poisson process in the sense that calls come from a finite source population. The proposed model takes into account multiple access interference, the notion of local (soft) blocking, user’s activity and interference cancellation. Although the model does not have a product form solution, we show that the calculation of time and call congestion probabilities is based on approximate but recursive formulas whose accuracy is verified through simulation and found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Call-level performance modelling of elastic and adaptive service-classes with finite population",
            "Publication year": 2008,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e91-b_1_151",
            "Abstract": "The call-level performance modelling is a challenge in the highly heterogeneous environment of modern telecom networks, due to the presence of elastic traffic. In this paper, we review existing teletraffic loss models and propose a model for elastic traffic of service-classes with finite population (quasi-random call arrival process). Upon arrival, calls have contingency alternative bandwidth requirements that depend on thresholds which indicate the available/occupied link bandwidth (state dependent model). Calls are admitted under the complete sharing policy, and can tolerate bandwidth compression, while in-service. We prove a recurrent formula for the efficient calculation of the link occupancy distribution and consequently the call blocking probabilities and link utilization. The accuracy of the proposed model is verified by simulation and is found to be quite satisfactory. Comparative results with other existing …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:LPZeul_q3PIC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Evaluation of a call admission control scheme in W-CDMA cellular networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4610806/",
            "Abstract": "In this paper, we evaluate a call admission control (CAC) scheme suitable for W-CDMA cellular networks accommodating multiple service-classes. In such networks, the distinction between the new and the handoff traffic is very important. A simple CAC scheme can distinguish the calls between the two traffic types by setting different thresholds for call admission. This simple CAC scheme is evaluated in respect of blocking probabilities of both new and handoff calls. To this end, we formulate an aggregate Markov chain, which describes both the new-call and handoff-call arrival processes, under the assumption that they are both Poisson processes. Based on this Markov chain we derive recurrent and computationally efficient formulas for the calculation of the system state probabilities. Consequently, we calculate the new-call and handoff-call blocking probabilities. The analytical results are verified through simulation …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Erlang multirate loss model supporting elastic traffic under the threshold policy",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7249293/",
            "Abstract": "In this paper, we propose a multirate teletraffic loss model of a single link with certain bandwidth capacity that accommodates Poisson arriving calls, which can tolerate bandwidth compression (elastic traffic), under the threshold policy. When compression occurs, the service time of new and in-service calls increases. The threshold policy provides different QoS among service-classes by limiting the number of calls of a service-class up to a predefined threshold, which can be different for each service-class. Due to the bandwidth compression mechanism, the steady state probabilities in the proposed model do not have a product form solution. However, we approximate the model by a reversible Markov chain, and prove recursive formulas for the calculation of call blocking probabilities and link utilization. The accuracy of the proposed formulas is verified through simulation and found to be very satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Teletraffic-Theory and Applications Teletraffic-Theory and Applications, 1993",
            "Publication year": 2000,
            "Publication url": "https://ci.nii.ac.jp/naid/10006498979/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 \n出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について <no title> HARUO H. 被引用\n文献: 1件 著者 HARUO H. 収録刊行物 Teletraffic - Theory and Applications Teletraffic - Theory \nand Applications, 1993 Springer-Verlag 被引用文献: 1件中 1-1件を 表示 1 Path Bandwidth \nManagement for Large Scale Telecom Networks LOGOTHETIS Michael D. , KOKKINAKIS \nGeorge K. IEICE transactions on communications 83(9), 2087-2099, 2000-09-25 参考文献\n19件 被引用文献3件 Tweet 各種コード NII論文ID(NAID) 10006498979 資料種別 図書全体 データ\n提供元 CJP引用 書き出し RefWorksに書き出し EndNoteに書き出し Mendeleyに書き出し Refer…",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A mathematical framework for the performance evaluation of an all-optical packet switch with QoS differentiation",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/43249410/tele_v3_n34_2010_12.pdf",
            "Abstract": "In this paper we propose a mathematical framework for the performance evaluation of an all-optical packet switch, in terms of packet blocking probability. We provide the analytical models for several QoS differentiation schemes, including wavelength conversion, packet dropping, pre-emptive dropping, fiber delay lines, and wavelength reservation. We demonstrate the accuracy of the proposed models by comparing the analytical results with that of simulation; the results are found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Blocking analysis for priority classes in hybrid WDM-OCDMA passive optical networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5072464/",
            "Abstract": "We study the call-level performance behavior of two Passive Optical Network (PON) configurations in the upstream direction: an Optical Code Division Multiple Access (OCDMA) PON and a hybrid Wavelength Division Multiplexing (WDM)-OCDMA PON. Each PON accommodates 2K service-classes, which are grouped in two service priorities. The latter are denoted by thresholds in accessing the PON resources. The input traffic is assumed quasi-random, (finite number of traffic sources). Our analysis results in recursive formulas for the calculation of the system state probabilities, as well as of the call blocking probabilities and connection failure probabilities. To evaluate the proposed models the analytical results are compared with simulation results. The comparison reveals that the accuracy of the proposed analysis is quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blocking performance of multi-rate OCDMA PONs with QoS guarantee",
            "Publication year": 2012,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.303.5808&rep=rep1&type=pdf#page=20",
            "Abstract": "In this paper, we propose a new teletraffic model for the calculation of blocking probabilities in an Optical Code Division Multiple Access (OCDMA) Passive Optical Network (PON) supporting multiple service-classes of Poisson traffic. OCDMA is a promising candidate of PON configuration for the provision of moderate security communications with large dedicated bandwidth to each end user. The PON accommodates multiple service-classes that are differentiated by either different data-rates or different Quality of Service levels. Parameters related to the additive noise, multiple access interference and user activity are incorporated into our analysis. Based on a twodimensional Markov chain, we propose a recursive formula for the calculation of the number of in-service codewords, when the OCDMA PON guarantees Quality of Service (QoS), or not. To evaluate the proposed model, the analytical results are compared with simulation results to reveal that the model’s accuracy is quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance analysis of OCDMA PON configuration supporting multi-rate bursty traffic with retrials and QoS differentiation",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427714000277",
            "Abstract": "An Optical Code Division Multiple Access (OCDMA) Passive Optical Network (PON) is a highly promising PON configuration, thanks to the potential of OCDMA technology in eliminating channel contention and efficiently supporting multi-rate traffic with different QoS requirements. In this paper, we provide a mathematical framework for a call-level performance analysis of an OCDMA PON that accommodates multiple service-classes of bursty traffic with retries. Blocked calls of random arrivals may immediately retry several times, by requesting less resources (number of codewords) each time, in order to be admitted for service. The bursty nature of traffic is denoted by the fact that in-service calls may alternate between transmission and no-transmission periods. Our analysis takes into account user activity and the various components of additive noise. An approximate recursive formula is derived for the efficient …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Teletraffic: Theory and Applications Teletraffic: Theory and Applications, 1993",
            "Publication year": 2008,
            "Publication url": "https://ci.nii.ac.jp/naid/10026826588/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 \n出版年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 <no title> AKIMARU H. \n被引用文献: 1件 著者 AKIMARU H. 収録刊行物 Teletraffic : Theory and Applications Teletraffic : \nTheory and Applications, 1993 Springer-Verlag 被引用文献: 1件中 1-1件を 表示 1 Call-Level \nPerformance Modelling of Elastic and Adaptive Service-Classes with Finite Population \nVASSILAKIS Vassilios G. , MOSCHOLIOS Ioannis D. , LOGOTHETIS Michael D. IEICE \ntransactions on communications 91(1), 151-163, 2008-01-01 参考文献22件 Tweet 各種コード \nNII論文ID(NAID) 10026826588 資料種別 図書全体 データ提供元 CJP引用 書き出し RefWorksにに…",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teletraffic Models of Random Input",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742759/",
            "Abstract": "Teletraffic Models of Random Input - Wiley-IEEE Press books IEEE.org IEEE Xplore IEEE-SA \nIEEE Spectrum More Sites Create Account Personal Sign In Personal Sign In For IEEE to \ncontinue sending you helpful information on our products and services, please consent to our \nupdated Privacy Policy. I have read and accepted the IEEE Privacy Policy. Accept & Sign In \nEmail Address Password Sign In Forgot Password? Teletraffic Models of Random Input Article \n#: ISBN Information: Online ISBN: 9781119426974 Electronic ISBN: 9781119426912 Electronic \nISBN: 9781119426905 Print ISBN: 9781119426882 INSPEC Accession Number: Persistent \nLink: https://xplorestaging.ieee.org/servlet/opac?punumber=8742745 More » Publisher: \nWiley-IEEE Press IEEE Account Change Username/Password Update Address Purchase \nDetails Payment Options Order History View Purchased Documents Profile Information and Help…",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "Security Analysis of Integrated Diffie-Hellman Digital Signature Algorithm Protocols",
            "Publication year": 2017,
            "Publication url": "https://eprints.whiterose.ac.uk/119028/",
            "Abstract": "Diffie-Hellman (DH) key exchange is a well known method for secure exchange of cryptographic keys and has been widely used in popular Internet protocols, such as IPsec, TLS, and SSH. To enable authenticated key establishment, the DH protocol has been integrated with the digital signature algorithm (DSA). In this paper, we analyze three variants of the integrated DH-DSA protocol. We study the protocol variants with respect to known types of attacks and security features. In particular, the focus is on the properties of forward secrecy, known-key security, and replay attack resilience.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:dQ2og3OwTAUC",
            "Publisher": "York"
        },
        {
            "Title": "The Erlang Multirate Loss Model With Batched Poisson Arrivals",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742758/",
            "Abstract": "This chapter considers multirate loss models of batched Poisson arriving calls with fixed bandwidth requirements and fixed bandwidth allocation during service. In the batched Poisson process, simultaneous call‐arrivals (batches) occur at time‐points which follow a negative exponential distribution. A batched Poisson process can model overflow traffic. In the Erlang multirate loss model with batched Poisson arrivals, the chapter also considers a link of capacity  C  b.u. that accommodates  K  different service‐classes under the CS policy. Calls of all service‐classes arrive in the link according to a batched Poisson process. The batched Poisson process is important not only because in several applications calls arrive as batches (groups), but also because it can represent, in an approximate way, arrival processes that are more \"peaked\" and \"bursty\" (expressed by the peakedness factor z) than the Poisson process. The …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:ipzZ9siozwsC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "The erlang multirate loss model under the threshold and Bandwidth Reservation policies",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6923802/",
            "Abstract": "We consider a multirate loss model of a link that accommodates Poisson calls. Calls compete for the available link bandwidth under the combination of the Threshold (TH) and the Bandwidth Reservation (BR) policies. The TH policy limits calls of each service-class up to a threshold, which can be different for each service-class. The BR policy reserves part of the available link bandwidth to benefit calls of high bandwidth requirements. In the proposed model, the calculation of call blocking probabilities and link utilization is based on approximate, recursive formulas whose accuracy is verified through simulation and found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance Metrics in OFDM Wireless Networks with Restricted Accessibility",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8956292/",
            "Abstract": "In this paper we study the downlink of an Orthogonal Frequency Division Multiplexing (OFDM) based cell that accommodates calls from different service-classes with different resource requirements. We assume that calls arrive in the system according to a Poisson process while the call admission is based on restricted accessibility. In a restricted accessibility system, a new call may be blocked even if available resources do exist at the time of its arrival. To determine, via recursive formulas, the most important performance metrics, i.e., Call Blocking Probabilities (CBP) and resource utilization in this system, we model the system as a multirate loss model. The accuracy of the proposed formulas is verified via simulation and found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:MLfJN-KU85MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Call-burst blocking probabilities in an on-off multi-rate loss model of quasi-random input",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=7933276105685397886&hl=en&oi=scholarr",
            "Abstract": "We consider a single transmission link that accommodates both constant bit rate (CBR) service-classes and bursty service-classes of ON-OFF type, under the complete sharing policy. We assume that the call arrival process of each service-class is quasi-random, while the service time of calls of each service-class is exponentially distributed. When a call is accepted in the system it may alternate between states ON and OFF (burst), or remain always in state ON (CBR). Calls enter the system only via state ON. When a call is transferred to state OFF, it releases the bandwidth holding in state ON. This bandwidth becomes available to new arriving calls. When the call tries to return to state ON it requests for its bandwidth. If that bandwidth is available a new burst begins. Otherwise the burst is blocked and the call remains in state OFF. We prove that this model does have a product form solution and an accurate recursive …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Blocking analysis in hybrid TDM-WDM passive optical networks",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=lKm6A-aNJewC&oi=fnd&pg=PA441&dq=info:MI2zF6hPRBIJ:scholar.google.com&ots=LBLwQdU5Ea&sig=XlxuXZHp-zGH-VckC0-4qHl3Oig",
            "Abstract": "Optical access networks are the ultimate solution to the problem of the last mile bottleneck between high-capacity metro networks and customer premises, capable of delivering future integrated broadband services. Nowadays, passive optical networks are the most promising and costeffective class of fiber access systems. This rapid evolvement of fiber in access networks motivates the study of their performance. In this paper we develop teletraffic loss models for calculating connection failure probabilities (due to unavailability of a wavelength) and call blocking probabilities (due to the restricted bandwidth capacity of a wavelength) in hybrid TDM-WDM passive optical networks with dynamic wavelength allocation. The springboard of our analysis is well-established teletraffic models. The proposed models are derived from one-dimensional Markov chains which describe the wavelength’s occupancy in the optical access network. The optical access network accommodates multiple service-classes with infinite or finite number of traffic-sources. The accuracy of the proposed models is validated by simulation and was found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:W7OEmFMy1HYC",
            "Publisher": "River Publishers"
        },
        {
            "Title": "A signature-based intrusion detection system for the Internet of Things",
            "Publication year": 2018,
            "Publication url": "https://eprints.whiterose.ac.uk/133312/",
            "Abstract": "Internet of Things (IoT) is envisioned as a transformative approach with a wide range of applications in various sectors such as home automation, industrial control, and agriculture. It promises innovative business models and improved user experience. However, as evidenced by recent attacks such as the Mirai botnet, IoT networks and systems remain very vulnerable and require stronger protection mechanisms. Furthermore, due to processing, memory, and power constraints of typical IoT devices, traditional Internet security mechanisms are not always feasible or appropriate. In this work, we are concerned with designing an Intrusion Detection System (IDS) for protecting IoT networks from external threats as well as internal compromised devices. Our proposed design adopts a signature-based intrusion detection approach and involves both certralised and distributed IDS modules. Using the Cooja simulator, we have implemented a Denial of Service (DoS) attack scenario on IoT devices. This scenario exploits the RPL protocol, which is widely used for routing in low-power networks, including IoT networks. In particular, we have implemented two variants of DoS attacks, namely “Hello” flooding and version number modification. As shown by simulation results, these attacks may impact the reachability of certain IoT devices and their power consumption.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:tKAzc9rXhukC",
            "Publisher": "York"
        },
        {
            "Title": "Call-Level Analysis of a Two-Link Multirate Loss Model with Restricted Accessibility",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-31254-1_29",
            "Abstract": "We consider a two-link system with restricted accessibility that accommodates Poisson arriving calls from different service-classes and propose a multirate teletraffic loss model for its analysis. In a restricted accessibility system, a new call may be blocked even if available bandwidth units do exist at the time of its arrival. In the two-link system, each particular link has two thresholds which refer to the number of in-service calls in the link. The lowest threshold, named support threshold, defines up to which point the link can support calls offloaded from the other link. The highest threshold, named offloading threshold, defines the point where the link starts offloading calls to the other link. The two-link system with restricted accessibility is modelled as a loss model whose steady state probabilities do not have a product form solution. However, we propose approximate formulas for the calculation of call blocking …",
            "Abstract entirety": 0,
            "Author pub id": "ybBA1ZIAAAAJ:KUbvn5osdkgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Call-Level Analysis of a Two-Link Multirate Loss Model with Restricted Accessibility",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=mZyuDwAAQBAJ&oi=fnd&pg=PA239&dq=info:XKSP9SrkSo8J:scholar.google.com&ots=8bOW9-NbQk&sig=asan55k02Fv2khP9tDGlt16Iogc",
            "Abstract": "We consider a two-link system with restricted accessibility that accommodates Poisson arriving calls from different service-classes and propose a multirate teletraffic loss model for its analysis. In a restricted accessibility system, a new call may be blocked even if available bandwidth units do exist at the time of its arrival. In the two-link system, each particular link has two thresholds which refer to the number of inservice calls in the link. The lowest threshold, named support threshold, defines up to which point the link can support calls offloaded from the other link. The highest threshold, named offloading threshold, defines the point where the link starts offloading calls to the other link. The two-link system with restricted accessibility is modelled as a loss model whose steady state probabilities do not have a product form solution. However, we propose approximate formulas for the calculation of call blocking probabilities. The accuracy of the formulas is verified through simulation and found to be quite satisfactory.",
            "Abstract entirety": 1,
            "Author pub id": "ybBA1ZIAAAAJ:g3aElNc5_aQC",
            "Publisher": "Springer Nature"
        }
    ]
}]