[{
    "name": "Νίκος Παυλίδης",
    "romanize name": "Nikos Pavlidis",
    "School-Department": "Management Science",
    "University": "Lancaster University",
    "Rank": "Αναπληρωτής καθηγητής",
    "Apella_id": 27390,
    "Scholar name": "Nicos Pavlidis",
    "Scholar id": "WyUGbdkAAAAJ",
    "Affiliation": "Lancaster University",
    "Citedby": 1624,
    "Interests": [
        "Statistics",
        "Machine Learning",
        "Data mining"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=WyUGbdkAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Computing Nash equilibria through computational intelligence methods",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377042704002444",
            "Abstract": "Nash equilibrium constitutes a central solution concept in game theory. The task of detecting the Nash equilibria of a finite strategic game remains a challenging problem up-to-date. This paper investigates the effectiveness of three computational intelligence techniques, namely, covariance matrix adaptation evolution strategies, particle swarm optimization, as well as, differential evolution, to compute Nash equilibria of finite strategic games, as global minima of a real-valued, nonnegative function. An issue of particular interest is to detect more than one Nash equilibria of a game. The performance of the considered computational intelligence methods on this problem is investigated using multistart and deflection.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:d1gkVwhDpl0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Parallel differential evolution",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1331145/",
            "Abstract": "Parallel processing has emerged as a key enabling technology in modern computing. Recent software advances have allowed collections of heterogeneous computers to be used as a concurrent computational resource. In this work we explore how differential evolution can be parallelized, using a ring-network topology, so as to improve both the speed and the performance of the method. Experimental results indicate that the extent of information exchange among subpopulations assigned to different processor nodes, bears a significant impact on the performance of the algorithm. Furthermore, not all the mutation strategies of the differential evolution algorithm are equally sensitive to the value of this parameter.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adaptive consumer credit classification",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1057/jors.2012.15",
            "Abstract": "Credit scoring methods for predicting creditworthiness have proven very effective in consumer finance. In light of the present financial crisis, such methods will become even more important. One of the outstanding issues in credit risk classification is population drift. This term refers to changes occurring in the population due to unexpected changes in economic conditions and other factors. In this paper, we propose a novel methodology for the classification of credit applications that has the potential to adapt to population drift as it occurs. This provides the opportunity to update the credit risk classifier as new labelled data arrives. Assorted experimental results suggest that the proposed method has the potential to yield significant performance improvement over standard approaches, without sacrificing the classifier's descriptive capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Metric learning for simulation analytics",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9383904/",
            "Abstract": "The sample path generated by a stochastic simulation often exhibits significant variability within each replication, revealing periods of good and poor performance alike. As such, traditional summaries of aggregate performance measures overlook the more fine-grained insights into the operational system behavior. In this paper, we take a simulation analytics view of output analysis, turning to machine learning methods to uncover key insights from the dynamic sample path. We present a k nearest neighbors model on system state information to facilitate real-time predictions of a stochastic performance measure. This model is built on the premise of a system-specific measure of similarity between observations of the state, which we inform via metric learning. An evaluation of our approach is provided on a stochastic activity network and a wafer fabrication facility, both of which give us confidence in the ability of metric …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:cB__R-XWw9UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Genetically Programmed Trading Rules for the Foreign Exchange Market",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.440.3687&rep=rep1&type=pdf",
            "Abstract": "The identification of price patterns and trends, and the formation of rules to generate market signals have a long history in foreign exchange rate markets. Recent studies, however, question the profitability of the simple rules that have been shown to yield abnormal profits in previous decades. Rather than assuming a fixed set of rules, in this paper we employ genetic programming to identify rules in the Euro US Dollar daily exchange rate series over the period 1/1/1999 to 30/12/2005. Preliminary experimental results suggest that genetic programming is capable of generating profitable rules but for a limited time into the future.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:Oo1CbQkBAzEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational intelligence methods for financial time series modeling",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218127406015891",
            "Abstract": "In this paper, the combination of unsupervised clustering algorithms with feedforward neural networks in exchange rate time series forecasting is studied. Unsupervised clustering algorithms have the desirable property of deciding on the number of partitions required to accurately segment the input space during the clustering process, thus relieving the user from making this ad hoc choice. Combining this input space partitioning methodology with feedforward neural networks acting as local predictors for each identified cluster helps alleviate the problem of nonstationarity frequently encountered in real-life applications. An improvement in the one-step-ahead forecasting accuracy was achieved compared to a global feedforward neural network model for the time series of the exchange rate of the German Mark to the US Dollar.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:UeHWp8X0CEIC",
            "Publisher": "WORLD SCIENTIFIC PUBLISHING CO"
        },
        {
            "Title": "Adaptive Dynamic Model Averaging with an Application to House Price Forecasting",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1912.04661",
            "Abstract": "Dynamic model averaging (DMA) combines the forecasts of a large number of dynamic linear models (DLMs) to predict the future value of a time series. The performance of DMA critically depends on the appropriate choice of two forgetting factors. The first of these controls the speed of adaptation of the coefficient vector of each DLM, while the second enables time variation in the model averaging stage. In this paper we develop a novel, adaptive dynamic model averaging (ADMA) methodology. The proposed methodology employs a stochastic optimisation algorithm that sequentially updates the forgetting factor of each DLM, and uses a state-of-the-art non-parametric model combination algorithm from the prediction with expert advice literature, which offers finite-time performance guarantees. An empirical application to quarterly UK house price data suggests that ADMA produces more accurate forecasts than the benchmark autoregressive model, as well as competing DMA specifications.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:3MwzVuqRcA0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Existence and computation of short-run equilibria in economic geography",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0096300306004887",
            "Abstract": "The new economic geography literature provides a general equilibrium framework that explains the emergence of economic agglomerations as a trade-off between increasing returns at the firm level and transportation costs related to the shipment of goods. The existence and uniqueness of short-run equilibria of this model has been shown for the case of two regions. The proposed approach employs the differential evolution algorithm to obtain estimates of the Lipschitz constant and the infinity norm of the function along the boundary and utilizes these values to investigate the existence of solutions of a function, and the computational burden of computing the topological degree of this function. This approach is employed to investigate the existence of short-run equilibria for more than two regions using fixed point and topological degree theory, as well as, the differential evolution algorithm. Irrespective of parameter …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optimizing the performance of probabilistic neural networks in a bioinformatics task",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Michael-Vrahatis/publication/247077454_Optimizing_the_Performance_of_Probabilistic_Neural_Networks_in_a_Bionformatics_Task/links/02e7e52904d2450cb9000000/Optimizing-the-Performance-of-Probabilistic-Neural-Networks-in-a-Bionformatics-Task.pdf",
            "Abstract": "A self adaptive probabilistic neural network model is proposed. The model incorporates the Particle Swarm Optimization algorithm to optimize the spread parameter of the probabilistic neural network, enhancing thus its performance. The proposed approach is tested on two data sets from the field of bioinformatics, with promising results. The performance of the proposed model is compared to probabilistic neural networks, as well as to four different feedforward neural networks. Different sampling techniques are used, and statistical tests are performed to justify the statistical significance of the results.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Minimum spectral connectivity projection pursuit",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s11222-018-9814-6",
            "Abstract": "We study the problem of determining the optimal low-dimensional projection for maximising the separability of a binary partition of an unlabelled dataset, as measured by spectral graph theory. This is achieved by finding projections which minimise the second eigenvalue of the graph Laplacian of the projected data, which corresponds to a non-convex, non-smooth optimisation problem. We show that the optimal univariate projection based on spectral connectivity converges to the vector normal to the maximum margin hyperplane through the data, as the scaling parameter is reduced to zero. This establishes a connection between connectivity as measured by spectral graph theory and maximal Euclidean separation. The computational cost associated with each eigen problem is quadratic in the number of data. To mitigate this issue, we propose an approximation method using microclusters with provable …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:qPeb-qHga9sC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Evolving cellular automata rules for multiple-step-ahead prediction of complex binary sequences",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895717709002696",
            "Abstract": "Complex binary sequences are generated through the application of simple threshold, linear transformations to the logistic iterative map. Depending primarily on the value of its non-linearity parameter, the logistic map exhibits a great variety of behavior, including stable states, cycling and periodical activity and the period doubling phenomenon that leads to high-order chaos. From the real data sequences, binary sequences are derived. Consecutive L bit sequences are given as input to a cellular automaton with the task to regenerate the subsequent L bits of the binary sequence in precisely L evolution steps. To perform this task a genetic algorithm is employed to evolve cellular automaton rules. Various complex binary sequences are examined, for a variety of initial values and a wide range of values of the non-linearity parameter. The proposed hybrid multiple-step-ahead prediction algorithm, based on a …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Financial forecasting through unsupervised clustering and evolutionary trained neural networks",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1299377/",
            "Abstract": "We present a time series forecasting methodology and applies it to generate one-step-ahead predictions for two daily foreign exchange spot rate time series. The methodology draws from the disciplines of chaotic time series analysis, clustering, artificial neural networks and evolutionary computation. In brief, clustering is applied to identify neighborhoods in the reconstructed state space of the system; and subsequently neural networks are trained to model the dynamics of each neighborhood separately. The results obtained through this approach are promising.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Determining the number of real roots of polynomials through neural networks",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0898122105005195",
            "Abstract": "The ability of feedforward neural networks to identify the number of real roots of univariate polynomials is investigated. Furthermore, their ability to determine whether a system of multivariate polynomial equations has real solutions is examined on a problem of determining the structure of a molecule. The obtained experimental results indicate that neural networks are capable of performing this task with high accuracy even when the training set is very small compared to the test set.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:Se3iqnhoufwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Prospects for bandit solutions in sensor management",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8130386/",
            "Abstract": "Sensor management in information-rich and dynamic environments can be posed as a sequential action selection problem with side information. To study such problems we employ the dynamic multi-armed bandit with covariates framework. In this generalization of the multi-armed bandit, the expected rewards are time-varying linear functions of the covariate vector. The learning goal is to associate the covariate with the optimal action at each instance, essentially learning to partition the covariate space adaptively. Applications of sensor management are frequently in environments in which the precise nature of the dynamics is unknown. In such settings, the sensor manager tracks the evolving environment by observing only the covariates and the consequences of the selected actions. This creates difficulties not encountered in static problems, and changes the exploitation–exploration dilemma. We study the …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:5nxA0vEk-isC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Dynamic multi-armed bandit with covariates",
            "Publication year": 2008,
            "Publication url": "https://ebooks.iospress.nl/pdf/doi/10.3233/978-1-58603-891-5-777",
            "Abstract": "In numerous real-world problems an agent selects repeatedly among a number of actions whose rewards are uncertain, aiming to maximise the overall reward. Each action-selection generates a reward and provides new information that reduces the agent’s uncertainty about the selected action. Ideally, one would like to maximise both immediate reward and the reduction of uncertainty, but the two objectives are often conflicting. The action with the highest expected reward is typically selected frequently, and therefore there is relatively little uncertainty about its reward. On the other hand, actions whose rewards are more uncertain are characterised by a low expected reward. In this class of problems, the central issue is how to resolve the dilemma between discovering new knowledge (exploration), and maximising reward based on existing knowledge (exploitation). The multi-armed bandit problem [3] is the simplest …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Maximum Clusterability Divisive Clustering",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7376691/",
            "Abstract": "The notion of cluster ability is often used to determine how strong the cluster structure within a set of data is, as well as to assess the quality of a clustering model. In multivariate applications, however, the cluster ability of a data set can be obscured by irrelevant or noisy features. We study the problem of finding low dimensional projections which maximise the cluster ability of a data set. In particular, we seek low dimensional representations of the data which maximise the quality of a binary partition. We use this bi-partitioning recursively to generate high quality clustering models. We illustrate the improvement over standard dimension reduction and clustering techniques, and evaluate our method in experiments on real and simulated data sets.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:d4tt_xEv1X8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Divisive clustering of high dimensional data streams",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s11222-015-9597-y",
            "Abstract": "Clustering streaming data is gaining importance as automatic data acquisition technologies are deployed in diverse applications. We propose a fully incremental projected divisive clustering method for high-dimensional data streams that is motivated by high density clustering. The method is capable of identifying clusters in arbitrary subspaces, estimating the number of clusters, and detecting changes in the data distribution which necessitate a revision of the model. The empirical evaluation of the proposed method on numerous real and simulated datasets shows that it is scalable in dimension and number of clusters, is robust to noisy and irrelevant features, and is capable of handling a variety of types of non-stationarity.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Enhancing differential evolution utilizing proximity-based mutation operators",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5678831/",
            "Abstract": "Differential evolution is a very popular optimization algorithm and considerable research has been devoted to the development of efficient search operators. Motivated by the different manner in which various search operators behave, we propose a novel framework based on the proximity characteristics among the individual solutions as they evolve. Our framework incorporates information of neighboring individuals, in an attempt to efficiently guide the evolution of the population toward the global optimum, without sacrificing the search capabilities of the algorithm. More specifically, the random selection of parents during mutation is modified, by assigning to each individual a probability of selection that is inversely proportional to its distance from the mutated individual. The proposed framework can be applied to any mutation strategy with minimal changes. In this paper, we incorporate this framework in the original …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Subspace Clustering of Very Sparse High-Dimensional Data",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8622472/",
            "Abstract": "In this paper we consider the problem of clustering collections of very short texts using subspace clustering. This problem arises in many applications such as product categorisation, fraud detection, and sentiment analysis. The main challenge lies in the fact that the vectorial representation of short texts is both high-dimensional, due to the large number of unique terms in the corpus, and extremely sparse, as each text contains a very small number of words with no repetition. We propose a new, simple subspace clustering algorithm that relies on linear algebra to cluster such datasets. Experimental results on identifying product categories from product names obtained from the US Amazon website indicate that the algorithm can be competitive against state-of-the-art clustering algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:wuD5JclIwkYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Effect of Recovery Algorithms on Compressive Sensing Background Subtraction",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6698258/",
            "Abstract": "Background subtraction is a key method required to aid processing surveillance videos. Current methods require storing each pixel of every video frame, which can be wasteful as most of this information refers to the uninteresting background. Compressive sensing can offer an efficient solution by using the fact that foreground is often sparse in the spatial domain. By making this assumption and applying a specific recovery algorithm to a trained background, it is possible to reconstruct the foreground, using only a low dimensional representation of the difference between the current frame and the estimated background scene. Although new compressive sensing background subtraction algorithms are being created, no study has been made of the effect of recovery algorithms on performance of background subtraction. This is considered by applying both Basis Pursuit and Orthogonal Matching Pursuit (OMP) to a …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Time Series Forecasting Methodology for Multiple-Step-Ahead Prediction.",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/68156102/Time_series_forecasting_methodology_for_20210717-18251-yxqrrx.pdf",
            "Abstract": "This paper presents a time series forecasting methodology and applies it to generate multiple–step–ahead predictions for the direction of change of the daily exchange rate of the Japanese Yen against the US Dollar. The proposed methodology draws from the disciplines of chaotic time series analysis, clustering, and artificial neural networks. In brief, clustering is applied to identify neighborhoods in the reconstructed state space of the system; and subsequently neural networks are trained to model the dynamics of each neighborhood separately. The results obtained through this approach are promising.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust function-on-function regression",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00401706.2020.1802350",
            "Abstract": "Functional linear regression is a widely used approach to model functional responses with respect to functional inputs. However, classical functional linear regression models can be severely affected by outliers. We therefore introduce a Fisher-consistent robust functional linear regression model that is able to effectively fit data in the presence of outliers. The model is built using robust functional principal component and least squares regression estimators. The performance of the functional linear regression model depends on the number of principal components used. We therefore introduce a consistent robust model selection procedure to choose the number of principal components. Our robust functional linear regression model can be used alongside an outlier detection procedure to effectively identify abnormal functional responses. A simulation study shows our method is able to effectively capture the …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:3vbIHxFL9FgC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Tracking differential evolution algorithms: An adaptive approach through multinomial distribution tracking with exponential forgetting",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30448-4_27",
            "Abstract": "Several Differential Evolution variants with modified search dynamics have been recently proposed, to improve the performance of the method. This work borrows ideas from adaptive filter theory to develop an “online” algorithmic adaptation framework. The proposed framework is based on tracking the parameters of a multinomial distribution to reflect changes in the evolutionary process. As such, we design a multinomial distribution tracker to capture the successful evolution movements of three Differential Evolution algorithms, in an attempt to aggregate their characteristics and their search dynamics. Experimental results on ten benchmark functions and comparisons with five state-of-the-art algorithms indicate that the proposed framework is competitive and very promising.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:4TOpqqG69KYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Financial forecasting through unsupervised clustering and neural networks",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/BF02941227",
            "Abstract": "In this paper, we review our work on a time series forecasting methodology based on the combination of unsupervised clustering and artificial neural networks. To address noise and non-stationarity, a common approach is to combine a method for the partitioning of the input space into a number of subspaces with a local approximation scheme for each subspace. Unsupervised clustering algorithms have the desirable property of deciding on the number of partitions required to accurately segment the input space during the clustering process, thus relieving the user from making this ad hoc choice. Artificial neural networks, on the other hand, are powerful computational models that have proved their capabilities on numerous hard real-world problems. The time series that we consider are all daily spot foreign exchange rates of major currencies. The experimental results reported suggest that predictability …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Spiking neural network training using evolutionary algorithms",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1556240/",
            "Abstract": "Networks of spiking neurons can perform complex non-linear computations in fast temporal coding just as well as rate coded networks. These networks differ from previous models in that spiking neurons communicate information by the timing, rather than the rate, of spikes. To apply spiking neural networks on particular tasks, a learning process is required. Most existing training algorithms are based on unsupervised Hebbian learning. In this paper, we investigate the performance of the parallel differential evolution algorithm, as a supervised training algorithm for spiking neural networks. The approach was successfully tested on well-known and widely used classification problems.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Weighted Sparse Subspace Representation: A Unified Framework for Subspace Clustering, Constrained Clustering, and Active Learning",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2106.04330",
            "Abstract": "Spectral-based subspace clustering methods have proved successful in many challenging applications such as gene sequencing, image recognition, and motion segmentation. In this work, we first propose a novel spectral-based subspace clustering algorithm that seeks to represent each point as a sparse convex combination of a few nearby points. We then extend the algorithm to constrained clustering and active learning settings. Our motivation for developing such a framework stems from the fact that typically either a small amount of labelled data is available in advance; or it is possible to label some points at a cost. The latter scenario is typically encountered in the process of validating a cluster assignment. Extensive experiments on simulated and real data sets show that the proposed approach is effective and competitive with state-of-the-art methods.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:wGzT3bKASkAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tracking Particle Swarm Optimizers: An adaptive approach through multinomial distribution tracking with exponential forgetting",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6256425/",
            "Abstract": "An active research direction in Particle Swarm Optimization (PSO) is the integration of PSO variants in adaptive, or self-adaptive schemes, in an attempt to aggregate their characteristics and their search dynamics. In this work we borrow ideas from adaptive filter theory to develop an “online” algorithm adaptation framework. The proposed framework is based on tracking the parameters of a multinomial distribution to capture changes in the evolutionary process. As such, we design a multinomial distribution tracker to capture the successful evolution movements of three PSO variants. Extensive experimental results on ten benchmark functions and comparisons with five state-of-the-art algorithms indicate that the proposed framework is competitive and very promising. On the majority of tested cases, the proposed framework achieves substantial performance gain, while it seems to identify accurately the most appropriate …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vector evaluated differential evolution for multiobjective optimization.",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1330858/",
            "Abstract": "A parallel, multi-population differential evolution algorithm for multiobjective optimization is introduced. The algorithm is equipped with a domination selection operator to enhance its performance by favouring non-dominated individuals in the populations. Preliminary experimental results on widely used test problems are promising. Comparisons with the VEGA approach are provided and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recognizing predictive patterns in chaotic maps",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/30890557/10.1.1.142.8746.pdf#page=49",
            "Abstract": "We investigate the existence of rules (in the form of binary patterns) that allow the short-term prediction of highly complex binary sequences. We also study the extent to which these rules retain their predictive power when the sequence is contaminated with noise. Complex binary sequences are derived by applying two binary transformations on realvalued sequences generated by the well known tent map. To identify short-term predictors we employ Genetic Algorithms. The dynamics of the tent map depend strongly on the value of the control parameter, r. The experimental results suggest that the same is true for the number of predictors. Despite the chaotic nature of the tent map and the complexity of the derived binary sequences, the results reported suggest that there exist settings in which an unexpectedly large number of predictive rules exists. Furthermore, rules that permit the risk free prediction of the value of the next bit are detected in a wide range of parameter settings. By incorporating noise in the data generating process, the rules that allow the risk free prediction of the next bit are eliminated. However, for small values of the variance of the Gaussian noise term there exist rules that retain much of their predictive power.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "λ‐Perceptron: An adaptive classifier for data streams",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320310003651",
            "Abstract": "Streaming data introduce challenges mainly due to changing data distributions (population drift). To accommodate population drift we develop a novel linear adaptive online classification method motivated by ideas from adaptive filtering. Our approach allows the impact of past data on parameter estimates to be gradually removed, a process termed forgetting, yielding completely online adaptive algorithms. Extensive experimental results show that this approach adjusts the forgetting mechanism to maintain performance. Moreover, it might be possible to exploit the information in the evolution of the forgetting mechanism to obtain information about the type and speed of the underlying population drift process.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:roLk4NBRz8UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Minimum density hyperplanes in the feature space",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7841025/",
            "Abstract": "We introduce a kernel formulation of the recently proposed minimum density hyperplane approach to clustering. This enables the identification of clusters that are not linearly separable in the input space by mapping them into a feature space. This mapping also extends the applicability of the minimum density hyperplane to datasets whose features are not necessarily continuous. The location of minimum density hyperplanes involves the optimisation of a non-convex objective function. In the feature space, the dimensionality of the optimisation problem is n, where n is the number of observations. We further propose an approximation method that can substantially reduce the dimensionality of the search space, avoiding searching over dimensions which are unlikely to contain useful information for clustering. Experimental results suggest that the proposed approach is capable of producing high quality partitions …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:17ZO-CJnx_8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimizing Trading Strategies through Genetic Programming",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Michael-Vrahatis/publication/240839575_Optimizing_trading_strategies_through_genetic_programming/links/0deec52cdd9e4c89f3000000/Optimizing-trading-strategies-through-genetic-programming.pdf",
            "Abstract": "This paper investigates the performance of genetically programmed trading rules applied to the daily Euro US Dollar exchange rate. Our findings suggest that significant profit opportunities exist especially during the period of the sharp depreciation of the dollar. However, the performance of these rules deteriorates as the time horizon increases. The application of the residual based and wild bootstraps indicates that genetic programming can identify patterns in the data which cannot be explained by standard statistical models.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:0EnyYjriUFMC",
            "Publisher": "Wiley-VCH Verlag GmbH\\ & Co. KGaA, Weinheim, Germany}"
        },
        {
            "Title": "PPCI: an R Package for Cluster Identification using Projection Pursuit",
            "Publication year": 2019,
            "Publication url": "https://eprints.lancs.ac.uk/id/eprint/137983/",
            "Abstract": "This paper presents the R package PPCI which implements three recently proposed projection pursuit methods for clustering. The methods are unified by the approach of defining an optimal hyperplane to separate clusters, and deriving a projection index whose optimiser is the vector normal to this separating hyperplane. Divisive hierarchical clustering algorithms that can detect clusters defined in different subspaces are readily obtained by recursively bi-partitioning the data through such hyperplanes. Projecting onto the vector normal to the optimal hyperplane enables visualisations of the data that can be used to validate the partition at each level of the cluster hierarchy. PPCI also provides a simplified framework in which the clustering models can be modified in an interactive manner. Extensions to problems involving clusters which are not linearly separable, and to the problem of finding maximum hard margin hyperplanes for clustering are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:T8_be82Iz5gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Minimum Density Hyperplanes",
            "Publication year": 2016,
            "Publication url": "https://www.jmlr.org/papers/volume17/15-307/15-307.pdf",
            "Abstract": "Associating distinct groups of objects (clusters) with contiguous regions of high probability density (high-density clusters), is central to many statistical and machine learning approaches to the classification of unlabelled data. We propose a novel hyperplane classifier for clustering and semi-supervised classification which is motivated by this objective. The proposed minimum density hyperplane minimises the integral of the empirical probability density function along it, thereby avoiding intersection with high density clusters. We show that the minimum density and the maximum margin hyperplanes are asymptotically equivalent, thus linking this approach to maximum margin clustering and semi-supervised support vector classifiers. We propose a projection pursuit formulation of the associated optimisation problem which allows us to find minimum density hyperplanes efficiently in practice, and evaluate its performance on a range of benchmark data sets. The proposed approach is found to be very competitive with state of the art methods for clustering and semi-supervised classification.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Microtome Publishing"
        },
        {
            "Title": "Semi-supervised Spectral Connectivity Projection Pursuit",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359523/",
            "Abstract": "We propose a projection pursuit method based on semi-supervised spectral connectivity. The projection index is given by the second eigenvalue of the graph Laplacian of the projected data. An incomplete label set is used to modify pairwise similarities between data in such a way that penalises projections which do not admit a separation of the classes (within the training data). We show that the global optimum of the proposed problem converges to the Transductive Support Vector Machine solution, as the scaling parameter is reduced to zero. We evaluate the performance of the proposed method on benchmark data sets.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:8uzoZH4hB9AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust Functional Regression for Outlier Detection",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-39098-3_1",
            "Abstract": "In this paper we propose an outlier detection algorithm for temperature sensor data from jet engine tests. Effective identification of outliers would enable engine problems to be examined and resolved efficiently. Outlier detection in this data is challenging because a human controller determines the speed of the engine during each manoeuvre. This introduces variability which can mask abnormal behaviour in the engine response. We therefore suggest modelling the dependency between speed and temperature in the process of identifying abnormalities. The engine temperature has a delayed response with respect to the engine speed, which we will model using robust functional regression. We then apply functional depth with respect to the residuals to rank the samples and identify the outliers. The effectiveness of the outlier detection algorithm is shown in a simulation study. The algorithm is also applied to real …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:Gpwnp1kGG20C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Subspace Clustering with Active Learning",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9006361/",
            "Abstract": "Subspace clustering is a growing field of unsupervised learning that has gained much popularity in the computer vision community. Applications can be found in areas such as motion segmentation and face clustering. It assumes that data originate from a union of subspaces, and clusters the data depending on the corresponding subspace. In practice, it is reasonable to assume that a limited amount of labels can be obtained, potentially at a cost. Therefore, algorithms that can effectively and efficiently incorporate this information to improve the clustering model are desirable. In this paper, we propose an active learning framework for subspace clustering that sequentially queries informative points and updates the subspace model. The query stage of the proposed framework relies on results from the perturbation theory of principal component analysis, to identify influential and potentially misclassified points. A …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:9LpHyFPp1DQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Urinary bladder tumor grade diagnosis using on-line trained neural networks",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45224-9_29",
            "Abstract": "This paper extends the line of research that considers the application of Artificial Neural Networks (ANNs) as an automated system, for the assignment of tumors grade. One hundred twenty nine cases were classified according to the WHO grading system by experienced pathologists in three classes: Grade I, Grade II and Grade III. 36 morphological and textural, cell nuclei features represented each case. These features were used as an input to the ANN classifier, which was trained using a novel stochastic training algorithm, namely, the Adaptive Stochastic On-Line method. The resulting automated classification system achieved classification accuracy of 90%, 94.9% and 97.3% for tumors of Grade I, II and III respectively.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Simulation studies of multi-armed bandits with covariates",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4488981/",
            "Abstract": "We evaluate the performance of a number of action-selection methods on the multi-armed bandit problem with covariates. We resort to simulations because our primary concern is the speed with which the different methods identify the optimal policy, and not their asymptotic behaviour. The experimental results show that the performance of the ε-greedy methods is robust, while the interval estimation strategies achieve the fastest learning of the optimal policy. We propose a metric to quantify the difficulty of a multi-armed bandit problem with covariates and show that there is a trade-off between the satisfaction of the different performance measures.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exchange Rate Forecasting through Distributed Time-Lagged Feedforward Neural Networks",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812562586_0017",
            "Abstract": "Throughout the last decade, the application of Artificial Neural Networks in the areas of financial and economic time series forecasting has been rapidly expanding. The present chapter investigates the ability of Distributed Time Lagged Feedforward Networks (DTLFN), trained through a popular Differential Evolution (DE) algorithm, to forecast the short–term behavior of the daily exchange rate of the Euro against the US Dollar. Performance is contrasted with that of focused time lagged feedforward networks, as well as with DTLFNs trained through alternative algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Short-term prediction of complex binary data",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.403.6812&rep=rep1&type=pdf",
            "Abstract": "1 Medical Physics Laboratory, Department of Medicine, Democritus University of Thrace, GR-68100 Alexandroupolis, Hellas 2 Pattern Recognition Laboratory, Department of Computer Engineering and Informatics, University of Patras, GR-26500 Patras, Hellas 3 Computational Intelligence Laboratory (CI Lab), Department of Mathematics, University of Patras Artificial Intelligence Research Center (UPAIRC), University of Patras, GR-26110 Patras, Hellas",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational intelligence algorithms for risk-adjusted trading strategies",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4424517/",
            "Abstract": "This paper investigates the performance of trading strategies identified through computational intelligence techniques. We focus on trading rules derived by genetic programming, as well as, generalized moving average rules optimized through differential evolution. The performance of these rules is investigated using recently proposed risk-adjusted evaluation measures and statistical testing is carried out through simulation. Overall, the moving average rules proved to be more robust, but genetic programming seems more promising in terms of generating higher profits and detecting novel patterns in the data.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cell-nuclear data reduction and prognostic model selection in bladder tumor recurrence",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0933365706001102",
            "Abstract": "The paper aims at improving the prediction of superficial bladder recurrence. To this end, feedforward neural networks (FNNs) and a feature selection method based on unsupervised clustering, were employed.A retrospective prognostic study of 127 patients diagnosed with superficial urinary bladder cancer was performed. Images from biopsies were digitized and cell nuclei features were extracted. To design FNN classifiers, different training methods and architectures were investigated. The unsupervised k-windows (UKW) and the fuzzy c-means clustering algorithms were applied on the feature set to identify the most informative feature subsets.UKW managed to reduce the dimensionality of the feature space significantly, and yielded prediction rates 87.95% and 91.41%, for non-recurrent and recurrent cases, respectively. The prediction rates achieved with the reduced …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Human designed vs. genetically programmed differential evolution operators",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1688536/",
            "Abstract": "The hybridization and combination of different Evolutionary Algorithms to improve the quality of the solutions and to accelerate execution is a common research practice. In this paper, we utilize Genetic Programming to evolve novel Differential Evolution operators. The genetic evolution resulted in parameter free Differential Evolution operators. Our experimental results indicate that the performance of the genetically programmed operators is comparable and in some cases is considerably better than the already existing human designed ones.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "New self-adaptive probabilistic neural networks in bioinformatic and medical tasks",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213006002722",
            "Abstract": "We propose a self–adaptive probabilistic neural network model, which incorporates optimization algorithms to determine its spread parameters. The performance of the proposed model is investigated on two protein localization problems, as well as on two medical diagnostic tasks. Experimental results are compared with that of feedforward neural networks and support vector machines. Different sampling techniques are used and statistical tests are conducted to calculate the statistical significance of the results.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:IjCSPb-OGe4C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Dynamic Estimation of Trade Costs from Real Exchange Rates",
            "Publication year": 2012,
            "Publication url": "https://eprints.lancs.ac.uk/id/eprint/59872/4/Pavlidis_2012_001.pdf",
            "Abstract": "The difficulty of measuring trade costs is well documented. We propose a nonlinear statespace model that enables us to extract information about changes in trade costs directly from real exchange rates. The model is well grounded in theory and nests numerous widely used empirical real exchange rate models. By employing two centuries of data on the Dollar-Sterling rate, we provide evidence of substantial variation in trade costs over time. Our results indicate that the process of economic integration that started after World War II has stopped during the last decades. We also contrast our results with a measure from the gravity literature and explore implications for the Purchasing Power Parity puzzle.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "The Department of Economics"
        },
        {
            "Title": "Nonlinear Dimensionality Reduction for Clustering",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320320303113",
            "Abstract": "We introduce an approach to divisive hierarchical clustering that is capable of identifying clusters in nonlinear manifolds. This approach uses the isometric mapping (Isomap) to recursively embed (subsets of) the data in one dimension, and then performs a binary partition designed to avoid the splitting of clusters. We provide a theoretical analysis of the conditions under which contiguous and high-density clusters in the original space are guaranteed to be separable in the one-dimensional embedding. To the best of our knowledge there is little prior work that studies this problem. Extensive experiments on simulated and real data sets show that hierarchical divisive clustering algorithms derived from this approach are effective.",
            "Abstract entirety": 1,
            "Author pub id": "WyUGbdkAAAAJ:rFyVMFCKTwsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Online linear and quadratic discriminant analysis with adaptive forgetting for streaming classification",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sam.10151",
            "Abstract": "Advances in data technology have enabled streaming acquisition of real‐time information in a wide range of settings, including consumer credit, electricity consumption, and internet user behavior. Streaming data consist of transiently observed, temporally evolving data sequences, and poses novel challenges to statistical analysis. Foremost among these challenges are the need for online processing, and temporal adaptivity in the face of unforeseen changes, both smooth and abrupt, in the underlying data generation mechanism. In this paper, we develop streaming versions of two widely used parametric classifiers, namely quadratic and linear discriminant analysis. We rely on computationally efficient, recursive formulations of these classifiers. We additionally equip them with exponential forgetting factors that enable temporal adaptivity via smoothly down‐weighting the contribution of older data. Drawing on ideas …",
            "Abstract entirety": 0,
            "Author pub id": "WyUGbdkAAAAJ:_kc_bZDykSQC",
            "Publisher": "Wiley"
        }
    ]
}]