[{
    "name": "Νικόλαος Καραχάλιος",
    "romanize name": "Nikolaos Karachalios",
    "School-Department": "Μαθηματικών",
    "University": "aegean",
    "Rank": "Καθηγητής",
    "Apella_id": 19233,
    "Scholar name": "NIKOLAOS KARACHALIOS",
    "Scholar id": "Pptq4PwAAAAJ",
    "Affiliation": "Department of Mathematics, University of Thessaly",
    "Citedby": 717,
    "Interests": [
        "Dynamical Systems",
        "Differential Equations",
        "Partial Differential Equations",
        "Nonlinear Science"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Pptq4PwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Global nonexistence phenomena in infinite lattices of nonlinear oscillators",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.234.6642&rep=rep1&type=pdf",
            "Abstract": "Pointing out the difference between the Discrete Nonlinear Schrödinger equation with the classical power law nonlinearity-for which solutions exist globally, independently of the sign and the degree of the nonlinearity, the size of the initial data and the dimension of the lattice-we prove global nonexistence in time, for the Discrete Klein-Gordon equation with the same type of nonlinearity (but of “blow-up” sign), under suitable conditions on the initial data. We also provide conditions, for the global existence of solutions. Our results, consider both the conservative and the linearly damped lattice. Similarities and differences with the continuous counterparts, are remarked. We also make a short comment, on the existence of excitation thresholds, for forced solutions of damped and parametrically driven, Klein-Gordon lattices.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Regularity of nonvanishing–at infinity or at the boundary–solutions of the defocusing nonlinear Schrödinger equation",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03605302.2020.1839762",
            "Abstract": "Considering the defocusing nonlinear Schrödinger equation (NLSE) in generic (bounded or unbounded) open sets  for n = 1, 2, and 3, we prove the regularity of weak, non-vanishing solutions at infinity or at the boundary of U. Our approach is based on suitably defined extension operators, along with a priori estimates for regular functions, under certain assumptions on the smoothness of the boundary. The results cover physically significant classes of solutions, as dark-solitons and compacton waveforms, when the notion of such solutions is extended in higher-dimensional set-ups.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Escape dynamics in the discrete repulsive ϕ4 model",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278912002758",
            "Abstract": "We study deterministic escape dynamics of the discrete Klein–Gordon model with a repulsive quartic on-site potential. Using a combination of analytical techniques, based on differential and algebraic inequalities and selected numerical illustrations, we first derive conditions for collapse of an initially excited single-site unit, for both the Hamiltonian and the linearly damped versions of the system and showcase different potential fates of the single-site excitation, such as the possibility to be “pulled back” from outside the well or to “drive over” the barrier some of its neighbors. Next, we study the evolution of a uniform (small) segment of the chain and, in turn, consider the conditions that support its escape and collapse of the chain. Finally, our path from one to the few and finally to the many excited sites is completed by a modulational stability analysis and the exploration of its connection to the escape process for plane …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:YOwf2qJgpHMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A mechanism to control and detect rogue waves by plane wave initial conditions: the prototypical example of the damped and periodically driven NLS equation",
            "Publication year": 2020,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2020arXiv201013174D/abstract",
            "Abstract": "Investigating by direct numerical simulations the dynamics of the damped and forced nonlinear Schr\\\" odinger equation in the presence of a time periodic forcing and for certain parametric regimes, we show that the wave-number of a plane-wave initial condition dictates the number of emerged Peregrine type rogue waves at the early stages of modulation instability. Another dynamical feature is that the formation of these events gives rise to the same number of transient\" triangular\" spatio-temporal patterns, each of which is reminiscent of the one emerging in the dynamics of the integrable NLS in its semi-classical limit, with vanishing initial conditions. The effects of the various parameters in modifying the above behavior are also discussed, and found to be far from its integrable limit counterpart. Furthermore, we find that the -norm of the spatial derivative and the -norm of the solution provide diagnostics for the …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Localized excitations in nonlinear complex systems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-02057-0.pdf",
            "Abstract": "Localized excitations have been at the heart of developments of nonlinear dynamics (and especially of nonlinear complex systems) during the past few decades. Their names may vary (solitons, instantons, kinks, breathers, vortices, vortex rings, quodons, etc.), yet their relevance is ubiquitous and their importance undisputed not only in a wide variety of mathematical and theoretical developments but also in a broad range of applications. The latter constitute an ever-expanding list including, but certainly not limited to, Bose-Einstein condensates in atomic physics, optical fibers, waveguide arrays and photorefractive systems in nonlinear optics, Josephson junctions and arrays thereof, molecular crystals, layered silicates, ferromagnetic and antiferromagnetic materials, granular crystals, micromechanical cantilever or simple torsion pendulum arrays, electrical transmission lines, and nematic liquid crystals. Additionally …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer International Pu"
        },
        {
            "Title": "The existence of a global attractor for the discrete nonlinear Schrödinger equation. II. Compactness without tail estimates in, lattices",
            "Publication year": 2007,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-royal-society-of-edinburgh-section-a-mathematics/article/existence-of-a-global-attractor-for-the-discrete-nonlinear-schrodinger-equation-ii-compactness-without-tail-estimates-in-mathbbzn-ngeq1-lattices/E718EFD9DB0D1EA9B3C0BF32DF2DAA78",
            "Abstract": "Recent studies of lattice dynamics, with respect to the existence of global compact attractors for certain discrete evolution equations, are based on the derivation of ‘tail estimates of the solution’. We show that, due to the specific nature of the discrete nonlinear Schrödinger (DNLS) system which gives rise to a simple energy equation, the method developed by J. M. Ball is applicable, and provides an alternative proof on the existence of the compactness of the attractor for the weakly damped and driven DNLS equation considered in , lattices, without the usage of tail estimates. The approach covers various DNLS-type equations of physical significance.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:roLk4NBRz8UC",
            "Publisher": "Royal Society of Edinburgh Scotland Foundation"
        },
        {
            "Title": "Dynamics of nonlocal and local discrete Ginzburg–Landau equations: Global attractors and their congruence",
            "Publication year": 2022,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0362546X21002443",
            "Abstract": "Discrete Ginzburg–Landau (DGL) equations with non-local nonlinearities have been established as significant inherently discrete models in numerous physical contexts, similar to their counterparts with local nonlinear terms. We study two prototypical examples of non-local and local DGLs on the one-dimensional infinite lattice. For the non-local DGL, we identify distinct scenarios for the asymptotic behavior of the globally existing in time solutions depending on certain parametric regimes. One of these scenarios is associated with a restricted compact attractor according to JK Hale’s definition. We also prove the closeness of the solutions of the two models in the sense of a “continuous dependence on their initial data” in the l 2 metric under general conditions on the intrinsic linear gain or loss incorporated in the model. As a consequence of the closeness results, in the dissipative regime we establish the …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Parametric exponential energy decay for dissipative electron-ion plasma waves",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s00033-004-2095-2",
            "Abstract": "We consider the following evolution system of Klein-Gordon-Schrödinger type $$ \\begin{aligned}  & i\\psi _t + \\kappa\\psi _{xx} + i\\alpha \\psi = \\phi \\psi ,\\,x \\in \\Omega ,\\,t > 0, \\\\ & \\phi _{tt} - \\phi _{xx} + \\phi + \\lambda \\phi _t = - Re \\psi_{x}, \\, x \\in \\Omega ,\\,t > 0, \\end{aligned} $$  satisfying the following initial and boundary conditions $$ \\begin{aligned} & \\psi (x,0) = \\psi _0 (x),\\,\\phi (x,0) = \\phi _0 (x),\\,\\phi _t (x,0) = \\phi _1 (x),\\,x \\in \\Omega , \\\\ & \\psi (x,t) = \\phi (x,t) = 0,\\quad x \\in \\partial \\Omega ,\\,t > 0, \\end{aligned} $$  with κ, α, λ positive constants and ω a bounded subset of   This system describes the nonlinear interaction between high frequency electron waves and low frequency ion plasma waves in a homogeneous magnetic field, adapted to model the UHH plasma heating scheme. The system focuses on the vital role of collisions, by considering the non-homogeneous polarization drift for the low frequency …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Birkhäuser-Verlag"
        },
        {
            "Title": "Lower and upper estimates on the excitation threshold for breathers in DNLS lattices",
            "Publication year": 2009,
            "Publication url": "https://idus.us.es/handle/11441/24830",
            "Abstract": "We propose analytical lower and upper estimates on the excitation threshold for breathers (in the form of spatially localized and time periodic solutions) in discrete nonlinear Schrödinger (DNLS) lattices with power nonlinearity. The estimation, depending explicitly on the lattice parameters, is derived by a combination of a comparison argument on appropriate lower bounds depending on the frequency of each solution with a simple and justified heuristic argument. The numerical studies verify that the analytical estimates can be of particular usefulness, as a simple analytical detection of the activation energy for breathers in DNLS lattices.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A lower bound for the power of periodic solutions of the defocusing discrete nonlinear Schrödinger equation",
            "Publication year": 2008,
            "Publication url": "https://www.intlpress.com/site/pub/files/_fulltext/journals/dpde/2008/0005/0001/DPDE-2008-0005-0001-a003.pdf",
            "Abstract": "We derive lower bounds on the power of breather solutions ψn (t)= e− iΩtφn, Ω> 0 of a Discrete Nonlinear Schrödinger Equation with cubic or higher order nonlinearity and site-dependent anharmonic parameter, supplemented with Dirichlet boundary conditions. For the case of a defocusing DNLS, one of the lower bounds depends not only on the dimension of the lattice, the lattice spacing, and the frequency of the periodic solution, but also on the excitation threshold of time periodic and spatially localized solutions of the focusing DNLS, proved by M. Weinstein in Nonlinearity 12, 673–691, 1999. Our simple proof via a direct variational method, makes use of the interpolation inequality proved by Weinstein, and its optimal constant related to the excitation threshold. We also provide existence results (via the mountain pass theorem) and lower bounds on the power of breather solutions for DNLS lattices with sign-changing anharmonic parameter. Numerical studies considering the classical defocusing DNLS, the case of a single nonlinear impurity, as well as a random DNLS lattice are performed, to test the efficiency of the lower bounds.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:YsMSGLbcyi4C",
            "Publisher": "International Press of Boston"
        },
        {
            "Title": "Estimates on the dimension of a global attractor for a semilinear dissipative wave equation on ",
            "Publication year": 2002,
            "Publication url": "https://www.aimsciences.org/article/doi/10.3934/dcds.2002.8.939",
            "Abstract": "We discuss estimates of the Hausdorff and fractal dimension of a global attractor for the semilinear wave equation utt+ δut− φ (x)∆ u+ λ f (u)= η (x), x∈ RN, t≥ 0, with the initial conditions u (x, 0)= u0 (x) and ut (x, 0)= u1 (x), where N≥ 3, δ> 0 and (φ (x))− 1:= g (x) lies in LN/2 (RN)∩ L∞(RN). The energy space X0= D1, 2 (RN)× L2 g (RN) is introduced, to overcome the difficulties related with the non-compactness of operators, which arise in unbounded domains. The estimates on the Hausdorff dimension are in terms of given parameters, due to an asymptotic estimate for the eigenvalues µ of the eigenvalue problem− φ (x)∆ u= µu, x∈ RN.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:9yKSN-GCB0IC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Lower and upper estimates on the excitation threshold for breathers in discrete nonlinear Schrödinger lattices",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3263142",
            "Abstract": "We propose analytical lower and upper estimates on the excitation threshold for breathers (in the form of spatially localized and time periodic solutions) in discrete nonlinear Schrödinger (DNLS) lattices with power nonlinearity. The estimation, depending explicitly on the lattice parameters, is derived by a combination of a comparison argument on appropriate lower bounds depending on the frequency of each solution with a simple and justified heuristic argument. The numerical studies verify that the analytical estimates can be of particular usefulness, as a simple analytical detection of the activation energy for breathers in DNLS lattices.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:Se3iqnhoufwC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Thresholds for breather solutions on the Discrete Nonlinear Schr\\\" odinger Equation with saturable and power nonlinearity",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=13521802708726004492&hl=en&oi=scholarr",
            "Abstract": "We consider the question of existence of nontrivial periodic solutions (called also sometimes, as breather solutions or discrete solitons) for the Discrete Nonlinear Schr\\\" odinger Equation with saturable and power nonlinearity. Theoretical and numerical results are presented, concerning the existence and nonexistence of periodic solutions. The existence results obtained via constrained minimization problems or by a fixed point argument, refer to the DNLS equation, in multidimensional lattices, supplemented with Dirichlet boundary conditions, and sometimes also in infinite lattices. Explicit upper and lower bounds on the total power of the periodic solutions are derived, and numerical studies are performed which test their efficiency. The bounds and thresholds derived for the DNLS equation with saturable and power nonlinearity, are also discussed in comparison with the existing results on the existence of excitation thresholds for periodic solutions, and their dependence on the dimension of the lattice.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:-f6ydRqryjwC",
            "Publisher": "nlin/0609023"
        },
        {
            "Title": "Exciting extreme events in the damped and AC-driven NLS equation through plane-wave initial conditions",
            "Publication year": 2021,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/5.0037462",
            "Abstract": "We investigate, by direct numerical simulations and for certain parametric regimes, the dynamics of the damped and forced nonlinear Schrödinger (NLS) equation in the presence of a time-periodic forcing. It is thus revealed that the wave number of a plane-wave initial condition dictates the number of emerged Peregrine-type rogue waves at the early stages of modulation instability. The formation of these events gives rise to the same number of transient “triangular” spatiotemporal patterns, each of which is reminiscent of the one emerging in the dynamics of the integrable NLS in its semiclassical limit, when supplemented with vanishing initial conditions. We find that the L 2-norm of the spatial derivative and the L 4-norm detect the appearance of rogue waves as local extrema in their evolution. The impact of the various parameters and noisy perturbations of the initial condition in affecting the above behavior is also …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Thresholds for breather solutions on the Discrete Nonlinear Schr\\\" odinger Equation with saturable and power nonlinearity",
            "Publication year": 2006,
            "Publication url": "https://arxiv.org/abs/nlin/0609023",
            "Abstract": "We consider the question of existence of periodic solutions (called breather solutions or discrete solitons) for the Discrete Nonlinear Schr\\\"odinger Equation with saturable and power nonlinearity. Theoretical and numerical results are proved concerning the existence and nonexistence of periodic solutions by a variational approach and a fixed point argument. In the variational approach we are restricted to DNLS lattices with Dirichlet boundary conditions. It is proved that there exists parameters (frequency or nonlinearity parameters) for which the corresponding minimizers satisfy explicit upper and lower bounds on the power. The numerical studies performed indicate that these bounds behave as thresholds for the existence of periodic solutions. The fixed point method considers the case of infinite lattices. Through this method, the existence of a threshold is proved in the case of saturable nonlinearity and an explicit theoretical estimate which is independent on the dimension is given. The numerical studies, testing the efficiency of the bounds derived by both methods, demonstrate that these thresholds are quite sharp estimates of a threshold value on the power needed for the the existence of a breather solution. This it justified by the consideration of limiting cases with respect to the size of the nonlinearity parameters and nonlinearity exponents.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extreme wave events for a nonlinear Schrödinger equation with linear damping and Gaussian driving",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1007570419303776",
            "Abstract": "We perform a numerical study of the initial-boundary value problem, with vanishing boundary conditions, of a driven nonlinear Schrödinger equation (NLS) with linear damping and a Gaussian driver. We identify Peregrine-like rogue waveforms, excited by two different types of vanishing initial data decaying at an algebraic or exponential rate. The observed extreme events emerge on top of a decaying support. Depending on the spatial/temporal scales of the driver, the transient dynamics – prior to the eventual decay of the solutions – may resemble the one in the semiclassical limit of the integrable NLS, or may, e.g., lead to large-amplitude breather-like patterns. The effects of the damping strength and driving amplitude in suppressing or enhancing respectively the relevant features, as well as of the phase of the driver in the formation of a diverse array of spatiotemporal patterns, are numerically analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:UxriW0iASnsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The linearly damped nonlinear Schrödinger equation with localized driving: spatiotemporal decay estimates and the emergence of extreme wave events",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00033-019-1223-y",
            "Abstract": "We prove spatiotemporal algebraically decaying estimates for the density of the solutions of the linearly damped nonlinear Schrödinger equation with localized driving, when supplemented with vanishing boundary conditions. Their derivation is made via a scheme, which incorporates suitable weighted Sobolev spaces and a time-weighted energy method. Numerical simulations examining the dynamics (in the presence of physically relevant examples of driver types and driving amplitude/linear loss regimes), showcase that the suggested decaying rates are proved relevant in describing the transient dynamics of the solutions, prior their decay: They support the emergence of waveforms possessing an algebraic space-time localization (reminiscent of the Peregrine soliton) as first events of the dynamics, but also effectively capture the space-time asymptotics of the numerical solutions.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Energy thresholds for the existence of breather solutions and travelling waves on lattices",
            "Publication year": 2010,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00036810903277135",
            "Abstract": "We discuss the existence of breathers and of energy thresholds for their formation in DNLS lattices with linear and nonlinear impurities. In the case of linear impurities, we present some new results concerning important differences between the attractive and repulsive impurity which is interplaying with a power nonlinearity. These differences concern the coexistence or the existence of staggered and unstaggered breather profile patterns. We also distinguish between the excitation threshold (the positive minimum of the power observed when the dimension of the lattice is greater or equal to some critical value) and explicit analytical lower bounds on the power (predicting the smallest value of the power a discrete breather one-parameter family), which are valid for any dimension. Extended numerical studies in one-, two- and three-dimensional lattices justify that the theoretical bounds can be considered as thresholds …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:UebtZRa9Y70C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Thresholds for breather solutions on the Discrete Nonlinear Schriodinger Equation with saturable and power nonlinearity",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/J_Eilbeck/publication/215634721_Thresholds_for_breather_solutions_of_the_discrete_nonlinear_Schrodinger_equation_with_saturable_and_power_nonlinearity/links/540590030cf2bba34c1d5558/Thresholds-for-breather-solutions-of-the-discrete-nonlinear-Schroedinger-equation-with-saturable-and-power-nonlinearity.pdf",
            "Abstract": "We consider the question of existence of nontrivial periodic solutions (called also sometimes, as breather solutions or discrete solitons) for the Discrete Nonlinear Schriodinger Equation with saturable and power nonlinearity. Theoretical and numerical results are presented, concerning the existence and nonexistence of periodic solutions. The existence results obtained via constrained minimization problems or by a fixed point argument, refer to the DNLS equation, in multidimensional lattices, supplemented with Dirichlet boundary conditions, and sometimes also in infinite lattices. Explicit upper and lower bounds on the total power of the periodic solutions are derived, and numerical studies are performed which test their efficiency. The bounds and thresholds derived for the DNLS equation with saturable and power nonlinearity, are also discussed in comparison with the existing results on the existence of excitation thresholds for periodic solutions, and their dependence on the dimension of the lattice.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Convergence towards attractors for a degenerate Ginzburg-Landau equation",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00033-004-2045-z.pdf",
            "Abstract": "We study a real Ginzburg-Landau equation, in a bounded domain of  with a variable, generally non-smooth diffusion coefficient having a finite number of zeroes. By using the compactness of the embeddings of the weighted Sobolev spaces involved in the functional formulation of the problem, and the associated energy equation, we show the existence of a global attractor. The extension of the main result in the case of an unbounded domain is also discussed, where in addition, the diffusion coefficient has to be unbounded. Some remarks for the case of a complex Ginzburg-Landau equation are given.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Birkhäuser-Verlag"
        },
        {
            "Title": "Collapse for the higher-order nonlinear Schrödinger equation",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278915002328",
            "Abstract": "We examine conditions for finite-time collapse of the solutions of the higher-order nonlinear Schrödinger (NLS) equation incorporating third-order dispersion, self-steepening, linear and nonlinear gain and loss, and Raman scattering; this is a system that appears in many physical contexts as a more realistic generalization of the integrable NLS. By using energy arguments, it is found that the collapse dynamics is chiefly controlled by the linear/nonlinear gain/loss strengths. We identify a critical value of the linear gain, separating the possible decay of solutions to the trivial zero-state, from collapse. The numerical simulations, performed for a wide class of initial data, are found to be in very good agreement with the analytical results, and reveal long-time stability properties of localized solutions. The role of the higher-order effects to the transient dynamics is also revealed in these simulations.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:35N4QoGY0k4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Dynamical transitions between equilibria in a dissipative Klein–Gordon lattice",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022247X18309855",
            "Abstract": "We consider the energy landscape of a dissipative Klein–Gordon lattice with a ϕ 4 on-site potential. Our analysis is based on suitable energy arguments, combined with a discrete version of the Łojasiewicz inequality, in order to justify the convergence to a single, nontrivial equilibrium for all initial configurations of the lattice. Then, global bifurcation theory is explored, to illustrate that in the discrete regime all linear states lead to nonlinear generalizations of equilibrium states. Direct numerical simulations reveal the rich structure of the equilibrium set, consisting of non-trivial topological (kink-shaped) interpolations between the adjacent minima of the on-site potential, and the wealth of dynamical convergence possibilities. These dynamical evolution results also provide insight on the potential stability of the equilibrium branches, and glimpses of the emerging global bifurcation structure, elucidating the role of the …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:P5F9QuxV20EC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "The closeness of localised structures between the Ablowitz-Ladik lattice and Discrete Nonlinear Schr\\\" odinger equations II: Generalised AL and DNLS systems",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.04202",
            "Abstract": "The Ablowitz-Ladik system, being one of the few integrable nonlinear lattices, admits a wide class of analytical solutions, ranging from exact spatially localised solitons to rational solutions in the form of the spatiotemporally localised discrete Peregrine soliton. Proving a closeness result between the solutions of the Ablowitz-Ladik and a wide class of Discrete Nonlinear Schr\\\"odinger systems in a sense of a continuous dependence on their initial data, we establish that such small amplitude waveforms may be supported in the nonintegrable lattices, for significant large times. The nonintegrable systems exhibiting such behavior include a generalisation of the Ablowitz-Ladik system with a power-law nonlinearity and the Discrete Nonlinear Schr\\\"odinger with power-law and saturable nonlinearities. The outcome of numerical simulations illustrates in an excellent agreement with the analytical results the persistence of small amplitude Ablowitz-Ladik analytical solutions in all the nonintegrable systems considered in this work, with the most striking example being that of the Peregine soliton.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finite-temperature dynamics of matter-wave dark solitons in linear and periodic potentials: An example of an antidamped Josephson junction",
            "Publication year": 2012,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.86.033616",
            "Abstract": "We study matter-wave dark solitons in atomic Bose-Einstein condensates (BECs) at finite temperatures, under the effect of linear and periodic potentials. Our model, namely, a dissipative Gross-Pitaevskii equation, is treated analytically by means of dark-soliton perturbation theory and the Landau dynamics approach, which result in a Newtonian equation of motion for the dark-soliton center. This reduced model, which incorporates an effective washboard potential and an antidamping term accounting for finite-temperature effects, constitutes an example of an antidamped Josephson junction. We perform a qualitative (local and global) analysis of the equation of motion. We present results of systematic numerical simulations for both zero-and finite-temperature BECs to highlight the differences between the Hamiltonian and dissipative settings. For sufficiently small wave numbers of the periodic potential and weak …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "On the dynamics of a degenerate damped semilinear wave equation in\\mathbb {R}^ N: the non-compact case",
            "Publication year": 2007,
            "Publication url": "https://www.aimsciences.org/article/exportPdf?id=0c6b72dc-990a-486c-aaf7-e9adeac4a8b4",
            "Abstract": "We show the existence of a global attractor for a degenerate, linearly damped, semilinear wave equation in RN under a new condition concerning a variable non-negative diffusivity. In particular, we show the asymptotic compactness of the induced semiflow by combining the energy equation method with appropriate tail estimates.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:MXK_kJrjxJIC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Ja Jin, Bum",
            "Publication year": 2005,
            "Publication url": "https://core.ac.uk/download/pdf/82594669.pdf",
            "Abstract": "Author Index for Volume 217 Page 1 J. Differential Equations 217 (2005) 513–514 Author \nIndex for Volume 217 A Ackleh, Azmy S., 431 Ascanelli, Alessia, 305 B Barreira, Luis, 204 \nByeon, Jaeyoung, 257 C Cicognani, Massimo, 305 Czarnecki, Marc-Olivier, 501 D Desch, W., \n282 F Fasˇanga, E., 282 G Garcıa, Isaac A., 363 Gordoa, Pilar R., 124 I Imhof, L., 26 Ito, \nKazufumi, 431 J Ja Jin, Bum, 1 Joshi, Nalini, 124 K Kapanadze, David, 456 Karachalios, \nNikos I., 88 L Lenells, Jonatan, 393 Lucia, Marcello, 154 M Ma, Shiwang, 54 P Peralta-Salas, \nD., 249 Pickering, Andrew, 124 R Rajopadhye, SV, 179 Riaza, Ricardo, 377 S Sanchez, \nLuis A., 341 Schulze, B.-Wolfgang, 456 Shafer, Douglas S., 363 doi:10.1016/S0022-0396(05)00312-8 \nPage 2 V Valls, Claudia, 204 W Walcher, S., 26 Y Yannacopoulos, Athanasios N., 88 Z \nZhang, Lei, 154 Zou, Xingfu, 54 Author Index for Volume 217 (2005) 513–514 514 …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collapse dynamics for the discrete nonlinear Schrödinger equation with gain and loss",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1007570418303988",
            "Abstract": "We discuss the finite-time collapse, also referred as blow-up, of the solutions of a discrete nonlinear Schrödinger (DNLS) equation incorporating linear and nonlinear gain and loss. Such an extended DNLS system appears in many inherently discrete physical contexts as a more realistic generalization of the Hamiltonian DNLS lattice. By using energy arguments in finite and infinite dimensional phase spaces (as guided by the boundary conditions imposed), we prove analytical upper and lower bounds for the collapse time, valid for both the defocusing and focusing cases of the model. In addition, the existence of a critical value in the linear loss parameter is underlined, separating finite time-collapse from energy decay. The numerical simulations, performed for a wide class of initial data, not only verified the validity of our bounds, but also revealed that the analytical bounds can be useful in identifying two distinct …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Global existence and blow-up results for some nonlinear wave equations on {}",
            "Publication year": 2001,
            "Publication url": "https://projecteuclid.org/journals/advances-in-differential-equations/volume-6/issue-2/Global-existence-and-blow-up-results-for-some-nonlinear-wave/ade/1357141492.short",
            "Abstract": "We discuss the asymptotic behaviour of solutions of the semilinear hyperbolic problem           $$u_{tt} +\\delta u_t -\\phi (x)\\Delta u = \\lambda \\, u|u|^{\\beta -1}, \\, \\;\\; x \\in \\mathbb           R^N, \\;\\; t \\geq 0,$$ with initial conditions  and ,\\ in the case where   and , a           positive function belonging to .           Under certain conditions we prove the global existence of solutions. Also we examine           blow-up in finite time when the initial data are sufficiently large. The space setting of           the problem is the energy space , where  is an appropriate weighted Hilbert space; see           Section 2.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Khayyam Publishing, Inc."
        },
        {
            "Title": "The number of bound states for a discrete Schrödinger operator on, lattices",
            "Publication year": 2008,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/41/45/455201/meta",
            "Abstract": "We consider the discrete Schrödinger operator in in the case of a potential with negative part in an appropriate ℓ σ-space (decays with an appropriate rate). We present a discrete analog of the method of Li and Yau (1983 Commun. Math. Phys. 88 309–18), proving an explicit upper estimate on the number of bound states, which is independent of the dimension of the lattice. This is a major difference with the continuous counterpart estimate, which is not valid when N= 1, 2. As a consequence, a dimension-independent smallness criterion for the existence of bound states is derived in contrast to the continuous case as well as to the discrete case of vanishing potential. A short comment is made on possible applications of the results to the study of the dynamics of some particular spatially discrete nonlinear systems.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Breathers for the discrete nonlinear Schrödinger equation with nonlinear hopping",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00332-012-9149-y",
            "Abstract": "We discuss the existence of breathers and lower bounds on their power, in nonlinear Schrödinger lattices with nonlinear hopping. Our methods extend from a simple variational approach to fixed-point arguments, deriving lower bounds for the power which can serve as a threshold for the existence of breather solutions. Qualitatively, the theoretical results justify non-existence of breathers below the prescribed lower bounds of the power which depend on the dimension, the parameters of the lattice as well as of the frequency of breathers. In the case of supercritical power nonlinearities we investigate the interplay of these estimates with the optimal constant of the discrete interpolation inequality. Improvements of the general estimates, taking into account the localization of the true breather solutions are derived. Numerical studies in the one-dimensional lattice corroborate the theoretical bounds and illustrate …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "The closeness of the Ablowitz-Ladik lattice to the Discrete Nonlinear Schr\\\" odinger equation",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2102.05332",
            "Abstract": "While the Ablowitz-Ladik lattice is integrable, the Discrete Nonlinear Schr\\\"odinger equation, which is more significant for physical applications, is not. We prove closeness of the solutions of both systems in the sense of a \"continuous dependence\" on their initial data in the  and  metrics. The most striking relevance of the analytical results is that small amplitude solutions of the Ablowitz-Ladik system persist in the Discrete Nonlinear Schr\\\"odinger one. It is shown that the closeness results are also valid in higher dimensional lattices as well as for generalized nonlinearities, the latter is exemplified by generic power-law and saturable ones. For illustration of the applicability of the approach a brief discussion of the results of numerical studies is included, showing that when 1-soliton solution of the Ablowitz-Ladik system is initiated in the Discrete Nonlinear Schr\\\"odinger system with cubic and saturable nonlinearity, its long-term persistence. Thereby excellent agreement of the numerical findings with the theoretical predictions are obtained.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Remarks on the asymptotic behavior of solutions of complex discrete Ginzburg-Landau equations",
            "Publication year": 2005,
            "Publication url": "https://www.aimsciences.org/journals/displayPaperPro.jsp?paperID=1252",
            "Abstract": "We study the asymptotic behavior of complex discrete evolution equations of Ginzburg-Landau type. Depending on the nonlinearity and the data of the problem, we find different dynamical behavior ranging from global existence of solutions and global attractors, to blow up in finite time. We provide estimates for the blow up time, depending not only on the initial data but also on the size of the lattice. The theoretical estimates, are tested by numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:WF5omc3nYNoC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "A remark on the dimension of the attractor for the Dirichlet problem of the complex Ginzburg–Landau equation",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3187781",
            "Abstract": "Using the improved lower bound on the sum of the eigenvalues of the Dirichlet Laplacian proven by Melas [Proc. Am. Math. Soc. 131, 631 (2003)], we remark on a modified estimate of the dimension of the global attractor associated with the complex Ginzburg–Landau (CGL) equation ∂tu−(λ+iα)Δu+(κ+iβ)|u|2u−γu=0, supplemented with Dirichlet boundary conditions. This modified estimate could be of significance depending on β∊R being a small parameter, an important case for the CGL system.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "A new sharp estimate on the dimension of the attractor for the Dirichlet problem of the complex Ginzburg-Landau equation",
            "Publication year": 2008,
            "Publication url": "https://arxiv.org/abs/0803.0817",
            "Abstract": "Using the improved lower bound on the sum of the eigenvalues of the Dirichlet Laplacian proved by A. D. Melas (Proc. Amer. Math. Soc. \\textbf{131} (2003) 631-636), we report a new and sharp estimate for the dimension of the global attractor associated to the complex Ginzburg-Landau equation supplemented with Dirichlet boundary conditions.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy thresholds for the existence of breather solutions and traveling waves on lattices",
            "Publication year": 2010,
            "Publication url": "https://idus.us.es/handle/11441/24831",
            "Abstract": "We discuss the existence of breathers and of energy thresholds for their formation in DNLS lattices with linear and nonlinear impurities. In the case of linear impurities we present some new results concerning important differences between the attractive and repulsive impurity which is interplaying with a power nonlinearity. These differences concern the coexistence or the existence of staggered and unstaggered breather profile patterns. We also distinguish between the excitation threshold (the positive minimum of the power observed when the dimension of the lattice is greater or equal to some critical value) and explicit analytical lower bounds on the power (predicting the smallest value of the power a discrete breather one-parameter family), which are valid for any dimension. Extended numerical studies in one, two and three dimensional lattices justify that the theoretical bounds can be considered as thresholds for the existence of the frequency parametrized families. The discussion reviews and extends the issue of the excitation threshold in lattices with nonlinear impu- rities while lower bounds, with respect to the kinetic energy, are also discussed for traveling waves in FPU periodic lattices.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discrete solitons in optical BEC lattices. Effects of n-body interactions",
            "Publication year": 2006,
            "Publication url": "https://idus.us.es/handle/11441/43094",
            "Abstract": "In this poster we show some recent results concerning discrete solitons in strong optical lattices, which can be described by the Discrete Nonlinear Schrödinger equation. These results are related to a variation of this equation including saturable nonlinearity terms, a feature throughoutly studied in nonlinear optics. After presenting the derivation of the DNLS equation from the Gross-Pitaevskii equation in the presence of a strong optical lattice, we study the existence of thresholds in the quadratic norm of discrete solitons in the cubic DNLS, cubic-quintic DNLS and photorefractive-DNLS. The second part of the poster is devoted to moving discrete solitons in the photorefractive DNLS equation. In the one hand, we study the existence of radiationless moving discrete solitons; on the other hand, we study the collisions of moving discrete solitons.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the dynamics of a degenerate damped semilinear wave equation on RN: the non-compact case",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=5586794026469436160&hl=en&oi=scholarr",
            "Abstract": "We show the existence of a global attractor for a degenerate, linearly damped, semilinear wave equation in RN under a new condition concerning a variable non-negative diffusivity. In particular, we show the asymptotic compactness of the induced semiflow by combining the energy equation method with appropriate tail estimates.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Global attractor for the weakly damped driven Schrödinger equation in  ",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1007/s00030-002-8132-y",
            "Abstract": " We discuss the asymptotic behaviour of the  Schrödinger equation ¶¶ $ iu_{t} + u_{xx} +i\\alpha u -k\\sigma(|u|^{2})u\\, = f, \\;\\; x \\in \\mathbb{R}, \\;\\; t \\geq 0,\\;\\;\\;\\alpha,\\;k>0 $¶¶ with the initial condition  . We prove existence of a global attractor in\\  , by using a decomposition of the semigroup in weighted Sobolev spaces to overcome the noncompactness of the classical Sobolev embeddings.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Birkhäuser Verlag"
        },
        {
            "Title": "Dynamical playground of a higher-order cubic Ginzburg-Landau equation: From orbital connections and limit cycles to invariant tori and the onset of chaos",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.94.012210",
            "Abstract": "The dynamical behavior of a higher-order cubic Ginzburg-Landau equation is found to include a wide range of scenarios due to the interplay of higher-order physically relevant terms. We find that the competition between the third-order dispersion and stimulated Raman scattering effects gives rise to rich dynamics: this extends from Poincaré-Bendixson–type scenarios, in the sense that bounded solutions may converge either to distinct equilibria via orbital connections or to space-time periodic solutions, to the emergence of almost periodic and chaotic behavior. One of our main results is that third-order dispersion has a dominant role in the development of such complex dynamics, since it can be chiefly responsible (even in the absence of other higher-order effects) for the existence of periodic, quasiperiodic, and chaotic spatiotemporal structures. Suitable low-dimensional phase-space diagnostics are devised and …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:70eg2SAEIzsC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "A sharp estimate and change on the dimension of the attractor for singular semilinear parabolic equations",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s00013-008-2864-9",
            "Abstract": "We consider the semilinear reaction diffusion equation , in a bounded domain . We assume the standard “Allen-Cahn-type” nonlinearity, while V is either the inverse square potential  or the borderline potential  (thus including the classical Allen-Cahn-type equation as a special case when ). In the subcritical cases  and   where  is the optimal constant of Hardy and Hardy-type inequalities), we present a new estimate on the dimension of the global attractor. This estimate comes out by an improved lower bound for sums of eigenvalues of the Laplacian by A. D. Melas (Proc. Amer. Math. Soc. 131 (2003), 631–636). The estimate is sharp, revealing the existence of (an explicitly given) threshold value for the ratio of the volume to the moment of inertia of  Ω on which the dimension of the attractor may considerably …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:0EnyYjriUFMC",
            "Publisher": "Birkhäuser-Verlag"
        },
        {
            "Title": "A remark on the existence of breather solutions for the discrete nonlinear Schrödinger equation in infinite lattices: the case of site-dependent anharmonic parameters",
            "Publication year": 2006,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-edinburgh-mathematical-society/article/remark-on-the-existence-of-breather-solutions-for-the-discrete-nonlinear-schrodinger-equation-in-infinite-lattices-the-case-of-sitedependent-anharmonic-parameters/BBB77A8B4EC210BCB97591D61891973F",
            "Abstract": "We discuss the existence of breather solutions for a discrete nonlinear Schrödinger equation in an infinite -dimensional lattice, involving site-dependent anharmonic parameters. We give a simple proof of the existence of (non-trivial) breather solutions based on a variational approach, assuming that the sequence of anharmonic parameters is in an appropriate sequence space (decays with an appropriate rate). We also give a proof of the non-existence of (non-trivial) breather solutions, and discuss a possible physical interpretation of the restrictions, in both the existence and non-existence cases.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Floquet analysis of Kuznetsov-Ma breathers: A path towards spectral stability of rogue waves",
            "Publication year": 2017,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.96.012202",
            "Abstract": "In the present work, we aim at taking a step towards the spectral stability analysis of Peregrine solitons, ie, wave structures that are used to emulate extreme wave events. Given the space-time localized nature of Peregrine solitons, this is a priori a nontrivial task. Our main tool in this effort will be the study of the spectral stability of the periodic generalization of the Peregrine soliton in the evolution variable, namely the Kuznetsov-Ma breather. Given the periodic structure of the latter, we compute the corresponding Floquet multipliers, and examine them in the limit where the period of the orbit tends to infinity. This way, we extrapolate towards the stability of the limiting structure, namely the Peregrine soliton. We find that multiple unstable modes of the background are enhanced, yet no additional unstable eigenmodes arise as the Peregrine limit is approached. We explore the instability evolution also in direct numerical …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:zA6iFVUQeVQC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Existence of exponentially spatially localised breather solutions for lattices of nonlinearly coupled particles: Schauder's fixed point approach",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.00745",
            "Abstract": "We prove the existence of exponentially localised breather solutions for lattices of coupled particles with nonlinear nearest neighbour interaction. The second derivative of the associated interaction potentials is bounded by a power-law growth. The existence problem is formulated in terms of a fixed point equation considered in weighted sequence spaces, which is solved by means of Schauder's Fixed Point Theorem.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamics of a Higher-Order Ginzburg–Landau-Type Equation",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-72563-1_9",
            "Abstract": "We study possible dynamical scenarios associated with a higher-order Ginzburg–Landau-type equation. In particular, first we discuss and prove the existence of a limit set (attractor), capturing the long-time dynamics of the system. Then, we examine conditions for finite-time collapse of the solutions of the model at hand, and find that the collapse dynamics is chiefly controlled by the linear/nonlinear gain/loss strengths. Finally, considering the model as a perturbed nonlinear Schrödinger equation, we employ perturbation theory for solitons to analyze the influence of gain/loss and other higher-order effects on the dynamics of bright and dark solitons.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:J-pR_7NvFogC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The Lefever–Lejeune nonlinear lattice: Convergence dynamics and the structure of equilibrium states",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016727891930394X",
            "Abstract": "We consider the Lefever–Lejeune nonlinear lattice, a spatially discrete propagation-inhibition model describing the growth of vegetation densities in dry-lands. We analytically identify parametric regimes distinguishing between decay (associated with spatial extinction of vegetation patches) and potentially non-trivial time-asymptotics. To gain insight on the convergence dynamics, a stability analysis of spatially uniform states is performed, revealing the existence of a threshold for the discretization parameter which depends on the lattice parameters, below which their destabilization occurs and spatially non-uniform equilibrium states may emerge. Direct numerical simulations justified that the analytical stability criteria and parametric thresholds effectively describe the above transition dynamics and revealed the rich structure of the equilibrium set. Connections with the continuous sibling Lefever–Lejeune partial …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:WbkHhVStYXYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Conservation laws, exact traveling waves and modulation instability for an extended nonlinear Schrödinger equation",
            "Publication year": 2015,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/48/35/355205/meta",
            "Abstract": "We study various properties of solutions of an extended nonlinear Schrödinger (ENLS) equation, which arises in the context of geometric evolution problems—including vortex filament dynamics—and governs propagation of short pulses in optical fibers and nonlinear metamaterials. For the periodic initial-boundary value problem, we derive conservation laws satisfied by local in time, weak H 2 (distributional) solutions, and establish global existence of such weak solutions. The derivation is obtained by a regularization scheme under a balance condition on the coefficients of the linear and nonlinear terms—namely, the Hirota limit of the considered ENLS model. Next, we investigate conditions for the existence of traveling wave solutions, focusing on the case of bright and dark solitons. The balance condition on the coefficients is found to be essential for the existence of exact analytical soliton solutions; furthermore …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:r0BpntZqJG4C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Stationary states of a nonlinear Schrödinger lattice with a harmonic trap",
            "Publication year": 2011,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3625953",
            "Abstract": "We study a discrete nonlinear Schrödinger lattice with a parabolic trapping potential. The model, describing, e.g., an array of repulsive Bose-Einstein condensate droplets confined in the wells of an optical lattice, is analytically and numerically investigated. Starting from the linear limit of the problem, we use global bifurcation theory to rigorously prove that – in the discrete regime – all linear states lead to nonlinear generalizations thereof, which assume the form of a chain of discrete dark solitons (as the density increases). The stability of the ensuing nonlinear states is studied and it is found that the ground state is stable, while the excited states feature a chain of stability/instability bands. We illustrate the mechanisms under which discreteness destabilizes the dark-soliton configurations, which become stable only in the continuum regime. Continuation from the anti-continuum limit is also considered, and a rich …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:5nxA0vEk-isC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Asymptotic behavior of solutions of complex discrete evolution equations: the discrete Ginzburg-Landau equation",
            "Publication year": 2005,
            "Publication url": "https://arxiv.org/abs/math/0503297",
            "Abstract": "We study the asymptotic behavior of complex discrete evolution equations of Ginzburg- Landau type. Depending on the nonlinearity and the data of the problem, we find different dynamical behavior ranging from global existence of solutions and global attractors, to blow up in finite time. We provide estimates for the blow up time, depending not only on the initial data but also on the size of the lattice. Some of the theoretical results, are tested by numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solitary and periodic waves in collisionless plasmas: The Adlam-Allen model revisited",
            "Publication year": 2020,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.102.013209",
            "Abstract": "We consider the Adlam-Allen (AA) system of partial differential equations, which, arguably, is the first model that was introduced to describe solitary waves in the context of propagation of hydrodynamic disturbances in collisionless plasmas. Here, we identify the solitary waves of the model by implementing a dynamical systems approach. The latter suggests that the model also possesses periodic wave solutions—which reduce to the solitary wave in the limiting case of an infinite period—as well as rational solutions that are obtained herein. In addition, employing a long-wave approximation via a relevant multiscale expansion method, we establish the asymptotic reduction of the AA system to the Korteweg–de Vries equation. Such a reduction is not only another justification for the above solitary wave dynamics, but may also offer additional insights for the emergence of other possible plasma waves. Direct numerical …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:tS2w5q8j5-wC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Excitation of Peregrine-type waveforms from vanishing initial conditions in the presence of periodic forcing",
            "Publication year": 2019,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/zna-2018-0540/html",
            "Abstract": "We show by direct numerical simulations that spatiotemporally localised waveforms, strongly reminiscent of the Peregrine rogue wave, can be excited by vanishing initial conditions for the periodically driven nonlinear Schrödinger equation. The emergence of the Peregrine-type waveforms can be potentially justified, in terms of the existence and modulational instability of spatially homogeneous solutions of the model and the continuous dependence of the localised initial data for small time intervals. We also comment on the persistence of the above dynamics, under the presence of small damping effects, and justify that this behaviour should be considered as far from approximations of the corresponding integrable limit.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:dshw04ExmUIC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "On the dynamics of a degenerate parabolic equation: global bifurcation of stationary states and convergence",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s00526-005-0347-4",
            "Abstract": "We study the dynamics of a degenerate parabolic equation with a variable, generally non-smooth diffusion coefficient, which may vanish at some points or be unbounded. We show the existence of a global branch of nonnegative stationary states, covering both the cases of a bounded and an unbounded domain. The global bifurcation of stationary states, implies-in conjuction with the definition of a gradient dynamical system in the natural phase space-that at least in the case of a bounded domain, any solution with nonnegative initial data tends to the trivial or the nonnegative equilibrium. Applications of the global bifurcation result to general degenerate semilinear as well as to quasilinear elliptic equations, are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Asymptotic behavior of solutions for a semibounded nonmonotone evolution equation",
            "Publication year": 2003,
            "Publication url": "https://www.hindawi.com/journals/aaa/2003/914924/",
            "Abstract": "We consider a nonlinear parabolic equation involving nonmonotone diffusion. Existence and uniqueness of solutions are obtained, employing methods for semibounded evolution equations. Also shown is the existence of a global attractor for the corresponding dynamical system.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Self trapping transition for a nonlinear impurity within a linear chain",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=12698015951224859501&hl=en&oi=scholarr",
            "Abstract": "In the present work we revisit the issue of the self-trapping dynamical transition at a nonlinear impurity embedded in an otherwise linear lattice. For our Schrödinger chain example, we present rigorous arguments that establish necessary conditions and corresponding parametric bounds for the transition between linear decay and nonlinear persistence of a defect mode. The proofs combine a contraction mapping approach together with global existence results for the Schrödinger chain and invariance arguments on an appropriately defined nonlinear integral map, which governs the evolution of the defect mode. The results are relevant for both power law nonlinearities and saturable ones. The analytical results are corroborated by numerical computations.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "4 Asymptotic Behavior of Solutions of Some Nonlinearly Damped Wave Equations on RN",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=9065646186909674453&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Amsterdam; Washington, DC: IOS Press, c1992-"
        },
        {
            "Title": "Weyl’s type estimates on the eigenvalues of critical Schrödinger operators",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11005-007-0218-3",
            "Abstract": "We consider on a bounded domain  , the Schrödinger operator − Δ − V supplemented with Dirichlet boundary solutions. The potential V is either the critical inverse square potential V(x) = (N − 2)2/4|x|−2 or the critical borderline potential V(x) =  (1/4)dist(x, ∂Ω)−2. We present explicit asymptotic estimates on the eigenvalues of the critical Schrödinger operator in each case, based on recent results on improved Hardy–Sobolev type inequalities.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Asymptotic behavior of solutions of some nonlinearly damped wave equations on ",
            "Publication year": 2001,
            "Publication url": "https://projecteuclid.org/journalArticle/Download?urlid=tmna%2F1471876533",
            "Abstract": "We discuss the asymptotic behavior of solutions of the nonlinearly damped wave equation utt+ δ| ut| m− 1ut− φ (x)∆ u= λu| u| β− 1, x∈ RN, t≥ 0, with the initial conditions u (x, 0)= u0 (x) and ut (x, 0)= u1 (x), in the case where N≥ 3, δ> 0 and (φ (x))− 1= g (x) is a positive function lying in Lp (RN)∩ L∞(RN), for some p. We prove blow-up of solutions when the source term dominates over the damping, and the initial energy is assumed to be positive. We also discuss global existence energy decay of solutions.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Juliusz P. Schauder Centre for Nonlinear Studies"
        },
        {
            "Title": "Spatiotemporal algebraically localized waveforms for a nonlinear Schrödinger model with gain and loss",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278917301227",
            "Abstract": "We consider the asymptotic behavior of the solutions of a nonlinear Schrödinger (NLS) model incorporating linear and nonlinear gain/loss. First, we describe analytically the dynamical regimes (depending on the gain/loss strengths), for finite-time collapse, decay, and global existence of solutions. Then, for all the above parametric regimes, we use direct numerical simulations to study the dynamics corresponding to algebraically decaying initial data. We identify crucial differences between the dynamics of vanishing initial conditions, and those converging to a finite constant background: in the former (latter) case we find strong (weak) collapse or decay, when the gain/loss parameters are selected from the relevant regimes. One of our main results, is that in all the above regimes, non-vanishing initial data transition through spatiotemporal, algebraically decaying waveforms. While the system is nonintegrable, the …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:dfsIfKJdRG4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A lower bound for the power of periodic solutions of the defocusing discrete nonlinear Schrodinger equation",
            "Publication year": 2008,
            "Publication url": "https://idus.us.es/bitstream/handle/11441/16673/file_1.pdf?sequence=1",
            "Abstract": "We derive a lower bound on the power of time periodic solutions of the defocusing Discrete Nonlinear Schrödinger Equation with power nonlinearity, supplemented with Dirichlet boundary conditions. The lower bound depends not only on the dimension of the lattice, the lattice spacing, and the frequency of the periodic solution, but also on the excitation threshold of time periodic and spatially localized solutions of the focusing DNLS, proved in M. Weinstein, Nonlinearity 12, 673–691, 1999. The simple proof via a direct variational method, makes use of the interpolation inequality proved by M. Weinstein, and its optimal constant related to the excitation threshold. A numerical study is performed to test the efficiency of the lower bound.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Propagation of periodic wave trains along the magnetic field in a collision-free plasma",
            "Publication year": 2020,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8121/abb7bb/meta",
            "Abstract": "In this work, a systematic study, examining the propagation of periodic and solitary waves along the magnetic field in a cold collision-free plasma, is presented. Employing the quasi-neutral approximation and the conservation of momentum flux and energy flux in the frame co-traveling with the wave, the exact analytical solution of the stationary solitary pulse is found analytically in terms of particle densities, parallel and transverse velocities, as well as transverse magnetic fields. Subsequently, this solution is generalized in the form of periodic waveforms represented by cnoidal-type waves. These considerations are fully analytical in the case where the total angular momentum flux L, due to the ion and electron motion together with the contribution due to the Maxwell stresses, vanishes. A graphical representation of all associated fields is also provided.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:8AbLer7MMksC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Global existence and compact attractors for the discrete nonlinear Schrödinger equation",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022039605002123",
            "Abstract": "We study the asymptotic behavior of solutions of discrete nonlinear Schrödinger-type (DNLS) equations. For a conservative system, we consider the global in time solvability and the question of existence of standing wave solutions. Similarities and differences with the continuous counterpart (NLS-partial differential equation) are pointed out. For a dissipative system we prove existence of a global attractor and its stability under finite-dimensional approximations. Similar questions are treated in a weighted phase space. Finally, we propose possible extensions for various types of DNLS equations.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Nonexistence of global solutions of nonlinear Schrodinger equations in non star-shaped domains",
            "Publication year": 2007,
            "Publication url": "https://www.aimsciences.org/journals/displayArticlesnew.jsp?paperID=2856",
            "Abstract": "In this paper, we discuss the nonexistence of global solutions of mixed problems of the nonlinear Schödinger equations with power nonlinearity. When the domain is whole space, there are many results concerning the nonexistence of global solutions (or existence of blow-up solutions) for the equation. For the case of a general domain, there are few studies of blowing-up conditions. The main purpose of this paper is to discuss the nonexistence of global solutions in a deformed tube-shaped domain which is not star-shaped.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:hFOr9nPyWt4C",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Lower and upper estimates on the excitation threshold for breathers in DNLS lattices",
            "Publication year": 2009,
            "Publication url": "https://arxiv.org/abs/0903.2964",
            "Abstract": "We propose analytical lower and upper estimates on the excitation threshold for breathers (in the form of spatially localized and time periodic solutions) in DNLS lattices with power nonlinearity. The estimation depending explicitly on the lattice parameters, is derived by a combination of a comparison argument on appropriate lower bounds depending on the frequency of each solution with a simple and justified heuristic argument. The numerical studies verify that the analytical estimates can be of particular usefulness, as a simple analytical detection of the activation energy for breathers in DNLS lattices.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Global attractors and convergence to equilibrium for degenerate Ginzburg–Landau and parabolic equations",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0362546X05003408",
            "Abstract": "We study the dynamics of a degenerate complex Ginzburg–Landau (CGL), and a real parabolic equation with a variable, generally nonsmooth diffusion coefficient, which may vanish at some points or be unbounded. For the CGL equation, there exists a global attractor in L 2 (Ω). For the parabolic equation, we show the existence of a global branch of nonnegative stationary states. The global bifurcation result, is used in order to establish—in conjunction with the definition of a gradient dynamical system in the natural phase space—that any solution with nonnegative initial data, tends to the trivial or the nonnegative equilibrium.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:8k81kl-MbHgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The semiflow of a reaction diffusion equation with a singular potential",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s00229-009-0284-1",
            "Abstract": "We study the semiflow  defined by a semilinear parabolic equation with a singular square potential . It is known that the Hardy-Poincaré inequality and its improved versions, have a prominent role on the definition of the natural phase space. Our study concerns the case 0 < μ ≤ μ*, where μ* is the optimal constant for the Hardy-Poincaré inequality. On a bounded domain of , we justify the global bifurcation of nontrivial equilibrium solutions for a reaction term f(s) = λs − |s|2γ  s, with λ as a bifurcation parameter. We remark some qualitative differences of the branches in the subcritical case μ < μ* and the critical case μ = μ*. The global bifurcation result is used to show that any solution , initiating form initial data  tends to the unique nonnegative equilibrium.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Self-trapping transition for a nonlinear impurity within a linear chain",
            "Publication year": 2014,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4896565",
            "Abstract": "In the present work, we revisit the issue of the self-trapping dynamical transition at a nonlinear impurity embedded in an otherwise linear lattice. For our Schrödinger chain example, we present rigorous arguments that establish necessary conditions and corresponding parametric bounds for the transition between linear decay and nonlinear persistence of a defect mode. The proofs combine a contraction mapping approach applied to the fully dynamical problem in the case of a 3D-lattice, together with variational arguments for the derivation of parametric bounds for the creation of stationary states associated with the expected fate of the self-trapping dynamical transition. The results are relevant for both power law nonlinearities and saturable ones. The analytical results are corroborated by numerical computations. The latter are performed for cases of different dimension.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:TQgYirikUcIC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Global existence in infinite lattices of nonlinear oscillators: The Discrete Klein-Gordon equation",
            "Publication year": 2006,
            "Publication url": "https://www.cambridge.org/core/journals/glasgow-mathematical-journal/article/global-existence-in-infinite-lattices-of-nonlinear-oscillators-the-discrete-kleingordon-equation/ABA5D17075DF513B034A6FE9AD2A7FB7",
            "Abstract": "Pointing out the difference between the Discrete Nonlinear Schrödinger equation with the classical power law nonlinearity – for which solutions exist globally, independently of the sign and the degree of the nonlinearity, the size of the initial data and the dimension of the lattice – we prove either global existence or nonexistence, in time, for the Discrete Klein-Gordon equation with the same type of nonlinearity (but of “blow-up” sign), under suitable conditions on the initial data, and sometimes on the dimension of the lattice. The results consider both the conservative and the linearly damped lattice. Similarities and differences with the continuous counterparts are remarked. We also make a short comment on the existence of excitation thresholds, for forced solutions of damped and parametrically driven Klein-Gordon lattices.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Kuznetsov–Ma breather-like solutions in the Salerno model",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1140/epjp/s13360-020-00596-1",
            "Abstract": "The Salerno model is a discrete variant of the celebrated nonlinear Schrödinger (NLS) equation interpolating between the discrete NLS (DNLS) equation and completely integrable Ablowitz–Ladik (AL) model by appropriately tuning the relevant homotopy parameter. Although the AL model possesses an explicit time-periodic solution known as the Kuznetsov–Ma (KM) breather, the existence of time-periodic solutions away from the integrable limit has not been studied as of yet. It is thus the purpose of this work to shed light on the existence and stability of time-periodic solutions of the Salerno model. In particular, we vary the homotopy parameter of the model by employing a pseudo-arclength continuation algorithm where time-periodic solutions are identified via fixed-point iterations. We show that the solutions transform into time-periodic patterns featuring small, yet non-decaying far-field oscillations. Remarkably, our …",
            "Abstract entirety": 0,
            "Author pub id": "Pptq4PwAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Asymptotic Behavior of Some Nonlinear Dissipative Hyperbolic Equations on ℝN",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812792617_0127",
            "Abstract": "We consider a Semilinear Hyperbolic Problem on all of ℝN. Existence of attractors and their dimensions are discussed in homogeneous Sobolev and weighted LP-spaces.",
            "Abstract entirety": 1,
            "Author pub id": "Pptq4PwAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        }
    ]
}]