[{
    "name": "Νικόλαος Γεωργουλάς ",
    "romanize name": "Nikolaos Georgoulas ",
    "School-Department": "Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών",
    "University": "duth",
    "Rank": "Καθηγητής",
    "Apella_id": 2974,
    "Scholar name": "Nikolaos Georgoulas",
    "Scholar id": "tqxUr4oAAAAJ",
    "Affiliation": "Professor, Laboratory of Electrical and Electronic Materials Technology, Department of Electrical",
    "Citedby": 679,
    "Interests": [
        "Microelectronics",
        "Optoelectronics",
        "Materials & Devices"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=tqxUr4oAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A model for the dc electrical behavior of bulk-barrier diodes",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1007/s002020100078",
            "Abstract": " This paper presents an analytical model for the dc electrical behavior of bulk barrier diodes (BBD's). The proposed model extends previously published models, and includes analytical expressions for all significant quantities of the device dc performance, i.e. barrier height, current density and ideality factor, with respect to the technological parameters and the applied voltage in both bias conditions. The analytical results have been compared with those obtained using the 2-D device simulator S-PISCES, which takes into account the drift–diffusion theory, as well as a concentration and field dependent mobility, the Shockley–Read–Hall and Auger carrier recombination, and the band gab narrowing. Good agreement was obtained between theory and simulation. The device simulation played a very important role in best understanding BBD's behavior, because it could easily take into account …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Solar radiation prediction model based on Empirical Mode Decomposition",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6958466/",
            "Abstract": "Accurate solar radiation data are a key factor in Photovoltaic system design and installation. Efficient solar radiation time series prediction is regarded as a challenging task for researchers both in the past and at present. This paper deals with solar radiation time series prediction. To date an essential research effort has been made and various methods are proposed that have different mathematical backgrounds, such as artificial neural networks, fuzzy predictors, evolutionary and genetic algorithms. In the present study the solar radiation time series prediction combines the Empirical Mode Decomposition (EMD) and Support Vector Regression (SVR) models. The EMD is an adaptive signal processing technique that decomposes the nonstationary and nonlinear signals into a set of components with a different spatial frequency content. It results in a small set of new time series that are easier to model and predict. The …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Change in transfer and low-frequency noise characteristics of n-channel polysilicon TFTs due to hot-carrier degradation",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1302236/",
            "Abstract": "Results on the impact of hot-carrier effects on the transfer and low-frequency noise characteristics of n-channel poly-crystalline silicon thin-film transistors (polysilicon TFTs) are presented. After stressing at the condition of maximum substrate current, the experimental data show that TFTs suffer from substantial on-current reduction. Through numerical simulation, it is shown that the stress-induced degradation increases the density of the band tail traps in a region extending 200 nm from the drain and the series resistance on the drain side. It is found that the origin of the noise is reverted from carrier number fluctuation for the unstressed to the mobility fluctuation for the stressed device.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effect of vacuum thermal annealing to encapsulated graphene field effect transistors",
            "Publication year": 2016,
            "Publication url": "https://avs.scitation.org/doi/abs/10.1116/1.4952409",
            "Abstract": "Water vapor barriers used for graphene encapsulation can both exclude water from the environment and trap water in the device, preventing annealing from improving device performance. In this paper, the authors investigate the effects of vacuum annealing on encapsulated single layer graphene field effect transistors (SLG-FETs). The stability of GFETs is monitored for a period of up to six months, and different annealing times and atmospheres are tested to recover lost electronic performance. Fabricated encapsulated devices based on a parylene-C/aluminum passivation layers offer increased stability over exposed back-gated devices, but still suffer from a significant Dirac point shift over extended air exposure. Our results show that GFETs subjected to varying annealing times exhibit similar initial behavior, characterized by a substantial reduction of their doping profile due to desorption of oxygen/water molecules …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:TFP_iSt0sucC",
            "Publisher": "American Vacuum Society"
        },
        {
            "Title": "Electrical characteristics and deep level traps study of Au/ZnO: H Schottky diodes",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0749603614002821",
            "Abstract": "The electrical characteristics and the deep level traps of Au Schottky contacts on ZnO:H films have been investigated by temperature-dependent current–voltage (I–V) and deep level transient spectroscopy (DLTS) measurements. The films were deposited with the DC-sputtering, varying the H flow rate in the Ar/H sputtering gas, so that the hydrogen per volume concentration [H2] was 0%, 20%, 33.3%, 50% and 66.6%. We found that for the Schottky diodes with [H2] = 33.3% thermionic emission is the dominant current transport process at low forward voltage, taking into consideration the lateral fluctuations of the barrier height described by a Gaussian distribution model. The domination of trap-assisted current transport mechanisms is possible in the diodes with [H2] = 0%, 20%, 50% and 66.6%. DLTS spectra revealed two electron traps, with activation energies of 0.29 and 0.21 eV, often observed in ZnO and related to …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Rechargeable electrochemical lithium ion cell",
            "Publication year": 2019,
            "Publication url": "https://patents.google.com/patent/US20190260084A1/en",
            "Abstract": "A rechargeable electrochemical lithium-ion cell for energy storage combines active materials (anode, cathode, electrolyte) in a way that it can operate with high energy density (> 200 Wh/kg) and high performance during charging and discharging at a wide temperature range and more specifically at temperatures lower than− 20 C. and at least as low as− 40 C. The present disclosure facilitates the development of systems and devices requiring high energy density storage systems and thus low weight and operation at low temperature conditions with low energy consumption. The present disclosure can be applied to space technology, military applications as well as in the automotive industry where interest is focused on low weight batteries being capable to operate efficiently at low temperatures.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Silicon damage and dopant behavior studies of rapidly thermally processed arsenic-implanted silicon",
            "Publication year": 2003,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16546232",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High frequency monitoring system for integrated water resources management of rivers",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=6290054824726099403&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simulation and experimental results on the switching behaviour of bulk-barrier diodes",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269201001495",
            "Abstract": "In this paper, the switching behaviour of bulk-barrier diodes (BBDs) as a function of technological and operational parameters is studied. This study is based on the transient simulation results obtained with a 2D device simulator (S-PISCES), as well as on experimental results obtained by turn-off measurements on the fabricated structures. The results of this study show that the technological parameters (doping concentrations), as well as the geometrical sizes (middle-layer width and substrate thickness) and the bias conditions (applied voltage), have significant effects on the switching time of BBDs. The appropriate choice of these parameters can reduce the BBD switching time in the picosecond range. Finally, good agreement among theory, simulations and experimental results was achieved.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:WF5omc3nYNoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Cellular Automata Model with Game Theory for Power Management of Hybrid Renewable Energy Smart Grids",
            "Publication year": 2014,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10013",
            "Abstract": "In recent years, control of smart grids that match electricity demand in different sites and forms with supply has been considered as one of the most difficult aspect of smart energy grids design. In this paper we present a Cellular Automata (CA) based approach combined with Game Theory for the enhancement of Power Management Strategies (PMSs) of multiple Hybrid Renewable Energy Systems (HYRES) that form a smart grid for the exchange of energy. More specifically, taking advantage of the local interactions of HYRES we coupled CA principles with Public Goods Game (PGG) for modeling. The presented CA model focuses on providing valuable feedback for PMSs of the understudy HYRES connected in a grid. In this manner, a flexible network based HYRES design is considered and applied to specific HYRESs located in Olvio, near Xanthi, Greece, part of SYSTEMS SUNLIGHT facilities. The proposed model can be applied to the understudy HYRESs grid management to enhance and optimize its PMS based on the provided energy prediction scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:blknAaTinKkC",
            "Publisher": "Springer"
        },
        {
            "Title": "Two dimensional simulation and modeling of the electrical behavior in nanocrystalline silicon thin-film transistors",
            "Publication year": 2008,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2927495",
            "Abstract": "Nanocrystalline silicon thin-film transistors present technological interest in that they combine many of the advantages of amorphous with those of polycrystalline Si structures. Progress in practical implementation of this technology is hampered by limited understanding of the conduction mechanisms in these structures and of the underlying relationship between device behavior and process manufacturing parameters. These mechanisms are explored through detailed simulation that includes model calibration and correlation with experimental results, as well as parametric sensitivity evaluation of this class of devices over the entire range of applied voltage. Through fitting of the tests results, a unique set of density of states was identified that characterizes the particular technology used. The leakage current was attributed to the band to band tunneling and thermal generation-recombination mechanisms. For devices …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:KlAtU1dfN6UC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Substrate current and degradation of n-channel polycrystalline silicon thin-film transistors",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026271404002008",
            "Abstract": "Experimental investigation of the substrate current Isub as a function of the gate voltage has been performed in n-channel polycrystalline silicon thin-film transistors (polysilicon TFTs), considering the drain voltage as a parameter of the study. At low gate voltages, Isub exhibits a peak located close to the threshold voltage of the transistor due to hot-carriers generated by impact ionization. At higher gate voltages, Isub increases monotonically with increasing the gate voltage, which is attributed to the temperature rise owing to self-heating. The degradation behavior of polysilicon TFTs, stressed under two different gate and drain bias conditions that cause the same substrate current due to hot-carrier and self-heating effects, is investigated.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Carbon fiber electrodes enhanced with graphene oxide for supercapacitors",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8259987/",
            "Abstract": "Nowadays, supercapacitors are very effective on a wide range of applications. Data backup, power fail alarms and generally embedded systems require high power density storage components with small dimensions. Graphene-based electrodes are very promising so as to construct thin film lightweight supercapacitors with high specific power. In this contribution, the development and electrochemical characterization of graphene-based electrodes with different fabrication parameters is conferred. In particular, both activated and un-activated carbon fiber was used as substrate and reduced graphene oxide as the active material. It was found that the activation of the carbon fiber offers superior performance in terms of gravimetric capacitance. Finally, Electric Double Layer Capacitors (EDLC's) with gravimetric capacitance of 2.12 F/g, energy density of 244.46 mWh/kg and power density of 54.6 W/kg after 600 charging …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Two dimensional simulation and modeling of the electrical characteristics of the a-SiC/c-Si (p) based, thyristor-like, switches",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931714004705",
            "Abstract": "The electrical characteristics of the Al/a-SiC/c-Si(p)/c-Si(n+)/Al switches were successfully simulated here for the first time. Forward breakover voltage VBF, forward voltage drop VF and anode current simulated values of the device showed very good agreement with the experimental results. Electric field and impact generation rate across the switches are also simulated for different anode current conditions extending to second breakdown region of the device, showing a shifting of the phenomena caused by electric field and impact generation rate, from c-Si(p) region to a-SiC film as anode voltage values increase from VBF up to second breakdown region of the device. A both simulation and experimental based model describing the device behavior, is also presented here. Two critical facts leading to switching transition are proved to be at first a-SiC/c-Si(p) heterojunction breakdown dominated by impact generation …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Study on the Lithiation Mechanism in Micro-Grain Structured Amorphous Silicon Anodes in Lithium-Ion Batteries with the Aid of Impedance Spectroscopy",
            "Publication year": 2016,
            "Publication url": "https://iopscience.iop.org/article/10.1149/MA2016-03/2/581/meta",
            "Abstract": "  It is well known that silicon presents one of the most important anode materials for the improvement of lithium-ion cells in terms of energy density. Indeed, silicon’s high theoretical specific capacity to lithium (more than 3800 mAh/g at room temperature), environmental friendliness, low potential compared to lithium and material abundance turn silicon to a strong candidate for the replacement of carbon-based anodes [1,2]. However, one of the main drawbacks of silicon’s application to the lithium-ion technology is its poor electrochemical cycling stability over several galvanostatic cycles, mainly due to silicon’s huge volume change (around 300%) during lithiation and delithiation that leads to high internal mechanical stress and therefore to film fracturing and delamination [3]. Many alternatives have been proposed that alleviate this mechanical expansion issue either through the use of nanostructured silicon …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Investigation on deep level defects in polycrystalline ZnO thin films",
            "Publication year": 2017,
            "Publication url": "https://avs.scitation.org/doi/abs/10.1116/1.4979691",
            "Abstract": "Deep level traps detection and characterization in polycrystalline ZnO thin films have been investigated by deep level transient spectroscopy (DLTS) on Pd/ZnO Schottky contacts. Τhe influence of different amounts of incorporated hydrogen in ZnO layers on the creation and evolution of these traps has been studied as well. The films were deposited on n-Si substrates with direct current-sputtering, varying the hydrogen, H, flow rate in the Ar/H sputtering gas, so that the H per volume concentration [H2] was 0%, 20%, 33.3%, 50%, and 66.6%. The Pd/ZnO contacts are more stable and reliable for DLTS characterization than the respective Au/ZnO ones. Four deep electron traps were detected in all samples, referred to as traps A, B, C, and D, with respective activation energies of 0.30, 0.21, 0.47, and 0.54 eV. Another trap, E (0.61 eV), was found in the 50% and 66.6% H2 samples. Traps A and B, which are commonly …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:NMxIlDl6LWMC",
            "Publisher": "American Vacuum Society"
        },
        {
            "Title": "Simulation of dye-sensitized solar cells based on a population dynamics model",
            "Publication year": 2012,
            "Publication url": "https://www.ingentaconnect.com/content/ben/cnano/2012/00000008/00000002/art00021",
            "Abstract": "Dye-sensitized solar cells are electrochemical devices with very interesting properties that provide an alternative to the conventional semiconductor solar cell technology. However, the details of the charge transport mechanisms, which include both electronic and ionic transport, are not yet fully understood. In this paper, we present a novel approach to dye-sensitized solar cell modeling and simulation which is based on population dynamics models that have recently been extensively used to model reactions between biological molecules. It is shown that the proposed model can be used to simulate the operation of dye-sensitized solar cells and produces I-V characteristics that are in qualitative agreement with the experimental ones. Furthermore, the model presented here can be used to optimize the characteristics and the design of dye-sensitized solar cells.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Bentham Science Publishers"
        },
        {
            "Title": "Properties of a-Si: H films deposited by RF magnetron sputtering at 95 C",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169433210016387",
            "Abstract": "In this work we have investigated the dependence of optical and electrical properties of RF sputtered undoped a-Si:H films and B or P doped a-Si:H films on hydrogen flow rate (FH). Low deposition temperature of 95 °C was used, a process compatible with low-cost plastic substrates. FTIR spectroscopy and ESR measurements were used for the investigation of Si–Hx bonding configurations, and concentrations of hydrogen and dangling bonds. We found that there is a strong correlation between the total hydrogen concentration, the dangling bonds density and the optoelectronic properties of the films. The best photosensitivity value was found to be 1.4 × 104 for the undoped films. The dark conductivity (σD) of the doped layers varied from 5.9 × 10−8 to 6.5 × 10−6 (Ω cm)−1 for different ratios FAr/FH. These variations are attributed to both the different B and P concentrations in the films (according to SIMS …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:W7OEmFMy1HYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Enhancement of hybrid renewable energy systems control with neural networks applied to weather forecasting: the case of Olvio",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-015-2175-6",
            "Abstract": "In this paper, an intelligent forecasting model, a recurrent neural network (RNN) with nonlinear autoregressive architecture, for daily and hourly solar radiation and wind speed prediction is proposed for the enhancement of the power management strategies (PMSs) of hybrid renewable energy systems (HYRES). The presented model (RNN) is applicable to an autonomous HYRES, where its estimations can be used by a central control unit in order to create in real time the proper PMSs for the efficient subsystems’ utilization and overall process optimization. For this purpose, a flexible network-based design of the HYRES is used and, moreover, applied to a specific system located on Olvio, near Xanthi, Greece, as part of Systems Sunlight S.A. facilities. The simulation results indicated that RNN is capable of assimilating the given information and delivering some satisfactory future estimation achieving …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer London"
        },
        {
            "Title": "High-Energy Micro-grain Silicon Anodes for Lithium-Ion Technology",
            "Publication year": 2015,
            "Publication url": "http://mocast.physics.auth.gr/images/NewPapers/PAPER_23F.compressed%201.pdf",
            "Abstract": "As more and more applications require high energy density electrochemical storage systems that deliver more than 200 Wh/kg, Lithium-‐ion batteries with silicon-‐based anodes provide promising electrochemical properties especially high specific capacity. In this paper, we present a micro-‐grain structured silicon deposited by DC sputtering on special copper foil that serves as current collector. It is demonstrated that high-‐density silicon anodes are obtained with more than 2000 mAh g-‐1 and 2.0 mAh cm-‐2 which can be considered as a commercial value. Finally, it is found that with such anodes the irreversible capacity during the first galvanostatic cycle can be lower than 20%.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electrochemical Impedance Spectroscopy study in micro-grain structured amorphous silicon anodes for lithium-ion batteries",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378775316312241",
            "Abstract": "In this paper, a study of the lithiation mechanism of micro-grain structured silicon anode is presented. Micro-grain amorphous silicon was deposited on special copper foil and it is shown that after several decades of galvanostatic cycles, it preserves its granular nature with minor degradation. In order to shed light on the lithiation mechanisms of the micro-grain silicon, Electrochemical Impedance Spectroscopy (EIS) was conducted on silicon half-cells at various State-of-Charge (SoC) and various discharging current values and the Solid-Electrolyte Interphase (SEI) RSEI and polarization resistance Rpol were determined. Results reveal that Rpol highly increases for cell voltages lower than 0.2 V and it strongly depends on the discharging C-rate. From X-ray Photoelectron Spectroscopy (XPS) measurements combined with surface sputtering, the existence of a LixSiyOz interlayer between SEI and silicon is confirmed …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:k_IJM867U9cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "RAPID THERMAL ANNEALING OF ARSENIC IMPLANTED SILICON FOR THE FORMATION OF ULTRA SHALLOW N+P JUNCTIONS",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810861_0026",
            "Abstract": "Ultra shallow n+p junction formation by lamp based rapid thermal annealing of As implanted Si has been investigated. The effect of different heating rates, i.e. 70, 160 and 200°C/s, on electrical activation, sheet resistance, junction depth and leakage current has been studied. The results obtained have shown that RTA at a high temperature of 1050°C for 10sec, using a high heating rate of 200°C/s, leads to the formation of shallow n+p junctions with low sheet resistance and leakage current, as well as to complete activation of the implanted As.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Solar radiation time-series prediction based on empirical mode decomposition and artificial neural networks",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44654-6_44",
            "Abstract": "This paper presents a new model for daily solar radiation prediction. In order to capture the hidden knowledge of existing data, a time-frequency analysis on past measurements of the solar energy density is carried out. The Hilbert-Huang transform (HHT) is employed for the representation of the daily solar irradiance time series. A set of physical measurements and simulated signals are selected for the time series analysis. The empirical mode decomposition is applied and the adaptive basis of each raw signal is extracted. The decomposed narrow-band amplitude and frequency modulated signals are modelled by using dynamic artificial neural networks (ANNs). Nonlinear autoregressive networks are trained with the average daily solar irradiance as exogenous (independent) input. The instantaneous value of solar radiation density is estimated based on previous values of the time series and previous …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Transparent Graphene Oxide and reduced Graphene Oxide Humidity Sensors",
            "Publication year": 2016,
            "Publication url": "https://www.academia.edu/download/53768461/NN16_Poster.pdf",
            "Abstract": "Graphene oxide (GO) is a promising material for various sensing applications. In this contribution we propose a humidity sensing device based on GO grown on glass substrate. Different devices were fabricated in order to investigate the effect of deposition parameters to sensing capabilities of GO. Furthermore, thermal annealing process was applied to turn GO to reduced graphene oxide (rGO) and measure its behavior as a humidity sensor.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Impact of electrolyte on the electrochemical performance of Lithium-ion half and full cells with Silicon film anodes",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0013468617310459",
            "Abstract": "Amongst anode materials for lithium ion batteries, silicon's high theoretical capacity, environmental friendliness, low potential vs Li/Li+, material abundance and technological maturity, turn it to a strong candidate for the replacement of carbon-based anodes. In this work we studied the influence of various electrolyte solutions and additives to the silicon's stability over cycling. We have to use electrolyte solutions and additives that form a stable Solid Electrolyte Interphase (SEI) layer, which protects silicon's integrity and prolongs its cycle life. In this work, we present the experimental results of half and full cells with silicon anodes with various electrolytes and additives. It becomes obvious that the electrolyte solution plays an immense role to the formation of SEI layer and thus, the electrochemical properties of silicon anodes.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:BqipwSGYUEgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An extensive study of the photocurrent amplification mechanism of silicon bulk-barrier diodes based on simulation and experimental results",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609002005485",
            "Abstract": "In this paper, an extensive study of the photocurrent amplification mechanism of silicon bulk-barrier diodes (BBDs) is presented, based on simulation and experimental results. As a result of this study an analytical model is proposed. The proposed model extends previously published models and includes analytical expressions for all significant quantities of the device optoelectronic behaviour. Such quantities are barrier lowering, photocurrent, quantum efficiency and response speed as functions of the applied voltage, incident light power, light wavelength and modulation frequency, as well as a function of technological parameters. Simulation and experimental results verify the validity of the proposed analytical model, and they show that BBDs are majority carrier photodetectors with high internal photocurrent gain. Compared with common photodetectors, BBDs exhibit a very high sensitivity in the blue region of the …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Electrical characterization of metal/a-SiC: H/Si MIS capacitors for DNA sensor application",
            "Publication year": 2018,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02072177/",
            "Abstract": "Archive ouverte HAL - Electrical characterization of metal/a-SiC:H/Si MIS capacitors for DNA \nsensor application Accéder directement au contenu Accéder directement à la navigation Toggle \nnavigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data \nDocumentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org \nSupport hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par \ndiscipline Par année de publication Par structure de recherche Les portails de l'archive \nRecherche Documentation hal-02072177, version 1 Communication dans un congrès Electrical \ncharacterization of metal/a-SiC:H/Si MIS capacitors for DNA sensor application A. Tataridou 1 F. \nFarmakis 1 Morfouli P. Edwige Bano 2 N. Georgoulas 1 Détails 1 DUTH - Democritus University \nof Thrace 2 IMEP-LAHC - Institut de Microélectronique, Electromagnétisme et - d'et Type l'…",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Studies of ultra shallow n+–p junctions formed by low-energy As-implantation",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510704003691",
            "Abstract": "The generation and the evolution of extended defects in ultra-shallow n+–p junctions, formed by As ion implantation into silicon at low energies of 15, 10 and 5 keV and a dose of 1 × 1015 cm−2, and rapid thermal annealing (RTA) at temperatures of 650 °C ≤ T ≤ 950 °C have been studied using transmission electron microscopy (TEM) measurements. The generated defects in the end-of-range region are dislocation loops, which grew larger and their density decreased with increasing annealing temperature. Reduction in the implantation energy causes a decrease in defect size and density as well as in dissolution temperature. The loops dissolved at 950 °C for 15 and 10 keV, whereas for 5 keV they dissolved at 850 °C. Arsenic transient enhanced diffusion (TED) studied by ToF–SIMS measurements was observed at temperatures above 650 °C for all implantation energies, with markedly less TED for the 5 keV …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Properties of polycrystalline silicon films obtained by rapid thermal processing for micromechanical sensors",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022309304004612",
            "Abstract": "The mechanical and structural properties of as-deposited polycrystalline Si films, grown by rapid thermal processing low-pressure chemical vapor deposition at a high deposition rate of 0.4 μm/min on oxidized Si wafer substrates, were investigated using Raman spectroscopy and transmission electron microscopy (TEM) measurements. The effect of high phosphorus doping using a spin-on technique has also been studied for applications in electrically conducting microstructures. The thermal treatment of the samples, with rapid thermal annealing at 1000 and 1050 °C, as well as with furnace annealing at 1000 °C, results in a reduction of the intra-grain defects in the films. Furthermore, spin-on-coated phosphorus was easily incorporated in the films resulting in an effective electrical activation. All films have shown an overall marginal compressive stress of about 20 MPa; however, the SiO2, in pad form, beneath the …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:kNdYIx-mwKoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Investigation of the H2O Sensing Mechanism of DC-Operated Chemiresistors Based on Graphene Oxide and Thermally Reduced Graphene Oxide",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8733871/",
            "Abstract": "Graphene oxide (GO) is a promising material for H 2 O vapour sensing. However, the H 2 O sensing mechanisms are still under investigation especially in the case of thermally reduced GO. To this purpose, planar devices were fabricated by spin-coating graphene oxide on glass substrates. Ultra high response to H 2 O was recorded but poor repeatability and stability over time were also noted. Three different degrees of thermal reduction were applied to improve material stability. An inverse change of resistance was observed for reduced graphene oxide compared to pure graphene oxide upon interaction with H 2 O. The sensing mechanisms that govern GO and reduced GO behavior were studied based on DC measurements. In the case of GO, strong ionic conductivity was proposed whereas in the case of reduced GO mixed electronic/ionic with the leading mechanism affected by H 2 O percentage in air, degree …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Application of Neural Networks Solar Radiation Prediction for Hybrid Renewable Energy Systems",
            "Publication year": 2014,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10008",
            "Abstract": "In this paper a Recurrent Neural Network (RNN) for solar radiation prediction is proposed for the enhancement of the Power Management Strategies (PMSs) of Hybrid Renewable Energy Systems (HYRES). The presented RNN can offer both daily and hourly prediction concerning solar irradiation forecasting. As a result, the proposed model can be used to predict the Photovoltaic Systems output of the HYRES and provide valuable feedback for PMSs of the understudy autonomous system. To do so a flexible network based design of the HYRES is used and, moreover, applied to a specific system located on Olvio, near Xanthi, Greece, as part of SYSTEMS SUNLIGHT S.A. facilities. As a result, the RNN after training with meteorological data of the aforementioned area is applied to the specific HYRES and successfully manages to enhance and optimize its PMS based on the provided solar radiation prediction.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Amorphous silicon-graphene anodes for lithium ion batteries",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8766/87660E/Amorphous-silicon-graphene-anodes-for-lithium-ion-batteries/10.1117/12.2018435.short",
            "Abstract": "For the development of the next generation lithium-ion batteries it is primordial to investigate new materials as potential candidates towards the increase of the specific capacity of the anode and the new lighter and efficient cells. In this paper we present our investigation on amorphous silicon (a-Si) deposited by DC-sputtering on top of Single Layer Graphene (SLG) grown by Chemical Vapor Deposition (CVD). Our aim being to improve the mechanical properties of the silicon volume change during charging and discharging cycles, it is found that half cells fabricated with such electrodes can achieve specific capacity values above 2000 mAh/g while avoiding large pulverization phenomena. However, it is also found that the a-Si/SLG interface results in high resistance electrodes and decreases cell performance. We suggest that by improving the a-Si/SLG contact resistance, the performance will further improve.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:ZeXyd9-uunAC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Effect of hydrogen on ZnO films and Au/ZnO schottky contacts",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0268-1242/29/4/045012/meta",
            "Abstract": "The structural, optical and electrical properties of ZnO films for different amounts of incorporated hydrogen (H), as well as the electrical characteristics of Au Schottky contacts based on these ZnO layers have been investigated. The films were deposited with the dc-magnetron sputtering technique, varying the H flow rate in the Ar/H sputtering gas. We found a significant improvement of the crystallinity (as obtained from x-ray diffraction spectra), Hall mobility and resistivity as the H concentration per vol.[H 2](during deposition) increases from 0% to 33.3%, which is followed by degradation for further [H 2] increase. A high dependence of the carrier mobility on the grain size is also noted. The Schottky diodes were characterized through current–voltage (I–V) and capacitance–voltage (C–V) measurements at room temperature. In correlation with the basic film properties, we obtained the best results for the Schottky diodes …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:dhFuZR0502QC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Silicon/Lithium Iron Phosphate Safe and High-Energy Density Lithium-Ion Cells: From Material Research to Demonstrator",
            "Publication year": 2016,
            "Publication url": "https://iopscience.iop.org/article/10.1149/MA2016-03/2/864/meta",
            "Abstract": "  Under the German-Greek bilateral R&D cooperation initiative 2013-2015, the Safe High Energy Lithium-ion Cells for Electric Vehicles” – SHELION project aimed to investigate both the anode and the cathode materials with a clear objective to manufacture cells with a specific energy density of more than 150 Wh/kg with adequate cycling charging/discharging performance, complying with industrial manufacturing practices, safety standards and environmental regulations. Towards this direction, this project is focused on the lithium-ion technology and most precisely with the Silicon (Si)-Lithium Iron Phosphate (LFP) electrochemical system that due to silicon should provide excellent energy density and due to LFP excellent safety properties and cost advantage [1]. Silicon as anode in Li-ion technology is considered as a promising material that will eventually replace graphite mainly thanks to its high …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A study of the optical response speed of silicon Bulk-Barrier photodiodes based on simulation results",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Panagiota-Papadopoulou-3/publication/298989564_A_study_of_the_optical_response_speed_of_silicon_Bulk-Barrier_photodiodes_based_on_simulation_results/links/56f0262808aeedbe3ce4310b/A-study-of-the-optical-response-speed-of-silicon-Bulk-Barrier-photodiodes-based-on-simulation-results.pdf",
            "Abstract": "High-speed and high-sensitivity photodetectors are required for high bit-rate optical communication systems. The most commonly used photodetectors in these systems are avalanche photodiodes, pin photodiodes and phototransistors. Because avalanche photodiode has internal gain, it offers the most sensitive receivers at lower frequencies. A pin photodetector is structurally very simple and the speed of this device depends on the intrinsic layer. For high speed operation this layer should be completely depleted [1]. Even though silicon phototransistors show high linearity and sensitivity [2], they present low optical gain and slow response speed, due to the minority carrier storage in the neutral base region. Several types of photodetectors with high sensitivity and quantum efficiency have been developed for optical communications [3-5]. Among these are devices like the a-SiC: H bulk barrier color detector [7], the npn heteroctructure optoelectronic switch [8], the majority–carrier camel diode or the bulk barrier diode [3-15]. Several published models describe the electrical and optoelectronic properties of such structures [3-7, 9, 12]. However, there are only few studies on the optical response speed and the transient behavior of these structures under pulse illumination [7]. In this paper, we present an extensive study of the optical response speed of silicon Bulk–Barrier Diodes (BBDs) using simulation results. Based on the model presented in previous works [6, 12], we have developed an analytical model, which accurately describes the silicon BBD’s cut–off, fc, frequency (optical response speed) when a modulated light is applied, as a function of the …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Study of the effect of switching speed of the a-SiC/c-Si (p)-based, thyristor-like, ultra-high-speed switches, using two-dimensional simulation techniques",
            "Publication year": 2017,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1674-4926/38/5/054001/meta",
            "Abstract": "A parametric study for a series of technological and geometrical parameters affecting rise time of Al/a-SiC/c-Si (p)/c-Si (n+)/Al thyristor-like switches, is presented here for the first time, using two-dimensional simulation techniques. By varying anode current values in simulation procedure we achieved very good agreement between simulation and experimental results for the rising time characteristics of the switch. A series of factors affecting the rising time of the switches are studied here. Two factors among all others studied here, exerting most significant influence, of more than one order of magnitude on the rising time, are a-SiC and c-Si (p) region widths, validating our earlier presented model for device operation. The above widths can be easily varied on device manufacture procedure. We also successfully simulated the rising time characteristics of our earlier presented simulated improved switch, with forward breakover …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Optical response of the Al/a-SiC/c-Si (p)/Au heterojunction structure",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269202000459",
            "Abstract": "In the present work, structures of the form Al/a-SiC/c-Si (p)/Au were fabricated and their optical response was studied in the wavelength region from 350 up to 1000 nm for different thicknesses of the amorphous material, from 600 up to 10,000 Å, as well as the diffusion length of the a-SiC was determined. The spectral response of the Al/a-SiC/c-Si (p)/Au structures for thicknesses, d, of a-SiC> 1000 Å exhibits a maximum value at 800 nm, whereas in the region of wavelengths from 400 up to 600 nm appears a loss mechanism, which may be attributed to the recombination of photogenerated hole–electron pairs in the neutral region of a-SiC. This loss mechanism disappears when the thickness of the neutral region of the amorphous thin film is smaller than the diffusion length of a-SiC. In this case (ie for d< 1000 A ̊), the spectral response of the Al/a-SiC/c-Si (p)/Au structures exhibits an almost constant value of quantum …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Electrical characteristics of Pd Schottky contacts on ZnO films",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1369800113002771",
            "Abstract": "The electrical characteristics of Pd Schottky contacts on ZnO films have been investigated by current-voltage (I–V) and capacitance–voltage (C–V) measurements at different temperatures. ZnO films of two thicknesses (400 nm and 1000 nm) were grown by DC-magnetron sputtering on n-Si substrates. The basic structural, optical and electrical properties of these films are also reported. We compared the two Schottky diodes by means of characteristic parameters, such as rectification ratio, ideality factor (η), barrier height (Φb) and series resistance and obtained better results for the 1000 nm-ZnO Schottky diodes. We also discussed the dependence of I‐V characteristics on temperature and the two distinct linear regions observed at low temperatures are attributed to the existence of two different inhomogeneous barrier heights. From I–V plots in a log-log scale we found that the dominant current-transport mechanism at …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "High Specific Energy Lithium Cells for Space Exploration",
            "Publication year": 2017,
            "Publication url": "https://www.e3s-conferences.org/articles/e3sconf/abs/2017/04/e3sconf_espc2017_08003/e3sconf_espc2017_08003.html",
            "Abstract": "The paper discusses development under an ESA TRP activity (Contract No. 4000109879/13/NL/LvH) with a target of high specific energy Lithium-ion cells, capable of operating under low temperature conditions, i.e. −40 °C. Such cells may be encountered in future exploration missions, which do not consider the use of Radioisotope Heater Units. During the activity, ≥1 Ah silicon-based high energy density prototype cells, following components characterization and optimization, were designed, developed, manufactured and tested under room and subzero temperature conditions down to −40 °C.The developed and tested prototype cells exhibited energy density of around 208 Wh/Kg at room temperature under C/10 charge-discharge rate within voltage range of 2.8 V and 4.1 V. Moreover, the prototype cells could retain and deliver more than 75% of their capacity at room temperature upon cycling at −40 °C …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:GnPB-g6toBAC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Parametric Study and Improvement of the Electrical Characteristics of a-SiC/c-Si (p) Based, Thyristor Like Switches, Using Two Dimensional Simulation Techniques.",
            "Publication year": 2015,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=15550281&AN=108974210&h=p5e9EXJ2UPEUE5DyMomgb0U7rXTp2vTuxIVA43zeu%2B9fYIespkomCohxaWuJe%2BK4C9WxFCVAPojWfe955cJDEw%3D%3D&crl=c",
            "Abstract": "We presented here for the first time a parametric study for a series of technological and geometrical parameters affecting the electrical characteristics of Al/a-SiC/c-Si (p)/c-Si (n+)/Al thyristor like switches using two dimensional simulation techniques. A series of factors affecting the electrical characteristics of the switches are studied here. Three factors, among all others studied here, exerting most significant influence on both first and second breakdown of the switches are amorphous SiC film width and both c-Si (p) region width and doping concentration. The above factors can be easily varied on device manufacture procedure and their combination, also including all other factors studied here, led to improved electrical characteristics of the switches. This means lowering of forward breakover voltage VBF at first breakdown and forward voltage drop VF after first breakdown at the ON state of the switch to 11V and 9.5 V …",
            "Abstract entirety": 0,
            "Author pub id": "tqxUr4oAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High energy density amorphous silicon anodes for lithium ion batteries deposited by DC sputtering",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378775315009854",
            "Abstract": "As more and more applications require high energy density electrochemical storage systems that deliver more than 200 Wh/kg, Lithium-ion batteries with silicon-based anodes provide promising electrochemical properties especially high specific capacity. In this paper, we present micro-grain structured silicon deposited by DC sputtering on special copper foil that serves as current collector. It is demonstrated that high-density silicon anodes are obtained with more than 2000 mAh g−1 and 2.0 mAh cm−2 that can be considered as a commercial value. In addition, irreversible capacity during the first galvanostatic cycle can be lower than 20% for such anodes. Finally, it is found that there exists a clear correlation between the grain-size and the texture of the amorphous silicon to the electrochemical performance of half-cells.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:qUcmZB5y_30C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "INFLUENCE OF LATTICE DEFECTS PRODUCED BY ION IMPLANTATION ON ELECTRICAL AND",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=epjuCAAAQBAJ&oi=fnd&pg=PA435&dq=info:jNh7avPZRcsJ:scholar.google.com&ots=mJt6JdyYY4&sig=Q857IyRetuC3AykMezn95h6EAJc",
            "Abstract": "1. INTRODUCTION Bulk-Barrier-Diodes (BBD) have recently gained growing interest for the ap-plication as photodiodes with internal gain| 3|, mixers 5 and as high sensitivity temperature sensors| 4|. Previous work| 3| considers only the inter-band transition of Optically excited carriers, since the number of lattice defects is minimized after the diode annealing| 6|. The present work studies the influence of lattice defects produced during ion implantation on the BBD electric and optical properties and investigates whether such an influence can be employed into a useful application. Section 2 gives a brief description of BBD and an explanation of the appearance and distribution of lattice defects during ion implantation. Experimental results are reported in section 3 and discussed in section 4.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "The effect of thermal reduction and film thickness on fast response transparent graphene oxide humidity sensors",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877705816335111",
            "Abstract": "Resistive chemical sensors were developed having as sensitive film graphene oxide (GO) spin-coated on glass. Sensor electrical behaviour to room temperature relative humidity was evaluated. High sensitivity characterizes GO sensor. However, it lacks repeatability and long term stability. To this end, we developed spin-coated GO sensors with different active layer thickness, which were subjected to subsequent thermal annealing steps. It was found that the resulting reduced GO (rGO) sensors demonstrate excellent stability compromising, though, the sensitivity which mainly depends on the number of annealing steps and film thickness. Finally, we propose a rapid, transparent, low-power consumption rGO sensor, enabling its use in relevant applications.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:maZDTaKrznsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Permanent water swelling effect in low temperature thermally reduced graphene oxide",
            "Publication year": 2017,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4989681",
            "Abstract": "We demonstrate permanent water trapping in reduced graphene oxide after high relative humidity exposure. For this purpose, we grew graphene oxide films via spin-coating on glass substrates followed by thermal reduction. The electrical resistance of the planar device was then measured. We observed that resistance is significantly increased after water vapor exposure and remains stable even after 250 days in ambient conditions. Various techniques were applied to desorb the water and decrease (recover) the material's resistance, but it was achieved only with low temperature thermal annealing (180 °C) under forming gas (H2/N2 mixture). The permanent effect of water absorption was also detected by x-ray photoelectron spectroscopy.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:ns9cj8rnVeAC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Novel Lithium-Ion Cell for Operation at Very Low Temperatures",
            "Publication year": 2016,
            "Publication url": "http://mntlab.ee.duth.gr/images/doc/poster-p1-0080.pdf",
            "Abstract": "The poster discusses the development under an ESA TRP activity with a target of high specific energy Lithium-ion cells, capable of operating under low temperature conditions, ie-40 oC. Such cells may be encountered in future exploration missions, which do not consider the use of Radioisotope Heater Units. During the activity,≥ 1 Ah silicon-based high energy density prototype cells, following components characterization and optimization, were designed, developed, manufactured and tested under room and sub-zero temperature conditions down to-40 oC.The developed and tested prototype cells exhibited energy density of around 208 Wh/Kg at room temperature under C/10 charge-discharge rate within voltage range of 2.8 V and 4.1 V. Moreover, the prototype cells could retain and deliver more than 75% of their capacity at room temperature upon cycling at-40 oC, demonstrating an energy density of 140 Wh/kg.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Application of neural networks solar radiation prediction for hybrid renewable energy systems",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11071-4_13",
            "Abstract": "In this paper a Recurrent Neural Network (RNN) for solar radiation prediction is proposed for the enhancement of the Power Management Strategies (PMSs) of Hybrid Renewable Energy Systems (HYRES). The presented RNN can offer both daily and hourly prediction concerning solar irradiation forecasting. As a result, the proposed model can be used to predict the Photovoltaic Systems output of the HYRES and provide valuable feedback for PMSs of the understudy autonomous system. To do so a flexible network based design of the HYRES is used and, moreover, applied to a specific system located on Olvio, near Xanthi, Greece, as part of SYSTEMS SUNLIGHT S.A. facilities. As a result, the RNN after training with meteorological data of the aforementioned area is applied to the specific HYRES and successfully manages to enhance and optimize its PMS based on the provided solar radiation prediction.",
            "Abstract entirety": 1,
            "Author pub id": "tqxUr4oAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Cham"
        }
    ]
}]