[{
    "name": "Νικόλαος Μπέλλας ",
    "romanize name": "Nikolaos Bellas ",
    "School-Department": "Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών",
    "University": "uth",
    "Rank": " Καθηγητής",
    "Apella_id": 9811,
    "Scholar name": "Nikolaos Bellas",
    "Scholar id": "vHo4xHoAAAAJ",
    "Affiliation": "Professor, Department of Electrical and Computer Engineering, University of Thessaly",
    "Citedby": 1763,
    "Interests": [
        "Reconfigurable Computing",
        "Embedded Systems",
        "CAD tools",
        "Computer Architecture",
        "Approximate Computing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=vHo4xHoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Enhancing design space exploration by extending CPU/GPU specifications onto FPGAs",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2656207",
            "Abstract": "The design cycle for complex special-purpose computing systems is extremely costly and time-consuming. It involves a multiparametric design space exploration for optimization, followed by design verification. Designers of special purpose VLSI implementations often need to explore parameters, such as optimal bitwidth and data representation, through time-consuming Monte Carlo simulations. A prominent example of this simulation-based exploration process is the design of decoders for error correcting systems, such as the Low-Density Parity-Check (LDPC) codes adopted by modern communication standards, which involves thousands of Monte Carlo runs for each design point. Currently, high-performance computing offers a wide set of acceleration options that range from multicore CPUs to Graphics Processing Units (GPUs) and Field Programmable Gate Arrays (FPGAs). The exploitation of diverse target …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:ZqE1mSdD_DYC",
            "Publisher": "ACM"
        },
        {
            "Title": "An architectural framework for automated streaming kernel selection",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4228117/",
            "Abstract": "Hardware accelerators are increasingly used to extend the computational capabilities of baseline scalar processors to meet the growing performance and power requirements of embedded applications. The challenge to the designer is the extensive human effort required to identify the appropriate kernels to be mapped to gates and to implement a network of accelerators to execute the kernels. In this paper, we present a methodology to automate the selection of streaming kernels in a reconfigurable platform based on the characteristics of the application. The methodology is based on a flow graph that describes the streaming computations and communications. The flow graph is used to efficiently identify the most profitable subset of streaming kernels that optimize performance without exceeding the available area of the reconfigurable fabric.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Method and apparatus for transforming a non-linear lens-distorted image",
            "Publication year": 2012,
            "Publication url": "https://patents.google.com/patent/US8326077B2/en",
            "Abstract": "A method and apparatus for image processing a lens-distorted image (eg, a fisheye image) is provided. The method includes partitioning coordinate points in a selected output image into tiles. The output image is an undistorted rendition of a subset of the lens-distorted image. Coordinate points on a border of the tiles in the output image are selected. For each tile, coordinate points in the lens-distorted image corresponding to each selected coordinate point in the output image are calculated. In addition, for each tile, a bounding box on the lens-distorted image is selected. The bounding box includes the calculated coordinates in the lens-distorted image. The bounding boxes are expanded so that they encompass all coordinate points in the lens-distorted image that map to all coordinate points in their respective corresponding tiles. Output pixel values are generated for each tile from pixel values in their corresponding …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:c59VksA5Vz4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "SoCLog: A real-time, automatically generated logging and profiling mechanism for FPGA-based Systems On Chip",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7577372/",
            "Abstract": "Recent advances in FPGA technology and the proliferation of High Level Synthesis (HLS) tools makes it possible to implement complex System on Chip (SoC) designs that realize complete applications in a single FPGA device. To be able to exploit the large performance vs. area search space of such modern FPGA-based SoCs, system architects must have the appropriate performance analysis tools to evaluate-preferably at runtime-the computational requirements and the data flow of such a system to determine potential performance bottlenecks when running realistic workloads. In this paper we introduce SoCLog, a framework that automatically enhances the platform architecture with additional hardware components used to generate activity logs when the base SoC architecture executes an application. This real-time information can be analyzed by the system designer to expose performance bottlenecks not …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:zUl2_INMlC4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Template-Based Generation of Streaming Accelators from a High Level Presentation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4020952/",
            "Abstract": "A design methodology and prototype tool to automate the design and architectural exploration of hardware accelerators are described in this paper. In comparison to other approaches, we utilize a well-engineered template to enable fast convergence to an area and speed efficient design. We show how this methodology is used for an application set with various architectural configurations",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mapping the AVS video decoder on a heterogeneous dual-core SIMD processor",
            "Publication year": 2009,
            "Publication url": "http://inf-server.inf.uth.gr/~nbellas/publications/dac2009.pdf",
            "Abstract": "In the last few years, we have seen the emergence of a number of video standards for applications spanning from wireless lowrate, to high definition broadcast video. These systems have been implemented with a variety of single core or multi-core technologies from general purpose processors (GPPs) to fixed ASICs.This paper describes the porting of the AVS (Audio Video Standard)[1] video decoder to Tensilica’s Diamond 388VDO dual core [2], a heterogeneous dual core processor which consists of two cores with video specific instruction extensions. The AVS was drafted by the A/V work group of China to replace older and royalty-burdened standards such as MPEG-2 and H. 264 mainly in consumer applications. We start from an open source implementation of the AVS decoder, OpenAVS [3], which targets a general processor platform (GPP), and we gradually transform the code to enable a dual core implementation on the Diamond 388VDO core. Our aim is to achieve real time, 25 fps, progressive D1 resolution (720x576) AVS video decoding. The Diamond family of processors includes preconfigured versions of the 32-bit Xtensa configurable architecture optimized for video encoding and decoding. Diamond uses the capability of the Xtensa architecture to configure a processor core by adding extra application-specific instructions. Its enhanced instruction set supports all popular video codecs such as MPEG-4, H. 264, VC-1 (all in Main Profile) for performance up to D1 resolution, ie 720x576x25 (PAL) or 720x480x30 (NTSC) pixels/sec. Our contribution is to use the Diamond toolset (IDE, cross-compiler, functional and cycle-accurate …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:nqdriD65xNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Significance-aware program execution on unreliable hardware",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3058980",
            "Abstract": "This article introduces a significance-centric programming model and runtime support that sets the supply voltage in a multicore CPU to sub-nominal values to reduce the energy footprint and provide mechanisms to control output quality. The developers specify the significance of application tasks respecting their contribution to the output quality and provide check and repair functions for handling faults. On a multicore system, we evaluate five benchmarks using an energy model that quantifies the energy reduction. When executing the least-significant tasks unreliably, our approach leads to 20% CPU energy reduction with respect to a reliable execution and has minimal quality degradation.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:z8nqeaKD1nsC",
            "Publisher": "ACM"
        },
        {
            "Title": "On the characterization of opencl dwarfs on fixed and reconfigurable platforms",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6868650/",
            "Abstract": "The proliferation of heterogeneous computing platforms presents the parallel computing community with new challenges. One such challenge entails evaluating the efficacy of such parallel architectures and identifying the architectural innovations that ultimately benefit applications. To address this challenge, we need benchmarks that capture the execution patterns (i.e., dwarfs or motifs) of applications, both present and future, in order to guide future hardware design. Furthermore, we desire a common programming model for the benchmarks that facilitates code portability across a wide variety of different processors (e.g., CPU, APU, GPU, FPGA, DSP) and computing environments (e.g., embedded, mobile, desktop, server). As such, we present the latest release of OpenDwarfs, a benchmark suite that currently realizes the Berkeley dwarfs in OpenCL, a vendor-agnostic and open-standard computing language for …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:MIg0yeAD4ggC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Streaming data interface device and method for automatic generation thereof",
            "Publication year": 2005,
            "Publication url": "https://patents.google.com/patent/US20070067508A1/en",
            "Abstract": "A streaming data interface device (700) of a streaming processing system (200) is automatically generated by selecting a set of circuit parameters (610) consistent with a set of circuit constraints and generating (612, 614) a representation of a candidate memory interface device based upon a set of stream descriptors. The candidate streaming data interface device is evaluated (616) with respect to one or more quality metrics and the representation of the candidate streaming processor circuit is output (622) if the candidate memory interface device satisfies a set of processing system constraints and is better in at least one of the one or more quality metrics than other candidate memory interface devices",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Energy-Efficient and Error-Resilient Server Ecosystem Exceeding Conservative Scaling Limits",
            "Publication year": 2016,
            "Publication url": "https://pure.qub.ac.uk/en/publications/an-energy-efficient-and-error-resilient-server-ecosystem-exceedin",
            "Abstract": "The explosive growth of Internet-connected devices will result in a flood of generated data, which will increase the demand for network bandwidth as well as compute power to process the generated data. Consequently, there is a need for more energy efficient servers to empower traditional centralized (Cloud) data-centers as well as emerging decentralized data-centers at the Edges of the Internet. In this paper, we present our approach, which aims at developing a new class of micro-servers–the UniServer-that exceed the conservative energy and performance scaling boundaries by introducing novel mechanisms at all layers of the design stack. The main idea lies on the realization of the intrinsic hardware heterogeneity and the development of mechanisms that will automatically expose the unique varying capabilities of each hardware component and allow their operation at new extended operating points. Low overhead schemes are employed to monitor and predict the hardware behavior and report it to the system software, which is responsible for optimizing the system operation in terms of energy or performance, while guaranteeing non-disruptive operation under extended operating points. To efficiently manage any potential fault that may incur under extended margins, we aim at identifying critical/vulnerable software structures and developing low cost techniques for protecting them. This eventually, allows us to enhance the fault tolerance of the overall system software that is representative of any state of the art cloud data-center, since it adopts a virtualization environment as well as popular resource management packages. Our initial …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:Azgs6IHzeyYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Architectural and compiler techniques for energy reduction in high-performance microprocessors",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/845897/",
            "Abstract": "In this paper, we focus on low-power design techniques for high-performance processors at the architectural and compiler levels. We focus mainly on developing methods for reducing the energy dissipated in the on-chip caches. Energy dissipated in caches represents a substantial portion in the energy budget of today's processors. Extrapolating current trends, this portion is likely to increase in the near future, since the devices devoted to the caches occupy an increasingly larger percentage of the total area of the chip. We propose a method that uses an additional minicache located between the I-Cache and the central processing unit (CPU) core and buffers instructions that are nested within loops and are continuously otherwise fetched from the I-Cache. This mechanism is combined with code modifications, through the compiler, that greatly simplify the required hardware, eliminate unnecessary instruction fetching …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FPGA implementation of a license plate recognition SoC using automatically generated streaming accelerators",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1639437/",
            "Abstract": "Modern FPGA platforms provide the hardware and software infrastructure for building a bus-based system on chip (SoC) that meet the applications requirements. The designer can customize the hardware by selecting from a large number of pre-defined peripherals and fixed IP functions and by providing new hardware, typically expressed using RTL. Hardware accelerators that provide application-specific extensions to the computational capabilities of a system is an efficient mechanism to enhance the performance and reduce the power dissipation. What is missing is an integrated approach to identify the computationally critical parts of the application and to create accelerators starting from a high level representation with a minimal design effort. In this paper, we present an automation methodology and a tool that generates accelerators. We apply the methodology on an FPGA-based license plate recognition (LPR …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for evaluating software on reduced margins hardware",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8416495/",
            "Abstract": "To improve power efficiency, researchers are experimenting with dynamically adjusting the voltage and frequency margins of systems to just above the minimum required for reliable operation. Traditionally, manufacturers did not allow reducing these margins. Consequently, existing studies use system simulators, or software fault-injection methodologies, which are slow, inaccurate and cannot be applied on realistic workloads. However recent CPUs allow the operation outside the nominal voltage/frequency envelope. We present eXtended Margins eXperiment Manager (XM 2 ) which enables the evaluation of software on systems operating outside their nominal margins. It supports both bare-metal and OS-controlled execution using an API to control the fault injection procedure and provides automatic management of experimental campaigns. XM 2  requires, on average, 5.6% extra lines of code and increases the …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:dAp6zn-oMfAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Presynthesis area estimation of reconfigurable streaming accelerators",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4655563/",
            "Abstract": "In this paper, we propose algorithms for presynthesis estimation of hardware cost of a streaming accelerator. Our proposed estimation method helps to accelerate the design-space-exploration phase by orders of magnitude by eliminating the need to perform logic and physical synthesis in each iteration. We present algorithms to perform early cost estimation of resources that are specific to a streaming accelerator, and we evaluate our techniques using an industrial tool flow and a set of streaming benchmarks. For the register-queue sizes, our estimations are in the range of 28%-9% of actual synthesis results on average, depending on the given resource constraints, while the datapath area estimations are within 14%. A typical estimation requires less than a minute, while generating the configuration bitstream of a streaming accelerator can take as much as 30 min according to our experiments. Considering several …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Implementation of the AVS video decoder on a heterogeneous dual-core SIMD processor",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5955207/",
            "Abstract": "Multi-core Application Specific Instruction Processors (ASIPs) are increasingly used in multimedia applications due to their high performance and programmability. Nonetheless, their efficient use requires extensive modifications to the initial code in order to exploit the features of the underlying architecture. In this paper, through the example of implementing Advance Video Coding (AVS) to a heterogeneous dual-core SIMD processor, we present a guide to developers who wish to perform task-level decomposition of any video decoder in a multi-core SIMD system. Through the process of mapping AVS video decoder to a dual-core SIMD processor we aim to explore the different forms of parallelism inherent in a video application and exploit to speed-up AVS decoding in order to achieve real time functionality. Simulation results showed that the extraction of parallelism at all levels of granularity, especially at the higher …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Method and apparatus as pertains to captured image statistics",
            "Publication year": 2006,
            "Publication url": "https://patents.google.com/patent/US20060159339/en",
            "Abstract": "Captured images are provided (101) and analyzed (102) to generate corresponding image content information. One or more statistics are then generated (103) as a function of that image content information and those statistics transmitted (104) to a remote receiver via a communication link (or links) of choice. That statistical information, alone or in combination with similar information from other sources, can then be processed (302) to facilitate developing information regarding preferences, experiences, and/or the like regarding the user (or users) of a given device.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MapVisual: A Visualization Tool for Memory Access Patterns",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2103.05436",
            "Abstract": "Memory bandwidth is strongly correlated to the complexity of the memory access pattern of a running application. To improve memory performance of applications with irregular and/or unpredictable memory patterns, we need tools to analyze these patterns during application development. In this work, we present a software tool for the analysis and visualization of memory access patterns. We perform memory tracing and profiling, we do data processing and filtering, and we use visualization algorithms to produce three dimensional graphs that describe the patterns both in space and in time. Finally, we evaluate our toolflow on a variety of applications.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:DXE8ND7PrJAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "GLOpenCL: Compiler and Run-Time Support for OpenCL on Hardware-and Software-Managed Cache Multicores",
            "Publication year": 2010,
            "Publication url": "http://inf-server.inf.uth.gr/~kodalouk/publications/P1_PACT_SRC_2010.pdf",
            "Abstract": "• Technology advances have enabled the development of a plethora of computation substrates for parallel, high performance computing.• A paradigm shift towards parallel programming.• A multitude of programming models have been proposed that aim at handling most of the technicalities, thus allowing the programmer to focus on algorithmic issues. However, none of them target both homogeneous and heterogeneous multicores as well as accelerators.• OpenCL presents itself as a unified programming standard and framework for heterogeneous multicores that integrate both CPUs and accelerators, such as the Cell BE or GPUs. Although, currently available, vendor specific implementations target either only multicores or accelerators, due to their vast architectural differences.• Motivation: Design and develop GLOpenCL, a unified framework to enable native execution of OpenCL applications on both hardware …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:jlhcAiayVhoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Increasing the profit of cloud providers through dram operation at reduced margins",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9139667/",
            "Abstract": "Energy reduction is a key objective in cloud computing, and DRAM memories are responsible for an important amount of the energy consumption of data center nodes. Vendors adopt very conservative margins for DRAM operating parameters, such as the refresh rate and supply voltage, to guarantee correct operation even under the worst process variation and operating conditions. In this paper, we investigate the exploitation of DRAM margins to improve the energy efficiency of data center nodes, without triggering penalties due to service level agreement (SLA) violations. We introduce a model that captures the most important aspects of job management and system configuration. We also introduce RM-DRAM, a scheduling and node configuration policy that exploits the extended margins of DRAMs to reduce the operator’s cost, considering the tradeoff between the cost of energy consumption and potential SLA …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:hNSvKAmkeYkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "System and method for bad pixel replacement in image processing",
            "Publication year": 2010,
            "Publication url": "https://patents.google.com/patent/US7683948B2/en",
            "Abstract": "A system and method is provided for processing a digital image. The system and method processes image data by replacing bad pixel data in the digital image. Specifically, the system and method replaces bad pixel data in the image data by comparing each pixel to selected neighboring pixels, including pixels of other colors in some cases, and determining if the pixel is likely corrupt, such as from a detective pixel. Corrupted pixels are then replaced using averages, means, maximums, or other statistical functions of select nearby pixels.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementation of a wide-angle lens distortion correction algorithm on the Cell Broadband Engine",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1542275.1542283",
            "Abstract": "Wide-angle lenses are often used in scientific or virtual reality applications to enlarge the field of view of a conventional camera. Wide-angle lens distortion correction is an image warping application which transforms the distorted images back to the natural-looking, central perspective space. This application is characterized by a non-linear streaming memory access pattern that makes main memory bandwidth a key performance limiter.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementation and performance analysis of seal encryption on FPGA, GPU and multi-core processors",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5771249/",
            "Abstract": "Accelerators, such as field programmable gate arrays (FPGAs) and graphics processing units (GPUs), are special purpose processors designed to speed up compute-intensive sections of applications. FPGAs are highly customizable, while GPUs provide massive parallel execution resources and high memory bandwidth. In this paper, we compare the performance of these architectures, presenting a performance study of SEAL, a fast, software-oriented encryption algorithm on a Virtex-6 FPGA, a Graphics Processor Unit (GPU), and Intel Core i7, a 2-way hyper-threaded, 4-core processor. We show that each platform has relative competitive advantages in encrypting an input plaintext using SEAL.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards automatic significance analysis for approximate computing",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7559543/",
            "Abstract": "Several applications may trade-off output quality for energy efficiency by computing only an approximation of their output. Current approaches to software-based approximate computing often require the programmer to specify parts of the code or data structures that can be approximated. A largely unaddressed challenge is how to automate the analysis of the significance of code for the output quality. To this end, we propose a methodology and toolset for automatic significance analysis. We use interval arithmetic and algorithmic differentiation in our profile-driven yet mathematical approach to evaluate the significance of input and intermediate variables for the output of a computation. Our methodology effectively matches decisions of a domain expert in significance characterization for a set of benchmarks, and in some cases offers new insights. Evaluation of the software infrastructure on a multicore x86 platform …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:RtRctb2lSbAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FPGA Architectures for Approximate Dense SLAM Computing",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9473983/",
            "Abstract": "Simultaneous Localization and Mapping (SLAM) is the problem of constructing and continuously updating a map of an unknown environment while keeping track of an agent's trajectory within this environment. SLAM is widely used in robotics, navigation and odometry for augmented and virtual reality. In particular, dense SLAM algorithms construct and update the map at pixel granularity at a high computational and energy cost especially when operating under real-time constraints. Dense SLAM algorithms can be approximated, however care must be taken to ensure that these approximations do not prevent the agent from navigating correctly in the environment. Our work introduces and evaluates a plethora of embedded MPSoC FPGA designs for KinectFusion (a well-known dense SLAM algorithm), featuring a variety of optimizations and approximations, to highlight the interplay between SLAM performance and …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:QsKbpXNoaWkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method and apparatus for transforming a non-linear lens-distorted image",
            "Publication year": 2014,
            "Publication url": "https://patents.google.com/patent/US8855441B2/en",
            "Abstract": "A method and apparatus for image processing a lens-distorted image (eg, a fisheye image) is provided. The method includes partitioning coordinate points in a selected output image into tiles. The output image is an undistorted rendition of a subset of the lens-distorted image. Coordinate points on a border of the tiles in the output image are selected. For each tile, coordinate points in the lens-distorted image corresponding to each selected coordinate point in the output image are calculated. In addition, for each tile, a bounding box on the lens-distorted image is selected. The bounding box includes the calculated coordinates in the lens-distorted image. The bounding boxes are expanded so that they encompass all coordinate points in the lens-distorted image that map to all coordinate points in their respective corresponding tiles. Output pixel values are generated for each tile from pixel values in their corresponding …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:AzKEL7Gb_04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Significance-Driven Programming Framework for Energy-Constrained Approximate Computing",
            "Publication year": 2015,
            "Publication url": "https://pureadmin.qub.ac.uk/ws/files/17173230/main.pdf",
            "Abstract": "Approximate execution is a viable technique for energy-constrained environments, provided that applications have the mechanisms to produce outputs of the highest possible quality within the given energy budget.We introduce a framework for energy-constrained execution with controlled and graceful quality loss. A simple programming model allows users to express the relative importance of computations for the quality of the end result, as well as minimum quality requirements. The significance-aware runtime system uses an application-specific analytical energy model to identify the degree of concurrency and approximation that maximizes quality while meeting user-specified energy constraints. Evaluation on a dual-socket 8-core server shows that the proposed framework predicts the optimal configuration with high accuracy, enabling energy-constrained executions that result in significantly higher quality compared to loop perforation, a compiler approximation technique.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:TaaCk18tZOkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "high-performance",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.377.754",
            "Abstract": "CiteSeerX — high-performance Documents Authors Tables Log in Sign up MetaCart DMCA \nDonate CiteSeerX logo Documents: Advanced Search Include Citations Authors: Advanced \nSearch Include Citations Tables: DMCA high-performance Cached Download as a PDF \nDownload Links [www.cs.york.ac.uk] [www.cecs.uci.edu] Save to List Add to Collection Correct \nErrors Monitor Changes by Nikolaos Bellas , Ibrahim Hajj , Constantine Polychronopoulos \nSummary Citations Active Bibliography Co-citation Clustered Documents Version History Share \nFacebook Twitter Reddit Bibsonomy OpenURL Abstract dynamic cache management \ntechniques to reduce energy in a Keyphrases dynamic cache management technique Powered \nby: Apache Solr About CiteSeerX Submit and Index Documents Privacy Policy Help Data Source \nContact Us Developed at and hosted by The College of Information Sciences and © 2007-…",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:EaFouW7jFu4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Synthesis of platform architectures from OpenCL programs",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5771271/",
            "Abstract": "The problem of automatically generating hardware modules from a high level representation of an application has been at the research forefront in the last few years. In this paper, we use OpenCL, an industry supported standard for writing programs that execute on multicore platforms and accelerators such as GPUs. Our architectural synthesis tool, SOpenCL (Silicon-OpenCL), adapts OpenCL into a novel hardware design flow which efficiently maps coarse and fine-grained parallelism of an application onto an FPGA reconfigurable fabric. SOpenCL is based on a source-to-source code transformation step that coarsens the OpenCL fine-grained parallelism into a series of nested loops, and on a template-based hardware generation back-end that configures the accelerator based on the functionality and the application performance and area requirements. Our experimentation with a variety of OpenCL and C kernel …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low–power VLSI architecture for intra prediction in h. 264",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_60",
            "Abstract": "The H.264 video coding standard can achieve considerably higher coding efficiency than previous standards. The key to this high code efficiency are mainly the Intra and Inter prediction modes provided by the standard. However, the compression efficiency of the H264 standard comes at the cost of increased complexity of the encoder. Therefore it is very important to design video architectures that minimize the cost of the prediction modes in terms of area, power dissipation and design complexity. A common aspect of the Inter and Intra Prediction modes, is the Sum of Absolute Differences (SAD). In this paper we present a new algorithm that can replace the SAD in Intra Prediction, and which provides a more efficient hardware implementation.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Energy minimization on heterogeneous systems through approximate computing",
            "Publication year": 2016,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-61499-621-7-741",
            "Abstract": "Energy efficiency is a prime concern for both HPC and conventional workloads. Heterogeneous systems typically improve energy efficiency at the expense of increased programmer effort. A novel, complementary approach is approximating selected computations in order to minimize the energy footprint of applications. Not all applications or application components are amenable to this method, as approximations may be detrimental to the quality of the end result. Therefore the programmer should be able to express algorithmic wisdom on the importance of specific computations for the quality of the end-result and thus their tolerance to approximations.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:ymY9cBF3mdcC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "An image processing pipeline with digital compensation of low cost optics for mobile telephony",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4036833/",
            "Abstract": "As digital imaging becomes more prevalent in consumer products, the industry strives to reduce the cost and the complexity of imaging solutions and, at the same time, to improve the color quality and resolution of the images. The proliferation of imaging in mobile phones, digital cameras, webcams, toys, etc. creates the need for a low cost, small footprint image sensor. Nowadays, sensor optics account for approximately half the cost of an image sensor system for a camera phone, and their cost does not scale down as fast as the cost of semiconductors. In this paper, we describe the algorithms and the hardware implementation of a novel color processing chain that uses image processing techniques to compensate for the spatial variations in image attributes and quality due to low cost optics. If left uncorrected, these variations produce undesirable visual effects and lead to unacceptable image quality. Besides the …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using dynamic cache management techniques to reduce energy in general purpose processors",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/902264/",
            "Abstract": "The memory hierarchy of high-performance and embedded processors has been shown to be one of the major energy consumers. For example, the Level-1 (L1) instruction cache (I-Cache) of the StrongARM processor accounts for 27% of the power dissipation of the whole chip, whereas the instruction fetch unit (IFU) and the I-Cache of Intel's Pentium Pro processor are the single most important power consuming modules with 14% of the total power dissipation [2]. Extrapolating current trends, this portion is likely to increase in the near future, since the devices devoted to the caches occupy an increasingly larger percentage of the total area of the chip. In this paper, we propose a technique that uses an additional mini cache, the LO-Cache, located between the I-Cache and the CPU core. This mechanism can provide the instruction stream to the data path and, when managed properly, it can effectively eliminate the …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy efficiency through significance-based computing",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6861903/",
            "Abstract": "An extension of approximate computing, significance-based computing exploits applications' inherent error resiliency and offers a new structural paradigm that strategically relaxes full computational precision to provide significant energy savings with minimal performance degradation.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:-yGd096yOn8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "System and method for roll-off correction in image processing",
            "Publication year": 2009,
            "Publication url": "https://patents.google.com/patent/US7580070B2/en",
            "Abstract": "A system and method is provided for processing a digital image. The system and method processes image data by correcting for roll-off variability in the digital image. The system and method corrects for roll-off in image data by determining for each pixel a roll-off contour in which the pixel resides and adjusting that pixel based upon its roll-off contour, which in turn, depends upon its location on the image plane.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic generation of a streaming processor circuit",
            "Publication year": 2007,
            "Publication url": "https://patents.google.com/patent/US7305649B2/en",
            "Abstract": "A streaming processor circuit of a processing system is automatically generated by selecting a set of circuit parameters consistent with a set of circuit constraints and generating a representation of a candidate streaming processor circuit based upon the set of circuit parameters to execute one or more iterations of a computation specified by a streaming data flow graph. The candidate streaming processor circuit is evaluated with respect to one or more quality metrics and the representation of the candidate streaming processor circuit is output if the candidate streaming processor circuit satisfies a set of processing system constraints and is better in at least one of the one or more quality metrics than other candidate streaming processor circuits.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A programming model and runtime system for approximation-aware heterogeneous computing",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8056774/",
            "Abstract": "Heterogeneous platforms that include diverse architectures such as multicore CPUs, FPGAs and GPUs are becoming very popular due to their superior performance and energy efficiency. Besides heterogeneity, a promising approach for minimizing energy consumption is through approximate computing which relaxes the requirement that all parts of a program are considered equally important to the output quality, thus, all should be executed at full accuracy. Our work extends a traditional OpenMP-like programming model and runtime system to support seamless execution on hybrid architectures with approximation semantics. Starting from a common application code, annotated with our programming model, the programmer can not only target heterogeneous architectures comprising CPU, FPGA and GPU components, but can also regulate the amount of approximation. We evaluate our framework on a number of …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:37UQlXuwjP4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pre-synthesis Queue Size Estimation of Streaming Data Flow Graphs",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4020942/",
            "Abstract": "In this paper the authors propose a pre-synthesis register queue size estimation technique for an unscheduled streaming DFG (sDFG) for pipelined synthesis. Our estimation method first designates a minimum queue size to each communication edge of the sDFG based on the ALAP value of the source node and ASAP value of the sink node of that edge. Our aim is to further refine this initial minimum queue size estimation. Our main tool is based on the likelihood estimation that the source node may actually be producing data before its ALAP time, and likewise, the sink node may actually be consuming data after its ASAP time",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic generation of streaming data interface circuit",
            "Publication year": 2009,
            "Publication url": "https://patents.google.com/patent/US7603492B2/en",
            "Abstract": "A streaming data interface device (700) of a streaming processing system (200) is automatically generated by selecting a set of circuit parameters (610) consistent with a set of circuit constraints and generating (612, 614) a representation of a candidate memory interface device based upon a set of stream descriptors. The candidate streaming data interface device is evaluated (616) with respect to one or more quality metrics and the representation of the candidate streaming processor circuit is output (622) if the candidate memory interface device satisfies a set of processing system constraints and is better in at least one of the one or more quality metrics than other candidate memory interface devices.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending a Stream Programming Paradigm to Hardware Accelerator Platforms",
            "Publication year": 2009,
            "Publication url": "http://inf-server.inf.uth.gr/~nbellas/publications/saahpc2009.pdf",
            "Abstract": "High performance stream processing is computationally intensive and localized, performing the same operations on many data elements. These characteristics lend themselves for efficient hardware acceleration. In this paper, we describe a streaming programming model in which computation and data communication are explicitly separated and optimized. We then briefly describe hardware accelerators using the streaming programming model in two forms: an SoC coprocessor called RSVP (Reconfigurable Streaming Vector Processor), and a synthesizable hardware accelerator using our architectural synthesis tool called Proteus. We provide a retrospective of performance, cumulating more than eight years of research in streaming hardware accelerators.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:hQUaER0FWQ4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic Undervolting to Improve Energy Efficiency on Multicore X86 CPUs",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9123555/",
            "Abstract": "Chip manufacturers introduce redundancy at various levels of CPU design to guarantee correct operation, even for worst-case combinations of non-idealities in process variation and system operating conditions. This redundancy is implemented partly in the form of voltage margins. However, for a wide range of real-world execution scenarios these margins are excessive and merely translate to increased power consumption, hindering the effort towards higher energy efficiency in both HPC and general purpose computing. Our study on the x86-64 Haswell and Skylake multicore microarchitectures reveals wide voltage margins, which vary across different microarchitectures, different chip parts of the same microarchitecture, and across different workloads. We find that it is necessary to quantify voltage margins using multi-threaded and multi-instance workloads, as characterization with single-threaded and single-instance …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:9DLIHnF0jcYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fisheye lens distortion correction on multicore and hardware accelerator platforms",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5470360/",
            "Abstract": "Wide-angle (fisheye) lenses are often used in virtual reality and computer vision applications to widen the field of view of conventional cameras. Those lenses, however, distort images. For most real-world applications the video stream needs to be transformed, at real-time (20 frames/sec or better), back to the natural-looking, central perspective space. This paper presents the implementation, optimization and characterization of a fisheye lens distortion correction application on three platforms: a conventional, homogeneous multicore processor by Intel, a heterogeneous multicore (Cell BE), and an FPGA implementing an automatically generated streaming accelerator. We evaluate the interaction of the application with those architectures using both high- and low-level performance metrics. In macroscopic terms, we find that todays mainstream conventional multicores are not effective in supporting real-time distortion …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Virtual memory translation unit for multimedia accelerators",
            "Publication year": 2006,
            "Publication url": "https://patents.google.com/patent/US7073041B2/en",
            "Abstract": "A method and system for virtual memory translation of data represented in a multidimensional coordinate system when the physical memory may be located in more than one physical memory location. The translation of one or more virtual addresses into one or more accesses to one or more physical memories is achieved by representing each address of each element of a memory of the one or more physical memories as a point in a Cartesian coordinate system wherein consecutive points in the Cartesian coordinate system represent virtual memory addresses corresponding to elements from different physical memories of the one or more physical memories. Points in the Cartesian coordinate system are translated into one or more corresponding physical memory addresses, and read or write operations may be performed relative to these physical memory addresses. Multiple read or write operations may be …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "OpenDwarfs: Characterization of Dwarf-Based Benchmarks on Fixed and Reconfigurable Architectures.",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s11265-015-1051-z",
            "Abstract": "The proliferation of heterogeneous computing platforms presents the parallel computing community with new challenges. One such challenge entails evaluating the efficacy of such parallel architectures and identifying the architectural innovations that ultimately benefit applications. To address this challenge, we need benchmarks that capture the execution patterns (i.e., dwarfs or motifs) of applications, both present and future, in order to guide future hardware design. Furthermore, we desire a common programming model for the benchmarks that facilitates code portability across a wide variety of different processors (e.g., CPU, APU, GPU, FPGA, DSP) and computing environments (e.g., embedded, mobile, desktop, server). As such, we present the latest release of OpenDwarfs, a benchmark suite that currently realizes the Berkeley dwarfs in OpenCL, a vendor-agnostic and open-standard computing …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:LK8CI43ZvvMC",
            "Publisher": "Springer"
        },
        {
            "Title": "An energy-efficient and error-resilient server ecosystem exceeding conservative scaling limits",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8342175/",
            "Abstract": "The explosive growth of Internet-connected devices will soon result in a flood of generated data, which will increase the demand for network bandwidth as well as compute power to process the generated data. Consequently, there is a need for more energy efficient servers to empower traditional centralized Cloud data-centers as well as emerging decentralized data-centers at the Edges of the Cloud. In this paper, we present our approach, which aims at developing a new class of micro-servers - the UniServer - that exceed the conservative energy and performance scaling boundaries by introducing novel mechanisms at all layers of the design stack. The main idea lies on the realization of the intrinsic hardware heterogeneity and the development of mechanisms that will automatically expose the unique varying capabilities of each hardware. Low overhead schemes are employed to monitor and predict the hardware …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:Ic1VZgkJnDsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Grammar Induction Method for Clustering of Operations in Complex FPGA Designs.",
            "Publication year": 2014,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:KWzIFqRkAKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SCoRPiO: Significance Based Computing for Reliability and Power Optimization",
            "Publication year": 2016,
            "Publication url": "https://pure.qub.ac.uk/en/publications/scorpio-significance-based-computing-for-reliability-and-power-op",
            "Abstract": "SCoRPiO: Significance Based Computing for Reliability and Power Optimization — Queen's \nUniversity Belfast Skip to main navigation Skip to search Skip to main content Queen's University \nBelfast Logo Help & FAQ Home Profiles Organisations Research output Projects Impact \nDatasets Activities Prizes Press / Media Student theses Facilities Search by expertise, name \nor affiliation SCoRPiO: Significance Based Computing for Reliability and Power Optimization \nVassilis Vassiliadis, Konstantinos Parasyris, Christos D. Antonopoulos, Nikolaos Bellas, Jan \nRiehme, Dimitrios Nikolopoulos School of Electronics, Electrical Engineering and Computer \nScience Institute of Electronics, Communications & Information Technology Research output: \nContribution to conference › Poster › peer-review Overview Projects (1) Original language \nEnglish Number of pages 1 Publication status Accepted - 18 Mar 2016 Event 2016 on Code ((…",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:oTdOBqtIf_kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "GemFI: A fault injection tool for studying the behavior of applications on unreliable substrates",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6903616/",
            "Abstract": "Dependable computing on unreliable substrates is the next challenge the computing community needs to overcome due to both manufacturing limitations in low geometries and the necessity to aggressively minimize power consumption. System designers often need to analyze the way hardware faults manifest as errors at the architectural level and how these errors affect application correctness. This paper introduces GemFI, a fault injection tool based on the cycle accurate full system simulator Gem5. GemFI provides fault injection methods and is easily extensible to support future fault models. It also supports multiple processor models and ISAs and allows fault injection in both functional and cycle-accurate simulations. GemFI offers fast-forwarding of simulation campaigns via check pointing. Moreover, it facilitates the parallel execution of campaign experiments on a network of workstations. In order to validate and …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:NxmKEeNBbOMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting CPU Voltage Margins to Increase the Profit of Cloud Infrastructure Providers",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8752811/",
            "Abstract": "Energy efficiency is a major concern for cloud computing, with CPUs accounting a significant fraction of datacenter nodes power consumption. CPU manufacturers introduce voltage margins to guarantee correct operation. However, these are unnecessarily wide for real-world execution scenarios, and translate to increased power consumption. In this paper, we investigate how such margins can be exploited by infrastructure operators, by selectively undervolting nodes, at the controlled risk of inducing failures and activating service-level agreement (SLA) violation penalties. We model the problem in a formal way, capturing the most important aspects that drive VM management and system configuration decisions. Then, we introduce XM-VFS policy that reduces infrastructure operator costs by reducing voltage margins, and compare it with the state-of-the-art which employs dynamic voltage-frequency scaling (DVFS …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:sfnaS5RM6jYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Architectures for SLAM and Augmented Reality Computing",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9556428/",
            "Abstract": "In the next few years, new demanding applications will be supported on mobile platforms by reconciling two conflicting requirements: high performance (often with real-time limitations) and low power consumption. The objective of the vipGPU project is to develop hardware and software technology to provide efficient support for two such application scenarios, namely (a) simultaneous localization and mapping (SLAM) in mobile robotics systems, and (b) virtual reality (VR) in portable devices to simulate serious games with emphasis on simulating surgical interventions and medical training in general. In this project, we aim at developing a new heterogeneous platform consisting of hardware accelerators for low power embedded systems optimized (at the hardware and software level) for the implementation of the two applications mentioned above.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:6VlyvFCUEfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "GLOpenCL: OpenCL support on hardware-and software-managed cache multicores",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1944862.1944868",
            "Abstract": "OpenCL is an industry supported standard for writing programs that execute on multicore platforms as well as on accelerators, such as GPUs or the SPEs of the Cell BE In this paper we introduce GLOpenCL, a unified development framework which supports OpenCL on both homogeneous, shared memory, as well as on heterogeneous, distributed memory multicores. The framework consists of a compiler, based on the LLVM compiler infrastructure, and a run-time library, sharing the same basic architecture across all target platforms. The compiler recognizes OpenCL constructs, performs source-to-source code transformations targeting both efficiency and semantic correctness, and adds calls to the run-time library. The latter offers functionality for work creation, management and execution, as well as for data transfers. We evaluate our framework using benchmarks from the distributions of OpenCL implementations …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method and apparatus to facilitate visual augmentation of perceived reality",
            "Publication year": 2006,
            "Publication url": "https://patents.google.com/patent/US20060262140A1/en",
            "Abstract": "A visual reality augmentation apparatus (300) comprises one or more (substantially) real time reality context input stages (301, 302) that provide corresponding reality context information to a reality content detector (303). The latter provides detected object information to an augmented reality content display (304) that provides augmentation information (via, for example, projection display techniques) to augment the real world scene being viewed by a viewer. In a preferred approach a direction-of-gaze detector (305) detects the viewer's gaze direction. That information then serves to facilitate positional synchronization of the augmentation information to the viewer's point of view of the corresponding real world information.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementation and performance comparison of the motion compensation kernel of the AVS video decoder on FPGA, GPU and multicore processors",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5771286/",
            "Abstract": "Next generation video standards have strict and increasing performance demands due to real-time requirements and the trend towards higher frame resolutions and bit rates. Leveraging the advantages of reconfigurable logic and emerging multi-core processor architectures to exploit all levels of parallelism of such workloads is necessary to achieve real time functionality at a reasonable cost.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring Automatically Generated Platforms in High Performance FPGAs",
            "Publication year": 2016,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-61499-621-7-563",
            "Abstract": "Incorporating FPGA-based acceleration in high performance systems demands efficient generation of complete system architecture with multiple accelerators, memory hierarchies, bus structures and interfaces. In this work we explore a set of heuristics for complete system generation, with the objective of developing automatable methodology for system level architectural exploration and generation. Our experimental analysis on two test cases demonstrates that applying a set of system optimization heuristics incrementally on a baseline system configuration, we can converge to efficient system designs and reach target performance.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:_AeoHAGD03cC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A programmable, high performance vector array unit used for real-time motion estimation",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1220868/",
            "Abstract": "The MPEG-4 and H.263 video standards are enabling technologies for the proliferation of wireless multimedia applications in 3G systems. For video encoding, the motion estimation (ME) stage is typically the most demanding in terms of performance and bandwidth requirements, and is usually implemented through dedicated hardware, especially in systems with stringent power requirements. This approach, however, cannot exploit any algorithm advances on motion estimation algorithms, and requires major hardware re-design in case of modified specifications or standards. This paper describes the architecture of a programmable motion estimation unit that is used as part of a larger wireless video encoding system. An instruction set architecture (ISA) allows the development of various ME algorithms in software without the need to re-design portion of the chip.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reconfigurable streaming architectures for embedded smart cameras",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1640566/",
            "Abstract": "Smart cameras using FPGAs require an automation method to simplify the design process and to ensure both computation and memory performance are met. Reconfigurable logic allows exploration of different hardware accelerators and memory-hierarchy configurations based on application needs. This paper presents a streaming architecture template that is generated from high level program descriptions. A smart camera development platform, the software architecture, and demonstration template are also described.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Massively parallel programming models used as hardware description languages: The OpenCL case",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6105349/",
            "Abstract": "The problem of automatically generating hardware modules from high level application representations has been at the forefront of EDA research during the last few years. In this paper, we introduce a methodology to automatically synthesize hardware accelerators from OpenCL applications. OpenCL is a recent industry supported standard for writing programs that execute on multicore platforms and accelerators such as GPUs. Our methodology maps OpenCL kernels into hardware accelerators, based on architectural templates that explicitly decouple computation from memory communication whenever this is possible. The templates can be tuned to provide a wide repertoire of accelerators that meet user performance requirements and FPGA device characteristics. Furthermore, a set of high- and low-level compiler optimizations is applied to generate optimized accelerators. Our experimental evaluation shows that …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mapping streaming architectures on reconfigurable platforms",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1294313.1294318",
            "Abstract": "Hardware accelerators, used as application-specific extensions to the computational capabilities of a system, are efficient mechanisms to enhance the performance and reduce the power dissipation in a System On Chip (SoC). These accelerators execute on the computationally critical part of the application, and offload computations from the scalar processors. In this paper, we present a design automation tool that generates accelerators based on a given application kernel. The accelerators are processing streaming data, and support a programming model which can naturally express a large number of embedded applications, and which results in efficient and fast hardware implementations. We demonstrate the applicability of the tool for architectural space exploration for a number of media applications, with results on area, throughput, and clock speeds.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:ufrVoPGSRksC",
            "Publisher": "ACM"
        },
        {
            "Title": "Programmable motion estimation module with vector array unit",
            "Publication year": 2005,
            "Publication url": "https://patents.google.com/patent/US6868123B2/en",
            "Abstract": "A programmable motion estimation module for processing pixel values from a sequence of digital video images. The module includes a programmable microcontroller, scalar and control register files, arithmetic logic units, a direct memory access unit and a vector array processor. The vector array processor includes a series of processing elements, a memory subsystem for storing pixel values and a crossbar switch for distributing pixel values from the memory subsystem to the processing elements. The module provides a flexible platform that can be programmed to implement a variety of different Motion Estimation (ME) algorithms using an associated Instruction Set Architecture without the need to modify the hardware.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Streaming kernel selection for reconfigurable processor",
            "Publication year": 2008,
            "Publication url": "https://patents.google.com/patent/US7441224B2/en",
            "Abstract": "In one embodiment, a subset of a set of streaming kernels of an application is selected for implementation on a reconfigurable processor. The streaming kernels are selected by first forming a stream flow graph of the application by parsing a program of instructions of the application, the stream flow graph having kernel nodes and edges, and determining benefit and cost values for each kernel node in the stream flow graph. Next, a subset of the kernel nodes that maximizes a weighted sum of the benefits values is selected, subject to a constraint that the sum of cost values is not greater than a prescribed value for the reconfigurable processor.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stream memory subsystem in reconfigurable platforms",
            "Publication year": 2006,
            "Publication url": "https://csl.e-ce.uth.gr/sites/default/files/2021-03/warfp2006.pdf",
            "Abstract": "High performance computing platforms require an efficient memory subsystem to keep processors busy. This paper proposes a memory hierarchy using stream units to move stream data between memory and processors. The stream units prefetch and align data based on stream descriptors, a mechanism that allows programmers to indicate data movement explicitly by describing their memory access patterns. The memory hierarchy is configured on reconfigurable logic based on application needs. This paper presents an example stream unit design with preliminary synthesis results.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proteus: An architectural synthesis tool based on the stream programming paradigm",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5272389/",
            "Abstract": "The problem of automatically generating hardware modules from a high level representation of an application has been at the forefront of EDA research in the last few years. Such an EDA methodology would potentially enable the large pool of software engineers and algorithm IP experts without architectural and hardware expertise to design and implement platform systems, thus dramatically reducing time to market. This paper makes the argument that such a methodology requires a programming model beyond the sequential semantics of languages like C/C++. We argue in favor of the streaming programming model in which computation and data communication are explicitly separated and optimized. Our architectural synthesis tool, Proteus, processes stream programs that partition the application into a series of streaming kernels that operate on streams of data elements. Proteus produces efficient hardware …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Real-time fisheye lens distortion correction using automatically generated streaming accelerators",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5290935/",
            "Abstract": "Fisheye lenses are often used in scientific or virtual reality applications to enlarge the field of view of a conventional camera. Fisheye lens distortion correction is an image processing application which transforms the distorted fisheye images back to the natural-looking perspective space. This application is characterized by non-linear streaming memory access patterns that make main memory bandwidth a key performance limiter. We have developed a fisheye lens distortion correction system on a custom board that includes a Xilinx Virtex-4 FPGA. We express the application in a high level streaming language, and we utilize Proteus, an architectural synthesis tool, to quickly explore the design space and generate the streaming accelerator best suited for our cost and performance constraints. This paper shows that appropriate ESL tools enable rapid prototyping and design of real-life, performance critical and cost …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reliability-Aware System Software Support on ARM Microservers.",
            "Publication year": 2017,
            "Publication url": "https://pure.qub.ac.uk/en/publications/reliability-aware-system-software-support-on-arm-microservers",
            "Abstract": "Reliability-Aware System Software Support on ARM Microservers. — Queen's University \nBelfast Skip to main navigation Skip to search Skip to main content Queen's University \nBelfast Logo Help & FAQ Home Profiles Organisations Research output Projects Impact \nDatasets Activities Prizes Press / Media Student theses Facilities Search by expertise, name \nor affiliation Reliability-Aware System Software Support on ARM Microservers. \nAntonopoulos, C., S. Lallis, N. Bellas, D. Gizopoulos, and P. Lawthers , Georgios \nKarakonstantis, Dimitrios Nikolopoulos School of Electronics, Electrical Engineering and \nComputer Science Research output: Contribution to conference › Abstract › peer-review \nOverview Original language English Pages 1 Publication status Published - 2017 Event \nARM Research Summit - Cambridge, United Kingdom Duration: 11 Sep 2017 → 13 Sep \n2017 https://developer.arm.com/research/summit ARM //'…",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:xm0LlTxljI0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring the Effects of Code Optimizations on CPU Frequency Margins",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-02465-9_42",
            "Abstract": "Chip manufactures introduce redundancy at various levels of CPU design to guarantee correct operation even for worst-case combinations of non-idealities in process variation and system operation conditions. This redundancy is implemented partly in the form of voltage/frequency margins. However, for a wide range of real-world execution scenarios, these margins are excessive and translate to increased power and energy consumption. Among the various factors that affect the degree to which these margins are actually needed to avoid errors during program execution, the impact of compiler and source code optimizations has not been explored yet. In this work, we study the effect of such optimizations on the frequency margins and the energy efficiency of applications in the ARM Cortex-A53 processor.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:ijdKiLOsEJMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "SPECIAL SECTION ON LOW-POWER ELECTRONICS AND DESIGN-SPECIAL SECTION PAPERS-Architectural and Compiler Techniques for Energy Reduction in High-Performance Microprocessors",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=11377852378255842739&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:ZeXyd9-uunAC",
            "Publisher": "New York, NY: Institute of Electrical and Electronics Engineers, c1993-"
        },
        {
            "Title": "Significance driven computation on next-generation unreliable platforms",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5981948/",
            "Abstract": "In this paper, we propose a design paradigm for energy efficient and variation-aware operation of next-generation multicore heterogeneous platforms. The main idea behind the proposed approach lies on the observation that not all operations are equally important in shaping the output quality of various applications and of the overall system. Based on such an observation, we suggest that all levels of the software design stack, including the programming model, compiler, operating system (OS) and run-time system should identify the critical tasks and ensure correct operation of such tasks by assigning them to dynamically adjusted reliable cores/units. Specifically, based on error rates and operating conditions identified by a sense-and-adapt (SeA) unit, the OS selects and sets the right mode of operation of the overall system. The run-time system identifies the critical/less-critical tasks based on special directives and …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Method and apparatus for configuring buffers for streaming data transfer",
            "Publication year": 2010,
            "Publication url": "https://patents.google.com/patent/US7802005B2/en",
            "Abstract": "A specification of a configurable processor is generated by generating (1) specifications of first and second stream memory interfaces to be operable to access data in accordance with first and second stream descriptors, and (2) a specification of an interim data storage device (buffer) to be accessed by the first and second stream memory interfaces and to be operable to receive data from a first computational module via the first stream memory interface and to transfer data to a second computational module via the second stream memory interface. The specifications are output and may be used to configure a configurable processor.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:eI34FqJmdUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method and apparatus for transforming a non-linear lens-distorted image",
            "Publication year": 2014,
            "Publication url": "https://patents.google.com/patent/US8855441B2/en",
            "Abstract": "A method and apparatus for image processing a lens-distorted image (eg, a fisheye image) is provided. The method includes partitioning coordinate points in a selected output image into tiles. The output image is an undistorted rendition of a subset of the lens-distorted image. Coordinate points on a border of the tiles in the output image are selected. For each tile, coordinate points in the lens-distorted image corresponding to each selected coordinate point in the output image are calculated. In addition, for each tile, a bounding box on the lens-distorted image is selected. The bounding box includes the calculated coordinates in the lens-distorted image. The bounding boxes are expanded so that they encompass all coordinate points in the lens-distorted image that map to all coordinate points in their respective corresponding tiles. Output pixel values are generated for each tile from pixel values in their corresponding …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:jmjb1lOE9QIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Impact of CPU Voltage Margins on Power-Constrained Execution",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9296366/",
            "Abstract": "CPUs typically operate at a voltage which is higher than what is strictly required, using voltage margins to account for process variability and anticipate any combination of adverse operating conditions. However, these worst-case scenarios occur rarely, if ever, thus the operating voltage is overly pessimistic resulting in excessive power dissipation which leads to decreased performance under power capping. In this paper, we investigate the impact of reducing voltage margins beyond the nominal level on the efficiency of CPU power capping mechanisms, for three commercial systems, two Applied Micro ARMv8 micro-servers (X-Gene2 and X-Gene3) and an Intel x86-64 (Xeon E3). We show that CPU power capping at reduced voltage margins compared with Intel's RAPL and Dynamic Frequency Scaling (DFS) mechanisms results in performance improvement by up to 64% and 24% on average, respectively. In …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:pYKElYtJMmwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the portability of the OpenCL Dwarfs on fixed and reconfigurable parallel platforms",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6808208/",
            "Abstract": "The proliferation of heterogeneous computing systems presents the parallel computing community with the challenge of porting legacy and emerging applications to multiple processors with diverse programming abstractions. OpenCL is a vendor-agnostic and industry-supported programming model that offers code portability on heterogeneous platforms, allowing applications to be developed once and deployed \"anywhere.\" In this paper, we use the OpenCL implementation of the Open Dwarfs, a benchmark suite that captures patterns of computation and communication common to classes of important applications, as delineated by Berkeley's Dwarfs. We evaluate portability across multicore CPU, GPU, APU (CPUs+GPUs on a die), the Intel Xeon Phi co-processor, and the FPGA. To realize FPGA portability, we exploit SOpenCL (Silicon OpenCL), a CAD tool that automatically converts OpenCL kernels to …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:SAZ1SQo2q1kC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting Significance of Computations for Energy-Constrained Approximate Computing",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10766-016-0409-6",
            "Abstract": "Approximate execution is a viable technique for environments with energy constraints, provided that applications are given the mechanisms to produce outputs of the highest possible quality within the available energy budget. This paper introduces a framework for energy-constrained execution with controlled and graceful quality loss. A simple programming model allows developers to structure the computation in different tasks, and to express the relative importance of these tasks for the quality of the end result. For non-significant tasks, the developer can also supply less costly, approximate versions. The target energy consumption for a given execution is specified when the application is launched. A significance-aware runtime system employs an application-specific analytical energy model to decide how many cores to use for the execution, the operating frequency for these cores, as well as the degree of …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:oPLKW5k6eA4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Vassilis Vassiliadis, Charalampos Chalios, Konstantinos Parasyris, Christos D. Antonopoulos, Spyros Lalis",
            "Publication year": 2016,
            "Publication url": "https://csl.e-ce.uth.gr/sites/default/files/2021-03/J10.IJPP_2016.pdf",
            "Abstract": "Approximate execution is a viable technique for environments with energy constraints, provided that applications are given the mechanisms to produce outputs of the highest possible quality within the available energy budget. This paper introduces a framework for energy-constrained execution with controlled and graceful quality loss. A simple programming model allows developers to structure the computation in different tasks, and to express the relative importance of these tasks for the quality of the end result. For non-significant tasks, the developer can also supply less costly,",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:ndLnGcHYRF0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring the potential of context-aware dynamic CPU undervolting",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3457388.3458658",
            "Abstract": "CPU operation at sub-nominal voltage levels has been researched to reduce the power and energy consumption of computer systems. While it is possible to determine a safe undervolting level for each application, typically only the most conservative setting is applied statically across all workloads. In this paper, we go a step further and investigate the gains that can be achieved by dynamically and transparently changing the level of CPU undervolting at runtime. To enable this functionality, we design and implement a novel, OS-level, context-aware dynamic undervolting mechanism, able to decide and apply voltage levels according to the specific tolerance of each workload that executes on a multicore CPU at a particular time. Our mechanism can further differentiate between the user-and kernel-level code executed within the same application thread, enabling the exploitation of differences in their undervolting …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:_tF6a-HnqWAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparative Performance Analysis of Vulkan Implementations of Computational Applications.",
            "Publication year": 2019,
            "Publication url": "https://www.iwocl.org/wp-content/uploads/iwocl-2019-maria-greka-comparative-performance-analysis-of-vulkan-implementations-of-computational-applications.pdf",
            "Abstract": "Background➢ Vulkan: modern low-overhead cross-platform 3D graphics and compute API○ targets high-performance real time 3D graphics applications such as video games○ uses the Khronos SPIR-V intermediate representation with native support for shader features",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:ji7lAbPyDbYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pre-synthesis area estimation of reconfigurable streaming accelerators",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4101082/",
            "Abstract": "One of the major challenges in automated synthesis of reconfigurable accelerators is to create efficient designs that conform to the resource capacity of the target device. This work concerns estimation of the hardware cost before actually attempting the synthesis of streaming accelerators on reconfigurable platforms. Specifically, our proposed framework tackles the problem of presynthesis estimation of data queuing cost, while incorporating the potential impact of resource constraints on the final implementation. We present a probabilistic push-and-pull approach for register queue size estimation of a streaming data flow graph. We evaluated our techniques using an industrial tool/low. For the register queue sizes our estimations are within the range of -14.4% to 12.4% on an average, for various resource constraints on a set of multimedia applications",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "AVS video decoder on multicore systems: Optimizations and tradeoffs",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6012108/",
            "Abstract": "Newer video compression standards provide high video quality and greater compression efficiency, compared to their predecessors. Their increased complexity can be outbalanced by leveraging all the levels of available parallelism, task- and data-level, using available off-the shelf hardware, such as current generation's chip multiprocessors. As we move to more cores though, scalability issues arise and need to be tackled in order to take advantage of the abundant computational power. In this paper we evaluate a previously implemented parallel version of the AVS video decoder on the experimental 32-core Intel Manycore Testing Lab. We examine this previous version's performance bottlenecks and scalability issues and introduce a distributed queue implementation as the proposed solution. Finally, we provide insight on separate optimizations regarding inter macroblocks and investigate performance …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automated configuration of a processing system using decoupled memory access and computation",
            "Publication year": 2008,
            "Publication url": "https://patents.google.com/patent/US20080120497A1/en",
            "Abstract": "A method and system for automatic configuration of processor hardware from an application program that has stream descriptor definitions, descriptive of memory access locations, data access thread definitions having a stream descriptor and a data channel source or sink as parameters, and computation thread definitions having a function pointer, a data channel source and a data channel sink as parameters. The application program is compiled to produce a description of the data flow between the threads as specified in the application program. The hardware is configured to have streaming memory interface devices operable to access a memory in accordance with the stream descriptor definitions, data path devices operable to process data in accordance with the computation thread definitions and data channels operable to connect the data path devices and streaming memory interface devices in accordance …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Shortening design time through multiplatform simulations with a portable OpenCL golden-model: the LDPC decoder case",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6239819/",
            "Abstract": "Hardware designers and engineers typically need to explore a multi-parametric design space in order to find the best configuration for their designs using simulations that can take weeks to months to complete. For example, designers of special purpose chips need to explore parameters such as the optimal bit width and data representation. This is the case for the development of complex algorithms such as Low-Density Parity-Check (LDPC) decoders used in modern communication systems. Currently, high-performance computing offers a wide set of acceleration options, that range from multicore CPUs to graphics processing units (GPUs) and FPGAs. Depending on the simulation requirements, the ideal architecture to use can vary. In this paper we propose a new design flow based on Open CL, a unified multiplatform programming model, which accelerates LDPC decoding simulations, thereby significantly …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Edge and Cloud Provider Cost Minimization by Exploiting Extended Voltage and Frequency Margins",
            "Publication year": 2018,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-61499-843-3-814",
            "Abstract": "Energy costs contribute significantly to the total cost of operation for cloud and edge infrastructure providers. Both conventional (Voltage and Frequency Scaling) and more aggressive (undervolting, overclocking) techniques can be applied to reduce the energy footprint of the infrastructure and thus the cost of the operator. However, these techniques may affect the quality of service (QoS), potentially activating service level agreement (SLA) violation penalties for the provider. In this paper we model and study this tradeoff. We find that undervolting is the most effective of the three techniques in reducing infrastructure operation cost. We identify optimal operating points, and we study the effect of different parameters, such as the severity of SLA penalties, the length of the job and the existence of error protection mechanisms, on the optimal operating point and the extent of potential benefits.",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:4Yq6kJLCcecC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Mapping and optimization of the AVS video decoder on a high performance chip multiprocessor",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5582558/",
            "Abstract": "Modern multimedia workloads provide increased levels of quality and compression efficiency at the expense of substantially increased computational complexity. It is important to leverage the off-the-shelf emerging multi-core processor architectures and exploit all levels of parallelism of such workloads in order to achieve real time functionality at a reasonable cost. This paper presents the implementation, optimization and characterization of the AVS video decoder on Intel Core i7, a quad-core, hyper-threaded, chip multiprocessor (CMP). AVS (Audio Video Standard), a new compression standard from China, is competing with H.264 to potentially replace MPEG-2, mainly in the Chinese market. We show that it is necessary to perform a series of software optimizations and exploit parallelism at different levels in order to achieve FullHD real time functionality. The input dependent variability of execution time per work …",
            "Abstract entirety": 0,
            "Author pub id": "vHo4xHoAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SPECIAL ISSUE ON SYSTEM-LEVEL INTERCONNECT PREDICTION (SLIP)-REGULAR SECTION PAPERS-Using Dynamic Cache Management Techniques to Reduce Energy in General Purpose Processors",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=17711655923952302316&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:aqlVkmm33-oC",
            "Publisher": "New York, NY: Institute of Electrical and Electronics Engineers, c1993-"
        },
        {
            "Title": "A programming model and runtime system for significance-aware energy-efficient computing",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2858788.2688546",
            "Abstract": " We introduce a task-based programming model and runtime system that exploit the observation that not all parts of a program are equally significant for the accuracy of the end-result, in order to trade off the quality of program outputs for increased energy-efficiency. This is done in a structured and flexible way, allowing for easy exploitation of different points in the quality/energy space, without adversely affecting application performance. The runtime system can apply a number of different policies to decide whether it will execute less-significant tasks accurately or approximately. The experimental evaluation indicates that our system can achieve an energy reduction of up to 83% compared with a fully accurate execution and up to 35% compared with an approximate version employing loop perforation. At the same time, our approach always results in graceful quality degradation. ",
            "Abstract entirety": 1,
            "Author pub id": "vHo4xHoAAAAJ:8dzOF9BpDQoC",
            "Publisher": "Unknown"
        }
    ]
}]