[{
    "name": "Νικόλαος Ζαράνης",
    "romanize name": "Nikolaos Zaranis",
    "School-Department": "Παιδαγωγικό Προσχολικής Εκπαίδευσης",
    "University": "uoc",
    "Rank": " Καθηγητής",
    "Apella_id": 18135,
    "Scholar name": "Nicholas Zaranis",
    "Scholar id": "6gocJEwAAAAJ",
    "Affiliation": "Professor, ICT in Education, University of Crete",
    "Citedby": 1551,
    "Interests": [
        "ICT in education"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=6gocJEwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "The Utilization of Van Hiele's Levels on the Instruction of English as a Foreign Language With the Aid of ICT",
            "Publication year": 2020,
            "Publication url": "https://www.igi-global.com/chapter/the-utilization-of-van-hieles-levels-on-the-instruction-of-english-as-a-foreign-language-with-the-aid-of-ict/242586",
            "Abstract": "This chapter investigates students' comprehension of the alphabet and its accompanying vocabulary, using an ICT-oriented teaching approach that is based upon Van Hiele's levels of geometric thought. The participating sample consisted of Greek students attending the second grade of primary school in Crete. The sample was divided into two groups, which were distributed among an experimental and a control group. The control group was taught following the traditional instruction, according to the pedagogical principles of Curriculum for the second grade of primary school. The experimental group was taught through an ICT-oriented intervention based upon Van Hiele's levels. The results of the research will assist greatly in achieving a more thorough understanding of the instruction of English as a Foreign Language (EFL) and possible implementation of Information and Communication Technologies (ICT), to …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Educational apps from the Android Google Play for Greek preschoolers: A systematic review",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131517302117",
            "Abstract": "In the seven years since the introduction of the tablet (Apple iPad) in 2010, the use of software for smart mobile devices has grown rapidly in popularity and has become a hotly debated issue in the field of education and child development. However, the rise in popularity of mobile applications (apps) mainly addressed to young children is not in line with a corresponding increase in their quality, as there is conflicting evidence about the real value and suitability of educational apps. The purpose of this study was to examine whether self-proclaimed educational apps for Greek preschoolers have been designed in accordance with developmentally appropriate standards to contribute to the social, emotional and cognitive development of children in formal and informal learning environments. The study results were discouraging. The majority of the apps aimed to teach children the basics about numbers and letters …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:_kc_bZDykSQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Melhorando o Ensino De Matemática na Educação infantil Com Educação Matemática Realista",
            "Publication year": 2021,
            "Publication url": "https://escribo.com/revista/index.php/escola/article/view/21",
            "Abstract": "A Base Nacional Comum Curricular estabeleceu objetivos de aprendizagem de matemática para crianças pequenas. A presente pesquisa tem como objetivo comparar a influência de uma abordagem didática de ensino baseada na Educação Matemática Realística (RME) no desenvolvimento das habilidades matemáticas de crianças da educação infantil. Nesse contexto, foi realizada uma intervenção organizada em dois grupos: um experimental, que aprendeu matemática de acordo com a Educação Matemática Realística, e um de controle, que seguiu os princípios pedagógicos básicos do currículo. Conclui-se que as abordagens pedagógicas que utilizam a Educação Matemática Realística contribuem enormemente para o desenvolvimento das habilidades matemáticas para crianças na faixa etária analisada.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A pilot study using tablet computers for teaching addition to the first grade students",
            "Publication year": 2017,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Barcelona, Spain"
        },
        {
            "Title": "A pilot project comparing the effectiveness of using ICT for teaching addition and subtraction with first grade students",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2832987.2832995",
            "Abstract": "The purpose of this study is to investigate if information and communications technology (ICT) helps improve primary school students' mathematical achievements regarding addition and subtraction. Our research compares the level of mathematical competence of the students taught using our ICT oriented learning method which specifically takes advantage ofRealistic Mathematics Education'(RME) for the concept of addition and subtraction, as opposed to traditional teaching methodology. The designed software consisted of a story and several activities with and without the use of computers for addition. It was designed following the background of the RME theory. In addition, we use the mathematical test TEMA-3 to explore the use of ICT in the primary classroom for teaching basic mathematical concepts. It is a task orientated test which attends to measure the level of mathematical competence developed for …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The main factors of the attitudes of Greek kindergarten teachers towards information and communication technology",
            "Publication year": 2016,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/1350293X.2014.970853",
            "Abstract": "The purpose of this article is to examine the main factors of Greek kindergarten teachers’ attitudes towards information and communication technology (ICT) in kindergarten. This two-phase survey was carried out in 2007 and 2012 and used 383 and 295 participants respectively. The participants in both groups were drawn from kindergarten teachers in the areas of Athens and Crete (Greece). In the first phase a 5-point Likert scale questionnaire designed to assess the main factors of kindergarten teachers' attitudes towards ICT. Varimax with Kaiser Normalisation was applied to extract the main five factors of kindergarten teachers’ attitudes which are: (1) how ICT helps the child universally in the teaching process;(2) the use of ICT by the children as cognitive tool; (3) the changes caused by ICT in regards to the role of the kindergarten teacher in the classroom; (4) the use of ICT to organise kindergarten teachers' …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Routledge"
        },
        {
            "Title": "Tablets in learning mathematics for kindergarten students",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-01551-0_14",
            "Abstract": "The aim of this study is to explore the impact on kindergarten children’s mathematical competence after the implementation of a software application for comparison, classification, one-to-one correspondence, and counting with tablet computers. The application consisted of some comparison, classification, one-to-one correspondence, and counting activities, designed following the background of realistic mathematics education and more specifically that of the learning teaching trajectory for the domain of mathematics. Four kindergarten schools of Heraklion participated in the study, which was conducted during spring 2017. The research followed the pre-test and post-test model, using the Early Numeracy Test (ENT), an instrument measuring the early mathematical competence. The test comprises of questions for the concepts of comparison, classification, one-to-one correspondence, seriation, using …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Does the use of Information and Communication Technology through the use of Realistic Mathematics Education help kindergarten students to enhance their effectiveness in addition and subtraction?",
            "Publication year": 2017,
            "Publication url": "https://www.learntechlib.org/p/187369/",
            "Abstract": "The purpose of this research is to answer the question if and how information and communications technology (ICT) combined with the Realistic Mathematics Education (RME) helps kindergarten students to enhance their effectiveness in addition and subtraction. Our research compares the level of mathematical competence of the students taught using our ICT oriented learning method which specifically takes advantage of Realistic Mathematics Education (RME) for the concept of addition and subtraction, as opposed to traditional teaching methodology. The study dealt with kindergarten students in the city of Crete Rethymno, who were divided into two groups (experimental and control) during the school year 2012-13. The experimental group consisted of 165 students who were taught addition and subtraction with the support of computers and RME. There were 170 students in the control group which were not …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:Zph67rFs4hoC",
            "Publisher": "Laboratory of Pedagogical Research & Applications"
        },
        {
            "Title": "Geometry teaching through ICT in primary school",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-6501-0_5",
            "Abstract": "The purpose of this study is to investigate if and how information and communications technology (ICT) helps to improve first grade students’ basic geometry achievement regarding circles and triangles. Our research compares the level of geometrical competence of the students taught using our ICT oriented learning method specifically targeting “Realistic Mathematics Education” (RME) and the van Hiele model for geometry concepts, as opposed to “traditional” teaching methodology. The designed software consisted of a story and several activities with and without the use of computers for circles and triangles. The study involved first grade students in Crete and Athens, who were divided into two groups (experimental and control). The experimental group consisted of 113 students who were taught about circles and triangles with the support of computers. There were 121 students in the control group who …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Designing and creating an educational app rubric for preschool teachers",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-017-9579-0",
            "Abstract": "International studies indicate that the use of smart mobile devices and their accompanying educational applications (apps) can revolutionize young children’s learning experiences. Although there is a vast array of educational apps for preschoolers, they are not actually educational in their majority. In this context, it is important for preschool teachers to be able to assess each app for its effectiveness in educational practice. To evaluate educational mobile apps, this paper presents a rubric (abbreviated as REVEAC) in four areas: contents, design, functionality, and technical quality, each having multiple aspects. In this paper, we discuss the known problems in using educational apps and we present a review of relevant literature, as well as the process of formulating REVEAC. Finally, the paper concludes with a brief discussion of REVEAC limitations and future work.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Οι Τεχνολογίες της Πληροφορίας και των Επικοινωνιών στην Προσχολική Εκπαίδευση",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=2728975848084885351&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Εκδ. Γρηγόρης"
        },
        {
            "Title": "Comparing tablets and PCs in teaching mathematics: An attempt to improve mathematics competence in early childhood education",
            "Publication year": 2016,
            "Publication url": "https://www.learntechlib.org/p/187376/",
            "Abstract": "The present study investigates and compares the influence of using computers and tablets, in the development of mathematical competence in early childhood education. For the implementation of the survey, we conducted a 14 weeks intervention, which included one experimental and one control group. Children in both groups were taught Mathematics according to Greek curriculum for early childhood education in conjunction with the use either of the same educational software, which depending on the group, were running on computers or on tablets. In order to evaluate the mathematical performance of children we used the Test of Early Mathematics Ability (TEMA-3). The sample consisted of 256 children in Greece. The results showed that, teaching with tablets comparatively to teaching with computers has contributed significantly to the development of children’s mathematical ability to a greater extent. Moreover …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Laboratory of Pedagogical Research & Applications"
        },
        {
            "Title": "The use of ICT in Preschool Education for the teaching of Triangles",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/33584826/03_ZARANIS_CONF_34_2013_Cyp.pdf",
            "Abstract": "The innovations which have been occurring through recent decades in Information and Communication Technology (ICT) have awakened the interest of the educational community which in turn has felt the need to evolve in its theoretical areas and pedagogic practices. Especially the integration of ICT into preschool education has become a high priority for everybody involved in the learning process. The aim of this study is to investigate the preceding question:“Does Information and Communication Technology (ICT) help improve kindergarten students’ geometrical achievements regarding triangles?” The applied software consisted of a story and several activities with and without the use of computers. It was designed following the background of the van Hieles’ model for geometry concepts. The study dealt with kindergarten children in Crete, who were divided into two teams (experimental and control). The experimental group consisted of approximately 124 students who were taught about triangles with the support of computers. There were 126 students in the control group which were not exposed to the computer oriented curriculum. Students in both groups were pre-tested and post-tested for their geometry performance of triangles. The results of the study indicated that teaching and learning through ICT is an interactive process for children at the preschool level and has a positive effect for the teaching of triangles.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Factors affecting Greek kindergarten teachers to support or oppose ICT in education",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-34127-9_15",
            "Abstract": "The purpose of this article was to examine the factors affecting a Greek kindergarten teacher to support or oppose ICT in education. This research was carried out during the year 2012; 418 teachers participated and is an extension of a previous analysis (Zaranis et al. 2014). The participants were drawn from kindergarten teachers in the areas of Athens and Crete (Greece). A 5-point Likert scale questionnaire with 30 questions was designed to assess the attitudes of kindergarten teachers towards computers. Then, factor analysis and cluster analysis were applied to obtain three distinct clusters of the kindergarten teachers’ profiles. We used the two extreme groups of these clusters, namely “negative attitude towards ICT” (NA) and “supporters of ICT in education” (S). These are the two categories of the dependent variable in a binary logistic regression model. The explanatory variables of the model were the …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The use of ICT in teaching geometry in primary school",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-020-10210-7",
            "Abstract": "The purpose of this study is to investigate if information and communications technology (ICT) helps improve students’ achievement in geometry regarding solids’ nets. Our research compares the achievement of the students in the experimental group taught using our ICT intervention to students in the control group taught by traditional teaching methodology. In particular, we designed a teaching intervention with educational activities, in which we incorporated Augmented Reality (AR) technology to test whether geometry teaching is enhanced. The study dealt with primary school students of fourth grade, who were divided into two groups (experimental and control). Students in both groups were pre-tested and post-tested for their achievement in geometry. The results of the study indicated that teaching and learning through ICT is an interactive process for students at primary school and has a positive effect on …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Greek primary students’ attitudes towards the use of ICT for teaching natural sciences",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=7408730658813293616&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Research on e-Learning and ICT in Education",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-34127-9.pdf",
            "Abstract": "The use of general descriptive names, registered names, trademarks, service marks, etc. in this publication does not imply, even in the absence of a specific statement, that such names are exempt from the relevant protective laws and regulations and therefore free for general use. The publisher, the authors and the editors are safe to assume that the advice and information in this book are believed to be true and accurate at the date of publication. Neither the publisher nor the authors or the editors give a warranty, express or implied, with respect to the material contained herein or for any errors or omissions that may have been made.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Preschool science education with the use of ICT: a case study",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Michail-Kalogiannakis/publication/233986315_Kalogiannakis_M_Zaranis_N_2012_Preschool_science_education_with_the_use_of_ICT_a_case_study_In_C_Bruguiere_A_Tiberghien_P_Clement_Eds_Proceedings_of_the_ESERA_2011_Conference_Science_learning_and_Citi/links/0fcfd50dc57ebd62d7000000/Kalogiannakis-M-Zaranis-N-2012-Preschool-science-education-with-the-use-of-ICT-a-case-study-In-C-Bruguiere-A-Tiberghien-P-Clement-Eds-Proceedings-of-the-ESERA-2011-Conference-Science-learning.pdf",
            "Abstract": "In recent years we have become increasingly aware of the need for people to understand the nature of science in order to ma e decisions posed by new developments in both science and technology. This case study is part of a wider research project concerning the use of Information and Communication Technologies (ICT) for teaching main natural science’s concepts and mathematics in early year’s classroom. The study was conducted during 2010-2011 school year and 270 pupils were participated. The integration of ICT into preschool education has become a high priority for everybody involved in the learning process. The Early Numeracy Test was given to pupils and semi-structured interviews with young children were conducted in 18 preschool classes in Crete. Pupils in the control group received only the traditional science instruction about natural sciences (solubility, recycling) and mathematical concepts (comparison, classification and general nowledge of numbers). Pupils in the experimental group received only the science instruction with the use of ICT for the same topics. Both the experimental and the control groups consisted of classes from the same participating schools. The incorporation of ICT in early year’s classes in Greece should be considered as a means of an obligatory modernization of learning and teaching methods. The results of our research showed that teaching and learning through ICT as an innovative teaching method can be successful for understanding the concept of numbers and natural sciences phenomena at preschool level.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using Mobile Devices for Teaching Realistic Mathematics in Kindergarten Education",
            "Publication year": 2013,
            "Publication url": "https://www.scirp.org/html/34168.html",
            "Abstract": "New ICT tools allow children to take advantage of new learning platforms as well aiding them effectively in attaining new knowledge through activities related to their immediate interests and real life scenarios. Nowadays, computers and digital applications are a part of the daily life of children. In kindergarten education, properly designed digital educational activities can become a very powerful educational tool for efficient and effective learning. The utilization of interactive activities may contribute towards the growth of learning incentives as well as proper mental development in particular areas; such as mathematics and science. Mobile devices have new attractive features and provide considerable advantages in the teaching of mathematics in kindergarten education. Our study proposes the integration of mobile devices, running our own specially designed learning activity applications, in kindergarten classrooms. These applications are based on the three levels of Realistic Mathematics Education (RME) targeting fundamental mathematical concepts for the kindergarten level. We intend to gather information on effectiveness of the incorporation of these devices and applications as leaning tools for kindergarteners.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Scientific Research Publishing"
        },
        {
            "Title": "Comparing the effectiveness of using tablet computers for teaching division to kindergarten students",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20954-4_21",
            "Abstract": "The present study aimed to assess the effect of the use of tablet computers in teaching division to kindergarten students. Our research compares the level of mathematical competence of the students taught using our tablet oriented learning method which specifically takes advantage of ‘Realistic Mathematics Education’ (RME) for the concept of division, as opposed to traditional teaching methodology. The software was designed to follow the RME theory. The present study used one experimental and one control group. We found that the students who were taught with educational intervention with the use of tablet computers and the RME theory had a significant improvement on their understanding of division in comparison to those taught using the traditional teaching method. The teaching of Mathematics for kindergarteners using tablet computers has emerged as a vital area of study and academic research.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:mB3voiENLucC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Comparing the effectiveness of using ICT for teaching geometrical shapes in kindergarten and the first grade",
            "Publication year": 2018,
            "Publication url": "https://www.igi-global.com/article/comparing-the-effectiveness-of-using-ict-for-teaching-geometrical-shapes-in-kindergarten-and-the-first-grade/192084",
            "Abstract": "The purpose of this study is to investigate if information and communications technology (ICT) helps to improve first grade and kindergarten students' basic geometry achievement. The author's research compares the level of geometrical competence of the first grade students and kindergarten students taught using an ICT oriented learning method specifically targeting ‘Realistic Mathematics Education'(RME) for geometry concepts, as opposed to traditional teaching methodology. The study dealt with first grade and kindergarten students in Crete and Athens. The experimental group of the consisted of 237 students who were taught shapes with the support of computers and the control group had 247 students. The results of the study indicated that teaching and learning through ICT is an interactive process for students at the first grade and kindergarten level and has a positive effect for the learning of shapes using the …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Parental involvement and attitudes towards young Greek children’s mobile usage",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2212868919300248",
            "Abstract": "Smart mobile devices are widely used for dealing with information on education and provide entertainment at home and school. Mobile applications (apps) directed towards young aged children have changed the digital media landscape for infants and toddlers. Parents’ preferences and beliefs towards technology has a major role in toddlers’ and infants’ use of technology as they directly affect the quality and the quantity of digital media available to them especially at home. It is, therefore, crucial to understand how parents perceive the changes imposed by smart screen technologies upon their children’s development; their diverse beliefs, and practices. To date, in Greece, few studies have examined the use of smart screen technologies among young children especially at home. This study presents the main findings from a research conducted with 293 families in Greece between September 2018 and November …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The influence of the Geometer’s Sketchpad on the geometry achievement of Greek school students",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Nicholas-Zaranis/publication/228658740_THE_INFLUENCE_OF_THE_GEOMETER'S_SKETCHPAD_ON_THE_GEOMETRY_ACHIEVEMENT_OF_GREEK_SCHOOL_STUDENTS/links/00463536870cf9361e000000/THE-INFLUENCE-OF-THE-GEOMETERS-SKETCHPAD-ON-THE-GEOMETRY-ACHIEVEMENT-OF-GREEK-SCHOOL-STUDENTS.pdf",
            "Abstract": "The aim of this study is to investigate the question:“Does the use of a Geometer’s Sketchpad help secondary students to improve their geometry performance?” The respondents were students enrolled in a high school (grade 7) in a northern suburb of Athens. The experimental group consisted of approximately 40 students, who spent at least one hour per week doing computer explorations for the first six weeks of the last semester. There were 39 students in the control group, which was not exposed to the computer explorations. Students in both groups were pre-tested and post-tested for their geometry performance. The results of the study indicated that the use of technology is needed for students to make significant progress in geometry.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Društvo matematičara Srbije"
        },
        {
            "Title": "Research on e-Learning and ICT in Education",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4614-6501-0.pdf",
            "Abstract": "© Springer Science+ Business Media New York 2014",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teaching mathematics with mobile devices and the Realistic Mathematical Education (RME) approach in kindergarten",
            "Publication year": 2021,
            "Publication url": "https://www.syncsci.com/journal/AMLER/article/view/AMLER.2021.01.002",
            "Abstract": "Nowadays, smart mobile devices such as tablets and accompanying applications (apps) are a part of young children's daily lives. In kindergarten education, properly designed digital educational activities can become a potent educational tool for efficient and effective learning. These tools allow children to take advantage of new learning platforms and effectively reach new knowledge through activities related to their immediate interests and real-life scenarios in learning domains, such as mathematics. At the Department of Preschool Education, University of Crete, systematic research was carried out in the last years to investigate whether there are compelling benefits to using tablet-type devices in preschool education to implement teaching reform proposals to implement the Realistic Mathematical Education in kindergarten classrooms. The findings propose mobile devices' integration, running developmentally appropriate apps, in kindergarten classrooms. These apps were based on the three levels of Realistic Mathematics Education (RME), targeting fundamental mathematical concepts for the kindergarten level.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The appropriateness of scratch and app inventor as educational environments for teaching introductory programming in primary and secondary education",
            "Publication year": 2019,
            "Publication url": "https://www.igi-global.com/chapter/the-appropriateness-of-scratch-and-app-inventor-as-educational-environments-for-teaching-introductory-programming-in-primary-and-secondary-education/219609",
            "Abstract": "Teaching programming is a complex task. The task is even more challenging for introductory modules. There is an ongoing debate in the teaching community over the best approach to teaching introductory programming. Visual block-based programming environments allow school students to create their own programs in ways that are more accessible than in textual programming environments. These environments designed for education allow students to program without the obstacle of syntax errors (errors in typing commands) found in traditional text-based languages. In this paper, the authors focus on the use of App Inventor and Scratch as blocks-based programming environments designed explicitly with novices in mind. In the authors' analysis, both Novice Programming Environments (NPEs) seemed to be attractive platforms for introducing fundamental concepts in computer programming and both look …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Comparing the effectiveness of using ICT for teaching addition in the first grade students based on Realistic Mathematics Education",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effectiveness of computer and tablet assisted intervention in early childhood students’ understanding of numbers. An empirical study conducted in Greece",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-018-9693-7",
            "Abstract": "The present study aimed to assess the effect of two different types of digital technologies (computers and tablets) in early childhood students’ understanding of numbers. Three hundred and sixty-five children (mean age in months, M = 62.0, SD = 5.5) from 21 kindergarten classes were randomly assigned to two intervention groups and a business-as-usual control group. The interventions were conducted over 24 half-hour lessons. Data was collected during the 2013–2014 school year using a three-step research procedure. Students’ knowledge about numbers was assessed using the Test of Early Mathematics Ability-3 (TEMA-3). Findings were that (a) both experimental groups significantly outperformed the control group on the posttest, (b) the group that used tablet computers significantly outperformed the group that used personal computers on the posttest, and (c) there was no significant difference …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Developing fundamental programming concepts and computational thinking with ScratchJr in preschool education: a case study",
            "Publication year": 2016,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJMLO.2016.077867",
            "Abstract": "In recent years, the teaching of programming and development of fundamental programming concepts at the preschool age has attracted the interest of the educational and scientific community. International research has highlighted that teaching programming to young children has a crucial influence on the development of their cognitive functions. There are currently plenty of available programming environments suited for preschoolers. Researchers are adapting their views concerning the age threshold at which young children can effectively get involved with programming. A new programming environment, which was designed to help preschoolers familiarise with basic programming concepts, in a developmentally appropriate manner, is ScratchJr. This study performs a brief introduction to the characteristics of ScratchJr as well as a presentation of the results of a small-scale pilot study for the evaluation of …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:UebtZRa9Y70C",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "A comparative study on the effectiveness of the computer assisted method and the interactionist approach to teaching geometry shapes to young children",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-016-9500-2",
            "Abstract": "The purpose of this study is to compare and evaluate the effectiveness of computer assisted teaching of geometry shapes and an interactionist approach to teaching geometry in kindergarten versus other more traditional teaching methods. Our research compares the improvement of the children’s geometrical competence using two teaching approaches. The first one employs our ICT oriented learning method specifically targeting Realistic Mathematics Education (RME) and the van Hiele model for geometry shapes. The second method is based on the interactionist approach of teaching children in kindergarten. The sample consisted of 139 Greek kindergarten children from Crete. We conducted interventions based on the above two methods, in two experimental groups. The first experimental group consisted of 50 children who were taught geometry shapes according to the principles of Realistic …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Game-Based Learning for Teaching Multiplication and Division to Kindergarten Students",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-76986-4_6",
            "Abstract": "The present study aimed to assess the effect of the use of game-based learning with tablet computers in teaching multiplication and division to kindergarten students. Our research compares the level of mathematical competence of the students taught using our tablet-oriented game-based learning method which specifically takes advantage of “Realistic Mathematics Education” (RME) for the concepts of multiplication and division, as opposed to traditional teaching methodology. The software was designed to follow RME theory through game-based learning. The present study used one experimental and one control group. We found that the students who were taught with educational intervention with the use of tablet-oriented game-based learning and the RME theory had a significant improvement in their understanding of multiplication and division in comparison to those taught using the traditional teaching …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Profiling the attitudes of Greek kindergarten teachers towards computers",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-013-9296-2",
            "Abstract": "The purpose of this study was to examine kindergarten teachers’ attitudes towards computers in the classroom. The sample consisted of two groups allocated in two different researches. The first group had 383 participants from the first research (spring 2007) and the second 295 participants from the second research (fall 2012). The participants in both groups were drawn from kindergarten teachers of public kindergartens in the area of Athens and Crete (Greece). In the first research, a 5-point Likert scale questionnaire with 49 questions was designed to assess the attitudes of kindergarten teachers towards computers. Due to factor analysis on the sample of the first research, the questionnaire items reduced to 30. Then, cluster analysis was applied to obtain three distinct clusters of the kindergarten teachers’ profiles: the neutral, the sceptic and the optimistic kindergarten teachers. Finally, a comparison …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Stamatios Papadakis",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=7934170826448351367&hl=en&oi=scholarr",
            "Abstract": "Teaching programming is a complex task. The task is even more challenging for introductory modules. There is an ongoing debate in the teaching community over the best approach to teaching introductory programming. Visual block-based programming environments allow school students to create their own programs in ways that are more accessible than in textual programming environments. These environments designed for education allow students to program without the obstacle of syntax errors (errors in typing commands) found in traditional text-based languages. In this paper, the authors focus on the use of App Inventor and Scratch as blocks-based programming environments designed explicitly with novices in mind. In the authors’ analysis, both Novice Programming Environments (NPEs) seemed to be attractive platforms for introducing fundamental concepts in computer programming and both look appealing for both majors and non-majors.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The use of ICT in preschool education for science teaching with the Van Hiele theory",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=14000534538468697889&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The use of ICT in Preschool Education for geometry teaching",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=16522922472323493697&hl=en&oi=scholarr",
            "Abstract": "The aim of this study is to reveal the use of ICT in Greek pre-school education and explores the implementation of a software application for geometry education. The application consisted of several activities including those with computers, which were designed following the background of van Hieles’ levels for geometry concepts, referred to as the ‘Kindergarten Shape Model’(KSM). In addition, we use a mathematical test referred to as the ‘Kindergarten Shape Test’(KST) to explore the use of ICT in the preschool classroom for teaching basic mathematical concepts. The KST is a task orientated test which attends to measure the level of early geometry competence developed for kindergarten. Pupils in the control group received only the traditional science instruction about a variety of topics concerning fundamental geometry concepts. Pupils in the experimental group received only the geometry instruction with the use of ICT for the same geometry concepts. Both the experimental and the control groups consisted of classes from the same participating schools. Our research is in progress and the first indicative results show that teaching and learning through ICT is an interactive process for children at the preschool level and has a positive effect for geometry education.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The use of Information and Communication Technologies in the first grade of primary school for teaching rectangles based in Realistic Mathematics Education",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6623694/",
            "Abstract": "The aim of this study is to investigate the question: “Can Information and Communications Technology (ICT) helps to improve primary school students' geometry achievements for rectangles?” The applied educational software consisted of a story and several activities with and without the use of computers which were designed following the background of Realistic Mathematics Education for geometry concepts; referred to as the `Primary Shape Model' (PSM). In addition, we use a mathematical test referred to as the `Primary Shape Test' (PST) to explore the use of ICT in the primary classroom for teaching basic geometrical concepts. It is a task orientated test which attends to measure the level of geometry competence developed for students of the first grade. The study dealt with students in the first grade of primary school of Athens and Crete, who were divided into two teams (experimental and control). The …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Use of ICT and the realistic mathematics education for understanding simple and advanced stereometry shapes among university students",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-95059-4_8",
            "Abstract": "The purpose of this study is to investigate if information and communications technology (ICT) helps to improve the basic and advanced stereometry concepts’ achievement of university students. The study deals with second year undergraduate students from the Department of Civil Engineering at Piraeus University. The sample was divided into two groups. The experimental group consisted of 99 students who were taught about basic (points, line segments, cubes, spheres) and advanced (ellipsoids, cylinders, and cones) concepts of solid stereometry with the support of computers based on Realistic Mathematics Education theory (RME). Also, there were 90 students in the control group which were taught with traditional methodology using a dry-erase board. The results showed that the teaching approaches of our intervention, with the additional use of ICT using the background of the Realistic Mathematics …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Improving mathematics teaching in kindergarten with realistic mathematical education.",
            "Publication year": 2017,
            "Publication url": "https://www.academia.edu/download/60087551/Improving_Mathematics_Teaching_in_Kindergarten_with_Realistic.pdf",
            "Abstract": "The present study investigates and compares the influence of teaching Realistic Mathematics on the development of mathematical competence in kindergarten. The sample consisted of 231 Greek kindergarten students. For the implementation of the survey, we conducted an intervention, which included one experimental and one control group. Children in the experimental group were taught Realistic Mathematics according to the principles of Realistic Mathematics Education. The control group was taught mathematics following the basic pedagogical principles of curriculum for kindergarten students. In order to evaluate the mathematical performance of children we used the Test of Early Mathematics Ability (TEMA-3). The results showed that the teaching technique with the use of Realistic Mathematic Education contributed significantly to the development of mathematical competence of young children. Moreover, factors such as gender, age and nonverbal cognitive ability, did not seem to differentiate the development of mathematical competence of children.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tablet computer assisted counting and calculating activities for kindergarten children",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Nicholas-Zaranis/publication/318703663_TABLET_COMPUTER_ASSISTED_COUNTING_AND_CALCULATING_ACTIVITIES_FOR_KINDERGARTEN_CHILDREN/links/5a2b0b170f7e9b63e538cc6e/TABLET-COMPUTER-ASSISTED-COUNTING-AND-CALCULATING-ACTIVITIES-FOR-KINDERGARTEN-CHILDREN.pdf",
            "Abstract": "The aim of this study is to explore the impact on kindergarten children’s mathematical competence after the implementation of a software application for counting and calculating with tablet computers. The application consisted of some counting and calculation activities, designed following the background of realistic mathematics education and more specifically that of the learning teaching trajectory for the domain of counting and calculation. Four kindergarten schools of Heraklion participated in the study, which was conducted during spring 2017. The research followed the pre-test and post-test model, using the Early Numeracy Test (ENT), an instrument measuring the early mathematical competence. The test comprises of questions for the concepts of comparison, classification, correspondence, seriation, using counting words, structured counting, resultative counting, and general knowledge of numbers. The results of the study support a positive correlation between children’s early numeracy competence and the integration of tablet computers in teaching and learning numbers.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Barcelona, Spain"
        },
        {
            "Title": "Comparing the Attitudes of Greek Kindergarten Teachers Against Primary School Teachers Towards ICT",
            "Publication year": 2020,
            "Publication url": "https://www.igi-global.com/chapter/comparing-the-attitudes-of-greek-kindergarten-teachers-against-primary-school-teachers-towards-ict/242579",
            "Abstract": "This chapter examines the main factors of Greek kindergarten against primary school teachers' attitudes towards ICT in class. The participants of this research were drawn from teachers of public schools in the area of Athens and Crete (Greece). A 5-point Likert scale questionnaire with 30 questions designed to assess attitudes of teachers toward computers and their computer knowledge in primary schools learning environment. Varimax with Kaiser Normalization was applied to extract the main five factors of kindergarten teachers' attitudes. Also, a three 2-way MANOVA was performed between the kindergarten and primary school teachers to see the interactions of these main factors on: a) the ICT knowledge of teachers, b) the frequency of using ICT at home by the teachers and, c) the ICT use in the teaching process. Finally, the changes in the main factors of kindergarten and primary school teachers were …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "How ICT Affects the Understanding of Stereometry among University Students",
            "Publication year": 2018,
            "Publication url": "https://www.igi-global.com/article/how-ict-affects-the-understanding-of-stereometry-among-university-students/192083",
            "Abstract": "The purpose of this research is to compare the level of competence in stereometry of the university students taught using the authors' ICT oriented learning method based on the Van Hiele model for stereometry concepts, as opposed to traditional teaching methodology. The study deals with second year undergraduate students form the Department of Civil Engineering at Piraeus University. The sample was divided into two groups. The experimental group consisted of 99 students who were taught about basic concepts of solid geometry with the support of computers based on the Van Hiele model. Also, there were 90 students in the control group which were taught with traditional methodology using a dry erase board. The study results showed that teaching and learning through ICT is an interactive process for second year university students and has a positive effect on learning solid geometry concepts using the …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:4TOpqqG69KYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Developing appropriate technologies in teaching axial symmetry in compulsory education",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/33584369/03_ZARANIS_CONF_19_2009_Cor.pdf",
            "Abstract": "The purpose of this study is to investigate the hypothesis whether the introduction of an appropriate software dynamic geometry is the classroom as an additional factor, could help the students to discover, comprehend and construct mathematical notions related to the axial symmetry. The paper starts with the role of the New Technologies of in teaching and learning geometry and goes on with the description of the methodology used in the research which was conducted in a public secondary school located in Athens. The students who participated in the experiment were divided into two groups. The first group consisted of those students who were taught axial symmetry with the aid of computers whereas the second group consisted of those students who were taught axial symmetry with the traditional way. To the students of both groups were distributed questionnaires before and after the teaching of axial symmetry …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICT in preschool education",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=16571907167277166390&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Οι κύριοι παράγοντες των απόψεων των νηπιαγωγών ως προς τις ΤΠΕ και η κατηγοριοποίησή των νηπιαγωγών σε τύπους",
            "Publication year": 2014,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparing the effectiveness of using tablet computers for teaching addition and subtraction",
            "Publication year": 2019,
            "Publication url": "https://www.igi-global.com/chapter/comparing-the-effectiveness-of-using-tablet-computers-for-teaching-addition-and-subtraction/219610",
            "Abstract": "The purpose of this chapter is to investigate if tablet computers help improve primary school students' mathematical achievements regarding addition and subtraction. This research compares the level of mathematical competence of the students taught using tablet-computer-oriented learning method which specifically takes advantage of “realistic mathematics education”(RME) for the concept of addition and subtraction, as opposed to traditional teaching methodology. The designed software consisted of several activities with and without the use of computers for addition and subtraction. It was designed following the background of the RME theory. The present study was a pilot research of quasi-experimental design with one experimental and one control groups. The research results show that the students who were taught with the educational intervention based on tablet computers and RME had a significant …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Using Scratch and App Inventor for teaching introductory programming in secondary education. A case study",
            "Publication year": 2016,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJTEL.2016.082317",
            "Abstract": "Paradoxically, as the role and significance of computing have increased in society and the economy, and coding is recognised as the fourth literacy, the number of students attending a programming course is in decline. In an attempt to increase interest in computer science (CS), there has been made much effort in developing tools and activities as preliminary learning materials in schools and universities. App Inventor and Scratch strive to engage the novice users by allowing them to write programs about things that connect with their interests in contrast to more conventional programming. In this paper, we focus on the use of these two block-based programming environments as tools to facilitate learning programming for novices. In our analysis, both novice programming environments (NPEs) seemed to be attractive platforms for introducing fundamental concepts in computer programming and both look appealing …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "The use of ICT in kindergarten for teaching addition based on realistic mathematics education",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10639-014-9342-8.pdf",
            "Abstract": "The purpose of this study is to investigate if information and communications technology (ICT) helps improve kindergarten students’ basic mathematical achievement regarding addition. Our research compares the level of mathematical competence of the students taught using our ICT oriented learning method which specifically takes advantage of ‘Realistic Mathematics Education’ (RME) for the concept of addition, as opposed to traditional teaching methodology. The designed software consisted of a story and several activities with and without the use of computers for addition. It was designed following the background of the RME theory. The study dealt with kindergarten students in Crete, who were divided into two groups (experimental and control). The experimental group consisted of 165 students who were taught addition with the support of computers. There were 170 students in the control group which …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Implementing theoretical approaches using ICT in teaching English as a foreign language",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-021-10594-0",
            "Abstract": "The purpose of this present study is to explore the effect of an instructional approach that utilizes Information and Communication Technology (ICTs) and is based on Van Hiele’s levels of geometric thought and Hoffer’s skills that describe them, for the instruction of the English Alphabet. The sample of the present research consisted of Greek students attending the second grade of primary school. The sample was divided into two groups, a control and an experimental one. The former was taught according to the curriculum provided by the Greek Ministry of Education and Religious Affairs. The experimental group was taught through an intervention based on the principles of Blended Learning. The intervention was based on the first level of Van Hiele’s theory and more specifically Hoffer’s skills describing this specific level. Every student was assessed regarding their non-verbal intelligence prior to the intervention …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Research on e-Learning and ICT in Education",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4614-6501-0.pdf",
            "Abstract": "© Springer Science+ Business Media New York 2014",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The influence of ICT on the numeracy achievement of Greek kindergarten children",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/61881899/2011_icemsiie2011_Proceedings20200124-95534-1l7a9jf.pdf#page=399",
            "Abstract": "Aim of this study is to investigate the question:―If information and communication technologies (ICT) help to improve kindergarten students ‘mathematical achievements‖. Initially, we present the important role of computers in the learning and teaching of mathematics. Then, we describe the research process, the educational software for teaching numbers (one to ten) and the activities that followed. The study dealt with kindergarten children in Crete, who were divided in two teams. Every team consisted of experimental and control group. Participants were 90 students (girls and boys) who studied in kindergarten classes. Approximately 47 children participated in the experimental group of each team, which taught numbers by the support of computers and 43 children in the control group. Initial and final tests were given to groups in order to measure these skills for the numbers. The results showed that the use of information and communication technologies is important for understanding the concept of numbers for children of preschool education.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The use of ICT in the first grade of primary school for teaching circles, triangles, rectangles and squares",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2643604.2643607",
            "Abstract": "The purpose of this study is to investigate if information and communications technology (ICT) helps to improve first grade students' basic geometry achievement regarding circles, triangles, rectangles and squares. Our research compares the level of geometrical competence of the students taught using our ICT oriented learning method specifically targeting'Realistic Mathematics Education'(RME) for geometry concepts, as opposed to traditional teaching methodology. The designed software consisted of a story and several activities with and without the use of computers for circles, triangles, rectangles and squares. It was designed following the background of RME theory for geometry concepts. The study dealt with first grade students in Crete and Athens, who were divided into two groups (experimental and control). The experimental group consisted of 113 students who were taught about circles, triangles …",
            "Abstract entirety": 0,
            "Author pub id": "6gocJEwAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Οι Απόψεις των νηπιαγωγών για την χρήση του υπολογιστή στο Νηπιαγωγείο. Στο Αξιοποίηση των Τεχνολογιών της Πληροφορίας και της Επικοινωνίας στην Διδακτική Πράξη",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=7042131708533849233&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "ΥΠΕΠΘ, Πανεπιστήμιο Αιγαίου, Ε.Α.Ι.Τ.Υ., Σύρος"
        },
        {
            "Title": "Does ICT affect the understanding of ellipsoids, cylinders and cones among students from University of Applied Sciences?",
            "Publication year": 2018,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJTEL.2018.095123",
            "Abstract": "Our research compares the improvement of the students' stereometry competence of ellipsoids, cylinders and cones using two teaching approaches. The first one employs our ICT-oriented learning method specifically targeting the Van Hiele model for stereometry concepts. The second method is based on the traditional approach of teaching university students. The study deals with second year undergraduate students form the Department of Civil Engineering at Piraeus University of Applied Sciences. The sample was divided into two groups (experimental and control). The results showed that the teaching approaches of our intervention, with the additional use of ICT using the background of the Van Hiele model, contribute significantly more to the development of university students' stereometry competence as compared to other traditional methods.",
            "Abstract entirety": 1,
            "Author pub id": "6gocJEwAAAAJ:hC7cP41nSMkC",
            "Publisher": "Inderscience Publishers (IEL)"
        }
    ]
}]