[{
    "name": "Νικόλαος Καραμπετάκης",
    "romanize name": "Nikolaos Karampetakis",
    "School-Department": "Μαθηματικών",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 4693,
    "Scholar name": "Nicholas Karampetakis",
    "Scholar id": "TkKJCukAAAAJ",
    "Affiliation": "Professor in Mathematical Control Theory, Aristotle University of Thessaloniki",
    "Citedby": 929,
    "Interests": [
        "Mathematical Control Theory"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=TkKJCukAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Special issue on: advances in multidimensional systems and signal processing",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11045-011-0157-0.pdf",
            "Abstract": "The past five decades, in particular, have seen a continually growing interest in so-called two-dimensional (2D) or, more generally, multidimensional (nD) systems. This is clearly related to the wide variety of applications of both practical and/or theoretical interest. The key unique feature of an nD system is that the plant or process dynamics (input, output and state variables) depend on more than one indeterminate and hence information is propagated in several independent directions. Many physical processes have a clear nD structure. Also, the nD approach is frequently used as an analysis tool to assist, or in some cases enable, the solution of a wide variety of problems. A key point is that the applications areas for nD systems theory/engineering can be found within the general areas of Circuits, Control (with particular emphasis for Repetitive Processes and Iterative Learning Control) and Signal Processing (and …",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer US"
        },
        {
            "Title": "On the solution space of discrete time AR-representations over a finite time horizon",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0024379503008887",
            "Abstract": "The main purpose of this work is to determine the forward and backward solution space of a nonregular discrete time AR-representation i.e. A(σ)ξ(k)=0, in a finite time horizon where A(σ) is a polynomial matrix and σ is the forward shift operator. The construction of the behavior is based on the structural invariants of the polynomial matrix that describes the AR-representation i.e. the finite and infinite elementary divisors and the right and left minimal indices of A(σ).",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:hFOr9nPyWt4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "On the computation of the inverse of a two-variable polynomial matrix by interpolation",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11045-010-0102-7.pdf",
            "Abstract": "Two interpolation algorithms are presented for the computation of the inverse of a two variable polynomial matrix. The first interpolation algorithm, is based on the Lagrange interpolation method that matches pre-assigned data of the determinant and the adjoint of a two-variable polynomial matrix, on a set of points on several circles centered at the origin. The second interpolation algorithm is using discrete fourier transforms (DFT) techniques or better fast fourier transforms which are very efficient algorithms available both in software and hardware and that they are greatly benefitted by the existence of a parallel environment (through symmetric multiprocessing or other techniques). The complexity of both algorithms is discussed and illustrated examples are given. The DFT-algorithm is implemented in the Mathematica programming language and tested in comparison to the respective built-in function of …",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer US"
        },
        {
            "Title": "On the fundamental matrix of the inverse of a polynomial matrix and applications",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.519.6284&rep=rep1&type=pdf",
            "Abstract": "The aim of this work is twofold: a) it uses the fundamental matrix of the resolvent of a regular pencil in order to provide an algorithm for the computation of the fundamental matrix of the inverse of a polynomial matrix, and b) it proposes a closed formula for the forward, backward and symmetric solution of an AutoRegressive Moving Average (ARMA). This closed formula is represented in terms of the fundamental matrix of the inverse of one of the polynomial matrices that describes the ARMA representation.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reachability and controllability of discrete time descriptor systems using the Weierstrass decomposition",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8394863/",
            "Abstract": "The reachability and controllability of descriptor systems is studied. Since discrete time descriptor systems are subject to certain consistency conditions in order for a solution to exist, we consider the problem of constructing an admissible input that can drive the system in any reachable state (or the origin) and that also satisfies the consistency conditions. This is done by first decomposing the system into its two subsystems, via the Weierstrass decomposition. Furthermore, algebraic criteria regarding the reachability and controllability of a descriptor system that involve its causal and non-causal subsystems are formulated.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new notion of equivalence for discrete time AR representations",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/002071709410001703223",
            "Abstract": "We present a new equivalence transformation termed divisor equivalence, that has the property of preserving both the finite and the infinite elementary divisor structures of a square non-singular polynomial matrix. This equivalence relation extends the known notion of strict equivalence, which dealt only with matrix pencils, to the general polynomial matrix case. It is proved that divisor equivalence characterizes in a closed form relation the equivalence classes of polynomial matrices that give rise to fundamentally equivalent discrete time auto-regressive representations.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Construction of algebraic-differential equations with given smooth and impulsive behaviour",
            "Publication year": 2015,
            "Publication url": "https://academic.oup.com/imamci/article-abstract/32/1/195/915204",
            "Abstract": "This paper consists of two parts. In the first part, we present the smooth and impulsive solution space B of the system of algebraic and differential equations A(ρ) β(t)=0, ρ≔d/dt, where A(ρ)∈ℝ[ρ]r × r (with detA (ρ) ≠ 0) is given. The solution space is given in terms of finite and infinite Jordan pairs of the polynomial matrix A(ρ), and therefore a necessary introduction is given for finite and infinite zero structures of the polynomial matrix A(ρ). In the second part, we study the inverse problem: Given a smooth and impulsive solution space B, we try to find out a system of algebraic and differential equations A(ρ) β(t) = 0, ρ ≔ dt with the given solution space.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "CoDIT'18 Committees",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8394770/",
            "Abstract": "CoDIT&#x0027;18 Committees Page 1 CoDIT’18 Committees Conference Organizing \nCommittee Honorary Chair Antonis I. Vardulakis, Aristotle University of Thessaloniki, Greece \nGeneral co‐Chairs Nicholas P. Karampetakis, Aristotle University of Thessaloniki, Greece Maria \nPia Fanti, Polytechnic of Bari, Italy Program co‐Chairs Bozenna Pasik‐Duncan, University of \nKansas, USA Achraf J. Telmoudi, University of Sousse, Tunisia Enrique H. Viedma, University of \nGranada, Spain Publication co‐Chairs Abdel Aitouche, University of Lille 1, France Mariagrazia \nDotoli, Polytechnic of Bari, Italy Special Sessions co‐Chairs Imed Kacem, University of \nLorraine, France Ioannis Pratikakis, Democritus University of Thrace, Greece Local Organizing \nCommittee Efstathios Antoniou, Greece Nicholas P. Karampetakis, Greece Olena Kuzmych, \nUkraine Panos Seferlis, Greece Achraf J. Telmoudi, Tunisia Georgios Tsaklidis, Greece , S(…",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On conditions guaranteeing two rational matrices possess identical pole/zero structure",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207179.2019.1612095",
            "Abstract": "The paper consists of two parts. In the first part an equivalence transformation is proposed that leaves invariant only the pole structure of rational matrices in the extended complex plain. In the second part, the proposed equivalence transformation is extended in order to preserve the zero structure as well.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:UHK10RUVsp4C",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Linearizations of Polynomial Matrices with Symmetries and Their Applications.",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1467008/",
            "Abstract": "In E.N. Antoniou and S. Vologiannidis ( 2004), a new family of companion forms associated to a regular polynomial matrix has been presented generalizing similar results presented by M. Fiedler in M. Fiedler (2003) where the scalar case was considered. This family of companion forms preserves both the finite and infinite elementary divisors structure of the original polynomial matrix, thus all its members can be seen as linearizations of the corresponding polynomial matrix. In this note we examine its applications on polynomial matrices with symmetries which appear in a number of engineering fields",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On a first order hold discretization for singular systems",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6031414/",
            "Abstract": "This note proposes a new discretization method. The proposed sampled system is described in terms of the Markov parameters of the system and therefore the proposed method is easily implemented. The methodology we use is a first-order hold discretization for the input and first-order approximation of its derivatives.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the computation of the Drazin inverse of a polynomial matrix",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=12853023790098509590&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:TQgYirikUcIC",
            "Publisher": "PUSHPA"
        },
        {
            "Title": "Symbolic Computations on Rings of Rational Functions and Applications in Control Engineering",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04772-5_76",
            "Abstract": "A collection of algorithms implemented in Mathematica 7.0, freely available over the internet, and capable to manipulate rational functions and solve related control problems using polynomial analysis and design methods is presented. The package provides all the necessary functionality and tools in order to use the theory of stable functions, and is expected to provide the necessary framework for the development of several other algorithms that solve specific control problems.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Effective computations with 2-variable polynomial matrices in MATHEMATICA",
            "Publication year": 2004,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10385",
            "Abstract": "This report describes our jointwork on implemen-tation of effective numerical routines for two-variable polyno-mial matrices in the MATHEMATICA software. New functions are connected to the already created program package, being developed at the Czech Technical University in Prague, which calculates only with polynomial matrices in one variable. As the  rst step, new polynomial object for 2-D polynomial matrix was created in theMATHEMATICA programming language. This was essential for good integration with the polynomial package mentioned above. Implementation of a bunch of ef cient and reliable numerical routines followed.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Closed form solution for the equations of motion for constrained linear mechanical systems and generalizations: an algebraic approach",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S001600321630446X",
            "Abstract": "In this paper, a mathematical methodology is presented for the determination of the solution of motion for linear constrained mechanical systems applicable also to systems with singular coefficients. For mathematical completeness and also to incorporate some other interesting cases, the methodology is formulated for a general class of higher order matrix differential equations. Thus, describing the system in an autoregressive moving average (ARMA) form, the closed form solution is derived in terms of the finite and infinite Jordan pairs of the system׳s polynomial matrix. The notion of inconsistent initial conditions is considered and an explicit formula for the homogeneous system is given. In this respect, the methodology discussed in the present note provides an alternative view to the problem of computation of the response of complex multi-body systems. Two interesting examples are provided and applications of …",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:bnK-pcrLprsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Error analysis for the discretization of singular systems",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6961360/",
            "Abstract": "The main purpose of this work is to propose upper bounds for the local truncation error between the continuous time response of a state space (resp. generalized state space) system and the response of its discretized model that came from either a zero-order hold or a triangle order hold discretization.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Descriptor realizations of autoregressive representations",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8189597/",
            "Abstract": "In Pugh et al.(1998, Automatica, submitted), fundamental equivalence between AutoRegressive (AR) representations has been defined. Actually, two AR‐representations are defined to be fundamentally equivalent in the case there exists a bijective polynomial differential map between their behaviours. In this paper, it is shown how to reduce an AR‐representation to a fundamental equivalent realization in descriptor form.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:2P1L_qKh6hAC",
            "Publisher": "OUP"
        },
        {
            "Title": "On the solution of the implicit Roesser model",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1467009/",
            "Abstract": "The main objective of this work is to provide a close formula for the backward and symmetric solution of the 2-D singular Roesser model given in Roesser, RP (1975). Of fundamental importance in our approach is the relative forward and backward fundamental matrix. An algorithm is also given for the determination of the backward fundamental matrix sequence",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the exact modelling of linear systems",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/imamci/article-abstract/37/3/730/5553670",
            "Abstract": "It is well known that given the continuous-time AutoRegressive representation  where  denotes the differential operator and  a regular polynomial matrix, we can always construct the smooth behaviour of this system, by using the finite zero structure of . The main theme of this work is to study the following inverse problem: given a specific smooth behaviour, find a family of regular polynomial matrices , such that the system  has exactly the prescribed behaviour. Following an idea coming from  and  we present an algorithm which solve this problem and can be easily implemented either in a computer programming language like C++ or in a computer algebra system like Mathematica.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:JQOojiI6XY0C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Infinite elementary divisor structure-preserving transformations for polynomial matrices",
            "Publication year": 2003,
            "Publication url": "http://dlibra.bu.uz.zgora.pl/Content/2774/6kara.pdf",
            "Abstract": "The main purpose of this work is to propose new notions of equivalence between polynomial matrices that preserve both the finite and infinite elementary divisor structures. The approach we use is twofold:(a) the ‘homogeneous polynomial matrix approach’, where in place of the polynomial matrices we study their homogeneous polynomial matrix forms and use 2-D equivalence transformations in order to preserve their elementary divisor structure, and (b) the ‘polynomial matrix approach’, where some conditions between the 1-D polynomial matrices and their transforming matrices are proposed.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "University of Zielona Gora Press"
        },
        {
            "Title": "Linearization of bivariate polynomial matrices expressed in non monomial basis",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11045-014-0278-3.pdf",
            "Abstract": "The paper proposes a two step algorithm that reduces a bivariate polynomial matrix  expressed in Newton or Lagrange base to a bivariate matrix pencil  with the same invariant polynomials and zero structure.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "PolyxGui: A new Graphical User Interface (GUI) for the polynomial toolbox Polyx",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4602040/",
            "Abstract": "It is well known that the polynomial toolbox Polyx is a package for systems, signals and control analysis and design based on advanced polynomial methods. Polyx consists of as many as 222 M-files in Matlab code, which implements new original algorithms that are fast and reliable. The aim of this work is to present a new graphical user interface (GUI), build in Matlab, for the easy use of the polynomial toolbox Polyx. This new interface gives the user, who is not very familiar with all these functions of Polyx, the opportunity to handle easily polynomial matrices and systems.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the construction of the forward and backward solution space of a discrete time AR-representation",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474667015386109",
            "Abstract": "The main purpose of this work is to construct the forward and backward solution space of a nonregular discrete time AR-representation i.e. A(σ)ξ(κ) = 0, in a closed interval [0, N] where A(σ) is a polynomial matrix and σ is the forward shift operator. The construction of the behavior is based on the structural invariants of the polynomial matrix which describe the AR-representation, i.e. the finite and infinite elementary divisors and the right minimal indices of A(σ). Copyright © 2002 IFAC",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the realization theory of polynomial matrices and the algebraic structure of pure generalized state space systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7068426/",
            "Abstract": "We review the realization theory of polynomial (transfer function) matrices via “pure” generalized state space models. The concept of an irreducible at infinity generalized state space realization of a polynomial matrix is defined and the mechanism of the “cancellations” of “decoupling zeros at infinity” is closely examined. The difference between the concepts of irreducibility and minimality of generalized state space realizations of polynomial (transfer function) matrices is pointed out and the associated concepts of dynamic and non dynamic variables appearing in generalized state space realizations are also examined. Finally the isomorphism between the zeros at infinity of the “infinite pole pencil” and the Rosenbrock system matrix of an irreducible at infinity generalized state space realization of a polynomial matrix and the pole and zero structure at infinity of such a polynomial matrix is examined.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Polynomial matrix equivalences: system transformations and structural invariants",
            "Publication year": 2021,
            "Publication url": "https://academic.oup.com/imamci/article-abstract/38/1/54/2739342",
            "Abstract": "The present article is a survey on linear multivariable systems equivalences. We attempt a review of the most significant forms of system equivalence having as a starting point matrix transformations preserving certain aspects of their spectral structure. From a system theoretic point of view, the need for a variety of forms of polynomial matrix equivalences, arises from the fact that different types of spectral invariants give rise to different types of dynamics of the underlying linear system. A historical perspective of the key results and their contributors is also given.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:olpn-zPbct0C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "On the structural analysis of linear descriptor systems",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8102685/",
            "Abstract": "The algebraic structure of a matrix pencil is basic to research linear descriptor systems. The Jordan chains of vectors corresponding to the structural indices of a full row rank matrix pencil are derived by an algorithm and then two nonsingular matrices transforming the pencil to its Kronecker canonical form are constructed as in the regular case.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal degree estimation of the determinant of a polynomial matrix",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/38472372/080244_final.pdf",
            "Abstract": "In this paper we present a recursive formula to find the degree of the determinant of a bivariate polynomial matrix. The proposed algorithm returns the optimal estimation of the degree but has a very large computational cost. The recursive formula can be represented as an assignment problem which is solved with the Hungarian method that has a very small computational cost. The contribution of the proposed formula is to reduce the required interpolation points for the evaluation–interpolation technique. That is, we reduce the evaluations which are computations of determinants or inverse matrices.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Natural Sciences Publishing Corp"
        },
        {
            "Title": "On the solution of the general singular model of 2-D systems",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474667016366447",
            "Abstract": "The main objective of this work is to provide a closed formula for the forward, backward and symmetric solution of the 2-D general singular model (GSM) given in (Kurek, 1985). Of fundamental importance in our approach is the relative forward and backward fundamental matrix.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:Zph67rFs4hoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Special issue on the use of computer algebra systems for computer aided control system design",
            "Publication year": 2006,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207170600882346",
            "Abstract": "The importance of the continuing and growing need in the systems and control community for reliable algorithms and robust numerical software for increasingly challenging applications is well known and has already been reported elsewhere (IEEE Control Systems Magazine, Vol. 24, Issue 1). However, we have all had the experience of working on a mathematical project where an increased number of symbolic manipulations was needed. In a simple case, the required computation might have been to compute the Laplace transform or the inverse Laplace transform of a function, or to find the transfer function matrix for a given system topology where parameters are included. In a more demanding situation the required computation might have been to find the parametric family of solutions of a polynomial matrix Diophantine equation resulting from a variety of control problems such as those associated with …",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Solution of discrete ARMA-representations via MAPLE",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0096300302002102",
            "Abstract": "In Karampetakis et al. [Circuits Systems and Signal Processing 20 (2001) 89] closed formulae for the forward, backward and symmetric solutions of an ARMA-representation have been presented. Here these formulae are implemented in the symbolic computational language MAPLE and corresponding MAPLE code is provided.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "RATRIX: A RATional matRIX calculator for computer aided analysis and synthesis of linear multivariable control systems",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Nicholas-Karampetakis/publication/250396718_RATRIX_A_RATional_matRIX_calculator_for_computer_aided_analysis_and_synthesis_of_linear_multivariable_control_systems/links/55e0285d08ae2fac47196220/RATRIX-A-RATional-matRIX-calculator-for-computer-aided-analysis-and-synthesis-of-linear-multivariable-control-systems.pdf",
            "Abstract": "The main aim of this work is to present an interactive software tool environment for analysis and synthesis for linear multivariable systems using the numeric power and the symbolic algebra capabilities of the MAPLE computer algebra package.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Discretization of singular systems and error estimation",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6689510/",
            "Abstract": "This paper proposes a discretization technique of a descriptor differential system. The methodology used is both triangular first order hold (TFOH) discretization and zero order hold (ZOH) for the input function. Upper bounds for the error between the continuous time solution and the discrete time solution are produced for both discretization methods and are shown to be better than other approximations in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reachability and controllability of discrete time descriptor systems",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6417867/",
            "Abstract": "The causal and non-causal reachability Gramians are used, in order to define the reachability subspace which is the set of all states reachable from the origin. Controllability of the disrete-time regular descriptor system by means of the forward solution is examined and new criteria for testing reachability (controllability from the origin) and controllability to the origin in the forward sense are proved.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Observability of linear discrete-time systems of algebraic and difference equations",
            "Publication year": 2019,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207179.2017.1354399",
            "Abstract": "The notion of observability for higher order discrete-time systems of algebraic and difference equations is studied. Such systems are also known as polynomial matrix descriptions . Attention is first given to a special form of descriptor systems with a state lead in the output. This system is transformed into its causal and noncausal subsystems and observability criteria are given in terms of the subsystem's matrices, and the fundamental matrix sequence of the matrix pencil (σE − A). Afterwards, the higher order system is studied. By transforming it into a first-order descriptor system of the above form, an observability criterion is provided for the higher order system in terms of the Laurent expansion at infinity of the system's polynomial matrix. In addition, observability is connected with the coprimeness of the polynomial matrices of the higher order system and the coprimeness of the matrix pencils of the descriptor system.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Descriptor systems toolbox: a Mathematica-based package for descriptor systems",
            "Publication year": 2008,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10394",
            "Abstract": "It is well known that descriptor systems or generalized state-space systems are the natural framework for the study of physical, electrical mechanical, interconnected, economical and social systems. Although a number of software packages has been developed for state-space systems, which is can be seen as special case of descriptor systems, there are only few for descriptor systems. In this paper we present an efficient and reliable Mathematica software package for descriptor systems that can be used both for teaching and research in the field of control theory. The proposed package is fully compatible with the Control Systems Professional Suite of Wolfram Research Inc. and is intended to be an add-on for the Control Systems Professional Suite in the near future. This package has been created in collaboration with Wolfram Research Inc. and Zenon S.A. under a grant from the General Secreteriat for Research and Technology of Greece.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Inverses of multivariable polynomial matrices by discrete Fourier transforms",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:MULT.0000037345.60574.d4",
            "Abstract": "The problem of the fast computation of the Moore–Penrose and Drazin inverse of a multi-variable polynomial matrix is addressed. The algorithms proposed, use evaluation-interpolation techniques and the Fast Fourier transform. They proved to be faster than other known algorithms. The efficiency of the algorithms is illustrated via randomly generated examples.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:qUcmZB5y_30C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Symbolic implementation of Leverrier-Faddeev algorithm and applications",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Nicholas-Karampetakis/publication/250142226_SYMBOLIC_IMPLEMENTATION_OF_LEVERRIER-FADDEEV_ALGORITHM_AND_APPLICATIONS/links/02e7e521a2939ec62c000000/SYMBOLIC-IMPLEMENTATION-OF-LEVERRIER-FADDEEV-ALGORITHM-AND-APPLICATIONS.pdf",
            "Abstract": "In this paper we propose two algorithms for the computation of the Drazin inverse, based on the Leverrier-Faddeev algorithm. These algorithms represent extensions of paper [3] and a continuation of the paper [4]. A few matrix equations which include rational matrices are solved by means of the Drazin inverse and the Moore-Penrose inverse of rational matrices.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The performance of the MATLAB Parallel Computing Toolbox in specific problems",
            "Publication year": 2012,
            "Publication url": "http://universitypress.org.uk/library/2014/santorini/bypaper/COMPUTERS/COMPUTERS1-05.pdf",
            "Abstract": "In this work, we present the performance of three different parallel computing approaches of the MATLAB Parallel Computing Toolbox. In particular, we use the command “parfor”, the command “spmd” and the technique “scheduler”. The comparison of the three approaches in terms of computations and memory are presented. The three approaches are applied to two specific problems: a) searching of a value into a matrix and b) prime factorization. The first problem is bounded by MATLAB for the size of matrix, namely, has memory problems, and the second problem is bounded by MATLAB for numerical precision and time complexity. Finally, the executions of the corresponding parallel algorithms in a multi-worker lab are presented.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling of discrete time auto-regressive systems with given forward and backward behavior",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6961361/",
            "Abstract": "We study the behavior of discrete time AR-representations. A theorem is provided connecting the backward behavior of a system, due to its infinite elementary divisors, with the forward behavior of its dual system. We first use this result to construct a system satisfying a certain backward behavior. In addition to this, we propose a way to combine this result with previous ones to create an algorithm for computing a system satisfying a given forward and backward behavior.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the computation of the generalized inverse of a polynomial matrix",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8132956/",
            "Abstract": "The main purpose of this paper is to present a quicker and less memory-expensive algorithm for the generalized inversion of polynomial matrices than those presented earlier (Karampetakis, 1997a Computation of the generalized inverse of a polynomial matrix and applications. Linear Algebr. Appl.252, 35–60 and Karampetakis, 1997b Generalized inverses of two variable polynomial matrices and applications. Circuit Syst. & Signal Process.16, 439–453).",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:7PzlFSSx8tAC",
            "Publisher": "OUP"
        },
        {
            "Title": "An algorithm for two‐variable rational interpolation suitable for matrix manipulations with the evaluation–interpolation method",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/nla.2378",
            "Abstract": "An algorithm for two‐variable rational interpolation is developed. The algorithm is suitable for interpolation cases where neither the number of interpolation points nor the final degrees of the rational interpolant are known a priori. Instead, a maximum degree for the interpolant's numerator and denominator is assumed. By testing the condition number of the interpolation system's matrix at each step, the necessary reductions are made in order to cope with nonnormality and unattainability occasions. The algorithm can be used for applications of the Evaluation–Interpolation technique in matrix manipulations, such as finding the inverse of a matrix with elements rational functions of two variables. Symbolic calculations are completely avoided, thus keeping the execution time very low even if the system size is large. Most importantly, the algorithm achieves accurate function recoveries for greater polynomial degrees than …",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Numerical Computation of the Determinant of a Bivariate Polynomial Matrix",
            "Publication year": 2015,
            "Publication url": "http://www.m-hikari.com/ams/ams-2015/ams-101-104-2015/p/varsamisAMS101-104-2015.pdf",
            "Abstract": "The paper, based on the technique evaluation-interpolation, proposes a new numerical algorithm for the computation of the determinant of a bivariate polynomial matrix. The numerical algorithm uses the Newton bivariate polynomial interpolation with equidistant points. The algorithm is applied to the programming environment of MATLAB and is compared to the corresponding build-in function of MATLAB det () which uses symbolic operations.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Symbolic computation of the Moore–Penrose inverse using a partitioning method",
            "Publication year": 2005,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207160512331323353",
            "Abstract": "We propose an extension of the Greville’s partitioning method for computing the Moore–Penrose inverse of two-variable rational and polynomial complex matrices. In addition, we developed corresponding effective algorithm, applicable in the case when there are only few degrees in A(s 1, s 2) corresponding to non-zero coefficient matrices. These algorithms are implemented using symbolic and functional possibilities of the package MATHEMATICA.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Matrix pencil equivalents of symmetric polynomial matrices",
            "Publication year": 2010,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/asjc.175",
            "Abstract": "A new family of companion forms for polynomials and polynomial matrices has recently been developed in (Lin. Algebra Appl. 2003; 372: 325–331; Electron. J. Lin. Algebra 2004; 11:78–87) respectively. The application of these new companion forms to polynomial matrices with symmetries has been examined in (Electron. J. Lin. Algebra 2006; 15:107–114). In this work we extend the results presented in (Electron. J. Lin. Algebra 2006; 15:107–114) to the case of 2‐D polynomial matrices. Thus, we provide a new matrix pencil that preserves both the symmetric structure and the structural invariants, of the original 2‐D polynomial matrix. The results are also extended to the polynomial system matrix case. Copyright © 2010 John Wiley and Sons Asia Pte Ltd and Chinese Automatic Control Society",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "John Wiley and Sons Asia Pte Ltd"
        },
        {
            "Title": "Symbolic Computations on Rings of Rational Functions and Applications in Control Engineering",
            "Publication year": 2009,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10367",
            "Abstract": "A collection of algorithms implemented in Mathematica 7.0, freely available over the internet, and capable to manipulate rational functions and solve related control problems using polynomial analysis and design methods is presented. The package provides all the necessary functionality and tools in order to use the theory of Ω−stable functions, and is expected to provide the necessary framework for the development of several other algorithms that solve specific control problems.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:tKAzc9rXhukC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "On the computation of the GCD (LCM) of 2-d polynomials",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7068626/",
            "Abstract": "The main contribution of this work is to provide an algorithm for the computation of the GCD and LCM of 2-d polynomials, based on the DFT techniques. The whole theory is implemented via illustrative examples.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Construction of algebraic and difference equations with a prescribed solution space",
            "Publication year": 2017,
            "Publication url": "https://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-2762109a-4c04-432e-b08c-4a748a71659d",
            "Abstract": "This paper studies the solution space of systems of algebraic and difference equations, given as auto-regressive (AR) representations A (σ) β (k)= 0, where σ denotes the shift forward operator and A (σ) is a regular polynomial matrix. The solution space of such systems consists of forward and backward propagating solutions, over a finite time horizon. This solution space can be constructed from knowledge of the finite and infinite elementary divisor structure of A (σ). This work deals with the inverse problem of constructing a family of polynomial matrices A (σ) such that the system A (σ) β (k)= 0 satisfies some given forward and backward behavior. Initially, the connection between the backward behavior of an AR representation and the forward behavior of its dual system is showcased. This result is used to construct a system satisfying a certain backward behavior. By combining this result with the method provided by Gohberg et al.(2009) for constructing a system with a forward behavior, an algorithm is proposed for computing a system satisfying the prescribed forward and backward behavior.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Forward, backward, and symmetric solutions of discrete ARMA representations",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1007/BF01204924",
            "Abstract": "The main objective of this paper is to determine a closed formula for the forward, backward, and symmetric solution of a general discrete-time Autoregressive Moving Average representation. The importance of this formula is that it is easily implemented in a computer algorithm and gives rise to the solution of analysis, synthesis, and design problems.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:HDshCWvjkbEC",
            "Publisher": "Birkhäuser-Verlag"
        },
        {
            "Title": "On the realization theory of polynomial matrices and the algebraic structure of pure generalized state space systems",
            "Publication year": 2009,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10366",
            "Abstract": "We review the realization theory of polynomial (transfer function) matrices via “pure” generalized state space system models. The concept of an irreducible-at-infinity generalized state space realization of a polynomial matrix is defined and the mechanism of the “cancellations” of “decoupling zeros at infinity” is closely examined. The difference between the concepts of irreducibility and minimality of generalized state space realizations of polynomial (transfer function) matrices is pointed out and the associated concepts of dynamic and non-dynamic variables appearing in generalized state space realizations are also examined",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:Fu2w8maKXqMC",
            "Publisher": "AMCS"
        },
        {
            "Title": "On the modeling of discrete time auto-regressive representations",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6996924/",
            "Abstract": "It is well known [2], [6], that given the discrete-time AutoRegressive representation A(σ)β(k) = 0; where σ denotes the shift forward operator and A(σ) a polynomial matrix, we can always construct the forward-backward behavior of this system, by using the finite and infinite elementary divisor structure of A(σ). The main theme of this work is to study the inverse problem: given a specific forward-backward behavior, find a family of polynomial matrices A(σ), such that the system A(σ)β(k) = 0 has exactly the prescribed behavior. As we shall see, the problem can be reduced either to a linear system equation problem or to an interpolation problem.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the construction of a decomposable linearization of nonregular polynomial matrices",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7330986/",
            "Abstract": "The analysis of a homogeneous system of algebraic-differential equations is related to the algebraic structure of the polynomial matrix that describes the system. A decomposable pair containing this algebraic structure exists for the regular case. Extending the results to the nonregular case, we construct a decomposable pair containing information from the right minimal indices of the polynomial matrix, in addition to the information coming from its finite and infinite elementary divisors. Once again a 'decomposable linearization' is introduced.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Descriptor systems toolbox: a Mathematica-based package for descriptor systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4627359/",
            "Abstract": "It is well known that descriptor systems or generalized state-space systems are the natural framework for the study of physical, electrical mechanical, interconnected, economical and social systems. Although a number of software packages has been developed for state-space systems, which is can be seen as special case of descriptor systems, there are only few for descriptor systems. In this paper we present an efficient and reliable Mathematica software package for descriptor systems that can be used both for teaching and research in the field of control theory. The proposed package is fully compatible with the Control Systems Professional Suite of Wolfram Research Inc. and is intended to be an add-on for the Control Systems Professional Suite in the near future. This package has been created in collaboration with Wolfram Research Inc. and Zenon S.A. under a grant from the General Secreteriat for Research …",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DFT calculation of the generalized and Drazin inverse of a polynomial matrix",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0096300302003776",
            "Abstract": "A new algorithm is presented for the determination of the (a) generalized inverse and (b) Drazin inverse, of a polynomial matrix. The proposed algorithms are based on the discrete Fourier transform and thus are computationally fast in contrast to other known algorithms. The above algorithms are implemented in the Mathematica programming language and illustrated via examples.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the Computation of the GCD of 2-D Polynomials.",
            "Publication year": 2007,
            "Publication url": "https://www.amcs.uz.zgora.pl/?action=download&pdf=AMCS_2007_17_4_4.pdf",
            "Abstract": "An interesting problem of algebraic computation is the computation of the greatest common divisor (GCD) of a set of polynomials. The GCD is usually linked with the characterisation of zeros of a polynomial matrix description of a system. The problem of finding the GCD of a set of n polynomials on R [x] of a maximal degree q is a classical problem that has been considered before (Karcanias et al., 2004). Numerical methods for the GCD (Karcanias et al., 1994; Mitrouli el al., 1993) were also developed. Due to the difficulty in finding the exact GCD of a set of polynomials, approximate algorithms were also developed (Noda et al., 1991). A comparison of algorithms for the calculation of the GCD of polynomials is given in (Pace et al., 1973).The main disadvantage of many algorithms is their complexity. In order to overcome these difficulties, we may use other techniques such as interpolation methods. For example, Schuster et al.(1992) used interpolation techniques in order to find the inverse of a polynomial matrix. The speed of interpolation algorithms can be increased by using Discrete Fourier Transform (DFT) techniques or, better, Fast Fourier Transform (FFT) techniques. Some of the advantages of DFT based algorithms are that there are very efficient algorithms available in both software and hardware and that they are well suited for parallel environments (through symmetric multiprocessing",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transformations between Bivariate Polynomial Bases",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/42507581/Transformations_between_Bivariate_Polyno20160209-7822-54gov7.pdf",
            "Abstract": "Dimitris Varsamis, Nicholas Karampetakis Abstract—It is well known, that any interpolating polynomial p (x, y) on the vector space Pn, m of two-variable polynomials with degree less than n in terms of x and less than m in terms of y, has various representations that depends on the basis of Pn, m that we select ie monomial, Newton and Lagrange basis etc. The aim of this short note is twofold: a) to present transformations between the coordinates of the polynomial p (x, y) in the aforementioned basis and b) to present transformations between these bases.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Newton bivariate polynomial interpolation with applications",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11045-012-0198-z.pdf",
            "Abstract": "The main purpose of this work is to provide recursive algorithms for the computation of the Newton interpolation polynomial of a given two-variable function. The special case where the interpolation polynomial has known upper bounds on the degree of each indeterminate is studied and applied to the computation of the inverse of a two-variable polynomial matrix.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A Descriptor Systems Package for MATHEMATICA",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Stavros-Vologiannidis/publication/235547518_A_Descriptor_Systems_Package_for_Mathematica/links/00b7d52d61b0c6f128000000/A-Descriptor-Systems-Package-for-Mathematica.pdf",
            "Abstract": "We describe a recently developed integrated software package called Descriptor System Toolbox (DSP), implemented under Mathematica. This new package is fully compatible with two other packages of Mathematica: Control System Professional an add on toolbox of Mathematica that is already in the 1.1 Version and Polynomial Control Systems recently developed by N. Munro [10]. The DSP uses the functions developed in these two packages in order to provide new tools for the analysis and synthesis of descriptor system representations also known us generalized state space descriptions. Additional functions are also provided for the manipulation of rational matrices that are quite useful in Control theory applications.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reachability of discrete time ARMA representations",
            "Publication year": 2021,
            "Publication url": "https://academic.oup.com/imamci/article-abstract/38/1/15/2669887",
            "Abstract": "A new formula for the solution of discrete time auto-regressive moving average (ARMA) representations is provided. Then, the concept of reachability (also known as controllability from the origin) is examined by showcasing the reachable subspace of the system and the consistent inputs that drive the system to a desired state, taking into account the admissible initial conditions. The theory is illustrated by an example and the study of the special cases of ARMA representations, i.e. state space systems, descriptor systems and causal systems.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:J-pR_7NvFogC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Reachability of discrete time causal ARMA representations",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7535857/",
            "Abstract": "The reachability subspace of discrete time causal ARMA representations is examined. First, the conditions under which a system is causal are studied and a formulafor the solution of a causal system is presented. Then, an important result regarding the set of admissible initial conditions is derived and the reachable subspace is provided.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Notions of equivalence for discrete time AR-representations",
            "Publication year": 2002,
            "Publication url": "http://www.nt.ntnu.no/users/skoge/prost/proceedings/ifac2002/data/content/01020/1020.pdf",
            "Abstract": "A transformation of polynomial matrices which preserves both the finite and infinite elementary divisor structure is presented and related to other known transformations.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the newton multivariate polynomial interpolation with applications",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6076875/",
            "Abstract": "The main purpose of this work is to provide an optimized version of the Newton divided-difference algorithm presented by [11] for the polynomial interpolation problem. This optimized algorithm is used for the computation of the determinant of a two-variable polynomial matrix.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Equivalence of AR‐representations in the light of the impulsive‐smooth behaviour",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/rnc.1135",
            "Abstract": "The paper presents a new notion of equivalence of non‐regular AR‐representations, based on the coincidence of the impulsive‐smooth behaviours of the underlying systems. The proposed equivalence is characterized by a special case of the usual unimodular equivalence and a restriction of the matrix transformation of full equivalence (Int. J. Control 1988; 47(1):53–64). Copyright © 2006 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:r0BpntZqJG4C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "An equivalent reduction of a 2-D symmetric polynomial matrix",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4776677/",
            "Abstract": "A new family of companion forms for polynomials and polynomial matrices has recently been developed in [4] and [1] respectively. The application of these new companion forms to polynomial matrices with symmetries has been examined in [2]. In this work we extend the results presented in [2] to the case of 2-D polynomial matrices and thus provide a new linearization of a 2-D polynomial matrix that preserves both the symmetric structure and the structural invariants, of the original 2-D polynomial matrix.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the algebraic structure of the Moore Penrose inverse of full row or full column rank polynomial matrices",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8820625/",
            "Abstract": "This work establishes the connection between the finite and infinite algebraic structure of a full row or column rank polynomial matrix and its Moore Penrose inverse. For non-singular matrices, it is known that the inverse has no finite zeros and its finite poles are the finite zeros of the original matrix, while the infinite poles and zeros of the original matrix are the infinite zeros and poles of its inverse respectively. The fact that the Moore Penrose inverse is unique for every matrix along with the fact that for non-singular matrices it coincides with the normal inverse leads to the assumption that a similar connection holds for the structure, both finite and infinite, of the Moore Penrose inverse of a polynomial matrix. We prove that the Moore Penrose inverse of a full row or column rank polynomial matrix has no finite zeros, and that extra poles appear, compared to the non-singular case. Furthermore, we prove that the result …",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:uLbwQdceFCQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computing generalized inverses of a rational matrix and applications",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/BF02832302",
            "Abstract": "In this paper we investigate symbolic implementation of two modifications of the Leverrier-Faddeev algorithm, which are applicable in computation of the Moore-Penrose and the Drazin inverse of rational matrices. We introduce an algorithm for computation of the Drazin inverse of rational matrices. This algorithm represents an extension of the papers [11] and [14]. and a continuation of the papers [15, 16]. The symbolic implementation of these algorithms in the package mathEmatica is developed. A few matrix equations are solved by means of the Drazin inverse and the Moore-Penrose inverse of rational matrices.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Notions of equivalence for linear multivariable systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6608814/",
            "Abstract": "The present paper is a survey on linear multivariable systems equivalences. We attempt a review of the most significant types of system equivalence having as a starting point matrix transformations preserving certain types of their spectral structure. From a system theoretic point of view, the need for a variety of forms of polynomial matrix equivalences, arises from the fact that different types of spectral invariants give rise to different types of dynamics of the underlying linear system. A historical perspective of the key results and their contributors is also given.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reachability and controllability of discrete-time descriptor systems",
            "Publication year": 2014,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207179.2013.827798",
            "Abstract": "The causal and non-causal reachability Grammians are used, in order to define the reachability subspace of discrete-time systems. Controllability of the discrete-time regular descriptor system by means of the forward solution is also examined and new criteria for testing reachability (controllability from the origin) and controllability to the origin in the forward sense are proved.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "On the discretization of singular systems",
            "Publication year": 2004,
            "Publication url": "https://academic.oup.com/imamci/article-abstract/21/2/223/661455",
            "Abstract": " This note proposes two new discretization methods. The proposed sampled systems are described in terms of the Markov parameters of the system and therefore the proposed methods are easily implemented. The methodology we use is a zero‐order hold discretization for the input and first‐order approximation of its derivatives. ",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "On the algebraic structure of the Moore–Penrose inverse of a polynomial matrix",
            "Publication year": 2021,
            "Publication url": "https://academic.oup.com/imamci/advance-article-abstract/doi/10.1093/imamci/dnab001/6134259",
            "Abstract": "This work establishes the connection between the finite and infinite algebraic structure of singular polynomial matrices and their Moore–Penrose (MP) inverse. The uniqueness of the MP inverse leads to the assumption that such a relation must exist. It is proved that the MP inverse of a singular polynomial matrix has no finite zeros and its finite poles are fully determined. Furthermore, the existence of a correspondence between the infinite pole/zero structure of any singular polynomial matrix and its MP inverse is proved to exist. Finally, it is shown that the minimal indices of the two aforementioned matrices are connected as well.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Zero Coprime System Equivalence of Singular 2-D Linear Models",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4124880/",
            "Abstract": "The connection between the polynomial matrix descriptions (PMD's) of the various singular 2D linear models is considered. It is shown that the transformation of zero coprime system equivalence provides the basis for the reduction of any given singular 2D general PMD to a singular Roesser form. The exact form of the transformation is established",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generalized inversion by interpolation",
            "Publication year": 2007,
            "Publication url": "https://www.jstor.org/stable/26194888",
            "Abstract": "We investigate two algorithms for computing the Moore-Penrose and Drazin inverse of a given one-variable polynomial matrix by interpolation. These algorithms differ in the method used for constant matrices inverses computing. The first algorithm uses the Grevile’s method, and the second one uses the Leverrier-Faddeev method and its generalization. These algorithms are especially useful for symbolic computation in procedural programming languages. We compare results by implementing the algorithms in the programming package MATHEMATICA and in the procedural programming languages DELPHI and C++.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:WbkHhVStYXYC",
            "Publisher": "Faculty of Sciences and Mathematics, University of Niš"
        },
        {
            "Title": "On the computation of Drazin inverse of a rational matrix and applications",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=8939250325862551470&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:maZDTaKrznsC",
            "Publisher": "Technical Report, Department of Mathematics, Aristotle University of Thessaloniki, Thessaloniki 54006, Greece"
        },
        {
            "Title": "An optimal bivariate polynomial interpolation basis for the application of the evaluation-interpolation technique",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Varsamis/publication/258340272_An_Optimal_Bivariate_Polynomial_Interpolation_Basis_for_the_Application_of_the_Evaluation-Interpolation_Technique/links/00b7d527e6122d7dd6000000/An-Optimal-Bivariate-Polynomial-Interpolation-Basis-for-the-Application-of-the-Evaluation-Interpolation-Technique.pdf",
            "Abstract": "A new basis of interpolation points for the special case of the Newton two variable polynomial interpolation problem is proposed. This basis is implemented when the upper bound of the total degree and the degree in each variable is known. It is shown that this new basis under certain conditions (that depends on the degrees of the interpolation polynomial), coincides either with the known triangular/rectangular basis or it is a polygonal basis. In all cases it uses the least interpolation points with further consequences to the complexity of the algorithms that we use.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:Se3iqnhoufwC",
            "Publisher": "Natural Sciences Publishing Corp"
        },
        {
            "Title": "Notions of equivalence for linear multivariable systems",
            "Publication year": 2013,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10363",
            "Abstract": "The present paper is a survey on linear multivariable systems equivalences. We attempt a review of the most significant types of system equivalence having as a starting point matrix transformations preserving certain types of their spectral structure. From a system theoretic point of view, the need for a variety of forms of polynomial matrix equivalences, arises from the fact that different types of spectral invariants give rise to different types of dynamics of the underlying linear system. A historical perspective of the key results and their contributors is also given.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Algebraic methods for the construction of algebraic-difference equations with desired behavior",
            "Publication year": 2018,
            "Publication url": "https://journals.uwyo.edu/index.php/ela/article/view/1841",
            "Abstract": "For a given system of algebraic and difference equations, written as an Auto-Regressive (AR) representation , where  denotes the shift forward operator and  a regular polynomial matrix, the forward-backward behavior of this system can be constructed by using the finite and infinite elementary divisor structure of . This work studies the inverse problem: Given a specific forward-backward behavior, find a family of regular or non-regular polynomial matrices , such that the constructed system  has exactly the prescribed behavior. It is proved that this problem can be reduced either to a linear system of equations problem or to an interpolation problem and an algorithm is proposed for constructing a system satisfying a given forward and/or backward behavior.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A parallel searching algorithm for the insetting procedure in Matlab Parallel Toolbox",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6354381/",
            "Abstract": "In this paper we present the implementation of a parallel searching algorithm, which is used for the insetting procedure in cartography. The calculation time of the above procedure is very long due to the fact that the datasets in cartography are maps with large and very large resolution. The purpose of this proposal is to reduce the calculation time in a multicore machine with shared memory. The proposed algorithm and the performance tests are developed in Matlab Parallel Toolbox.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Solution Space of Ar-Representations. I. Continuous Time Case",
            "Publication year": 2002,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3142678",
            "Abstract": "In this paper the solution space of ()()= 0 is considered. Here:=/,() is a polynomial matrix and (), defined on the half axis [0–,+∞), is not restricted to be infinitely continuously differentiable, but can be impulsive instead. The matrix () can be singular. The aim of this paper is to determine the solution space in relation to some structural invariants of (). These invariants are: finite and infinite zero structure, right and left minimal indices.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Numerator-Denominator Structures of nD MFDs",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4124881/",
            "Abstract": "The approach to defining the zero/pole structure of an n-D rational matrix via the numerator/denominator zero structures of its MFDs is investigated. The possible coprimeness types a MFD can possess is resolved, and relationships between the zero structures which arise are derived",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Equivalence of AR-representations in the light of the impulsive-smooth behaviour",
            "Publication year": 2007,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10365",
            "Abstract": "The paper presents a new notion of equivalence of non-regular AR-representations, based on the coincidence of the impulsive-smooth behaviours of the underlying systems. The proposed equivalence is characterized by a special case of the usual unimodular equivalence and a restriction of the matrix transformation of full equivalence (Int. J. Control 1988; 47(1):53–64). Copyright © 2006 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:W5xh706n7nkC",
            "Publisher": "John Wiley & Sons Ltd"
        },
        {
            "Title": "On the computation of the minimal polynomial of a polynomial matrix",
            "Publication year": 2005,
            "Publication url": "http://zbc.uz.zgora.pl/Content/57520/AMCS_2005_15_3_3.pdf",
            "Abstract": "It is well known from the Cayley Hamilton theorem that every matrix A∈ Rr× r satisfies its characteristic equation (Gantmacher, 1959), ie, if p (s):= det (sIr− A)= sr+ p1sr− 1+···+ pr, then p (A)= 0. The Cayley Hamilton theorem is still valid for all cases of matrices over a commutative ring (Atiyah and McDonald, 1964), and thus for multivariable polynomial matrices. Another form of the Cayley-Hamilton theorem, also known as the relative Caley-Hamilton theorem, is given in terms of the fundamental matrix sequence of the resolvent of the matrix, ie, if (sIr− A)− 1=",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Zielona Góra: Uniwersytet Zielonogórski"
        },
        {
            "Title": "On the Kronecker canonical form of a full row rank matrix pencil and applications",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/imamci/article-abstract/37/3/987/5677401",
            "Abstract": "The Kronecker canonical form (KCF) of matrix pencils plays an important role in many fields such as systems control and differential–algebraic equations. In this article, we compute a finite and infinite Jordan chain and also a singular chain of vectors corresponding to a full row rank matrix pencil using an extended algorithm, first introduced by Jones (1999, Ph.D. Thesis, Department of Mathematics, Loughborough University of Technology, Loughborough, UK). The proposed method exploits these vectors forming the chains corresponding to the finite and infinite eigenvalues and to the right minimal indices of the pencil. This leads to the computation of two transformation matrices for obtaining under strict equivalence the KCF of the pencil. An application to the study of homogeneous linear rectangular descriptor systems is considered and closed form solutions are obtained in terms of these two transformation …",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "On the reduction of a polynomial-matrix model of a linear multivariable system to generalised-state-space form",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8132931/",
            "Abstract": "The main purpose of this work is to review some old and new algorithms which reduce a general polynomial system matrix to an ‘equivalent’ system matrix in ‘generalized-statespace form’ in a matrix-transformation sense via the concept of full system equivalence.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:BqipwSGYUEgC",
            "Publisher": "OUP"
        },
        {
            "Title": "On the solution and impulsive behaviour of polynomial matrix descriptions of free linear multivariable systems",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=7941692490038142463&hl=en&oi=scholarr",
            "Abstract": "In this note we examine the solution and the impulsive behaviour of autonomous linear multivariable systems whose pseudo-state beta(t) obeys a linear matrix differential equation A(rho)beta(t) = 0 where A(rho) is a polynomial matrix in the differential operator rho:=d/dt. We thus generalize to the general polynomial matrix case some results obtained by Verghese and colleagues which regard the impulsive behaviour of the generalized state vector x(t) of input free generalized state space systems.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:sSrBHYA8nusC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "On a New Notion of Equivalence for Polynomial Matrices",
            "Publication year": 2002,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3142681",
            "Abstract": "The aim of this work is to develop a polynomial matrix transformation, which preserves both the finite and infinite elementary divisor structure and show its connection with other known transformations.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On a special case of the two-variable Newton interpolation polynomial",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6417866/",
            "Abstract": "The paper, proposes two new algorithms for the construction of a two-variable Newton-interpolation polynomial, for the special case where we have a rectangular basis with equidistant points. The complexity of the proposed algorithms is better than the ones given in [1] since it is based only on additions. One of the two algorithms is based on matrix multiplications and thus it is easily implemented in programming languages which supports such kind of operations.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the computation of the Drazin inverse of a polynomial matrix",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474667017389942",
            "Abstract": "In this paper we propose two new Leverrier-Faddeev algorithms for the computation of the Drazin inverse of a polynomial matrix. These algorithms represent extensions of the ones presented in (Grevile, 1973; Ji, 1994) and a continuation of the papers (Jones et. al., 1998) and (Karampetakis et.al., 2001).",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the computation of the minimal polynomial of a two-variable polynomial matrix",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1507837/",
            "Abstract": "The main contribution of this paper is to provide an algorithm for the computation of the minimal polynomial of a two variable polynomial matrix, based on the solution of linear matrix equations. The whole theory is implemented via an illustrative example.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Stabilization of Non-Square Strictly Proper Transfer Function Matrices",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9263800/",
            "Abstract": "This work focuses on the determination of stabilizing feedback controllers for non-square, strictly proper transfer function matrices with either full row or full column rank. This is done by considering a certain factorization of the transfer matrix leading to a non-singular, strictly proper matrix which contains the unstable poles. It is then proved that any stabilizing controller for the square matrix can used to produce a family of stabilizing controllers for the original matrix. Furthermore, the degree of stability for the closed loop system is studied.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the fundamental matrix of the inverse of a polynomial matrix and applications to ARMA representations",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0024379509003723",
            "Abstract": "The fundamental matrix of the inverse of a particular Toeplitz structured matrix pencil is used in order to provide an algorithm for the computation of the fundamental matrix of the inverse of a polynomial matrix. The dynamical interpretation of this pencil is explored and its fundamental matrix is used to provide closed formulas for the solutions of AutoRegressive Moving Average (ARMA) representations. Finally, using this pencil the notion of reachability for descriptor state space systems is extended to ARMA representations.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:3s1wT3WcHBgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "On a new notion of equivalence for polynomial matrices",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Nicholas-Karampetakis/publication/281291048_On_a_new_notion_of_equivalence_of_polynomial_matrices/links/55e03f0d08aecb1a7cc27ab1/On-a-new-notion-of-equivalence-of-polynomial-matrices.pdf",
            "Abstract": "The aim of this work is to present necessary conditions, in order two polynomial matrices possess the same finite and infinite elementary divisors.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Descriptor Systems Package for Mathematica",
            "Publication year": 2003,
            "Publication url": "http://eureka.teithe.gr/jspui/handle/123456789/10397",
            "Abstract": "Eureka! Institutional Repository: A Descriptor Systems Package for Mathematica Skip \nnavigation Home Browse Communities & Collections Browse Items by: Issue Date Author \nTitle Subject Item Type Advanced Search Useful Links Information Sign on to: My DSpace \nReceive email updates Edit Profile Saved Searches Favorites Eureka! Institutional \nRepository 1.Eureka! Institutional Repository 2.Σχολή Τεχνολογικών Εφαρμογών 3.Τμήμα \nΜηχανικών Πληροφορικής 4.Δημοσιεύσεις ΕΠ 5.Δημοσιεύσεις σε Περιοδικά Ελληνικά \nEnglish A Descriptor Systems Package for Mathematica Antoniou, Efstathios/ Tzekis, P./ \nVologiannidis, Stavros/ Vardulakis, Antonis/ Karampetakis, Nikolas/ Καραμπετάκης, \nΝικόλαος/ Αντωνίου, Ευστάθιος/ Τζέκης, Π./ Βολογιαννίδης, Σταύρος/ Βαρδουλάκης, \nΑντώνης Institution and School/Department of submitter: ΤΕΙ Θεσσαλονίκης Issue Date: \n2003 Citation: Conference on Control and Automation, , AI, …",
            "Abstract entirety": 0,
            "Author pub id": "TkKJCukAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "DIFFERENCE AND ALGEBRAIC EQUATIONS",
            "Publication year": 2016,
            "Publication url": "http://kalipso.math.uoi.gr/tech_reports/22%20Technical%20Report/Technical%20Report%20PROC_50YEARS.pdf#page=33",
            "Abstract": "Systems of linear difference and algebraic equations A (σ) β (k)= 0, where σ denotes the shift forward operator and A (σ) a regular polynomial matrix, give rise to both forward and backward propagating solutions. In the present work the problem of constructing such a system is studied. That is, given a set of discrete time forward and backward propagating functions β (k), a method for constructing a family of matrices A (σ) is proposed, such that the system A (σ) β (k)= 0 has the exact prescribed solutions.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the determination of the dimension of the solution space of discrete time AR-representations",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474667015386092",
            "Abstract": "The main purpose of this work is to determine the dimension of the solution space of a nonregular discrete time AR-representation i.e. A(σ)ξ(κ) = 0, in a closed interval [0, N] where A(σ) is a nonregular polynomial matrix and σ is the forward shift operator. It is shown that the dimension of the solution space of such a system is strongly related to the structural invariants of the polynomial matrix A(σ) which describes the system i.e. finite and infinite elementary divisors and right minimal indices.",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the computation of the Drazin inverse of a polynomial matrix",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=12853023790098509590&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:isC4tDSrTZIC",
            "Publisher": "PUSHPA"
        },
        {
            "Title": "TRANSFORMATIONS BETWEEN TWO-VARIABLE POLYNOMIAL BASES WITH APPLICATIONS",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=17224799807921295237&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TkKJCukAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        }
    ]
}]