[{
    "name": "Νικόλαος Γραμμαλίδης",
    "romanize name": "Nikolaos Grammalidis",
    "School-Department": "Ινστιτούτο Τεχνολογιών Πληροφορικής και Επικοινωνιών",
    "University": "certh",
    "Rank": "Κύριος Ερευνητής",
    "Apella_id": 19358,
    "Scholar name": "Nikos Grammalidis",
    "Scholar id": "PIKpPjoAAAAJ",
    "Affiliation": "CERTH",
    "Citedby": 2940,
    "Interests": [
        "Computer Vision",
        "Intelligent Transportation Systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=PIKpPjoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Early fire detection based on aerial 360-degree sensors, deep convolution neural networks and exploitation of fire dynamic textures",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/841746",
            "Abstract": "The environmental challenges the world faces have never been greater or more complex. Global areas that are covered by forests and urban woodlands are threatened by large-scale forest fires that have increased dramatically during the last decades in Europe and worldwide, in terms of both frequency and magnitude. To this end, rapid advances in remote sensing systems including ground-based, unmanned aerial vehicle-based and satellite-based systems have been adopted for effective forest fire surveillance. In this paper, the recently introduced 360-degree sensor cameras are proposed for early fire detection, making it possible to obtain unlimited field of view captures which reduce the number of required sensors and the computational cost and make the systems more efficient. More specifically, once optical 360-degree raw data are obtained using an RGB 360-degree camera mounted on an unmanned aerial vehicle, we convert the equirectangular projection format images to stereographic images. Then, two DeepLab V3+ networks are applied to perform flame and smoke segmentation, respectively. Subsequently, a novel post-validation adaptive method is proposed exploiting the environmental appearance of each test image and reducing the false-positive rates. For evaluating the performance of the proposed system, a dataset, namely the “Fire detection 360-degree dataset”, consisting of 150 unlimited field of view images that contain both synthetic and real fire, was created. Experimental results demonstrate the great potential of the proposed system, which has achieved an F-score fire detection rate equal to 94.6%, hence reducing …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:lL5f5cZgq8MC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "An integrated decision support system using satellite and in-situ data for coastal area hazard mitigation and resilience to natural disasters",
            "Publication year": 2021,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2021EGUGA..2314674K/abstract",
            "Abstract": "Nowadays, the importance of coastal areas is greater than ever, with approximately 10% of the global population living in these areas. These zones are an intermediate space between sea and land and are exposed to a variety of natural (eg ground deformation, coastal erosion, flooding, tornados, sea level rise, etc.) and anthropogenic (eg excessive urbanisation) hazards. Therefore, their conservation and proper sustainable management is deemed crucial both for economic and environmental purposes. The main goal of the Greece-China bilateral research project\" EPIPELAGIC: ExPert Integrated suPport systEm for coastaL mixed urbAn-industrial-critical infrastructure monitorinG usIng Combined technologies\" is the design and deployment of an integrated Decision Support System (DSS) for hazard mitigation and resilience. The system exploits near-real time data from both satellite and in-situ sources to efficiently …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:x8G803Bi31IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality of life support system for people with intellectual disability",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3389189.3397971",
            "Abstract": "People with intellectual disabilities (ID) encounter several problems regarding the interaction with their environment in terms of their daily needs, activities and communication. On this concept, an interactive support system with multiple functionalities is proposed, aiming at optimizing the opportunities provided to people with ID in order to cope with particular everyday issues. Specifically, it will provide information as well as entertainment, including creative and educational activities, through specialized learning programs. Additionally, it will automatically recognize health emergency situations, provide appropriate notifications, feature an emergency call button to contact the responsible caregivers, and support interaction using a specialized voice menu of instructions. The final system will be developed within a Greek research project and a pilot implementation will be evaluated by a Greek association of people with …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:3wLP7v6BnpwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Serious games as a means for holistically supporting Parkinson's Disease patients: The i-PROGNOSIS personalized game suite framework",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8056607/",
            "Abstract": "Parkinson's Disease (PD) is a well-known progressive and neurodegenerative disorder, resulting in motor and non-motor symptoms that significantly reduce the quality of life. Motivated by the increased adoption of serious games in health care interventions sector in the last years, an unobtrusive approach is explored here, realised via the i-PROGNOSIS interventions platform (www.i-prognosis.eu), consisting of a game-based suite. In this way, targeting intelligent early detection and intervention in PD area, the Personalised Game Suite (PGS) design approach is presented, integrating different serious games in a unified platform. Overall, this comprehensive review gives an overview of studies examining motor and non-motor symptoms for PD along with the PGS design approach, in order to inform researchers and game designers for its consideration in the self-management of PD.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:_u2aKJ9e-CoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Motion analysis of Parkinson diseased patients using a video game approach",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3316782.3322757",
            "Abstract": "Parkinson's disease (PD) is a progressive neurological disorder and the second most common age-related neurodegenerative disease after Alzheimer's disease. The primary symptoms of the disease are associated with the loss of motor skills affecting patients' movement and coordination and disrupting their daily life. Unfortunately, such motor symptoms cannot be fully relieved by therapeutic options. On the other hand, studies have shown that regular training and exercising can prove neuroprotective in PD patients helping them maintain independent longer.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:yeKNu01O_4gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Video based flame detection",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/papers/2012/38581/38581.pdf",
            "Abstract": "Video-based surveillance systems can be used for early fire detection and localization in order to minimize the damage and casualties caused by wildfires. However, reliability of these systems is an important issue and therefore early detection versus false alarm rate has to be considered. In this paper, we present a new algorithm for video based flame detection, which identifies spatio-temporal features of fire such as colour probability, contour irregularity, spatial energy, flickering and spatio-temporal energy. For each candidate region of an image a feature vector is generated and used as input to an SVM classifier, which discriminates between fire and fire-coloured regions. Experimental results show that the proposed methodology provides high fire detection rates with a reasonable false alarm ratio.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using intelligent digital cameras to monitor aerodrome surface traffic",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1439483/",
            "Abstract": "An aircraft is most at risk for an accident when it's still on the ground - when taxiing before takeoff or after landing. This is because traffic throughput on the ground is limited by inadequate airport infrastructures and is often incapacitated during conditions of poor visibility. The INTERVUSE project, funded by the European Commission, aims to address these problems by developing a cost-effective artificial intelligence system based on a network of intelligent digital cameras. The system uses image-processing techniques to detect traffic and correlates and fuses data to generate a synthetic ground-situation display.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using adaptive neuro-fuzzy inference systems for the detection of centroblasts in microscopic images of follicular lymphoma",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11760-014-0688-6.pdf",
            "Abstract": "In this paper, a complete methodology for automatic detection of centroblasts (CBs) in microscopic images acquired from tissue biopsies of follicular lymphoma is presented. In the proposed method, tissue sections are sliced at a low thickness level, around 1–1.5 m, which provides a more detailed depiction of the nuclei and other textural information. Initially, images are segmented into their basic cytological components, i.e., blood cells, nuclei and extra-cellular material, and then a novel touching-cell splitting algorithm is applied using a Gaussian mixture model and expectation–maximization algorithm. Additionally, a morphological and textural analysis of CBs is applied in order to extract various features related to their nuclei, nucleoli and cytoplasm. In the final step, a novel classification scheme is proposed based on adaptive neuro-fuzzy inference systems to classify the candidate cells. The …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:SP6oXDckpogC",
            "Publisher": "Springer London"
        },
        {
            "Title": "3D scene reconstruction based on robust camera motion estimation and space sweeping for a cultural heritage virtual tour system",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4547806/",
            "Abstract": "An efficient 3D reconstruction technique based on robust camera motion estimation and an improved version of the space-sweeping stereo reconstruction approach is presented. The proposed approach is focused on generation of usable and fully automatic reconstruction of wide-area scenes with the computational resources of a conventional PC. The aim is to use this technique to capture such scenes in 3D utilizing off-the-shelf equipment. Color information is finally added to the derived 3D model of the scene and the result can be converted to common 3D scene modeling formats. The 3D models are integrated with GIS technologies within a web-based virtual tour system.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advances in 3DTV: Theory and Practice",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/42499820/579514-1.pdf",
            "Abstract": "Being a goal over decades, the extension of television, and visual communications in general, to the third dimension (3DTV) has been almost reached. Currently, 3D motion pictures are shown in theatres and the first 3D broadcasts are being planned to initiate in the next few years. Albeit the progress, state of the art has not yet reached the goal of acquiring a three-dimensional scene in full detail and creating a precise optical duplicate at remote site in real-time. Limitations in reconstruction accuracy and visual quality as well as user acceptance of pertinent technologies have, to date, prevented the creation of infrastructures for the delivery of 3D content to mass markets. Thereby, relevant scientific research is at the center of interest regarding the improvement of current 3DTV technologies. The goal of 3DTV involves the collaboration of researchers in multiple scientific disciplines as well as the integration of pertinent results, in order to provide end-users with a fully functional system. The tasks of “capture and representation of 3D scene information,”“representation of the digital 3DTV signal,”“storage and transmission of the digital 3DTV signal,” as well as “display of the reproduced 3D scene” constitute a chain of operations that are essential for reaching this goal. In this context, this special issue presents contributions along the whole chain of computational tasks that are required to implement 3DTV. In addition, the last two papers provide with contributions that go beyond the simple presentation of 3D visual data and propose ways of interacting with them.The paper “Multi-view shooting geometry for multiscopic rendering with controlled distortion …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:M7C5BM2v8n8C",
            "Publisher": "Hindawi Publishing Corporation"
        },
        {
            "Title": "Designing Serious Games for ICH Education",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7419581/",
            "Abstract": "The paper presents the experience matured in the i-Treasures project, in which 3D game-like applications were designed and developed with the aim of providing innovative tools for Intangible Cultural Heritage (ICH) education. The decision to develop Serious Games grounded on the specific learning needs linked to the nature of the ICH considered (dances, craftsmanship, singing expressions, etc.) and to the benefits that the research in Games Based Learning has pointed out regarding the use of games with educational purposes. In the paper, the i-Treasures game-like applications are described, with particular attention to the design and developmental process that was carried out with the involvement of a multidisciplinary team. In the game development, a huge effort was put into making the most of the benefits of games; these aspects will be discussed and highlighted. The difficulties met will be discussed as …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:6ScxedgR18sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dance analysis using multiple kinect sensors",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7295020/",
            "Abstract": "In this paper we present a method for body motion analysis in dance using multiple Kinect sensors. The proposed method applies fusion to combine the skeletal tracking data of multiple sensors in order to solve occlusion and self-occlusion tracking problems and increase the robustness of skeletal tracking. The fused skeletal data is split into five different body parts (torso, left hand, right hand, left leg and right leg), which are then transformed to allow view invariant posture recognition. For each part, a posture vocabulary is generated by performing k-means clustering on a large set of unlabeled postures. Finally, body part postures are combined into body posture sequences and Hidden Conditional Random Fields (HCRF) classifier is used to recognize motion patterns (e.g. dance figures). For the evaluation of the proposed method, Tsamiko dancers are captured using multiple Kinect sensors and experimental …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:CmbFvBriOyMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Detection of Faces and Facial Features in Images using a Novel Neural Network Technique",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.331.6298&rep=rep1&type=pdf",
            "Abstract": "This paper presents a user interactive system that manages, with minimum user interaction, to locate a set of characteristic feature points in the frontal view of a person’s face. The proposed method is user adaptive and is implemented as a combination of a classification-based facial region extraction technique with a transition based facial feature extraction method. Thus, a feed-forward neural network is first trained to recognize image blocks belonging to the facial area. Then, the feature detection algorithm is initialized with a blink of the user’s eyes, which localizes the exact contours of the eyes. Finally, we locate the remaining facial features (face contour, eyebrows, mouth and nose) by adaptively thresholding the facial area and utilizing apriori knowledge about the geometrical structure of the face.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A game-like application for dance learning using a natural human computer interface",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-20684-4_46",
            "Abstract": "Game-based learning and gamification techniques are recently becoming a popular trend in the field of Technology Enhanced Learning. In this paper, we mainly focus on the use of game design elements for the transmission of Intangible Cultural Heritage (ICH) knowledge and, especially, for the learning of traditional dances. More specifically, we present a 3D game environment that employs an enjoyable natural human computer interface, which is based on the fusion of multiple depth sensors data in order to capture the body movements of the user/learner. In addition, the system automatically assesses the learner’s performance by utilizing a combination of Dynamic Time Warping (DTW) with Fuzzy Inference System (FIS) approach and provides feedback in a form of a score as well as instructions from a virtual tutor in order to promote self-learning. As a pilot use case, a Greek traditional dance, namely …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:dj1AAMDQi3QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Implementation of Additional Seismological Software for the Determination of Earthquake",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Pantelis-Soupios/publication/273263011_Implementation_of_Additional_Seismological_Software_for_the_Determination_of_Earthquake_Parameters_Based_on_MatSeis_and_an_Automatic_Phase-detector_Algorithm/links/576d976d08ae842225a409ac/Implementation-of-Additional-Seismological-Software-for-the-Determination-of-Earthquake-Parameters-Based-on-MatSeis-and-an-Automatic-Phase-detector-Algorithm.pdf",
            "Abstract": "Various approaches have been presented during the last few years regarding public-domain seismological software for routine or advanced analysis of earthquake data. The necessity of such software approaches is continuously increasing as the amount of data of permanent and portable seismological networks stored in computer systems is increasing due to the augmentation of networks that use full digital systems with high sampling rates. There is also the additional need for software for the rapid determination of earthquake parameters for high-seismicity areas.Several software packages have been presented to address these problems, such as Xpitsa (Scherbaum and Johnson, 1992), Mat Seis (Young et al., 1996), Giant (Rietbrock and Scherbaum, 1998), SeisAn (Havskov and Ottemöller, 1999), and Earthworm (EWAB, 2000). All these software packages have an obvious need for relational database …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:Cy13deThEpcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Innovative Parkinson's Disease Patients' Motor Skills Assessment: The i-PROGNOSIS Paradigm",
            "Publication year": 2020,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fcomp.2020.00020/full",
            "Abstract": "Being the second most common neurodegenerative disease, Parkinson’s Disease (PD) can be symptomatically treated; though, unfortunately, it cannot be cured yet. Moreover, diagnosing and assessing PD patients is a complex process, requiring continuous monitoring. In this vein, the design, development and validation of innovative Assessment Tools may be helpful in the management of patients with PD, in particular. Based on intelligent ICT interventions, the i-PROGNOSIS project intends to mitigate PD’s specific symptoms, such as, neurological movement disorders of gait, balance, coordination and posture, already characterized in the early phase of the disease. From this perspective, an innovative iPrognosis motor Assessment Tool is presented here, taking into consideration the Unified Parkinson Disease Rating Scale (UPDRS) Part III motor skills testing items, for evaluating the motor skills status. The efficiency of the proposed Assessment Tests to reflect the motor skills status, similarly to the UPDRS Part III items, was validated via 27 participants (18 males; mean age = 62 yrs, SD=10.36 yrs, range 43–79 yrs) with early (n=10) and moderate (n=17) PD, that performed the Assessment Tests. Features from the latter were then correlated with the corresponding clinically assessed UPDRS Part III items and statistically significant negative correlations (range: -0.364:-0.802) were identified between the median values of the Assessment Tests and the UPDRS Part III items. In this vein, the iPrognosis Assessment Tests were integrated within the personalized interventions of i-PRGNOSIS project, providing alternative means of assessing their …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:9fRKRCJz75UC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Real time video fire detection using spatio-temporal consistency energy",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6636667/",
            "Abstract": "In this paper a new algorithm is proposed for detecting fire from video data in real time based on a combination of features, including a new spatio-temporal consistency feature. A significant challenge in flame detection systems is to discriminate between actual fire and false alarms caused by fire colored objects. Towards this aim, we propose an algorithm that has significant advantages: a) it is fast since rectangular non-overlapping blocks are used as basic elements (instead of arbitrary-shaped regions) b) a spatio-temporal consistency feature is used in addition to color probability, spatial energy, flickering and spatio-temporal energy features and c) an improved rule-based classification approach is proposed, after evaluating seven different classification approaches. Experimental results are presented that confirm the efficiency of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Coding of Stereoscopic and Three Dimensional Images and Video.",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=2002063494807700574&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Classification of multidimensional time-evolving data using histograms of grassmannian points",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7752809/",
            "Abstract": "In this paper, we address the problem of classifying multidimensional time-evolving data in dynamic scenes. To take advantage of the correlation between the different channels of data, we introduce a generalized form of a stabilized higher order linear dynamical system (sh-LDS) and we represent the multidimensional signal as a third-order tensor. In addition, we show that the parameters of the proposed model lie on a Grassmann manifold and we attempt to address the classification problem through study of the geometric properties of the sh-LDS's space. Moreover, to tackle the problem of nonlinearity of the observation data, we represent each multidimensional signal as a cloud of points on the Grassmann manifold and we create a codebook by identifying the most representative points. Finally, each multidimensional signal is classified by applying a bag-of-systems approach having first modeled the variation of …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:PuYkdpj8xa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "FAP extraction using three-dimensional motion estimation",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1058216/",
            "Abstract": "An integral part of the MPEG-4 standard is the definition of face animation parameters (FAPs). This paper presents a method for the determination of FAPs by using three dimensional (3-D) rigid and nonrigid motion of human facial features found from two-dimensional (2-D) image sequences. The proposed method assumes that a 3-D model has been fitted to the first frame of the sequence, tracks the motion of characteristic facial features, calculates the 3-D rigid and nonrigid motion of facial features, and through this, estimates the FAPs as defined by the MPEG-4 coding standard. The 2-D tracking process is based on a novel enhanced version of the algorithm proposed by Kanade, Lucas, and Tomasi (1994, 1991). The nonrigid motion estimation is achieved using the same tracking mechanism guided by the facial motion model implied by the MPEG-4 FAPs.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Information and Communication Technologies and Intangible Cultural Heritage education: opportunities and challenges",
            "Publication year": 2018,
            "Publication url": "https://www.learntechlib.org/p/195254/",
            "Abstract": "The safeguarding of the Intangible Cultural Heritage (ICH) has acquired a growing relevance in the last decades and in particular after the promulgation of the “Convention for the Safeguarding of the Intangible Cultural Heritage”(UNESCO, 2003). The convention itself highlights the importance of education to this scope and, for this reason, some projects have been proposed at national and international level. Nevertheless, ICH education remains a scarcely explored topic and poses several challenges, due to the intrinsic characteristics of the cultural expressions and the traditional transmission methods. Considering these challenges, we developed our research question related to which technologies and methods could be effectively adopted in the field of Cultural Heritage, to open up new opportunities for teaching and learning. In this paper, we discuss both the main challenges to be faced in the specific field and …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:wTekDMGr9GkC",
            "Publisher": "Edizioni Menabò-Menabò srl"
        },
        {
            "Title": "Video system for surface movement surveillance at airports",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15472450701653424",
            "Abstract": "The Advanced Surface Movement Guidance and Control Systems (A-SMGCS) are intelligent transportation systems that provide routing, guidance, surveillance, and control to aircraft and vehicles in order to keep up the airport capacity under all local weather conditions, while maintaining the required level of safety; however, reflections, multipath, and shadows due to buildings, equipment, and other reflecting objects on the airport surface make it difficult, if not sometimes impossible, for existing A-SMGCS to reliably cover the whole aerodrome. In these cases another sensor must step in to fill those gaps. Digital video cameras not only can solve these kinds of problems filling blind spots in the existing A-SMGCS, but also provide a cost effective solution. This article presents an innovative system for airport surface movement control based on intelligent video cameras.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:-f6ydRqryjwC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "VSigns–a virtual sign synthesis web tool",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.99.6118&rep=rep1&type=pdf",
            "Abstract": "This paper presents a new Web tool for converting text to Sign Language notation and corresponding VRML animation sequences for H-anim compliant avatars. The tool can be used both as a sign language dictionary as well as a text to sign language translator. It is based on a Sign Language dictionary written in the well-known Sign-Writing system. More specifically, the entries of the dictionary are in SWML (SignWriting Markup Language), an XML-based format, which has recently been developed for the storage, indexing and processing of SignWriting notation. For sign synthesis, each sign box (basic sign) is first converted to a sequence of Body Animation Parameters (BAPs) of the MPEG-4 standard corresponding to the represented gesture. These sequences, which can also be coded and/or reproduced by MPEG-4 BAP players, are then used to animate H-anim compliant VRML avatars, reproducing the exact gestures represented in sign language notation. Envisaged applications include the development of signing avatars for interactive information systems (Web, E-mail, info–kiosks) and TV newscasts for persons with hearing disabilities.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ISMAEL-Intelligent surveillance and management for airfield applications based on low cost magnetic field detectors",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Kosmas-Dimitropoulos/publication/311065646_ISMAEL_-_Intelligent_Surveillance_and_Management_for_Airfield_Applications_Based_on_Low_Cost_Magnetic_Field_Detectors/links/583d3e8008aeb3987e30ee35/ISMAEL-Intelligent-Surveillance-and-Management-for-Airfield-Applications-Based-on-Low-Cost-Magnetic-Field-Detectors.pdf",
            "Abstract": "Against the background of aggravated capacity constraints at airports due to increasing air traffic, airports are in need of innovative systems enabling Air Traffic Controllers to precisely determine the position of vehicles moving on the surface, even under reduced visibility conditions. While this demand is addressed by the development and introduction of Advanced Surface Movement Guidance and Control Systems (A-SMGCS), technologies currently applied to A-SMGCS feature some weak points regarding coverage, robustness interference and climate conditions. The EC-funded research project ISMAEL targets these weak points by developing an innovative detection solution based on magnetic sensing technology. Thus, ISMAEL will represent a valuable and costefficient complementary contribution to existing and planned A-SMGCS at small and large airports. During the past project stage, magnetic detector prototypes have been designed and tested. Initial field tests on a taxiway have proven that the sensors can be used to detect aircraft on ground within a range of several meters. In the next stage detectors will be integrated with the sensor data fusion (SDF) server, which initially processes the data from detectors to extract target plots and then based on Kalman filtering provides target tracks. Further demonstration activities based on both detector and SDF development are planned this year.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:WTSGYGHz1bkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual Community Practice Toolkits Using 3D Imaging Technologies",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/virtual-community-practice-toolkits-using/30820",
            "Abstract": "Extending visual communications to the third dimension (3D) has been a dream over decades. The ultimate goal of the viewing experience is to create the illusion of a real environment in its absence. However limitations of visual quality and user acceptance prevented the development of relevant mass markets so far. Recent achievements in research and development triggered an increasing interest in 3D visual technologies. From technological point of view, this includes improvements over the whole 3D technology chain, including image acquisition, 3D representation, compression, transmission, signal processing, interactive rendering and 3D display. In the center of all these different areas, the visualization of 3D information stands as the major aspiration to be satisfied, since 3D enriches the interaction experience. This enhanced user experience that 3D imaging offers compared to 2D, is the main reason …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:a0OBvERweLwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Wood species recognition through multidimensional texture analysis",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168169917300959",
            "Abstract": "Wood recognition is a crucial task for wood sciences and industries, since it leads to the identification of the anatomical features and physical properties of wood. Traditionally, the recognition process relies almost exclusively on human experts, who are based on various characteristics of wood, such as color, structure and texture. However, there are numerous types of wood species in the nature that are difficult to be identified even by experienced scientists. Towards this end, in this paper we propose a novel approach for automated wood species recognition through multidimensional texture analysis. By taking advantage of the fact that static wood images contain periodic spatially-evolving characteristics, we introduce a new spatial descriptor considering each wood image as a collection of multidimensional signals. More specifically, the proposed methodology enables the representation of wood images as …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:2mikiJ1VBVsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Analysis of Human Motion based on AI technologies: Applications for safeguarding folk dance performances",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=-8fVDwAAQBAJ&oi=fnd&pg=PA321&dq=info:7nuCGCeICOYJ:scholar.google.com&ots=fQRbjZUyHz&sig=hNZ80FqQQNRZZpiCyqnq0o3GXSo",
            "Abstract": "Analysis of human motion is an important research area in computer vision with numerous applications. Recent projects, such as EU i-Treasures and TERPSICHORE projects conduct research in this field to improve the capture, analysis and presentation of Intangible Cultural Heritage (ICH) using ICT-based approaches. The final goal is to document these forms of intangible heritage and to capture the associated knowledge in order to safeguard and transmit this information to the next generations. In addition, these approaches can give rise to new services for research, education and cultural tourism. They can also be used by creative industries (eg companies performing film, video, TV or VR applications production), as well as by local communities, creating new local development opportunities by promoting local heritage. This paper first reviews some very recent state of the art approaches based on deep learning which can achieve impressive results in recovering human motion (2D or 3D) and structure (skeleton with joints or realistic 3D model of the human body). Based on such approaches, we then propose a dance analysis approach, currently under development in TERPSICHORE project. Preliminary results are presented and, finally, some conclusions are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:6LV2YwJzdtgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Covid-19 Pandemic’s Influence on Popular/Folk Culture and Tourism in Greece: Shaping the Future and Beyond",
            "Publication year": 2021,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=G3QeEAAAQBAJ&oi=fnd&pg=PA120&dq=info:p3aZ_UqdTV0J:scholar.google.com&ots=pIT4V7IGIB&sig=FYsFMk0imhe4VGL-KHQp9HNPq_Q",
            "Abstract": "How much has the life of the people of post-covid culture changed? What social impact does this have, as it directly affects regions, which are also tourist destinations? Can anyone party in an online tavern? What is Ikaria or Nisyros without their folk festivals that gather a huge number of people every year? The same holds for every tourist destination, because, in essence, the gathering of locals and those associated with the area is what gives an identity to each place. Can we transfer such living environments in the digital world? What are the pros and cons? Pop/folk culture constitutes an important part of Intangible Cultural Heritage and is an important factor for social cohesion, tourism, and economic development. Festive practices and traditions entertain, act as a tourist attraction and reflect important information about the cultural, societal and historical background of local regions and communities. In our times, this important ICH genre is endangered by many different factors, including economic crisis, globalization, immigration, urbanization, etc., and thus needs to be protected. Recently, inline with UNESCO’s efforts for safeguarding and transmission of ICH [1], EU projects such as i-Treasures [2], Terpsichore [3] and WhoLoDancE [4] tried to exploit modern ICT technologies to digitize, analyse, visualize and re-use Intangible Cultural Heritage (ICH), including musical and dance performances. Pandemics, like the recent Covid-19 pandemic in March 2020, pose an additional unexpected threat that has seen to have dramatic consequences to the work, income and life of music and dance performers. In particular, this impact is even stronger for …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:m44aUaJR3ikC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Improved depth field estimation for autostereoscopic 3D-TV based on graph-cuts",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1809777.1809827",
            "Abstract": "Three-dimensional TV is now closer than ever to become a reality for consumers providing a complete life-like image experience. Recent advances in autostereoscopic displays have resulted in improved 3D viewing experience, wider viewing angles, no need for special glasses and support for multiple viewers. However, due to their content formatting requirements (2D+ depth), liveaction content is much more difficult to create. In this paper a new content generation approach for autostereoscopic 3DTV is proposed, by integrating a state-of-the-art MRF-based depth estimation method with additional pre-and post-processing steps, such as rectification, colour segmentation as well as decomposition of the scene in foreground and background depth maps. Experimental results with different stereo sequences show the great potential of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Morphological and textural analysis of centroblasts in low-thickness sliced tissue biopsies of follicular lymphoma",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6944346/",
            "Abstract": "This paper presents a new method for discriminating centroblast (CB) from non-centroblast cells in microscopic images acquired from tissue biopsies of follicular lymphoma. In the proposed method tissue sections are sliced at a low thickness level, around 1-1.5um, which provides a more detailed depiction of the nuclei and other textural information of cells usually not distinguishable in thicker specimens, such as 4-5um, that have been used in the past by other researchers. To identify CBs, a morphological and textural analysis is applied in order to extract various features related to their nuclei, nucleoli and cytoplasm. The generated feature vector is then used as input in a two-class SVM classifier with ε-Support Vector Regression and radial basis kernel function. Experimental results with an annotated dataset consisting of 300 images of centroblasts and non-centroblasts, derived from high-power field images of …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Probabilistic Feature Fusion for Building Detection in Satellite Images.",
            "Publication year": 2015,
            "Publication url": "https://www.scitepress.org/papers/2015/52605/52605.pdf",
            "Abstract": "Building segmentation from 2D images can be a very challenging task due to the variety of objects that appear in an urban environment. Many algorithms that attempt to automatically extract buildings from satellite images face serious problems and limitations. In this paper, we address some of these problems by applying a novel approach that is based on the fusion of Histogram of Oriented Gradients (HOG), Normalized Difference Vegetation Index (NDVI) and Features from Accelerated Segment Test (FAST) features. We will demonstrate that by taking advantage of the multi-spectral nature of a satellite image and by employing a probabilistic fusion of the aforementioned features, we manage to create a novel methodology that increases the performance of a building detector compared to other state-of-the-art methods.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:FtNbRaqWXr4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Medical evaluation as gold standard to control iprognosis application derived data for early parkinson’s disease detection",
            "Publication year": 2019,
            "Publication url": "http://www.i-prognosis.eu/wp-content/uploads/2019/11/Poster_iPrognosis_MDS-Nice-2019_FINAL.pdf",
            "Abstract": "BackgroundThe research leading to these results has received funding from the European Unions Horizon 2020 research and innovation programme under grant agreement number 690494–i-PROGNOSIS: Intelligent Parkinson early detection guiding novel supportive interventions.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:nnITTVbzT6kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Video-based flame detection for the protection of Cultural Heritage",
            "Publication year": 2013,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1260/2047-4970.2.1.23",
            "Abstract": "The majority of cultural heritage and archaeological sites, especially in the Mediterranean region, are covered with vegetation, which increases the risk of fires. These fires may also break out and spread towards nearby forests and other wooded land, or conversely start in nearby forests and spread to archaeological sites. Beyond taking precautionary measures to avoid a forest fire, early warning and immediate response to a fire breakout are the only ways to avoid great losses and environmental and cultural heritage damages. The use of terrestrial systems, typically based on video cameras, is currently the most promising solution for advanced automatic wildfire surveillance and monitoring due to its low cost and short response time. Early and accurate detection and localization of flame is an essential requirement of these systems, however, it remains a challenging issue due to the fact that many natural objects …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:rO6llkc54NcC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "A face and gesture recognition system based on an active stereo sensor",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958283/",
            "Abstract": "The paper presents several novel 3D image analysis algorithms, applied towards the segmentation and modeling of faces and hands. These are subsequently used to build a face-based authentication system and a system for human-computer interaction based on static and dynamic gestures. The system relies on an active stereo sensor that uses a structured light approach to obtain 3D information. In this paper we demonstrate how the use of 3D information may significantly improve the efficiency of traditional face and gesture recognition techniques that use 2D images only.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mixed reality gamified presence and storytelling for virtual museums",
            "Publication year": 2018,
            "Publication url": "http://ikee.lib.auth.gr/record/307147",
            "Abstract": "Mixed reality as display technology, gamification as motivational element, and storytelling as interaction metaphor while maintaining the feeling of presence are identified as key elements for defining the next generation of virtual museums.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:wE8AsS3ykUMC",
            "Publisher": "Springer"
        },
        {
            "Title": "An efficient and memory-conserving implementation of multi-view stereo for wide-area reconstruction",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/42805851/paper183.pdf",
            "Abstract": "This paper deals with the automatic stereo reconstruction of wide-area scenes. Its particular goal is a computationally efficient method that can be performed on a personal computer, despite the large amount of data involved in the reconstruction of wide-area scenes. Robustness is considered in terms of the accuracy of the final reconstruction, as well as, in the context of simplifying the image acquisition process for the end-user.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On supporting Parkinson's disease patients: the i-PROGNOSIS personalized game suite design approach",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8104249/",
            "Abstract": "The use of serious games in health care interventions sector has grown rapidly in the last years, however, there is still a gap in the understanding on how these types of interventions are used for the management of the Parkinson Disease (PD), in particular. Targeting intelligent early detection and intervention in PD area, the Personalized Game Suite (PGS) design process approach is presented as part of the H2020 i-PROGNOSIS project that introduces the integration of different serious games in a unified platform (i.e., ExerGames, DietaryGames, EmoGames, and Handwriting/Voice Games). From the methodological point of view, to facilitate the visualization of 14 game-scenarios, the system interface and the PD contexts, the storyboarding technique was adopted here. Overall, the realization of the PGS sets the basis for establishing a holistic framework that could aim at improving motor and non-motor symptoms …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:n8FNryW2AHIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D reconstruction for a cultural heritage virtual tour system. The International Archives of the Photogrammetry",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=9430640793933093501&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:4pF9x-cDGsoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimental study of skeleton tracking abilities from microsoft kinect non-frontal views",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7169367/",
            "Abstract": "Human body motion tracking is important for a large variety of applications e.g., entertainment, human computer interaction, creative industry etc. Marker-based motion capture systems offer accurate motion tracking, however, they cannot be widely used due to their high cost and operational complexity. To this end, emerging depth sensing technologies, such as Microsoft Kinect, can be employed in many cases as an alternative low cost marker-less solution. Such sensors are mainly used to track the frontal view of the user, since it provides high tracking quality. To assess the potential tracking abilities of Kinect nonfrontal views, we compare the tracking results from four views (front, left side, right side, rear) with those from an off-the-self optical motion capture system. The experimental results show that the skeleton tracking accuracy of the rear view is close to the accuracy of the frontal view, although Kinect sensor …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:UEFpDhwOD2kC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capturing the intangible an introduction to the i-Treasures project",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7295018/",
            "Abstract": "Cultural expression is not limited to architecture, monuments or collections of artifacts. It also includes fragile intangible live expressions, which involve knowledge and skills such as music, dance, singing, theatre, human skills and craftsmanship. These manifestations of human intelligence and creativeness constitute our Intangible Cultural Heritage (ICH), a basic factor of local cultural identity and a guaranty for sustainable development. In this paper, we briefly introduce the i-Treasures research project, which aims at developing an open and extendable platform to provide access to ICH resources, enable knowledge exchange and contribute to the transmission of rare know-how. The project goes beyond digitization of cultural content; it creates new knowledge that has never been analysed or studied before through novel methodologies for the analysis and modelling of ICH based on multisensory technology. High …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:pe4chHNxNLUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sign synthesis from SignWriting notation using MPEG-4 standard, H-Anim and inverse kinematics techniques",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/51538758/Sign_synthesis_from_SignWriting_notation20170128-4366-1mt2yz4.pdf",
            "Abstract": "A novel approach is presented for generating VRML animation sequences from Sign Language notation, based on MPEG-4 Face and Body Animation. Sign Language notation, in the well-known SignWriting system, is provided as input and initially converted to SWML (SignWriting Markup Language), an XML-based format that has recently been developed for the storage, indexing, and processing of SignWriting notation. Each basic sign, namely signbox, is then converted to a corresponding sequence of Body Animation Parameters (BAPs) of the MPEG-4 standard. Inverse Kinematics are also employed for synthesizing complex animation sequences (eg contacts). In addition, if a sign contains facial expressions, then these are converted to a sequence of MPEG-4 Facial Animation Parameters (FAPs), while exact synchronization between facial and body movements is achieved. These sequences, which can also be coded and/or reproduced by MPEG-4 BAP and FAP players, are then used to animate H-anim compliant VRML avatars, reproducing the exact gestures represented in the sign language notation. Envisaged applications include interactive information systems for the persons with hearing disabilities (Web, E-mail, info–kiosks), and automatic translation of written texts to sign language (eg for TV newscasts).",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visualization of Folk-Dances in Virtual Reality Environments",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-36126-6_7",
            "Abstract": "Cultural tourism helps with the preservation or revival of culture and traditions. It includes many different attractions including performing arts and festivals. Since folk dances are part of cultural heritage and their preservation has major importance, this paper presents applications for visualization and learning of folk dances. Based on different interactive motion capture technologies, new approaches for observing, analyzing and learning dances, and movements in general, have been created. A popular approach for learning purposes is to record a professional dancer using motion capture technologies and then visualize the dance. Users are supposed to watch and imitate the teacher’s performances. In this paper, a similar approach is proposed, where users can choose the dance they want to watch through an interactive interface, and they can see the teacher’s avatar performing the chosen dance. At the same …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:fc7zyzPI2QAC",
            "Publisher": "Springer"
        },
        {
            "Title": "Text-to-sign language synthesis tool",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7078516/",
            "Abstract": "This document presents an approach for generating VRML animation sequences from Sign Language notation, based on MPEG-4 Face and Body Animation. The proposed application aims in providing a computer-based sign-language synthesis output for the deaf and the hearing impaired. Moreover the application may be used as a teaching tool for relatives of deaf people as well as people interested in learning the sign language. The application receives text sentences as input and provides as output 3D animated VRML sequences able to be visualised in any VRML-compliant browser.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The i-treasures intangible cultural heritage dataset",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2948910.2948944",
            "Abstract": "In this paper, we introduce the i-Treasures Intangible Cultural Heritage (ICH) dataset, a freely available collection of multimodal data captured from different forms of rare ICH. More specifically, the dataset contains video, audio, depth, motion capture data and other modalities, such as EEG or ultrasound data. It also includes (manual) annotations of data, while in some cases additional features and metadata are provided, extracted using algorithms and modules developed within the i-Treasures project. We describe the creation process (sensors, capture setups and modules used), the dataset content and the associated annotations. An attractive feature of this ICH Database is that it's the first of its kind, providing annotated multimodal data for a wide range of rare ICH types. Finally, some conclusions are drawn and the future development of the dataset is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:ExNiBuTMO9IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in Tracking and Recognition of Human Motion",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/advances-tracking-recognition-human-motion/13550",
            "Abstract": "Tracking and recognition of human motion has become an important research area in computer vision. In real world conditions it constitutes a complicated problem, considering cluttered backgrounds, gross illumination variations, occlusions, self-occlusions, different clothing and multiple moving objects. These ill-posed problems are usually tackled by making simplifying assumptions regarding the scene or by imposing constraints on the motion. Constraints such as that the contrast between the moving people and the background should be high and that everything in the scene should be static except for the target person are quite often introduced in order to achieve accurate segmentation. Moreover, the motion of the target person is often confined to simple movements with limited occlusions. In addition, assumptions such as known initial position and posture of the person are usually imposed in tracking processes.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Generation of stereoscopic image sequences using structure and rigid motion estimation by extended kalman filters",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1035558/",
            "Abstract": "In this paper an object-based method to generate additional stereo views from monoscopic image sequences using rigid motion and structure estimation by extended Kalman filters is presented. First, rigid scene objects are segmented and feature points in each object are extracted and tracked throughout the video sequence. Then, motion, structure and focal length are estimated recursively for each object, using extended Kalman filters, as described in Azarbayejani and Pentland (1995). Furthermore, the feature points and depths in the stereo image are computed and interpolated using 2-D Delaunay triangulation. Finally, a stereo image generation algorithm is proposed that uses the camera and structure equations to project the 3-D points in a new virtual stereo view for each frame. The generation of stereoscopic scenes is possible even when multiple moving rigid objects exist in the scene. Experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sprite generation and coding in multiview image sequences",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/825729/",
            "Abstract": "A novel algorithm for the generation of background sprite images from multiview image sequences is presented. A dynamic programming algorithm, first proposed by Grammalidis and Strintzis (see IEEE Trans. Circuits Syst. Video Technol., vol.8, p.328-44, 1998) using a multiview matching cost, as well as pure geometrical constraints, is used to provide an estimate of the disparity field and to identify occluded areas. By combining motion, disparity, and occlusion information, a sprite image corresponding to the first (main) view at the first time instant is generated. Image pixels from other views that are occluded in the main view are also added to the sprite. Finally, the sprite coding method defined by MPEG-4 is extended for multiview image sequences based on the generated sprite. Experimental results are presented, demonstrating the performance of the proposed technique and comparing it with standard MPEG-4 …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Detection, tracking and classification of vehicles and aircraft based on magnetic sensing technology",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.307.2148&rep=rep1&type=pdf",
            "Abstract": "Existing ground movement surveillance technologies at airports are subjected to limitations due to shadowing effects or multiple reflections. Therefore, there is a strong demand for a new sensing technology, which will be cost effective and will provide detection of non-cooperative targets under any weather conditions. This paper aims to present a new intelligent system, developed within the framework of the EC-funded ISMAEL project, which is based on a new magnetic sensing technology and provides detection, tracking and automatic classification of targets moving on the airport surface. The system is currently being installed at two European airports. Initial experimental results under real airport traffic demonstrate the great potential of the proposed system.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digitization and Visualization of Folk Dances: A Review",
            "Publication year": 2018,
            "Publication url": "https://www.med.muni.cz/en/science-and-research/publikacni-cinnost/1469497",
            "Abstract": "According to UNESCO, cultural heritage does not only include monuments and collections of objects, but also contains traditions or living expressions inherited from our ancestors and passed to our descendants. Folk dances represent part of cultural heritage and their preservation for the next generations appears of major importance. Digitization and visualization of folk dances form an increasingly active research area in computer science. In parallel to the rapidly advancing technologies, new ways for learning folk dances are explored, making the digitization and visualization of assorted folk dances for learning purposes using different equipment possible. Along with challenges and limitations, solutions that can assist the learning process and provide the user with meaningful feedback are proposed. In this paper, an overview of the techniques used for the recording of dance moves is presented. The different …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:MDQ-9Oe3GGUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Synthesis of virtual reality animation from sign language notation using MPEG-4 body animation parameters",
            "Publication year": 2004,
            "Publication url": "http://centaur.reading.ac.uk/15090/1/ICDVRAT2004_Full_Proceedings_5th_Conf.pdf#page=287",
            "Abstract": "This paper presents a novel approach for generating VRML animation sequences from Sign Language notation, based on MPEG-4 Face and Body Animation. Sign Language notation, in the well-known Sign Writing system, is provided as input and is initially converted to SWML (Sign Writing Markup Language), an XML-based format that has recently been developed for the storage, indexing and processing of Sign Writing notation. Each basic sign, namely sign box, is then converted to a sequence of Body Animation Parameters (BAPs) of the MPEG-4 standard, corresponding to the represented gesture. In addition, if a sign contains facial expressions, these are converted to a sequence of MPEG-4 Facial Animation Parameters (FAPs), while exact synchronization between facial and body movements is guaranteed. These sequences, which can also be coded and/or reproduced by MPEG-4 BAP and FAP players, are then used to animate H-anim compliant VRML avatars, reproducing the exact gestures represented in the sign language notation. Envisaged applications include interactive information systems for the persons with hearing disabilities (Web, E-mail, info–kiosks) and automatic translation of written texts to sign language (eg for TV newscasts).",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assistive HCI-Serious Games Co-design Insights: The Case Study of i-PROGNOSIS Personalized Game Suite for Parkinson’s Disease",
            "Publication year": 2021,
            "Publication url": "https://internal-journal.frontiersin.org/articles/10.3389/fpsyg.2020.612835/full",
            "Abstract": "Human-Computer Interaction (HCI) and games set a new domain in understanding people’s motivations in gaming, behavioral implications of game play, game adaptation to player preferences and needs for increased engaging experiences in the context of HCI serious games (HCI-SGs). When the latter relate with people’s health status, they can become a part of their daily life as assistive health status monitoring/enhancement systems. Co-designing HCI-SGs can be seen as a combination of art and science that involves a meticulous collaborative process. The design elements in assistive HCI-SGs for Parkinson’s Disease (PD) patients, in particular, are explored in the present work. Within this context, the Game-Based Learning (GBL) design framework is adopted here and its main game-design parameters are explored for the Exergames, Dietarygames, Emotional games, Handwriting games and Voice games design, drawn from the PD-related i-PROGNOSIS Personalized Game Suite (PGS) (www.i-prognosis.eu) holistic approach. Two main data sources were involved in the study. In particular, the first one includes qualitative data from semi-structured interviews, involving 10 PD patients and four clinicians in the co-creation process of the game design, whereas the second one relates with data from an online questionnaire addressed by 104 participants spanning the whole related spectrum, i.e., PD patients, physicians, software/game developers. Linear regression analysis was employed to identify an adapted GBL framework with the most significant game-design parameters, which efficiently predict the transferability of the PGS beneficial …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:Ui_nyea79ooC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Fire detection from images using faster R-CNN and multidimensional texture analysis",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8682647/",
            "Abstract": "In this paper, we propose a novel image-based fire detection approach, which combines the power of modern deep learning networks with multidimensional texture analysis based on higher-order linear dynamical systems. The candidate fire regions are identified by a Faster R-CNN network trained for the task of fire detection using a set of annotated images containing actual fire as well as selected negatives. The candidate fire regions are projected to a Grassmannian space and each image is represented as a cloud of points on the manifold. Finally, a vector representation approach is applied aiming to aggregate the Grassmannian points based on a locality criterion on the manifold. For evaluating the performance of the proposed methodology, we performed experiments with annotated images of two different databases containing fire and fire-coloured objects. Experimental results demonstrate the potential of …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:OkrdTXRNpVkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multi-sensor network for the protection of cultural heritage",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7074150/",
            "Abstract": "The paper presents a novel automatic early warning system to remotely monitor areas of archaeological and cultural interest from the risk of fire. Since these areas have been treasured and tended for very long periods of time, they are usually surrounded by old and valuable vegetation or situated close to forest regions, which exposes them to an increased risk of fire. The proposed system takes advantage of recent advances in multi-sensor surveillance technologies, using optical and infrared cameras, wireless sensor networks capable of monitoring different modalities (e.g. temperature and humidity) as well as local weather stations on the deployment site. The signals collected from these sensors are transmitted to a monitoring centre, which employs intelligent computer vision and pattern recognition algorithms as well as data fusion techniques to automatically analyze sensor information. The system is capable of …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Safe airport operation based on innovative magnetic detector system",
            "Publication year": 2009,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-its_20080058",
            "Abstract": "A novel magnetic sensing technology that forms the basis of an innovative system to monitor ground vehicle movements at airports is presented. The operating principle of this system is the detection of interaction of aircraft or ground vehicles with the earth's magnetic field using sensitive magnetic field detectors. After development and laboratory testing of the detectors, test sites have been set up at three European airports. Potential applications of the detectors were designed and demonstrated. Tests have shown that the system can be applied for ground movement surveillance. The approach can be used as a complementary surveillance system for existing and future advanced surface movement guidance and control systems (A-SMGCS) at large airports or as a cost-effective stand-alone solution for monitoring critical areas at medium and small airports. Furthermore, this system can be applied as well in road …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Novel 3D Game-like Applications Driven by Body Interactions for Learning Specific Forms of Intangible Cultural Heritage.",
            "Publication year": 2015,
            "Publication url": "https://pdfs.semanticscholar.org/cdde/9a29366231df93a4493b1b8b68d1cc6144ba.pdf",
            "Abstract": "1Argedor Information Technologies, Ankara, Turkey 2Institute for Educational Technology, National Research Council (ITD-CNR), Palermo, Italy 3Information Technologies Institute, Centre for Research and Technology Hellas, Thessaloniki, Greece 4Universite Pierre et Marie Curie-Paris 6, Paris, France 5University Paris 3 Sorbonne Nouvelle, Paris, France 6Centre National de la Recherche Scientifique, Laboratoire de Phonétique et Phonologie UMR 7018, Paris, France 7Phonetics and Phonology Laboratory, LPP-CNRS, Paris, France 8Universite de Mons, Mons, Belgium 9University College London, London, UK 10Aristotle University of Thessaloniki, Thessaloniki, Greece 11MTCG Lab, Dep. Of Ap. Informatics, University of Macedonia, Thessaloniki, Greece 12Robotics Lab, Dep. Of Mathématiques et Systèmes, MINES ParisTech-ARMINES, Paris, France 13Signal Processing and Machine Learning Lab ESPCI, Paris, France",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:mu2_AnMl8iYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A complete framework for automatic grading of H&E stained images of follicular lymphoma",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=9515676659867844068&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:bFI3QPDXJZMC",
            "Publisher": "SPRINGER"
        },
        {
            "Title": "3D wildfire simulation system",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.184.4699&rep=rep1&type=pdf",
            "Abstract": "The increase in the number of forest fires in the last few years has forced governments to take precautions. Besides prevention, early intervention is also very important in fire fighting. If the fire-fighters know where the fire will be in some time, it would be easier for them to stop the fire. Therefore a big need for simulating the fire behaviour exists. In this paper we are proposing a system which can simulate the propagation of fire in time. Also this system can visualize the propagation of fire in any 3D-GIS environment that accepts KMZ as a file format. Besides, the system supports the visualization of a large number of output data from the simulations, according to the user needs. This facilitates fire planning by fire-fighters. 3D visualization at 3D screens is also supported. Therefore, a better understanding of the terrain can be obtained.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:l7iSsH4_Im4C",
            "Publisher": "Beijing"
        },
        {
            "Title": "Metadata for intangible cultural heritage",
            "Publication year": 2018,
            "Publication url": "https://www.scitepress.org/Papers/2018/67609/67609.pdf",
            "Abstract": "It is a fact that states and international organizations are trying to protect and promote intangible cultural heritage. According to UNESCO intangible cultural heritage includes traditions or living expressions inherited from our ancestors and passed on to our descendants. Folk dances are an important part of our intangible cultural heritage, so there is a need to promote and protect them to inherit to the next generations. Beyond digitization of various elements of the dance, proper documentation requires to analyse them (either manually or automatically) and describe all important elements using appropriate metadata. However, although different metadata schemas have been defined in the area of cultural heritage, most are suitable only for tangible heritage, and cannot properly describe elements of intangible cultural heritage. The present study proposes a new metadata schema for describing different elements of folk dance.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:0iM-huCvmk0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Smoke detection using spatio-temporal analysis, motion modeling and dynamic texture recognition",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6952375/",
            "Abstract": "In this paper, we propose a novel method for video-based smoke detection, which aims to discriminate smoke from smoke-colored moving objects by applying spatio-temporal analysis, smoke motion modeling and dynamic texture recognition. Initially, candidate smoke regions in a frame are identified using background subtraction and color analysis based on the HSV model. Subsequently, spatio-temporal smoke modeling consisting of spatial energy analysis and spatio-temporal energy analysis is applied in the candidate regions. In addition, histograms of oriented gradients and optical flows (HOGHOFs) are computed to take into account both appearance and motion information, while dynamic texture recognition is applied in each candidate region using linear dynamical systems and a bag of systems approach. Dynamic score combination by mean value is finally used to determine whether there is smoke or not …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Information Technologies in Traditional Dance Analysis",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Kosmas-Dimitropoulos/publication/312160964_Information_Technologies_in_Traditional_Dance_Analysis/links/587379c408ae6eb871c63670/Information-Technologies-in-Traditional-Dance-Analysis.pdf",
            "Abstract": "The analysis, modelling, transmission and promotion of traditional dances are important areas where information technologies can make a significant contribution. In this paper, we focus on technologies related to the motion capture systems of human movement and present a methodology based on the use of multiple depth sensors. Specifically, the proposed method combines motion data from multiple sensors in order to increase the accuracy and address problems such as noisy data, occlusions of parts of a dancer’s body, limited area of coverage, etc. Subsequently, pattern recognition techniques are applied to analyze the motion of the dancer, while for the learning and assessment of performance, fuzzy logic techniques in combination with three-dimensional graphics technologies are employed. The proposed methodology has been developed within the FP7 research project “i-Treasures”, which aims to develop novel methodologies and new technological paradigms for the analysis and modelling of different forms of intangible cultural heritage and knowhow transmission.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:4WewbtJKmRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Development of automated workflows (spatial models) for forest monitoring with the use of time-series of multispectral optical and SAR data",
            "Publication year": 2019,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11174/1117409/Development-of-automated-workflows-spatial-models-for-forest-monitoring-with/10.1117/12.2534297.full?sessionGUID=83c9d902-bc99-93ce-d268-bead49a28531&webSyncID=e46e9e6e-c7a4-9dab-6a0c-bad059329ad8&sessionGUID=83c9d902-bc99-93ce-d268-bead49a28531",
            "Abstract": "The significance of forest ecosystems in terms of ecosystem processes and services and impacts on humanity is fully acknowledged. The constant exploitation of natural resources and the increasing anthropogenic pressure on ecosystems continue to put a strain on and irretrievably threaten global forest ecosystems. Global forest health is declining due to climate change, air pollution and increased human activities. Protecting and monitoring the health of forest ecosystems is a vital resource management function. The technological development in the field of remote sensing provides new tools and automated solutions for forest health monitoring. An effective web-based forest health monitoring platform can contribute to ecological, social, and economic aspects. This study aims to design rapid and automated workflows (Spatial Models-SMs) for time-series forest health monitoring with flexible parameterization and …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:rAN7mHg6NlYC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "An adaptive framework for the creation of bodymotion-based games",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8056603/",
            "Abstract": "As of the early 20 th  century, a significant body of research has been published that shows how effective game-based learning and gamification techniques can be compared to other methods. However, creating games can be time consuming and usually demands a significant effort. Therefore, this paper focuses on the design and development of a novel framework for the rapid design of body-motion-based customizable game-like applications. This framework consists of two components: i) an interface that allows the user to design the game and capture the motion data, and ii) a customizable game for learning and training using off-the-shelf motion capture sensors like the Microsoft Kinect. The game is automatically configured based on the output of the game design interface. In order to evaluate the proposed system, a pilot use case for the Latin dance Salsa has been selected. Preliminary small-scaled …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:uGrg30pLAbkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Building three dimensional head models",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1524070301905636",
            "Abstract": "This paper proposes a camera-based real-time system for building a three dimensional (3D) human head model. The proposed system is first trained in a semi-automatic way to locate the user's facial area and is then used to build a 3D model based on the front and profile views of the user's face. This is achieved by directing the user to position his or her face and profile in a highlighted area, which is used to train a neural network to distinguish the background from the face. With a blink from the user, the system is then capable of accurately locating a set of characteristic feature points on the front and profile views of the face, which are used for the adaptation of a generic 3D face model. This adaptation procedure is initialized with a rigid transformation of the model aiming to minimize the distances of the 3D model feature nodes from the calculated 3D coordinates of the 2D feature points. Then, a nonrigid …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Remote experiment laboratories using virtual reality technologies: The VRlab project",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Grammalidis-Nikos/publication/228904197_Remote_experiment_laboratories_using_virtual_reality_technologies_The_VRLAB_project/links/0c96052948d7dc6701000000/Remote-experiment-laboratories-using-virtual-reality-technologies-The-VRLAB-project.pdf",
            "Abstract": "This paper presents the “Remote Experiment Laboratories Using Virtual Reality”(VRLab) project. VRLab promotes the coordinated use of Virtual Reality technologies along with video streaming and remote control combined through a web interface in order to provide a new approach to multi-user remote experimentation for educational purposes.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Human motion tracking and recognition",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/human-motion-tracking-recognition/14438",
            "Abstract": "Tracking and recognition of human motion has become an important research area in computer vision. In real-world conditions it constitutes a complicated problem, considering cluttered backgrounds, gross illumination variations, occlusions, self-occlusions, different clothing, and multiple moving objects. These ill-posed problems are usually tackled by simplifying assumptions regarding the scene or by imposing constraints on the motion. Constraints such as that the contrast between the moving people and the background should be high, and that everything in the scene should be static except for the target person, are quite often introduced in order to achieve accurate segmentation. Moreover, the motion of the target person is often confined to simple movements with limited occlusions. In addition, assumptions such as known initial position and posture of the person are usually imposed in tracking processes.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Selective 4D modelling framework for spatial-temporal land information management system",
            "Publication year": 2015,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9535/953506/Selective-4D-modelling-framework-for-spatial-temporal-land-information-management/10.1117/12.2193464.short",
            "Abstract": "This paper introduces a predictive (selective) 4D modelling framework where only the spatial 3D differences are modelled at the forthcoming time instances, while regions of no significant spatial-temporal alterations remain intact. To accomplish this, initially spatial-temporal analysis is applied between 3D digital models captured at different time instances. So, the creation of dynamic change history maps is made. Change history maps indicate spatial probabilities of regions needed further 3D modelling at forthcoming instances. Thus, change history maps are good examples for a predictive assessment, that is, to localize surfaces within the objects where a high accuracy reconstruction process needs to be activated at the forthcoming time instances. The proposed 4D Land Information Management System (LIMS) is implemented using open interoperable standards based on the CityGML framework. CityGML allows …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:ZJ-noXUx9mkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Extracting Dynamics from Multi-dimensional Time-evolving Data using a Bag of Higher-order Linear Dynamical Systems.",
            "Publication year": 2016,
            "Publication url": "https://www.scitepress.org/Papers/2016/58440/58440.pdf",
            "Abstract": "In this paper we address the problem of extracting dynamics from multi-dimensional time-evolving data. To this end, we propose a linear dynamical model (LDS), which is based on the higher order decomposition of the observation data. In this way, we are able to extract a new descriptor for analyzing data of multiple elements coming from of the same or different data sources. Each sequence of data is modeled as a collection of higher order LDS descriptors (h-LDSs), which are estimated in equally sized temporal segments of data. Finally, each sequence is represented as a term frequency histogram following a bag-ofsystems approach, in which h-LDSs are used as feature descriptors. For evaluating the performance of the proposed methodology to extract dynamics from time evolving multidimensional data and using them for classification purposes in various applications, in this paper we consider two different cases: dynamic texture analysis and human motion recognition. Experimental results with two datasets for dynamic texture analysis and two datasets for human action recognition demonstrate the great potential of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:g9YHGIZn7mcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An adaptive framework for the creation of exergames for intangible cultural heritage (ICH) education",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s40692-018-0115-z",
            "Abstract": "As of the early twentieth century, a significant body of research has been published that shows how effective game-based learning and gamification techniques can be, compared to other methods. These technologies are also very important for the learning and transmission of intangible cultural heritage (ICH) creations, which include, among others, dance, theater, and other skills where body motion has a primary role. However, creating games can be time consuming and usually demands a significant effort. Therefore, this paper focuses on the design and development of a novel framework for the rapid design of body-motion-based customizable game-like applications. This framework consists of two components: (i) an interface that allows the user to design the game and capture the motion data, and (ii) a customizable game for learning and training using off-the-shelf motion-capture sensors like the …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:Gs1AF5H0x94C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "3D forest-fire spread simulation system",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4632631/",
            "Abstract": "In the last few years, due to the global warming and draught related to it, there is an increase in the number of forest fires. Forest fire detection is mainly done by people but there exists some automated systems in this field too. Besides the detection of the forest fires, effective fire extinguishing has an important role in fire fighting. If the spread of the fire can be predicted from the starting, early intervene can be achieved and fire can be extinguished swiftly. Using the fire propagation simulator explained here it is aimed, to predict the fire development beforehand and to visulalize this predictions on a 3D-GIS environment.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Motion Analysis on Depth Camera Data to Quantify Parkinson’s Disease Patients’ Motor Status Within the Framework of I-Prognosis Personalized Game Suite",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9191017/",
            "Abstract": "The primary manifestations of Parkinson Disease (PD) concern abnormalities of movement associated with the constant deterioration of motor skills. Such motor impairment affects patients’ movement accuracy and coordination, disrupting their daily life. Taking into account recent studies stating that computer-based physical therapy games can be used as a PD rehabilitation option, we propose a novel Exergame, the iPrognosis Warming up Game (http://www.i-prognosis.eu/), as a user-friendly tool that could both serve as a computer-based physical therapy game, as well as a means of accurately and automatically identifying the severity of PD motor symptoms. To this regard, we propose a novel deep learning methodology for motor impairment stage prediction that relies solely on human body motion data extracted from the recorded game sessions. Experimental results using a dataset of both early and advanced …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:w_ORaKkuc5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Grading of invasive breast carcinoma through Grassmannian VLAD encoding",
            "Publication year": 2017,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0185110",
            "Abstract": "In this paper we address the problem of automated grading of invasive breast carcinoma through the encoding of histological images as VLAD (Vector of Locally Aggregated Descriptors) representations on the Grassmann manifold. The proposed method considers each image as a set of multidimensional spatially-evolving signals that can be efficiently modeled through a higher-order linear dynamical systems analysis. Subsequently, each H&E (Hematoxylin and Eosin) stained breast cancer histological image is represented as a cloud of points on the Grassmann manifold, while a vector representation approach is applied aiming to aggregate the Grassmannian points based on a locality criterion on the manifold. To evaluate the efficiency of the proposed methodology, two datasets with different characteristics were used. More specifically, we created a new medium-sized dataset consisting of 300 annotated images (collected from 21 patients) of grades 1, 2 and 3, while we also provide experimental results using a large dataset, namely BreaKHis, containing 7,909 breast cancer histological images, collected from 82 patients, of both benign and malignant cases. Experimental results have shown that the proposed method outperforms a number of state of the art approaches providing average classification rates of 95.8% and 91.38% with our dataset and the BreaKHis dataset, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:KPAPMsW7zc0C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Earth Observations for complementing vegetation definition and distribution: an example for fire propagation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6064650/",
            "Abstract": "Vegetation spatial distribution is an important part in any study implying biodiversity and, more generally, landscape management. Here the problem is exemplified by studies aimed at providing the vegetation distribution needed for simulating wildfire propagation.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Video and signal based surveillance for airport applications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5280101/",
            "Abstract": "In this paper a comparative study of three ground traffic surveillance systems for airports based on different sensing technologies is presented. The first two solutions are based on video-based surveillance, while the third one is based on signal-based surveillance. More specifically, the first solution employs a network of smart cameras, whereas the second utilizes multiple autonomous tracking units to capture and process images from one or more pre-calibrated cameras. The third solution is based on a novel magnetic sensing technology, which detects ferromagnetic objects such as vehicle motors, aircraft engines and landing gears through their deformation of the Earthpsilas magnetic field. Evaluation and analysis of the performance of these systems, based on real test results in different European airports are presented. The proposed systems are flexible, scalable and suitable for a broad field of monitoring and …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Gesture synthesis from sign language notation using MPEG-4 humanoid animation parameters and inverse kinematics",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4197774/",
            "Abstract": "This paper presents a novel approach for generating VRML animation sequences from sign language notation, based on MPEG-4 face and body animation. Sign language notation, in the well-known sign writing system, is provided as input and is initially converted to SWML (Sign Writing Markup Language), an XML-based format that has recently been developed for the storage, indexing and processing of sign writing notation. Each basic sign, namely signbox, is then converted to a sequence of body animation parameters (BAPs) of the MPEG-4 standard, corresponding to the represented gesture. Inverse Kinematics are also employed for synthesizing complex animation sequences (e.g. contacts). In addition, if a sign contains facial expressions, these are converted to a sequence of MPEG-4 facial animation parameters (FAPs), while exact synchronization between facial and body movements is guaranteed. These …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:ufrVoPGSRksC",
            "Publisher": "IET"
        },
        {
            "Title": "3D reconstruction for a cultural heritage virtual tour system",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/30825742/isprs08.pdf",
            "Abstract": "Y. Bastanlar a,*, N. Grammalidisb, X. Zabulisc, E. Yilmaz a, Y. Yardimci a, G. Triantafyllidisb a Informatics Institute, Middle East Technical University, Ankara, Turkey-(yalinb, eyilmaz, yardimy)@ ii. metu. edu. tr b Informatics and Telematics Institute, CERTH, Thessaloniki, Greece-(ngramm, gatrian)@ iti. gr c Foundation for Research and Technology-Hellas, Inst. of Computer Science, Heraklion, Greecezabulis@ ics. forth. gr",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Three-dimensional facial adaptation for MPEG-4 talking heads",
            "Publication year": 2002,
            "Publication url": "https://asp-eurasipjournals.springeropen.com/articles/10.1155/S1110865702206113",
            "Abstract": "This paper studies a new method for three-dimensional (3D) facial model adaptation and its integration into a text-to-speech (TTS) system. The 3D facial adaptation requires a set of two orthogonal views of the user′s face with a number of feature points located on both views. Based on the correspondences of the feature points′ positions, a generic face model is deformed nonrigidly treating every facial part as a separate entity. A cylindrical texture map is then built from the two image views. The generated head models are compared to corresponding models obtained by the commonly used adaptation method that utilizes 3D radial bases functions. The generated 3D models are integrated into a talking head system, which consists of two distinct parts: a multilingual text to speech sub-system and an MPEG-4 compliant facial animation sub-system. Support for the Greek language has been added, while preserving lip and speech synchronization.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:3fE2CSJIrl8C",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Multi-sensor technology and fuzzy logic for dancer’s motion analysis and performance evaluation within a 3D virtual environment",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07437-5_36",
            "Abstract": "In this paper, we describe a novel methodology for dance learning and evaluation using multi-sensor and 3D gaming technology. The learners are captured during dancing, while an avatar visualizes their motion using fused input from multiple sensors. Motion analysis and fuzzy-logic are employed for the evaluation of the learners’ performance against the performance of an expert. Specifically, a two level Fuzzy Inference System is proposed which uses as input low level skeletal data and high level motion recognition probabilities for the evaluation of dancer’s performance. Tests with real dancers, both learners and experts, dancing Tsamiko, a very popular traditional Greek dance, are presented showing the potential of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:P5F9QuxV20EC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Head detection and tracking by 2-D and 3-D ellipsoid fitting",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/852337/",
            "Abstract": "A novel procedure for segmenting a set of scattered 3D data obtained from a head and shoulders multiview sequence is presented. The procedure consists of two steps. In the first step, two ellipses corresponding to the head and the body of the person are identified based on ellipse fitting of the outline of the person in each image. The fitting is based on a fast direct least squares method using the constraint that forces a general conic to be an ellipse. In order to achieve head/body segmentation, a K-means algorithm is used to minimise the fitting error between the points and the two ellipsoids. In the second step, a 3D ellipsoid model corresponding to the head of the person is identified using an extension of the above method. Robustness and outlier removal can be achieved if a 3D ellipsoid model estimation technique is used in conjunction with the Median of Least Squares (MedLS) technique, which minimises the …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A review on early forest fire detection systems using optical remote sensing",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/886684",
            "Abstract": "The environmental challenges the world faces nowadays have never been greater or more complex. Global areas covered by forests and urban woodlands are threatened by natural disasters that have increased dramatically during the last decades, in terms of both frequency and magnitude. Large-scale forest fires are one of the most harmful natural hazards affecting climate change and life around the world. Thus, to minimize their impacts on people and nature, the adoption of well-planned and closely coordinated effective prevention, early warning, and response approaches are necessary. This paper presents an overview of the optical remote sensing technologies used in early fire warning systems and provides an extensive survey on both flame and smoke detection algorithms employed by each technology. Three types of systems are identified, namely terrestrial, airborne, and spaceborne-based systems, while various models aiming to detect fire occurrences with high accuracy in challenging environments are studied. Finally, the strengths and weaknesses of fire detection systems based on optical remote sensing are discussed aiming to contribute to future research projects for the development of early warning fire systems. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:HevVnK7dagcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Advances in vision-based human body modeling",
            "Publication year": 2004,
            "Publication url": "https://www.igi-global.com/chapter/advances-vision-based-human-body/4165",
            "Abstract": "This chapter presents a survey of the most recent vision-based human body modeling techniques. It includes sections covering the topics of 3D human body coding standards, motion tracking, recognition and applications. Short summaries of various techniques, including their advantages and disadvantages, are introduced. Although this work is focused on computer vision, some references from computer graphics are also given. Considering that it is impossible to find a method valid for all applications, this chapter intends to give an overview of the current techniques in order to help in the selection of the most suitable method for a certain problem.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A 3D Feature for Building Segmentation based on Shape-from-Shading.",
            "Publication year": 2015,
            "Publication url": "https://www.scitepress.org/papers/2015/54563/54563.pdf",
            "Abstract": "An important cue that can assist towards an accurate building detection and segmentation is 3D information. Because of their height, buildings can easily be distinguished from the ground and small objects, allowing for their successful segmentation. Unfortunately, 3D knowledge is not always available, but there are ways to infer 3D information from 2D images. Shape-from-shading techniques extract height and surface normal information from a single 2D image by taking into consideration knowledge about illumination, reflectance and shape. In this paper, a novel feature is proposed that can describe the 3D information of reconstructed images based on a shape-from-shading technique in order to successfully acquire building boundaries. The results are promising and show that such a 3D feature can significantly assist in a correct building boundary detection and segmentation.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:HmWvvuJwtxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Magnetic signal processing & analysis for airfield traffic surveillance",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4444485/",
            "Abstract": "This paper presents an innovative system for airport surface surveillance based on a novel magnetic sensing technology. Ferromagnetic objects such as vehicle motors, aircraft engines, and landing gears are detected through their deformation of the Earth's magnetic field. Tests have shown that although the local changes of the Earth's magnetic field are extremely small, the proposed sensing technology is able to detect them reliably. The primary objective of the proposed approach is to provide a complementary surveillance system for existing and future Advanced Surface Movement Guidance and Control Systems (A-SMGCS) at large airports or a cost-effective surveillance solution for monitoring critical areas at medium and small airports. Unaffected by weather conditions, interference and shadowing effects, the system provides reliable position, velocity, and direction information without requiring any equipment …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digitization and visualization of folk dances in cultural heritage: a review",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/355462",
            "Abstract": "According to UNESCO, cultural heritage does not only include monuments and collections of objects, but also contains traditions or living expressions inherited from our ancestors and passed to our descendants. Folk dances represent part of cultural heritage and their preservation for the next generations appears of major importance. Digitization and visualization of folk dances form an increasingly active research area in computer science. In parallel to the rapidly advancing technologies, new ways for learning folk dances are explored, making the digitization and visualization of assorted folk dances for learning purposes using different equipment possible. Along with challenges and limitations, solutions that can assist the learning process and provide the user with meaningful feedback are proposed. In this paper, an overview of the techniques used for the recording of dance moves is presented. The different ways of visualization and giving the feedback to the user are reviewed as well as ways of performance evaluation. This paper reviews advances in digitization and visualization of folk dances from 2000 to 2018. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:peNFRSk4lDYC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Flame detection for video-based early fire warning systems and 3D visualization of fire propagation",
            "Publication year": 2012,
            "Publication url": "https://zenodo.cern.ch/record/1218/files/paper_V7oa.pdf",
            "Abstract": "Early and accurate detection and localization of flame is an essential requirement of modern early fire warning systems. Video-based systems can be used for this purpose; however, flame detection remains a challenging issue due to the fact that many natural objects have similar characteristics with fire. In this paper, we present a new algorithm for video based flame detection, which employs various spatio-temporal features such as colour probability, contour irregularity, spatial energy, flickering and spatio-temporal energy. Various background subtraction algorithms are tested and comparative results in terms of computational efficiency and accuracy are presented. Experimental results with two classification methods show that the proposed methodology provides high fire detection rates with a reasonable false alarm ratio. Finally, a 3D visualization tool for the estimation of the fire propagation is outlined and simulation results are presented and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EnCeladus hellenIc Supersite (Evoikos, Corinth rift and Ionian Sea)",
            "Publication year": 2017,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2017EGUGA..1911613S/abstract",
            "Abstract": "The Aegean area is among the most active areas in the world exhibiting shallow and intermediate depth seismicity with earthquakes having maximum magnitudes up to 8.0. The area of the Hellenic Supersite covers the most seismically active area of Central Greece. In more specific it comprises the areas of: Ionian Islands, where the highest seismicity in Europe is observed and the highest acceleration in Greece have been recorded. The area is undergoing rapid and intense ground deformation with large magnitude of recorded uplift (> 4 mm/yr) that took place in the western part of Cephalonia Island for the period of 2003 to 2010. Corinth Rift, that is an ideal natural laboratory to investigate rift deformation mechanisms. Both 5-10-yr GPS and 100-yr triangulation GPS velocity estimates suggest NS extension at< 5mm/yr in the east and> 15mm/yr in the west. Evoikos Rift, that shows a strongly thinned continental crust …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:0kLwNjf3oFwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interactive mobile application, web technologies and fire simulations in the service of forest fire volunteers",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917726/",
            "Abstract": "In this paper we present a novel interactive platform for the operational support and training of the forest fire volunteer groups that are accredited through the mechanisms of Civil Protection Services. The proposed system is based on mobile and web technologies, fire simulation techniques and shortest-path routing calculation. The system consists of a mobile application (client) allowing the volunteers to report fire incidents and vegetation types of an area to a Control Center (server). The Control Center is also capable of organizing Training Scenarios, based on fire simulations and detailed safe routes, which are sent to the volunteers' mobile devices. The system was tested by Greek and Bulgarian volunteer firefighters in the context of the `OUTLAND' project. The architecture and the functionalities of the proposed system are presented accompanied by figures and indicative screenshots.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Serious games to support learning of rare ‘intangible’cultural expressions",
            "Publication year": 2015,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.725.6143&rep=rep1&type=pdf",
            "Abstract": "The paper deals with the adoption of Serious Games (SGs) in the specific area of Intangible Cultural Heritage Education (ICH). The transmission of some cultural expressions, like rare traditional singing or dancing, is more related to the acquisition of procedural knowledge (ie how to perform some tasks, like a dance step) rather than to declarative knowledge (ie knowledge that can be declared or stated through words or symbol systems, eg music notation). Coherently, so far knowledge in these areas has been transmitted mainly by observation or imitation of experts/performers in real contexts. Grounded on the research results in Game Based Learning and on the opportunity offered by cutting-edge sensor technologies, the i-Treasures project exploits the interesting potential of Serious Games in the ICH field. As a matter of fact, the capacity of games to train motor skills and to support sensorimotor learning, together with their ability to enhance engagement and motivation, are the main elements at the heart of our choice. In the paper, we discuss in depth the theoretical rationale behind the adoption of Serious Games i-Treasures, also in the light of their current use in Cultural Heritage Education. Furthermore, the paper describes the main game design principles adopted by the i-Treasures project to address the specificities of various artistic expressions and to make the games sound and effective tools to support practice and learning.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:1l3MdapXzAoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sign synthesis from SignWriting notation using MPEG-4, H-Anim parameters and inverse kinematics",
            "Publication year": 2005,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/IJDHD.2005.4.3.191/html",
            "Abstract": "A novel approach is presented for generating VRML animation sequences from Sign Language notation, based on MPEG-4 Face and Body Animation. Sign Language notation, in the well-known SignWriting system, is provided as input and initially converted to SWML (SignWriting Markup Language), an XML-based format that has recently been developed for the storage, indexing, and processing of SignWriting notation. Each basic sign, namely signbox, is then converted to a corresponding sequence of Body Animation Parameters (BAPs) of the MPEG-4 standard. Inverse Kinematics are also employed for synthesizing complex animation sequences (eg contacts). In addition, if a sign contains facial expressions, then these are converted to a sequence of MPEG-4 Facial Animation Parameters (FAPs), while exact synchronization between facial and body movements is achieved. These sequences, which can also be …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:R3hNpaxXUhUC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "iPrognosis-early detection of Parkinson's disease via a smartphone application-proof of concept",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=6070503318058990115&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:YanO1q2l3soC",
            "Publisher": "SPRINGER WIEN"
        },
        {
            "Title": "AN EFFICIENT SENSOR FOR TRAFFIC MONITORING AND TRACKING APPLICATIONS-Based on Fast Motion Detection at the Areas of Interest",
            "Publication year": 2008,
            "Publication url": "https://www.scitepress.org/papers/2008/10840/",
            "Abstract": "We propose a novel video sensor for real-time motion detection at specific user-defined regions of interest, designed primarily for traffic monitoring, surveillance and tracking applications. Specifically, the new sensor a) supports virtual detectors with a generalized (polygonal) shape, thus providing additional flexibility in the design of detector configurations, b) is based on fast implementations of recent state-of-the art background extraction and update techniques and c) constitutes a generic, inexpensive software solution, which can be used with any video camera. First experimental results confirm that the new video sensor meets the expectations in terms of real-time performance and demonstrates the additional functionalities, according to which it was designed. The final goal is to use this new sensor as an alternative, improved version of embedded motion detection video sensors (like Autoscope®).",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:1pC5hbHeJ6IC",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "3-d human body tracking from depth images using analysis by synthesis",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958455/",
            "Abstract": "A general method to estimate MPEG-4 body animation parameters (BAPs) from depth images by using an analysis-by-synthesis technique is presented. A generic body model is first adapted to the specific person geometry. Then, the mean square error between the synthetic depth image, produced by model rendering, and the original depth image is minimized using the downhill simplex minimization method. Use of this error norm is seen to yield improved results, when compared to two alternative error norms, which were also evaluated. Results are presented for the specific application, where six animation parameters of the arm and the palm are estimated. In this application, an initial estimate is obtained by applying an expectation-maximization (EM) algorithm, which identifies three arm parts and two joint positions (elbow, wrist). A significant advantage of this procedure is that the resulting information can be …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Survey of 3D Human Body Representations",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/survey-human-body-representations/14678",
            "Abstract": "The problem of human body modeling was initially tackled to solve applications related to the film industry or computer games within the computer graphics (CG) community. Since then, several different tools were developed for editing and animating 3D digital body models. Although at the beginning most of those tools were devised within the computer graphics community, nowadays a lot of work proceeds from the computer vision (CV) community. In spite of this overlapped interest, there is a considerable difference between CG and CV human body model (HBM) applications. The first one pursues realistic models of both human body geometry and its associated motion. On the contrary, CV seeks more of an efficient than an accurate model for applications such as intelligent video surveillance, motion analysis, telepresence, 3D video sequence processing, and coding.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:maZDTaKrznsC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "ISMAEL-Reliable eyes for air traffic controllers at airports",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1706792/",
            "Abstract": "Against the background of aggravated capacity constraints at airports due to increasing air traffic, airports are in need of innovative systems enabling air traffic controllers to improve situational awareness of the position of vehicles and aircraft moving around the airport, even under reduced visibility conditions. While this demand is addressed by the development and introduction of advanced surface movement guidance and control systems (A-SMGCS), technologies currently applied to A-SMGCS feature some weak points regarding coverage, interference and climate conditions. ISMAEL targets these weak points by developing an innovative detection solution based on magnetic sensing technology. Thus, ISMAEL represents a valuable and cost-efficient complementary contribution to existing and planned A-SMGCS at small and large airports",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Video sensor network for real-time traffic monitoring and surveillance",
            "Publication year": 2010,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-its.2008.0092",
            "Abstract": "Sensor networks and associated infrastructures become ever more important to the traffic monitoring and control because of the increasing traffic demands in terms of congestion and safety. These systems allow authorities not only to monitor the traffic state at the detection sites, but also to obtain real-time related information (e.g. traffic loads). This study presents a real-time vision system for automatic traffic monitoring based on a network of autonomous tracking units (ATUs) that capture and process images from one or more pre-calibrated cameras. The proposed system is flexible, scalable and suitable for a broad field of applications, including traffic monitoring of tunnels at highways and aircraft parking areas at airports. Another objective of this work is to test and evaluate different image processing and data fusion techniques in order to be incorporated to the final system. The output of the image processing unit is …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:Se3iqnhoufwC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Multi-lead ECG signal analysis for myocardial infarction detection and localization through the mapping of Grassmannian and Euclidean features into a common Hilbert space",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1746809419301004",
            "Abstract": "Electrocardiogram is commonly used as a diagnostic tool for the monitoring of cardiac health and the detection of possible heart diseases. However, the procedure followed for the diagnosis of heart abnormalities is time consuming and prone to human errors. Thus, the development of computer-aided techniques for the automatic analysis of electrocardiogram signals is of vital importance for the diagnosis and prevention of heart diseases. The most serious outcome of coronary heart disease is the myocardial infarction, i.e., the rapid and irreversible damage of cardiac muscles, which, if not diagnosed and treated in time, continues to damage further the myocardial structure and function. In this paper we propose a novel approach for the automatic detection and localization of myocardial infarction from multi-lead electrocardiogram signals.The proposed method initially reshapes the …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:CB6W3GmKGOEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multi-entity bayesian networks for knowledge-driven analysis of ICH content",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-16181-5_25",
            "Abstract": "In this paper we introduce Multi-Entity Bayesian Networks (MEBNs) as the means to combine first-order logic with probabilistic inference and facilitate the semantic analysis of Intangible Cultural Heritage (ICH) content. First, we mention the need to capture and maintain ICH manifestations for the safeguarding of cultural treasures. Second, we present the MEBN models and stress their key features that can be used as a powerful tool for the aforementioned cause. Third, we present the methodology followed to build a MEBN model for the analysis of a traditional dance. Finally, we compare the efficiency of our MEBN model with that of a simple Bayesian network and demonstrate its superiority in cases that demand for situation-specific treatment.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:u9iWguZQMMsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "3D content generation for autostereoscopic displays",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5069642/",
            "Abstract": "Content generation is one of the most critical issues for the growth of 3DTV services in future. New autostereoscopic displays, such as the Philips Wowreg 3D display have significant advantages, including improved 3D viewing experience, wider viewing angles, multiple viewers and no need for special glasses. However, due to their content formatting requirements (2D + depth), live-action content is much more difficult to create. In this paper a new approach for 3D content generation is proposed, by integrating an existing state-of-the-art MRF-based disparity estimation method with additional pre- and post-processing steps. The proposed method uses rectification and colour segmentation to solve significant problems in disparity estimation as well as decomposition of the scene in foreground and background depth maps. Tests with different stereo sequences have already produced very promising results.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Active and healthy ageing for Parkinson's disease patients' support: A user's perspective within the i-PROGNOSIS framework",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7847785/",
            "Abstract": "In this paper, the user requirements, along with the methodology adopted towards their identification within the i-PROGNOSIS framework (www.i-prognosis.eu), are presented. The latter are placed within the concept of active and healthy ageing (AHA), focusing on the case of Parkinson's Disease (PD) patients' support. The bases for the user requirements identification were face-to-face sessions, focus groups and a large scale Web-survey. Towards the efficient user requirements identification and i-PROGNOSIS components development, exemplified usage scenarios and related business processes the stakeholders of i-PROGNOSIS can perform, are discussed. Overall, 122 functional and non-functional requirements were identified, serving as a basis for the spiral development model of i-PROGNOSIS, revealing the beneficial role of the users in designing solutions within the AHA concept.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:MvIMIWP2nqIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent traffic monitoring and surveillance with multiple cameras",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4564937/",
            "Abstract": "The paper presents a real-time vision system for automatic traffic monitoring based on a network of autonomous tracking units that capture and process images from one or more pre-calibrated cameras. The system, which has been developed within the framework of TRAVIS (TRAffic VISual monitoring) project, is flexible, scalable and can be useable for a broad field of applications, including traffic monitoring of tunnels at highways and aircraft parking areas at airports. Different image processing and data fusion techniques were tested and evaluated in order to be incorporated to the system. The final output of the image processing is a set of information for each moving object in the scene, such as target ID, position, velocity and classification. This can be transmitted to a remote traffic control centre, as the network demands are remarkably low. This information is analyzed and used to provide real-time output (e.g …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Video sensor data fusion for advanced surface movement guidance and control systems",
            "Publication year": 2004,
            "Publication url": "https://core.ac.uk/download/pdf/23797708.pdf",
            "Abstract": "Reflections, multipath and shadows due to buildings, equipment, and other reflecting objects on the airport surface, make it difficult, if not sometimes impossible for existing Advanced Surface Movement Guidance and Control Systems (A-SMGCS) to reliably cover the whole aerodrome. In these cases another sensor must step in to fill those gaps. Digital video cameras not only can solve these kinds of problems filling blind spots in the existing A-SMGCS systems but also provide a cost effective solution. Within INTERVUSE project an innovative system for airport surface movement control was developed based on intelligent video cameras.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Medical follow up assessments of iPrognosis application users for early Parkinson's disease detection",
            "Publication year": 2020,
            "Publication url": "https://www.prd-journal.com/article/S1353-8020(20)30332-1/abstract",
            "Abstract": "Objective: Medical follow up assessments as gold standard for controlling iPrognosis application users derived data of an international multilingual study.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:gYnLYBw1zZMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A modular CNN-based building detector for remote sensing images",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128619304475",
            "Abstract": "Convolutional neural networks (CNNs) have resurged lately due to their state-of-the-art performance in various disciplines, such as computer vision, audio and text processing. However, CNNs have not been widely employed for remote sensing applications. In this paper, we propose a CNN architecture, named Modular-CNN, to improve the performance of building detectors that employ Histogram of Oriented Gradients (HOG) and Local Binary Patterns (LBP) in a remote sensing dataset. Additionally, we propose two improvements to increase the classification accuracy of Modular-CNN. The first improvement combines the power of raw and normalised features, while the second one concerns the Euler transformation of feature vectors. We demonstrate the effectiveness of our proposed Modular-CNN and the novel improvements in remote sensing and other datasets in a comparative study with other state-of-the-art …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:ve7iT2ZEuL4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Development of Methodologies and Standardized Services for Supporting Forest Economics",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-14401-2_33",
            "Abstract": "In the Mediterranean region, many types of forests are non-productive or degraded, although they could substantially contribute to growth of local economies. In Greece, 30% of the total area is covered by forests, however their contribution to the GDP is almost non-existent. An example is the chestnut production in Thessaly region of Greece, and especially in Mouzaki municipality, which is almost abandoned due to insufficient agricultural policies concerning establishment of alternative crops, and consequently leads to loss of potential income for the rural economy. The ARTEMIS project, funded by the Greek Secretariat for Research and Technology, aims at delivering an innovative information platform providing systematically high quality Earth Observation based products and services for monitoring forest health and supporting eventually the growth of forestry related economy and market. The architecture …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:5UUbrqTvKfUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Intangible cultural heritage and new technologies: challenges and opportunities for cultural preservation and development",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-49607-8_5",
            "Abstract": "Intangible cultural heritage (ICH) is a relatively recent term coined to represent living cultural expressions and practices, which are recognised by communities as distinct aspects of identity. The safeguarding of ICH has become a topic of international concern primarily through the work of United Nations Educational, Scientific and Cultural Organization (UNESCO). However, little research has been done on the role of new technologies in the preservation and transmission of intangible heritage. This chapter examines resources, projects and technologies providing access to ICH and identifies gaps and constraints. It draws on research conducted within the scope of the collaborative research project, i-Treasures. In doing so, it covers the state of the art in technologies that could be employed for access, capture and analysis of ICH in order to highlight how specific new technologies can contribute to the …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:Qh5Z_vBjo80C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Using the expectation-maximization algorithm for depth estimation and segmentation of multi-view images",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1024141/",
            "Abstract": "An algorithm for joint depth estimation and segmentation from multi-view images is presented. The distribution of the luminance of each image pixel is modeled as a random variable, which is approximated by a \"mixture of Gaussians model\". After recovering 3D motion, a reference image is segmented into a fixed number of regions, each characterized by a distinct affine depth model with three parameters. The estimated depth parameters and segmentation masks are iteratively estimated using an expectation-maximization algorithm, similar to that proposed in Sawhney et al. (1996). In addition, the proposed algorithm is extended for cases where more than two images are available.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D forest fire propagation simulation",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4547885/",
            "Abstract": "The increase in the number of forest fires in the last few years dispatch governments to take precautions. Besides prevention, early intervention is also very important in fire fighting. If the firefighters know where the fire will be in some time, it would be easier for them to stop the fire. Therefore a big need for simulating the fire behavior exists. In this paper we are proposing a system which can simulate the propagation of fire in time. Also this system can visualize the propagation of fire in any 3D-GIS environment, that accepts KMZ as a file format. Besides, any user demanded data can be visualized on the map of the system. This gives the chance of fire planning to firefighters. The system can visualize its results on 3D screens in 3D. Therefore, a better understanding of the terrain can be obtained.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generation of 3-D head models from multiple images using ellipsoid approximation for the rear part",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/900950/",
            "Abstract": "A system for building a three dimensional (3-D) human head model from two camera views is proposed. A generic 3-D face model is adapted to a human face of which the frontal and profile views are given. Then, a 3-D ellipsoid approximation technique is used to fit an ellipsoid to the 3-D wireframe model. This ellipsoid is then used to approximate the back of the head, while the the initial 3-D face model provides information for the high-detail front part of the head. The part of the ellipsoid model that corresponds to the back of the head is then identified and an algorithm to merge the front (face) and the back part is proposed. A cylindrical texture map is finally built covering the entire area of the head by exploiting the inherent face symmetry. The final result is a complete, textured model of a specific person's head.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Flame detection for video-based early fire warning for the protection of cultural heritage",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34234-9_38",
            "Abstract": "Cultural heritage and archaeological sites are exposed to the risk of fire and early warning is the only way to avoid losses and damages. The use of terrestrial systems, typically based on video cameras, is currently the most promising solution for advanced automatic wildfire surveillance and monitoring. Video cameras are sensitive in visible spectra and can be used either for flame or smoke detection. This paper presents and compares three video-based flame detection techniques, which were developed within the FIRESENSE EU research project.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "ICT-Based Participatory Approaches for the Exploitation and Re-use of Intangible Cultural Heritage",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-12453-3_25",
            "Abstract": "Cultural heritage, in both its tangible and intangible form, is an important factor for social cohesion, tourism and economic development, and ICT technologies can help significantly to this end. The present paper aims at linking the fields of Intangible Cultural Heritage (ICH) and ICT technologies with an emphasis on participatory approaches, using the EU i-Treasures and Terpsichore projects as case studies. The two projects leverage modern ICT technologies to improve the analysis and presentation of ICH, raise public awareness, provide seamless and universal access to cultural resources, support new services for research and education and recommend new development strategies. After a brief review of the state of the art on participatory approaches from both the ICH and the ICT technologies field, the paper proposes a new set of interventions and approaches, based on the experience gained from the …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:uQdrZ3qaPmcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Intangible Treasures-Capturing the Intangible Cultural Heritage and Learning the Rare Know-How of Living Human Treasures",
            "Publication year": 2015,
            "Publication url": "http://diglib.cgv.tugraz.at/handle/10.2312/14465",
            "Abstract": "i-Treasures project, included into EU FP7, aims at building a public and expandable platform to enable learning and transmission of rare know-how of Intangible Cultural Heritage (ICH) in order to prevent them from extinction.I-Treasure aims to provide a tool that will allow their transmission to new people. The proposed platform combines lots of different technologies like multisensory technology, singing voice synthesis and sensorimotor learning to leave the beaten path in education and ICH knowledge transmission. In i-Treasures project, there are four main ICH cases: rare traditional songs; rare dance interactions; traditional craftsmanship focusing on the art of pottery making, and finally contemporary music composition based on Beethoven, Haydn and Mozart musical pieces.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:P-MJmu9ZMwQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Professor Maria Petrou’s Professional Career",
            "Publication year": 2014,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-fd2e4a5c-7ad7-3d65-82c9-956482b73f9b",
            "Abstract": "Professor Maria Petrou’s Professional Career × Close The Infona portal uses cookies, ie \nstrings of text saved by a browser on the user's device. The portal can access those files and \nuse them to remember the user's data, such as their chosen settings (screen view, interface \nlanguage, etc.), or their login data. By using the Infona portal the user accepts automatic saving \nand using this information for portal operation purposes. More information on the subject can \nbe found in the Privacy Policy and Terms of Service. By closing this window the user confirms \nthat they have read the information on cookie usage, and they accept the privacy policy and \nthe way cookies are used by the portal. You can change the cookie settings in your browser. \nI accept Polski English Login or register account remember me Password recovery INFONA - \nscience communication portal INFONA Search advanced search Browse series books × as -…",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimating body animation parameters from depth images using analysis by synthesis",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/929947/",
            "Abstract": "We present a general method to estimate MPEG-4 body animation parameters (BAPs) from video depth images by using an analysis-by-synthesis technique. A generic body model is first adapted to the geometry of the specific person. Then, the mean square error between the synthetic depth image, produced by model rendering, and the original depth image is minimized using the downhill simplex minimization method. Using this depth reconstruction, error norm is seen to yield improved results when compared to two alternative choices for the error norms, which were also evaluated. Results are presented for the specific application, where six animation parameters of the arm and the palm are estimated. In this case, an initial estimate is obtained by applying an expectation-maximization (EM) algorithm, which identifies three arm parts and two joint positions (elbow, wrist). This information is also used for reducing …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ISMAEL–Intelligent Surveillance and Management Functions for Airfield Applications Based on Low Cost Magnetic Field Detectors",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=5446398331184581159&hl=en&oi=scholarr",
            "Abstract": "Against the background of aggravated capacity constraints at airports due to increasing air traffic, airports are in need of innovative systems enabling Air Traffic Controllers to precisely determine the position of vehicles moving on the surface, even under reduced visibility conditions. While this demand is addressed by the development and introduction of Advanced Surface Movement Guidance and Control Systems (A-SMGCS), technologies currently applied to A-SMGCS feature some weak points regarding coverage, robustness interference, and climate conditions. ISMAEL targets these weak points by developing an innovative detection solution based on magnetic sensing technology. Thus, ISMAEL will represent a valuable and cost-efficient complementary contribution to existing and planned A-SMGCS at small and large airports.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:2u1QkWOsl3MC",
            "Publisher": "JISSA Conf., Paris, France"
        },
        {
            "Title": "Higher order linear dynamical systems for smoke detection in video surveillance applications",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7401022/",
            "Abstract": "In this paper, we consider the problem of multi-dimensional dynamic texture analysis, and we introduce a new higher order linear dynamical system (h-LDS) descriptor. The proposed h-LDS descriptor is based on the higher order decomposition of the multidimensional image data and enables the analysis of dynamic textures by using information from various image elements. In addition, we propose a methodology for its application to video-based early warning systems that focus on smoke identification. More specifically, the proposed methodology enables the representation of video subsequences as histograms of h-LDS descriptors produced by the smoke candidate image patches in each subsequence. Finally, to further improve the classification accuracy, we propose the combination of multidimensional dynamic texture analysis with the spatiotemporal modeling of smoke by using a particle swarm optimization …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:zaHkCSmj5XkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3-D time-varying scene capture technologies—A survey",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4373330/",
            "Abstract": "Advances in image sensors and evolution of digital computation is a strong stimulus for development and implementation of sophisticated methods for capturing, processing and analysis of 3D data from dynamic scenes. Research on perspective time-varying 3D scene capture technologies is important for the upcoming 3DTV displays. Methods such as shape-from-texture, shape-from-shading, shape-from-focus, and shape-from-motion extraction can restore 3D shape information from a single camera data. The existing techniques for 3D extraction from single-camera video sequences are especially useful for conversion of the already available vast mono-view content to the 3DTV systems. Scene-oriented single-camera methods such as human face reconstruction and facial motion analysis, body modeling and body motion tracking, and motion recognition solve efficiently a variety of tasks. 3D multicamera dynamic …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unsupervised dance motion patterns classification from fused skeletal data using exemplar-based HMMs",
            "Publication year": 2015,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1260/2047-4970.4.2.209",
            "Abstract": "In this paper, we propose a method for the partitioning of dance sequences into multiple periods and motion patterns. The proposed method deploys features in the form of a skeletal representation of the dancer observed through time using multiple depth sensors. This representation is the fusion of skeletal features captured using multiple sensors and combined into a single, more robust, skeletal representation. Using this information, initially we partition the dance sequence into periods and subsequently into motion patterns. Partitioning into periods is based on observing the horizontal displacement of the dancer while each period is subsequently partitioned into motion patterns by using an exemplar-based Hidden Markov Model that classifies each frame into an exemplar representing a hidden state of the HMM. The proposed method was tested on dance sequences comprising multiple periods and motion …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:H-3wYkpcA84C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Synthesis of virtual reality animations from SWML using MPEG-4 body animation parameters",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.97.7465&rep=rep1&type=pdf",
            "Abstract": "This paper presents a novel approach for generating VRML animation sequences from Sign Language notation, based on MPEG-4 Body Animation. Sign Language notation, in the well-known SignWriting system, is provided as input and is initially converted to SWML (SignWriting Markup Language), an XML-based format which has recently been developed for the storage, indexing and processing of SignWriting notation. Each sign box (basic sign) is then converted to a sequence of Body Animation Parameters (BAPs) of the MPEG-4 standard, corresponding to the represented gesture. These sequences, which can also be coded and/or reproduced by MPEG-4 BAP players, are then used to animate H-anim compliant VRML avatars, reproducing the exact gestures represented in sign language notation. Envisaged applications include producing signing avatars for interactive information systems (Web, E-mail, info–kiosks) and TV newscasts for persons with hearing disabilities.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Detection of centroblasts in h&e stained images of follicular lymphoma",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6830728/",
            "Abstract": "This paper presents a complete framework for automatic detection of malignant cells in microscopic images acquired from tissue biopsies of follicular lymphoma. After pre-processing to remove noise and suppress small details, images are segmented by using intensity thresholding, in order to detect the cell nuclei. Subsequently, touching cells are being separated using Expectation Maximization algorithm. Candidate centroblasts are then selected for classification by using size, shape and intensity histogram criteria. Finally, candidates are classified by using a Linear Discriminant Analysis classifier. The application of the methodology in a generated dataset of microscopic images, stained with Hematoxylin and Eosin, showed promising results by detecting in average 82.58% of the annotated malignant cells.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Detecting hypomimia symptoms by selfie photo analysis: for early Parkinson disease detection",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3316782.3322756",
            "Abstract": "Hypomimia, ie reduction in the expressiveness of the face, is a cardinal sign of the PD, often present at its early stages. Within the EU-funded i-Prognosis project (http://www. i-prognosis. eu), early and unobtrusive Parkinson's disease detection tests are developed, based on the interaction of users with everyday technological devices. The selfie analysis module translates facial expression features into an index reflecting the severity of PD hypomimia symptoms that affect the variability of patients' facial expressions. Monitoring of such an index over time holds the promise to detect the onset of hypomimia symptoms in an unobtrusive way. Our approach proposes a methodology for detecting and quantifying the progressive decrease of variability of facial expressions in early PD patients by analysing patterns emerging from photos (selfies) during daily life. Promising results are presented from both a) a small …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:PPrs6GlykQcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-Time Signal Acquisition, High Speed Processing and Frequency Analysis in Modern Air Data Measurement Instruments",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=UG2fDwAAQBAJ&oi=fnd&pg=PA459&dq=info:nhJFCe2_uhMJ:scholar.google.com&ots=hnkcd-JLy9&sig=tTrixODXByw6lbQ76m4sCH7vsKU",
            "Abstract": "There is no doubt that the signal processing task is a very critical issue in the majority of new technological inventions and challenges in the area of electrical engineering. Despite the fact that during the last thirty years numerous algorithms and techniques have been developed in the field and classical methods of DSP technology were established, it is still an extremely skilled work to properly design, build and implement an effective signal processing unit able to meet the requirements of the increasingly demanding and sophisticated modern applications. This is especially true when it is necessary to deal with real-time applications of huge data rates and computational loads. It is the objective of this book chapter to present all the successive steps of such a processs in the framework of an ambitious plan to develop a functional and reliable lidar-based air data measurement instrument, launched by the FP6 Aeronautics and Space NESLIE project. Designed to perform in real-time (onboard the plane) and to provide vital flight parameters to the cockpit of the aircraft, this remote sensing equipment dictates the implementation of a robust, flexible and very fast signal processing unit. This chapter starts by introducing the characteristics of the expected signal as well as the overall requirements of the system. Taking into account the very low signal-to-noise ratio (SNR) of a signal resulting from aerosol particles light backscattering and the different flight levels in a non-uniform and unstable environment, at which the measurement unit has to operate, we specify the appropriate algorithms and develop the necessary techniques for an effective signal …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:bEWYMUwI8FkC",
            "Publisher": "BoD–Books on Demand"
        },
        {
            "Title": "Folk dance pattern recognition over depth images acquired via kinect sensor",
            "Publication year": 2017,
            "Publication url": "https://core.ac.uk/download/pdf/193486100.pdf",
            "Abstract": "The possibility of accurate recognition of folk dance patterns is investigated in this paper. System inputs are raw skeleton data, provided by a low cost sensor. In particular, data were obtained by monitoring three professional dancers, using a Kinect II sensor. A set of six traditional Greek dances (without their variations) consists the investigated data. A two-step process was adopted. At first, the most descriptive skeleton data were selected using a combination of density based and sparse modelling algorithms. Then, the representative data served as training set for a variety of classifiers.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:k6nH7jlkaTkC",
            "Publisher": "Copernicus GmbH"
        },
        {
            "Title": "Implementation of additional seismological software for the determination of earthquake parameters based on MatSeis and an automatic phase-detector algorithm",
            "Publication year": 2002,
            "Publication url": "https://pubs.geoscienceworld.org/ssa/srl/article-abstract/73/1/57/142708",
            "Abstract": "Various approaches have been presented during the last few years regarding public-domain seismological software for routine or advanced analysis of earthquake data. The necessity of such software approaches is continuously increasing as the amount of data of permanent and portable seismological networks stored in computer systems is increasing due to the augmentation of networks that use full digital systems with high sampling rates. There is also the additional need for software for the rapid determination of earthquake parameters for high-seismicity areas.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Seismological Society of America"
        },
        {
            "Title": "Classification of nuclei in follicular lyphoma tissue sections using different stains and bayesian networks",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-32703-7_47",
            "Abstract": "Automated centroblast (CB) detection in Follicular Lymphoma (FL) tissue samples has recently attracted significant research interest. Most of the methods described in the literature are based on the use of Hematoxilin and Eosin (H&E) stain. However, the automated detection of CBs from H&E stained images remains a challenging issue. To this end, this paper presents a novel approach which is based on the use of both PAX5 and H&E stains in tissue sections sliced at the thickness of 1μm. The goal of PAX5 is three-fold: to facilitate the segmentation of nuclei, to remove a number of follicular dendritic cells and finally to extract morphological characteristics of nuclei. Furthermore, the use of H&E stain enables us to extract textural information related to histological characteristics used by pathologists in diagnosis of FL grading. In our method we propose a novel algorithm for the separation of overlapped nuclei …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:RZBefGmQYygC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Project ref. No. FP6-507609 Project acronym SIMILAR Deliverable Nature R Dissemination Level PU Contractual date of",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=10122168925767625700&hl=en&oi=scholarr",
            "Abstract": "The rapid evolution of Information and Communications Technologies (ICT) and the emergence of the Information Society (IS) creates numerous new opportunities for interpersonal communication, education, vocational training, employment, entertainment, etc. It also entails, however, a number of risks, mainly concerning the creation of a society of ‘haves’ and ‘have-nots’ access to the applications and services offered by the IS, which can significantly compromise the coherence of the society.Disabled people constitute one of the most important categories of citizens, which are at risk, in this context. Although the emergence of the IS creates tremendous opportunities for the improvement of life and independent living of the disabled, it can be argued that disabled people have not yet realized the full potential of the IS. In particular, most applications and services are designed and developed for the “average”, able …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:KYgttONoxcsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Coding of Stereoscopic and 3D Images and Video.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=5693152426705457148&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rapid determination of earthquake parameters using a phase auto-detect system",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/C-Papazachos/publication/241754629_RAPID_DETERMINATION_OF_EARTHQUAKE_PARAMETERS_USING_A_PHASE_AUTO-DETECT_SYSTEM/links/00463528dd834d9fe9000000/RAPID-DETERMINATION-OF-EARTHQUAKE-PARAMETERS-USING-A-PHASE-AUTO-DETECT-SYSTEM.pdf",
            "Abstract": "The main target of the study was to merge, modify and expand various earthquake data processing software in a single unified processing utility. For this reason, the database system of DATASCOPE (Colorado Univ.) was employed as the basic RDBMS for the seismological data, using the CSS 3.0 schema file for the data manipulation. Additional software to create and check the appropriate tables of the database was implemented. For the waveform processing the Matseis software (Sandia Labs.) was used (based on the MATLAB commercial software) and appropriate interface between DATASCOPE to Matseis was implemented. All developed algorithms were implemented through the interface of Matseis and MATLAB. Expansions and modifications include an overview window of the waveform data, auto phase pickers, easy phase evaluation/characterisation, calculation of earthquake parameters (using HypoellipseY2K) and focal mechanisms (using FPFIT). A significant effort was devoted to the automatic P-and S-phase identification. The finally proposed method uses a wavelet transform-based filtering technique, the WTST-NST filter, combined with High Order Statistics (HOS). The method was applied to real seismic data recorded in Greece from a local experiment. The resulting P-and S-phases indicate that the proposed algorithms provide high identification accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fire detection and 3D fire propagation estimation for the protection of cultural heritage areas",
            "Publication year": 2010,
            "Publication url": "http://repository.bilkent.edu.tr/handle/11693/28591",
            "Abstract": "Beyond taking precautionary measures to avoid a forest fire, early warning and immediate response to a fire breakout are the only ways to avoid great losses and environmental and cultural heritage damages. To this end, this paper aims to present a computer vision based algorithm for wildfire detection and a 3D fire propagation estimation system. The main detection algorithm is composed of four sub-algorithms detecting (i) slow moving objects, (ii) smoke-coloured regions, (iii) rising regions, and (iv) shadow regions. After detecting a wildfire, the main focus should be the estimation of its propagation direction and speed. If the model of the vegetation and other important parameters like wind speed, slope, aspect of the ground surface, etc. are known; the propagation of fire can be estimated. This propagation can then be visualized in any 3D-GIS environment that supports KML files.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Copernicus GmbH"
        },
        {
            "Title": "Signal processing for a laser based air data system in commercial aircrafts",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080539/",
            "Abstract": "A systematic approach for the design and implementation of an efficient and reliable signal processing unit able to provide vital flight parameters to the cockpit of an aircraft using a properly built LIDAR equipment is presented in this paper. Taking into account the specific characteristics of a signal coming out from such an optical device we define all the necessary steps for the real-time data acquisition and processing in order to extract accurate information about the true air speed (TAS) of the aircraft and other useful flight parameters. Simulation results using properly modeled signals verified the effectiveness of the suggested methodology. The proposed scheme is being developed in the framework of the EU funded NESLIE research project and aims to be finally flight tested in order to demonstrate the availability of accurate measurements in all weather conditions and in any phase of flight.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Video fire detection–review",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1051200413001462",
            "Abstract": "This is a review article describing the recent developments in Video based Fire Detection (VFD). Video surveillance cameras and computer vision methods are widely used in many security applications. It is also possible to use security cameras and special purpose infrared surveillance cameras for fire detection. This requires intelligent video processing techniques for detection and analysis of uncontrolled fire behavior. VFD may help reduce the detection time compared to the currently available sensors in both indoors and outdoors because cameras can monitor “volumes” and do not have transport delay that the traditional “point” sensors suffer from. It is possible to cover an area of 100 km2 using a single pan-tilt-zoom camera placed on a hilltop for wildfire detection. Another benefit of the VFD systems is that they can provide crucial information about the size and growth of the fire, direction of smoke propagation.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Spatio-temporal flame modeling and dynamic texture analysis for automatic video-based fire detection",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6857396/",
            "Abstract": "Every year, a large number of wildfires all over the world burn forested lands, causing adverse ecological, economic, and social impacts. Beyond taking precautionary measures, early warning and immediate response are the only ways to avoid great losses. To this end, in this paper we propose a computer vision approach for fire-flame detection to be used by an early-warning fire monitoring system. Initially, candidate fire regions in a frame are defined using background subtraction and color analysis based on a nonparametric model. Subsequently, the fire behavior is modeled by employing various spatio-temporal features, such as color probability, flickering, spatial, and spatio-temporal energy, while dynamic texture analysis is applied in each candidate region using linear dynamical systems and a bag-of-systems approach. To increase the robustness of the algorithm, the spatio-temporal consistency energy of …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Detection of Human Faces in Images using a Novel Neural Network Technique",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.445.55&rep=rep1&type=pdf",
            "Abstract": "This paper presents a user interactive system that manages, with minimum user interaction, to locate a set of characteristic feature points in the frontal view of a person’s face. The proposed method is user adaptive and is implemented as a combination of a classification-based facial region extraction technique with a transition based facial feature extraction method. Thus, a feed-forward neural network is first trained to recognize image blocks belonging to the facial area. Then, the feature detection algorithm is initialized with a blink of the user’s eyes, which localizes the exact contours of the eyes. Finally, we locate the remaining facial features (face contour, eyebrows, mouth and nose) by adaptively thresholding the facial area and utilizing apriori knowledge about the geometrical structure of the face.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in Vision-Based Human Body Modeling",
            "Publication year": 2005,
            "Publication url": "http://213.230.96.51:8090/files/ebooks/Ilmiy-texnologik%20kitoblar/Sarris%20N.,%20Strintzis%20M.G.%20-%203D%20Modeling%20and%20Animation.%20Synthesis%20and%20Analysis%20Techniques%20for%20the%20Human%20Body(2004)(395).pdf#page=10",
            "Abstract": "This chapter presents a survey of the most recent vision-based human body modeling techniques. It includes sections covering the topics of 3D human body coding standards, motion tracking, recognition and applications. Short summaries of various techniques, including their advantages and disadvantages, are introduced. Although this work is focused on computer vision, some references from computer graphics are also given. Considering that it is impossible to find a method valid for all applications, this chapter",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:qOpkhvVCMvUC",
            "Publisher": "Irm Press"
        },
        {
            "Title": "Innovative interventions for Parkinson's disease patients using iPrognosis games: an evaluation analysis by medical experts",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3389189.3397974",
            "Abstract": "Parkinson's disease (PD) is a chronic and progressive neurodegenerative disease that affects~ 7 million people worldwide, without any cure to date; however, it can be symptomatically treated. In this vein, innovative technologies can be used for the objective assessment of clinical symptoms and to provide supportive therapies at home. The present work explores the processes and the outcomes of the i-PROGNOSIS (www. i-prognosis. eu) intervention deployment in three PD clinical centres (Greece, UK, and Germany). For that purpose, 36 PD patients were recruited to voluntarily participate in the i-PROGNOSIS feasibility study, spread across the three different countries. The PD patients interacted with the i-PROGNOSIS system for up-to-three months, mainly within the clinical environment, using the provided iPrognosis Games in dedicated gaming stations that were setup in the corresponding clinical centres …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:5N-NJrZHaHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multimodal approach for the safeguarding and transmission of intangible cultural heritage: The case of i-Treasures",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8255779/",
            "Abstract": "Intangible Cultural Heritage (ICH) creations include, amongst other, music, dance, singing, theatre, human skills, and craftsmanship. These cultural expressions are usually transmitted orally and/or using gestures and are modified over a period of time, through a process of collective recreation. As the world becomes more interconnected and many different cultures come into contact, local communities run the risk of losing important elements of their ICH, while young people find it difficult to maintain the connection with the cultural heritage treasured by their elders. In this paper, we present a novel holistic approach for the safeguarding and transmission of ICH that goes beyond the mere digitization of ICH content. Based on multisensory technology for the capturing of ICH, the proposed approach enables the generation of completely novel cultural content. High-level semantics are extracted from the acquired data …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:Np1obAXpBq8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Building detection using enhanced HOG–LBP features and region refinement processes",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7563843/",
            "Abstract": "Building detection from two-dimensional high-resolution satellite images is a computer vision, photogrammetry, and remote sensing task that has arisen in the last decades with the advances in sensors technology and can be utilized in several applications that require the creation of urban maps or the study of urban changes. However, the variety of irrelevant objects that appear in an urban environment and resemble buildings, and the significant variations in the shape and generally the appearance of buildings render building detection a quite demanding task. As a result, automated methods that can robustly detect buildings in satellite images are necessary. To this end, we propose a building detection method that consists of two modules. The first module is a feature detector that extracts histograms of oriented gradients (HOG) and local binary patterns (LBP) from image regions. Using a novel approach, a …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:LzOrNEA7mwcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automated detection and classification of nuclei in pax5 and H&E-stained tissue sections of follicular lymphoma",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11760-016-0913-6.pdf",
            "Abstract": "In this paper, we propose a novel framework for the detection and classification of centroblasts (CB) in follicular lymphoma (FL) tissue samples stained with PAX5 and H&E stains and sliced at 1 m thickness level. By employing PAX5 immunohistochemistry, we facilitate the segmentation of nuclei, while the use of H&E stain enables us to extract textural information related to histological characteristics used by pathologists in the diagnosis of FL grading. For the segmentation of nuclei in PAX5-stained images, we initially apply an energy minimization technique based on graph cuts and then we propose a novel algorithm for the separation of overlapped nuclei inspired by the clustering of large-scale visual vocabularies. The morphological characteristics of nuclei extracted from PAX5-stained images are combined with a number of textural characteristics identified in H&E images through a Bayesian network …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:f13iAvnbnnYC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Traffic Monitoring using Multiple Cameras, Homographies and Multi-Hypothesis Tracking",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4379480/",
            "Abstract": "This paper aims to present an intelligent system for tracking moving objects (such as vehicles, persons etc) based on a network of autonomous tracking units that capture and process images from one or more pre-calibrated visual sensors. The proposed system, which has been developed within the framework of TRAVIS (TRAffic VISual monitoring) project, is flexible, scalable and can be applied in a broad field of applications in the future. By the end of the project, two prototypes will be developed, each focusing on different traffic monitoring applications, such as the traffic control of aircraft parking areas at airports and tunnels at highways. First experimental results of the proposed system using two different data fusion techniques are also presented in the paper.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Aircraft detection and tracking using intelligent cameras",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1530125/",
            "Abstract": "Systems that provide ground movement management at airports, maintaining ground safety and increasing air traffic capacity, are called A-SMGCS (advanced surface movement guidance and control systems). However, common A-SMGCS systems, based on surface movement radars (SMR), are affected by limitations in their coverage due to reflections or shadows from objects on the airport surface. Hence, the use of a complementary system is necessary to act as a \"gap-filler\", i.e. to provide accurate ground movement information for these problematic areas. This paper aims to present a novel cost-effective video-based system to act as a \"gap-filler\" for existing A-SMGCS systems. The proposed system consists of a network of intelligent digital cameras, which are able to detect the presence of an aircraft or vehicle in specific locations within their fields of view, and then provide this information to a multiple …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel neural network technique for the detection of human faces in visual scenes",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/902391/",
            "Abstract": "This paper presents a user interactive system that manages, with minimum user interaction, to locate a set of characteristic feature points in the frontal view of a person's face. Our method is user adaptive and is implemented as a combination of a classification-based facial region extraction technique with a transition based facial feature extraction method. First, we allow the system to be trained to recognize image blocks belonging to the facial area by proper training of a feedforward neural network. Then, we initialize the feature detection algorithm with a blink of the user's eyes, which localizes the exact contours of the eyes. Finally, we locate the remaining facial features (face contour, eyebrows, mouth and nose) by adaptively thresholding the facial area and utilizing knowledge of the geometrical structure of the face.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "5D modelling: an efficient approach for creating spatiotemporal predictive 3D maps of large-scale cultural resources",
            "Publication year": 2015,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13904",
            "Abstract": "Outdoor large-scale cultural sites are mostly sensitive to environmental, natural and human made factors, implying an imminent need for a spatio-temporal assessment to identify regions of potential cultural interest (material degradation, structuring, conservation). On the other hand, in Cultural Heritage research quite different actors are involved (archaeologists, curators, conservators, simple users) each of diverse needs. All these statements advocate that a 5D modelling (3D geometry plus time plus levels of details) is ideally required for preservation and assessment of outdoor large scale cultural sites, which is currently implemented as a simple aggregation of 3D digital models at different time and levels of details. The main bottleneck of such an approach is its complexity, making 5D modelling impossible to be validated in real life conditions. In this paper, a cost effective and affordable framework for 5D modelling is proposed based on a spatial-temporal dependent aggregation of 3D digital models, by incorporating a predictive assessment procedure to indicate which regions (surfaces) of an object should be reconstructed at higher levels of details at next time instances and which at lower ones. In this way, dynamic change history maps are created, indicating spatial probabilities of regions needed further 3D modelling at forthcoming instances. Using these maps, predictive assessment can be made, that is, to localize surfaces within the objects where a high accuracy reconstruction process needs to be activated at the forthcoming time instances. The proposed 5D Digital Cultural Heritage Model (5D-DCHM) is implemented using open …",
            "Abstract entirety": 0,
            "Author pub id": "PIKpPjoAAAAJ:JoHZYnTS1h4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improved 3D video synthesis combining graph cuts and chroma key technology",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5506214/",
            "Abstract": "Depth information is essential for 3DTV applications, as it is used for rendering in many modern 3D displays. In this paper, we propose a new approach for 3DTV content synthesis, by integrating an existing state-of-the-art MRF-based disparity estimation method with additional pre- and post-processing steps. The key of the proposed method is the decomposition of the scene in foreground and background. To this end, chroma key technology is used to facilitate the detection of foreground objects and to significantly improve depth estimation for these objects. Then, we can combine the foreground objects with any background, for both color images and depth maps, to generate a new representation of the scene. Experimental results have shown that the proposed approach can produce satisfactory depth maps with improved silhouettes for foreground objects and a stable background for all the frames of the sequence.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generation of Personalized MPEG-4 compliant talking heads",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Nikos-Sarris-2/publication/229000588_Generation_of_Personalized_MPEG-4_compliant_talking_heads/links/02e7e516d6d438d1ba000000/Generation-of-Personalized-MPEG-4-compliant-talking-heads.pdf",
            "Abstract": "This paper studies a new method for three-dimensional (3D) facial model adaptation and its integration into a Text-to-Speech (TTS) system. The TTS System pronounces, in real time, English or Greek speech and simultaneously animates the adapted face model, thus simulating a natural talking face. The 3D facial adaptation requires a set of two orthogonal views of the user’s face with a number of feature points located on both views. Based on the correspondences of the feature points’ positions a generic face model is deformed non-rigidly treating every facial part (ie nose, mouth, etc) as a separate entity. A cylindrical texture map is then built from the two image views covering the whole area of the head by exploiting the inherent face symmetry. The result is a complete, textured model of a specific person’s head. The generated 3-D models are then integrated into a talking head system, which consists of two distinct parts: a multi-lingual Text To Speech sub-system and a Facial Animation sub-system based on MPEG-4 Facial Animation Parameters (FAPs). Support for the Greek language has been added to both the TTS and the facial animation sub-system while preserving lip and speech synchronization.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Actual date of delivery 1 June 2004 Deliverable number D33",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=7939773606413121283&hl=en&oi=scholarr",
            "Abstract": "This document describes the multimodal system, which was developed in SPIIRAS, for assistance to people with disabilities of hands. It combines automatic speech recognition and head tracking in joint multimodal system. The structure of the system, used methods for recognition and tracking, information fusion and synchronization, obtained results and testing conditions are described. The developed system is applied for hands-free operation for Graphical User Interface in such common tasks as Internet communication and text editing in MS Word.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated visual traffic monitoring and surveillance through a network of distributed units",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.640.8884&rep=rep1&type=pdf",
            "Abstract": "This work aims to present an intelligent system for tracking moving targets (such as vehicles, persons etc) based on a network of distributed autonomous units that capture and process images from one or more pre-calibrated visual sensors. The proposed system, which has been developed within the framework of TRAVIS (TRAffic VISual monitoring) project, is flexible, scalable and can be applied in a broad field of applications. Two different pilot installations have been installed for initial evaluation and testing, one for traffic control of aircraft parking areas and one for tunnels at highways. Various computer vision techniques which were implemented and tested during the development of the project, are described and analysed. Multiple background extraction and data fusion algorithms are comparatively evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "PIKpPjoAAAAJ:yD5IFk8b50cC",
            "Publisher": "Citeseer"
        }
    ]
}]