[{
    "name": "Ξενοφών  Ζαμπούλης",
    "romanize name": "Xenofon  Zampoulis",
    "School-Department": "Ινστιτούτο Πληροφορικής",
    "University": "forth",
    "Rank": "Κύριος Ερευνητής",
    "Apella_id": 17927,
    "Scholar name": "Xenophon Zabulis",
    "Scholar id": "mT6JlBIAAAAJ",
    "Affiliation": "Researcher, Foundation of Research and Technology",
    "Citedby": 2955,
    "Interests": [
        "Computer Vision"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=mT6JlBIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Synchronous image acquisition based on network synchronization",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1640615/",
            "Abstract": "In this paper, a software-based system for the real-time synchronization of images captured by a low-cost camera framework is presented. It is most well suited for cases where special hardware cannot be utilized (e.g. remote or wireless applications) and when cost efficiency is critical. The proposed method utilizes messages to establish a consensus on the time of image acquisition and NTP synchronization of computer clocks. It also provides with an error signal, in case of failure of the synchronization. The evaluation of the proposed algorithm using a precise LED array system (1ms accuracy) proves the effectiveness of this method.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D reconstruction for a cultural heritage virtual tour system",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/30825742/isprs08.pdf",
            "Abstract": "Y. Bastanlar a,*, N. Grammalidisb, X. Zabulisc, E. Yilmaz a, Y. Yardimci a, G. Triantafyllidisb a Informatics Institute, Middle East Technical University, Ankara, Turkey-(yalinb, eyilmaz, yardimy)@ ii. metu. edu. tr b Informatics and Telematics Institute, CERTH, Thessaloniki, Greece-(ngramm, gatrian)@ iti. gr c Foundation for Research and Technology-Hellas, Inst. of Computer Science, Heraklion, Greecezabulis@ ics. forth. gr",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The book of Ellie: An interactive book for teaching the alphabet to children",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6618341/",
            "Abstract": "Augmented Reality environments have shown to be relevant and valuable in many instances of the educational process. Accounting for the advantages and conventional gains of learning through physical books and printed matter in gen-eral, this paper presents an approach towards augmenting both such media. This work has elementary school as a con-text and presents an approach towards augmenting a physi-cal book and associated learning cards, with the purpose of providing a playful approach to learning the alphabet. The two principal activities involved in studying from an ele-mentary school book are augmented: learning, during which the student receives information about letters, phonemes, and words, and practicing where questions are asked to the young student in order to consolidate the recently acquired knowledge. The proposed implementation is evaluated ini-tially as to its performance and …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Novelty Detection for Person Re-identification in an Open World.",
            "Publication year": 2019,
            "Publication url": "https://www.scitepress.org/Papers/2019/73683/73683.pdf",
            "Abstract": "A fundamental assumption in most contemporary person re-identification research, is that all query persons that need to be re-identified belong to a closed gallery of known persons, ie, they have been observed and a representation of their appearance is available. For several real-world applications, this closed-world assumption does not hold, as image queries may contain people that the re-identification system has never observed before. In this work, we remove this constraining assumption. To do so, we introduce a novelty detection mechanism that decides whether a person in a query image exists in the gallery. The re-identification of persons existing in the gallery is easily achieved based on the persons representation employed by the novelty detection mechanism. The proposed method operates on a hybrid person descriptor that consists of both supervised (learnt) and unsupervised (hand-crafted) components. A series of experiments on public, state of the art datasets and in comparison with state of the art methods shows that the proposed approach is very accurate in identifying persons that have not been observed before and that this has a positive impact on re-identification accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Representation and preservation of Heritage Crafts",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/642416",
            "Abstract": "This work regards the digital representation of tangible and intangible dimensions of heritage crafts, towards craft preservation. Based on state-of-the-art digital documentation, knowledge representation and narrative creation approach are presented. Craft presentation methods that use the represented content to provide accurate, intuitive, engaging, and educational ways for HC presentation and appreciation are proposed. The proposed methods aim to contribute to HC preservation, by adding value to the cultural visit, before, and after it. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:_Ybze24A_UAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Stereo-based environment scanning for immersive telepresence",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1273541/",
            "Abstract": "The processing power and network bandwidth required for true immersive telepresence applications are only now beginning to be available. We draw from our experience developing stereo based tele-immersion prototypes to present the main issues arising when building these systems. Tele-immersion is a new medium that enables a user to share a virtual space with remote participants. The user is immersed in a rendered three-dimensional (3-D) world that is transmitted from a remote site. To acquire this 3-D description, we apply binocular and trinocular stereo techniques which provide a view-independent scene description. Slow processing cycles or long network latencies interfere with the users' ability to communicate, so the dense stereo range data must be computed and transmitted at high frame rates. Moreover, reconstructed 3-D views of the remote scene must be as accurate as possible to achieve a …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A steerable multitouch display for surface computing and its evaluation",
            "Publication year": 2013,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213013600166",
            "Abstract": "In this paper, a steerable, interactive projection display that has the shape of a disk is presented. Interactivity is provided through sensitivity to the contact of multiple fingertips and is achieved through the use of a RGBD camera. The surface is mounted on two gimbals which, in turn, provide two rotational degrees of freedom. Modulation of surface posture supports the ergonomy of the device but can be, alternatively, used as a means of user-interface input. The geometry for mapping visual content and localizing fingertip contacts upon this steerable display is provided, along with pertinent calibration methods for the proposed system. An accurate technique for touch detection is proposed, while touch detection and projection accuracy issues are studied and evaluated through extensive experimentation. Most importantly, the system is thoroughly evaluated as to its usability, through a pilot application that was …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:ZHo1McVdvXMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Vision-based 3D motion reconstruction of octopus arm swimming and comparison with an 8-arm underwater robot",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7139340/",
            "Abstract": "The octopus uses the arm-swimming behavior primarily for escape, defense, or foraging. This mode of locomotion is comprised of two strokes, with the arms opening slowly and closing rapidly, and generally results in considerable propulsive acceleration. In light of the recent development by our group of an octopus-like eight-arm underwater robot, we are interested to analyze the details of the biological arm swimming motion, in order to understand its kinematics. In this paper, we address methodological aspects of the 3D reconstruction process of octopus arm trajectories, based on computer vision, and present the resulting arm swimming movement of a benthic common octopus. The 3D trajectories of all eight octopus arms were tracked and analyzed, providing information about speed, acceleration and arm elongation. The animal's performance is then used for a direct comparison with our 8-arm robotic swimmer …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "1st international ACM workshop on user experience in e-learning and augmented technologies in education",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2393347.2396546",
            "Abstract": "UXeLATE2012 is the 1st International ACM Workshop on User Experience in e-Learning and Augmented Technologies in Education in conjunction with the ACM International Multimedia Conference (MM'12) at Nara, Japan. The workshop has a half day program, with a selection of six papers, and one keynote talk of a recognized expert in the field of usability, mobile technology and education.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "[PP. 19.28] DETECTION OF RETINAL MICROVASCULAR ALTERATIONS IN RHEUMATOID ARTHRITIS PATIENTS WITHOUT CARDIOVASCULAR DISEASES",
            "Publication year": 2017,
            "Publication url": "https://journals.lww.com/jhypertension/Abstract/2017/09002/_PP_19_28__DETECTION_OF_RETINAL_MICROVASCULAR.735.aspx",
            "Abstract": "Objective:Quantitative evaluation of the retinal vasculature using the non-mydriatic fundus camera is gaining increasing attention as an early, subclinical indicator of cardiovascular risk. Subtle alterations of the retinal vessels have been consistently observed in populations with cardiovascular diseases. However, it has not been investigated whether the retinal microvasculature is affected in patients with autoimmune rheumatic diseases, who are typically perceived as a high-cardiovascular risk population, in the absence of established cardiovascular disease.Design and method:Consecutive patients with rheumatoid arthritis were recruited from the Rheumatology Outpatient Unit of our Department and were matched with healthy, nontreated volunteers for the purposes of the study. Patients were free from cardiovascular comorbidities including high blood pressure, diabetes mellitus, heart diseases and stroke. All …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:XiVPGOgt02cC",
            "Publisher": "LWW"
        },
        {
            "Title": "Building a Multi-Touch Display Based on Computer Vision Techniques.",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.443.8593&rep=rep1&type=pdf",
            "Abstract": "We present the development of a multi-touch display based on computer vision techniques. The developed system is built upon low cost, off-the-shelf hardware components and a careful selection of computer vision techniques. The resulting system is capable of detecting and tracking several objects that may move freely on the surface of a wide projection screen. It also provides additional information regarding the detected and tracked objects, such as their orientation, their full contour, etc. All of the above are achieved robustly, in real time and regardless of the visual appearance of what may be independently projected on the projection screen. We also present indicative results from the exploitation of the developed system in three application scenarios and discuss directions for further research.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiview 3D pose estimation of a wand for human-computer interaction",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-24031-7_11",
            "Abstract": "A method is proposed that visually estimates the 3D pose and endpoints of a thin cylindrical physical object, such as a wand, a baton, or a stylus, that is manipulated by a user. The method utilizes multiple synchronous images of the object to cover wide spatial ranges, increase accuracy and deal with occlusions. Experiments demonstrate that the method can be applied in real-time using modest and conventional hardware and that the outcome suits the purposes of employing the approach for human computer interaction.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Dermal capillary rarefaction as a marker of microvascular damage in patients with rheumatoid arthritis: association with inflammation and disorders of the macrocirculation",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/micc.12451",
            "Abstract": "Capillary rarefaction is observed in various cardiovascular diseases, yet it remains understudied in RA, a chronic inflammatory disease accompanied by excess cardiovascular risk. We quantified capillary density in RA patients and explored potential associations with macrocirculatory disorders, inflammation, and cardiovascular risk.Dermal capillary density was assessed with nailfold capillaroscopy in RA and non‐RA individuals, using specifically designed semiautomated software. Macrocirculation assessments included large artery stiffening, evaluated with PWV, and myocardial blood flow, calculated as cardiac index from impedance cardiography. Cardiovascular risk score was estimated from the Framingham Heart Study.The number of capillaries per visual field was lower in patients (n = 99) compared to controls (n = 35) (132.6 ± 30.3 vs 152.9 ± 25.2, P = .001). In the RA group …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A low-cost contactless overhead micrometer surface scanner",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1179878",
            "Abstract": " Contactless and high-resolution scanning of planar surfaces find application in several disciplines that involve sensitive or deformable samples, such as the study and conservation of heritage objects, textiles, documents, and paintings. Off-the-shelf solutions come at a high cost. In this work, an approach to contactless, high-resolution scanning of planar surfaces is proposed that is relevant to several applications. The implementation of this approach exhibits reduced hardware cost, is based on open designs, and can be replicated with ease. The design and implementation of a contactless scanner and its software are proposed. The scanner regards the photographic digitization of planar and approximately planar surfaces and is proposed as a cost-efficient alternative to off-the-shelf solutions. The result is 19.8 Kppi micrometer scans, in the service of several applications. Accurate surface mosaics are obtained based on a novel image acquisition and image registration approach that actively seeks registration cues by acquiring auxiliary images and fusing proprioceptive data in correspondence and registration tasks. The device and operating software are explained, provided as an open prototype, and evaluated qualitatively and quantitatively.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:z_wVstp3MssC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Scale Summarized and Focused Browsing of",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=aw1uCQAAQBAJ&oi=fnd&pg=PA269&dq=info:m41zVq1OubUJ:scholar.google.com&ots=Qg8Mfh996l&sig=29-Zey68Z4WxoZMv3kO7iKA8ZXg",
            "Abstract": "A study of local scale in images demonstrates that image features reside in different scales. Based on this observation a framework for the classification of features with respect to scale is proposed, lin-early combining the visual impression of features at different scales. The proposed framework and a derived methodology are applied to typical feature extraction tasks, and in the generic case of estimating multiple scale feature distributions, as a tool for the identification of images of similar visual content. A possible formulation of queries for retrieving images by primitive visual content, taking scale into account, is also dis-cussed.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Unsupervised Domain Adaptation for Person Re-Identification with Few and Unlabeled Target Data",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-64559-5_28",
            "Abstract": "Existing, fully supervised methods for person re-identification (ReID) require annotated data acquired in the target domain in which the method is expected to operate. This includes the IDs as well as images of persons in that domain. This is an obstacle in the deployment of ReID methods in novel settings. For solving this problem, semi-supervised or even unsupervised ReID methods have been proposed. Still, due to their assumptions and operational requirements, such methods are not easily deployable and/or prove less performant to novel domains/settings, especially those related to small person galleries. In this paper, we propose a novel approach for person ReID that alleviates these problems. This is achieved by proposing a completely unsupervised method for fine tuning the ReID performance of models learned in prior, auxiliary domains, to new, completely different ones. The proposed model …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Head pose estimation on depth data based on particle swarm optimization",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6239236/",
            "Abstract": "We propose a method for human head pose estimation based on images acquired by a depth camera. During an initialization phase, a reference depth image of a human subject is obtained. At run time, the method searches the 6-dimensional pose space to find a pose from which the head appears identical to the reference view. This search is formulated as an optimization problem whose objective function quantifies the discrepancy of the depth measurements between the hypothesized views to the reference view. The method is demonstrated in several data sets including ones with known ground truth and comparatively evaluated with respect to state of the art methods. The obtained experimental results show that the proposed method outperforms existing methods in accuracy and tolerance to occlusions. Additionally, compared to the state of the art, it handles head pose estimation in a wider range of head poses.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital Heritage Technology at the Archaeological Museum of Heraklion",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-92285-0_28",
            "Abstract": " This paper presents an Ambient Intelligence infrastructure that fuses state-of-the-art technologies and related applications with digital cultural resources to deliver interactive and immersive user encounters through on-site Virtual Exhibitions (VEs) which respond to the demands of ‘new museology’. The practical exploitation of the concept is presented through the reformation of the exhibition spaces of the Archaeological Museum of Heraklion which is one of the most important Greek museums hosting representative artefacts from all the periods of Cretan prehistory and ancient history, covering a chronological span of over 5,500 years from the Neolithic period to Roman times. ",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Retinal vessel morphology in rheumatoid arthritis: Association with systemic inflammation, subclinical atherosclerosis, and cardiovascular risk",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/micc.12417",
            "Abstract": "Quantification of retinal vessel morphology has emerged as a marker of cardiovascular health. We examined retinal microvascular diameters in RA, particularly in regard to systemic inflammation, subclinical atherosclerosis, and cardiovascular risk.Retinal images from RA patients and controls were processed using computerized software, to obtain CRAE and CRVE and AVR. Subclinical atherosclerosis was assessed with cIMT, and 10‐year risk of general cardiovascular disease was calculated.Both CRAE (78.8 ± 8.9 vs 90.2 ± 9.9 μm, P < .001) and AVR (0.69 ± 0.09 vs 0.81 ± 0.09, P < .001) were decreased in RA patients (n = 87) compared to controls (n = 46), whereas CRVE did not differ. Among RA patients, CRAE and AVR were inversely associated with both cIMT and CRP, whereas CRVE positively correlated with CRP (P < .05 for all). CRAE additionally correlated with …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Endoscopic capsule line-of-sight alignment by visual servoing",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Xenophon-Zabulis/publication/260319183_Endoscopic_capsule_line-of-sight_alignment_by_visual_servoing/links/0f317530f5b01151a0000000/Endoscopic-capsule-line-of-sight-alignment-by-visual-servoing.pdf",
            "Abstract": "Current research in capsule endoscopy is aimed at endowing these devices with means of active locomotion inside the gastrointestinal tract (GIT), as opposed to the present practice of passive propulsion by peristalsis. As this will entail that the physician performing the examination will also be involved in actively steering the capsule through the GIT, it is desirable that certain potentially cumbersome aspects of this task, such as traversing long segments of the intestine, are (semi-) automated. To this end, our group has been investigating the use of visual information, obtained by the real-time analysis of the images acquired from the capsule's on-board camera, for implementing appropriate such automated behaviours through visual servoing [1-3] techniques. The above concepts are demonstrated here by simulations of a visual servoing scheme for navigating the capsule by aligning its line-of-sight with the GIT, as it is propelled forward, based on the detection of the intestinal lumen in the acquired images. Active locomotion of the capsule is attained by two onboard vibratory motors, generating propulsive and steering forces for planar movement.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dyslipidemia and capillary rarefaction. A new relationship?",
            "Publication year": 2015,
            "Publication url": "https://www.atherosclerosis-journal.com/article/S0021-9150(15)00465-7/abstract",
            "Abstract": "Aim: Dyslipidemia is a well-established cardiovascular risk factor bearing a strong and indisputable correlation with cardiovascular morbidity and mortality. Capillary rarefaction, on the other hand, represents a forthcoming promising but rather understudied estimate of microvascular impairment in cardiovascular diseases. The aim of this study was to investigate the association between the lipid profile and capillaroscopy findings of the skin, in a population of normotensive individuals and hypertensive patients.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Increasing the accuracy of the space-sweeping approach to stereo reconstruction, using spherical backprojection surfaces",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4107192/",
            "Abstract": "In this paper, interest is focused on the accurate and time-efficient stereo reconstruction, for the purpose of generating 3D animated scenes from multiple synchronized videos. The plane-sweeping approach is reviewed as relevant to the goal of time-efficiency, since its execution can be optimized on a GPU. A method compatible for optimization on the GPU is proposed as a more accurate alternative to plane sweeping and to the derived visibility computation. The method is compared to plane sweeping as to its accuracy, by evaluating the backprojected 3D model against independent views and using n-fold cross validation to estimate the peak signal to noise ratio (PSNR). Finally, the method's output is casted integratable with multicamera stereo reconstruction frameworks.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tracking persons using a network of RGBD cameras",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2674396.2674467",
            "Abstract": "A computer vision system that employs an RGBD camera network to track multiple humans is presented. The acquired views are used to volumetrically and photometrically reconstruct and track the humans robustly and in real time. Given the frequent and accurate monitoring of humans in space and time, their locations and walk-through trajectory can be robustly tracked in real-time.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Augmenting Printed Documents",
            "Publication year": 2025,
            "Publication url": "https://ercim-news.ercim.eu/images/stories/EN103/EN103-web.pdf#page=24",
            "Abstract": "Figure 1: User interaction with augmented printed documents. Main: the system highlights regions of potential user interest; upon user touch, relevant content is augmented, juxtaposed to the document. Thumbnails: multimedia augmentation in a music and poetry book (left), map augmentation providing city tour information on the printed map (middle) and visitor information (right).",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An image analysis system for the assessment of retinal microcirculation in hypertension and its clinical evaluation",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-00846-2_82",
            "Abstract": "A system for the assessment of hypertension through the measurement of retinal vessels in fundoscopy images, is presented. The proposed approach employs multiple image analysis methods, in an integrated system that is used in clinical practice. Automating the measurement process enables the conduct of a clinical study that, for the first time, shows the correlation between macrovascular and microvascular alterations, based on numerous measurements acquired by this system. Experience and perspectives gained from clinical usage and evaluation are reported.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Scene representation technologies for 3DTV—A survey",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4373314/",
            "Abstract": "3-D scene representation is utilized during scene extraction, modeling, transmission and display stages of a 3DTV framework. To this end, different representation technologies are proposed to fulfill the requirements of 3DTV paradigm. Dense point-based methods are appropriate for free-view 3DTV applications, since they can generate novel views easily. As surface representations, polygonal meshes are quite popular due to their generality and current hardware support. Unfortunately, there is no inherent smoothness in their description and the resulting renderings may contain unrealistic artifacts. NURBS surfaces have embedded smoothness and efficient tools for editing and animation, but they are more suitable for synthetic content. Smooth subdivision surfaces, which offer a good compromise between polygonal meshes and NURBS surfaces, require sophisticated geometry modeling tools and are usually …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pervasive Computing@ ICS-FORTH",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/3458447/w3-01.pdf",
            "Abstract": "This paper introduces the Ambient Intelligence (AmI) Programme of the Institute of Computer Science of the Foundation for Research and Technology–Hellas (ICS-FORTH). In this context, a laboratory space of about 100m2 comprising six rooms, called the “AmI Sandbox”, has been created. In this space several AmI technologies have already been installed and related R&D activities are being conducted. In addition to that, a large-scale Ambient Intelligence Facility is currently being built. The facility will occupy a threefloor 3,000 m2 building, comprising simulated AmI-augmented environments and their support spaces, laboratory spaces for developing and testing related technologies, staff offices and public spaces.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Augmenting physical books towards education enhancement",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6530807/",
            "Abstract": "This paper presents an interactive desk that augments physical books that are placed upon its surface with multimedia content and interactive applications. Such content is dynamically displayed in augmentation to the currently open page of the book, that is, aligned in realtime with its 2D orientation upon the desk. The rendered applications are controlled by the users with the use of a stylus, both through contact with the book or desk, as well as, through a small vocabulary of gestures performed with the stylus. The evaluation of the accuracy, robustness, and performance of the proposed computer vision modules supporting this interaction are reported through quantitative experiments. In addition, the system usability was validated and the suitability of educational applications was explored through pilot applications, which include music and digital animation on pages, content-based multimedia presentation, context …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bop: Benchmark for 6d object pose estimation",
            "Publication year": 2018,
            "Publication url": "http://openaccess.thecvf.com/content_ECCV_2018/html/Tomas_Hodan_PESTO_6D_Object_ECCV_2018_paper.html",
            "Abstract": "We propose a benchmark for 6D pose estimation of a rigid object from a single RGB-D input image. The training data consists of a texture-mapped 3D object model or images of the object in known 6D poses. The benchmark comprises of: i) eight datasets in a unified format that cover different practical scenarios, including two new datasets focusing on varying lighting conditions, ii) an evaluation methodology with a pose-error function that deals with pose ambiguities, iii) a comprehensive evaluation of 15 diverse recent methods that captures the status quo of the field, and iv) an online evaluation system that is open for continuous submission of new results. The evaluation shows that methods based on point-pair features currently perform best, outperforming template matching methods, learning-based methods and methods based on 3D local features. The project website is available at bop. felk. cvut. cz.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-camera reconstruction based on surface normal estimation and best viewpoint selection",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1335388/",
            "Abstract": "We present a new algorithm for reconstructing an environment from images recorded by multiple calibrated cameras. Multiple camera systems challenge traditional stereo algorithms in many issues including view registration, selection of commonly visible image parts for matching, and the fact that surfaces are imaged differently from different viewpoints and poses. On the other hand, multiple cameras have the advantage of revealing surfaces at occluding contours and covering wide areas. The presented algorithm makes no assumption on camera loci and outputs an occupancy voxel grid, with occupied voxels being accompanied by a surface normal. It is correlation-based, however, outperforms the conventional correlation-based approach in reconstruction quality. It is highly parallelizable, and most importantly, is robust against artifacts due to camera registration errors that are typically encountered when using …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An image analysis framework for the early assessment of hypertensive retinopathy signs",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6150311/",
            "Abstract": "This paper presents a framework for the detection and measurement of retinal vessels in fundoscopy images. The proposed method segments retinal vessels, enabling the actual measurement of the vessel diameter. A Graphical User Interface (GUI) further supports a number of methods for the automatic and interactive measurement of vessel diameters at any selected point or region of interest. In addition, it provides methods for editing the vessel representation in order to recover from possible segmentation misclassifications. All the above steps are integrated into a clinical application capable of supporting vascular risk stratification in persons with hypertension. The performance of the segmentation is assessed on two publicly available DRIVE and STARE datasets. The experimental results show that the method can achieve a high accuracy on both datasets with very low computational cost, being comparative or …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Association of urinary sodium excretion with vascular damage: a local kidney effect, rather than a marker of generalized vascular impairment",
            "Publication year": 2018,
            "Publication url": "https://www.hindawi.com/journals/ijhy/2018/7620563/",
            "Abstract": "Evidence suggests that increased salt consumption induces blood pressure- (BP) mediated organ damage, yet it remains unclear whether it reflects a generalized micro- and macrovascular malfunction independent of BP. We studied 197 newly diagnosed and never-treated individuals with hypertension, intermediate hypertensive phenotypes, and normal BP, classified by use of 24-hour ambulatory BP monitoring. Sodium excretion and microalbuminuria were estimated in 24-hour urine samples, dermal capillary density was estimated from capillaroscopy, and arterial stiffness was estimated with pulse wave velocity (PWV) and augmentation index (AIx). Sodium excretion correlated with microalbuminuria (p<0.001) and 24-hour and day- and nighttime systolic BP, but not with office blood pressure, arterial stiffness, or capillary density. In the multivariate analysis, the association with microalbuminuria was maintained (p=0.007). In a population free from the long-standing effects of hypertension, increased salt intake appears to be associated with early signs of vascular kidney damage, rather than a diffuse micro- and macrovascular impairment.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:ye4kPcJQO24C",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Foreground detection with a moving RGBD camera",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41914-0_22",
            "Abstract": "A method for foreground detection in data acquired by a moving RGBD camera is proposed. The background scene is initially in a reference model. An initial estimation of camera motion is provided by a conventional point cloud registration approach of matched keypoints between the captured scene and the reference model. This initial solution is then refined based on a top-down, model based approach that evaluates candidate camera poses in a Particle Swarm Optimization framework. To evaluate a candidate pose, the method renders color and depth images of the model according to this pose and computes a dissimilarity score of the rendered images to the currently captured ones. This score is based on the direct comparison of color, depth, and surface geometry between the acquired and rendered images, while allowing for outliers due to the potential occurrence of foreground objects, or newly …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Plane Surface Detection and Reconstruction using Induced Stereo Symmetry",
            "Publication year": 2011,
            "Publication url": "https://orbilu.uni.lu/handle/10993/17504",
            "Abstract": "Plane Surface Detection and Reconstruction using Induced Stereo Symmetry - Goncalves Almeida \nAntunes Michel Open Repository and Bibliography Login Home Help? EN FR University of \nLuxembourg Library You are here: ORBi lu Detailled reference Reference : Plane Surface \nDetection and Reconstruction using Induced Stereo Symmetry Document type : Scientific \ncongresses, symposiums and conference proceedings : Paper published in a book Discipline(s) : \nEngineering, computing & technology : Computer science To cite this reference: \nhttp://hdl.handle.net/10993/17504 Title : Plane Surface Detection and Reconstruction using \nInduced Stereo Symmetry Language : English Author, co-author : Goncalves Almeida Antunes, \nMichel mailto [Institute of Systems and Robotics > Department of Electrical and Computer \nEngineering > University of Coimbra - Portugal] Barreto, João Pedro mailto [Institute of Systems and …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multispectral Imaging for the Analysis of Cultural Heritage Objects and Image Registration for Results Optimisation.",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=11574427223904086136&hl=en&oi=scholarr",
            "Abstract": "Multispectral imaging and spectroscopic analysis are valuable tools for the study of materials of cultural heritage objects. Accurate registration of spectral images into a spectral cube increases the precision and quality of spectral measurements, supporting portable and low cost multispectral imaging systems. camera, a filter wheel able to interchange 28 filter and replaceable cmount lens. The sensor, in combination with the band-pass filters, allows sensitivity to the UV region (350 nm up to 400 nm, BP10nm), to the visible (400 nm-700 nm, BP25nm) and to the Near IR region (700 nm-1200 nm, BP50nm). The final 3D spectral cube can have maximum dimensions of 2560× 2048× 28 data points.The portability of the system introduces possible camera pose changes and vibrations during the acquisition, which in turn are evident as translation shifts and even rotations between the different spectral images. In addition, the versatility of the system and the properties of the optical elements occasionally introduce the need for refocusing and thereby slight changes in the focal distance and consequently in the field of view.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Model-based visual tracking of orbiting satellites using edges",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8206228/",
            "Abstract": "Estimating the pose of orbiting satellites is a key prerequisite for supporting autonomous proximity operations in space. This work presents a monocular 3D tracking algorithm that tracks edges with the aid of an arbitrary 3D mesh model assumed to capture a satellite's shape. The proposed tracker propagates a pose hypothesis between successive frames, using it first to render a depth image and then refining it according to partial matches established between depth and intensity edges. Edge matching relies on fast, local 1D searches along the depth gradient direction. The tracker does not require any pre-processing of the 3D model nor does it make any assumptions regarding its characteristics, as is often the case for other approaches. It is also robust to parts of the tracked satellite being out of view, occluded, shadowed or visually undetected. Experimental results evaluating the accuracy of the tracker and …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient, precise, and accurate utilization of the uniqueness constraint in multi-view stereo",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4155720/",
            "Abstract": "In this paper, the depth cue due to the assumption of texture uniqueness is reviewed. The spatial direction over which a similarity measure is optimized, in order to establish a stereo correspondence, is considered and methods to increase the precision and accuracy of stereo reconstructions are presented. An efficient implementation of the above methods is offered, based on optimizations that evaluate potential correspondences hierarchically, in the spatial and angular dimensions. Furthermore, the expansion of the above techniques in a multi-view framework where calibration errors cause the misregistration of individually obtained reconstructions are considered, and a treatment of the data is proposed for the elimination of duplicate reconstructions of a single surface point. Finally, a processing step is proposed for the increase of reconstruction precision and post-processing of the final result. The above …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3602: Turning an Ordinary Rotating Metal Disk into a Unique Interactive Exhibit",
            "Publication year": 2025,
            "Publication url": "https://ercim-news.ercim.eu/images/stories/EN103/EN103-web.pdf#page=15",
            "Abstract": "3602is an interactive system that allows exploration of digital representations of real artifacts through physical and multi-touch interaction with a double rotating gimbal (ie, a disk that the user can freely rotate around two axes). While the user manipulates the disk, the system uses a projector to augment a display upon it. User input is supported both through fingertip contact (ie, multi-touch) and disk rotation in both axes. In addition to the disk, a secondary projection surface is provided for additional information, upon which multi-touch gestures are supported.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transforming Heritage Crafts to Engaging Digital Experiences.",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3d7bDwAAQBAJ&oi=fnd&pg=PA244&dq=info:X99iQrdOPjsJ:scholar.google.com&ots=TK5VHahGoe&sig=y16LEUshtdZ4uFpICKr0lXC9iks",
            "Abstract": "Heritage Crafts (HCs) involve craft artefacts, materials, and tools and encompass craftsmanship as a form of Intangible Cultural Heritage. Intangible HC dimensions include dexterity, know-how, and skilled use of tools, as well as identity and traditions of the communities in which craftsmanship is, or was, practiced. HCs are part of history and have impact upon the economy of the areasin which they flourish. Despite their cultural significance, efforts towards HC digital representation and presentation are scattered. In this chapter, as a first step towards the Representation and Presentation of Heritage Crafts as cultural heritage (CH), pertinent requirements and needed technological components are investigated. Representation is expected to capture the wide spectrum of knowledge that a HC covers, from objects and their making, to hand gestures and tool uses that define craft motor skills, to the societal value, economic impact, and historical significance of HCs. Presentation is expected to address the need of exploiting Representation to conserve cultural resources, contribute to their accurate interpretation, provide essential and authentic experiences, as well as stimulate revenues of cultural resources through thematic tourism. This chapter lays the foundations and envisions the further development and formalisation of a suitable approach to HC representation and presentation in the form of a generic protocol that together with the appropriate technological tools can be applied to any HC instance.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Multicamera Vision System Supporting the Development of Wide-Area Exertainment Applications.",
            "Publication year": 2009,
            "Publication url": "https://www.ics.forth.gr/cvrl/publications/conferences/2009_05_mva_exertainment.pdf",
            "Abstract": "In this paper, the application of computer vision techniques to the localization of multiple persons in a relatively wide gaming terrain is presented. Multiple views are employed both for terrain coverage, but most importantly, for treatment of occlusions. Through the appropriate selection of lightweight operations and acceleration strategies, an adequate frame rate is achieved despite the large volume of input data. The resulting system is employed in the development of multiplayer entertainment applications, which are demonstrated and evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Perceptually relevant mechanisms for the description and retrieval of visual information",
            "Publication year": 2002,
            "Publication url": "https://www.ics.forth.gr/~zabulis/phd.pdf",
            "Abstract": "Ο µεγάλος όγκος και ποικιλοµορφία των ψηφιακών εικόνων που χρησιµοποιούνται σε διάφορα πεδία εφαρµογών έχουν αναδείξει την απαίτηση για τεχνικές αναζήτησης εικόνων µε βάση το περιεχόµενό τους. Συγκεκριµένα, υπάρχει µια αυξανόµενη ανάγκη για την ανάπτυξη αυτόµατων τεχνικών ανάλυσης και περιγραφής του περιεχοµένου των εικόνων µε σκοπό την αποδοτική ανάκλησή τους από µεγάλες συλλογές, µε βάση το περιεχόµενό τους. Στη διατριβή αυτή παρουσιάζονται και εξετάζονται µηχανισµοί για την περιγραφή και ανάκληση οπτικής πληροφορίας µε βάση ιδιότητες της αντίληψης, έχοντας ως κίνητρο τη βελτίωση της αντιστοίχισης µεταξύ των αποτελεσµάτων ανάκλησης εικόνων µε βάση το περιεχόµενό τους και των προσδοκιών των τελικών χρηστών.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D object pose refinement in range images",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-20904-3_25",
            "Abstract": "Estimating the pose of objects from range data is a problem of considerable practical importance for many vision applications. This paper presents an approach for accurate and efficient 3D pose estimation from 2.5D range images. Initialized with an approximate pose estimate, the proposed approach refines it so that it accurately accounts for an acquired range image. This is achieved by using a hypothesize-and-test scheme that combines Particle Swarm Optimization (PSO) and graphics-based rendering to minimize a cost function of object pose that quantifies the misalignment between the acquired and a hypothesized, rendered range image. Extensive experimental results demonstrate the superior performance of the approach compared to the Iterative Closest Point (ICP) algorithm that is commonly used for pose refinement.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:SP6oXDckpogC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Realistic Virtual Humans for Cultural Heritage Applications",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1340328",
            "Abstract": "Virtual Humans are becoming a commodity in computing technology and lately have been utilized in the context of interactive presentations in Virtual Cultural Heritage environments and exhibitions. To this end, this research work underlines the importance of aligning and fine-tuning Virtual Humans’ appearance to their roles and highlights the importance of affective components. Building realistic Virtual Humans was traditionally a great challenge requiring a professional motion capturing studio and heavy resources in 3D animation and design. In this paper, a workflow for their implementation is presented, based on current technological trends in wearable mocap systems and advancements in software technology for their implementation, animation, and visualization. The workflow starts from motion recording and segmentation to avatar implementation, retargeting, animation, lip synchronization, face morphing, and integration to a virtual or physical environment. The testing of the workflow occurs in a use case for the Mastic Museum of Chios and the implementation is validated both in a 3D virtual environment accessed through Virtual Reality and on-site at the museum through an Augmented Reality application. The findings, support the initial hypothesis through a formative evaluation, and lessons learned are transformed into a set of guidelines to support the replication of this work.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Multicamera tracking of multiple humans based on colored visual hulls",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6647982/",
            "Abstract": "Detecting, localizing and tracking humans within an industrial environment are three tasks which are of central importance towards achieving automation in workplaces and intelligent environments. This is because unobtrusive, real-time and reliable person tracking provides valuable input to solving problems such as workplace surveillance and event/activity recognition and, also, contributes to safety and optimized use of resources. This paper presents a passive approach to the problem of person tracking that is based on a network of conventional color cameras. The proposed approach exhibits robustness to challenging conditions that are encountered in industrial environments due to illumination artifacts, occlusions and the highly dynamic nature of the observed scenes. The multiple views of the environment that the system employs are used to obtain a volumetric representation of the humans within it, in real …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advances in 3DTV: Theory and Practice",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/42499820/579514-1.pdf",
            "Abstract": "Being a goal over decades, the extension of television, and visual communications in general, to the third dimension (3DTV) has been almost reached. Currently, 3D motion pictures are shown in theatres and the first 3D broadcasts are being planned to initiate in the next few years. Albeit the progress, state of the art has not yet reached the goal of acquiring a three-dimensional scene in full detail and creating a precise optical duplicate at remote site in real-time. Limitations in reconstruction accuracy and visual quality as well as user acceptance of pertinent technologies have, to date, prevented the creation of infrastructures for the delivery of 3D content to mass markets. Thereby, relevant scientific research is at the center of interest regarding the improvement of current 3DTV technologies. The goal of 3DTV involves the collaboration of researchers in multiple scientific disciplines as well as the integration of pertinent results, in order to provide end-users with a fully functional system. The tasks of “capture and representation of 3D scene information,”“representation of the digital 3DTV signal,”“storage and transmission of the digital 3DTV signal,” as well as “display of the reproduced 3D scene” constitute a chain of operations that are essential for reaching this goal. In this context, this special issue presents contributions along the whole chain of computational tasks that are required to implement 3DTV. In addition, the last two papers provide with contributions that go beyond the simple presentation of 3D visual data and propose ways of interacting with them.The paper “Multi-view shooting geometry for multiscopic rendering with controlled distortion …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:P5F9QuxV20EC",
            "Publisher": "Hindawi Publishing Corporation"
        },
        {
            "Title": "Ambient educational mini-games",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2254556.2254722",
            "Abstract": "This system paper describes two educational mini-games (a multiple-choice quiz and a geography-related game) that combine learning and ambient technology. Their innovative feature is that they offer physical interaction through printed cards on a tabletop setup, where a simple webcam monitors the table's surface and identifies the thrown cards. Following a brief discussion of ambient technology integration in the environment, the overall concept of these games is described and potential future improvements are outlined.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Model-based pose estimation for rigid objects",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39402-7_9",
            "Abstract": "Determining the pose of objects appearing in images is a problem encountered often in several practical applications. The most effective strategy for dealing with this challenge is to proceed according to the model-based paradigm, which involves building 3D models of objects and then determining object poses by fitting their models to new images with the aid of detected features. This paper proposes a model-based approach for estimating the full pose of known objects from natural point features. The method employs a projective imaging model and incorporates reliable automatic mechanisms for pose initialization and convergence. Furthermore, it is extendable to multiple cameras without the need to perform multi-view matching and relies on sparse structure from motion techniques for the construction of object models offline. Experimental results demonstrate its accuracy and robustness.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "High-performance embedded computing in space: Evaluation of platforms for vision-based navigation",
            "Publication year": 2018,
            "Publication url": "https://arc.aiaa.org/doi/abs/10.2514/1.I010555",
            "Abstract": "Vision-based navigation has become increasingly important in a variety of space applications for enhancing autonomy and dependability. Future missions, such as active debris removal for remediating the low Earth orbit environment, will rely on novel high-performance avionics to support advanced image processing algorithms with substantial workloads. However, when designing new avionics architectures, constraints relating to the use of electronics in space present great challenges, further exacerbated by the need for significantly faster processing compared to conventional space-grade central processing units. With the long-term goal of designing high-performance embedded computers for space, in this paper, an extended study and tradeoff analysis of a diverse set of computing platforms and architectures (i.e., central processing units, multicore digital signal processors, graphics processing units, and field …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:eMMeJKvmdy0C",
            "Publisher": "American Institute of Aeronautics and Astronautics"
        },
        {
            "Title": "Detection of densely dispersed spherical bubbles in digital images based on a template matching technique: Application to wet foams",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0927775707000210",
            "Abstract": "This work describes a, single-camera, bubble measurement system, which features a template-based detection method. The motivation for the proposed approach is the poor performance of conventional methods towards bubble and particle detection in dense dispersions. The, poor, performance of such conventional approaches is reviewed, demonstrated and explained. The proposed approach utilizes templates to increase robustness and an image scale-space to detect bubbles independently of their size. Furthermore, algorithmic optimizations for the proposed approach that target the reduction of computational complexity and user-intervention are proposed and compiled into a software application. This software is then tested in the determination of bubble size distribution in decaying wet foam.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "3D scene reconstruction based on robust camera motion estimation and space sweeping for a cultural heritage virtual tour system",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4547806/",
            "Abstract": "An efficient 3D reconstruction technique based on robust camera motion estimation and an improved version of the space-sweeping stereo reconstruction approach is presented. The proposed approach is focused on generation of usable and fully automatic reconstruction of wide-area scenes with the computational resources of a conventional PC. The aim is to use this technique to capture such scenes in 3D utilizing off-the-shelf equipment. Color information is finally added to the derived 3D model of the scene and the result can be converted to common 3D scene modeling formats. The 3D models are integrated with GIS technologies within a web-based virtual tour system.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Autonomous visual navigation for planetary exploration rovers",
            "Publication year": 2013,
            "Publication url": "https://ics.forth.gr/~zabulis/esa_2811305.pdf",
            "Abstract": "SPARTAN (SPAring Robotics Technologies for Autonomous Navigation) and its extension SEXTANT (Spartan EXTension Activity-Not Tendered) are two robotic exploration technology development activities funded by the European Space Agency (ESA). They target the development of computer vision algorithms for visual navigation that will be suitable for use by Martian rovers. This paper summarizes our on-going efforts in the context of SEXTANT for developing dependable and efficient solutions for two key ingredients of visual navigation, namely terrain mapping and localization.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and development of four prototype interactive edutainment exhibits for museums",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21666-4_20",
            "Abstract": "This paper describes the outcomes stemming from the work of a multidisciplinary R&D project of ICS-FORTH, aiming to explore and experiment with novel interactive museum exhibits, and to assess their utility, usability and potential impact. More specifically, four interactive systems are presented in this paper which have been integrated, tested and evaluated in a dedicated, appropriately designed, laboratory space. The paper also discusses key issues stemming from experience and observations in the course of qualitative evaluation sessions with a large number of participants.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:mB3voiENLucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Interactive city information point: your guide to Heraklion city",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-92285-0_29",
            "Abstract": " The Tourism Office of the city of Heraklion is a truly original facility that provides visitors with novel ways to access information through the use of modern technologies and innovative interactive systems developed by ICS-FORTH. This paper presents the innovative technologies employed at the tourist information office in order to enhance the information provision capacity of this type of facility in conjunction with traditional approaches, such as printed information material and human operated information provision. The info-point of Heraklion deploys a mixture of systems that augment the visiting experience while providing information through kinaesthetic interaction, Mixed Reality and play. ",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Project HIPNOS: Case study of high performance avionics for active debris removal in space",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7987544/",
            "Abstract": "The Clean Space initiative of the European Space Agency (ESA) seeks to decrease the environmental impact of space programmes by focusing, among others, on Active Debris Removal (ADR) and eDeorbit. In this direction, one of the main challenges is to autonomously track and approach a big non-cooperative satellite such as ENVISAT. To achieve the high level of autonomy required in this phase of the ADR mission, vision based navigation will guide a chaser spacecraft in real-time based on high-definition images acquired and processed on-board at high frame-rates. The increased complexity of these computer vision algorithms mandates the development and use of high performance avionics to provide one order of magnitude faster execution than today's conventional space-grade processors. In the context of ESA's project HIPNOS (HIgh Performance avionics solutioN for advanced and complex GNC …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "From multiple views to textured 3d meshes: a gpu-powered approach",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35740-4_30",
            "Abstract": "We present work on exploiting modern graphics hardware towards the real-time production of a textured 3D mesh representation of a scene observed by a multicamera system. The employed computational infrastructure consists of a network of four PC workstations each of which is connected to a pair of cameras. One of the PCs is equipped with a GPU that is used for parallel computations. The result of the processing is a list of texture mapped triangles representing the reconstructed surfaces. In contrast to previous works, the entire processing pipeline (foreground segmentation, 3D reconstruction, 3D mesh computation, 3D mesh smoothing and texture mapping) has been implemented on the GPU. Experimental results demonstrate that an accurate, high resolution, texture-mapped 3D reconstruction of a scene observed by eight cameras is achievable in real time.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Perceptually relevant and piecewise linear matching of silhouettes",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320304002481",
            "Abstract": "In this paper, a novel alignment method for silhouettes is proposed. This method is based on the establishment of correspondences between landmarks on their boundaries and, in turn, on the establishment of correspondences of the boundary pieces in between these landmarks. The method yields more correct correspondences than conventional methods that scale the arc-length descriptions of silhouettes to align them. The selection of landmarks is investigated as to the robustness of their localization and their perceptual relevance. Matching of silhouettes is then achieved by quantifying the dissimilarity of a pair of silhouette boundaries, based on a novel dissimilarity metric. The matching procedure is evaluated, based on retrieval experiments, and it is concluded that the precision of the results is higher than that obtained by conventional pointwise comparison methods.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Rapid Prototyping of an AmI-Augmented Office Environment Demonstrator",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02580-8_43",
            "Abstract": "This paper presents the process and tangible outcomes of a rapid prototyping activity towards the creation of a demonstrator, showcasing the potential use and effect of Ambient Intelligence technologies in a typical office environment. In this context, the hardware and software components used are described, as well as the interactive behavior of the demonstrator. Additionally, some conclusions stemming from the experience gained are presented, along with pointers for future research and development work.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An approach to the creation and presentation of reference gesture datasets, for the preservation of traditional crafts",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/862962",
            "Abstract": "A wide spectrum of digital data are becoming available to researchers and industries interested in the recording, documentation, recognition, and reproduction of human activities. In this work, we propose an approach for understanding and articulating human motion recordings into multimodal datasets and VR demonstrations of actions and activities relevant to traditional crafts. To implement the proposed approach, we introduce Animation Studio (AnimIO) that enables visualisation, editing, and semantic annotation of pertinent data. AnimIO is compatible with recordings acquired by Motion Capture (MoCap) and Computer Vision. Using AnimIO, the operator can isolate segments from multiple synchronous recordings and export them in multimodal animation files. AnimIO can be used to isolate motion segments that refer to individual craft actions, as described by practitioners. The proposed approach has been iteratively designed for use by non-experts in the domain of 3D motion digitisation. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "The starry night texture and its use to isolate depth cues",
            "Publication year": 2002,
            "Publication url": "https://jov.arvojournals.org/article.aspx?articleid=2120315",
            "Abstract": "The Starry Night Texture (SNT) is a new surface texture that renders painted objects invisible against a similarly painted background, in static monocular views. Object shape and location become visible when motion parallax or stereo cues are provided. SNT consists of a great many high luminosity spots, each tiny in size, distributed randomly (using the uniform distribution) on an otherwise dark surface. The spots are indistinguishable from point sources when imaged, yielding a Starry Night Image (SNI). A single number (the “densintensity”) characterizes the expected number of spots of criterion luminance or brighter, per unit area. To achieve invariance of the image statistics across changes in surface distance, the luminance of the spots is distributed as the square of reciprocal luminance. To achieve invariance across slants, spots are flat on the surface. The resulting Starry Night Image (SNI) is itself an SNT.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:-f6ydRqryjwC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "Starry night: a texture devoid of depth cues",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JOSAA-21-11-2049",
            "Abstract": "From a modern Bayesian point of view, the classic Julesz random-dot stereogram is a cue-conflict stimulus: Texture cues specify an unbroken, unslanted surface, in conflict with any variation in depth specified by binocular disparity. We introduce a new visual texture—the starry night texture (SNT)—that is incapable of conveying slant, depth edges, or texture boundaries, in a single view. For SNT, changing density is equivalent to changing intensity, so an instance of the texture is characterized (up to the random locations of the texture elements) by what we call its densintensity. We consider deviations from the ideal that are needed to realize the texture in practice. In three experiments with computer-generated stimuli we examined human perception of SNT to show that (1) the deviations from the ideal that were needed to realize SNT do not affect the invariance of its appearance across changes in distance of several …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:4DMP91E08xMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Retinal image registration through simultaneous camera pose and eye shape estimation",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7591421/",
            "Abstract": "In this paper, a retinal image registration method is proposed. The approach utilizes keypoint correspondences and assumes that the human eye has a spherical or ellipsoidal shape. The image registration problem amounts to solving a camera 3D pose estimation problem and, simultaneously, an eye 3D shape estimation problem. The camera pose estimation problem is solved by estimating the relative pose between the views from which the images were acquired. The eye shape estimation problem parameterizes the shape and orientation of an ellipsoidal model for the eye. Experimental evaluation shows 17.91% reduction of registration error and 47.52% reduction of the error standard deviation over state of the art methods.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Shape from interaction",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s00138-014-0602-9",
            "Abstract": "We present “shape from interaction” (SfI), an approach to the problem of acquiring 3D representations of rigid objects through observing the activity of a human who handles a tool. SfI relies on the fact that two rigid objects cannot share the same physical space. The 3D reconstruction of the unknown object is achieved by tracking the known 3D tool and by carving out the space it occupies as a function of time. Due to this indirection, SfI reconstructs rigid objects regardless of their material and appearance properties and proves particularly useful for the cases of textureless, transparent, translucent, refractive and specular objects for which there exists no practical vision-based 3D reconstruction method. Additionally, object concavities that are not directly observable can also be reconstructed. The 3D tracking of the tool is formulated as an optimization problem that is solved based on visual input acquired by a …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "COIN-O-RAMA: Designing an Interactive Exhibit for Exploring and Engaging with Coin Exhibitions",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3197768.3197770",
            "Abstract": "This paper presents COIN-O-RAMA, an interactive exhibit designed for exploring and further engaging with coins in physical exhibitions. The key motivation was to create an appealing and user friendly system, augmenting and complementing the overall experience of visiting the exhibition, also offering the means for creating a personalized digital souvenir (a coin with the user's head engraved on it), working as a post-visit link to the exhibition and to related information, as well as an artifact to share with friends and the social media. In this paper the requirements and preferences upon which the creation of COIN-O-RAMA was based are presented, followed by an account of the conceptual and interaction/user interface design of the system. Subsequently, a technical description of the process followed to achieve the engraving effect used for creating the personalized digital coin is offered. Then, the results of an …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TooltY: An approach for the combination of motion capture and 3D reconstruction to present tool usage in 3D environments",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-71002-6_10",
            "Abstract": "Visualization techniques for the usage of tools, handicrafts, and assembly operations are employed for demonstrating processes (eg, assembly instructions). Until today, most commonly used techniques include written information, sketches in manuals, video instructions, etc. The evolution of technology nowadays has generated mature methods for transforming movement to digital information that can be processed and replicated. Motion capture together with 3D reconstruction techniques can provide new ways of digitizing handicrafts. At the same time, Virtual Humans can be used to present craft processes, as well as to demonstrate the usage of tools. For this, the tools utilized in these processes need to be transferred to the digital world. In this paper, we present TooltY, a 3D authoring platform for tool usage presentation in 3D environments, to demonstrate simple operations (eg, usage of a hammer, scissors …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "High-performance vision-based navigation on SoC FPGA for spacecraft proximity operations",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8648530/",
            "Abstract": "Future autonomous spacecraft rendezvous with uncooperative or unprepared objects will be enabled by vision-based navigation, which imposes great computational challenges. Targeting short duration missions in low Earth orbit, this paper develops high-performance avionics supporting custom computer vision algorithms of increased complexity for satellite pose tracking. At algorithmic level, we track 6D pose by rendering a depth image from an object mesh model and robustly matching edges detected in the depth and intensity images. At system level, we devise an architecture to exploit the structure of commercial system-on-chip FPGAs, i.e., Zynq7000, and the benefits of tightly coupling VHDL accelerators with CPU-based functions. At implementation level, we employ our custom HW/SW co-design methodology and an elaborate combination of digital circuit design techniques to optimize and map efficiently all …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Image Processing Allows Reliable In Vivo Detection and Quantification of Retinal Microglia Following Laser-Induced Choroidal Neovascularization",
            "Publication year": 2015,
            "Publication url": "https://iovs.arvojournals.org/article.aspx?articleID=2334181",
            "Abstract": "PurposeMacrophage and microglia cells have proved to have an important role in pathological neovascularization conditions such as age-related macular degeneration. The pathomechanisms that trigger microglia activation remain still unknown though. New in vivo approaches are necessary for a better understanding and evaluation of the microglial behavior, all combined with image enhancing techniques.MethodsWe used MacGreen mice, expressing EGFP protein in macrophages and trophoblast cells. An argon ion laser was used to induce choroidal neovascularization (CNV). Laser scars were held only in half of the eye, allowing in vivo spatial and time-response behavior studies by scanning laser ophthalmoscopy (SLO) in the autofluorescence mode for the fundus (FAF). In vivo recording was processed by different algorithms to reduce noise, remove moving elements (flowing macrophages) and increase …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:UxriW0iASnsC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "DARLENE D9. 2: Project progress report 1st year",
            "Publication year": 2021,
            "Publication url": "https://lirias.kuleuven.be/3585401?limo=0",
            "Abstract": "This report details the progress performed during the first year of implementation of the DARLENE project.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SPARTAN/SEXTANT/COMPASS: advancing space rover vision via reconfigurable platforms",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-16214-0_44",
            "Abstract": "Targeting enhanced navigational speed and autonomy for the space exploration rovers, researchers are gradually turning to reconfigurable computing and FPGAs. High-density space-grade FPGAs will enable the acceleration of high-complexity computer vision algorithms for improving the localization and mapping functions of the future Mars rovers. In the projects SPARTAN/SEXTANT/COMPASS of the European Space Agency, we study the potential use of FPGAs for implementing a variety of stereo correspondence, feature extraction, and visual odometry algorithms, all with distinct cost-performance tradeoffs. The most efficient of the developed accelerators will assist the slow space-grade CPU in completing the visual tasks of the rover faster, by one order of magnitude, and thus, will allow the future missions to visit larger areas on Mars. Our work bases on a custom HW/SW co-design methodology …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Developing visual competencies for socially assistive robots: the HOBBIT approach",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2504335.2504395",
            "Abstract": "In this paper, we present our approach towards developing visual competencies for socially assistive robots within the framework of the HOBBIT project. We show how we integrated several vision modules using a layered architectural scheme. Our goal is to endow the mobile robot with visual perception capabilities so that it can interact with the users. We present the key modules of independent motion detection, object detection, body localization, person tracking, head pose estimation and action recognition and we explain how they serve the goal of natural integration of robots in social environments.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Macedonia from fragments to pixels: A permanent exhibition of interactive systems at the archaeological museum of thessaloniki",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34234-9_62",
            "Abstract": "The theme of this paper is an exhibition of prototypical interactive systems with subjects drawn from ancient Macedonia, named \"Macedonia from fragments to pixels\". Since 2010, the exhibition is hosted by the Archaeological Museum of Thessaloniki and is open daily to the general public. Up to now, more than 165.000 people have visited it. The exhibition comprises 7 interactive systems which are based on some research outcomes of the Ambient Intelligence Programme of the Institute of Computer Science, Foundation for Research and Technology - Hellas. The digital content of these systems includes objects from the Museum’s permanent collection and from Macedonia.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Vision-Based Hand Gesture Recognition for Human-Computer Interaction.",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30825754/zabulis09_book.pdf",
            "Abstract": "In recent years, research efforts seeking to provide more natural, human-centered means of interacting with computers have gained growing interest. A particularly important direction is that of perceptive user interfaces, where the computer is endowed with perceptive capabilities that allow it to acquire both implicit and explicit information about the user and the environment. Vision has the potential of carrying a wealth of information in a non-intrusive manner and at a low cost, therefore it constitutes a very attractive sensing modality for developing perceptive user interfaces. Proposed approaches for vision-driven interactive user interfaces resort to technologies such as head tracking, face and facial expression recognition, eye tracking and gesture recognition. In this paper, we focus our attention to vision-based recognition of hand gestures. The first part of the paper provides an overview of the current state of the art regarding the recognition of hand gestures as these are observed and recorded by typical video cameras. In order to make the review of the related literature tractable, this paper does not discuss:• techniques that are based on cameras operating beyond the visible spectrum (eg thermal cameras, etc),• active techniques that require the projection of some form of structured light, and,",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient and memory-conserving implementation of multi-view stereo for wide-area reconstruction",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/42805851/paper183.pdf",
            "Abstract": "This paper deals with the automatic stereo reconstruction of wide-area scenes. Its particular goal is a computationally efficient method that can be performed on a personal computer, despite the large amount of data involved in the reconstruction of wide-area scenes. Robustness is considered in terms of the accuracy of the final reconstruction, as well as, in the context of simplifying the image acquisition process for the end-user.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image analysis of axisymmetric droplets in wetting experiments: A new tool for the study of 3D droplet geometry and droplet shape reconstruction",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0927775718304746",
            "Abstract": "A new software tool is developed for droplet image analysis for the study of wetting of solid substrates. The tool extracts information exclusively from images and does not require the use of any properties of the system. Moreover, its applicability covers both axisymmetric and non-axisymmetric droplets. The developed software processes independently droplet images taken from side and top perspectives. Processing of side-view images is made by polynomial fitting to the droplet shape and provides important 2D geometrical features such as contact angles, length, height, contact point coordinates and contour outline. The analysis of top-view images is achieved through active contours (snakes) and yields droplet dimensions, centroid position and contour outline. The combination of synchronized side and top images provides the reconstruction of the droplet 3D shape by means of slices of circular arc shape, which …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:_B80troHkn4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Augmented interaction with physical books in an Ambient Intelligence learning environment",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-011-0976-x",
            "Abstract": "This paper presents an augmented reality environment for students' improved learning, which is based on unobtrusive monitoring of the natural reading and writing process. This environment, named SESIL, is able to perform recognition of book pages and of specific elements of interest within a page, as well as to perceive interaction with actual books and pens/pencils, without requiring any special interaction device. As a result, unobtrusive, context - aware student assistance can be provided. In this way, the learning process can be enhanced during reading with the retrieval and presentation of related material and, during writing, by the provision of assistance to accomplish writing tasks whenever appropriate. The SESIL environment is evaluated in terms of robustness, accuracy and usability.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Region-based dense depth extraction from multi-view video",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4298869/",
            "Abstract": "A novel multi-view region-based dense depth map estimation problem is presented, based on a modified plane-sweeping strategy. In this approach, the whole scene is assumed to be region-wise planar. These planar regions are defined by back-projections of the over-segmented homogenous color regions on the images and the plane parameters are determined by angle-sweeping at different depth levels. The position and rotation of the plane patches are estimated robustly by minimizing a segment-based cost function, which considers occlusions, as well. The quality of depth map estimates is measured via reconstruction quality of the conjugate views, after warping segments into these views by the resulting homographies. Finally, a greedy-search algorithm is applied to refine the reconstruction quality and update the plane equations with visibility constraint. Based on the simulation results, it is observed that the …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:eflP2zaiRacC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Starry Night Texture",
            "Publication year": 2004,
            "Publication url": "https://repository.upenn.edu/cgi/viewcontent.cgi?article=1000&context=ircs_reports",
            "Abstract": "From a modern Bayesian point of view, the classic Julesz random-dot stereogram is a cue-conflict stimulus: texture cues specify an unbroken, unslanted surface, in conflict with any variation in depth specified by binocular disparity. We introduce a new visual stimulus based on a novel texture, the Starry Night Texture (SNT), that is incapable of conveying slant, depth edges, or texture boundaries, in a single view. Changing density and changing intensity are equivalent for SNT, so an instance of the texture is characterized (up to the random locations of the texture elements) by its densintensity. We describe the SNT in its ideal form, consider deviations from the ideal that are needed to realize the texture in practice, and describe a physical device that approximates SNT using backlit metal foil. In three experiments with computer-generated stimuli we examined human perception of SNT, to show that (1) the deviations …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A smart environment for augmented learning through physical books",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6012183/",
            "Abstract": "Today, augmented reality is evolving towards sophisticated approaches exploiting the opportunities offered by immersive environments and high quality 3D graphics. Such systems can prove to be very useful in the context of education, especially when learning involves reading and writing activities. However, the majority of existing systems relies on touch-based interaction, or on interaction with proprietary technological artifacts. This paper presents an approach to enhancing reading and writing on physical books through smart augmentation. It is based on the intuitive and unobtrusive monitoring of students gestures during reading and writing activities through cameras, facilitating context-aware content sensitive assistance without requiring any special interaction device.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tracking of multiple planar projection boards for interactive mixed-reality applications",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-017-5313-6",
            "Abstract": "The case of mixed-reality projector-camera systems is considered and, in particular, those which employ hand-held boards as interactive displays. This work focuses upon the accurate, robust, and timely detection and pose estimation of such boards, to achieve high-quality augmentation and interaction. The proposed approach operates a camera in the near infrared spectrum to filter out the optical projection from the sensory input. However, the monochromaticity of input restricts the use of color for the detection of boards. In this context, two methods are proposed. The first regards the pose estimation of boards which, being computationally demanding and frequently used by the system, is highly parallelized. The second uses this pose estimation method to detect and track boards, being efficient in the use of computational resources so that accurate results are provided in real-time. Accurate pose estimation …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Motion reconstruction of arm swimming in the Octopus vulgaris",
            "Publication year": 2013,
            "Publication url": "https://ics.forth.gr/~zabulis/P001-095.pdf",
            "Abstract": "The arm swimming movement in the benthic common octopus was investigated in detail, by means of image segmentation and motion reconstruction of video data acquired by the authors. The 3D trajectories of all eight arms were tracked, for the first time, revealing a synchronous, albeit complex, pattern of motion.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Software Platform for the Acquisition and Online Processing of Images in a Camera Network",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/41503880/A_Software_Platform_for_the_Acquisition_20160124-20768-1ode81i.pdf",
            "Abstract": "Applications related to vision-based monitoring of spaces and to the visual understanding of human behaviour, require the synchronous imaging of a scene from multiple views. We present the design and implementation of a software platform that enables synchronous acquisition of images from a camera network and supports their distribution across computers. Seamless and online delivery of acquired data to multiple distributed processes facilitates the development of parallel applications. As a case study, we describe the use of the platform in a vision system targeted at unobtrusive human-computer interaction.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Satellite Visual Tracking for Proximity Operations in Space",
            "Publication year": 2017,
            "Publication url": "http://users.ics.forth.gr/~lourakis/publ/2017_astra.pdf",
            "Abstract": "Determining the pose of orbiting satellites is a fundamental prerequisite for supporting autonomous proximity operations in space. This work presents a model-based 3D tracking algorithm based on edges. The proposed tracker maintains a pose hypothesis that is propagated from frame to frame, using it first to render a depth image and then refining it according to partial matches established between depth and intensity edges. Edge matching relies on fast, local linear searches along the depth gradient direction. The tracker does not require any preprocessing of the 3D model nor does it make any assumptions regarding its characteristics, as is often the case for other approaches based on edges. It is also robust to parts of the tracked satellite being out of view, occluded, shadowed or visually undetected. Experimental results evaluating the accuracy of the tracker and comparing it against established techniques are also included.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A reexamination of the Enright (1970) illusion: Distance from motion and stereo?",
            "Publication year": 2002,
            "Publication url": "https://jov.arvojournals.org/article.aspx?articleid=2120504",
            "Abstract": "An observer looking out the side window of a rapidly moving automobile, with a neutral density filter over one eye, sees the world as dwarfed and moving by slowly (Enright, 1970). Enright argued that increased disparity from the Pulfrich effect causes near objects to appear nearer still, so that size constancy requires they be small, and speed constancy that they be moving slowly. However, it is possible the effect results from solving for absolute distance using mutual constraints provided by structure from motion and shape from relative binocular disparity (Richards, 1985; Kellman & Kaiser, 1995). In this case, the three-dimensional scene would retain its original apparent shape, and, critically, the entire scene (not just the near objects) would appear smaller and closer. Previous studies used small displays of isolated objects and failed to find such an effect (Brenner & Landy, 1999).",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:L8Ckcad2t8MC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "Digitizing archaeological excavations from multiple views",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1443231/",
            "Abstract": "We present a novel approach on digitizing large scale unstructured environments like archaeological excavations using off-the-shelf digital still cameras. The cameras are calibrated with respect to few markers captured by a theodolite system. Having all cameras registered in the same coordinate system enables a volumetric approach. Our new algorithm has as input multiple calibrated images and outputs an occupancy voxel space where occupied pixels have a local orientation and a confidence value. Both, orientation and confidence facilitate an efficient rendering and texture mapping of the resulting point cloud. Our algorithm combines the following new features: Images are back-projected to hypothesized local patches in the world and correlated on these patches yielding the best orientation. Adjacent cameras build tuples which yield a product of pair-wise correlations, called strength. Multiple camera tuples …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D pose refinement using rendering and texture-based matching",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11331-9_80",
            "Abstract": "This paper presents a method for accurately determining the pose of Lambertian rigid objects present in an image. An initial pose estimate computed with the aid of local point features is ameliorated by considering all visible object texture. This is achieved by combining a textured mesh model of the object with a graphics renderer to synthesize an image of the object as would be captured by the camera at a particular pose. A rendered image is compared against the acquired one with the aid of a visual dissimilarity score involving cross-correlation. Population-based stochastic optimization is used to efficiently search the pose space and minimize the dissimilarity between rendered images corresponding to candidate poses and the acquired image. The method is demonstrated with the aid of real and synthetic images.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:f2IySw72cVMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "T-LESS: An RGB-D dataset for 6D pose estimation of texture-less objects",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7926686/",
            "Abstract": "We introduce T-LESS, a new public dataset for estimating the 6D pose, i.e. translation and rotation, of texture-less rigid objects. The dataset features thirty industry-relevant objects with no significant texture and no discriminative color or reflectance properties. The objects exhibit symmetries and mutual similarities in shape and/or size. Compared to other datasets, a unique property is that some of the objects are parts of others. The dataset includes training and test images that were captured with three synchronized sensors, specifically a structured-light and a time-of-flight RGB-D sensor and a high-resolution RGB camera. There are approximately 39K training and 10K test images from each sensor. Additionally, two types of 3D models are provided for each object, i.e. a manually created CAD model and a semi-automatically reconstructed one. Training images depict individual objects against a black background …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:q3oQSFYPqjQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploration of Large-scale Museum Artifacts through Non-instrumented, Location-based, Multi-user Interaction.",
            "Publication year": 2010,
            "Publication url": "https://diglib.eg.org/bitstream/handle/10.2312/VAST.VAST10.155-162/155-162.pdf?sequence=1&isAllowed=y",
            "Abstract": "This paper presents a system that supports the exploration of digital representations of large-scale museum artifacts in through non-instrumented, location-based interaction. The system employs a state-of-the-art computer vision system, which localizes and tracks multiple visitors. The artifact is presented in a wall-sized projection screen and it is visually annotated with text and images according to the location as well as walkthrough trajectories of the tracked visitors. The system is evaluated in terms of computational performance, localization accuracy, tracking robustness and usability.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An approach for the visualization of crafts and machine usage in virtual environments",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Evropi-Stefanidi/publication/344471408_An_Approach_for_the_Visualization_of_Crafts_and_Machine_Usage_in_Virtual_Environments/links/5f7ae3d192851c14bcaedd39/An-Approach-for-the-Visualization-of-Crafts-and-Machine-Usage-in-Virtual-Environments.pdf",
            "Abstract": "Despite the cultural, societal, economic and traditional significance and value of Heritage Crafts and Intangible Cultural Heritage, efforts towards their digital representation and presentation, and subsequently their preservation, are scattered. To that end, this paper proposes an approach for their visualization in Virtual Environments, within which the practitioner is represented by a Virtual Human, their actions through animations resulting from Motion Capture recordings, and objects through their 3D reconstructions. Our novel approach is based on a conceptual, twofold decomposition of craft processes into actions, and of the machines used into components. Thus, in the context of this paper, we have developed a pipeline that delivers a Virtual Environment, through which a wide range of users, from museum curators and exhibitors, to everyday users interested by a craft, can experience craft usage scenarios. Via our visualization pipeline, we claim that we deliver an efficient way of visualizing craft processes within Virtual Environments, thus increasing the usability and educational value of craft representation, and opening the way to a variety of new applications for craft presentation, education and thematic tourism. In the scope of this paper, we focus on the Heritage Craft of loom weaving; however, our approach is generic, for representing any craft, after its decomposition according to our technique.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:NJ774b8OgUMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Single-and multi-FPGA acceleration of dense stereo vision for planetary rovers",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3312743",
            "Abstract": "Increased mobile autonomy is a vital requisite for future planetary exploration rovers. Stereo vision is a key enabling technology in this regard, as it can passively reconstruct in three dimensions the surroundings of a rover and facilitate the selection of science targets and the planning of safe routes. Nonetheless, accurate dense stereo algorithms are computationally demanding. When executed on the low-performance, radiation-hardened CPUs typically installed on rovers, slow stereo processing severely limits the driving speed and hence the science that can be conducted in situ. Aiming to decrease execution time while increasing the accuracy of stereo vision embedded in future rovers, this article proposes HW/SW co-design and acceleration on resource-constrained, space-grade FPGAs. In a top-down approach, we develop a stereo algorithm based on the space sweep paradigm, design its parallel HW …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:hkOj_22Ku90C",
            "Publisher": "ACM"
        },
        {
            "Title": "Enhancing education through natural interaction with physical paper",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10209-014-0365-0",
            "Abstract": " Pervasive computing environments have permeated current research and practice, unobtrusively augmenting existing environments with digital content. The present work, following a pervasive computing approach, proposes a framework to augment an educational environment, being a typical classroom or any studying environment. In this context, the work presented in this paper investigates unobtrusive interaction and support of active educational or studying activities through appropriate context-sensitive information. To this end, passive visual sensing is employed in order to unobtrusively perceive the current context and users’ actions, thus providing novel ways to implement natural interaction. The suitability of the proposed interaction technologies and overall approach has been demonstrated through three interactive applications integrated in the framework, each one supporting different interaction …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "PP. 11.23: ASSOCIATION BETWEEN SALT INTAKE AND INDICES OF MICRO-AND MACROVASCULAR FUNCTION",
            "Publication year": 2015,
            "Publication url": "https://www.academia.edu/download/54038414/PP_11_23___ASSOCIATION_BETWEEN_SALT_INTAKE_AND.705.pdf",
            "Abstract": "Conclusions: The prevalence of HTN after SOT is high but dependent of the organ transplanted. Despite the use of antihypertensive drugs in most SOT patients, uncontrolled HTN is frequent, particularly in kidney transplants.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:p2g8aNsByqUC",
            "Publisher": "LWW"
        },
        {
            "Title": "Impaired metabolic profile is a predictor of capillary rarefaction in a population of hypertensive and normotensive individuals",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1933171116302765",
            "Abstract": "Capillary rarefaction is typically encountered in essential hypertension, yet identification of factors interfering with this phenomenon remains substantially underinvestigated. We examined whether components of metabolic profile (dyslipidemia, insulin resistance), inflammatory (high-sensitivity C-reactive protein, high-sensitivity C-reactive protein), and angiogenic (vascular endothelial growth factor) factors are implicated in this phenomenon in a population of newly diagnosed, never-treated hypertensive patients and normotensive controls. Nailfold capillary density was estimated with nailfold capillaroscopy using specifically designed software. A total of 159 individuals, 93 hypertensives, and 66 normotensives were included. Nailfold capillary density was lower among hypertensives compared to normotensives (146.4 ± 31.0 vs. 155.4 ± 26.9, respectively; P = .047). In the total population, capillary density significantly …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:sSrBHYA8nusC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Study of 3D Digitisation Modalities for Crime Scene Investigation",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1210646",
            "Abstract": "A valuable aspect during crime scene investigation is the digital documentation of the scene. Traditional means of documentation include photography and in situ measurements from experts for further analysis. Although 3D reconstruction of pertinent scenes has already been explored as a complementary tool in investigation pipelines, such technology is considered unfamiliar and not yet widely adopted. This is explained by the expensive and specialised digitisation equipment that is available so far. However, the emergence of high-precision but low-cost devices capable of scanning scenes or objects in 3D has been proven as a reliable alternative to their counterparts. This paper summarises and analyses the state-of-the-art technologies in scene documentation using 3D digitisation and assesses the usefulness in typical police-related situations and the forensics domain in general. We present the methodology for acquiring data for 3D reconstruction of various types of scenes. Emphasis is placed on the applicability of each technique in a wide range of situations, ranging in type and size. The application of each reconstruction method is considered in this context and compared with respect to additional constraints, such as time availability and simplicity of operation of the corresponding scanning modality. To further support our findings, we release a multi-modal dataset obtained from a hypothetical indoor crime scene to the public.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A prototypical interactive exhibition for the archaeological museum of thessaloniki",
            "Publication year": 2013,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1260/2047-4970.2.1.75",
            "Abstract": "In 2010, the Institute of Computer Science of the Foundation for Research and Technology-Hellas (ICS-FORTH) and the Archaeological Museum of Thessaloniki (AMTh) collaborated towards the creation of a special exhibition of prototypical interactive systems with subjects drawn from ancient Macedonia, named “Macedonia from fragments to pixels”. The exhibition comprises seven interactive systems based on the research outcomes of ICS-FORTH's Ambient Intelligence Programme. Up to the summer of 2012, more than 165.000 people have visited it. The paper initially provides some background information, including related previous research work, and then illustrates and discusses the development process that was followed for creating the exhibition. Subsequently, the technological and interactive characteristics of the project's outcomes (i.e., the interactive systems) are analysed and the complementary …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:NaGl4SEjCO4C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Divergent retinal vascular abnormalities in normotensive persons and patients with never-treated, masked, white coat hypertension",
            "Publication year": 2013,
            "Publication url": "https://academic.oup.com/ajh/article-abstract/26/3/318/190098",
            "Abstract": "Hypertensive patients with retinal arteriolar abnormalities are at increased risk for cardiovascular events. However, the extent of retinal microvascular changes in naïve, never-treated patients with hypertension of short duration has not been established. In addition to this, the lack of relevant data about other phenotypes of hypertension (masked and white-coat hypertension) determined by ambulatory blood-pressure measurement (ABPM) is notable, despite their relationship to increased cardiovascular risk mediated by underlying target-organ and vascular damage.We conducted a study in which nonmydriatic retinal photography was used to assess central retinal artery equivalent (CRAE) and central retinal vein equivalent (CRVE) diameters and the retinal arteriovenus ratio (AVR) in a group of 103 individuals with never-treated hypertension of …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:GnPB-g6toBAC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Effect of initial droplet shape on the tangential force required for spreading and sliding along a solid surface",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0927775718302747",
            "Abstract": "Despite the extensive study of wetting in literature, there are still many unresolved issues regarding forced wetting. One of them refers to the effect of the initial droplet shape on the force required for spreading and sliding along a solid surface; an effect that has not ever been explicitly reported. Previous experimental works, in general, assume initially axisymmetric droplet shapes. In this study, experiments are performed with an innovative device, Kerberos, capable of subjecting sessile droplets at different tilting angles to varying centrifugal forces in order to explore the spreading/sliding behavior of droplets of different volumes and different initial shapes (including non-axisymmetric). A broad validation of the technique is achieved by the repeatability and consistency of measurements. Results for initially axisymmetric and non-axisymmetric droplets concerning contact angles, droplet length, droplet shape and velocity …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Videos for\" The Multiscale Boiling Investigation on-board the International Space Station: An overview\"",
            "Publication year": 2021,
            "Publication url": "https://tudatalib.ulb.tu-darmstadt.de/bib/handle/tudatalib/2912",
            "Abstract": "@misc{https://tudatalib.ulb.tu-darmstadt.de/handle/tudatalib/2912, url = { https://tudatalib.ulb.tu-darmstadt.de/handle/tudatalib/2912 \n}, author = { Sielaff, Axel and mangini, daniele and Kabov, Oleg and GARIVALIS, ALEKOS \nIOANNIS and Zupančič, Matevž and Dehaeck, Sam and Evgenidis, Sotiris and Jacobs, \nCarla and Van Hoof, Denis and Oikonomidou, Ourania and Zabulis, Xenophon and \nKaramaoynas, Polykarpos and Bender, Achim and Ronshin, Fedor and Schinnerl, Martin \nand Colin, Catherine and Di Marco, Paolo and karapantsios, Thodoris and Golobic, Iztok \nand Rednikov, Alexey and Colinet, Pierre and Stephan, Peter and Tadrist, Lounes and Raza, \nMd. Qaisar and Sebilleau, Julien }, doi = { 10.48328/tudatalib-618 }, keywords = { Multiscale \nBoiling, microgravity, International Space Station, pool boiling, shear flow, electric field, 404-02 \nTechnische Thermodynamik, 620 }, publisher = { Technical University of }}…",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Segment-based stereo-matching via plane and angle sweeping",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4379465/",
            "Abstract": "A novel approach for segment-based stereo matching problem is presented, based on a modified plane-sweeping strategy. The space is initially divided into planes that are located at different depth levels via plane sweeping by the help of region-wise planarity assumption for the scene. Over-segmented homogenous color regions are utilized for defining planar segment boundaries and plane equations are determined by angle sweeping at different planes. The robustness of depth map estimates is improved by warping segments into the other image via the resulting homographies. In order to refine the reconstruction quality and update segment depths, as well as plane normals, with smoothness and visibility constraints, a greedy search algorithm is applied. Based on the simulation results, the proposed algorithm handles large un-textured regions, depth discontinuities at object boundaries and slanted surfaces …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Container effects on the free drainage of wet foams",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0009250908006465",
            "Abstract": "This work studies how drainage of a wet foam is affected by certain characteristics of its container: diameter, wettability and shape of the walls. Drainage is registered by three simultaneous techniques: (a) electrical conductance measurements for the evolution of the local liquid fraction, (b) close-up photos for the evolution of the local bubble size distribution and (c) volumetric measurements for the evolution of the global liquid fraction in the entire container. Electrical measurements are conducted at different heights along the foam with the aid of several pairs of non-intrusive ring electrodes. Three cylindrical Plexiglas containers of different diameter are used, before and after treatment of their walls to allow tests with hydrophobic and hydrophilic walls, respectively. To resemble the shape of common industrial containers, the lower part of the largest container has a gradually reducing diameter towards its bottom. Foam …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Augmented multitouch interaction upon a 2-DOF rotating disk",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33179-4_61",
            "Abstract": "A visual user interface providing augmented, multitouch interaction upon a non-instrumented disk that can dynamically rotate in two axes is proposed. While the user manipulates the disk, the system uses a projector to visualize a display upon it. A depth camera is used to estimate the pose of the surface and multiple simultaneous fingertip contacts upon it. The estimates are transformed into meaningful user input, availing both fingertip contact and disk pose information. Calibration and real-time implementation issues are studied and evaluated through extensive experimentation. We show that the outcome meets accuracy and usability requirements for employing the approach in human computer interaction.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:maZDTaKrznsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Plane surface detection and reconstruction using induced stereo symmetry",
            "Publication year": 2011,
            "Publication url": "http://www.bmva.org/bmvc/2011/proceedings/paper97/",
            "Abstract": "Plane Surface Detection and Reconstruction using Induced Stereo Symmetry BMVC 2011 The \n22nd British Machine Vision Conference University of Dundee, 29 August - 2 September 2011 \nTitle: Plane Surface Detection and Reconstruction using Induced Stereo Symmetry Authors: Michel \nAntunes, João Barreto, Xenophon Zabulis Views: Paper (PDF - 11 pages, 9 Mbytes) Abstract (PDF \n- 1 page, 4 Mbytes) Supplementary (mp4 - 6 Mbytes) DOI: http://dx.doi.org/10.5244/C.Citation: \nMichel Antunes, João Barreto and Xenophon Zabulis. Plane Surface Detection and \nReconstruction using Induced Stereo Symmetry. In Jesse Hoey, Stephen McKenna and Emanuele \nTrucco, Proceedings of the British Machine Vision Conference, pages 97.1-97.11. BMVA Press, \nSeptember 2011. http://dx.doi.org/10.5244/C.25.97 BibTeX: @inproceedings{BMVC.25.97, \ntitle = {Plane Surface Detection and Reconstruction using Induced Stereo …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Touch detection for planar interactive displays based on lateral depth views",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11042-016-3695-5.pdf",
            "Abstract": "This work regards fingertip contact detection and localization upon planar surfaces, for the purpose of providing interactivity in augmented, interactive displays that are implemented upon these surfaces. The proposed approach differs from the widely employed approach where user hands are observed from above, in that user hands are imaged laterally. An algorithmic approach for the treatment of the corresponding visual input is proposed. The proposed approach is extensively evaluated and compared to the top view approach. Advantages of the proposed approach include increased sensitivity, localization accuracy, scalability, as well as, practicality and cost efficiency of installation.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:LPZeul_q3PIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Modulating the shape and size of backprojection surfaces to improve accuracy in volumetric stereo",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2009/129789.pdf",
            "Abstract": "In 3D TV applications, the extraction of 3D representations of dynamic scenes from images plays a central role in the preparation of the presented visual content. This paper focuses on the stereo cue to the extraction of these representations and, in particular, on the recently developed family of volumetric approaches to stereo. Two methods are proposed that improve the accuracy of volumetric stereo approaches, which compare backprojections of image regions to establish stereo correspondences. The proposed methods are based on maximizing the utilization of the available image resolution, as well as, equalizing the sampled image area across pairs of image regions that are compared.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "3d reconstruction of octopus arm swimming motion",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.649.1342&rep=rep1&type=pdf",
            "Abstract": "Arm swimming in the octopus is a mode of locomotion that is used by the animal primarily for hunting, defence, or escape. The motion, in general, is characterized by a fast closing of the arms and a slow opening of the arms, resulting in a considerable propulsive power. The movement has previously been discussed, however the detailed kinematics is still unknown. For that, we investigated in detail the arm swimming movement in the benthic common octopus, by means of image segmentation and motion reconstruction of video data acquired by the authors. The 3D trajectories of all eight arms were tracked in three sequences of octopus arm swimming, revealing a synchronous, albeit complex, pattern of motion. Video acquisition by three high-definition cameras was used on adult octopuses, kept in the aquarium (Octopus vulgaris, 200-400gr of weight). The image sequences were a posteriori deinterlaced, synchronized, and compensated for radial and tangential lens distortion. Using a checkerboard pattern, the intrinsic and extrinsic calibration of each camera was performed, with a strong estimation of the camera parameters. To reconstruct an individual arm in 3D, the 2D arm contour was manually segmented from each camera frame, and its medial axis was extracted, thereafter, automatically [Yekutieli, 2007]. Employing epipolar geometry constraints and least-square approximation, between each camera view, the reconstruction of each, corresponding, medial axis in 3D was obtained. A back-projection process, from 3D to 2D, allowed evaluation and verification of the resulting 3D trajectories, via a manually iterative procedure. The 3D …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Lumen detection for capsule endoscopy",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4650969/",
            "Abstract": "In this paper, two visual cues are proposed, to be exploited for the navigation of active endoscopic capsules within the gastrointestinal (GI) tract. These cues consist of the detection and tracking of the lumen and of an illumination highlight in capsule endoscopy (CE) images. The proposed approach aims at developing vision algorithms which are robust with respect to the challenging imaging conditions encountered in the GI tract and the great variability of the acquired images. Cases where no or more than one lumens exists, are also detected. The proposed approach extends the state-of-the-art in lumen detection, and is demonstrated for in-vivo video sequences acquired from endoscopic capsules.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EVALUATION OF 3D RECONSTRCUTION USING MULTIVIEW BACKPROJECTION",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.333.3422&rep=rep1&type=pdf",
            "Abstract": "This paper evaluates the final reconstruction quality of 3D objects from different reconstruction methods by comparing rendered views of a 3D model to the original views, initially taken from 2D cameras. The paper uses pixel-by-pixel error measures, like pixelwise reconstruction error for non-textured objects and PSNR values for colored or textured objects. Concurrently, the limitations of such measures in connection with 3D reconstruction evaluation are highlighted and a reconstruction measurement based on differential values is investigated, where deviations from reference values are analyzed instead of absolute PSNR-values.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FIRE: fundus image registration dataset",
            "Publication year": 2017,
            "Publication url": "https://www.maio-journal.com/index.php/MAIO/article/view/42",
            "Abstract": "Purpose: Retinal image registration is a useful tool for medical professionals. However, performance evaluation of registration methods has not been consistently assessed in the literature. To address that, a dataset comprised of retinal image pairs annotated with ground truth and an evaluation protocol for registration methods is proposed.Methods: The dataset is comprised by 134 retinal fundus image pairs. These pairs are classified into three categories, according to characteristics that are relevant to indicative registration applications. Such characteristics are the degree of overlap between images and the presence/absence of anatomical differences. Ground truth in the form of corresponding image points and a protocol to evaluate registration performance are provided.Results: The proposed protocol is shown to enable quantitative and comparative evaluation of retinal registration methods under a variety of conditions.Conclusion: This work enables the fair comparison of retinal registration methods. It also helps researchers to select the registration method that is most appropriate given a specific target use.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SPARTAN: Vision-Based Autonomous Navigation System for Fast Traversal Planetary Rovers",
            "Publication year": 2018,
            "Publication url": "http://users.ics.forth.gr/~zabulis/2018_isairas.pdf",
            "Abstract": "Autonomous navigation of planetary exploration rovers has become a key element to attain mission success, as it can significantly improve the length of daily traverses, particularly when driving in unknown areas away from the lander. Future missions, such as the Mars Sample Return or the Lunar Polar Sample Return, already demand longer and faster traversals compared to past missions to maximize their scientific return and reduce operational costs and risks. Autonomous navigation is usually based on computer vision due to the passive mode of operation, simple hardware, small form factor and low power consumption of camera sensors. Computer vision nevertheless entails a rather high computational burden which puts a strain on the limited computational resources available onboard these rovers. This paper describes SPARTAN, an optimized, hardware embedded vision system for autonomous navigation of planetary rovers that meets the high demands of future missions requiring large and fast traversals.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time terascale implementation of tele-immersion",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44864-0_4",
            "Abstract": "Tele-immersion is a new medium that enables a user to share a virtual space with remote participants, by creating the illusion that users at geographically dispersed locations reside at the same physical space. A person is immersed in a remote world, whose 3D representation is acquired remotely, then transmitted and displayed in the viewer’s environment. Tele-immersion is effective only when the three components, computation, transmission, and rendering - all operate in real time. In this paper, we describe the real-time implementation of scene reconstruction on the Terascale Computing System at the Pittsburgh Supercomputing Center.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Detection and fine 3D pose estimation of texture-less objects in RGB-D images",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7354005/",
            "Abstract": "Despite their ubiquitous presence, texture-less objects present significant challenges to contemporary visual object detection and localization algorithms. This paper proposes a practical method for the detection and accurate 3D localization of multiple texture-less and rigid objects depicted in RGB-D images. The detection procedure adopts the sliding window paradigm, with an efficient cascade-style evaluation of each window location. A simple pre-filtering is performed first, rapidly rejecting most locations. For each remaining location, a set of candidate templates (i.e. trained object views) is identified with a voting procedure based on hashing, which makes the method's computational complexity largely unaffected by the total number of known objects. The candidate templates are then verified by matching feature points in different modalities. Finally, the approximate object pose associated with each detected …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and implementation of a subsystem for the detection and localization of human presence in indoor environments",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=9554997746158844769&hl=en&oi=scholarr",
            "Abstract": "In this part of the delivearble, presented are the efforts of FORTH towards the design and implementation of a subsystem for the detection and localization of human presence in indoor environments. In the context of the DISFER project, the pursued goals can be classified within two categories. The first regards facilitation of actions to be taken before the event of an earthquake. In this respect we propose a system that employs multiple visual sensors in order to:• continuously localize people in within the environment,• estimates the number of persons within the environment and, also,• track individual persons within the environment.In this way, the proposed system will provide information gathered just before the event about the number and location (s) of individuals inside the building and, thereby, be of assistance to rescue operations. The second regards the facilitation of actions to be taken after the event of an …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "What is needed to digitise knowledge on Heritage Crafts?",
            "Publication year": 2019,
            "Publication url": "https://openportal.isti.cnr.it/data/2019/415961/2019_%20415961.published.pdf",
            "Abstract": "Heritage Crafts (HCs) involve tangible craft artefacts, materials, and tools and encompass traditional craftsmanship as a form of Intangible Cultural Heritage. Intangible HC dimensions include dexterity, know-how, and skilled use of tools, as well as identity and traditions of the communities in which craftsmanship is, or was, practiced. Despite their cultural significance, efforts towards HC digital representation and presentation are scattered. In the Mingei EU Innovation Action, an approach is developed towards systematising the representation of Heritage Crafts as Cultural Heritage for their preservation. The representation is expected to capture the wide spectrum of knowledge topics that HCs cover, from objects and their making, to hand gestures and tool uses that define craft motor skills, to the societal value, economic impact, and historical significance. In this article, we focus on the approach towards the creation of a knowledge and its representation. Examples and experiments are presented for two craft instances that are studied in this action.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image content analysis and description",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-015-9664-0_1",
            "Abstract": "In this chapter the task of representing, describing, and analyzing visual information is discussed, in the context of image retrieval by content. Initially some basic specifications of the problem are presented and a classification of visual features, in a way compatible with human visual perception, is proposed. Through this discussion, it is realized that scale is an important attribute of visual content and a central issue in its description. Thus, a significant part of this chapter is devoted to the estimation and representation of primitive image content at different scales and a generic framework for this purpose is introduced. Finally, this chapter briefly considers the problem of how to derive and match descriptions of the visual content of an image in a perceptually correct manner.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Immersing users in landscapes using large scale displays in public spaces",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-20804-6_14",
            "Abstract": "This paper reports on the design and implementation of BeThereNow, a public interactive information system where users are depicted immersed in various sceneries. The work is focused on the domain of info-tainment in public spaces using large displays and aims on short-time usage. The implemented system employs a mixed reality application through which users are informed about different sceneries and also create personalized digital postcards. This process is accomplished using computer vision algorithms in order to depict users and objects, while removing the background of the scene. Finally, the lessons learned from the long-term deployment of the system out-in-the-wild are presented, providing an insight on the users’ actions and reactions and feedback on future research directions.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:u9iWguZQMMsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "PaperView: augmenting physical surfaces with location-aware digital information",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1935701.1935713",
            "Abstract": "A frequent need of museums is to provide visitors with context-sensitive information about exhibits in the form of maps, or scale models. This paper suggests an augmented-reality approach for supplementing physical surfaces with digital information, through the use of pieces of plain paper that act as personal, location-aware, interactive screens. The technologies employed are presented, along with the interactive behavior of the system, which was instantiated and tested in the form of two prototype setups: a wooden table covered with a printed map and a glass case containing a scale model. The paper also discusses key issues stemming from experience and observations in the course of qualitative evaluation sessions.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Association between retinal vessel caliber and arterial stiffness in a population comprised of normotensive to early-stage hypertensive individuals",
            "Publication year": 2014,
            "Publication url": "https://academic.oup.com/ajh/article-abstract/27/12/1472/2743163",
            "Abstract": "Although impairment of the micro- and macrocirculation is considered inherent to sustained hypertension, there is a substantial lack of studies investigating whether an association exists between micro- and macrovascular damage, especially in early-stage hypertension.We studied a meticulously selected population, free of diabetes and cardiovascular disease, of 223 individuals: 137 never-treated, newly diagnosed patients with recent onset of hypertension and 86 normotensive individuals. Nonmydriatic retinal photography was used to assess retinal microvascular diameters, including central retinal arteriolar (CRAE) and venular equivalent and arteriovenous ratio (AVR). Arterial stiffness was evaluated by measurement of pulse wave velocity (PWV) and aortic augmentation index (AIx).Compared with normotensive …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Modulating the size of backprojection surface patches, in volumetric stereo, for increasing reconstruction accuracy and robustness",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4379457/",
            "Abstract": "This paper concerns volumetric stereo methods, which compare the back projections of the acquired images onto a hypothetical surface patch in order to reconstruct the imaged surfaces. In particular, it introduces a size-modulation of this patch so that its projection area in the acquired images is invariant to distance and rotation. It is shown, and explained why, that performing this modulation results in superior accuracy of the volumetric reconstruction than retaining the patch size constant, as it has been to date practiced. The proposed extension to the hypothetical patch operator is compatible with the existing volumetric approaches to stereo.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Paximadaki, the game: Creating an advergame for promoting traditional food products",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2393132.2393195",
            "Abstract": "This paper presents an advergame installation for promoting the brand and products of a food company producing various types of traditional Cretan rusks. The paper first presents some background and related work. Then the requirements set towards creating the game are outlined, followed by concept creation and design decisions taken in order to meet these requirements, as well as a description of the user interface, gameplay and implementation characteristics of the resulting game. The game has already been installed with remarkable success in two different food exhibitions.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Representation and Presentation of Culinary Tradition as Cultural Heritage. Heritage 2021, 4, 612–640",
            "Publication year": 2021,
            "Publication url": "https://openportal.isti.cnr.it/data/2021/453493/2021_453493.published.pdf",
            "Abstract": "This paper presents a knowledge representation framework and provides tools to allow the representation and presentation of the tangible and intangible dimensions of culinary tradition as cultural heritage including the socio-historic context of its evolution. The representation framework adheres to and extends the knowledge representation standards for the Cultural Heritage (CH) domain while providing a widely accessible web-based authoring environment to facilitate the representation activities. In strong collaboration with social sciences and humanities, this work allows the exploitation of ethnographic research outcomes by providing a systematic approach for the representation of culinary tradition in the form of recipes, both in an abstract form for their preservation and in a semantic representation of their execution captured on-site during ethnographic research.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:VLnqNzywnoUC",
            "Publisher": "s Note: MDPI stays neutral with regard to jurisdictional claims in published maps and institutional affil-iations."
        },
        {
            "Title": "Multicamera human detection and tracking supporting natural interaction with large-scale displays",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00138-012-0408-6",
            "Abstract": "This paper presents a computer vision system that supports non-instrumented, location-based interaction of multiple users with digital representations of large-scale artifacts. The proposed system is based on a camera network that observes multiple humans in front of a very large display. The acquired views are used to volumetrically reconstruct and track the humans robustly and in real time, even in crowded scenes and challenging human configurations. Given the frequent and accurate monitoring of humans in space and time, a dynamic and personalized textual/graphical annotation of the display can be achieved based on the location and the walk-through trajectory of each visitor. The proposed system has been successfully deployed in an archaeological museum, offering its visitors the capability to interact with and explore a digital representation of an ancient wall painting. This installation permits an …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Representation and Presentation of Culinary Tradition as Cultural Heritage",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1069528",
            "Abstract": "This paper presents a knowledge representation framework and provides tools to allow the representation and presentation of the tangible and intangible dimensions of culinary tradition as cultural heritage including the socio-historic context of its evolution. The representation framework adheres to and extends the knowledge representation standards for the Cultural Heritage (CH) domain while providing a widely accessible web-based authoring environment to facilitate the representation activities. In strong collaboration with social sciences and humanities, this work allows the exploitation of ethnographic research outcomes by providing a systematic approach for the representation of culinary tradition in the form of recipes, both in an abstract form for their preservation and in a semantic representation of their execution captured on-site during ethnographic research. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:35r97b3x0nAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "3D Head Pose Estimation from Multiple Distant Views.",
            "Publication year": 2009,
            "Publication url": "https://videolectures.net/site/normal_dl/tag=52903/bmvc09_zabulis_3dhp.pdf",
            "Abstract": "3D head pose estimation from multiple distant views Page 1 3D head pose estimation from \nmultiple distant views X. Zabulis, T. Sarmis, AA Argyros Institute of Computer Science, \nFoundation for Research and Technology – Hellas (ICS-FORTH) Page 2 The problem ∎ \nEstimate X, Y, Z (location) and yaw, pitch and roll (pose), from multiple calibrated distal views ∎ \nBased on face detection ∎ Face detection, in distal viewing, is a significant component of the \nproblem Reference dataset from INRIA (IXMAS) Page 3 Past solutions and issues ∎ Templates, \ndetector arrays ∎ Nonlinear regression, manifold embedding ∎ Tracking rigid landmarks ∎ \nFace alignment ∎ Fusion of single view estimates □ Bayesian, Conditional probability, Joint \nlikelihood □ Only coarse pose estimation is reported Single view Page 4 Proposed method ∎ \nTextured visual hull to locate the head in 3D ∎ Unfold head texture from the visual hull, on a the -…",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Correspondence-free pose estimation for 3D objects from noisy depth data",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-016-1326-9",
            "Abstract": "Estimating the pose of objects from depth data is a problem of considerable practical importance for many vision applications. This paper presents an approach for accurate and efficient 3D pose estimation from noisy 2.5D depth images obtained from a consumer depth sensor. Initialized with a coarsely accurate pose, the proposed approach applies a hypothesize-and-test scheme that combines stochastic optimization and graphics-based rendering to refine the supplied initial pose, so that it accurately accounts for a sensed depth image. Pose refinement employs particle swarm optimization to minimize an objective function that quantifies the misalignment between the acquired depth image and a rendered one that is synthesized from a hypothesized pose with the aid of an object mesh model. No explicit correspondences between the depth data and the model need to be established, whereas pose …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Development of a three-dimensional surface imaging system for melanocytic skin lesion evaluation",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/journals/journal-of-biomedical-optics/volume-18/issue-1/016009/Development-of-a-three-dimensional-surface-imaging-system-for-melanocytic/10.1117/1.JBO.18.1.016009.short",
            "Abstract": "Even though surface morphology is always taken into account when assessing clinically pigmented skin lesions, it is not captured by most modern imaging systems using digital imaging. Our aim is to develop a novel three-dimensional (3D) imaging technique to record detailed information of the surface anatomy of melanocytic lesions that will enable improved classification through digital imaging. The apparatus consists of three high-resolution cameras, a light source, and accompanying software. Volume measurements of specific phantoms using volumetric tubes render slightly lower values than those obtained by our 3D imaging system (mean%±SD, 3.8%±0.98, P<0.05). To examine the reproducibility of the method, sequential imaging of melanocytic lesions is carried out. The mean%±SD differences of area, major axis length, volume, and maximum height are 2.1%±1.1, 0.9%±0.8, 3.8%±2.9, and 2.5%±3.5 …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:O3NaXMp0MMsC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Utilization of the texture uniqueness cue in stereo",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-540-72532-9_4.pdf",
            "Abstract": "The cue to depth due to the assumption of texture uniqueness has been widely utilized in approaches to shape-from-stereo. Despite the recent growth of methods that utilize spectral information (color) or silhouettes to threedimensionally reconstruct surfaces from images, the depth cue due to the texture uniqueness constraint remains relevant, as being utilized by a significant number of contemporary stereo systems [1, 2]. Certainly, combination with other cues is necessary for maximizing the quality of the reconstruction, since they provide of additional information and since the texture-uniqueness cue exhibits well-known weaknesses; eg at cases where texture is absent or at the so-called “depth discontinuities”. The goal of this work is to provide of a prolific, in terms of accuracy, precision and efficiency, approach to the utilization of the texture uniqueness constraint which can be, thereafter, combined with other cues …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Recognition of simple head gestures based on head pose estimation analysis",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.676.6128&rep=rep1&type=pdf",
            "Abstract": "A recognition method for simple gestures is proposed and evaluated. Such gestures are of interest as they are the primitive elements of more complex gestures utilized in natural communication and human computer interaction. The input to the recognition method is obtained from a head tracker that is based on images acquired from a depth camera. Candidate gestures are detected within continuous head motion and recognized, acknowledging that head pose estimates might be inaccurate. The proposed method is evaluated within the context of human-computer dialog. The reported results show that the proposed approach yields competitive recognition results to stateof-the-art approaches.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Retinal Vessel Morphological Associations with Systemic Inflammation and Subclinical Atherosclerosis in Patients with Rheumatoid Arthritis",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=3778998467486362752&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:Mojj43d5GZwC",
            "Publisher": "WILEY"
        },
        {
            "Title": "Volumetric multi-camera scene acquisition with partially metric calibration for wide-area tele-immersion",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.332.4113&rep=rep1&type=pdf",
            "Abstract": "Tele-immersion is a new medium that tries to create the illusion of virtual collocation among physically distant places. To create this sense of copresence, tele-immersion has to be visually compelling and run in real-time, putting, thus, high performance constraints in all three areas of computer vision, graphics, and networking. We describe our newest results in the scene acquisition component of tele-immersion: algorithms for volumetric scene reconstruction from multiple cameras and for calibration of camera clusters. The reconstruction algorithm is volumetric, makes no assumption on camera loci and is based on the detection of local correlation maxima in 3D. It outputs an occupancy voxel grid, with occupied voxels being accompanied by a surface normal; a fact that improves reconstruction quality. The calibration of cameras distributed in a wide area is a challenging task because it is impossible to use reference objects visible to all cameras and because wide field-of-view cameras suffer under radial distortion. Our calibration method uses a reference object to calibrate a minimum of two cameras in order to provide a euclidean world coordinate system. Then, we deliberately move an LED in front of all cameras to obtain correspondances between views. The projection matrices and radial distortion parameters of all cameras are computed using two-step factorization. The combination of the two algorithms alleviates “misregistration”[8] artifacts, encountered when concatenating reconstructions/calibrations, obtainbed from independent stereos.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Retinal image registration under the assumption of a spherical eye",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0895611116300544",
            "Abstract": "We propose a method for registering a pair of retinal images. The proposed approach employs point correspondences and assumes that the human eye has a spherical shape. The image registration problem is formulated as a 3D pose estimation problem, solved by estimating the rigid transformation that relates the views from which the two images were acquired. Given this estimate, each image can be warped upon the other so that pixels with the same coordinates image the same retinal point. Extensive experimental evaluation shows improved accuracy over state of the art methods, as well as robustness to noise and spurious keypoint matches. Experiments also indicate the method's applicability to the comparative analysis of images from different examinations that may exhibit changes and its applicability to diagnostic support.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "In vivo analysis of the time and spatial activation pattern of microglia in the retina following laser-induced choroidal neovascularization",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0014483515002389",
            "Abstract": "Microglia play a major role in retinal neovascularization and degeneration and are thus potential targets for therapeutic intervention. In vivo assessment of microglia behavior in disease models can provide important information to understand patho-mechanisms and develop therapeutic strategies. Although scanning laser ophthalmoscope (SLO) permits the monitoring of microglia in transgenic mice with microglia-specific GFP expression, there are fundamental limitations in reliable identification and quantification of activated cells. Therefore, we aimed to improve the SLO-based analysis of microglia using enhanced image processing with subsequent testing in laser-induced neovascularization (CNV).CNV was induced by argon laser in MacGreen mice. Microglia was visualized in vivo by SLO in the fundus auto-fluorescence (FAF) mode and verified ex vivo using retinal preparations.Three image processing …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:XiSMed-E-HIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Augmented Reality Interactive Exhibits in Cartographic Heritage: An implemented case-study open to the general public",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/30825750/2011_04_ica_cartographic.pdf",
            "Abstract": "This paper presents the application of the PaperView system in the domain of cartographic heritage. PaperView is a multi-user augmented-reality system for supplementing physical surfaces with digital information, through the use of pieces of plain paper that act as personal, location-aware, interactive screens. By applying the proposed method of reality augmentation in the cartographic heritage domain, the system provides the capability of retrieving multimedia information about areas of interest, overlaying information on a 2D or 3D (ie, scale model) map, as well as comparing different versions of a single map. The technologies employed are presented, along with the interactive behavior of the system, which was instantiated and tested in three setups:(i) a map of Macedonia, Greece, including ancient Greek cities with archeological interest;(ii) a glass case containing a scale model and (iii) a part of Rigas Velestinlis’ Charta. The first two systems are currently installed and available to the general public at the Archaeological Museum of Thessaloniki, Greece, as part of a permanent exhibition of interactive systems.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IMAGE CONTENT ANALYSIS AND",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=GvapCAAAQBAJ&oi=fnd&pg=PA1&dq=info:1AuMTA-UMaQJ:scholar.google.com&ots=DGrcRxG53r&sig=XnT1d-kBA5eqVHNa6r1aho-zozQ",
            "Abstract": "In this chapter the task of representing, describing, and analyzing visual informa-tion is discussed, in the context of image retrieval by content. Initially some basic specifications of the problem are presented and a classification of visual features, in a way compatible with human visual perception, is proposed. Through this discussion, it is realized that scale is an important attribute of visual content and a central issue in its description. Thus, a significant part of this chapter is devoted to the estimation and representation of primitive image content at different scales and a generic framework for this purpose is introduced. Finally, this chapter briefly considers the problem of how to derive and match descriptions of the visual content of an image in a perceptually correct manner.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Enhancing the Educational Value of Tangible and Intangible Dimensions of Traditional Crafts Through Role-Play Gaming",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-73426-8_14",
            "Abstract": "Advances in Cultural Heritage (CH) representation and presentation technologies are explored concerning new potentials brought by the gaming industry. These include the use of digitisation technologies for the creation of realistic digital assets, educational gaming concepts, and immersive technologies. In this context, it is shown how the creative sector can exploit these potentials in novel educational and gaming experiences, inspired by CH. The aim is to enhance the way that cultural content is experienced in the digital world, to present, and to valorise intangible dimensions and, ultimately, exploit technological advances to enhance our understanding, appreciation, and preservation of tangible and intangible heritage.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Microalbuminuria in Rheumatoid Arthritis: Investigating the Association with Diffuse Functional and Morphological Alterations of the Retinal Microvasculature, the Dermal Capillary Network and the Coronary Microcirculation",
            "Publication year": 2018,
            "Publication url": "https://acr.confex.com/acr/2018/meetingapp.cgi/Paper/74151",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:WqliGbK-hY8C",
            "Publisher": "ACR"
        },
        {
            "Title": "Retinal image preprocessing, enhancement, and registration",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780081028162000046",
            "Abstract": "Preprocessing and enhancement is a prerequisite for a wide range of retinal image analysis methods. The goals of such tasks are to improve images and facilitate their subsequent analysis. Registration of retinal images enables the generation of images of higher definition retinal mosaics and facilitates the comparison of images from different examinations. The above processes contribute significantly to the screening and diagnosis of a wide range of diseases. This chapter reviews preprocessing, enhancement, and registration techniques for the modalities of fundus and tomographic imaging of the human eye.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Effects of vibratory actuation on endoscopic capsule vision",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4650557/",
            "Abstract": "Current research in capsule endoscopy aims at endowing the capsules with some means of actively propelling themselves inside the gastrointestinal (GO tract, as opposed Advantages of these active capsules are the sipificant potential in the duration of the associated diagnostic procedures. as well as the oossihilitv to direct the line-of-sieht of the oh-hoard cameras towards interesting features of the GI tissue. One such means of active propulsion is by vibratory actuation, employing eccentric-mass micromotors, which is shown to reduce the friction of the capsule with the GI tract. The effect of vibrations on the quality of the acquired images is explored in the present study, which demonstrates that such vibrations do not affect adversely the diagnostic effectiveness of the endoscopic capsules. The parameters of vibratory actuation are evaluated as to the loss bf high-frequency information in the acquired images, due to …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monitoring Health Parameters of Elders to Support Independent Living and Improve Their Quality of Life",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/958948",
            "Abstract": "Improving the well-being and quality of life of the elderly population is closely related to assisting them to effectively manage age-related conditions such as chronic illnesses and anxiety, and to maintain their independence and self-sufficiency as much as possible. This paper presents the design, architecture and implementation structure of an adaptive system for monitoring the health and well-being of the elderly. The system was designed following best practices of the Human-Centred Design approach involving representative end-users from the early stages. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:2KloaMYe4IUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Accumulation of microvascular target organ damage in newly diagnosed hypertensive patients",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1933171114005154",
            "Abstract": "Early identification of hypertensive target organ damage (TOD) emerges as important for global cardiovascular risk assessment. Retinal vascular alterations, capillary rarefaction, and microalbuminuria represent different forms of microvascular TOD. However, data regarding their concomitant presence in the early stages of hypertension, the association of the number of affected organs with cardiovascular risk, and aldosterone effect on multiple TOD are lacking. We studied naïve, never-treated patients with recent duration of hypertension and healthy volunteers. Innovative software was developed to estimate retinal vascular diameters and capillary density. Biochemical parameters including microalbuminuria and serum aldosterone were derived. Framingham Risk Score was used to determine cardiovascular risk. In total 103 subjects, 66 hypertensives and 37 normotensives, were included. Hypertensive patients …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Lateral touch detection and localization for interactive, augmented planar surfaces",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-27857-5_50",
            "Abstract": "This work regards fingertip contact detection and localization upon planar surfaces to provide interactivity in augmented displays implemented upon these surfaces, by projector-camera systems. In contrast to the widely employed approach where user hands are observed from above, lateral camera placement avails increased sensitivity to touch detection. An algorithmic approach for the treatment of the laterally acquired visual input is proposed and is comparatively evaluated against the conventional.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "FORTH-ICS internal RTD Programme ambient intelligence and smart environments",
            "Publication year": 2009,
            "Publication url": "https://www.ics.forth.gr/~argyros/mypapers/2009_11_AmI09_AmI.pdf",
            "Abstract": "This paper introduces the horizontal, interdisciplinary, crossthematic RTD Programme in the field of Ambient Intelligence which has recently been initiated by the Institute of Computer Science of the Foundation for Research and Technology–Hellas, aiming to contribute towards the creation and provision of pioneering human-centric AmI technologies and smart environments.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilization of the texture uniqueness cue in stereo",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=kQvCHpuXji8C&oi=fnd&pg=PA59&dq=info:fjcP_WI9EjoJ:scholar.google.com&ots=cf4j265MbI&sig=ArM1v1o1ECaXFsOsC1chqSrOUxc",
            "Abstract": "The cue to depth due to the assumption of texture uniqueness has been widely utilized in approaches to shape-from-stereo. Despite the recent growth of methods that utilize spectral information (color) or silhouettes to threedimensionally reconstruct surfaces from images, the depth cue due to the texture uniqueness constraint remains relevant, as being utilized by a significant number of contemporary stereo systems [1, 2]. Certainly, combination with other cues is necessary for maximizing the quality of the reconstruction, since they provide of additional information and since the texture-uniqueness cue exhibits well-known weaknesses; eg at cases where texture is absent or at the so-called “depth discontinuities”. The goal of this work is to provide of a prolific, in terms of accuracy, precision and efficiency, approach to the utilization of the texture uniqueness constraint which can be, thereafter, combined with other cues to depth.The uniqueness constraint assumes that a given pixel from one image can match to no more than one pixel from the other image [3, 4]. In stereo methods, the uniqueness constraint is extended to assume that, locally, each location on a surface is uniquely textured. The main advantages of the cue derived from the uniqueness constraint over other cues to depth are the following. It is independent from silhouette-extraction, which requires an accurate segmentation (eg [5]). It is also independent of any assumption requiring that cameras occur around the scene (eg [6]) or on the same baseline (eg [7, 8]). Moreover, it does not require that cameras are spectrally calibrated, such as in voxel carving/coloring approaches (eg [9, 10, 11 …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Shape similarity by piecewise linear alignment",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.37.5975&rep=rep1&type=pdf",
            "Abstract": "A key problem when comparing planar shapes is to locate corresponding reference points, such as inflection or high curvature points. High curvature points are to be preferred, since they are psychophysically more important and are shown to be computationally more reliable. Using a scale-space of curves such ‘corners’ are located, and an empirical analysis demonstrates that high curvature points are indeed least sensitive to noise. Using reliable ‘corners’, a shift invariant and piecewise linear alignment of shapes is defined, and a similarity measure between two curves is defined using lossless compression. The measure is chosen to be proportional to the area between two shapes after piecewise alignment and to the number of data points. The proposed shape similarity is validated using a small shape database.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Retinal image registration as a tool for supporting clinical applications",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169260720317338",
            "Abstract": "Background and Objective: The study of small vessels allows for the analysis and diagnosis of diseases with strong vasculopathy. This type of vessels can be observed non-invasively in the retina via fundoscopy. The analysis of these vessels can be facilitated by applications built upon Retinal Image Registration (RIR), such as mosaicing, Super Resolution (SR) or eye shape estimation. RIR is challenging due to possible changes in the retina across time, the utilization of diverse acquisition devices with varying properties, or the curved shape of the retina.Methods: We employ the Retinal Image Registration through Eye Modelling and Pose Estimation (REMPE) framework, which simultaneously estimates the cameras’ relative poses, as well as eye shape and orientation to develop RIR applications and to study their effectiveness.Results: We assess quantitatively the suitability of the REMPE framework towards …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:tzM49s52ZIMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "53.090 Virtual rusks= 510 real smiles using a fun exergame installation for advertising traditional food products",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34292-9_15",
            "Abstract": "This paper presents an innovative advergame installation for promoting the brand and products of a company producing Cretan rusks. The paper first presents some background and related work. Then, the requirements set towards creating the game are outlined, followed by concept creation and design decisions taken to meet these requirements, as well as a description of the user interface, gameplay and technical characteristics of the resulting game. The game has been installed with remarkable success in two different food exhibitions in key locations in Athens, Greece, where it has been played by more than 500 people of ages ranging from 2 to 76 years old. A large variety of qualitative and quantitative data were collected. The paper presents several findings stemming from these data. Additionally, changes made to the game as a result of the findings are presented, along with lessons learnt from the …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A platform for monitoring aspects of human presence in real-time",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-17274-8_57",
            "Abstract": "In this paper, the design and implementation of a hardware/software platform for parallel and distributed multiview vision processing is presented. The platform is focused at supporting the monitoring of human presence in indoor environments. Its architecture is focused at increased throughput through process pipelining as well as at reducing communication costs and hardware requirements. Using this platform, we present efficient implementations of basic visual processes such as person tracking, textured visual hull computation and head pose estimation. Using the proposed platform multiview visual operations can be combined and third-party ones integrated, to ultimately facilitate the development of interactive applications that employ visual input. Computational performance is benchmarked comparatively to state of the art and the efficacy of the approach is qualitatively assessed in the context of …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Accurate scale factor estimation in 3D reconstruction",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40261-6_60",
            "Abstract": "A well-known ambiguity in monocular structure from motion estimation is that 3D reconstruction is possible up to a similarity transformation, i.e. an isometry composed with isotropic scaling. To raise this ambiguity, it is commonly suggested to manually measure an absolute distance in the environment and then use it to scale a reconstruction accordingly. In practice, however, it is often the case that such a measurement cannot be performed with sufficient accuracy, compromising certain uses of a 3D reconstruction that require the acquisition of true Euclidean measurements. This paper studies three alternative techniques for obtaining estimates of the scale pertaining to a reconstruction and compares them experimentally with the aid of real and synthetic data.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "3-D time-varying scene capture technologies—A survey",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4373330/",
            "Abstract": "Advances in image sensors and evolution of digital computation is a strong stimulus for development and implementation of sophisticated methods for capturing, processing and analysis of 3D data from dynamic scenes. Research on perspective time-varying 3D scene capture technologies is important for the upcoming 3DTV displays. Methods such as shape-from-texture, shape-from-shading, shape-from-focus, and shape-from-motion extraction can restore 3D shape information from a single camera data. The existing techniques for 3D extraction from single-camera video sequences are especially useful for conversion of the already available vast mono-view content to the 3DTV systems. Scene-oriented single-camera methods such as human face reconstruction and facial motion analysis, body modeling and body motion tracking, and motion recognition solve efficiently a variety of tasks. 3D multicamera dynamic …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A method for the registration of spectral images of paintings and its evaluation",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1296207416302370",
            "Abstract": "This work concerns the automatic registration of spectral images of paintings upon planar, or approximately planar, surfaces. An approach that capitalizes upon this planarity is proposed, which estimates homography transforms that register the spectral images into an aligned spectral cube. Homography estimation methods are comparatively evaluated for this purpose. A non-linear, robust estimation method that is based on keypoint features is adopted, as the most accurate. A marker-based, quantitative evaluation method is proposed for the measurement of multispectral image registration accuracy and, in turn, utilized for the comparison of the proposed registration method to the state of the art. For the same purpose, characteristic for this application domain, benchmark datasets that are annotated with correctly corresponding points have been compiled and are publicly availed.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:bnK-pcrLprsC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Public Systems Supporting Noninstrumented Body-Based Interaction",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-4560-96-2_2",
            "Abstract": "Body-based interaction constitutes a very intuitive way for humans to communicate with their environment but also among themselves. Nowadays, various technological solutions allow for fast and robust, noninstrumented body tracking at various levels of granularity and sophistication. This chapter studies three distinct cases showcasing different representative approaches of employing body-based interaction for the creation of public systems, in two application domains: culture and marketing. The first case is a room-sized exhibit at an archeological museum, where multiple visitors concurrently interact with a large wall projection through their position in space, as well as through the path they follow. The second example is an “advergame” used as a means of enhancing the outdoor advertising campaign of a food company. In this case, players interact with the wall-projected game world through a virtual …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "Retinal image registration based on keypoint correspondences, spherical eye modeling and camera pose estimation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7319674/",
            "Abstract": "In this work, an image registration method for two retinal images is proposed. The proposed method utilizes keypoint correspondences and assumes a spherical model of the eye. Image registration is treated as a pose estimation problem, which requires estimation of the rigid transformation that relates the two images. Using this estimate, one image can be warped so that it is registered to the coordinate frame of the other. Experimental evaluation shows improved accuracy over state-of-the-art approaches as well as robustness to noise and spurious keypoint correspondences. Experiments also indicate the method's applicability to diagnostic image enhancement and comparative analysis of images from different examinations.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An experimental evaluation of the accuracy of keypoints-based retinal image registration",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8036841/",
            "Abstract": "This work regards an investigation of the accuracy of a state-of-the-art, keypoint-based retinal image registration approach, as to the type of keypoint features used to guide the registration process. The employed registration approach is a local method that incorporates the notion of a 3D retinal surface imaged from different viewpoints and has been shown, experimentally, to be more accurate than competing approaches. The correspondences obtained between SIFT, SURF, Harris-PIIFD and vessel bifurcations are studied, either individually or in combinations. The combination of SIFT features with vessel bifurcations was found to perform better than other combinations or any individual feature type, alone. The registration approach is also comparatively evaluated against representative methods of the state-of-the-art in retinal image registration, using a benchmark dataset that covers a broad range of cases …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Retinal Images Analyzer",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.419.2855",
            "Abstract": "c○ Copyright 2011by FORTH A software application is presented, for the detection and measurement of retinal vessels in fundoscopy images. This software is comprised by a measurement module and a Graphical User Interface (GUI) module. The measurement module employs image processing methods and operates in batch mode, to segment retinal vessels in the input image. In addition, the measurement module estimates the diameters of the imaged vessels along their spatial extent in the image, based on the above segmentation. The user interface module provides methods for the automatic and interactive measurement of vessel diameters at points and regions of interest. Moreover, it provides methods for editing the vessel representation, in order to recover from segmentation errors. These two modules are integrated into a medical application. In turn, this application increases the automation of a number of vessel measurement protocols, which are of interest to medical professionals. 1 1",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Urinary albumin excretion in rheumatoid arthritis is not associated with markers of vasculopathy in distal microvascular beds",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/micc.12514",
            "Abstract": "Increased UAE is a marker of generalized vascular damage in high‐cardiovascular risk patients. However, it remains unknown whether it corresponds to a state of diffuse vasculopathy in high‐risk patients with RA.UAE was estimated in 24‐hour urine samples in RA and non‐RA individuals. Retinal arteriolar and venular diameters were calculated from retinal images with computerized software. SEVR was estimated as an index of microvascular coronary perfusion with applanation tonometry. Dermal capillary density was measured from images obtained with nailfold capillaroscopy, using specifically designed software.In a total of 111 individuals, neither UAE (5.1 [2.8‐10.8] vs 6.5 [3.0‐11.7] mg/24 h) nor prevalence of microalbuminuria (11.0% vs 8.1%) significantly differed between patients (n = 74) and controls (n = 37). In the RA group, UAE was not significantly associated with …",
            "Abstract entirety": 0,
            "Author pub id": "mT6JlBIAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scale summarized and focused browsing of primitive visual content",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-40053-2_24",
            "Abstract": "A study of local scale in images demonstrates that image features reside in different scales. Based on this observation a framework for the classification of features with respect to scale is proposed, linearly combining the visual impression of features at different scales. The proposed framework and a derived methodology are applied to typical feature extraction tasks, and in the generic case of estimating multiple scale feature distributions, as a tool for the identification of images of similar visual content. A possible formulation of queries for retrieving images by primitive visual content, taking scale into account, is also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Super resolution for fundoscopy based on 3D image registration",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6945077/",
            "Abstract": "An approach to the generation of super-resolution (SR) images from fundoscopy images is proposed that is based on the 3D registration of the original fundoscopy images. The proposed approach utilizes a simple 3D registration method to enable the application of conventional SR techniques which, otherwise, employ 2D image registration. Qualitative and quantitative comparative evaluation shows that the obtained results improve image definition and alleviate noise.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "iEat: An interactive table for restaurant customers’ experience enhancement",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39476-8_134",
            "Abstract": "An active field of research today is the technological enrichment of everyday activities using augmented reality and ambient intelligence technologies. To this end, augmenting dinner tables is a challenging task, requiring a high-quality user experience unobtrusively supporting and enhancing the user’s main goal: eating and socializing. This work presents an augmented restaurant table, facilitating customers’ ordering and enhancing their experience through entertainment and socialization features, as well as through interaction with physical objects placed upon the table surface.",
            "Abstract entirety": 1,
            "Author pub id": "mT6JlBIAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]