[{
    "name": "Οδυσσέας Κουφοπαυλου ",
    "romanize name": "Odysseas Koufopavlou ",
    "School-Department": "Ηλεκτρολόγων Μηχ & Τεχνολογίας υπολογιστών",
    "University": "upass",
    "Rank": "Καθηγητής",
    "Apella_id": 17652,
    "Scholar name": "Odysseas Koufopavlou",
    "Scholar id": "e86zmDoAAAAJ",
    "Affiliation": "Professor of Electrical and Computer Engineering, University of Patras",
    "Citedby": 3568,
    "Interests": [
        "VLSI",
        "Security",
        "Computer Networks"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=e86zmDoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "SDNRG E. Haleplidis Internet-Draft S. Denazis Intended status: Informational University of Patras Expires: January 5, 2015 K. Pentikousis EICT",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=5385033753270412752&hl=en&oi=scholarr",
            "Abstract": "Software-Defined Networking (SDN) can in general be defined as a new approach for network programmability. Network programmability refers to the capacity to initialize, control, change, and manage network behavior dynamically via open interfaces as opposed to relying on closed-box solutions and propietary-defined interfaces. SDN emphasizes the role of software in running networks through the introduction of an abstraction for the data forwarding plane and, by doing so, separates it from the control plane. This separation allows faster innovation cycles at both planes as experience has already shown. However, there is increasing confusion as to what exactly SDN is, what is the layer structure in an SDN architecture and how do layers interface with each other. This document aims to answer these questions and provide a concise reference document for SDNRG, in particular, and the SDN community, in …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ALGORITHM 3 (GEA3)",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.99.4601",
            "Abstract": "(GEA3) for data encryption. In this paper, alternative hardware implementations of the GEA3 algorithm are described. GEA3 algorithm is based on the KASUMI block cipher. Various KASUMI block cipher hardware implementations have been examined in order to provide information about the required silicon area and throughput. In order to achieve a significant performance improvement, Double Edge Triggered pipeline technique is used. The S-BOXes, which are fundamental elements of the KASUMI cipher, have been implemented by using combinational logic and ROM memories. The proposed GEA3 algorithm hardware implementation achieves throughput up to 837 Mbps, which is much faster comparing to the previous designs. The whole system is implemented and evaluated by using Field Programmable Gate Array (FPGA) devices. Keywords: GPRS security; GEA3; KASUMI; stream cipher; block cipher; S-BOX; double edge triggered (DET) pipeline.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:HIFyuExEbWQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Affine coordinate binary edwards curve scalar multiplier with side channel attack resistance",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7302306/",
            "Abstract": "Taking into account the high regularity and completeness of Binary Edwards Curves (BEC), BEC point operation efficient implementation in hardware becomes a need especially since such curves tend to be more resistant against side channel attacks than the classical Weierstrass Elliptic Curves. However, BECs require more GF(2k) operations for a single scalar multiplication. This constitutes a deterring factor for their wide adoption and standardization. In this paper, a design methodology, hardware architecture and implementation is proposed on the efficient implementation of BEC scalar multiplication accelerators. To achieve that, a parallelism approach is introduced on affine coordinate representation BECs supporting fast GF(2k) inversion through a GF(2k) inversion algorithm capable of realizing also GF(2k) multiplication. The resulting architecture using 4 parallel operating GF(2k) arithmetic units when …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:LI9QrySNdTsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "INBAND-FEC AS A LOW-COST PERFORMANCE UPGRADE TO ALREADY-DEPLOYED SDH/SONET OPTICAL COMMUNICATION CHANNELS",
            "Publication year": 2010,
            "Publication url": "http://photonics.ntua.gr/PCRL_web_site/2010-MEDJEC-Tychopoulos.pdf",
            "Abstract": "Wavelength-Conversion (WC) is an essential building-block for all-optical networks. In today’s “state of the art”, it is possible to implement all-optical WC quite efficiently using Silicon Optical Amplifiers (SOA). Yet, the high sensitivity of error-performance to the randomly fluctuating relative-polarization of SOA optical-inputs, imposes rigid tuning requirements. In order to relax these requirements, a sufficient performance-margin must be provided to the channel. Obtaining this margin by means of Forward Error Correction (FEC) is commonplace nowadays. Inevitably though, existing/legacy FEC-methods will become insufficient as optical transparency scales. To substantially upgrade the performance of already-deployed SDH/SONET channels at an affordable overall cost, we propose a hybrid FEC-scheme. Specifically, our scheme combines a standard outband-FEC method (ITU-T G. 975) with a novel inband-FEC …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-Operation cryptographic engine: VLSI design and implementation",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/092/meta",
            "Abstract": "The environment of smart card lacks of system resources but the commercial and economic transactions via smart cards demand the use of certificated and secure cryptographic methods. In this paper a cryptographic approach in hardware for smart cards is proposed. The proposed system supports two basic operations of cryptography, authentication and encryption. The basic component of system is the one round of DES algorithm which supports the DES, Triple DES and the ANSI X9. 17 standards. The proposed system is efficient in terms of area resources and techniques for low power consumption have applied. Due to the fact that the system is for smart card applications the overall throughput outperforms the typical smart card throughput standards.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:D03iK_w7-QYC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Efficient architecture and hardware implementation of the Whirlpool hash function",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1277864/",
            "Abstract": "The latest cryptographical applications demand both high speed and high security. In this paper, an architecture and VLSI implementation of the newest powerful standard in the hash families, Whirlpool, is presented. It reduces the required hardware resources and achieves high-speed performance. The architecture permits a wide variety of implementation tradeoffs. The implementation is examined and compared in the security level and in the performance by using hardware terms. This is the first Whirlpool implementation allowing fast execution, and effective substitution of any previous hash families' implementations such as MD5, RIPEMD-160, SHA-1. SHA-2 etc, in any cryptography application.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "VLSI Implementation of GSM Security: A5/1 and W7 Ciphers",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Nicolas-Sklavos/publication/229039885_VLSI_Implementation_of_GSM_Security_A51_and_W7_Ciphers/links/557219ac08ae7536374d64b9/VLSI-Implementation-of-GSM-Security-A5-1-and-W7-Ciphers.pdf",
            "Abstract": "Security is a crucial factor in the provision of the mobile services. The rapid growth of harmful attacks has increased the need for higher security level, especially in the case of wireless networks. GSM security is supported by A5/1 cipher. W7 algorithm has been proposed to be used, as a more trustworthy solution, due to the security problems that occurred concerning A5/1 strength. In this paper, architectures and VLSI implementations of both ciphers are proposed. Comparison results of both implementation cost and offered security level are also provided for A5/1 and W7 ciphers.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SDNRG E. Haleplidis Internet-Draft S. Denazis Intended status: Informational University of Patras Expires: September 4, 2014 K. Pentikousis EICT",
            "Publication year": 2014,
            "Publication url": "https://datatracker.ietf.org/meeting/89/agenda/sdnrg-drafts.pdf",
            "Abstract": "Software-Defined Networking (SDN) can in general be defined as a new approach for network programmability. Network programmability refers to the capacity to initialize, control, change, and manage network behavior dynamically via open interfaces as opposed to relying on closed-box solutions and propietary-defined interfaces. SDN emphasizes the role of software in running networks through the introduction of an abstraction for the data forwarding plane and, by doing so, separates it from the control plane. This separation allows faster innovation cycles at both planes as experience has already shown. However, there is increasing confusion as to what exactly SDN is, what is the layer structure in an SDN architecture and how do layers interface with each other. This document aims to answer these questions and provide a concise reference document for SDNRG, in particular, and the SDN community, in general, based on relevant peer-reviewed literature and documents in the RFC series.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:epqYDVWIO7EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Employing concatenated-FEC to mitigate polarization-sensitivity in all-optical wavelength-conversion",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4610701/",
            "Abstract": "Wavelength-conversion is an essential block in building all-optical networks. Currently, all-optical wavelength-conversion can quite efficiently be performed by means of SOA. In this approach however, a significant shortcoming is the high sensitivity of error-performance to the relative polarization of optical-signals, which imposes rigid tuning requirements. To make conversion insensitive to random fluctuations of polarization, we employ a standard outband-FEC method, in combination with a novel inband-FEC method. The latter, called ldquoFOCUSrdquo, is best suited for combating burst-form errors. This particular property of ldquoFOCUSrdquo matches the error-distribution generated by the associated outband-FEC code, when the two are combined in serial-concatenation. We demonstrate the corrective-power of this FEC-concatenation scheme in protecting a 10 Gb/s lightwave-channel, which undergoes …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new low power and high speed bidirectional shift register architecture",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/1928099/c02.pdf",
            "Abstract": "In this paper a new, low power and high speed Bidirectional Shift Register (BSR) architecture is presented. It can be used for the design and the implementation of hard arithmetic operations. Reconfigurable computing, and cryptographic algorithms are two application examples where by using the new BSR their power and speed can be improved. Comparing to the conventional design, the proposed achieves 19-42% power consumption reduction with simultaneous 25% reduction of the covered area. So the new design fits perfectly in designs with hard specifications of power dissipation and covered area (eg wireless). The whole design was captured by using VHDL language, and for the synthesis a 0.7 um CMOS standard cell library was used. The power measurements were taken with a custom design tool that was developed in our laboratory.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Networking data integrity: High speed architectures and hardware implementations",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.167.1829&rep=rep1&type=pdf",
            "Abstract": "Hash functions are widely used in encryption schemes and security layers of communication protocols (wap, ipsec) for data integrity, digital signature and message authentication codes. In addition to the demanded high security level, the need for high performance is a major factor of the security implementations. In this work, an ultra high speed architecture for the hardware implementation of both md5 and sha-1 is proposed. Both hash functions have been developed with vhdl description language and have been integrated in fpga devices. The introduced md5 implementation performance is equal to 2, 1 gbps while sha-1 proposed implementation achieves throughput equal to 2, 3 gbps. Both proposed implementations are compared in throughput, operating frequency and in the area-delay product, with other related works. From these comparisons, it is proven that the md5 proposed implementation is better by a factor range from 700% to 1500%. The sha-1 proposed implementation is better by about 800% to 1700% in the term of performance, compared with the other conventional works.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A RAM-based FPGA implementation of the 64-bit MISTY1 block cipher",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1465667/",
            "Abstract": "A high-throughput hardware architecture and FPGA implementation of the 64-bit NESSIE proposal, MISTY1 block cipher, is presented in this paper. This architecture, in contrast to previous ones, supports both encryption and decryption processes. It is based on the unrolling of the MISTY1 rounds in a 75-stage pipeline. Furthermore, the implementation of the proposed architecture in specific FPGA devices utilizes the embedded RAM blocks of those devices. A throughput of up to 12.6 Gbit/s can be achieved at a clock frequency of 168 MHz. So, the proposed architecture is suitable for applications with high throughput requirements, like in contemporary and future wireless communication standards.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-power implementation of an encryption/decryption system with asynchronous techniques",
            "Publication year": 2002,
            "Publication url": "https://www.hindawi.com/archive/2002/732414/abs/",
            "Abstract": "An asynchronous VLSI implementation of the International Data Encryption Algorithm (IDEA) is presented in this paper. In order to evaluate the asynchronous design a synchronous version of the algorithm was also designed. VHDL hardware description language was used in order to describe the algorithm. By using Synopsys commercial available tools the VHDL code was synthesized. After placing and routing both designs were fabricated with 0.6 μm CMOS technology. With a system clock of up to 8 MHz and a power supply of 5 V the two chips were tested and evaluated comparing with the software implementation of the IDEA algorithm. This new approach proves efficiently the lowest power consumption of the asynchronous implementation compared to the existing synchronous. Therefore, the asynchronous chip performs efficiently in Wireless Encryption Protocols and high speed networks.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Architectures and FPGA Implementations of the 64-bit MISTY1 Block Cipher",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218126606003362",
            "Abstract": "In this paper, we present two alternative architectures and FPGA implementations of the 64-bit NESSIE proposal, MISTY1 block cipher. The first architecture is suitable for applications with high-performance requirements. A throughput of up to 12.6 Gbps can be achieved at a clock frequency of 168 MHz. The main characteristic of this architecture is that uses RAM blocks embedded in modern FPGA devices in order to implement the S-boxes defined in the block cipher algorithm. The second architecture can be used in implementing applications on area-constrained systems. It utilizes feedback logic and inner pipeline with negative edge-triggered register. This technique shortens the critical path, without increasing the latency of the MISTY1 algorithm execution. Compared with an implementation without inner pipeline, performance improvement of 97% is achieved. The measured throughput of the second architecture …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:ZHo1McVdvXMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "An optimal low-power/high performance DDP-based Cobra-H64 cipher",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/65486376/An_optimal_low-powerhigh_performance_DDP20210122-31062-7cc71s.pdf",
            "Abstract": "A new layout design for a data dependent permutation (DDP)-Cobra H64-bit cipher optimized for low-power and high speed operation is presented in this paper. The layout is characterized as a design for mobile and handheld equipment. The design achieves low power consumption by using low power logic gates in layout level. Through the technique of pipelining in the internal rounding blocks of the Cobra cipher and an increase in the frequency of the circuit from 90MHz to 140MHz, the design achieves increased speed and performance, resulting in throughput ranging from 5.5 Gbps to 8.4 Gbps. Simulation results based on the layout level have confirmed the validity of the proposed technique, as well as confirmed that low power, speed and performance can be optimized through design at the layout level.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A systolic inversion architecture based on modified extended euclidean algorithm for GF (2k) fields",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4263558/",
            "Abstract": "In this paper, a systolic inversion architecture is proposed based on an optimized version of the Modified Extended Euclidean Algorithm (OMEEA). The proposed OMEEA employs signal reusability and simplification of the algorithmic control logic to achieve a less complex, hardware oriented version of Modified Extended Euclidean Algorithm. The resulting proposed systolic inversion architecture highlights the benefits of OMEEA and achieves very interesting results in terms of latency, critical path delay and gate-MUX-Flip Flop number.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lightweight Efficient Simeck32/64 Crypto-Core Designs and Implementations, for IoT Security",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8920349/",
            "Abstract": "IoT is a rapidly expanding environment. More and more devices, from the most high-end smartphones, to the most modest environmental sensors, already exhibit or acquire the ability to communicate with each other and be parts of networks. Connectivity is mainly accomplished through wireless communications and privacy is the way to go, regarding security over the air. A common approach dictates the incorporation of a crypto-core inside the transceiver. However, a privacy implementation must take into account several restrictions, imposed by the constrained resources of a small, power efficient device. For this purpose, an incorporation of a hardware implemented lightweight Simeck32/64 block cipher for IEEE 802.15.4 transceiver was proposed. In this work, we examine the FPGA implementation cost of such an approach, and we propose newly designed and efficient implementations of the proposed Simeck32 …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:umqufdRvDiIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Area optimized architecture and VLSI implementation of a multi-coder processor for the WTLS",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1562525/",
            "Abstract": "The rapidly growth of the transmitted data amount, over wireless networks, has triggered special needs for compression, in an attempt for real-time communications. Wireless Transport Layer Security (WTLS) is the security layer for both Wireless Application Protocol and Open Mobile Alliance. In spite of the fact that a great number of ciphers have been specified in WTLS, the compression unit is optional Compression in wireless portable devices is a sensitive issue due to the restricted resources environment. The composite compression encoders allocate area that system can not support. In this paper, an area-optimized multi-coder processor is proposed for the WTLS. The proposed system consists of three units and serves three different types of compression: speech (ADPCM), text (Huffman) and image (RLE). The proposed processor minimizes the area resources compared with other published works and has …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "VITAL++, a new communication paradigm: embedding P2P technology in next generation networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5681020/",
            "Abstract": "This article describes the major components and their interactions of a novel architecture called VITAL++ that combines the best features of the two seemingly disparate worlds, peer-to-peer and NGN in particular IMS, which is then used to support multimedia applications and content distribution services. To this end, P2P is enhanced with advanced authentication and DRM mechanisms while NGN have become more scalable, reliable and less centralized by exploiting P2P self-organization properties. We describe novel P2P algorithms for optimizing network resources in order to efficiently distribute content among various users without resorting to laborious management operations required in NGN.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Studying OpenCL-based Number Theoretic Transform for heterogeneous platforms",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9556376/",
            "Abstract": "Lattice based cryptography can be considered a candidate alternative for post-quantum cryptosystems offering key exchange, digital signature and encryption functionality. Number Theoretic Transform (NTT) can be utilized to achieve better performance for these functionalities, where polynomials are needed to be multiplied. NTT simplifies the multiplication overhead allowing point-wise multiplication by transforming the polynomials into the spectral domain and then inversing the result to the original domain. It is important to optimize this technique that is used in a wide range of computing systems. In this paper we study the feasibility of using OpenCL, a portable framework, to implement a parallelized version of NTT which allows deployment on heterogeneous platforms, such as Graphic Processing Units (GPUs) and Field Programmable Gate Arrays (FPGAs). We measure the performance of our implementation on …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:3htObqc8RwsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Montgomery modular multiplier architectures and hardware implementations for an RSA cryptosystem",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1562402/",
            "Abstract": "This paper describes and analyses the Montgomery multiplication algorithm and proposes two scalable, systolic architectures and hardware implementations based on this algorithm in order to be used for an RSA module. The conventional architecture uses the original version of Montgomery multiplication algorithm and the optimized architecture a modified version of the algorithm. The second architecture is considerably better than the first one. Both architectures follow carry-save redundant logic and in comparison with other known architecture give interesting results in term of clock frequency, multiplication time and chip covered area",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Open mobile alliance (OMA) security layer: Architecture, implementation and performance evaluation of the integrity unit",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/BF03037652",
            "Abstract": "Security has become a very critical issue in the provision of mobile services. The Open Mobile Alliance (OMA) has specified a powerful security layer, the WTLS. In this paper, a VLSI architecture for the implementation of the WTLS integrity unit is proposed. The proposed architecture is reconfigurable in the sense that operates in three different modes: as Keyed-Hash Authentication Code (HMAC), as SHA-1 and MD5 hash functions, according to WTLS specifications. This multi-mode operation is achieved due to the reconfigurable applied design technique in the proposed architecture, which keeps the allocated area resources at a minimized level. The proposed architecture achieves high speed performance, due to the pipeline designed architecture. Especially, SHA-1 operation achieved throughput is equal to 1,7 Gbps, while MD5 operation mode bit rate is equal to 2,1 Gbps. The proposed architecture has …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Improved throughput bit-serial multiplier for GF(2m) fields",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=12633963719378807067&hl=en&oi=scholarr",
            "Abstract": "High throughput is a crucial factor in bit-serial GF(2m) fields multiplication for a variety of different applications including cryptography, error coding detection and computer algebra. The throughput of a multiplier is dependent on the required number of clock cycles to reach a result and its critical path delay. However, most bit-serial GF(2m) multipliers do not manage to reduce the required number of clock cycles below the threshold of m clock cycles without increasing dramatically their critical path delay. This increase is more evident if a multiplier is designed to be versatile. In this article, a new versatile bit-serial MSB multiplier for GF(2m) fields is proposed that achieves a 50% increase on average in throughput when compared to other designs, with a very small increase in its critical path delay. This is achieved by an average 33.4% reduction in the required number of clock cycles below m. The proposed design can handle arbitrary bit-lengths upper bounded by m and is suitable for applications where the field order may vary. © 2008 Elsevier B.V. All rights reserved.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:mNrWkgRL2YcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A design strategy for digit serial multiplier based binary edwards curve scalar multiplier architectures",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8049789/",
            "Abstract": "Binary Edwards Curves (BEC) constitute an alternative to the standardized Weierstrass elliptic curve (EC) equations since the latter have intrinsic side channel attack vulnerabilities due to their lack of point operation uniformity. Thus, BECs have gained popularity over the past few years due to their uniformity, operation regularity, completeness and implementation attractiveness. However, BEC Scalar multiplication hardware implementations are still lacking in performance when compared to their Weierstrass equivalent. In this paper, a design strategy/methodology is proposed in order to realizeBEC Scalar multipliers with a good trade-off between computation speed and utilized hardware resources. The strategy is based on a GF(2k) operations parallelism mechanism that aims at the minimization of idle states in the utilized processing elements as well as the minimization of employed storage andcontrol elements …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:FPJr55Dyh1AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrated Circuit and System Design: Power and Timing Modeling, Optimization and Simulation; 14th International Workshop, PATMOS 2004, Santorini, Greece, September 15-17, 2004, Proceedings",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=DzPyBwAAQBAJ&oi=fnd&pg=PA1&dq=info:DUkb3Ghm_bMJ:scholar.google.com&ots=GJAEM9_2y0&sig=X4bfmKGwg8Je1HNqrGwP-dg88_w",
            "Abstract": "WelcometotheproceedingsofPATMOS2004, thefourteenthinaseriesofint-national workshops. PATMOS 2004 was organized by the University of Patras with technical co-sponsorship from the IEEE Circuits and Systems Society. Over the years, the PATMOS meeting has evolved into an important-ropean event, where industry and academia meet to discuss power and timing aspects in modern integrated circuit and system design. PATMOS provides a forum for researchers to discuss and investigate the emerging challenges in-sign methodologies and tools required to develop the upcoming generations of integrated circuits and systems. We realized this vision this year by providing a technical program that contained state-of-the-art technical contributions, a keynote speech, three invited talks and two embedded tutorials. The technical program focused on timing, performance and power consumption, as well as architectural aspects, with particular emphasis on modelling, design, charac-rization, analysis and optimization in the nanometer era. This year a record 152 contributions were received to be considered for p-sible presentation at PATMOS. Despite the choice for an intense three-day m-ting, only 51 lecture papers and 34 poster papers could be accommodated in the single-track technical program. The Technical Program Committee, with the-sistance of additional expert reviewers, selected the 85 papers to be presented at PATMOS and organized them into 13 technical sessions. As was the case with the PATMOS workshops, the review process was anonymous, full papers were required, and several reviews were received per manuscript.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Springer"
        },
        {
            "Title": "Dynamic service deployment using an ontologybased description of devices and services",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4438329/",
            "Abstract": "In the FlexiNET 1ST research project a service called Dynamic Service Deployment dynamically installs, monitors and uninstalls new services upon user demand, or by a default configuration. There was a need for a module to keep all the required information, in terms of resources, of the FlexiNET Wireless Access Node. For that purpose the Node Model was designed and implemented. The current paper describes in detail the modeling and implementation of an OWL-based Distributed Router's architecture in order to provide a formal and well defined framework to describe devices and their services, in terms of resources, to support effective service discovery and implementation. The proposed approach is trying to give a more dynamic approach to the already used Node model by adopting what the Semantic-web is offering in the area of modeling and well defining of devices. In this framework a more dynamic …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "eerses denser NEGFHúM",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=7512330947732561918&hl=en&oi=scholarr",
            "Abstract": "A low-power design circuit using low-swing voltage technique is proposed in this paper. The proposed technique could be used in order to decrease the power dissipation in three different types of logic gates namely the complementary pass-transistor logic (CPL), the cascade voltage switch logic (CVSL), and the domino logic. The main idea of the proposed technique is based on the replacement of the conventional CMOS inverter at the output of the logic gates with a new low-swing voltage inverter based on multithreshold voltage technology (LSIM). The inserted LSIM achieves a reduction in the static power dissipation, the dynamic power dissipation as the propagation delay time of the gates. To demonstrate the impact of the proposed technique in different applications, various types of circuits are designed for different conditions of speed operation, load capacitance and supply voltages. In order to ensure the …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:FAceZFleit8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a resource management and service deployment framework",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/nem.672",
            "Abstract": "Owing to the increase in both heterogeneity and complexity in today's networking systems, the need arises for new network‐based services architectures. They must provide flexibility and efficiency in the definition, deployment and execution of the services and, at the same time, handle the adaptability and evolution of such services. In this paper we present an approach that applies a Web‐service‐based resource management framework. It enables the provision of parallel applications as QoS‐aware applications, whose performance characteristics may be dynamically negotiated between a client application and service providers. Our component model allows context dependencies to be explicitly expressed and dynamically managed with respect to the hosting environment, computational resources and dependencies on other components. In such a model the resource management, in terms of representation …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:XiVPGOgt02cC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Multi-level low swing voltage values for low power design applications",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/922306/",
            "Abstract": "A new low-power design method based on multiple low swing internal voltage values is proposed in this paper. It can be applied in logic circuits, which are designed with different logic family techniques such as Complementary Pass Transistor Logic (CPL), Domino Logic and Cascade Voltage Switch Logic (CVSL). The goal of this method is the reduction of the circuit power dissipation, with only a negligible increase in the area, without a reduction in the circuit operating speed. This is achieved with the replacement of a number of selected full swing voltage circuit components by low swing voltage components. The application of the proposed technique in a CPL 4-bit multiplier proved that 70% power dissipation reduction was achieved, with 30% area overhead, and no reduction in the circuit speed.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Full custom low-power/high performance DDP-based Cobra-H64 cipher",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790609000706",
            "Abstract": "This paper presents, for the first time, a full custom layout design for a Data Dependent Permutation (DDP)-Cobra H64-bit cipher, using pipelining techniques in the internal rounds blocks to increase the throughput of the design. As a result, the silicon area and the power dissipation are reduced too. The design achieves a small area by simplifying the complex design by simpler designs. Low power consumption is satisfied by using low power logic gates. The throughput ranges from 5.5 to 8.4 Gbps. Simulation results based on the layout level have confirmed the validity of the proposed technique, as well as have confirmed that low power, speed and performance can be optimized through design at the layout level.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An ultra high speed architecture for VLSI implementation of hash functions",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301675/",
            "Abstract": "Today, security is a topic which attacks the great interest of researchers. Many encryption algorithms have been investigated, and developed in the last years. The research community efforts are also centered to the efficient implementation of them, in both software platforms and hardware devices. This work is related to hash functions FPGA implementation. Two different hash functions are studied: RIPEMD-160 and SHA-1. A high speed architecture is proposed for the implementation of both of them in the same hardware module. The proposed system reaches throughput values equal to 1,4 for SHA-1 and 1,6 for RIPEMND-160. The proposed system is compared with other related works in both software and hardware.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "VLSI design and implementation of reconfigurable cryptographic systems for symmetric encryption",
            "Publication year": 2005,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13979",
            "Abstract": "In this paper a reconfigurable cryptographic system is proposed. The proposed architecture is based on RC5 [1] algorithm standard but it can operate with any cipher. The relationship between the number of block bits, the number of cryptographic rounds (system security), the covered system area resources, and the system's throughput is examined. The proposed cryptographic system is reconfigurable for the number of block bits and the number of cryptographic rounds. These parameters control the system security and the system's throughput. The reconfigurability allows to system adopt temporary parameters in order to be suitable for cryptographic transactions. Finally a parametric VLSI design methodology is proposed for constructing cryptographic systems for symmetric encryption.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hardware implementation of the A5/3 & A5/4 GSM encryption algorithms",
            "Publication year": 2006,
            "Publication url": "https://www.wacong.org/wac2006/allpapers/ifmip/ifmip_196.pdf",
            "Abstract": "In this paper an efficient hardware implementation of A5/3 and A5/4 GSM encryption algorithms is proposed. The proposed implementation integrates in the same hardware module a 64-bit up to 128-bit key length capability. This feature enables the ability to use the same hardware module for the both algorithms. Independently of the key length for both algorithms the proposed VLSI Implementation achieves a data throughput up to 166Mbps in a maximum frequency of 130MHz. The whole design was captured using VHDL and a FPGA device was used for the hardware implementation of the architecture. A detailed analysis, in terms of performance and covered area is shown.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparing design approaches for elliptic curve point multiplication over GF (2ˆk) with polynomial basis representation",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933115001088",
            "Abstract": "Point Multiplication (PM) is considered the most computationally complex and resource hungry Elliptic Curve Cryptography (ECC) mathematical operation. PM hardware accelerator design can follow several approaches that lead to a fast, small or flexible implementation, meeting related application specifications. However, each PM design decision has certain outcomes in utilized hardware resources and computation speed. Such a key design decision is related to the structure of the GF (2 k) multipliers to be employed in the PM accelerator. In this paper, we highlight the GF (2 k) multiplication role in the overall PM performance and investigate what are the trade-offs on a PM accelerator when using bit serial or bit parallel multiplication approach in terms of speed, chip covered area and flexibility. To achieve this goal, we estimate these tradeoffs for a single point operation and specify realistic design cases for bit …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:tuHXwOkdijsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "State-of-the-Art Security in Grid Computing",
            "Publication year": 2007,
            "Publication url": "https://www.taylorfrancis.com/chapters/oa-edit/10.1201/9780849379253-13/state-art-security-grid-computing-giorgos-kostopoulos-nicolas-sklavos-odysseas-koufopavlou",
            "Abstract": "206In the last decade we have witnessed the dramatic increase of interest in grid computing as an innovative extension to distributed computing technology. This technology is achieving computing resource sharing among participants in a collection of virtual organizations. Grid computing is a computing model that provides the ability to perform higher throughput computing by taking advantage of many networked computers to model virtual computer architectures. This kind of architecture is able to distribute process execution across a parallel infrastructure.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:5awf1xo2G04C",
            "Publisher": "Auerbach Publications"
        },
        {
            "Title": "64-bit Block ciphers: hardware implementations and comparison analysis",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790605000108",
            "Abstract": "A performance comparison for the 64-bit block cipher (Triple-DES, IDEA, CAST-128, MISTY1, and KHAZAD) FPGA hardware implementations is given in this paper. All these ciphers are under consideration from the ISO/IEC 18033-3 standard in order to provide an international encryption standard for the 64-bit block ciphers. Two basic architectures are implemented for each cipher. For the non-feedback cipher modes, the pipelined technique between the rounds is used, and the achieved throughput ranges from 3.0 Gbps for IDEA to 6.9 Gbps for Triple-DES. For feedback ciphers modes, the basic iterative architecture is considered and the achieved throughput ranges from 115 Mbps for Triple-DES to 462 Mbps for KHAZAD. The throughput, throughput per slice, latency, and area requirement results are provided for all the ciphers implementations. Our study is an effort to determine the most suitable algorithm for …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Revisiting Rowhammer Attacks in Embedded Systems",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8734936/",
            "Abstract": "As the cell density of DRAM modules keeps increasing to guarantee the growing demand for memory capacity in modern computer and embedded system, the electromagnetic interference between memory cells increase significantly, leading to security vulnerabilities that can be exploited. In particular, the widespread Rowhammer vulnerability has been proven to exist in the most common DRAM modules manufactured after 2012. In this paper we are revisiting the exploitation approaches using the Rowhammer bug and we are providing an overall study of their security implications on Embedded Systems such as mobiles or tablets based on ARM architecture. Furthermore, we present our implementation approach on the Phys Feng Shui methodological attack for Android on a LG Nexus 5 device and we highlight the practical issues that arise when trying to trigger the Rowhammer attack on a real system.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:4hFrxpcac9AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable playback rate control in P2P live streaming systems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s12083-015-0403-6",
            "Abstract": "Current commercial live video streaming systems are based either on a typical client–server (cloud) or on a peer-to-peer (P2P) architecture. The former architecture is preferred for stability and QoS, provided that the system is not stretched beyond its bandwidth capacity, while the latter is scalable with small bandwidth and management cost. In this paper, we propose a P2P live streaming architecture in which by adapting dynamically the playback rate we guarantee that peers receive the stream even in cases where the total upload bandwidth changes very abruptly. In order to achieve this we develop a scalable mechanism that by probing only a small subset of peers monitors dynamically the total available bandwidth resources and a playback rate control mechanism that dynamically adapts playback rate to the aforementioned resources. We model analytically the relationship between the playback rate and …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:MLfJN-KU85MC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Machine Learning Attacks and Countermeasures on Hardware Binary Edwards Curve Scalar Multipliers",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1229874",
            "Abstract": "Machine Learning techniques have proven effective in Side Channel Analysis (SCA), enabling multiple improvements over the already-established profiling process of Template Attacks. Focusing on the need to mitigate their impact on embedded devices, a design model and strategy is proposed that can effectively be used as a backbone for introducing SCA countermeasures on Elliptic Curve Cryptography (ECC) scalar multipliers. The proposed design strategy is based on the decomposition of the round calculations of the Montgomery Power Ladder (MPL) algorithm and the Scalar Multiplication (SM) algorithm into the underlined finite field operations, and their restructuring into parallel-processed operation sets. Having as a basis the proposed design strategy, we showcase how advanced SCA countermeasures can be easily introduced, focusing on randomizing the projective coordinates of the MPL round’s ECC point results. To evaluate the design approach and its SCA countermeasures, several simple ML-based SCAs are performed, and an attack roadmap is provided. The proposed roadmap assumes attackers that do not have access to a huge number of leakage traces, and that have limited resources with which to mount Deep Learning attacks. The trained models’ performance reveals a high level of resistance against ML-based SCAs when including SCA countermeasures in the proposed design strategy.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:OcBU2YAGkTUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "FPGA implementation cost and performance evaluation of IEEE 802.11 protocol encryption security schemes",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/088/meta",
            "Abstract": "The explosive growth of internet and consumer demand for mobility has fuelled the exponential growth of wireless communications and networks. Mobile users want access to services and information, from both internet and personal devices, from a range of locations without the use of a cable medium. IEEE 802.11 is one of the most widely used wireless standards of our days. The amount of access and mobility into wireless networks requires a security infrastructure that protects communication within that network. The security of this protocol is based on the wired equivalent privacy (WEP) scheme. Currently, all the IEEE 802.11 market products support WEP. But recently, the 802.11 i working group introduced the advanced encryption standard (AES), as the security scheme for the future IEEE 802.11 applications. In this paper, the hardware integrations of WEP and AES are studied. A field programmable gate array …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Data dependent rotations, a trustworthy approach for future encryption systems/ciphers: low cost and high performance",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404803007065",
            "Abstract": "This work focuses an alternative direction of cryptography, based on Data Dependent Rotations (DDR). This methodology gives many promises for secure communication networks of the next years. DDR transformations have attracted the interest of researchers, and a great number of new ciphers have been developed. These encryption algorithms are intended to be used in all the applications of present and future. The article summarizes the key issues for this new approach and presents both performance and implementation cost of DDR implementations. The purpose of this work is to provide a state-of-the-art overview on DDR ciphers, which are proved a trustworthy applied methodology for modern cryptography.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Hardware implementation of the SAFER+ encryption algorithm for the Bluetooth system",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1010598/",
            "Abstract": "In this paper, a VLSI implementation for the SAFER+ encryption algorithm is presented. The combination of security, and high speed implementation, makes SAFER+ a very good choice for wireless systems. The SAFER+ algorithm is a basic component in the authentication Bluetooth mechanism. The relation between the algorithm properties and the VLSI architecture are described. The whole design was captured entirely in VHDL using a bottom-up design and verification methodology. A FPGA device was used for the hardware implementation of the algorithm. The proposed VLSI implementation of the SAFER+ algorithm reduces the covered area about 25 percent, and achieves a data throughput up to 320 Mbit/s at a clock frequency of 20 MHz.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pure DDP-Based Cipher: Architecture Analysis, Hardware Implementation Cost and Performance up to 6.5 Gbps.",
            "Publication year": 2005,
            "Publication url": "https://www.ccis2k.org/iajit/PDF/vol.2,no.1/4-Nicolas.pdf",
            "Abstract": "Using Data-Dependent (DD) Permutations (DDP) as main cryptographic primitive, a new 64-bit block cipher is presented, ten-round DDP-64. Since the sum of all outputs of the conventional DDP is a linear Boolean function, non-linear DDP-based operation F is used additionally in DDP-64. The DDP-64 is a pure DDP-based cipher, ie it uses only permutations and the XOR operation. The designed cipher uses very simple key scheduling that defines high performance, especially in the case of frequent key refreshing. A novel feature of DDP-64 is the use of the switchable operation preventing the weak keys. The offered high level security strength does not sacrifice the implementation performance of DDP-64. Design and hardware implementation architectures of this cipher are presented. The synthesis results for both Field Programmable Gate Arrays (FPGA) and Application Specific Integrated Circuits (ASIC) implementations prove that DDP-64 is very flexible and powerful new cipher, especially for high speed WLANs and WPANs. The achieved hardware performance up to 6.5 Gbps and the implementation area cost of DDP-64 are compared with other ciphers, used in security layers of wireless protocols (Bluetooth, WAP, OMA, UMTS and IEEE 802.11). From these comparisons, it is proven that DDP-64 is a flexible new cipher with better performance in most of the cases, suitable for wireless communications networks of present and future.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wireless Networks World and Security Algorithms",
            "Publication year": 2005,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9780203323687-17/wireless-networks-world-security-algorithms-nicolas-sklavos-nikolay-moldovyan-odysseas-koufopavlou",
            "Abstract": "Wireless communication protocols have specified security layers that support encryption with high-level strength. The performance results of these integrations, in some cases, cannot meet all the wireless communications standards and specified security demands. This chapter is a survey on the advantages and trade-offs of the different implementation approaches to wireless protocol security. Alternative solutions are proposed, so that the implementation problem can be faced successfully. The different solutions to this issue are compared in terms of both performance and supported security level. Technical specifications for software and hardware implementations of the past and present are given. Future directions on both cipher",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Auerbach Publications"
        },
        {
            "Title": "Software and hardware issues in smart card technology",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5208738/",
            "Abstract": "An efficient and strongly secure smart card mechanism involves the use of a technological background taken from the fields of computers, VLSI design and material science. The result of such a mixture is a miniature, fully operational, computation system. The nature of the data involved in smart card transactions and smart card intended uses, introduce another important factor in the smart card design mechanism which is security. The evolution of VLSI technology allows the efficient implementation of costly cryptographic operations in the smart card design methodology. Apart from the traditional cryptographic algorithms, additional techniques and special design materials have been introduced in order to protect the smart card system from cryptanalytic attacks. New architectures of software design, like object-oriented programming, give the opportunity to implement programmable multi-application cards. Thus …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic Deployment of Semantic-based Services in a Highly Distributed Environment.",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Christos-Chrysoulas/publication/281451804_Dynamic_Deployment_of_Semantic-based_Services_in_a_Highly_Distributed_Environment/links/55e8638e08ae65b638997efd/Dynamic-Deployment-of-Semantic-based-Services-in-a-Highly-Distributed-Environment.pdf",
            "Abstract": "The increase in both heterogeneity and complexity in today’s networking systems, arises the need for an architecture for network-based services that provides flexibility and efficiency in the definition, deployment and execution of the services In this paper we present an approach that applies a Semantic-based Service deployment framework, which enables the provision of parallel applications as QoS-aware, whose performance characteristics may be dynamically negotiated between a client application and service providers. Our component model allows context dependencies to be explicitly expressed and dynamically managed with respect to the hosting environment, computational resources, and dependencies on other components.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security of ICs from Hardware Trojans",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Nicolas-Sklavos/publication/275765372_Security_of_ICs_from_Hardware_Trojans/links/575542ae08ae10c72b65ac1a/Security-of-ICs-from-Hardware-Trojans.pdf",
            "Abstract": "In recent years wireless communications have become an important part of our everyday life. We rely on our wireless devices and the companies who provide them. However, questions like how safe can our devices be or how secure can our wireless communications be, rise up almost every day. In parallel with these questions, the appearance of Hardware Trojans rise up too. Our work presents a Hardware Trojan Detection Framework in wireless cryptographic integrated circuits. There are two Hardware Trojans created and inserted in a mixedsignal integrated circuit, which do not change the functionality of the system, but can leak secret information from it. The way to expose these leaks can be done by measuring different statistics, eg transmission frequency, amplitude, power of the wireless transmission signal.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:foquWX3nUaYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Whirlpool hash function: architecture and vlsi implementation",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1329416/",
            "Abstract": "New encryption algorithms have to operate in a variety of current and future applications demanding both high speed and high security. An architecture and VLSI implementation of the newest standard in the hash families, Whirlpool that achieves high-speed performance is presented. The architecture permits a wide variety of implementation tradeoffs. The design was coded using VHDL language and for the hardware implementation a FPGA device was used. While no other previous Whirlpool implementation exist, the comparison with previous hash families' implementations such as MD5, SHA-1, SHA-2 etc are given. These comparisons prove that the Whirlpool implementation is much faster compared with these previous implementations.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pervasive Computing Security: Bluetooth® Example",
            "Publication year": 2008,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420052824-12/pervasive-computing-security-bluetooth%C2%AE-example-giorgos-kostopoulos-paris-kitsos-odysseas-koufopavlou",
            "Abstract": "The proliferation of wireless handheld devices and advances in network technologies, and the desire to stay connected anytime and anywhere, have ushered in the domain of mobile and pervasive computing. Bluetooth and pervasive computing have much in common: Both aim to make computing and communications easier, more convenient, and more personal. The link level functions are defined in the Bluetooth Baseband and the Link Manager Protocol Specifications. Bluetooth layer security uses four key elements: a Bluetooth device address, two separate key types (authentication and encryption), and a random number. The proposed layer is added on the top of the standard Bluetooth controller interface, which allows integrating it as an additional module into any standard Bluetooth chip or as a software layer into a host. The data transfer entity conveys application data between enhanced security layer …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Auerbach Publications"
        },
        {
            "Title": "Introduction to the Special Issue on ICECS'99 Guest Editorial",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.1023/A%3A1011288317987",
            "Abstract": "Introduction to the Special Issue on ICECS '99 Guest Editorial | Analog Integrated Circuits and \nSignal Processing ACM Digital Library home ACM home Google, Inc. (search) Advanced \nSearch Browse About Sign in Register Advanced Search Journals Magazines Proceedings \nBooks SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced \nSearch Analog Integrated Circuits and Signal Processing Periodical Home Latest Issue Archive \nAuthors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsAnalog Integrated \nCircuits and Signal ProcessingVol. , No. -2Introduction to the Special Issue on ICECS '99 \nGuest Editorial article Introduction to the Special Issue on ICECS '99 Guest Editorial Share on \nAuthors: Piero Malcovati profile image Piero Malcovati Department of Electrical Engineering, \nUniversity of Pavia Department of Electrical Engineering, University of Pavia View Profile , G …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "VLSI implementation of the keyed-hash message authentication code for the wireless application protocol",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301967/",
            "Abstract": "Security has become a highly critical issue in the provision of mobile services. The Wireless Application Protocol (WAP) has specified a powerful security layer, the WTLS. The Keyed-Hash Authentication Code (HMAC) has been adopted by the WTLS in order to support the special demands for authentication with security of high-level strength. A VLSI architecture and the FPGA implementation of HMAC for the WTLS are proposed in this work. The introduced design is based on the SHA-1 hash function. The implementation results for both the HMAC and the SHA-1 proposed architectures are compared with other related works. From these comparisons, it is proven that the proposed system performs better in all of the cases. It is also superior to the conventional hardware implementations by using the area-delay product. In addition to the WAP protocol, the proposed architecture can be implemented for any …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A flexible leakage trace collection setup for arbitrary cryptographic IP cores",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8383902/",
            "Abstract": "Leakage Assessment and Side Channel Attacks (SCA) leakage trace acquisition tools and platforms require a considerable amount of time to collect millions of traces and rely on custom, hard to change or handle acquisition control mechanisms. To match these problems, in this paper, a flexible and scalable architecture for leakage trace collection is proposed, providing a fast, reconfigurable and flexible control mechanism that can be easily scaled to a wide variety of Devices Under Test (DUT). The proposed system migrates test vector generation, control and transmission, from off-board Personal Computer (PC) to an on-board embedded-system hardware control mechanism. The proposed solution provides a toolset that can be used to structure various leakage assessment scenarios, regardless of the DUT's implemented cryptographic algorithm. The proposed approach enables single, multiple encryption per …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:_axFR9aDTf0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "LiquidStream—network dependent dynamic P2P live streaming",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s12083-010-0092-0",
            "Abstract": "A successful P2P live streaming system must achieve high uploading bandwidth utilization, fast stream distribution, uniform bandwidth distribution among participating peers, flexibility and adaptation to the underlying network conditions and peer behavior. This paper proposes a novel architecture that meets these requirements. By the use of distributed optimization algorithms we propose a dynamically reconfigurable overlay architecture that organizes its peers according to network locality information and heterogeneous uploading capabilities of them. The benefits of our optimized overlay are fully exploited by our proposed scheduler, which guarantees the complete and fast distribution of the stream. The evaluation of our system under a series of scenarios that take into account the all requirements above reveals the advantages of our proposed system.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Software-defined networking: Experimenting with the control to forwarding plane interface",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6385054/",
            "Abstract": "Software-Defined Networking (SDN) is an emerging network architecture where the network control plane is decoupled from the forwarding plane and is programmable via an open protocol. Forwarding and Control Element Separation (Forces) first and OpenFlow later are the prevailing protocols that enable this separation. The differences between the two stem from the underlying models they are defined upon. While OpenFlow is widely used, its capability for adding new functionality of the Forwarding plane is questionable, a fact that is attributed to a restricted model. In contrast, Forces has a very dynamic model that makes its protocol quite powerful but has known little spread due to lack of industry adoption and in the academic world due to lack of open source availability for experimentation. In this paper we first investigate ways of possible confluence or convergence of Forces and OpenFlow and later we …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An FPGA-based performance comparison of the 64-bit block ciphers",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1438690/",
            "Abstract": "An FPGA-based performance comparison of 64-bit block ciphers (Triple-DES, IDEA, CAST- 128, MISTYl, and KHAZAD) is given in this paper. Two basic architectures are implemented for each cipher. For the non-feedback cipher modes, the pipelined technique between the rounds is used, and the achieved throughput ranges from 3.0 Gbps for IDEA to 6.9 Gbps for Triple-DES. For feedback ciphers modes, the basic iterative architecture is considered and the achieved throughput ranges from 115 Mbps for Triple-DES to 462 Mbps for KHAZAD. The throughput, throughput per slice, latency, and area requirement results are provided for all the cipher implementations.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Policy-Based Management Architecture for Active and Programmable Networks",
            "Publication year": 2003,
            "Publication url": "https://scholar.archive.org/work/zmdfir7wafdr7jokryaqu6rmce/access/wayback/http://www.hit.bme.hu/~jakab/edu/litr/UCLP_OptNet_Mngmnt/Policy_Based_Management_01201473.pdf",
            "Abstract": "Next-eneration networks must be capable of supporting a multitude of service and quickly adapted over a common heterogeneous physical infrastructure, according to varying and sometimes conflictin customer requirements. In this context, net-work management must become more fyexible in order to cope with these emerging conditions. More specifically, new management architectures must offer service providers the freedom to mana e their services according to their own policies and seamlessly extend management? unctionality os the only way to react to the introduction of new services. Based on a new business model that describes such an environment, we propose o policy-based management architecture that is extensible and operates in an active and programmable network. This management architecture is part of a new network architecture that was developed in the FAIN European Union research aid development IST project. provi B ers that exploit an environment in which services are dynamically deployed n the world of networking we are experiencing a significant paradigm shift resulting in new technologies and architectures. The motivation behind this shift is the still elusive goal of rapid and autonomous service creation, deployment, activation, and management resulting from new customer and application requirements. Research activity in this area has clearly focused on the synergy of three concepts: network virtualization, open interfaces and platforms, and increasing degrees of intelligence inside the network. Management, as a key component of a network architecture; must also be considered and designed around the …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A distributed router’s modeling and implementation",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Christos-Chrysoulas/publication/237513441_A_Distributed_Router's_Modeling_and_Implementation/links/55e85d0808ae21d099c174c6/A-Distributed-Routers-Modeling-and-Implementation.pdf",
            "Abstract": "Modeling comes to a necessity when there is something new to be developed and there is a need to specify in exact detail a specific architecture. This paper describes a model of a Distributed Router’s Architecture specifically suited for the IST project, FlexiNet. In the FlexiNet project a service called Dynamic Service Deployment dynamically installs, monitors and uninstalls new services upon user demand, or by a default configuration. There was a need for a module to keep all the required information, in terms of resources, of the FlexiNET Wireless Access Node (FWAN).",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Future SDN-Based Network Architectures",
            "Publication year": 2021,
            "Publication url": "https://www.igi-global.com/chapter/future-sdn-based-network-architectures/276698",
            "Abstract": "The goal of this chapter is to provide a clear view of SDN, its origin, and its possible future. This chapter starts by taking a step backwards and looks at SDN in a historic perspective by visiting the history of network programmability and identifies how it helped pave the way and shape SDN. This historic journey will provide a general context of SDN and put SDN into perspective. Then the authors show the current view of SDN as defined by standard development organizations (SDOs), provide a sense of SDN's malleability, explore SDN interactions with different networking architectures, and finally, provide a vision of a possible SDN future.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:kuK5TVdYjLIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Building softwarized mobile infrastructures with ForCES",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7500420/",
            "Abstract": "This paper explores how can one virtualize a mobile packet core infrastructure using the IETF Forwarding and Control Element Separation (ForCES) standard and capitalizing on recent advances in networking, namely Software Defined Networking (SDN) and Network Functions Visualization (NFV). As a case in point we build a proof-of-concept (PoC) implementation of the currently standardized 3GPP Evolved Packet Core (EPC). In doing so, we separate the control from the forwarding plane in SDN terms and enable dynamic deployment and integration of new functionality as softwarized network functions running on off-the-shelf hardware as advocated by NFV. We discuss our implementation experience with the PoC and provide insights for building open 5G mobile infrastructures.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:HbR8gkJAVGIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Crypto processor for contactless smart cards",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1347053/",
            "Abstract": "In this paper a crypto processor for contactless smart cards is presented. The proposed architecture is based on DES algorithm standard. The introduction in the proposed system a power management unit results in a significant power consumption reduction. The use of feedback design techniques reduces the required silicon area. The overall system throughput satisfies the contactless smart card data rate demands. The proposed system operates in 55 MHz frequency with maximum data rate 42.5 Mbps. A 50% power reduction, in comparison with conventional implementations, has estimated mainly due to the switching activity and the total memory accesses reduction. Additional techniques for silicon area reduction are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient reconfigurable multiplier architecture for Galois field GF (2m)",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269203001721",
            "Abstract": "This paper describes an efficient architecture of a reconfigurable bit-serial polynomial basis multiplier for Galois field GF(2m), where 1<m≤M. The value m, of the irreducible polynomial degree, can be changed and so, can be configured and programmed. The value of M determines the maximum size that the multiplier can support. The advantages of the proposed architecture are (i) the high order of flexibility, which allows an easy configuration for different field sizes, and (ii) the low hardware complexity, which results in small area. By using the gated clock technique, significant reduction of the total multiplier power consumption is achieved.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optimization of the\" FOCUS\" Inband-FEC architecture for 10-Gbps SDH/SONET optical communication channels",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4212036/",
            "Abstract": "Forward-error correction (FEC) is of key importance to the robustness of optical communication networks. In particular, inband-FEC is an attractive option, because it improves channel-performance without requiring an increase of the transmission bandwidth. We have devised and implemented a novel inband FEC method, dubbed FOCUS, for the electronic-mitigation of physical impairments in SDH/SONET optical networks. It is an inherently low-cost approach for both the metro and backbone network regions, scalable to any SDH/SONET rate and capable to significantly increase optical channel performance. This paper analyzes the most sophisticated ones from the plethora of optimizations that were employed to minimize the architectural complexity of FOCUS, falling in: a) Arithmetic operator design, b) Resource sharing and c) Redundant logic elimination. These optimizations were necessary to obtain a …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pascal and Francis Bibliographic Databases",
            "Publication year": 2006,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=18494996",
            "Abstract": "Pascal 002 Biological and medical sciences/002A Fundamental and applied biological sciences. Psychology/002A32 Agronomy. Soil science and plant productions/002A32D Genetics and breeding of economic plants/002A32D02 Plant breeding: fundamental aspects and methodology/002A32D02D Haploidy, in vitro culture applications, somatic hybrids",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access Control in Networks Hierarchy: Implementation of Key Management Protocol.",
            "Publication year": 2005,
            "Publication url": "http://isrc.asia.edu.tw/ijns/contents/ijns-v1-n2/ijns-2005-v1-n2-p103-109.pdf",
            "Abstract": "The special needs for cryptography, of both wired and wireless networks, have attracted the researchers’ major interest in the design of new security schemes. This work deals with the access control in network hierarchy. More analytically, an efficient architecture and the implementation of a key management protocol are proposed in this paper. This protocol main philosophy is centered in the usage of hash functions. Alternative hash functions have been implemented and studied, in order to select between the most efficient proposed architecture, concerning both performance and allocated resources. Finally the dynamic access of the system is presented. The proposed system could be applied efficiently in networks with multi-nodes and multi-users authentication demands, providing high speed performance and high level security strength.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proposing a service-enabled semantic grid model",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJAACS.2009.02917",
            "Abstract": "The semantic grid refers to an approach to grid computing in which information, computing resources and services are described in standard ways that can be processed by computer. This makes it easier for resources to be discovered and joined up automatically. Because semantic grids represent and reason about knowledge declaratively, additional capabilities of typical agents are then possible including learning, planning, self-repair, memory organisation, meta-reasoning and task-level coordination. Only a convergence of these technologies will provide the ingredients to create fabric for a new generation of distributed intelligent systems. Inspired from the concept of autonomous decentralised systems, we propose that the above-mentioned goals can be achieved by integrating FIPA multiagent systems with the grid service architecture and hence to lay the foundation for semantic grid. Semantic grid system …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:t6usbXjVLHcC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "A New DDP-Based Cipher CIKS-128h: Architecture, Design and VLSI Implementation Optimization of CBC-Encryption & Hashing Over 1 GBPS",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=8739520279565099996&hl=en&oi=scholarr",
            "Abstract": "Using an advanced data-dependent (DD) operation (DDO) instead of the DD permutations (DDP) in the known cipher CIKS-128 a new 128-bit cipher CIKS-128h, with reduced number of rounds, has been designed. Additionally we propose a cryptoscheme of the ZEUS hash function based on CIKS-128. The single cryptographic core performing data encryption and hashing has been implemented in XILINX FPGA device (v200efg456). The implementation provides significantly higher performance against hash functions MD5, SHA-1 and ciphers DES, AES, IDEA, CIKS-128. Due to high performance and low implementation cost, the proposed cryptographic device can be efficiently used to solve practical security problems of wired and wireless communication.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "LIDA RAY TECHNOLOGIES INC.,"
        },
        {
            "Title": "Euclidean algorithm VLSI implementations",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1046226/",
            "Abstract": "In this paper a novel architecture for implementation of the Euclidean algorithm is presented. It computes the multiplication inverse of a number K for different values of the dimension n (X/sup -1//spl equiv/ modulo n). The proposed architecture can be used for the implementation of cryptographic algorithms and reconfigurable arithmetic units. It is proved, in the paper, that the hardware implementation of the proposed architecture achieves improved power consumption and performance. Two different VLSI designs are introduced. The first design is suitable for low power applications while the second for high performance systems. Power consumption and performance estimations of the two introduced designs are presented.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cryptography: Circuits and systems approach",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/11556930.pdf#page=764",
            "Abstract": "Wireless Communications have become a very attractive and interesting sector for the provision of electronic services. Mobile networks are available almost anytime, anywhere and the user’s acceptance of wireless hand-held devices is high. The services, are offered, are strongly increasing due to the different large range of the users’ needs. In our days, the wireless communication protocols have specified security layers, which support security with high level strength. These wireless protocols security layers use encryption algorithms, which in many cases have been proved unsuitable and outdated for hardware implementations. The software and especially the hardware implementations of these layers are proved hard process for a developer/implementer. The performance results of those implementations are not often acceptable for the wireless communication standards and demands. Especially in the hand …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:RYcK_YlVTxYC",
            "Publisher": "SPRINGER-VERLAG"
        },
        {
            "Title": "High-speed hardware implementations of the KASUMI block cipher",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1329330/",
            "Abstract": "KASUMI block cipher is used for the security part of many synchronous wireless standards. In this paper two architectures and efficient implementations of the 64-bit KASUMI block cipher are presented. In the first one, the pipeline technique (inner-round and outer-round pipeline) is used and throughput value equal to 3584 Mbps at 56 MHz is achieved. The second one uses feedback logic and reaches a throughput value equal to 432 Mbps at 54 MHz. The designs were coded using VHDL language and for the hardware implementations, a FPGA device was used. A detailed analysis, in terms of performance, and covered area is shown. The proposed implementations outperform any previous published KASUMI implementations in terms of performance.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Internet Research Task Force (IRTF) E. Haleplidis, Ed. Request for Comments: 7426 University of Patras Category: Informational K. Pentikousis, Ed.",
            "Publication year": 2015,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.696.5914&rep=rep1&type=pdf",
            "Abstract": "Software-Defined Networking (SDN) refers to a new approach for network programmability, that is, the capacity to initialize, control, change, and manage network behavior dynamically via open interfaces. SDN emphasizes the role of software in running networks through the introduction of an abstraction for the data forwarding plane and, by doing so, separates it from the control plane. This separation allows faster innovation cycles at both planes as experience has already shown. However, there is increasing confusion as to what exactly SDN is, what the layer structure is in an SDN architecture, and how layers interface with each other. This document, a product of the IRTF Software-Defined Networking Research Group (SDNRG), addresses these questions and provides a concise reference for the SDN research community based on relevant peerreviewed literature, the RFC series, and relevant documents by other standards organizations.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "HANDBOOK ON THEORETICAL AND ALGORITHMIC ASPECTS OF SENSOR, AD HOC WIRELESS, AND PEER-TO-PEER NETWORKS",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=3241219639702612276&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:cWzG1nlazyYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Low Power Design for Sbox Cryptographic Primitive of Advanced Encryption Standard for Mobile End-Users",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/50945882/A_Low_Power_Design_for_Sbox_Cryptographi20161218-12189-16btokc.pdf",
            "Abstract": "Most known Sbox Advanced Encryption Standard implementations aim at minimizing chip covered area or achieving high throughput, and usually power consumption is a secondary metric of their cost. However, the need for low power applications with strict chip covered area constrains is great especially in mobile devices. In this paper low power architectures in limited area resources are proposed for Sbox, the basic cryptographic primitive of AES. Those architectures support encryption and decryption operation modes. In our proposed implementations, retaining a small chip covered area cost, hardware techniques for low power design, such as re-ordering of the components, introduction of redundant hardware (ideal delay line), reducing the driving strength–fan out, and insertion of registers in highly unbalanced points of the circuit are applied. Therefore, our implementations do not only reduce power consumption by a large degree, but they also have good area properties and offer an advantageous power-delay-area product in comparison with other known Sbox implementations. These properties give to our system the advantage to support low power mobile devices in low area system environments.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:0izLItjtcgwC",
            "Publisher": "American Scientific Publishers"
        },
        {
            "Title": "A policy-based management architecture for active and programmable networks",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1201473/",
            "Abstract": "Next generation networks must be capable of supporting a multitude of service providers that exploit an environment in which services are dynamically deployed and quickly adapted over a common heterogeneous physical infrastructure, according to varying and sometimes conflicting customer requirements. In this context, network management must become more flexible in order to cope with these emerging conditions. More specifically, new management architectures must offer service providers the freedom to manage their services according to their own policies and seamlessly extend management functionality as the only way to react to the introduction of new services. Based on a new business model that describes such an environment, we propose a policy-based management architecture that is extensible and operates in an active and programmable network. This management architecture is part of a new …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A high-speed hardware implementation of the LILI-II keystream generator",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/48225362/A_High-Speed_Hardware_Implementation_of_20160821-26467-1xvkygq.pdf",
            "Abstract": "The LILI-II keystream generator is a new LFSR based synchronous stream cipher with a 128-bit key. In this paper a high-speed hardware implementation of the LILI-II generator is presented. The proposed architecture is suitable for application with high-performance and area-restricted requirements. Reprogrammable LFSRs are used for the algorithm implementation. With this technique the usage of the LILI-II algorithm is universalized, and different security levels can be achieved. Three FPGA devices are used for the synthesis purposes. A maximum throughput equal to 366 Mbps can be achieved, with a clock frequency of 366 MHz. Finally, comparisons with other previous published implementations of others stream ciphers are given.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improved throughput bit-serial multiplier for GF (2m) fields",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926008000382",
            "Abstract": "High throughput is a crucial factor in bit-serial GF(2m) fields multiplication for a variety of different applications including cryptography, error coding detection and computer algebra. The throughput of a multiplier is dependent on the required number of clock cycles to reach a result and its critical path delay. However, most bit-serial GF(2m) multipliers do not manage to reduce the required number of clock cycles below the threshold of m clock cycles without increasing dramatically their critical path delay. This increase is more evident if a multiplier is designed to be versatile. In this article, a new versatile bit-serial MSB multiplier for GF(2m) fields is proposed that achieves a 50% increase on average in throughput when compared to other designs, with a very small increase in its critical path delay. This is achieved by an average 33.4% reduction in the required number of clock cycles below m. The proposed design can …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Configurable Hardware Implementations of Bulk Encryption Units for Wireless Communications",
            "Publication year": 2004,
            "Publication url": "http://www.iajit.org/PDF/vol.1%2Cno.1/07-paris.pdf",
            "Abstract": "Hardware implementations of bulk encryption units for wireless communications are presented in this paper. These units are based on the Triple DES (TDES) block cipher. The hardware modules can be configured in order to implement either the TDES or the DES block cipher. Three different hardware implementations of TDES are proposed. The first two implementations are based on the pipeline design technique, while the third implementation uses the traditional feedback logic design technique (looping). In addition, the DES block cipher’s S-BOXes have been implemented by Look Up Tables (LUTs) and/or ROM blocks. Comparing with the LUTs, the ROM blocks implementation approach provides higher performance. But, the LUTs implementation approach is used in cases where the ROM blocks are not available. For high-speed performance applications the loop unrolling architecture is selected. The proposed implementation of this architecture achieves 7.36 Gbps data throughput whilst the 16-stage pipeline 2.45 Gbps. The implementation data throughput which is based on the looping architecture is 121 Mbps, but is used significant less hardware resources.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Profiling dilithium digital signature traces for correlation differential side channel attacks",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-60939-9_19",
            "Abstract": "A significant concern for the candidate schemes of the NIST postquantum cryptography standardization project is the protection they support against side-channel attacks. One of these candidate schemes currently in the NIST standardization race is the Dilithium signature scheme. This postquantum signature solution has been analyzed for side channel attack resistance especially against timing attacks. Expanding our attention on other types of side-channel analysis, this work is focused on correlation based differential side channel attacks on the polynomial multiplication operation of Dilithium digital signature generation. In this paper, we describe how a Correlation Power Attack should be adapted for the Dilithium signature generation and describe the attack process to be followed. We determine the conditions to be followed in order for such an attack to be feasible, (isolation of polynomial coefficient …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:DJbcl8HfkQkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Protecting CRT RSA against fault and power side channel attacks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6296466/",
            "Abstract": "The RSA cryptographic algorithm is a security tool that has achieved long cryptographic and market maturity. However, after the discovery and wide spread of Side Channel Attacks (SCA), RSA implementations are susceptible to a variety of different attacks that target the hardware structure rather than the algorithm itself. While there are a wide range of countermeasures that can be applied on the RSA structure in order to protect the algorithm from specific SCA categories, combining several such measures to produce an \"all in one\" SCA resistant RSA structure is not an easy endeavor. Several incompatibility issues between combined SCA protection methods lead to new SCA vulnerabilities. In this paper, we evaluate some very popular and potent SCAs against RSA, like Fault attacks (FA), Simple Power attacks (SPA), Doubling attacks (DA) and Differential Power attacks (DPA), and propose an SCA protection …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security and Privacy Approaches for Wireless Local and Metropolitan Area Networks (LANs & MANs)",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-wireless-security/22081",
            "Abstract": "Wireless communications are becoming ubiquitous in homes, offices, and enterprises with the popular IEEE 802.11 wireless local area network (LAN) technology and the up-and-coming IEEE 802.16 wireless metropolitan area networks (MAN) technology. The wireless nature of communications defined in these standards makes it possible for an attacker to snoop on confidential communications or modify them to gain access to home or enterprise networks much more easily than with wired networks. Wireless devices generally try to reduce computation overhead to conserve power and communication overhead to conserve spectrum and battery power. Due to these considerations, the original security designs in wireless LANs and MANs used smaller keys, weak message integrity protocols, weak or one-way authentication protocols, and so forth. As wireless networks became popular, the security threats were also …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:08ZZubdj9fEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Implementation of the SHA-2 hash family standard using FPGAs",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11227-005-0086-5",
            "Abstract": "The continued growth of both wired and wireless communications has triggered the revolution for the generation of new cryptographic algorithms. SHA-2 hash family is a new standard in the widely used hash functions category. An architecture and the VLSI implementation of this standard are proposed in this work. The proposed architecture supports a multi-mode operation in the sense that it performs all the three hash functions (256, 384 and 512) of the SHA-2 standard. The proposed system is compared with the implementation of each hash function in a separate FPGA device. Comparing with previous designs, the introduced system can work in higher operation frequency and needs less silicon area resources. The achieved performance in the term of throughput of the proposed system/architecture is much higher (in a range from 277 to 417%) than the other hardware implementations. The introduced …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Trusted hardware sensors for anomaly detection in critical infrastructure systems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376629/",
            "Abstract": "Anomaly Detection Systems (ADS), as part of a Security Information and Event Management (SIEM) system, are a cyber-security tool for identifying potential threats inside an Information Technology (IT) System. They are widely used in Critical Infrastructure (CI) Systems for protection against attacks that can cause severe problems to public security and welfare. ADS collect information from various kinds of sources and correlate them to identify anomaly events. Such sources can be devices and software sensors which inside a CI context (factories, power plants, remote locations) are placed in open areas and left unattended. Such devices are vulnerable to tampering and malicious manipulation which may then lead an ADS or SIEM system to ignore or falsely alert possible cyber-security problems. In this paper, we describe strategies to mitigate the above problem using hardware means in order to enhance trust on …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:86PQX7AUzd4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "BLUETOOTH ENCRYPTION/DECRYPTION ALGORITHM ARCHITECTURE AND IMPLEMENTATION",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810861_0069",
            "Abstract": "In this paper a new VLSI implementation of the Bluetooth Encryption algorithm, for efficient usage in portable Bluetooth telecommunication systems, is presented. The algorithm modulo operation of polynomials was implemented by using Linear Feedback Shift Registers (LFSR). The measured power dissipation at 32 Mbps is only about 1,12 mW. The whole Bluetooth Encryption/Decryption algorithm was captured by using VHDL language. For the synthesis and simulation commercial available tools were used, but for the power measurements a custom design tool developed in our University was used.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the hardware implementations of the SHA-2 (256, 384, 512) hash functions",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1206214/",
            "Abstract": "Couple to the communications wired and unwired networks growth, is the increasing demand for strong secure data transmission. New cryptographic standards are developed, and new encryption algorithms are designed, in order to satisfy the special needs for security. SHA-2 is the newest powerful standard in the hash functions families. In this paper, a VLSI architecture for the SHA-2 family is proposed. For every hash function SHA-2 (256, 384, and 512) of this standard, a hardware implementation is presented. All the implementations are examined and compared in the supported security level and in the performance by using hardware terms. This work can substitute efficiently the previous SHA-1 standard implementations, in every integrity security scheme, with higher offered security level, and better performance. In addition, the proposed implementations could be applied alternatively in the integrations of …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient CRT RSA with SCA Countermeasures",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6037465/",
            "Abstract": "RSA cryptographic algorithm, working as a security tool for many years, has long achieved cryptographic and market maturity. However, as all crypto algorithms, RSA implementations, after the discovery and wide spread of Side Channel Attacks (SCA), are susceptible to a wide variety of different attacks that target the hardware structure rather than the algorithm itself. While there are a wide range of countermeasures that can be applied on the RSA structure in order to protect the algorithm from SCAs, combining several such measures in order to guarantee an SCA resistant RSA design is not an easy job. There are many incompatibility issues among SCA protection methods as well as an extensive performance cost added to an SCA secure RSA implementation. In this paper, we address some very popular and potent SCAs against RSA like Fault attacks (FA), Simple Power attacks (SPA), Doubling attacks (DA) and …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the hardware implementation of RIPEMD processor: Networking high speed hashing, up to 2 Gbps",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790605000832",
            "Abstract": "The continued growth of both wired and wireless communications has triggered the revolution for high speed security implementations. RIPEMD hash functions are widely used, in many applications of cryptography. A reconfigurable processor architecture and the VLSI implementation of these functions are proposed in this work. The introduced processor is reconfigurable in the sense that performs alternatively all RIPEMD hash functions. In order to indicate the advantages of the proposed design, each one of these hash functions has also been implemented in a separate hardware device (FPGA). The proposed processor FPGA implementation achieves high speed hashing up to 2 Gbps. Comparing with previous published hardware designs, the proposed processor has higher performance in the range from 22 to 30 times. It also performs much better than the assembly language implementations of the RIPEMD …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Software-defined networking (SDN): Layers and architecture terminology",
            "Publication year": 2015,
            "Publication url": "https://www.hjp.at/(en)/doc/rfc/rfc7426.html",
            "Abstract": "hjp: doc: RFC 7426: Software-Defined Networking (SDN): Layers and Architecture Terminology \nhjp doc RFCs RFC 7426 Rfc 7426 Title Software-Defined Networking (SDN): Layers and \nArchitecture Terminology Author E. Haleplidis, Ed., K. Pentikousis, Ed., S. Denazis, J. Hadi Salim, \nD. Meyer, O. Koufopavlou Date January 2015 Format: TXT=85111, HTML=0 bytes Status: \nINFORMATIONAL Internet Research Task Force (IRTF) E. Haleplidis, Ed. Request for Comments: \n7426 University of Patras Category: Informational K. Pentikousis, Ed. ISSN: 2070-1721 EICT \nS. Denazis University of Patras J. Hadi Salim Mojatatu Networks D. Meyer Brocade O. \nKoufopavlou University of Patras January 2015 Software-Defined Networking (SDN): Layers \nand Architecture Terminology Abstract Software-Defined Networking (SDN) refers to a new \napproach for network programmability, that is, the capacity to initialize, control, change, and . …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "IRTF"
        },
        {
            "Title": "Architectures and FPGA Implementations of the SCO (-1,-2,-3) Ciphers Family.",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=4785372038416500956&hl=en&oi=scholarr",
            "Abstract": "Couple to the communications networks growth, is the increasing demand for strong secure data transmission. New cryptographic standards are developed, in order to satisfy the special needs for security. SCO is a newest ciphers family. In this paper, architectures and FPGA implementations for the SCO family are proposed. Every cipher of this family SCO (-1,-2,-3), has been implemented in a separate FPGA device. In addition two other designs are proposed. These two architectures operate efficiently for all the ciphers of the studied family. The first is based on a full rolling design, while the second is designed like a typical microprocessor. The FPGA implementations synthesis results, prove that the second reconfigurable architecture operates with very high frequency, up to 307 MHz. It has also minimized area resources, at about 10-15% less compared with the first.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AAA and mobile networks: security aspects and architectural efficiency",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Nicolas-Sklavos/publication/221223311_AAA_and_Mobile_Networks_Security_Aspects_and_Architectural_Efficiency/links/5573fe8308ae7536374fd87e/AAA-and-Mobile-Networks-Security-Aspects-and-Architectural-Efficiency.pdf",
            "Abstract": "Security is a crucial factor in the provision of the network services, in both wireless and wired communications. Day by day, the number of subscribers is increased by an exponential function. Furthermore, the continued growth of network services, in addition to the available networks resources each time caused special needs for security and safety, throughout the transmission channel. Finally, billing services for network users is another crucial factor for the applied security mechanisms. AAA, or in different 3” A” s is a security standard which has lately been developed. The name of this standard (AAA) defines Authentication, Authorization and Accounting services for the network subscribers. This work deals with the technical aspects of the three main security processes of AAA. In addition, an architectural model of this standard is also presented, from a generic point of view. Finally, key management issues are examined, which are applied in AAA.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "VLSI implementation of password (PIN) authentication unit",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1046455/",
            "Abstract": "Multi-user communication systems need secure authorization mechanisms in order to protect the system information resources. It is necessary in these systems for the offered services to be protected from unauthorized users, or from possible undesirable external attackers of the system such as hackers. The most widely used protocols and methods for user authorization are based on the use of passwords and in some cases on PIN numbers. In this paper, a hardware implementation of a password (PIN) authentication unit is proposed. By using a few hardware resources, the introduced unit guarantees a high level of security. Due to the special design, the introduced implementation provides very high throughput. It can be used in systems which are connected to communication links up to 340 Mbps.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "VLSI design and implementation of reconfigurable cryptographic systems for symmetric encryption",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4633445/",
            "Abstract": "In this paper a reconfigurable cryptographic system is proposed. The proposed architecture is based on RC5 [1] algorithm standard but it can operate with any cipher. The relationship between the number of block bits, the number of cryptographic rounds (system security), the covered system area resources, and the system's throughput is examined. The proposed cryptographic system is reconfigurable for the number of block bits and the number of cryptographic rounds. These parameters control the system security and the system's throughput. The reconfigurability allows to system adopt temporary parameters in order to be suitable for cryptographic transactions. Finally a parametric VLSI design methodology is proposed for constructing cryptographic systems for symmetric encryption.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sdn layers and architecture terminology",
            "Publication year": 2014,
            "Publication url": "https://www.ietf.org/proceedings/90/slides/slides-90-sdnrg-8.pdf",
            "Abstract": "SDN Layers and Architecture Terminology Page 1 SDN Layers and Architecture \nTerminology draft-haleplidis-sdnrg-layer-terminology-06 Evangelos Haleplidis, Ed. (ehalep@ece.upatras.gr) \nKostas Pentikousis, Ed. (k.pentikousis@eict.de) Spyros Denazis (sdena@upatras.gr) Jamal \nHadi Salim (hadi@mojatatu.com) David Meyer (dmm@1-4-5.net) Odysseas Koufopavlou (odysseas@ece.upatras.gr) \nIETF 90, Toronto, Canada Thursday 24 July 2014 Page 2 Changes since London (-04)  2 \nupdates since IETF 89 ◦ Added to peer-review literature  Additional survey papers  RINA \narchitecture  CAP theorem  Addressed comments received by email and during the IETF \n89 SDNRG meeting ◦ Mailing list discussion re: control vs management  Included \ncoverage of ◦ SNMP ◦ PCEP Page 3 SDN Layers Model (-06) Network Device Forwarding \nPlane Operational Plane App Device and Resource Abstraction Layer (DAL) (…",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:GtLg2Ama23sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Demonstration of a low-cost inband FEC scheme for STM-64 transparent metro networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4013804/",
            "Abstract": "A novel inband forward error correction (FEC) method, developed for the electronic-mitigation of physical optical impairments is implemented and experimentally demonstrated. The proposed inband FEC scheme, FOCUS, is an inherently low-cost approach scalable to any SDH/SONET rate and capable to significantly increase the performance characteristics of metro optical networks. The performance efficiency of the FOCUS method is evaluated in terms of optical signal to noise ratio (OSNR) degradation and chromatic-dispersion degradation associated with the signal transmission over standard single mode fibre. In addition, the system performance is examined using wavelength division multiplexing (WDM) in order to evaluate the effect of nonlinearities. Bit error rate measurements at the standard STM-64 rate (9.953 Gb/s) reveal significant coding-gain improvement for all the examined cases. The benefit of the …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "FEC in optical communications-A tutorial overview on the evolution of architectures and the future prospects of outband and inband FEC for optical communications",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4099521/",
            "Abstract": "The recent establishment of the 10/40 Gbps technology in DWDM optical links heralds a new era of bandwidth abundance, in response to an explosive growth of services provided through the Internet. Forward error correction (FEC) is one of the key-enabling elements in this long-awaited achievement. Borrowed from the wireless world, FEC was initially introduced in wavelength-division multiplex (WDM) optical-systems to combat amplified spontaneous emission (ASE), a form of noise native in optical amplifiers (OAs). These first generation FEC systems have been associated with a coding-gain of approximately 6 dB. However, as transmission rates gradually scaled towards 10 Gbps, other optical-impairments gained in significance, primarily nonlinear (NL) effects but also chromatic-dispersion (CD) and polarization mode dispersion (PMD). FEC turned out to be invaluable in mitigating these impairments as well",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "GF (2/sup K/) multipliers based on Montgomery Multiplication Algorithm",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1329405/",
            "Abstract": "Finite Field arithmetic is becoming increasingly a very prominent solution for calculations in many applications. The most demanding Finite Field arithmetic operation is multiplication. In this paper two Finite Field multiplier architectures and VLSI implementations are proposed using the Montgomery Multiplication Algorithm. The first architecture (Folded) is optimized in order to minimize the silicon covered area (gate count) and the second (Pipelined) is optimized in order to reduce the multiplication time delay. Both architectures are measured in terms of gate count-chip covered area and multiplication time delay and have more than adequate results in comparison with other known multipliers.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low power high-speed multithreshold voltage CMOS bus architectures",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790604000138",
            "Abstract": "Low power, high-speed bus architectures, based on low swing voltage technique, using multithreshold voltage transistors are proposed in this paper. Three different classes of driver/repeater/receiver circuits are introduced. The driver circuits are comprised of high threshold voltage MOSFET transistors, in order to reduce their output swing level voltage. For re-pulling up the low swing voltage to full swing, innovated high-speed, cross-coupled latch, voltage receiver circuits are used. In applications having high load capacitance due to long interconnections, novel repeater circuits based also on multithreshold voltage technology are introduced. Using 0.5 μm multithreshold voltage process technology and 1 V supply voltage, SPICE measurements showed up to 45% improvement in the power delay product.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Low area elliptic curve arithmetic unit",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5118026/",
            "Abstract": "In this paper, a generic elliptic curve (EC) arithmetic unit with high flexibility and small chip covered area is proposed. This EC arithmetic unit is based on the one dimensional systolic architectural realization of a proposed modified multiplication - inversion algorithm that through appropriate initialization uses the algorithmic structure of inversion to also perform multiplication. The proposed architecture is realized on FPGA for GF(2 163 ) and is compared with similar up-to-date designs. The proposed EC arithmetic unit has very small chip covered area without any serious penalty in calculation delay and since is designed on the affine coordinate plane, it offers a good side channel attack resistance base for further optimizations on this field.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "UMTS security: system architecture and hardware implementation",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.367",
            "Abstract": "Universal mobile telecommunication system (UMTS) has specified security mechanisms with extra features compared to the security mechanisms of previous mobile communication systems (GSM, DECT). A hardware implementation of the UMTS security mechanism is presented in this paper. The proposed VLSI system supports the Authentication and Key Agreement procedure (AKA), the data confidentiality procedure, and the integrity protection procedure. The AKA procedure is based on RIJNDAEL Block Cipher. An efficient RIJNDAEL architecture is proposed in order to minimize the usage of hardware resources. The proposed implementation performs the AKA procedure within 76 µs comparing with the 500 ms that UMTS specifies. The data confidentiality and the integrity protection is based on KASUMI Block Cipher. The proposed KASUMI architecture reduces the hardware resources and power …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:IWHjjKOFINEC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "High speed networking security: design and implementation of two new DDP-based ciphers",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1023/B:MONE.0000048556.51292.31",
            "Abstract": "Using Data-Dependent (DD) Permutations (DDP) as main cryptographic primitive two new ciphers are presented: ten-round Cobra-H64, and twelve-round Cobra-H128. The designed ciphers operate efficiently with different plaintext lengths, 64 and 128-bit, for Cobra-H64 and Cobra-H128, respectively. Both of them use very simple key scheduling that defines high performance, especially in the case of frequent key refreshing. A novel feature of Cobra-H64 and Cobra-H128 is the use of the Switchable Operations which prevent the weak keys. The offered high-level security strength does not sacrifice the implementation performance, of both ciphers. Architecture, design and hardware implementation of the two ciphers are presented. The synthesis results for both FPGA and ASIC implementations prove that Cobra-H64 and Cobra-H128 are very flexible and powerful new ciphers, especially for high-speed …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "VLSI design and implementation of reconfigurable cryptographic systems for symmetric encryption",
            "Publication year": 2005,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/7373",
            "Abstract": "In this paper a reconfigurable cryptographic system is proposed. The proposed architecture is based on RC5 [1] algorithm standard but it can operate with any cipher. The relationship between the number of block bits, the number of cryptographic rounds (system security), the covered system area resources, and the system's throughput is examined. The proposed cryptographic system is reconfigurable for the number of block bits and the number of cryptographic rounds. These parameters control the system security and the system's throughput. The reconfigurability allows to system adopt temporary parameters in order to be suitable for cryptographic transactions. Finally a parametric VLSI design methodology is proposed for constructing cryptographic systems for symmetric encryption.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:8d8msizDQcsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "VLSI Design and Implementation of Homophonic Security System",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6296450/",
            "Abstract": "This work considers a security system, with unconditionally encipher procedure. Such a system enciphering the input data in such way, that they do not finally contain enough information that can be under statistical analysis, in order to break the cipher. The attempt of cryptanalysis is not affected by the available quantity of available cipher text data. This can be achieved with high entropy of the message stream, which is going to be ciphered. The proposed system is based on a polymorphic chipper, latest published, which can be efficiently implemented in hardware. Architecture design, for the efficient VLSI implementation is introduced in this paper. Suggestions for future work and further optimizations are also introduced.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An end-to-end hardware approach security for the GPRS",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1347050/",
            "Abstract": "An end-to-end security architecture and its VLSI implementation for the GPRS is proposed in This work. The security offered by GPRS is similar to that offered by the Global Mobile System (GSM). Three algorithms are needed. The A3 and A8, for authentication and ciphering key generation, and the GEA3 algorithm for data confidentiality. The A3 and A8 are based on the RIJNDAEL block cipher, while the GEA3 is based on the KASUMI block cipher. For both ciphers efficient implementations are proposed. The whole design was coded using VHDL language and for the hardware implementations of the designs FPGA devices were used. Detailed analysis is shown, in terms of frequency, throughput, and covered area.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CHESS-64, a block cipher based on data-dependent operations: design variants and hardware implementation efficiency",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=2348684588332895837&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High performance ASIC implementation of the SNOW 3G stream cipher",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.524.7102&rep=rep1&type=pdf",
            "Abstract": "SNOW 3G stream cipher is presented. SNOW 3G is a stream cipher that forms the heart of the 3GPP confidentiality algorithm UEA2 and the 3GPP integrity algorithm UIA2, offering reliable security services in Universal Mobile Telecommunication System (UMTS). A detailed hardware implementation is presented in order to reach satisfactory performance results in systems such as mobile devices. The design was coded using VHDL language and for the hardware implementation, an ASIC synthesis approach was used. Experimental results in terms of performance and covered area are presented.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "End Node Security and Trust vulnerabilities in the Smart City Infrastructure",
            "Publication year": 2018,
            "Publication url": "https://www.matec-conferences.org/articles/matecconf/abs/2018/47/matecconf_iceaf-v2018_05005/matecconf_iceaf-v2018_05005.html",
            "Abstract": "As cities gradually introduce intelligence in their core services and infrastructure thus becoming “smart cities”, they are deploying new Information Technology devices in the urban grid that are interconnected to a broad network. The main focus of widely implemented smart cities' services was the operation of sensors and smart devices across city areas that need low energy consumption and high connectivity. However, as 5G technologies are gradually been adopted in the smart city infrastructure thus solving that problem, the fundamental issue of addressing security becomes dominant. While latest network topologies and standards include security functions thus giving an illusion of security, there is little focus on the fact that many smart city end nodes cannot realize all security specifications without additional help. In this paper, we discuss briefly smart city security issues and focus on problem and security …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:kh2fBNsKQNwC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "A new DDP based cipher CIKS-128h architecture design LSI implementation optimization of CBC encryption hashing over 1Gbps",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1562318/",
            "Abstract": "Using an advanced data-dependent (DD) operation (DDO) instead of the DD permutations (DDP) in the known cipher CIKS-128 a new 128-bit cipher CIKS-128h, with reduced number of rounds, has been designed. Additionally we propose a cryptoscheme of the EUS hash function based on CIKS-128h. The single cryptographic core performing data encryption and hashing has been implemented in XILINX FPGA device. The implementation provides significantly higher performance against hash functions MD5, SHA-1 and ciphers DES, AES, IDEA, CIKS-128h. Due to high performance and low implementation cost, the proposed cryptographic device can be efficiently used to solve practical security problems of wired and wireless communication.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient low power/low swing bus design architectures",
            "Publication year": 2001,
            "Publication url": "https://downloads.hindawi.com/archive/2001/063230.pdf",
            "Abstract": "Novel low-power circuits based on low swing voltage technique, in the internal nodes of bus architectures, are proposed. Different classes of driver/receiver and repeater circuits are presented. They are implemented on conventional CMOS technology. The proposed technique is based on inserting a variable number of MOSFET transistors in the driver circuits, causing variable low swing voltage levels in the output of the driver circuits. In order to re-pull up the low swing voltage to full swing, innovated high-speed, crosscoupled latch voltage receiver circuits are proposed. In applications having high load capacitance due to long interconnections, novel repeater circuits, based also on low swing voltage technique, are introduced. The difference between the values of threshold voltage of the nMOS transistor and the pMOS transistors is exploited to decrease the power dissipation. The effect of the proposed technique in noise margins is also analysed.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:D_sINldO8mEC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Towards a network abstraction model for SDN",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10922-014-9319-3.pdf",
            "Abstract": "Recent advances in networking, namely the reemergence of network programmability with a new name, that of Software-Defined Networking (SDN) have paved the way for a new approach to network datapath configuration. SDN provides an abstraction model of the forwarding plane and separates it from the control plane using open APIs. On the other hand, regarding network infrastructure, motivated by the advances of virtualization, major operators created the Network Function Virtualization (NFV) group, as an Industry Specification Group at the European Telecommunications Standards Institute. NFV’s goal is to define how network functions such as firewalls and load-balancers or any other data or control plane functionality in the mobile and fixed network, can be virtualized and run as software on high-volume servers instead of using specialized hardware. We argue that both SDN and NFV are part of a …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:URolC5Kub84C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Reconfigurable crypto processor design of encryption algorithms operation modes methods and FPGA integration",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1562410/",
            "Abstract": "Security is a crucial issue for the provision of net or communications. Encryption algorithms are used to ensure security in the transmission channel. In addition to the common way of operation of ECB, the encryption algorithms have to perform efficiently in a variety of operation modes, for alternative security applications and purposes, these modes are CBC, CFB, OFB, CTR and CBC-MAC. In this paper, a multi-mode operation architecture is proposed. In addition, based on a full-rolling architecture the most well known encryption algorithms have been implemented.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware design issues in elliptic curve cryptography for wireless systems",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=cApEDwAAQBAJ&oi=fnd&pg=PT73&dq=info:OCbMSnd5nywJ:scholar.google.com&ots=ec_FH-9nNX&sig=sSAMOtHPqJeSpokSVUvN0vKfBoQ",
            "Abstract": "4.8. 1 GF (p) Fields 4.8. 1.1 GF (p) Field Addition–Subtraction 4.8. 1.2 GF (p) Field Multiplication 4.8. 1.3 GF (p) Field Squaring 4.8. 1.4 GF (p) Field Inversion 4.8. 2 GF (2k) Fields 4.8. 2.1 Polynomial Basis Representation 4.8. 2.2 Normal Basis Representation 4.9 Elliptic Curve Point Operations 4.9. 1 Point Addition and Point Doubling Using Projective Coordinates 4.9. 1.1 Point Addition–Doubling in Elliptic Curves over GF (p) Fields Using Projective Coordinates",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hardware implementation of the RC4 stream cipher",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1562548/",
            "Abstract": "In this paper, an efficient hardware implementation of the RC4 stream-cipher is proposed. In contrary to previous designs, which support only fixed length key, the proposed implementation integrates in the same hardware module an 8-bit up to 128-bit key length capability. Independently of the key length, the proposed VLSI implementation achieves a data throughput up to 22 Mbytes/sec in a maximum frequency of 64 MHz. The whole design was captured by using VHDL language and a FPGA device was used for the hardware implementation of the architecture. A detailed analysis, in terms of performance, and covered area is shown.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrating P2P with Next Generation Networks",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=lQeWmNb4gYoC&oi=fnd&pg=PA73&dq=info:pj4OmQslgwcJ:scholar.google.com&ots=OFsbUO7QA2&sig=Vldh2bdvsUB3ee6q6JRGuz8jJLc",
            "Abstract": "This chapter describes the major components and their interactions of a novel architecture called VITAL++ that combines the best features of two seemingly disparate worlds, Peer-to-Peer (P2P) and NGN, in particular IMS, which are then used to support multimedia applications and content distribution services. To this end, P2P is enhanced with advanced authentication, DRM mechanisms while NGN benefits from enhanced scalability, reliability and efficient distribution of service and content by exploiting P2P self organization properties. We describe novel P2P algorithms for optimizing network resources in order to efficiently distribute content among various users without resorting to laborious management operations required in NGN.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:eJXPG6dFmWUC",
            "Publisher": "River Publishers"
        },
        {
            "Title": "In‐band coding technique to promptly enhance SDH/SONET fiber‐optic channels with FEC capabilities",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.956",
            "Abstract": "In the present paper, we discuss FEC‐methods for SDH/SONET networks under the perspective of DWDM. The lightwave channels are assumed to have a burst‐error character. First, a FEC‐strategy is outlined by means of fundamental performance criteria. The SDH/SONET frame‐overhead is also explored for possible allocation of error‐correction bits inside. Then, different FEC methods are rated by the above criteria in a systematic manner. We eventually propose a section‐ and line‐layer, in‐band coding (IBC) approach that should deal with a very wide range of optical network applications in a straightforward, uniform and effective fashion. Comparison with past work on this subject reveals clear advantages. Extensive simulations, implementation and laboratory measurements prove the feasibility and efficiency of the proposed FEC method with RS(244,240,9), provided that a portion of the SDH/SONET …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:M3ejUd6NZC8C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Circuit techniques for reducing power consumption in adders and multipliers",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=17633235068865793563&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:evX43VCCuoAC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A systolic trinomial GF (2k) multiplier based on the Montgomery Multiplication Algorithm",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4633449/",
            "Abstract": "The use of irreducible trinomial for GF(2 k ) field multiplication is widely accepted in parallel designs as a solution to improve the multiplication process. However, the degree of optimization has not been tested for the Montgomery Multiplication Algorithm for GF(2 k ) fields, a sequential algorithm not yet designed and implemented in hardware using trinomials. In this paper, a semisystolic-pipelined Montgomery Multiplier architecture defined over irreducible trinomial is proposed. The proposed architecture and Hardware implementation is compared with other known designs, in terms of gate-flip flop number, Chip Covered Area, latency, critical path and clock Frequency, and the degree of optimization using trinomials is measured, giving very optimistic results.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying systolic multiplication–inversion architectures based on modified extended Euclidean algorithm for GF (2k) in elliptic curve cryptography",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790607000511",
            "Abstract": "Elliptic curve cryptography is a very promising cryptographic method offering the same security level as traditional public key cryptosystems (RSA, El Gamal) but with considerably smaller key lengths. However, the computational complexity and hardware resources of an elliptic curve cryptosystem are very high and depend on the efficient design of EC point operations and especially point multiplication. Those operations, using the elliptic curve group law, can be analyzed in operations of the underlined GF(2k) Field. Three basic GF(2k) Field operations exist, addition–subtraction, multiplication and inversion–division. In this paper, we propose an optimized inversion algorithm that can be applied very well in hardware avoiding well known inversion problems. Additionally, we propose a modified version of this algorithm that apart from inversion can perform multiplication using the architectural structure of inversion …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "ForCES applicability to SDN-enhanced NFV",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6984050/",
            "Abstract": "Networking has seen lately a surge in research and innovation with the re-emergence of network programmability in the form of Software-Defined Networking (SDN), a new approach for network data path configuration. SDN provides an abstraction model of the Forwarding Plane and separates it from the Control Plane using open APIs. In parallel, major telecom operators have embarked on an effort to bring the advantages of virtualization to carrier network infrastructures. Part of this effort was invested in establishing the Network Function Virtualization (NFV) Industry Specification Group (ISG) at the European Telecommunications Standards Institute (ETSI). The NFV goal is to define how Network Functions (ranging from firewalls and load-balancers to routers and access elements) can be virtualized and run as software on high-volume servers instead of specialized hardware. This paper treats SDN and NFV as …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:4MWp96NkSFoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Crt rsa hardware architecture with fault and simple power attack countermeasures",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6386955/",
            "Abstract": "RSA cryptographic algorithm has long achieved cryptographic and market maturity. However, RSA implementations, after the discovery of Side Channel Attacks (SCA), are susceptible to a variety of different attacks that target the hardware structure rather than the algorithm itself. There are a wide range of countermeasures that can be applied on the RSA structure in order to protect the algorithm from SCAs, however few of them are efficient in hardware since they add extensive performance cost to an SCA resistant RSA implementation. In this paper, a hardware architecture is proposed based on a Fault attack (FA) and Simple Power attack (SPA) resistant algorithm for Chinese Remainder Theorem (CRT) RSA that through the principles of parallelism and component reusability can guarantee hardware efficiency. We describe an implementation approach based on Montgomery modular multiplication and also …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design, architecture and performance evaluation of the wireless transport layer security",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s11227-006-3549-4",
            "Abstract": "Communication protocols for wireless networks have specified security layers, with high-level encryption strength. The dedicated to security layer of Wireless Application Protocol (WAP), is the Wireless Transport Layer Security (WTLS). In this paper, an efficient architecture for the hardware implementation of WTLS is proposed. The introduced system supports bulk encryption, authentication and data integrity. The proposed architecture operates alternatively for a set of ciphers, IDEA, DES, RSA, D.H., SHA-1 and MD5. It is based on two reconfigurable design units: the Reconfigurable Authentication Unit and the Reconfigurable Integrity Unit. These units operate alternatively for different ciphers and achieve to allocate minimized resources, at the same time. The introduced security system has been implemented in an FPGA device. The supported ciphers performance is compared with previously published …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:blknAaTinKkC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A Reconfigurable Most/Least Significant Bit Multiplier for GF (2 m)",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/1928079/c17.pdf",
            "Abstract": "An efficient architecture of a reconfigurable Least/Most Significant Bit multiplier for Galois field where, is presented. The proposed multiplier can operate either as a most significant or as a least significant bit first multiplier. The value m, of the irreducible polynomial degree, can be changed and the value of M determines the maximum size that the multiplier can support. This architecture features the high order of flexibility and scalability, which allows an easy configuration for different field size.) 2 (m GF M m≤< 1",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A low-cost inband FEC scheme for SONET/SDH optical metro networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4016130/",
            "Abstract": "A novel inband forward-error correction (FEC) method, devised for the electronic-mitigation of physical optical transmission impairments, is implemented and experimentally demonstrated. The proposed inband-FEC scheme, Free-Of-Charge Uniform Shield (FOCUS), is an inherently low-cost approach, applicable to standard synchronous digital hierarchy/synchronous optical network rates, allowing optically transparent signal propagation over longer distances. The performance/efficiency of the FOCUS method is evaluated in terms of tolerance against optical signal-to-noise ratio degradation and chromatic-dispersion, associated with the signal transmission over standard single-mode fiber. Bit-error-rate measurements and coding gain calculations at the standard STM-64 rate (9.953 Gb/s) reveal significant coding-gain improvement for all cases examined",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Anomaly detection trusted hardware sensors for critical infrastructure legacy devices",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/729918",
            "Abstract": "Critical infrastructures and associated real time Informational systems need some security protection mechanisms that will be able to detect and respond to possible attacks. For this reason, Anomaly Detection Systems (ADS), as part of a Security Information and Event Management (SIEM) system, are needed for constantly monitoring and identifying potential threats inside an Information Technology (IT) system. Typically, ADS collect information from various sources within a CI system using security sensors or agents and correlate that information so as to identify anomaly events. Such sensors though in a CI setting (factories, power plants, remote locations) may be placed in open areas and left unattended, thus becoming targets themselves of security attacks. They can be tampering and malicious manipulated so that they provide false data that may lead an ADS or SIEM system to falsely comprehend the CI current security status. In this paper, we describe existing approaches on security monitoring in critical infrastructures and focus on how to collect security sensor–agent information in a secure and trusted way. We then introduce the concept of hardware assisted security sensor information collection that improves the level of trust (by hardware means) and also increases the responsiveness of the sensor. Thus, we propose a Hardware Security Token (HST) that when connected to a CI host, it acts as a secure anchor for security agent information collection. We describe the HST functionality, its association with a host device, its expected role and its log monitoring mechanism. We also provide information on how security can be established …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:dBIO0h50nwkC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A new RSA encryption architecture and hardware implementation based on optimized Montgomery multiplication",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1465668/",
            "Abstract": "RSA is a widely acceptable and well used algorithm in many security applications. Its main mathematical function is the demanding, in terms of speed, operation of modular exponentiation. In this paper a systolic, scalable, redundant carry-save modular multiplier and an RSA encryption architecture are proposed using the Montgomery modular multiplication algorithm. By completely avoiding the transformations from redundant to non-redundant numbers at the intermediate stages of the architectures, the need for addition is eliminated and very interesting results, in terms of clock frequency, throughput and chip covered area, are achieved.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the architecture and the design of P2P live streaming system schedulers",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5345622/",
            "Abstract": "In this paper we analyze P2P live streaming systems. Through this analysis we obtain the crucial parameters for their performance in terms of bandwidth utilization, set-up time, fairness and stability. We propose a sender driven multi objective decision function for neighbor selection in order to adapt the distribution of available bandwidth to the overlay connections while simultaneously we further exploit the locality properties of an overlay. At last we develop and apply a receiver driven block selection with a content diffusion optimization algorithm that achieves fast and efficient diffusion of every block. The evaluation of our system reveals its very high levels of performance in terms of setup time, bandwidth utilization, its fair behavior in the distribution of available aggregate bandwidth in various nodes and the minimization of duplicate block transmissions. Finally by comparing our system with other recently developed …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimized GF (2 k) ONB type I multiplier architecture based on the Massey–Omura multiplication pattern",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/093/meta",
            "Abstract": "Multiplication in GF (2 k) finite fields is becoming rapidly a very promising solution for fast, small, efficient binary algorithms designed for hardware applications. GF (2 k) finite fields defined over optimal normal bases (ONB) can be very advantageous in term of gates number and multiplication time delay. Many ONB multipliers works have been proposed that use the Massey–Omura multiplication pattern. In this paper, a method for designing type I optimal normal basis multipliers and an optimal normal basis (ONB) type I multiplier hardware architecture is proposed that, through parallelism and pairing categorization of the ONB multiplication table matrix, achieves very interesting results in terms of gate number and multiplication time delay.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:Mojj43d5GZwC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Versatile multiplier architectures in GF (2k) fields using the Montgomery multiplication algorithm",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926007000442",
            "Abstract": "Many sequential multipliers for polynomial basis GF (2 k) fields have been proposed using the LSbit and MSbit multiplication algorithm. However, all those designs are defined over fixed size GF (2 k) fields and sometimes over fixed special form irreducible polynomials (AOL, trinomials, pentanomials). When such architectures are redesigned for arbitrary GF (2 k) fields and generic irreducible polynomials, therefore made versatile, they result in high space complexity (gate–latch number), low frequency (high critical path) and high latency designs. In this paper a Montgomery multiplication element (MME) architecture specially designed for arbitrary GF (2 k) fields defined over general irreducible polynomials, is proposed, based on an optimized version of the Montgomery multiplication (MM) algorithm for GF (2 k) fields. To evaluate the proposed MME and prove the efficiency of the MM algorithm in versatile designing …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:isC4tDSrTZIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Cryptography in wireless protocols: hardware and software implementations",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/48225386/TUTCAS.2003.149093020160821-1543-qvuyxm.pdf",
            "Abstract": "Wireless Communications have become a very attractive and interesting sector for the provision of electronic services. Mobile networks are available almost anytime, anywhere and the user's acceptance of wireless hand-held devices is high. The services, are offered, are strongly increasing due to the different large range of the users' needs.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Area optimized architecture and VLSI implementation of RC5 encryption algorithm",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1302004/",
            "Abstract": "The rapid growth of the amount of transmitted data over wireless networks has triggered special needs for security. Today, wireless communications protocols have dedicated layers to ensure security in the transmission channel. Wireless transport layer security (WTLS) is widely used in both the wireless application protocol and open mobile alliance. Privacy in WTLS is based on the RC5 cipher. In this paper, an area optimized architecture and an FPGA implementation for RC5 is introduced. The proposed implementation allocates less area resources, with a range between 28 to 33%, compared with the conventional architecture. The proposed architecture has been designed with a pipeline technique, which achieves high speed performance. Finally, the proposed RC5 implementation is proved superior to other related works, compared in both frequency and throughput.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New class of the FPGA efficient cryptographic primitives",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1329331/",
            "Abstract": "This work focuses the problem of further development of the approach to the fast cipher design, based on data-dependent (DD) permutations (DDP). A new class of the DDP-like operations is described. New DD operations (DDO) are constructed replacing the switching element in the DDP boxes by different controlled elements (CE) having the same size. Full classification of CE with two non-linear outputs is presented. Two subclasses of nonlinear CE, with the best differential characteristics are recommended for the use in the non-linear DDO-boxes synthesis. The non-linear CE boxes are implemented in FPGA modules using the same hardware resources as switching elements. It is shown that the use of the nonlinear DDO, instead of DDP allows one to reduce the number of rounds. With this technique higher Performance/Cost ratio is achieved, while designing fast hardware suitable ciphers.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting hardware vulnerabilities to attack embedded system devices: A survey of potent microarchitectural attacks",
            "Publication year": 2017,
            "Publication url": "https://www.mdpi.com/209234",
            "Abstract": "Cyber-Physical system devices nowadays constitute a mixture of Information Technology (IT) and Operational Technology (OT) systems that are meant to operate harmonically under a security critical framework. As security IT countermeasures are gradually been installed in many embedded system nodes, thus securing them from many well-know cyber attacks there is a lurking danger that is still overlooked. Apart from the software vulnerabilities that typical malicious programs use, there are some very interesting hardware vulnerabilities that can be exploited in order to mount devastating software or hardware attacks (typically undetected by software countermeasures) capable of fully compromising any embedded system device. Real-time microarchitecture attacks such as the cache side-channel attacks are such case but also the newly discovered Rowhammer fault injection attack that can be mounted even remotely to gain full access to a device DRAM (Dynamic Random Access Memory). Under the light of the above dangers that are focused on the device hardware structure, in this paper, an overview of this attack field is provided including attacks, threat directives and countermeasures. The goal of this paper is not to exhaustively overview attacks and countermeasures but rather to survey the various, possible, existing attack directions and highlight the security risks that they can pose to security critical embedded systems as well as indicate their strength on compromising the Quality of Service (QoS) such systems are designed to provide. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:XoXfffV-tXoC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Hardware implementation of Bluetooth security",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1186722/",
            "Abstract": "Bluetooth can implement its security layer's key-generation mechanism and authentication in software or hardware. Software implementation usually satisfies user requirements, but in time-critical applications or processing-constrained devices, a hardware implementation is preferable.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A reconfigurable linear feedback shift register (LFSR) for the Bluetooth system",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957640/",
            "Abstract": "The Bluetooth Encryption/Decryption algorithm demands Linear Feedback Shift Registers (LFSRs) in order to reduce the length of the encryption key. A typical implementation needs sixteen different LFSRs. In this paper a low power 128-bit LFSR for efficient use in portable Bluetooth telecommunication systems is proposed. The new LFSR design techniques can be also useful in any reconfigurable LFSR. Two methods to reduce the conventional LFSR switching activity are introduced. Up to 110% LFSR power consumption reduction was achieved by using the clock-gating technique and the Gray code representation. The whole LFSR design was captured by using VHDL language and for synthesis a 0.7 /spl mu/m CMOS standard cell library was used.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network programmability with ForCES",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7118637/",
            "Abstract": "Network programmability has re-emerged as a top item of the networking research agenda since Software Defined Networking (SDN) gained wide acceptance simultaneously in vendor product line plans and operator expectations for future deployments. Key ingredients for the successful deployment of SDN technologies are standardized models, mechanisms, and protocols for the separation of the control and forwarding planes. The Internet Engineering Task Force (IETF) standardization effort on Forwarding and Control Element Separation (ForCES) has published a set of standards track documents which specify in detail a comprehensive architectural framework and the respective standard protocols which can be employed to implement the separation of these two planes in a flexible, scalable, and vendor-agnostic yet fully interoperable manner. The IETF standards on ForCES define how to achieve said …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:gsN89kCJA0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WAP security: implementation cost and performance evaluation of a scalable architecture for RC5 parameterized block cipher",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1347051/",
            "Abstract": "While the wireless communications are coming to offices and houses, the special needs for secure data transmission, are proved an issue of great importance. The increased number of networks subscribers, in addition to the maximized quantity of the transmitted information, has triggered the revolution of the high speed, in the transmission channel. Security in data transmission is a crucial demand, which has to be faced successfully. It is obvious that the implementation performance of security schemes is also important as the offered security level itself. In this work, the implementation cost and the performance evaluation of RC5 implementations is presented. This cipher is adopted by a great number of wireless protocols, such as WAP. The FPGA implementation synthesis results for a scalable architecture are shown, for a scalable proposed architecture. Alternative adders and subtracters designs are examined for …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "VLSI architecture and FPGA implementation of ICE encryption algorithm",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301983/",
            "Abstract": "In modern security, the need for safe cryptographic algorithms that are hardware implemental is great. A hardware architecture is proposed in this paper, for the implementation of the ICE encryption algorithm. Since this cipher is optimized for use on software, a hardware implementation of that algorithm that achieves good performance results has much interest. The proposed implementation can be used for both encryption and decryption processes. It is a folded architecture using feedback logic, designed for small chip covered area and high speed performance. The proposed architecture was implemented by using an FPGA device. The achieved throughput is equal to 116 Mbit/sec, using a system clock with frequency up to 29.1 MHz.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An FPGA implementation of the GPRS encryption algorithm 3 (GEA3)",
            "Publication year": 2005,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218126605002337",
            "Abstract": "The General Packet Radio Service (GPRS) uses the GPRS Encryption Algorithm 3 (GEA3) for data encryption. In this paper, alternative hardware implementations of the GEA3 algorithm are described. GEA3 algorithm is based on the KASUMI block cipher. Various KASUMI block cipher hardware implementations have been examined in order to provide information about the required silicon area and throughput. In order to achieve a significant performance improvement, Double Edge Triggered pipeline technique is used. The S-BOXes, which are fundamental elements of the KASUMI cipher, have been implemented by using combinational logic and ROM memories. The proposed GEA3 algorithm hardware implementation achieves throughput up to 837Mbps, which is much faster comparing to the previous designs. The whole system is implemented and evaluated by using Field Programmable Gate Array (FPGA …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:TFP_iSt0sucC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Short-circuit energy dissipation modeling for submicrometer CMOS gates",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/883330/",
            "Abstract": "A significant part of the energy dissipation in static complementary metal-oxide-semiconductor (CMOS) structures is due to short-circuit currents. In this paper, an accurate analytical model for the CMOS short-circuit energy dissipation is presented. First, the short-circuit energy dissipation of the CMOS inverter is modeled. The derived model is based on analytical expressions of the inverter output waveform which include the influences of both transistor currents and the gate-to-drain coupling capacitance. Also, the effect of the short-circuiting transistor's gate-source capacitance on the short-circuit energy dissipation, is taken into account. The /spl alpha/-power law MOS model that considers the carriers' velocity saturation effect of submicrometer devices is used. Second, the inverter model is extended to static CMOS gates by using reduction techniques of series- and parallel-connected transistors. The results produced …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security analysis of SIP signalling during NASS-IMS bundled authentication",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4438284/",
            "Abstract": "This paper deals with issues related to the way in which clients authenticate to NASS and simultaneously also gain service layer authentication using the single sign-on NASS bundled authentication. A security analysis of SIP sequence messages during NASS-IMS bundled authentication is presented. Through this analysis we aim to identify the SIP vulnerabilities during the NASS-IMS bundled authentication. To demonstrate the signaling we will use emulation software and we will design specific test cases. From this we will identify vulnerability issues during SIP signaling in the NASS-IMS bundled Authentication as well as interesting conclusions regarding NASS functionalities.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TECHNOLOGY IN NEXT GENERATION NETWORKS VITAL++—A NEW COMMUNICATION PARADIGM: EMBEDDING P2P The authors describe the major components and their interactions of a novel architecture called VITAL++ that combines the best features of the two seemingly disparate worlds: Peer-to-peer and NGN.",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=16796490909693529319&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A web-services based architecture for dynamic-service deployment",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00972-3_19",
            "Abstract": "Due to the increase in both heterogeneity and complexity in today’s networking systems, there arises a demand for an architecture for network-based services, that gives flexibility and efficiency in the definition, deployment and execution of the services and at the same time, takes care of the adaptability and evolution of such services. In this paper we present an approach that applies a component model to GT4, a Web-service based Grid environment, which enables the provision of parallel applications as QoS-aware (Grid) services, whose performance characteristics may be dynamically negotiated between a client application and service providers. Our component model allows context dependencies to be explicitly expressed and dynamically managed with respect to the hosting environment, computational resources, as well as dependencies on other components. Our work can be seen as a first step …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Designing and evaluating high speed elliptic curve point multipliers",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6927241/",
            "Abstract": "Point Multiplication (PM) is considered the most computationally complex and resource hungry Elliptic Curve Cryptography (ECC) related mathematic operation. The design of PM hardware accelerators follows approaches that have a trade off between utilized hardware resources and computation speed. In this paper, the above trade-off and its relation with the operations of the GF(2 k ) defining the Elliptic Curve (EC) is highlighted and investigated. Following this direction, a point operation design methodology based on the parallelization and scheduling of GF(2 k ) operations is proposed. This design approach is adapted to the PM employed GF(2 k ) multiplication algorithm and associated implementation in an effort to increase PM accelerator speed with an acceptable cost on chip covered area (hardware resources). Using the proposed methodology, two PM accelerator hardware architectures were proposed …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low power design for sbox cryptographic primitive of advanced encryption standard for mobile end-users",
            "Publication year": 2007,
            "Publication url": "https://www.ingentaconnect.com/contentone/asp/jolpe/2007/00000003/00000003/art00009",
            "Abstract": "Most known Sbox Advanced Encryption Standard implementations aim at minimizing chip covered area or achieving high throughput, and usually power consumption is a secondary metric of their cost. However, the need for low power applications with strict chip covered area constrains is great especially in mobile devices. In this paper low power architectures in limited area resources are proposed for Sbox, the basic cryptographic primitive of AES. Those architectures support encryption and decryption operation modes. In our proposed implementations, retaining a small chip covered area cost, hardware techniques for low power design, such as re-ordering of the components, introduction of redundant hardware (ideal delay line), reducing the driving strength – fan out, and insertion of registers in highly unbalanced points of the circuit are applied. Therefore, our implementations do not only reduce power …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:dshw04ExmUIC",
            "Publisher": "American Scientific Publishers"
        },
        {
            "Title": "A decision making framework for dynamic service deployment",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.116.392&rep=rep1&type=pdf",
            "Abstract": "Owing to the increase in both heterogeneity and complexity in today’s networking systems, the need arises for an architecture for network-based services that provides flexibility and efficiency in the definition, deployment and execution of the services and, at the same time, takes care of the adaptability and evolution of such services. In this paper we present an approach that applies a Web-service-based Resource Management framework, which enables the provision of parallel applications as QoS-aware, whose performance characteristics may be dynamically negotiated between a client application and service providers. Our component model allows context dependencies to be explicitly expressed and dynamically managed with respect to the hosting environment, computational resources, and dependencies on other components. In such a model the Resource Management, in terms of representation, allocation and management of the resources, plays a vital role regarding the efficiency of the whole Dynamic Service Deployment architecture.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security in wireless networks: the FlexiNET approach",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Christos-Chrysoulas/publication/265570314_Security_in_Wireless_Networks_The_FlexiNET_Approach/links/54bc19e70cf24e50e9404670/Security-in-Wireless-Networks-The-FlexiNET-Approach.pdf",
            "Abstract": "Security is a crucial factor in the provision of the mobile services. The rapid growth of harmful attacks has increased the need for higher security level, especially in the case of wireless networks. In this paper we present a new security approach for authentication using Web Services. We propose the AAA Proxy architecture which is essential component in the authentication procedures that are taking place in FlexiNET network.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Architectures and VLSI implementations of the AES-proposal Rijndael",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1146712/",
            "Abstract": "Two architectures and VLSI implementations of the AES Proposal, Rijndael, are presented in this paper. These alternative architectures are operated both for encryption and decryption process. They reduce the required hardware resources and achieve high-speed performance. Their design philosophy is completely different. The first uses feedback logic and reaches a throughput value equal to 259 Mbit/sec. It performs efficiently in applications with low covered area resources. The second architecture is optimized for high-speed performance using pipelined technique. Its throughput can reach 3.65 Gbit/sec.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "One Dimensional Systolic Inversion Architecture Based on Modified GF (2^ k) Extended Euclidean Algorithm",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5350157/",
            "Abstract": "The need for small chip covered area in most handheld devices with out sacrifices in computational power introduces an interesting problem concerning expensive, computational intensive operations, like GF(2 k ) inversion which is widely used in cryptography. This paper addresses this problem by proposing a systolic inversion architecture for GF(2 k ) fields. This architecture is based on an extended analysis on an optimized version of modified extended Euclidean algorithm (OMEEA) that is using signal reusability and simplification of the control signals with regard to hardware design and manages to make the inversion process less complex. The proposed one dimensional systolic inversion architecture based on OMEEA was measured in terms of hardware components number, latency and critical path delay with very interesting results when compared to other well known designs thus proving the efficiency of …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low-power and high-throughput implementation of the SHA-1 hash function",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1465529/",
            "Abstract": "The main applications of the hash functions are met in the fields of communication integrity and signature authentication. A hash function is utilized in the security layer of every communication protocol. However, as protocols evolve and new high-performance applications appear, the throughput of most hash functions seems to reach a limit. Furthermore, due to the tendency of the market to minimize device size and increase autonomy to make them portable, power issues have also to be considered. The existing SHA-1 hash function implementations (SHA-1 is common in many protocols e.g. IPSec) limit throughput to a maximum of 2 Gbit/s. In this paper, a new implementation comes to exceed this limit improving the throughput by 53%. Furthermore, power dissipation is kept low compared to previous works.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "STEER: A Social Telemedia Environment for Experimental Research",
            "Publication year": 2012,
            "Publication url": "https://eprints.lancs.ac.uk/id/eprint/61448/",
            "Abstract": "STEER: A Social Telemedia Environment for Experimental Research - Lancaster EPrints \nLOADING Skip to main content Lancaster University homepage Home Browse By Year By \nSubject By Department Search Help STEER: A Social Telemedia Environment for Experimental \nResearch Denazis, Spyros and Efthymiopoulos, Nikos and Koufopavlou, Odysseas and Den \nHartog, Frank and Niamut, Omar and Hutchison, David and Race, Nicholas and Mu, Mu and \nTaal, Jacco and Mori, Luigi and Boniface, Michael and C Phillips, Stephen and Wu, Felix (2012) \nSTEER: A Social Telemedia Environment for Experimental Research. In: FIRE engineering \nworkshop, 2012-11-07. Full text not available from this repository. Item Type: Contribution to \nConference (Paper) Journal or Publication Title: FIRE engineering workshop Departments: \nFaculty of Science and Technology > School of Computing & Communications ID Code: By: : …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "L-CAN: Locality aware structured overlay for P2P live streaming",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87359-4_8",
            "Abstract": "A p2p streaming system must be able to exploit the locality information between peers, in order to deliver a stream quickly to all peers with high level of bandwidth utilization. In this paper we propose a locality aware and balanced overlay for p2p live streaming which can adapt to the dynamic behavior of the participating peers and the underlying network. Our overlay is created and maintained through the use of two algorithms, called the placement and the swapping algorithm that we consider as the major contributions in this paper. These are responsible for the insertion of a node and the dynamic and distributed optimization of the overlay in order to reflect the underlying network. The proposed overlay is evaluated through extensive simulations that show that the bandwidth utilization of the peers and the set-up time are significantly improved through locality between peers.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "High performance cryptographic engine PANAMA: hardware implementation",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1399746/",
            "Abstract": "A hardware implementation of a dual operation cryptographic engine, PANAMA, is presented. The implementation of the PANAMA algorithm can be used both as a hash function and a stream cipher. A basic characteristic of PANAMA is a high degree of parallelism which has, as a result, high rates for the overall system throughput. Another profit of PANAMA is that just one architecture supports two cryptographic operations - encryption/decryption and data hashing. The proposed system operates at 96.5 MHz frequency with a maximum data rate of 24.7 Gbps. The proposed system outperforms previous hash function and stream cipher implementations in terms of performance. Additional techniques can increase the achieved throughput by about 90%.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Encryption and data dependent permutations: Implementation cost and performance evaluation",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45215-7_29",
            "Abstract": "Recently, Data Dependent Permutations (DDP) have attracted the interest of cryptographers and ciphers designers. SPECTR-H64 and CIKS-1 are latest published powerful encryption algorithms, based on DDP transformations. In this paper, the implementation cost in different hardware devices (FPGA and ASIC) for DDP is introduced. In addition, the performance of these data transformation components is presented. Detailed analysis is shown, in terms of covered area, frequency, and throughput for DDP VLSI integration. Furthermore, two different architectures for hardware implementation of CIKS-1 and SPECTR-H64 are proposed. The first, based on full rolling technique minimizes the area resources. The second uses a pipelined development design and has high-speed performance. Both architectures have been implemented in FPGA and ASIC devices.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Exploring the FPGA Implementations of the LBlock, Piccolo, Twine, and Klein Ciphers",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9344108/",
            "Abstract": "In this work, the implementations of the LBlock, Piccolo, Twine, and Klein lightweight ciphers in FPGA technology are studied in terms of area, frequency, throughput, and throughput/area. To accomplish this, loop unrolling and pipelining were employed in two phases. In the first phase, different loop unrolling factors were used to implement the round function of each cipher, while in the second phase, 2-stage pipelining with loop unrolling per stage was applied. The produced designs were implemented in Xilinx (Kintex-7) FPGA technology. Based on the implementation results, a detailed study on the above-mentioned design metrics was performed and important outcomes were derived.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:bKqednn6t2AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware security for critical infrastructures-the CIPSEC project approach",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7987545/",
            "Abstract": "As the new trend for smart devices becomes a reality, critical infrastructure (CI) systems are equipped with new toolsets from the information technology domain and move from secluded, closed systems to interconnected infrastructures that communicate directly or indirectly with highly insecure networks (eg. Internet). This transition enables a wide range of cyber-security attacks that can harm both CI Operation Technology (OT) and Information Technology (IT) systems. CIPSEC project consolidates European Union's continuous effort to mitigate the problem by bringing together different security/cyber-security solutions from various providers and integrating them into a unified framework that can be installed on top of a CIS to enhance its security. In this paper, we describe that CIPSEC framework concept, focusing on the CIPSEC hardware component by proposing a CIS Hardware security module (HSM) capable of …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile Communications World: Security Implementations Aspects-A State of the Art.",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Nicolas-Sklavos/publication/269011185_Mobile_Communications_World_Security_Implementations_Aspects_-_A_State_of_the_Art/links/5838211108aef00f3bf9e69a/Mobile-Communications-World-Security-Implementations-Aspects-A-State-of-the-Art.pdf",
            "Abstract": "Wireless Communications have become a very attractive and interesting sector for the provision of electronic services. Mobile networks are available almost anytime, anywhere and the user’s acceptance of wireless hand-held devices is high. The services, are offered, are strongly increasing due to the different large range of the users’ needs. They vary from simple communications services to special and sensitive purposed applications such as electronic commerce and digital cash. It is obvious that in future wireless protocols and communications environments (networks), security will play a key role in the transmitted information operations. This paper summarizes key issues that should be solved for achieving the desirable performance in security implementations and focuses alternative integrations approaches for wireless communications security. It gives an overview of the current security layer of wireless protocols and presents the performance characteristics of implementations in both software and hardware. We also propose some efficient methods to implement security schemes in wireless protocols with high performance. The purpose of this paper is to provide the state-of-the-art and research trends on implementations of wireless protocols security for current and future wireless communications.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparison of the hardware architectures and FPGA implementations of stream ciphers",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1399745/",
            "Abstract": "In this paper, the hardware implementations of five representative stream ciphers are compared in terms of performance and consumed area. The ciphers used for the comparison are the A5/1, W7, E0, RC4 and Helix. The first three ones have been used for the security part of well-known standards. The Helix cipher is a recently introduced fast, word oriented, stream cipher. The W7 algorithm has been recently proposed as a more trustworthy solution for GSM, due to the security problems that occurred concerning the A5/1 strength. The designs were coded using the VHDL language. For the hardware implementation of the designs, an FPGA device was used. The implementation results illustrate the hardware performance of each cipher in terms of throughput-to-area ratio. This ratio equals: 5.88 for the A5/1, 1.26 for the W7, 0.21 for the E0, 2.45 for the Helix and 0.86 for the RC4.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:LO7wyVUgiFcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comparison of the performance of stream ciphers for wireless communications",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.130.1338&rep=rep1&type=pdf",
            "Abstract": "In this paper, the hardware implementations of four representative stream ciphers are compared in terms of performance and consumed area. The ciphers used for this comparison are the A5/1, E0, RC4 and Helix. The first three ones have been used for the security part of well-known standards, especially in wireless ones, while the Helix cipher is a recently introduced fast, word oriented, stream cipher. The designs were coded using VHDL language. For the hardware implementation of the designs, an FPGA device was used. The implementation results illustrate the hardware performance of each cipher in terms of throughput-to-area ratio. This ratio equals to: 0.86 for the RC4, 0.21 for the E0, 5.88 for the A5/1, and 2.45 for the Helix cipher.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing efficient elliptic Curve Diffie-Hellman accelerators for embedded systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7169074/",
            "Abstract": "In this paper, a methodology towards a hardware/software implementation of an Elliptic Curve Diffie Hellman (ECDH) scheme is proposed in an effort to overcome the design problems of Elliptic Curve Cryptography (ECC) systems stemming from the highly constrained embedded system hardware and software environment (restricted RAM, storage and processing power). To achieve that, instead of the excessively slow software ECDH implementations or monolithic, not flexible hardware implementations, we propose the use of a flexible, scalar multiplication (SM) accelerator connected to the main embedded system processor in order to speed up ECDH functionality without downgrading the overall main processor performance. The proposed solution can be used for a wide variety of GF(2 k ) based Elliptic Curves (EC) and is capable of shifting from one EC to another EC at runtime (flexibility). The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:KUbvn5osdkgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A time and area efficient hardware implementation of the MISTY1 block cipher",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1562406/",
            "Abstract": "A time and area efficient hardware implementation of the 64-bit NESSIE proposal, MISTY1 block cipher, is presented in this paper. The new proposed architecture achieves high-speed and small silicon area. The VLSI implementation uses feedback logic and inner pipeline with negative edge-triggered register. So, the critical path is shorter, without increasing the latency of cipher execution. Comparing with an implementation without negative edge-triggered register, about 97 % performance improvement is achieved. The proposed implementation reaches a data throughput value equal to 561 Mbps at 79 MHz clock frequency. In addition, is area efficient because only one round of the cipher is used. The design was coded using VHDL language and for the hardware implementation FPGA device was used. A detailed analysis, in terms of performance, and covered area is shown",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "NASS-IMS bundled authentication study through core network concepts",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1385289.1385344",
            "Abstract": "Emerging broadband access technologies are enabling the introduction of IP services to an increasing number of users. The market forecasts suggest that a new class of network providers will deploy public wireless or not networks based on these new technologies. In order to offer uninterrupted IP service combined with ubiquitous seamless mobility, these multi-provider networks need to be integrated with each other. As the latest descendant of such networks, the IP Multimedia Subsystem (IMS) has been envisaged to build up the extra functionality required to bridge such functionality gaps, hence accelerate services harmonisation in the context of mixed technology networks. Based on IMS architectural perception as well on ETSI TISPAN architecture, this article presents a complementary study of NASS-IMS bundled authentication on a core network communication concept. Finally, it concludes by focusing on its …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Asynchronous low power VLSI implementation of the International Data Encryption Algorithm",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957482/",
            "Abstract": "An asynchronous VLSI implementation of the International Data Encryption Algorithm (IDEA) is presented in this paper. In order to evaluate the asynchronous design, a synchronous version of the algorithm was also designed. The VHDL hardware description language was used in order to describe the algorithm. By using Synopsys commercially available tools, the VHDL code was synthesized. After placing and routing, both designs were fabricated with 0.6 /spl mu/m CMOS technology. With a system clock of up to 8 MHz and a power supply of 5 V, the two chips were tested and evaluated, comparing them with the software implementation of the IDEA algorithm. This new approach proves efficiently the lower power consumption of the asynchronous implementation compared to the existing synchronous one. Therefore the asynchronous chip performs efficiently in WEP (Wireless Encryption Protocols) and high speed …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Teaching introduction to computing through a project-based collaborative learning approach",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5600433/",
            "Abstract": "Teaching introduction to computing courses, especially to first year college students, is a challenging endeavor given the increasing difficulty of today's students with programming and algorithmic thinking. In this paper the experience of introducing collaborative and project based approaches in a first year University course is reported. Both synchronous collaborative learning approaches and asynchronous collaboration through group project work have been introduced in the course using Python as a programming language. The effect of use of these approaches in students' attitude towards Computer Science and their performance is discussed here.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel systolic GF (2k) field Multiplication-Inversion arithmetic unit",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4633450/",
            "Abstract": "In this paper a systolic Multiplication-Inversion architecture is proposed that can be extended to perform all GF(2 k ) field operations. This architecture is based on a proposed Modified version of the Extended Euclidean Algorithm that through appropriate reusability and initialization it can perform multiplication and inversion. Therefore, while other known designs need two hardware components for multiplication and inversion, in the proposed design only one hardware module for both operations is used that give very interesting results in terms of Area complexity, critical path delay, latency and throughput.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low power cryptography",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/084/meta",
            "Abstract": "Today more and more sensitive data is stored digitally. Bank accounts, medical records and personal emails are some categories that data must keep secure. The science of cryptography tries to encounter the lack of security. Data confidentiality, authentication, non-reputation and data integrity are some of the main parts of cryptography. The evolution of cryptography drove in very complex cryptographic models which they could not be implemented before some years. The use of systems with increasing complexity, which usually are more secure, has as result low throughput rate and more energy consumption. However the evolution of cipher has no practical impact, if it has only theoretical background. Every encryption algorithm should exploit as much as possible the conditions of the specific system without omitting the physical, area and timing limitations. This fact requires new ways in design architectures for …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:hMod-77fHWUC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Scalable control of bandwidth resources in P2P live streaming",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6961470/",
            "Abstract": "Currently commercial live video streaming systems are based either on a typical client-server or on a peer-to-peer architecture. The former outperforms in terms of stability and quality of service, provided that the system is not stretched beyond its limits, while the latter is scalable and has a much lower cost of operation with regards to the required bandwidth resources. In this paper, we propose a hybrid architecture that combines the best of both worlds. In order to achieve this we developed a scalable mechanism that monitors dynamically the total available bandwidth of the system and a distributed control strategy that dynamically allocates the required bandwidth. To the best of our knowledge this is the first work that applies control theory to P2P live streaming systems. Additionally we provide analytical proof of stability properties of our control strategy and we demonstrate some preliminary results.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiple low swing voltage values for CPL, CVSL and domino logic families",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/913022/",
            "Abstract": "A new low-power design method based on multiple low swing internal voltage values is proposed in this paper. The proposed technique can be applied in logic circuits, which are designed with different logic family techniques such as Complementary Pass Transistor Logic (CPL), Domino Logic and Cascade Voltage Switch Logic (CVSL). The goal of this method is the reduction of the circuit power dissipation, with only a negligible increase in the area, and without a reduction in the circuit operating speed. This is achieved with the replacement of a number of selected full swing voltage circuit components by low swing voltage components. The application of the proposed technique in a CPL 4 bit multiplier proved that 30% power dissipation reduction was achieved, with 5% area overhead, and no reduction in the circuit speed.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient implementation of the digital signature algorithm",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1046456/",
            "Abstract": "Digital signature schemes are commonly used as primitives in cryptographic protocols that provide other services including entity authentication, authenticated key transport, and authenticated key agreement. A VLSI implementation of the digital signature scheme is proposed in this paper, for efficient usage in any cryptographic protocol. This architecture is based on secure hash function and the 512-bit RSA cryptographic algorithm. The whole design was captured by using VHDL language and a FPGA device was used for the hardware implementation of the architecture. A method to reduce the switching activity of the overall design is introduced. The proposed VLSI implementation of the digital signature scheme achieves a data throughput up to 32 kbit/sec.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying low power techniques in aes mixcolumn/invmixcolumn transformations",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4263560/",
            "Abstract": "In low power resources environments with increased security needs, like smart cards or RFIDs tags, power consumption plays a crucial role in system efficiency. Since AES algorithm is widely used in the above applications, power efficient design of this algorithm is essential. However few researchers have extensively studied this issue but rather focus on high throughput designs. In this paper the low power techniques of Resource Sharing and Power Management are applied in a 32-bit architecture for the MixColumn/InvMixColumn transformation of the Advanced Encryption Standard. The proposed architecture performs multiplication in GF(2 8 ) field of a byte S i,j  . with specific constants, using a common data path. Low power consumption is also achieved by deactivating the unused parts of the data path when MixColumn Transformation is performed. The proposed architecture achieves low power consumption …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A web service-and ForCES-based programmable router architecture",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00972-3_9",
            "Abstract": "Programmable networks have accentuated the need for a clear separation of the control and forwarding planes. The IETF ForCES protocol allows control elements to be connected to logically separated forwarding elements. The FlexiNET IST project relies on dynamic service deployment, which requires router programmability in the control and/or forwarding planes. Moreover, to shorten the implementation and deployment time of control elements, there is a need for simple higher-level APIs that shield such elements from ForCES protocol and model details. This paper proposes a ForCES CE Gateway (ForCEG) architecture that fulfills these requirements and maps Web Service interfaces to ForCES messages while checking the validity of commands to ensure consistency of the router state.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An Efficient Low-Swing Multithreshold-Voltage Low-Power Design Technique",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218126604001209",
            "Abstract": "New low-power design architecture based on low-swing voltage technique is proposed in this paper. A new CMOS inverter of three output-voltage levels is used to achieve this target. To verify the validity of the proposed technique, three different logic families are used. SPICE simulation results for the three logic families show that more than 45% power dissipation can be saved, without sacrifice the speed operation. Comparison results between the proposed technique and other techniques based on low-swing voltage, shown the superiority of our technique in reducing the power dissipation. Based on 2.4 V supply voltage, a 16 * 16-bit multiplier is implemented by using the proposed technique in 0.25μm silicon technology.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:_B80troHkn4C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Creating an Elliptic Curve arithmetic unit for use in elliptic curve cryptography",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4638588/",
            "Abstract": "Elliptic curve cryptography (ECC) is a very promising cryptographic method, offering the same security level as traditional public key cryptosystems (RSA, El Gamal) but with considerably smaller key lengths. To increase the performance of an EC Cryptosystem, dedicated hardware is employed for all EC point operations. However, the computational complexity and hardware resources of an Elliptic Curve processing unit are very high and depend on the efficient design of the Elliptic Curvepsilas underlined GF(2 k ) Field. In this paper, we propose an EC arithmetic unit that is structured over a high peformance, low gate number GF(2 k ) arithmetic unit. This proposed GF(2 k ) arithmetic unit is based on one dimensional systolic architecture that can perform GF(2 k ) multiplication and inversion with only the performance cost of inversion. This is achieved by utilizing a multiplication/inversion algorithm based on the …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computer network security: report from MMM-ACNS",
            "Publication year": 2004,
            "Publication url": "https://www.computer.org/csdl/magazine/sp/2004/01/j1049/13rRUEgarr5",
            "Abstract": "The invited speakers focused on important security topics such as computational complexity, calculus and higher-order logic, behavior-based security, network forensics, and inside intruder attacks. Workshop attendees agreed that all the talks addressed issues of great interest.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Design and leakage assessment of side channel attack resistant binary edwards Elliptic Curve digital signature algorithm architectures",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933118300516",
            "Abstract": "Considering that Elliptic Curve Digital Signature Algorithm (ECDSA) implementations need to be efficient, flexible and Side Channel Attack (SCA) resistant, in this paper, a design approach and architecture for ECDSA and the underlined scalar multiplication operation is proposed for GF(2k), satisfying the above three directives. To achieve that, in the paper, Binary Edwards Curves (BECs) are adopted as an alternative to traditional Weierstrass Elliptic Curves (ECs) for GF(2k) since they offer intrinsic SCA resistance against simple attacks due to their uniformity, operation regularity and completeness. To achieve high performance and flexibility, we propose a hardware/software ECDSA codesign approach where scalar multiplication is implemented in hardware and integrated in the ECDSA functionality through appropriate drivers of an ECDSA software stack. To increase BEC scalar multiplier performance and …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "VLSI implementations of the triple-DES block cipher",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301980/",
            "Abstract": "In this paper, VLSI implementations for the triple-DES block cipher are presented. Triple-DES (TDES) is basically used in various cryptographic applications and wireless protocol security layers. Three different hardware implementations are proposed. The first two are based on the pipeline technique, while the third uses consecutive iterations for the data transformations. In addition, the used TDES S-BOXes has been implemented by both look up tables (LUT) and ROM blocks providing useful information regarding the covered area and the design throughput. The ROM approach has better performance than the LUT one but the latter is preferred in the cases where ROM blocks are not available. The proposed TDES implementations achieve high-speed performance. In particular, the throughput value for the pipeline one is equal to 7.36 Gbps.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low-power and high-throughput implementation of the SHA-1 hash function",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=10750123097517843537&hl=en&oi=scholarr",
            "Abstract": "The main applications of the hash functions are met in the fields of communication integrity and signature authentication. A hash function is utilized in the security layer of every communication protocol. However, as protocols evolve and new high-performance applications appear, the throughput of most hash functions seems to reach a limit. Furthermore, due to the tendency of the market to minimize device size and increase autonomy to make them portable, power issues have also to be considered. The existing SHA-1 hash function implementations (SHA-1 is common in many protocols e.g. IPSec) limit throughput to a maximum of 2 Gbit/s. In this paper, a new implementation comes to exceed this limit improving the throughput by 53%. Furthermore, power dissipation is kept low compared to previous works.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:anf4URPfarAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An FPGA-based implementation of the Pomaranch stream cipher.",
            "Publication year": 2007,
            "Publication url": "https://dsmc2.eap.gr/wp-content/uploads/2017/05/Kitsos_c27.pdf",
            "Abstract": "As the versatility of small, low power devices increases and their use becomes commonplace, a need for secure communications among these devices has arisen. Pomaranch is a recently developed stream cipher with two major advantages:(i) the low hardware complexity, which results in small area and (ii) the good statistical properties. This architecture supports an 80-bit key and 32-to 108-bit IV. FPGA devices were used for the performance demonstration. A maximum throughput equal to 279 Mbps can be achieved, with a clock frequency of 279 MHz.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An reconfigurable multiplier in GF (2m) for elliptic curve cryptosystem.",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/1928089/c11.pdf",
            "Abstract": "In this paper an efficient architecture of a reconfigurable bit-serial polynomial basis multiplier for Galois field GF (2m), where 1< m≤ M is proposed. The value of the field degree m can be changed and the irreducible polynomial can be configured and programmed. Comparing with previous designs, the advantages of the proposed architecture are (i) the high order of flexibility, which allows an easy configuration for arbitrary field degree m, and (ii) the low hardware complexity, which results in small area. The introduced multiplier was realized in FPGA and used in designing an Elliptic Curve Cryptosystem with remarkable results in terms of performance and area. Also, its efficiency in term of performance and area is proved through comparisons with existing GF (2m) multipliers.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adopting software engineering practices to network processor devices introducing the Domain Specific Modeling paradigm to the ForCES Framework",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5691237/",
            "Abstract": "IETF's new Forwarding and Control Element Separation (ForCES) architecture specifies the ForCES model providing an accurate description of the Forwarding Plane in an Object-Oriented fashion. However, the model is described totally in an XML Schema Definition (XSD): it is well-defined but purely machine oriented, being readable and usable, thus not human-friendly and difficult extending itself in the future. We argue that the ForCES model is actually a meta-model that is used to model ForCES components, e.g. Logical Function Blocks (LFBs), that later are used in ForCES applications. This paper presents a methodology based on a case study on how to automate the process of configuring the forwarding plane of network devices using state-of-the-art model-driven techniques in a tangible way while specifying a tool supported by a Domain Specific Language (DSL) for ForCES. We first consider describing the …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multithreshold Voltage Technology for Low Power Bus Architecture",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35498-9_20",
            "Abstract": "Multithreshold voltage technology for low swing voltage bus architecture is proposed. Three new different classes of driver/repeater/receiver circuits are introduced. In the driver circuits, high threshold MOSFET transistor have been inserted in order to decrease its output swing voltage. To re-pull up the low swing to full swing voltage, innovated low delay cross-coupled latch circuit receivers are proposed. The same architecture with new repeater circuits based on multithreshold voltage are introduced in order to drive internal long interconnection lines and decreasing the total delay time. For 2V supply voltage using 0.5_m process technology, SPICE measurements show up to 20% improvement in the delay time and up to 50% saving in the total power dissipation comparing with the conventional CMOS bus architecture.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Random number generator architecture and VLSI implementation",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1010592/",
            "Abstract": "Security protocols and encryption algorithms are basically based on random number generators. In this paper, a new random number generator architecture is introduced. The produced number word length is equal to 160 bits. The philosophy of the architecture relies on the usage of the SHA hash function. The offered security strength of this hash function ensures the unpredictability of the produced number. Additionally, an efficient VLSI implementation for FPGA devices of the proposed system is described. The proposed architecture is a flexible solution in applications where the original physical sources of random number generators, such as electrical noise, are not available or at least not convenient. This architecture can also be used in any cryptographic algorithm and encryption/decryption system with high-speed performance.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bulk encryption crypto-processor for smart cards: design and implementation",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1399747/",
            "Abstract": "The evolution of a cipher has no practical impact if it has only a theoretical background. Every encryption algorithm should exploit as much as possible the conditions of the specific system without omitting the physical, area and timing limitations. The smart card environment lacks system resources, but commercial and economic transactions via smart cards demand the use of certificated and secure cryptographic methods. This fact requires new ways of designing architectures for secure and reliable smart card systems. A crypto-processor architecture and its VLSI implementation for smart card bulk encryption is proposed. The proposed architecture achieves 30% area resource reduction and has a throughput value much greater than smart card standards specify.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hardware implementation of CURUPIRA block cipher for wireless sensors",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4669325/",
            "Abstract": "An architecture and VLSI implementation of a new block cipher called Curupira is presented in this paper. This cipher is suitable for wireless sensors and RFID applications. Our 0.13 mum implementation requires resources of 9450 gate equivalences and is capable to encrypt a plaintext in 10 clock cycles. The cipher achieves a maximum throughput up to 2361 Mbps at 246 MHz for encrypting/decrypting. When clocked at 100 KHz a throughput of up to 960 Kbps is achieved and an average power of 0.04 mW is drawn.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a service-enabled distributed router architecture",
            "Publication year": 2008,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-cds_20070041",
            "Abstract": "Modelling is an essential tool in the development and assessment of new concepts. The authors propose an architecture for the next-generation gigabit distributed active router that was designed and implemented in the IST project, FlexiNET. In the FlexiNET project, a service called ‘dynamic service deployment’ dynamically installs, monitors and uninstalls new services on user demand or by default configuration. The proposed distributed router architecture achieves scalability of performance, functional flexibility and reliability. Scalability is achieved by adding new modules that have identical interfaces in an extensible function block. New services can easily be added by inserting modules that have the appropriate functionality. Another significant aspect of the model presented is that a failure in one module does not affect the other modules because they operate independently.",
            "Abstract entirety": 1,
            "Author pub id": "e86zmDoAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Multithreshold voltage low-swing/low-voltage techniques in logic gates",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926004000598",
            "Abstract": "A low-power design circuit using low-swing voltage technique is proposed in this paper. The proposed technique could be used in order to decrease the power dissipation in three different types of logic gates namely the complementary pass-transistor logic (CPL), the cascade voltage switch logic (CVSL), and the domino logic. The main idea of the proposed technique is based on the replacement of the conventional CMOS inverter at the output of the logic gates with a new low-swing voltage inverter based on multithreshold voltage technology (LSIM). The inserted LSIM achieves a reduction in the static power dissipation, the dynamic power dissipation as the propagation delay time of the gates. To demonstrate the impact of the proposed technique in different applications, various types of circuits are designed for different conditions of: speed operation, load capacitance and supply voltages. In order to ensure the …",
            "Abstract entirety": 0,
            "Author pub id": "e86zmDoAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Elsevier"
        }
    ]
}]