[{
    "name": "Παναγιώτης Τσανάκας",
    "romanize name": "Panagiotis Tsanakas",
    "School-Department": "Ηλεκτρολόγων Μηχ.& Μηχ. Υπολογιστών  ",
    "University": "ntua",
    "Rank": "Καθηγητής",
    "Apella_id": 19188,
    "Scholar name": "Panayiotis Tsanakas",
    "Scholar id": "UdV8-qIAAAAJ",
    "Affiliation": "Professor of Computer Engineering, National Technical University of Athens, Greece",
    "Citedby": 2988,
    "Interests": [
        "High performance systems",
        "Distributed Systems and Algorithms",
        "Biomedical informatics",
        "Cloud/edge computing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=UdV8-qIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A grid middleware for data management exploiting peer-to-peer techniques",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X08001568",
            "Abstract": "In this paper, we describe a service-oriented middleware architecture for Grid environments which enables efficient data management. Our design introduces concepts from Peer-to-Peer computing in order to provide a scalable and reliable infrastructure for storage, search and retrieval of annotated content. To ensure fast file lookups in the distributed repositories, our system incorporates a multidimensional indexing scheme which serves the need for supporting both exact match and range queries over a group of metadata attributes. Finally, file transfers are conducted using GridTorrent, a grid-enabled, Peer-to-Peer mechanism that performs efficient data transfers by enabling cooperation among participating nodes and balances the cost of file transfer among them. The proposed architecture is the middleware component used by the GREDIA project, in which both media and banking partners plan to share large …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:RYcK_YlVTxYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Greek Research and Technology Network-Advanced ΙΤservices for the Life Sciences research community",
            "Publication year": 2018,
            "Publication url": "http://helios-eie.ekt.gr/EIE/bitstream/10442/15708/1/tsanakas.pdf",
            "Abstract": "Greek Research and Technology Network Page 1 http://www.grnet.gr Greek Research and \nTechnology Network Advanced IT services for the Life Sciences research community Panayiotis \nTsanakas, Chairman & CEO ELIXIR-GR open kickoff event 18/5/2018 @ education @ research \n@ health @ culture Page 2 http://www.grnet.gr • State-owned company (SA) under GSRT \nestablished in 1998 • Provide advanced e-infrastructures/services to the Greek academic and \nresearch institutions: • National and international connectivity • Infrastructures/services (network, \ncomputing, storage) to the community • Promotion and dissemination of ICT in the academic \ncommunity GRNET Page 3 The role of GRNET • Develops and administers integrated \nelectronic infrastructure (einfrastructures) • Operates, in 24/7 operational basis, horizontal \ninfrastructure and electronic services for the whole of educational and research community () • …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time integration of emotion analysis into homecare platforms",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8857484/",
            "Abstract": "The scientific and technological advancements in the area of affective computing enable the development of services in various domains that facilitate the interaction between humans and computers, and can considerably improve decision-making. This work presents the integration and operation of an emotion analysis service in a homecare/mHealth application. In the described approach, the developed emotion analysis service follows the IoT paradigm and it is combined with features for connectivity such as biosignal sensors and wearables, while it is fully integrated in the WebRTC video communication functionality offered by the homecare platform. Thus, it supports the medical experts to perform real-time analysis of their patients' emotional status during interactive video-conference sessions. The paper discusses the technical details of the implementation and the integration of the proposed service and …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DIANA-microT web server: elucidating microRNA functions through target prediction",
            "Publication year": 2009,
            "Publication url": "https://academic.oup.com/nar/article-abstract/37/suppl_2/W273/1128394",
            "Abstract": "Computational microRNA (miRNA) target prediction is one of the key means for deciphering the role of miRNAs in development and disease. Here, we present the DIANA-microT web server as the user interface to the DIANA-microT 3.0 miRNA target prediction algorithm. The web server provides extensive information for predicted miRNA:target gene interactions with a user-friendly interface, providing extensive connectivity to online biological resources. Target gene and miRNA functions may be elucidated through automated bibliographic searches and functional information is accessible through Kyoto Encyclopedia of Genes and Genomes (KEGG) pathways. The web server offers links to nomenclature, sequence and protein databases, and users are facilitated by being able to search for targeted genes using different nomenclatures or functional features, such as the genes possible involvement in biological …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "BitTorrent for Storage and File Transfer in Grid Environments",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-5574-6_11",
            "Abstract": "Grid Computing is a computing model that treats all resources as a collection of manageable entities with common interfaces to such functionalities as lifetime management, discoverable properties and accessibility via open protocols. It also provides a robust infrastructure for distributed computing, and is widely used in large-scale scientific applications that generate large volumes of data. One of the key factors to those applications is the ability to access very large files in a short -and predictable, if possible– time. This chapter introduces a new architecture, developed to achieve better throughput, more reliable file transfers and better file resilience. The suggested system combines the secure resource sharing paradigm of grid technologies with the qualitative characteristics of peer-to-peer systems for efficiency and resilience. We essentially propose a Grid filesystem and the relevant transport layer, using a …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Evaluation of loop grouping methods based on orthogonal projection spaces",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/876163/",
            "Abstract": "This paper compares three similar loop-grouping methods. All methods are based on projecting the n-dimensional iteration space J/sup n/ onto a k-dimensional one, called the projected space, using (n-k) linear independent vectors. The dimension k is selected differently in each method giving various results. The projected space is divided into discrete groups of related iterations, which are assigned to different processors. Two of the methods preserve optimal time completion, by scheduling loop iterations according to the hyperplane method. The theoretical analysis of the experimental results indicates the appropriate method, for specific iteration spaces and target architectures.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Replica management services on the Grid: Evolving from a centralized design to a fully distributed, scalable and fault-tolerant peer-to-peer infrastructure",
            "Publication year": 2006,
            "Publication url": "https://scholar.archive.org/work/gl55iiy72vhdxa6zol2cpjrala/access/wayback/https://www.witpress.com/Secure/elibrary/papers/1845640551/1845640551005FU1.pdf",
            "Abstract": "The Grid infrastructure enables global-scale collaboration of large scientific communities (Virtual Organizations–VOs) usually relying on a common set of data. As information is not necessarily generated and processed centrally, data resources need to be scattered among various data storage facilities. Data objects may also need to be copied from one facility to the other–“replicated” at a site–in order to be evaluated by local VO participants or unique to the site instruments and computing devices. While the main objective when replicating data to remote processes is to reduce aggregate network usage and boost end-application performance, replicas can also be exploited in favor of resiliency to network and site failures and increased data transfer throughput. Nevertheless, managing replicas in highly distributed data storage environments can be very complex. The processes involved in creating, locating, retrieving and updating replicas must guarantee both scalability and fault-tolerance. In this paper, we investigate the requirements of a Grid-centric, replica-based data storage and retrieval infrastructure, present the current trends and implementations and elaborate on how future architectures can capitalize on peer-to-peer technologies in order to achieve even higher levels of scale, without the need of deploying special data management servers.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:HoB7MX3m0LUC",
            "Publisher": "WIT Press"
        },
        {
            "Title": "Scheduling UET grids with unit communication time delays into unbounded/fixed number of processors",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/771571.771575",
            "Abstract": "The n-dimensional grid is one of the most representative patterns of data flow in parallel computation. Many scientific algorithms, especially nested loops, which require nearest-neighbor communication in a lattice space, are modeled by a task graph or iteration space with the properties of a grid. We consider the nested loop model with unit dependencies thus having an iteration space with the form of a n-dimensional grid. The exact model is that of generalized grids with diagonal edges, allowing unequal boundaries for each dimension. We survey the optimal time scheduling techniques for UET-UCT (unit execution time-unit communication time) grid topologies, using unbounded and bounded number of processors, without allowing task duplication. UET-UCT scheduling of generalized n-dimensional grids is low complexity tractable.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Telemonitoring Homecare Platform for patients with Pulmonary Fibrosis",
            "Publication year": 2019,
            "Publication url": "https://erj.ersjournals.com/content/54/suppl_63/PA1720.abstract",
            "Abstract": "Background: Telemonitoring technologies are one of the most promising alternatives in the management of patients with chronic conditions. To our knowledge there is no published study of home telemonitoring of patients with Interstitial Lung Diseases and especially Pulmonary Fibrosis.Objectives and Methods: The aim of the present study was to explore the feasibility and effectiveness of a home-based telemedical care in patients with Idiopathic Pulmonary Fibrosis (IPF) and Combined Pulmonary Fibrosis and Emphysema (CPFE). Patients were offered a telemonitoring system that incorporates health monitoring features, communication and social networking and features for emergency response. The main components included a pulse-oximeter and an automated blood pressure meter (with a Bluetooth transmitter) and an Android tablet with the application preinstalled. Clinical and pulmonary function data were …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:tkaPQYYpVKoC",
            "Publisher": "European Respiratory Society"
        },
        {
            "Title": "An intelligent cloud-based platform for effective monitoring of patients with psychotic disorders",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49186-4_25",
            "Abstract": " The therapy of patients with psychotic disorders (i.e., bipolar disorder and schizophrenia) could benefit from the constant monitoring of their physiological and motor parameters. In this paper, we present an innovative and advanced cloud based platform that facilitates the effective monitoring of such patients. A commodity smartwatch is used for biosignal and motion data collection at a 24/7 basis. The paper describes the technical details of the implemented application both on the smartwatch and the cloud server side. Technical challenges regarding the upload, the storage and the battery constraints of the smartwatch are also discussed, along with the initial results regarding data visualization and processing.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluating a Greek National Action on Students’ Training on ICT and Programming Competences",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11631-5_30",
            "Abstract": "It is well understood that university graduates, regardless of discipline, must have appropriate information and communication technology (ICT) competencies to function and be employable in the modern world. Nevertheless, the results of surveys indicate significant deficiencies in the use of ICT by students of higher education. e-kpaidefteite.gr is an initiative launched by the Greek government that aims to train and certify students of higher education on ICT. This paper presents the results of two separate surveys that took place during the period December 2008 - January 2009. The first survey targeted the students that have completed the programme and the second one the educational providers that participated in the programme and offered the training to the beneficiaries.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Evaluating Mental Patients Utilizing Video Analysis of Facial Expressions",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-79157-5_16",
            "Abstract": "The objective of this work is to put in numbers the degree of symptoms severity based on the social behavior and cognitive functioning of mental patients when conducting a routine conversation with their attending doctor. Examination of patient’s facial expression manifestations can be a key indicator towards the quantization of cognitive impairment in respect to receiving external emotion expressions. Recent advancements in computer vision machine and deep learning techniques allow the evaluation and recognition of temporal emotional status through facial expressions. In this context, the paper studies the application of these techniques for the automated recognition of Positive and Negative Syndrome Scale (PANSS) indicators by means of extracting features from patients’ facial expressions during video teleconferences. The paper discusses the technical details of the implementations of a video classification …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:NJ774b8OgUMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "GRIDCC: A Real-time Grid workflow system with QoS",
            "Publication year": 2007,
            "Publication url": "https://content.iospress.com/articles/scientific-programming/spr00236",
            "Abstract": "The over-arching aim of Grid computing is to move computational resources from individual institutions where they can only be used for in-house work, to a more open vision of vast online ubiquitousvirtual computational'resources which support individuals and collaborative projects. A major step towards realizing this vision is the provision of instrumentation–such as telescopes, accelerators or electrical power stations–as Grid resources, and the tools to manage these resources online. The GRIDCC project attempts to satisfy these requirements by providing the following four co-dependent components; a flexible wrapper for publishing instruments as Grid resources; workflow support for the orchestration of multiple Grid resources in a timely manner; the machinery to make reservation agreements on Grid resources; and the facility to satisfy quality of service (QoS) requirements on elements within workflows. In this …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:35N4QoGY0k4C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Zeus: Bringing internet voting to greece",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11710-2_20",
            "Abstract": "Zeus is an internet voting platform, in which all the steps of the voting process can be verified using well-established mathematical tools. It has been developed with the goal that the voters can be confident that their votes are counted correctly and their anonymity is guaranteed, without needing to trust the operators of Zeus that they do not behave improperly: the assurances provided by Zeus are at least as strong as those in traditional elections. Zeus has been used in more than 120 elections, involving more than 22000 voters, and is continuously in use. It has shown that it can be used when traditional elections cannot take place, due to hostile conditions, and is actively being developed and evolved.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Automated integration of wireless biosignal collection devices for patient-centred decision-making in point-of-care systems",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/document/7888816/",
            "Abstract": "The proper acquisition of biosignals data from various biosensor devices and their remote accessibility are still issues that prevent the wide adoption of point-of-care systems in the routine of monitoring chronic patients. This Letter presents an advanced framework for enabling patient monitoring that utilises a cloud computing infrastructure for data management and analysis. The framework introduces also a local mechanism for uniform biosignals collection from wearables and biosignal sensors, and decision support modules, in order to enable prompt and essential decisions. A prototype smartphone application and the related cloud modules have been implemented for demonstrating the value of the proposed framework. Initial results regarding the performance of the system and the effectiveness in data management and decision-making have been quite encouraging.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:WbkHhVStYXYC",
            "Publisher": "IET"
        },
        {
            "Title": "DIANA-LncBase v2: indexing microRNA targets on non-coding transcripts",
            "Publication year": 2016,
            "Publication url": "https://academic.oup.com/nar/article-abstract/44/D1/D231/2503082",
            "Abstract": "microRNAs (miRNAs) are short non-coding RNAs (ncRNAs) that act as post-transcriptional regulators of coding gene expression. Long non-coding RNAs (lncRNAs) have been recently reported to interact with miRNAs. The sponge-like function of lncRNAs introduces an extra layer of complexity in the miRNA interactome. DIANA-LncBase v1 provided a database of experimentally supported and in silico predicted miRNA Recognition Elements (MREs) on lncRNAs. The second version of LncBase (www.microrna.gr/LncBase) presents an extensive collection of miRNA:lncRNA interactions. The significantly enhanced database includes more than 70 000 low and high-throughput, (in)direct miRNA:lncRNA experimentally supported interactions, derived from manually curated publications and the analysis of 153 AGO CLIP-Seq libraries. The new experimental module presents a 14-fold increase compared to the …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Goneis. gr: Training Greek Parents on ICT and Safer Internet",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04757-2_11",
            "Abstract": "Children’s use of the Internet has significantly risen in the last decade. Nevertheless, children spend a lot of time online which makes them susceptible to various threats (such as inappropriate material, offensive language, etc). Parents are the last frontier to this menace but they also need to be educated and trained in order to protect their children. Goneis.gr is an initiative launched by the Greek government that aims to educate parents on safer Internet and the use of parental control software. Parents are also entitled to distance learning courses covering basic computer skills. This paper presents the results of two separate surveys that took place in the last few months (December 2008-January 2009). The first survey targeted the parents that have completed the programme and the second one the educational providers that participate in the programme and offer the training to the beneficiaries.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Advancing Quantified-Self Applications Utilizing Visual Data Analytics and the Internet of Things",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-92016-0_24",
            "Abstract": "The exponential growth of the number and variety of IoT devices and applications for personal use, as well as the improvement of their quality and performance, facilitates the realization of intelligent eHealth concepts. Nowadays, it is easier than ever for individuals to monitor themselves, quantify and log their everyday activities in order to gain insights about their body performance and receive recommendations and incentives to improve it. Of course, in order for such systems to live up to the promise, given the treasure trove of data that is collected, machine learning techniques need to be integrated in the processing and analysis of the data. This systematic and automated quantification, logging and analysis of personal data, using IoT and AI technologies, has given birth to the phenomenon of Quantified-Self. This work proposes a prototype decentralized Quantified-Self application, built on top of a …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A tile size selection analysis for blocked array layouts",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1423142/",
            "Abstract": "Efficient use of the memory hierarchy is essential for good performance due to the ever-increasing gap between processor and memory speed. Program transformations such as loop tiling have been shown to be an effective approach to improving locality and cache exploitation, especially for dense matrix scientific computations. In conjunction with tiling, several experimental studies have been conducted on blocked data layouts, as a data transformation technique used to boost the cache performance. The stability of the achieved performance improvements are heavily dependent on the appropriate selection of tile sizes, taking into account the actual layout of the arrays in memory. In this paper, we first provide a theoretical analysis for the cache and TLB performance of blocked data layouts. According to this analysis, the optimal tile size that maximizes L1 cache utilization, should completely fit in the L1 cache, to …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RIS3 Assessment: Central Macedonia",
            "Publication year": 2012,
            "Publication url": "http://www.urenio.org/komninos/wp-content/uploads/2014/01/RIS3-review-report-Central-Macedonia-final-edited-2012.pdf",
            "Abstract": "Central Macedonia has struggled to fulfil its potential to develop a more knowledge intensive business structure and to profit from it’s position as a ‘business and cultural’cross-roads in south-east Europe. Central Macedonia has been hard hit by the economic crisis with already below average GDP and above average unemployment being further worsened by a surge in unemployment since 2008. This weak performance is due largely to the slow pace of restructuring from low to medium technology intensive towards higher-tech manufacturing. Although the regional economy is increasingly dominated by services the bulk of activity is in fields such as retail trade, tourism and transport services despite efforts to create or attract knowledge intensive services.In terms of industrial specialisation, the manufacturing sector remains highly specialised in certain medium-to-low technology and labour-intensive sectors, such as the food industry, textiles & clothing, non-metallic mineral products and furniture, with lower productivity than the national average. However, there a number of new knowledge-intensive sectors like bio-agriculture, bio-medicine, and ICT that seem promising but still attract relatively limited investment. The region has certainly made efforts to support ICT based development, for instance through the Regional Innovation Pole.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "TALOS: An interactive Web-enabled educational environment on mobile robot technology",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/880447/",
            "Abstract": "The Talos educational environment is an attempt to approach the constructionist theory of learning. Constructionism asserts that knowledge is not simply transmitted from teacher to student, but is actively constructed in the mind of the learner. Moreover, constructionism suggests that learners are particularly likely to create new ideas when they are actively engaged in making external artifacts that they can reflect upon and share with others. The presented system (Talos) deals with an interactive simulation environment for learning the principles of mobile robot operation and programming.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A versatile architecture for building IoT quantified-self applications",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8104245/",
            "Abstract": "The abundance of activity trackers and biosignal sensors as well as the evolution of IoT and communication technologies have considerably advanced the concept of Quantified-Self. Nowadays there are several frameworks and applications that realize the concept, focusing though strictly on specific areas, from daily use to professional activities such as sport and healthcare. This work proposes a versatile, cross-domain solution for building quantified-self applications exploiting the capacities for open-design, modularity and extensibility of the AGILE IoT gateway.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the integration of wearable sensors in IoT enabled mHealth and quantified-self applications",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_9",
            "Abstract": "The regular use of activity trackers and biosignal sensors from non-professional users is constantly increasing, while for patients with chronic diseases has already become part of their daily routine for a continuous assessment of their health condition. However, the integration of such devices into larger systems such as health monitoring stations or assisted living applications is not straightforward due to a series of business, operational and technical issues which introduce extreme complexity for end-users and developers to properly support their diverse functionally and features. This work presents a thorough analysis of the aforementioned issues, proposes a generic integration solution for Bluetooth devices and evaluates the respective prototype implementations for Android and Linux systems.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:1qzjygNMrQYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Real-time medical collaboration services over the web",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7318629/",
            "Abstract": "The gradual shift in modern medical practice, from working alone clinical doctors to MDTs (Multi-Disciplinary Teams), raises the need of online real-time collaboration among geographically distributed medical personnel. The paper presents a Web-based platform, featuring an efficient medical data management and exchange, for hosting real-time collaborative services. The presented work leverages state-of-the-art features of the web (technologies and APIs) to support client-side medical data processing. Moreover, to address the typical bandwidth bottleneck and known scalability issues of centralized data sharing, an indirect RPC (Remote Process Call) scheme is introduced through object synchronization over the WebRTC paradigm.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobile reminder system for furthering patient adherence utilizing commodity smartwatch and Android devices",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7015925/",
            "Abstract": "Patients' non-adherence is a common problem that significantly reduces the effectiveness of treatments and increases mortality and healthcare costs. Forgetfulness is reported as a usual barrier to adherence. Electronic reminder systems consist an increasingly used type of intervention, which assists patients that are facing this problem. Important requirements regarding the design of such systems are multimodality, personalization and easy integration into the patient's daily life. The goal of this work is to present a multimodal electronic reminder system that supports the use of smart devices and utilizes the recently introduced Pebble smartwatch. The system employs cloud technology and also allows for other types of users with a supportive role in the patient's health care, such as the patient's doctor and pharmacist. Patient compliance is measured automatically with the method of self-reporting. The paper includes …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distance measurement in volunteer computing networks: a completely decentralized approach",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1347808/",
            "Abstract": "Volunteer computing is a relatively new computing paradigm that is often the only solution to large computational tasks. Due to the dynamic structure of the peer-to-peer systems that usually form the backbone of volunteer computing, obtaining accurate distance metrics using traditional techniques is infeasible. Thus, techniques that could improve system performance, such as dynamic load balancing, are very difficult to implement. We show that the master-worker paradigm used by the overwhelming majority of volunteer computing applications results in certain network topology and protocol characteristics that render distance measurement method with zero network overhead feasible and preferable. Therefore, we present a simple distance measurement method that is based on passive monitoring of application-level traffic. We subsequently test the method using simulation as well as a reference implementation …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "National Technical University of Athens, Department of Electrical and Computer Engineering, Division of Computer Science Zografou Campus, 157-73 Zografou, Athens, Greece e-mail:{jdros, nkoziris)@ cslab. ece. ntua. gr",
            "Publication year": 2000,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=EWLVCgAAQBAJ&oi=fnd&pg=PA83&dq=info:M0M_fGklnCkJ:scholar.google.com&ots=XueE_g7ker&sig=ybhHOfURL_FRIy588mkvHtY-Cj0",
            "Abstract": "This paper presents a new method for the problem of mapping of nested FOR-loops with uniform dependencies, into mesh-connected parallel architectures. This method is based on loop mapping for systolic arrays. The virtual array of cells is derived from the index space, by applying a linear transformation. This array is divided (cut) into a fixed number of clusters, equal to the number of available real processors. The basic idea of our method is that the cutting is performed along properly selected boundary directions, so as to minimize inter-cluster communication and equilibrate the number of virtual cells for every cluster. Each cluster is then assigned to a different processor, which performs in a roughly independent manner, as the communication requirements are now minimized. This mapping cuts down overall communication delays, while using a fixed number of processors from a (n-1)-dimensional mesh-connected distributed architecture.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:bFI3QPDXJZMC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "PUNPITIPIAMSA-NGA SR SUBRAMANYA",
            "Publication year": 2001,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=UhvArtGRNzMC&oi=fnd&pg=PA231&dq=info:06ynKIqawnIJ:scholar.google.com&ots=76IWS0R37k&sig=_Nx5xDirpfmGNBC6GOCYzEOQkjY",
            "Abstract": "Content-based indexing of audio (and multimedia) data has become more important since conventional databases cannot provide the necessary efficiency and performance [1, 2]. However, there are three main difficult problems. First, the content of audio data is subjective information; it is hard to give the descriptions in words. The recognition of data content requires prior knowledge and special techniques in Signal Processing and Pattern Recognition, which usually require long computing time. Second, since several audio features can be used as indices [3](such as pitch, amplitude, and frequency), a method or processing technique designed and developed for one feature may not be appropriate for another. Third, the extremely large data size and the use of a similarity search require extensive computation. Similarity matching is based upon the computation of the distance between a query and each record in the database; the best match is in the data set with the smallest distances. To solve these three problems, we 231",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:_Ybze24A_UAC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Grid-enabled instrument representation and reservation",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4736735/",
            "Abstract": "The integration of instruments with the grid promotes scientific and business collaboration by allowing shared access to rare and expensive instrumentation, regardless of its physical location. Instruments on the grid are virtualized resources similar to storage and computing devices, and can be part of composite services or workflows concurrently invoked by multiple users in such service-oriented environments. The requirement for real-time, interactive control of instruments poses a need for exclusive or limited access by concurrent clients. Unfortunately, instrument modeling and standardization of instrument reservation and management are still in a very early stage. According to a number of use case requirements, which we review in this work, we propose a standards-compliant model for the representation of instruments on the grid, and we describe a set of primitives for their reservation. The definition of these …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Correction to: An Intelligent Cloud-Based Platform for Effective Monitoring of Patients with Psychotic Disorders",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-49186-4_38.pdf",
            "Abstract": "The original version of this chapter was revised. The first name of one of the authors inadvertantly contained a typo. The author’s first name has been corrected to “Niki.”",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:UHK10RUVsp4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "mPharmacy: A System enabling prescription and personal assistive medication management on mobile devices",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20865-2_20",
            "Abstract": "The electronic management of drug treatment can provide means for prescription expenditure control as well as improve the medication process of patients and reduce the risk of adverse drug events. This paper presents the design and implementation details of a mobile platform based on Android OS that can be used for assistive medication management. The presented system is intended for physicians, pharmacists, health managers and patients, enabling not only medication prescribing but personalized treatment monitoring as well, which involves the issuing of alerts and reminders.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An enhanced device-transparent real-time teleconsultation environment for radiologists",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8333698/",
            "Abstract": "This paper describes a novel web-based platform promoting real-time advanced teleconsultation services on medical imaging. Principles of heterogeneous workflow management systems and state-of-the-art technologies such as the microservices architectural pattern, peer-to-peer networking, and the single-page application concept are combined to build a scalable and extensible platform to aid collaboration among geographically distributed healthcare professionals. The real-time communication capabilities are based on the webRTC protocol to enable direct communication among clients. This paper discusses the conceptual and technical details of the system, emphasizing on its innovative elements.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Increasing usability of homecare applications for older adults: A case study",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/459272",
            "Abstract": "As the world’s population is ageing, the field dealing with technology adoption by seniors has made headway in the scientific community. Recent technological advances have enabled the development of intelligent homecare systems that support seniors’ independent living and allow monitoring of their health status. However, despite the amount of research to understand the requirements of systems designed for the elderly, there are still unresolved usability issues that often prevent seniors from enjoying the benefits that modern ICT technologies may offer. This work presents a usability assessment of “HeartAround”, an integrated homecare solution incorporating communication functionalities, as well as health monitoring and emergency response features. An assessment with the system usability scale (SUS) method, along with in-depth interviews and qualitative analysis, has provided valuable insights for designing homecare systems for seniors, and validated some effective practical guidelines. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "An Array Architecture for Syntactic Pattern",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=8OSoCAAAQBAJ&oi=fnd&pg=PA87&dq=info:yLXoG9rDBjAJ:scholar.google.com&ots=68pstviUmb&sig=71Zy9Ss2-Uj2EquKJHvSE9ao8Fo",
            "Abstract": "Syntactic methods are an important tool for tackling recognition and classification problems. In areas such as the analysis of natural languages, or speech recognition, the syntactic approach gains wide interest by the scientific community. The complexity of the patterns and the wide variety of the features that characterize them, makes impractical the use of common decision-theoretic approaches [1]. In many applications, such as the processing of biomedical signals (eg, ECG, EEG, eta), Syntactic methods have been considered as an alternative way of simultaneous detection and classification of some characteristic complexes of these signals. The kernel of all such methods is the parsing algorithm, which is responsible for analyzing the complex object into a sequence of primitive patterns. The complexity of the parsing procedure depends on the class of the underlying grammar. Context-free grammars combine satisfactorily both the expressive power and the simplicity in their analysis. They can describe many features of natural languages and are widely used in Syntactic pattern recognition applications.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:f2IySw72cVMC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "PolicyCLOUD: Analytics as a Service Facilitating Efficient Data-Driven Public Policy Management",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49161-1_13",
            "Abstract": "While several application domains are exploiting the added-value of analytics over various datasets to obtain actionable insights and drive decision making, the public policy management domain has not yet taken advantage of the full potential of the aforementioned analytics and data models. Diverse and heterogeneous datasets are being generated from various sources, which could be utilized across the complete policies lifecycle (i.e. modelling, creation, evaluation and optimization) to realize efficient policy management. To this end, in this paper we present an overall architecture of a cloud-based environment that facilitates data retrieval and analytics, as well as policy modelling, creation and optimization. The environment enables data collection from heterogeneous sources, linking and aggregation, complemented with data cleaning and interoperability techniques in order to make the data ready for …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:ye4kPcJQO24C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Accurate microRNA target prediction correlates with protein repression levels",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2105-10-295",
            "Abstract": "MicroRNAs are small endogenously expressed non-coding RNA molecules that regulate target gene expression through translation repression or messenger RNA degradation. MicroRNA regulation is performed through pairing of the microRNA to sites in the messenger RNA of protein coding genes. Since experimental identification of miRNA target genes poses difficulties, computational microRNA target prediction is one of the key means in deciphering the role of microRNAs in development and disease. DIANA-microT 3.0 is an algorithm for microRNA target prediction which is based on several parameters calculated individually for each microRNA and combines conserved and non-conserved microRNA recognition elements into a final prediction score, which correlates with protein production fold change. Specifically, for each predicted interaction the program reports a signal to noise ratio and a precision score …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:rO6llkc54NcC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "A fast parallel algorithm for frequent itemsets mining",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-74161-1_23",
            "Abstract": "Mining frequent itemsets from large databases is an important computational task with a lot of applications. The most known among them is the market-basket problem which assumes that we have a large number of items and we want to know which items are bought together. A recent application is that of web pages (baskets) and linked pages (items). Pages with many common references may be about the same topic. In this paper we present a parallel algorithm for mining frequent itemsets. We provide experimental evidence that our algorithm scales quite well and we discuss the merits of parallelization for this problem.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Ultrahigh resolution wind forecasting for the sailing events at the Rio de Janeiro 2016 Summer Olympic Games",
            "Publication year": 2018,
            "Publication url": "https://rmets.onlinelibrary.wiley.com/doi/abs/10.1002/met.1672",
            "Abstract": "The current study presents AEOLUS‐RIO2016, an ultrahigh resolution wind forecasting system that was developed and implemented operationally for supporting the Hellenic Olympic Sailing Team during the sailing events at the Rio de Janeiro 2016 Summer Olympic Games. The forecasting system was built around the state‐of‐the‐art numerical weather prediction Weather Research and Forecasting model, ported to a high performance computing infrastructure that ensured the reliability and timeliness of the provided service. Advanced web mapping tools were employed for communicating forecasts effectively to the athletes and coaches throughout the period of the sailing events. Prior to the operational deployment of AEOLUS‐RIO2016, sensitivity experiments were carried out, focusing on the representation of topography and land use and aiming at improving wind forecasts. The results suggest that the …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:eflP2zaiRacC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "RIS3 Regional Assessment: Attica: A report to the European Commission, Directorate General for Regional Policy",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=1113140704503584033&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilizing a homecare platform for remote monitoring of patients with idiopathic pulmonary fibrosis",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-57348-9_15",
            "Abstract": "Homecare and home telemonitoring are a focal point of emerging healthcare schemes, with proven benefits for both patients, caregivers and providers, including reduction of healthcare costs and improved patients’ quality of life, especially in the case of chronic disease management. Studies have evaluated solutions for remote monitoring of chronic patients based on technologies that allow daily symptom and vital signs monitoring, tailored to the needs of specific diseases. In this work, we present an affordable home telemonitoring system for patients with idiopathic pulmonary fibrosis (IPF), based on an application for mobile devices and Bluetooth-enabled sensors for pulse oximetry and blood pressure measurements. Besides monitoring of vital signs, the system incorporates communication via videoconferencing and emergency response, with support from a helpdesk service. A pilot study was conducted …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Reducing the communication cost via chain pattern scheduling",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1565952/",
            "Abstract": "This paper deals with general nested loops and proposes a novel scheduling methodology for reducing the communication cost of parallel programs. General loops contain complex loop bodies (consisting of arbitrary program statements, such as assignments, conditions and repetitions) that exhibit uniform loop-carried dependencies. Therefore it is now possible to achieve efficient parallelization for a vast class of loops, mostly found in DSP, PDEs, signal and video coding. We use computational geometry methods, that exploit efficiently the regularity of nested loops index spaces, in order to significantly reduce the communication cost, which in most cases is the main drawback of parallel programs' performance. Through extensive testing, we show that the proposed method outperforms in all cases the classic cyclic mapping, succeeding to reduce the communication by 15%-35%. This significant reduction of the …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Chain grouping: a method for partitioning loops onto mesh-connected processor arrays",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/879777/",
            "Abstract": "This paper presents Chain Grouping, a new low complexity method for the problem of partitioning the loop iteration space into groups with little intercommunication requirements, for mapping onto mesh-connected architectures. First, the iterations are scheduled in time, according to the hyperplane method, taking into consideration the minimum time displacement. Then, the iteration space is divided into discrete groups of related iterations, which are assigned to different processors, while preserving the optimal completion time. Chain Grouping is based on clustering together neighboring uniform chains of iterations, formed by a particular dependence vector. This vector will be proven as the best among all to reduce the total communication requirements. Inside every group, the optimal hyperplane scheduling is preserved and references to intragroup iterations are considerably increased. The partitioned groups are …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DIANA-miRGen v3. 0: accurate characterization of microRNA promoters and their regulators",
            "Publication year": 2016,
            "Publication url": "https://academic.oup.com/nar/article-abstract/44/D1/D190/2503068",
            "Abstract": "microRNAs (miRNAs) are small non-coding RNAs that actively fine-tune gene expression. The accurate characterization of the mechanisms underlying miRNA transcription regulation will further expand our knowledge regarding their implication in homeostatic and pathobiological networks. Aim of DIANA-miRGen v3.0 (http://www.microrna.gr/mirgen) is to provide for the first time accurate cell-line-specific miRNA gene transcription start sites (TSSs), coupled with genome-wide maps of transcription factor (TF) binding sites in order to unveil the mechanisms of miRNA transcription regulation. To this end, more than 7.3 billion RNA-, ChIP- and DNase-Seq next generation sequencing reads were analyzed/assembled and combined with state-of-the-art miRNA TSS prediction and TF binding site identification algorithms. The new database schema and web interface facilitates user interaction, provides advanced …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:738O_yMBCRsC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "An intelligent platform for hosting medical collaborative services",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07064-3_28",
            "Abstract": "Recent developments in cloud computing technologies, the widespread use of mobile smart devices and the expansion of electronic health record system, raise the need of on-line collaboration among geographically distributed medical personnel. In this context, the paper presents a web based intelligent platform, capable of hosting medical collaborative services and featuring intelligent medical data management and exchange. Our work emphasizes on client-side medical data processing over an intelligent online workflow library. We introduce a Remote Process Calling scheme based on WebRTC (peer-to-peer) communication paradigm, eliminating the typical bandwidth bottleneck of centralized data sharing and allowing the execution of intelligent workflows.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A DICOM based collaborative platform for real-time medical teleconsultation on medical images",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-57348-9_7",
            "Abstract": "The paper deals with the design of a Web-based platform for real-time medical teleconsultation on medical images. The proposed platform combines the principles of heterogeneous Workflow Management Systems (WfMSs), the peer-to-peer networking architecture and the SPA (Single-Page Application) concept, to facilitate medical collaboration among healthcare professionals geographically distributed. The presented work leverages state-of-the-art features of the web to support peer-to-peer communication using the WebRTC (Web Real Time Communication) protocol and client-side data processing for creating an integrated collaboration environment. The paper discusses the technical details of implementation and presents the operation of the platform in practice along with some initial results.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A decentralized multichannel length transformation algorithm and its parallel implementation for real-time ECG monitoring",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010480900915441",
            "Abstract": "Multichannel algorithms have been developed for more accurate analysis of electrocardiograms (ECGs). Their benefit is the ability to use the information contained in all simultaneously acquired channels. In this paper we present a multichannel version of a nonsyntactic algorithm, based on length transformation. The proposed algorithm uses a decentralized schema for combining the results derived from each individual lead, instead of a global/centralized one (a spatial vector approach). Its performance was evaluated using the CSE database and real ECGs acquired by a 12-lead cardiograph. The results are also compared with previous—single-channel and multichannel—versions of the algorithm, showing a better performance. Since a multichannel algorithm is always a time-consuming task, it is rarely used in real-time monitoring systems. Motivated by this observation, we designed a parallel implementation of …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:4DMP91E08xMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "IKAROS: a Scalable I/O Framework for High-Performance Computing Systems",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121216300589",
            "Abstract": "High performance computing (HPC) has crossed the Petaflop mark and is reaching the Exaflop range quickly. The exascale system is projected to have millions of nodes, with thousands of cores for each node. At such an extreme scale, the substantial amount of concurrency can cause a critical contention issue for I/O system. This study proposes a dynamically coordinated I/O architecture for addressing some of the limitations that current parallel file systems and storage architectures are facing with very large-scale systems. The fundamental idea is to coordinate I/O accesses according to the topology/profile of the infrastructure, the load metrics, and the I/O demands of each application. The measurements have shown that by using IKAROS approach we can fully utilize the provided I/O and network resources, minimize disk and network contention, and achieve better performance.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:vRqMK49ujn8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Hyperplane grouping and pipelined schedules: how to execute tiled loops fast on clusters of SMPs",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11227-005-0298-8",
            "Abstract": "This paper proposes a novel approach for the parallel execution of tiled Iteration Spaces onto a cluster of SMP PC nodes. Each SMP node has multiple CPUs and a single memory mapped PCI-SCI Network Interface Card. We apply a hyperplane-based grouping transformation to the tiled space, so as to group together independent neighboring tiles and assign them to the same SMP node. In this way, intranode (intragroup) communication is annihilated. Groups are atomically executed inside each node. Nodes exchange data between successive group computations. We schedule groups much more efficiently by exploiting the inherent overlapping between communication and computation phases among successive atomic group executions. The applied non-blocking schedule resembles a pipelined datapath, where group computation phases are overlapped with communication ones, instead of being …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:lSLTfruPkqcC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Evaluating a Greek National Action on Parents’ Training on ICT and Internet Safety",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11631-5_29",
            "Abstract": "The Greek national action “Goneis.gr” educates and trains the parents of highschool children on the issue of safer internet, as well as on the use of ICT. Having trained more than 28.300 parents, the initiative aims at providing about 45.000 parents with the same training. Examining the Beneficiaries’ degree of satisfaction by the initiative, we conducted a survey in a sample of Beneficiaries that completed the training. This paper introduces the initiative and presents the results of the survey in order to conclude to specific decisions about the future implementation of the initiative which is still running.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Scheduling Nested Loops with the Least Number of Processors.",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/42544280/Scheduling_Nested_Loops_with_the_Least_N20160210-24729-1k76z6e.pdf",
            "Abstract": "Usually the most computationally intensive part of a program is attributed to the nested loops it contains. It is therefore of interest to try to parallelize the nested loops in order to reduce the overall computation time. A special category of FOR (DO) nested loops are the uniform dependence loops, which yield efficient parallelization techniques and are the focus of this paper. The primary goals in this area of research are:(1) achieving the optimal parallel time and (2) minimizing the number of processing elements required for the execution of the parallel program. In this paper we present a new dynamic lower bound on the number of processors needed for scheduling and we use a decision algorithm to verify that all uniform dependence loops can achieve this bound.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient algorithm for the physical mapping of clustered task graphs onto multiprocessor architectures",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/823437/",
            "Abstract": "The most important issue in sequential program parallelisation is the efficient assignment of computations into different processing elements. In the past, too many approaches were devoted in efficient program parallelization considering various models for the parallel programs and the target architectures. The most widely used parallelism description model is the task graph model with precedence constraints. Nevertheless, as far as physical mapping of tasks onto parallel architectures is concerned little research has given practical results. It is well known that the physical mapping problem is NP-hard in the strong sense, thus allowing only for heuristic approaches. Most researchers or tool programmers use exhaustive algorithms, or the classical method of simulated annealing. This paper presents an alternative approach onto the mapping problem. Given the graph of clustered tasks, and the graph of the target …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of a mobile home care platform",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-26005-1_22",
            "Abstract": "As the population of the industrialized world is aging, the field that deals with seniors’ adoption of technology has gained ground in the scientific community. Recent advances in technology have allowed the development of sophisticated telecare systems that support the independent living of seniors, with communication, remote health monitoring and emergency response services. However, usability issues often prevent elderly people from enjoying the benefits of modern technology, despite the amount of research to understand their needs in system design. In this work, we have performed a usability assessment of the “BioAssist” system, which is an integrated home care platform that incorporates both communication and health monitoring features. A comparative evaluation with the “iTriage” application, followed by a series of interviews and qualitative analysis have provided us with valuable insights and …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:_xSYboBqXhAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Αναζήτηση και υπηρεσίες εξατομίκευσης σε ένα κατανεμημένο δίκτυο συνεργαζόμενων ψηφιακών ϐιβλιοθηκών Φυσικής Υψηλής Ενέργειας: αναβάθμιση του λογισμικού του CERN Document Server",
            "Publication year": 2010,
            "Publication url": "https://cds.cern.ch/record/1248435",
            "Abstract": "Το CERN, ο ευρωπαϊκός οργανισµός πυρηνικών ερευνών, δραστηριοποιείται εδώ και χρόνια στη διάδοση των ερευνητικών του αποτελεσµάτων. Για το σκοπό αυτό, αναπτύσσει και χρησιµοποιεί το λογισµικό CDS Invenio, ένα πλήρες σύστηµα ψηϕιακής ϐιβλιοθήκης για την αποθήκευση, συντήρηση, διαχείριση και διάθεση του έργου του. Το λογισµικό ϐελτιώνεται και εµπλουτίζεται συνεχώς, ώστε να αναποκρίνεται στις ϐιβλιογραφικές ανάγκες των ερευνητών και των επιστηµόνων.΄ Ενας από τους σύγχρονους στόχους του είναι η δυνατότητα συνεργασίας µεταξύ αντίστοιχων ψηφιακών ϐιβλιοθηκών, οργανισµών κοινών ερευνητικών ενδιαφερόντων. Στα πλαίσια µιας τέτοιας συνεργασίας προβλέπεται η δυνατότητα αναζήτησης και υπηρεσιών εξατοµίκευσης σε ένα κατανεµηµένο δίκτυο συνεργαζόµενων ψηφιακών ϐιβλιοϑηκών.Στην παρούσα εργασία εξετάσαµε καταρχήν εκτενώς τις αρχές λειτουργίας και τα χαρακτηριστικά του λογισµικού CDS Invenio. Με ϐάση αυτά, προτείναµε και υλοποιήσαµε µια σχεδίαση η οποία επιτρέπει την αναζήτηση και τη χρήση υπηρεσιών εξατοµίκευσης σε ένα κατανεµηµένο δίκτυο συνεργαζόµενων ψηφιακών ϐιβλιοθηκών. Περιγράψαµε αναλυτικά όλες τις απαραίτητες αλλαγές και προσθήκες για την επίτευξη του σκοπού µας. Στον πυρήνα της σχεδίασής µας ϐρίσκονται οι ϕιλοξενούµενες συλλογές, οι οποίες παραπέµπουν σε διαφορετικές συλλογές εγγραφών των µελών του κατανεµηµένου δικτύου. Μια σειρά συναρτήσεων αναλαµβάνουν την αναζήτηση στις συλλογές αυτές µέσω διαδικτυακών πρωτοκόλλων επικοινωνίας, προσκοµίζοντας και ακολούθως αναλύοντας τα δεδοµένα. Με παρόµοιο τρόπο πραγµατοποιείται και η υλοποίηση …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A low-cost IoT-based health monitoring platform enriched with social networking facilities",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8480186/",
            "Abstract": "The use of distant health monitoring solutions is consciously increasing nowadays exploiting the advancements in modern technologies such as the Internet of Things (IoT), mobile networking and pervasive communication. Already in cases of chronic disease management the regular use of mHealth and telemonitoring approaches is very common facilitating the constant patient monitoring and enabling the use of innovative features for patients, medical experts and caregivers. Remote communication is essential as it allows the prevention or/and the precise treatment of patients. The power efficiency, the computing capabilities and the affordability of modern biosignals sensors, portable computing machines and IoT devices allows for the development of advanced and compelling solutions in the area of mHealth and patient telemonitoring. This work presents a low-cost, IoT enabled, home monitoring solution, as part …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Grid-Enabled Instrument Representation and Reservation",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=6524785152738222160&hl=en&oi=scholarr",
            "Abstract": "The integration of instruments with the Grid promotes scientific and business collaboration by allowing shared access to rare and expensive instrumentation, regardless of its physical location. Instruments on the Grid are virtualized resources similar to storage and computing devices, and can be part of composite services or workflows concurrently invoked by multiple users in such Service-Oriented environments. The requirement for real-time, interactive control of instruments poses a need for exclusive or limited access by concurrent clients. Unfortunately, instrument modeling and standardization of instrument reservation and management are still in a very early stage. According to a number of use case requirements, which we review in this work, we propose a standards-compliant model for the representation of instruments on the Grid, and we describe a set of primitives for their reservation. The definition of these …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pythia: identifying dangerous data-flows in Django-based applications",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3301417.3312497",
            "Abstract": "Web frameworks that allow developers to create applications based on design patterns such as the Model View Controller (MVC), provide by default a number of security checks. Nevertheless, by using specific constructs, developers may disable these checks thus re-introducing classic application vulnerabilities such as Cross-site Scripting (XSS) and Cross-Site Request Forgery (CSRF). Framework-specific elements including (1) the complex nature of these applications,(2) the different features that they involve (eg templates), and (3) the inheritance mechanisms that governs them, make the identification of such issues very difficult.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Partial Parsing with Grammatical Features",
            "Publication year": 2000,
            "Publication url": "https://www.aclweb.org/anthology/2000.iwpt-1.38/",
            "Abstract": "This paper describes a rule based method for partial parsing, particularly for noun phrase recognition, which has been used in the development of a noun phrase recognizer for Modern Greek. This technique is based on a cascade of finite state machines, adding to them a characteristic very crucial in the parsing of words with free word order: the simultaneous examination of part of speech and grammatical feature information, which are deemed equally important during the parsing procedure, in contrast with other methodologies.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "RIS3 National Assessment: Greece Smart specialisation as a means to foster economic renewal",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=15822292245576691639&hl=en&oi=scholarr",
            "Abstract": "This report summarises the findings of a team of experts in support of the preparation smart specialisation strategies (S3) as a basis for the 2014-20 programming of the Structural Funds. The experts were asked to provide policy advice and methodological recommendations in order to ensure the following seven key points are addressed by the Greek authorities:",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computing frequent itemsets in parallel using partial support trees",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11557265_9",
            "Abstract": "A key process in association rules mining, which has attracted a lot of interest during the last decade, is the discovery of frequent sets of items in a database of transactions. A number of sequential algorithms have been proposed that accomplish this task. In this paper we study the parallelization of the partial-support-tree approach (Goulbourne, Coenen, Leng, 2000). Results show that this method achieves a generally satisfactory speedup, while it is particularly adequate for certain types of datasets.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:LPZeul_q3PIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computing frequent itemsets in parallel using partial support trees",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121206000793",
            "Abstract": "A key process in association rules mining, which has attracted a lot of interest during the last decade, is the discovery of frequent sets of items in a database of transactions. A number of sequential algorithms have been proposed that accomplish this task. On the other hand, only few parallel algorithms have appeared in the literature. In this paper, we study the parallelization of the partial-support-tree approach Goulbourne et al. (2000). Numerical results show that this method is generally competitive, while it is particularly adequate for certain types of datasets.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:70eg2SAEIzsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Knowledge Discovery on IoT-Enabled mHealth Applications",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-32622-7_16",
            "Abstract": "The exponential growth of the number and variety of IoT devices and applications for personal use, as well as the improvement of their quality and performance, facilitates the realization of intelligent eHealth concepts. Nowadays, it is easier than ever for individuals to monitor themselves, quantify, and log their everyday activities in order to gain insights about their body’s performance and receive recommendations and incentives to improve it. Of course, in order for such systems to live up to the promise, given the treasure trove of data that is collected, machine learning techniques need to be integrated in the processing and analysis of the data. This systematic and automated quantification, logging, and analysis of personal data, using IoT and AI technologies, have given birth to the phenomenon of Quantified-Self. This work proposes a prototype decentralized Quantified-Self application, built on top of a …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Elixir-GR: Managing and analyzing Life Sciences Data",
            "Publication year": 2018,
            "Publication url": "http://helios-eie.ekt.gr/EIE/handle/10442/15705",
            "Abstract": "The Greek ELIXIR National Node addresses the needs of the Greek life sciences research community and other stakeholders of the public and the private sector for open, integrated and state-of-the-art bioinformatics and biocomputing resources.  ELIXIR unites Europe’s leading life science organisations in managing and safeguarding the increasing volume of data being generated by publicly funded research. It coordinates, integrates and sustains bioinformatics resources across its member states and enables users in academia and industry to access services that are vital for their research.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On quality of service support for grid computing",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09663-6_21",
            "Abstract": "Computing Grids are hardware and software infrastructures that support secure sharing and concurrent access to distributed services by a large number of competing users from different virtual organizations. Concurrency can easily lead to overload and resource shortcomings in large-scale Grid infrastructures, as today’s Grids do not offer differentiated services. We propose a framework for supporting quality of service guarantees via both reservation and discovery of best-effort services based on the matchmaking of application requirements and quality of service performance profiles of the candidate services. We illustrate the middleware components needed to support both strict and loose guarantees and the performance assessment techniques for the discovery of suitable services.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Versatile cloud collaboration services for device-transparent medical imaging teleconsultations",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8104208/",
            "Abstract": "In this work, we present a novel web-based platform for real-time teleconsultation services on medical imaging. The introduced platform encompasses the principles of heterogeneous Workflow Management Systems (WFMSs) and the peer-to-peer paradigm to enhance collaboration among healthcare professionals. The novelty of the presented work is that: (i) it combines the concept of client side computing with the microservices architectural pattern to enhance user experience, while increasing the efficiency of healthcare provision, and that (ii) it could be considered the springboard of an ecosystem of Computer-Supported Cooperative Work (CSCW) services in medicine. The paper discusses the implementation details and the technological aspects behind the whole system, along with some initial evaluation results.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "AB004. A home telemonitoring program for patients with idiopathic pulmonary fibrosis and combined pulmonary fibrosis and emphysema",
            "Publication year": 2016,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc5159362/",
            "Abstract": "BackgroundHomecare and home telemonitoring are a focal point of emerging healthcare schemes, with possible benefits for patients with chronic lung diseases, especially when complications occur. The aim of the present study was home monitoring of pulmonary fibrosis patients.MethodsEach patient was provided with an Android tablet with the mobile application pre-installed (“Heartaround”), as well as Bluetooth-enabled pulse oximeter and blood pressure meter. Patients were instructed by their attending doctor to perform daily measurements of oxygen saturation and blood pressure and through the preinstalled application measurements were automatically stored in the electronic health record of each patient and made accessible to the attending physician. The patients’ enrollment in the pilot study did not substitute or affect in any way the patients’ schedule of regular visits to the clinic. In case of emergency …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "AME Publications"
        },
        {
            "Title": "TALOS: An interactive Web-enabled educational environment on mobile robot technology",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/880447/",
            "Abstract": "The Talos educational environment is an attempt to approach the constructionist theory of learning. Constructionism asserts that knowledge is not simply transmitted from teacher to student, but is actively constructed in the mind of the learner. Moreover, constructionism suggests that learners are particularly likely to create new ideas when they are actively engaged in making external artifacts that they can reflect upon and share with others. The presented system (Talos) deals with an interactive simulation environment for learning the principles of mobile robot operation and programming.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fall detection and activity identification using wearable and hand-held devices",
            "Publication year": 2016,
            "Publication url": "https://content.iospress.com/articles/integrated-computer-aided-engineering/ica509",
            "Abstract": "Human motion data captured from wearable devices such as smart watches can be utilized for activity recognition and emergency event detection, especially in the case of elderly or disabled people living independently in their homes. The output of such sensors is streams of physical activity data that require real-time recognition, especially in emergency situations. This paper presents a novel application that utilizes the low-cost Pebble Smart Watch together with an Android device (ie a smart phone) and allows the efficient capturing, transmission, storage and processing of such motion data. The paper includes the technical details of the stream data capturing and processing methodology, along with a comparison of the major algorithms used for the classification of physical activity type (ie Mild, Moderate, Intense and Sleep). An initial evaluation of the achieved accuracy in recognizing activity type, calculating the …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interaction in language based system level design using an advanced compiler generator environment",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/844536/",
            "Abstract": "Computer-aided synthesis of digital circuits from behavioural level specifications offers an effective way to deal with the increasing complexity of digital hardware design. A high-level synthesis tool transforms an abstract algorithmic description into a detailed register transfer level implementation. Even though considerable research has taken place, regarding high-level synthesis, practical implementations are just emerging. This happens due to the fact that designers demand interaction at both the specification and implementation level. This paper describes an efficient implementation of an original idea, for the design of a grammar based interactive design environment, which allows designers to supplement high-level synthesis optimizations and set constraints among the operators in the textual algorithmic description to meet their implementation preferences. The suggested methodology raises the feasibility for …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "From helios to zeus",
            "Publication year": 2013,
            "Publication url": "https://www.usenix.org/jets/issues/0101/tsoukalas",
            "Abstract": "We present Zeus, a verifiable internet ballot casting and counting system based on Helios, in which encrypted votes are posted eponymously to a server, then are anonymized via cryptographic mixing, and finally are decrypted using multiple trustee keys. Zeus refines the original Helios workflow to address a variety of practical issues, such as usability, parallelization, varying election types, and tallying through a separate computing system. In rough numbers, in the first nine months of deployment, Zeus has been used in 60 elections, tallying a total of more than 12000 votes.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed management of pervasive healthcare data through cloud computing",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29734-2_53",
            "Abstract": "This paper presents a distributed platform based on Cloud Computing for management of pervasive healthcare data. Pervasive applications through continuous monitoring of patients and their context generate a vast amount of data that need to be managed and stored for processing and future usage. Cloud computing and service-oriented applications are the new trends for efficient managing and processing data online. The Cumulocity cloud platform utilized in this work is especially developed for the support of sensors and machine-to-machine (M2M) communication infrastructures. This paper presents an integrated system for managing sensor data related to the detection of disabled or elderly citizens falls. Wearable sensors collect the fall related data, which are then handled by the Cumulocity Cloud Platform.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Dynamic scheduling of nested loops with uniform dependencies in heterogeneous networks of workstations",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1575815/",
            "Abstract": "Static algorithms have been proposed to parallelize loops with uniform dependencies for networks of workstations. However, the heterogeneous and dynamic nature of these networks demands a dynamic solution to the scheduling and load balancing problem. At the same time many dynamic scheduling algorithms have been proposed, but all of them are dealing with programs with parallel loops, i.e. loops without dependencies. In this paper we extend the applicability of dynamic algorithms by presenting a dynamic scheduling algorithm that uses simple data structures in order to handle programs with data dependencies. Experimental results validate the proposed algorithm in both homogeneous and heterogeneous networks.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fall detection using commodity smart watch and smart phone",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44654-6_7",
            "Abstract": "Human motion data captured from wearable devices such as smart watches can be utilized for activity recognition or emergency event detection, especially in the case of elderly or disabled people living independently in their homes. The output of such sensors is data streams that require real-time recognition, especially in emergency situations. This paper presents a novel application that utilizes the low-cost Pebble Smart Watch together with an Android device (i.e a smart phone) and allows the efficient transmission, storage and processing of motion data. The paper includes the details of the stream data capture and processing methodology, along with an initial evaluation of the achieved accuracy in detecting falls.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Precedence constrained scheduling: a case in P",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8129646/",
            "Abstract": "‘Unit execution time’ precedence constrained scheduling (UET) is an NP-complete problem with very few special cases known to be solvable in P-time. In this article we present a practically useful case of UET solvable in P-time: we show that if the task graph is given in levels that are ‘locally’ of in-degree two and of ‘width’ more than 1.55 times the number of processors (plus 1), then an optimal schedule can be found in P-time. Task graphs which represent algebraic computations fall ordinarily in this category. Our algorithm is based on a limited look-ahead technique which allows us to use it in an on-line fashion. In the appendix we give two short NP-completeness proofs which suggest that both ‘width’ and ‘degree’ restrictions are needed to get a polynomially solvable subcase.",
            "Abstract entirety": 1,
            "Author pub id": "UdV8-qIAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "OUP"
        },
        {
            "Title": "A Systolic Approach To Loop Partitioning And Mapping Into Fixed Size Distributed Memory Architectures",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812793928_0008",
            "Abstract": "This paper presents a new method for the problem of mapping of nested FOR-loops with uniform dependencies, into mesh-connected parallel architectures. This method is based on loop mapping for systolic arrays. The virtual array of cells is derived from the index space, by applying a linear transformation. This array is divided (cut) into a fixed number of clusters, equal to the number of available real processors. The basic idea of our method is that the cutting is performed along properly selected boundary directions, so as to minimize inter-cluster communication and equilibrate the number of virtual cells for every cluster. Each cluster is then assigned to a different processor, which performs in a roughly independent manner, as the communication requirements are now minimized. This mapping cuts down overall communication delays, while using a fixed number of processors from a (n-1)-dimensional mesh …",
            "Abstract entirety": 0,
            "Author pub id": "UdV8-qIAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        }
    ]
}]