[{
    "name": "Παναγιώτης Μεταξάς",
    "romanize name": "Panagiotis Metaxas",
    "School-Department": " Computer Science",
    "University": "Wellesley College",
    "Rank": "Professor",
    "Apella_id": 419,
    "Scholar name": "Panagiotis \"Takis\" Metaxas",
    "Scholar id": "7tc03WEAAAAJ",
    "Affiliation": "Professor of Computer Science, Wellesley College",
    "Citedby": 3238,
    "Interests": [
        "misinformation",
        "propaganda",
        "google-bombs",
        "electoral predictions"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=7tc03WEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Network Manipulation (with application to political issues)",
            "Publication year": 2011,
            "Publication url": "http://cs.wellesley.edu/~pmetaxas/Network-Manipulation.pdf",
            "Abstract": "We live in an increasingly interconnected world, one in which a growing number of people turn to the web to make important medical, financial and political decisions [1]. As more people use the Web’s search engines daily as their primary source for locating information on many important issues, search engines are in the position to influence what is perceived as relevant information through their mechanism of ranking web pages. However, as studies have shown [2], interested groups and individuals can also make use of web spamming mechanisms to trick search engines in ranking their pages higher than those of their rivals. The battle for controlling the messages in cyberspace is spreading over many ideological, cultural, and political issues where controversial positions vie for the public support. For example, consider issues such as abortion legality and morality, children vaccination risks, creationism vs. evolution, homosexuality, etc.[3]. Nowhere this battle is more obvious than when it comes to issues related to national elections. Obviously, the stakes here are high. If one is able to influence the public elect officials that will be favorable to his/her agenda, this will have far-reaching implications. The term “Web Spam” or Adversarial Web Search [4] is broadly used to describe misinformation planted on the Web. Google-bombs are probably the best known examples of Web spamming, because of their broad coverage in the press [5]. Web spammers are creating misinformation using “text spam” and “link spam”, while using “cloaking” to cover their tracks. This generic categorization of practical actions does not explain why they are successful …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:oQQVFBP0nzwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the predictability of the US elections through search volume activity",
            "Publication year": 2011,
            "Publication url": "https://repository.wellesley.edu/object/ir153",
            "Abstract": "In recent years several researchers have reported that the volume of Google Trends and Twitter chat over time can be used to predict several kinds of social and consumer metrics. From the success of new movies before their release to the marketability of consumer goods to the prediction of voting results in the recent 2009 German elections, Google Trends and Twitter message volume have been treated as indispensable tools for not only recording current social trends, but even for predicting the future. This is surprising, given the significant differences in the demographics of voters and people who use social networks and Web tools. But is there some underline logic behind these predictions or are they simply a matter of luck? With this work we wanted to test their predictive power against the US elections. One could argue that, following the previous research literature, and given the high utilization that the Web and the social networks have in the US, Google Trends and Twitter volume may be able to predict the outcomes of the US Congressional elections. In this paper we report that Google Trends was, actually, not a good predictor of both the 2008 and 2010 elections, and we offer some explanation on why this may be the case. On a forthcoming paper we report on our analysis on Twitter.—Keywords: Social Web, Google Trends, Twitter, US elections, predictions, statistical analysis—Citation: Catherine Lui, Panagiotis T. Metaxas and Eni Mustafaraj (2011).\" On the Predictability of the US Elections through Search Volume Activity,\" Proceedings of the IADIS International Conference on e-Society, Avila, Spain, March, 2011.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information systems for “wicked problems”",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s12599-013-0303-3.pdf",
            "Abstract": "The objective of this commentary is to propose fruitful research directions built upon the reciprocal interplay of social media and collective intelligence. We focus on “wicked problems” – a class of problems that Introne et al. (Künstl. Intell. 27:45–52, 2013) call “problems for which no single computational formulation of the problem is sufficient, for which different stakeholders do not even agree on what the problem really is, and for which there are no right or wrong answers, only answers that are better or worse from different points of view”. We argue that information systems research in particular can aid in designing appropriate systems due to benefits derived from the combined perspectives of both social media and collective intelligence. We document the relevance and timeliness of social media and collective intelligence for business and information systems engineering, pinpoint needed functionality of …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:N8RR74vhTp4C",
            "Publisher": "Springer Fachmedien Wiesbaden"
        },
        {
            "Title": "The use of online videos in the 2008 US congressional elections",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5284044/",
            "Abstract": "In a recent survey, 39% of Americans reported using the Web to access campaign materials for the 2008 primary elections. Assuming they are using popular search engines such as Google, it is important to investigate their search patterns and ensure that standards of fairness and balanced coverage are upheld in the results. In this paper, we offer an exploratory analysis of political online video data. This data was collected in the context of a broader project aimed at studying the effects of politically motivated spamming of webpages to manipulate their rankings within search engine results. Using online video parameters such as the submission date, number of views, ranking position, description keywords, political inclination of the submitter, the political message in the video, and comments associated with the video, we construct a picture of how online video medium was used during the last congressional …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "How students engage with news: Five takeaways for educators, journalists, and librarians",
            "Publication year": 2018,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3503183",
            "Abstract": "The News Study research report presents findings about how a sample of US college students gather information and engage with news in the digital age. Results are included from an online survey of 5,844 respondents and telephone interviews with 37 participants from 11 US colleges and universities selected for their regional, demographic, and red/blue state diversity. A computational analysis was conducted using Twitter data associated with the survey respondents and a Twitter panel of 135,891​ college-age people.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:5Y1KH4bkPm0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Retweets indicate agreement, endorsement, trust: A meta-analysis of published Twitter research",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=10829774879955692264&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:d4paSpBSrDQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using propagation of distrust to find untrustworthy web neighborhoods",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5072570/",
            "Abstract": "Web spamming, the practice of introducing artificial text and links into Web pages to affect the results of searches, has been recognized as a major problem for search engines. But it is mainly a serious problem for Web users because they tend to confuse trusting the search engine with trusting the results of a search. In this paper, we propose \"backwards propagation of distrust,'' as an approach to finding spamming untrustworthy sites. Our approach is inspired by the social behavior associated with distrust. In society, recognition of an untrustworthy entity (person, institution, idea, etc) is a reason for questioning the trustworthiness of those that recommended its entity. People that are found to strongly support untrustworthy entities become untrustworthy themselves. So, in society distrust is propagated backwards. Our algorithm simulates this social behavior on the Web graph with considerable success. Moreover, by …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interview with Jim Hendler on Social Media and Collective Intelligence",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s13218-012-0226-z",
            "Abstract": "Continuing that analogy, collective intelligence is what arises as the online communities grow and become “utile.” This can result in systems like Wikipedia, where a combination of openness and governance, coupled with expertise and interest has produced something exciting. On the other hand, without tools and rules it would digress into a hopeless mess. One of the things I’m excited about is improving the tools both for helping to produce, and also to better understand, collective intelligence in many more systems.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:vnF2_uLGgtgC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Manipulation of search engine results during the 2016 US congressional elections",
            "Publication year": 2017,
            "Publication url": "https://repository.wellesley.edu/object/ir264",
            "Abstract": "Web spammers are individuals who attempt to manipulate the structure of the Web in such a way that a search engine (SE) will give them higher ranking location (and thus, greater visibility) in search results than what they would get without manipulation. Typically, Web spammers aim to promote their own financial, political or religious agendas exploiting the trust that users associate with SE query results. Over the last ten years, search engines have taken steps to defend against spammers with some success. Arguably, Web spamming is crucial during election times, when voters are likely to use search engines to get information about electoral candidates. At times of elections, spammers could succeed in spreading propaganda manipulating SE query results of candidates' names. In a symmetric but, arguably, less likely scenario, SEs might influence elections by manipulating their own results to favor one candidate over another. In fact, some have suggested that SEs (Google in particular) should be proactively regulated to avoid such a possibility. In this paper, we investigate to what degree the SE query results related to searches of electoral candidates names were altered by anyone (Web spammers or SEs) during the 2016 US congressional election, an election that saw the rise of\" fake news\" sites. Our results indicate that different SEs had different degree of success defending against spammers: Google gave preference to reliable sources in the first 6 of the top-10 search results when queried with the name of any electoral candidate. Also, Google did not allow much variation in the ranking of the top-10 results and did not allow\" fake news\" …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:jW3pDOCzWhQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trails of trustworthiness in real-time streams",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=12474953052132207738&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:vlMkzkLhH4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trails of trustworthiness in real-time streams (extended summary)",
            "Publication year": 2012,
            "Publication url": "https://repository.wellesley.edu/object/ir125",
            "Abstract": "There is an indisputable need for reliable online information. This need becomes imperative in real-time information channels (R-TICs) that are omnipresent in the Social Web these days. R-TICs are online systems that provide instant interaction, commenting and notification (eg, Twitter, Facebook, Google+, etc.) While helping us decrease our time and effort to be informed, R-TICs will put new stress to our abilities to act under time pressure in making decisions. Being able to determine the trustworthiness of the information we receive, therefore, will be paramount. How one determines the quality of the information received? Certainly, one needs to be skilled in critical thinking, but technology can also help one act with confidence, by maintaining a network of trusted sources and understanding the reasons why one should trust, or distrust, the information received. The overall aim of our ongoing research is to lay the foundation of a comprehensive approach to support critical thinking and increase security while maintaining privacy in a trusted cyber-world. Building on the work of other researchers, as well as on the success we had in the past with recognizing and uncovering some of the causes of misinformation, we design a system that can maintain trails of trustworthiness for information propagated through real-time information channels. When confronted with information that requires fast action, our system will enable its educated users to evaluate its provenance, its credibility and the independence of the multiple sources that may provide this information.—Keywords: Social Web; Information Reliability; Social Networks, Trustworthiness …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:tz746QTLzJkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Journalism, Misinformation and Fact Checking Chairs' Welcome & Organization",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3184558.3192300",
            "Abstract": "It is our pleasure to welcome you to the WWW 2018 Journalism, Misinformation and Fact Checking Alternate Track. Although the problem of misinformation and deceptive information is as old as Web itself, the topic has gained a lot of attention recently. Phenomena, such as misinformation propagation, fabricated news reports (also known as\" fake news\",) computational propaganda, astroturf, and ideological polarization have become more common on the Web and the social Web, calling for a cross-cutting approach to better understand the topic. One approach that has gained some traction is that of the establishment of fact-checking organizations.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:SSGWEqmz6gUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New quality metrics for web search results",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-01344-7_21",
            "Abstract": "Web search results enjoy an increasing importance in our daily lives. But what can be said about their quality, especially when querying a controversial issue? The traditional information retrieval metrics of precision and recall do not provide much insight in the case of web information retrieval. In this paper we examine new ways of evaluating quality in search results: coverage and independence. We give examples on how these new metrics can be calculated and what their values reveal regarding the two major search engines, Google and Yahoo. We have found evidence of low coverage for commercial and medical controversial queries, and high coverage for a political query that is highly contested. Given the fact that search engines are unwilling to tune their search results manually, except in a few cases that have become the source of bad publicity, low coverage and independence reveal the efforts of …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Parallel digital halftoning by error-diffusion",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/778348.778355",
            "Abstract": "Digital halftoning, or dithering, is the technique commonly used to render a color or grayscale image on a printer, a computer monitor or other bi-level displays. A particular halftoning technique that has been used extensively in the past is the so-called error diffusion technique. For a number of years it was believed that this technique is inherently sequential and could not be parallelized. In this paper we present and analyze a simple, yet optimal, error-diffusion parallel algorithm for digital halftoning and we discuss an implementation on a parallel machine. In particular, we describe implementations on data-parallel computers that contain linear arrays and two-dimensional meshes of processing elements. Our algorithm runs in 2• n+m parallel steps, a considerable improvement over the 10• m• n sequential algorithm. We expect that this research will lead to the development of faster printers and larger high-resolution …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "CRA-E panel on undergraduate research",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2685553.2699340",
            "Abstract": "This panel seeks to help faculty and other research mentors engage undergraduates in their research. The panel addresses the benefits of working with undergraduates, funding opportunities, best practices in supervising undergraduate research, and finding additional resources.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:zCpYd49hD24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "System and method for parallel error diffusion dithering",
            "Publication year": 2001,
            "Publication url": "https://patents.google.com/patent/US6307978B1/en",
            "Abstract": "A system is disclosed for error diffusion dithering. The system includes an input for receiving an input matrix representative of image data, and a plurality of processors. The plurality of processors processes the input matrix and provides output data. Each of the processors is in communication with at least a portion of the input matrix. At least one processor processes a portion of the input matrix defined at least in part by a substantially diagonal edge within the image matrix.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sifting the sand on the river bank: Social media as a source for research data",
            "Publication year": 2014,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/itit-2014-1047/html",
            "Abstract": "Computational social science has been described as a new field at the intersection of computer science and social sciences, aiming to study the ways that society evolves, interacts, and reacts. Like prospectors sifting the sand in a river bed for gold, computational social science researchers are looking into the streams of social media for insight on our social interactions.  Enabled by the availability of and easy accessibility to vast amounts of data generated by social entities, as well as by powerful computing hardware and algorithms, its researchers conduct observations of social interaction and experiments testing social theories in scales not realizable before. In this paper, after a short review of the characteristics of this new area, we discuss issues related to the types of data sought and used, and some of the challenges in collecting and interpreting the data. Throughout the paper we also examine some of the …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:DxlTmyU89zoC",
            "Publisher": "De Gruyter Oldenbourg"
        },
        {
            "Title": "What do retweets indicate? Results from user survey and meta-review of research",
            "Publication year": 2015,
            "Publication url": "https://ojs.aaai.org/index.php/ICWSM/article/view/14661",
            "Abstract": "Arguably one of the most important features of Twitter is the support for “retweets” or messages re-posted verbatim by a user that were originated by someone else. Despite the fact that retweets are routinely studied and reported, many important questions remain about user motivation for their use and their significance. In this paper we answer the question of what users indicate when they retweet. We do so in a comprehensive fashion, by employing a user survey, a study of user profiles, and a meta-review of over 100 research publications from three related major conferences. Our findings indicate that retweeting indicates not only interest in a message, but also trust in the message and the originator, and agreement with the message contents. However, the findings are significantly weaker for journalists, some of whom beg to differ declaring so in their own user profiles. On the other hand, the inclusion of hashtags strengthens the signal of agreement, especially when the hashtags are related to politics. While in the past there have been additional claims in the literature about possible reasons for retweeting, many of them are not supported, especially given the technical changes introduced recently by Twitter.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:WzbvD7BMtBoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special issue on social media",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s13218-012-0223-2.pdf",
            "Abstract": "This special issue includes papers that show, first, how to make sense of Social Media data, ie how to condense, distill, or integrate highly decentralized and dispersed data resulting from human communication, and second, how Social Media contributes to innovation, collaboration, and Collective Intelligence.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:J3LtWjKFLicC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "How (not) to predict elections",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6113109/",
            "Abstract": "Using social media for political discourse is increasingly becoming common practice, especially around election time. Arguably, one of the most interesting aspects of this trend is the possibility of ''pulsing'' the public's opinion in near real-time and, thus, it has attracted the interest of many researchers as well as news organizations. Recently, it has been reported that predicting electoral outcomes from social media data is feasible, in fact it is quite simple to compute. Positive results have been reported in a few occasions, but without an analysis on what principle enables them. This, however, should be surprising given the significant differences in the demographics between likely voters and users of online social networks. This work aims to test the predictive power of social media metrics against several Senate races of the two recent US Congressional elections. We review the findings of other researchers and we try …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Web spam, propaganda and trust",
            "Publication year": 2005,
            "Publication url": "https://repository.wellesley.edu/object/ir303",
            "Abstract": "Web spamming, the practice of introducing artificial text and links into web pages to affect the results of searches, has been recognized as a major problem for search engines. It is also a serious problem for users because they are not aware of it and they tend to confuse trusting the search engine with trusting the results of a search (16). The parallels between web spamming on the internet and propaganda in the real world suggest that we can use anti-propaganda techniques to educate users and develop tools to help them evaluate the reliability of the information they find online. In this paper, we first analyze the effects that web spam has on the evolution of the search engines and their relationship to propagandistic techniques in society. Then, we examine the neighborhoods of untrustworthy sites, finding that a dense biconnected component (BCCs) containing the site provide a reasonable trust neighborhood that has parallels in social network theory. The fact that spammers employ propagandistic techniques enables us to design a heuristic that follows anti-propagandistic practices in order to recognize a spamming network. In society, recognition of an untrustworthy message (in the opinion of a particular person or other social entity) is a reason for questioning the entities that recommend the message. Entities that are found to strongly support more untrustworthy messages become untrustworthy themselves. So, social distrust is propagated backwards for a number of steps. Our heuristic simulates this behavior on the trust neighborhood of a spammer. In our experiments, we examined trust neighborhoods of web sites, both trustworthy and not …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:RSvx26AYfG8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "19 Technology, Propaganda, and the Limits of the Human Intellect",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=8WPMDwAAQBAJ&oi=fnd&pg=PA245&dq=info:kZS-9UP3zEkJ:scholar.google.com&ots=SUvWyCiMXj&sig=7OwPl5_AlybYljskRMtcVaphvVY",
            "Abstract": "“Fake news,” or online falsehoods that are formatted and circulated such that a reader might mistake them for legitimate news articles, 1 is a relatively recent phenomenon born out of the financial attractiveness of “clickbait”—capturing users’ attention online to generate revenue through advertisements. It has expanded into new forms of propaganda, bullshit (as defined by Harry Frankfurt), 2 and financial scams, all of which have existed since the creation of early human communities. Since ancient times, people have been exposed to lies, misinformation, and falsehoods. Believing lies can come at grave personal and social costs. In some extreme cases, communities, religions, and cultures were destroyed due to misplaced belief in falsehoods. Even the end of the first democracy came when the Athenian citizens, led by the charismatic populist leader Alcibiades, believed reports that their Syracusan enemies were cowards and Sicilian city-states would support them as allies, and entered in a disastrous war they could not win. 3 Today, we are exposed to “fake news,” a newer phenomenon in the everwidening genre of deception. We faced and overcame challenges throughout our history, but I argue that this time is different. The volume of (mis) information reaching us comes at speeds and levels that we, as a species, have not evolved to handle. Technology, ethical policies, laws, regulations, and trusted authorities, including fact-checkers, can help, but we will not solve the problem without the active engagement of educated citizens. Epistemological education, the recognition of our own biases, and the protection of our channels of communication …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:f4T9rk490XkC",
            "Publisher": "MIT Press"
        },
        {
            "Title": "On the Unpredictability of Elections using Social Media Data",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Metaxas/publication/290918448_On_the_predictability_of_elections_using_social_media_data/links/5d5fe4f1458515d6101e1940/On-the-predictability-of-elections-using-social-media-data.pdf",
            "Abstract": "Predictions using data from social networks and Web searches have attracted a lot of attention lately. By following what people are blogging about or what they are searching about can give us some intuition on the collective psyche and lead us to understand what is currently happening in society before it has actually happened. Sometimes people refer to this phenomenon as the “wisdom of the crowd”, that is, taking into account the opinions of the society as a whole, instead of the opinions of the expert.Facebook and Twitter are services where users can share personal opinions, and the APIs provided by these companies make it relatively easy to extract and process them. Google search volume trends, also accessible by APIs, can give an indication on what people are currently searching for, thus providing some insight into their current needs and worries. Theoretically, these data, if used correctly, can lead to predictions of currently occurring events influenced by human behavior. In fact, Choi & Varian (2009) have coined the term “predicting the present” to describe this phenomenon, while Asur & Huberman (2010) simply refer to it as “predicting the future”.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:2Iopv88g0QUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "'It's Trending on Twitter'-An Analysis of the Twitter Manipulations in the Massachusetts 2010 Special Senate Election",
            "Publication year": 2012,
            "Publication url": "https://papers.ssrn.com/sol3/Delivery.cfm?abstractid=2108272",
            "Abstract": "The 2010 Massachusetts Special Senate Election--a precursor to the current high stakes congressional campaigns--was characterized by millions of dollars in outside funding, an advertising blitz, out-of-state volunteers, Tea Party mobilization, volatile polling, and a broad social media campaign, including Facebook, Twitter, and YouTube. Poll results were triumphantly tweeted, blogged, and covered in news reports among homophilous groups. In addition, users attempted to influence trends, real time search and news coverage by enlisting other users to increase volume on Facebook and Twitter for favored candidates. In addition the conservative Patriot Action Network threatened liberal news coverage and liberal journalists with a Twitter spam and the America Future Fund sent a\" Twitterbomb\" framed as replies to users interested in the Senate race. Given these efforts, Our results show that reporters must be cautious in interpreting Twitter and other manipulable, motivated and opinionated media trends as a guide to public opinion.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:TesyEGJKHF4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Social media and collective intelligence—ongoing and future research streams",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007%252Fs13218-012-0228-x",
            "Abstract": "The tremendous growth in the use of Social Media has led to radical paradigm shifts in the ways we communicate, collaborate, consume, and create information. Our focus in this special issue is on the reciprocal interplay of Social Media and Collective Intelligence. We therefore discuss constituting attributes of Social Media and Collective Intelligence, and we structure the rapidly growing body of literature including adjacent research streams such as social network analysis, Web Science, and computational social science. We conclude by making propositions for future research where in particular the disciplines of artificial intelligence, computer science, and information systems can substantially contribute to the interdisciplinary academic discourse.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:aDl3D7KC1E4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "From obscurity to prominence in minutes: Political speech and real-time search",
            "Publication year": 2010,
            "Publication url": "https://repository.wellesley.edu/object/ir122",
            "Abstract": "Recently, all major search engines introduced a new feature: real-time search results, embedded in the first page of organic search results. The content appearing in these results is pulled by Twitter, blogs, and news websites within minutes of its generation. In this paper, we argue that in the context of political speech, this feature provides disproportionate exposure to personal opinions, fabricated content, unverified events, lies and misrepresentations that would otherwise not find their way in the first page, giving them the opportunity to spread virally. We provide evidence from the recent Massachusetts senate race between Martha Coakley and Scott Brown, analyzing attacks launched inside Twitter.—Keywords: Social Web, Real-Time Web, US elections, Twitter, Twitter-bomb, Google—Citation: Mustafaraj, Eni and Metaxas, Panagiotis (2010).\" From Obscurity to Prominence in Minutes: Political Speech and Real-Time Search.\" In: Proceedings of the WebSci10: Extending the Frontiers of Society On-Line, April 26-27th, 2010, Raleigh, NC: US.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TRAILS: A system for monitoring the propagation of rumors on twitter",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=16838323943912079628&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:Oc-rVwKPngoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Limits of electoral predictions using Social Media",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/49946167/ICWSM11-limits_predict_elections.pdf",
            "Abstract": "Using social media for political discourse is increasingly becoming common practice, especially around election time. Arguably, one of the most interesting aspects of this trend is the possibility of “pulsing” the public opinion in near real-time and, thus, it has attracted the interest of many researchers as well as news organizations. Recently, it has been reported that predicting electoral outcomes from social media data can be feasible and even simple to compute. Positive results have been reported in a few occasions, but without analysis on what principle enables them. This, however, should be surprising given the significant differences in the demographics of likely voters and users of online social networks.This work aims to test the predictive power of social media metrics against several Senate races of the recent US Congressional elections. Our conclusion is that such prediction are not better than chance, shedding some light on the limits of predictability of elections by means of social networks data. Further, we offer detailed explanation on why the community should be skeptical on reports of predictability of election results through raw data from social media.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The battle for the 2008 US Congressional Elections on the Web",
            "Publication year": 2009,
            "Publication url": "https://repository.wellesley.edu/object/ir314",
            "Abstract": "It has been reported that, in the past, political activists have tried to influence web search results. They did that using link-bombing techniques to raise negative web pages with contents close to the their agendas to the top-10 search results. Google has admitted that this happen in the 2006 US Elections, but did it still happen in the all-important 2008 US Congressional Elections? In this paper we try to evaluate whether\" gaming\" the search engines during the election period is a widespread problem, how serious is it, and how search engines have tried to maintain the integrity of their search results.—Keywords: Search Engines, Web Science, Web search, Web Spam, Social Networks",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing information reliability through backwards propagation of distrust",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.157.1968&rep=rep1&type=pdf#page=109",
            "Abstract": "Search Engines have greatly influenced the way we experience the web. Since the early days of the web people have been relying on search engines to find useful information. However, their ability to provide useful and unbiased information can be manipulated by Web spammers. Web spamming, the practice of introducing artificial text and links into web pages to affect the results of searches, has been recognized as a major problem for search engines. But it is mainly a serious problem for web users because they tend to confuse trusting the search engine with trusting the results of a search.In this paper, first we discuss the relationship between Web spam in cyber world and social propaganda in the real world. Then, we propose “backwards propagation of distrust,” as an approach to finding spamming untrustworthy sites. Our approach is inspired by the social behavior associated with distrust. In society, recognition of an untrustworthy entity (person, institution, idea, etc) is a reason for questioning the trustworthiness of those that recommended this entity. People that are found to strongly support untrustworthy entities become untrustworthy themselves. In other words, in the society, distrust is propagated backwards. Our algorithm simulates this social behavior on the web graph with considerable success. Moreover, by respecting the user’s perception of trust through the web graph, our algorithm makes it possible to resolve the moral question of who should be making the decision of weeding out untrustworthy spammers in favor of the user, not the search engine or some higher authority. Our approach can lead to browser-level, or personalized …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A 2007 Model Curriculum for a Liberal Arts Degree in Computer Science",
            "Publication year": 2007,
            "Publication url": "https://repository.wellesley.edu/object/ir116",
            "Abstract": "In 1986, guidelines for a computer science major degree program offered in the context of the liberal arts were developed by the Liberal Arts Computer Science Consortium (LACS)[4]. In 1996 the same group offered a revised curriculum reflecting advances in the discipline, the accompanying technology, and teaching pedagogy [6]. In each case, the LACS models represented, at least in part, a response to the recommendations of the ACM/IEEE-CS [1][2]. Continuing change in the discipline, technology, and pedagogy coupled with the appearance of Computing Curriculum 2001 [3] have led to the 2007 Model Curriculum described here. This report begins by considering just what computer science is and what goals are appropriate for the study of computer science in the landscape of the liberal arts. A curricular model for this setting follows, updating the 1996 revision. As in previous LACS curricula,[4] and [6], the model is practical; that is, students can schedule it, it can be taught with a relatively small size faculty, and it contributes to the foundation of an excellent liberal arts education. Finally, this 2007 Model Curriculum is compared with the recommendations of CC2001 [3].—Citation: A 2007 Model Curriculum for a Liberal Arts Degree in Computer Science. with members of the Liberal Arts Computer Science Consortium (LACS). In the Journal on Educational Resources in Computing (JERIC) 7 (2): 1-34.(2007)",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:yTLRzDEmwhEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessing Instructional Technology-A Research Initiative at Wellesley College",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.8.1626",
            "Abstract": "In a relatively short period of time, educational technology has become a basic component of the instructional life of almost every College or University around the world. The ways in which it affects the teaching and learning, however, have not been assessed satisfactorily yet. Throughout the 1998-1999 academic year, the Wellesley Technology Assessment Committee (or WTAC) met to develop an agenda for research on the instructional use of technology at Wellesley College. The work of the committee during that first project told us that we wanted to know more, and to know differently, about how technology was affecting the nature of teaching and learning in our classrooms. We wanted to examine what was happening in human domains affected by the machine: inside human minds engaged in teaching and learning; in human social interaction; and in disciplinary knowledge, wherever and however such knowledge might be encoded. This paper describes in some detail Phase I of a multi-year project. We believe that both the process we developed and the findings of the preliminary phase will be of interest to those responsible for implementing technology plans on their campuses, and urge other educational institutions to see our process as a model.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Social media and the elections",
            "Publication year": 2012,
            "Publication url": "https://science.sciencemag.org/content/338/6106/472.summary",
            "Abstract": "Manipulation of social media affects perceptions of candidates and compromises decision-making.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:PlWzFYVEG4EC",
            "Publisher": "American Association for the Advancement of Science"
        },
        {
            "Title": "Investigating rumor propagation with TwitterTrails",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1411.3550",
            "Abstract": "Social media have become part of modern news reporting, used by journalists to spread information and find sources, or as a news source by individuals. The quest for prominence and recognition on social media sites like Twitter can sometimes eclipse accuracy and lead to the spread of false information. As a way to study and react to this trend, we introduce {\\sc TwitterTrails}, an interactive, web-based tool ({\\tt twittertrails.com}) that allows users to investigate the origin and propagation characteristics of a rumor and its refutation, if any, on Twitter. Visualizations of burst activity, propagation timeline, retweet and co-retweeted networks help its users trace the spread of a story. Within minutes {\\sc TwitterTrails} will collect relevant tweets and automatically answer several important questions regarding a rumor: its originator, burst characteristics, propagators and main actors according to the audience. In addition, it will compute and report the rumor's level of visibility and, as an example of the power of crowdsourcing, the audience's skepticism towards it which correlates with the rumor's credibility. We envision {\\sc TwitterTrails} as valuable tool for individual use, but we especially for amateur and professional journalists investigating recent and breaking stories. Further, its expanding collection of investigated rumors can be used to answer questions regarding the amount and success of misinformation on Twitter.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:45AZ0Vt6gvEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Classroom Activity for Critical Analysis of News Propagation Online",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3170427.3174355",
            "Abstract": "We present an educational activity for college students to think critically about the truthfulness of news propagated in social media. This activity utilizes TwitterTrails, a visual tool to analyze Twitter claims, events, and memes. This tool provides views such as a propagation graph of a story's bursting activity, and the co-ReTweeted network of the more prominent members of the audience. Using a response and reflection form, students are guided through these different facets of a story. The classroom activity was iteratively designed over the course of three semesters. Here, we present the learning outcomes from our final semester's evaluation with 43 students. Our findings demonstrate that the activity provided students with both the conceptual tools and motivation to investigate the reliability of stories in social media. Our contribution also includes access to the tool and materials to conduct this activity. We hope that …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:2PyGcyYA7d0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spread and skepticism: Metrics of propagation on Twitter",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2786451.2786512",
            "Abstract": "Social media has become part of modern news reporting, used by journalists to spread information and find sources, or as a news source by individuals. The quest for prominence and recognition on sites like Twitter can sometimes eclipse accuracy and lead to the spread of false information. Could we use the so-called\" wisdom of crowds\" to predict the likelihood that a claim may be true or false? This paper, part of ongoing research, offers evidence that most false claims do not spread like true ones, and that the reaction of the audience to a claim on Twitter is correlated with its validity.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:yKcmA0jEsUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Of course it’s true",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=4579103489014331278&hl=en&oi=scholarr",
            "Abstract": "ResultsThe six survey questions were used to determine students' ability to evaluate information, as well as their inclination to verify their responses. Four questions tested particular areas of misinformation: advertising claims, government misinformation, lobby group propaganda, and scams. Preliminary research indicated these areas could present a significant challenge to students. Two additional questions were used to determine if",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:Fr8DH2VBP9sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Predicting information credibility in time-sensitive social media",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:AeQkyvggb0MC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Blood versus crystalloid cardioplegia in pediatric cardiac surgery: a systematic review and meta-analysis",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s00246-017-1732-4",
            "Abstract": "The benefit of blood cardioplegia (BCP) compared to crystalloid cardioplegia (CCP) is still debatable. Our aim was to systematically review and synthesize all available evidence on the use of BCP and CCP to assess if any modality provides superior outcomes in pediatric cardiac surgery. A systematic literature search of the PubMed and Cochrane databases was performed with respect to the PRISMA statement (end-of-search date: January 30th, 2017). We extracted data on study design, demographics, cardioplegia regimens, and perioperative outcomes as well as relevant biochemical markers, namely cardiac troponin I (cTnI), lactate, and ATP levels at baseline, after reperfusion and postoperatively at 1, 4, 12, and 24 h as applicable. Data were appropriately pooled using random and mixed effects models. Our systematic review includes 56 studies reporting on a total of 7711 pediatric patients. A meta …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:vs4DU1qUSb8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "From Personal Genomics to Twitter: Visualizing the Uncertainty of Evidence",
            "Publication year": 2017,
            "Publication url": "https://repository.wellesley.edu/object/ir261",
            "Abstract": "Personal genomics offers a complex form of uncertainty in which a person's data are largely stable, but the interpretation and implications continue to evolve with the emergence of new research. Another domain, in which there is uncertainty about the supporting evidence and truthfulness of a claim, is social networks. We propose that a similar method can be used to communicate uncertainty in these contexts, and present a tool for visualizing social network claims that builds upon research in both contexts.—Keywords: Uncertainty, personal genomics, personal informatics—Citation: Lauren Westendorf, Christina Pollalis, Clarissa Verish, Orit Shaer, Panagiotis Takis Metaxas, Samantha Finn, Madeleine Ball, Oded Nov.\" From Personal Genomics to Twitter: Visualizing the Uncertainty of Evidence\". Proceedings of the Designing for Uncertainty in HCI: When Does Uncertainty Help? Workshop on CHI, 2017.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:EXDW3tg14iEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Vocal minority versus silent majority: Discovering the opionions of the long tail",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6113101/",
            "Abstract": "Social networks such as Face book and Twitter have become the favorite places on the Web where people discuss real-time events. In fact, search engines such as Google and Bing have special agreements, which allow them to include into their search results public conversations happening in real-time in these social networks. However, for anyone who only reads these conversations occasionally, it is difficult to evaluate the (often) complex context in which these conversation bits are embedded. Who are the people carrying on the conversation? Are they random participants or people with a specific agenda? Making sense of real-time social streams often requires much more information than what is visible in the messages themselves. In this paper, we study this phenomenon in the context of one political event: a special election for the US Senate which took place in Massachusetts in January 2010, as …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "How Students Engage with News: Five Takeaways for Educators, Journalists, and Librarians. Executive Summary",
            "Publication year": 2018,
            "Publication url": "https://repository.wellesley.edu/object/ir960",
            "Abstract": "—Citation: Alison J. Head, John Wihbey, P. Takis Metaxas, Margy MacMillan, and Dan Cohen,\" How Students Engage with News: Five Takeaways for Educators, Journalists, and Librarians,\" Project Information Literacy Research Institute.(October 16, 2018).",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:gUOu-QWEMMQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Also your job to learn! helping students to reflect on their learning progress",
            "Publication year": 2012,
            "Publication url": "https://repository.wellesley.edu/object/ir127",
            "Abstract": "Most of the time, the pedagogical analysis on student learning is focused on the efforts of the teacher. There is no doubt that teacher actions can have a profound positive e ffect on student learning. In this paper, we discuss what students can do to increase their learning outcome. In particular, we describe an instrument that facilitates students' reflection of their own learning. Although the use of reflection on learning is not novel, its use in CS education has not been explored extensively. Our system was developed as a result of an experiment that we performed in a CS2 course, successfully giving students opportunities to take control of their own learning process. One of the attractive features of our system is that it is relatively easy for the instructor to set up and monitor the students' progress. In our evaluation of the system, we found that it can increase significantly the students' programming confidence at the end of the course. Even though this paper studies the eff effectiveness of introducing the\" reflection questionnaires\" instrument in a CS2-type course, it can be applied to most other courses in a curriculum. We provide the material we used in our experiment so that they can be adopted by educators.—Keywords: Learning Methods, Reflection, Student learning, CS-2 course—Citation: Stella Kakavouli and Panagiotis Takis Metaxas (2012).\" Also Your Job to Learn! Helping Students to Reflect on their Learning Progress,\" Journal of Computing Sciences in Colleges, Vol. 27 no. 6.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:In6cVmBjs0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hiding in plain sight: A tale of trust and mistrust inside a community of citizen reporters",
            "Publication year": 2012,
            "Publication url": "https://www.aaai.org/ocs/index.php/ICWSM/ICWSM12/paper/viewPaper/4677",
            "Abstract": "The large volume of user-generated content on the Social Web puts a high burden on the participants to evaluate the accuracy and quality of such content. Researchers have been trying to address this problem by focusing on discovering in-fluential entities inside social platforms to guide their ranking algorithms. Often these entities correspond to people or orga-nizations already influential in the real-world. However, not everywhere in the world is there a right to and protection of free speech. In countries where the traditional media cannot report the truth, anonymity becomes a necessity for citizens who want to exercise their right of free-speech in the service of their community. But is it possible for anonymous individuals to become influ-ential and gain the trust of a community? In this paper, we discuss the case of a community of Twitter citizen reporters, located in a Mexican city plagued by the drug cartels fighting for control of territory. Our analysis shows that the most in-fluential individuals inside the community were anonymous accounts. Neither the Mexican authorities, nor the drug car-tels were happy about the real-time citizen reporting of crime or anti-crime operations in an open social network such as Twitter, and we discovered external pressures to this com-munity and its influential players to change their reporting behavior.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:yeL6HyUMUGUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Calculating web page trustworthiness by exploring communities on the web",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1060081.1060140",
            "Abstract": "With the growth of the Internet and the ease with which websites can be created, a lot of web pages of questionable quality and authority have appeared and it has become a significant problem to search the web for trustworthy information [3]. In addition, more and more Internet users rely on and trust information they receive from the Internet than from any other source [2]. Most people, when doing a web search, only look at the first page of results returned by the search engine. As a result, for a lot of commercial sites it is important to appear as one of the first search results, and pages containing advertisement, propaganda material, or \"informercials\" try to rank higher. Our goal is to prevent such pages, called spam, from qualifying high in the results returned by web search engines.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:FnaCo-ypupUC",
            "Publisher": "Consortium for Computing Sciences in Colleges"
        },
        {
            "Title": "Hiding in Plain Sight: A Tale of Trust and Mistrust Inside a Community of Citizen Reporters",
            "Publication year": 2012,
            "Publication url": "https://www.academia.edu/download/38293749/mustafaraj_icwsm2012.pdf",
            "Abstract": "The large volume of user-generated content on the Social Web puts a high burden on the participants to evaluate the accuracy and quality of such content. Researchers have been trying to address this problem by focusing on discovering influential entities inside social platforms to guide their ranking algorithms. Often these entities correspond to people or organizations already influential in the real-world. However, not everywhere in the world is there a right to and protection of free speech. In countries where the traditional media cannot report the truth, anonymity becomes a necessity for citizens who want to exercise their right of free-speech in the service of their community.But is it possible for anonymous individuals to become influential and gain the trust of a community? In this paper, we discuss the case of a community of Twitter citizen reporters, located in a Mexican city plagued by the drug cartels fighting for control of territory. Our analysis shows that the most influential individuals inside the community were anonymous accounts. Neither the Mexican authorities, nor the drug cartels were happy about the real-time citizen reporting of crime or anti-crime operations in an open social network such as Twitter, and we discovered external pressures to this community and its influential players to change their reporting behavior.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:wW8w_uPXRNAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating the infamous# Pizzagate conspiracy theory",
            "Publication year": 2019,
            "Publication url": "https://techscience.org/a/2019121802/",
            "Abstract": "In the 2016 US Presidential elections, we saw the rise of the so-called “fake news” phenomenon–a term used to describe lies, formatted as news articles, aiming to confuse and/or anger the public. One of the better-known instances of “fake news” is the infamous “Pizzagate” conspiracy theory that received significant attention in the media. In this paper we use the TwitterTrails tool to investigate it. TwitterTrails (twittertrails. com) is an interactive, Web-based investigative tool that allows its users to examine on Twitter the origin and propagation characteristics of a rumor and its refutation. We designed TwitterTrails as a tool for journalists (amateur and professional) investigating recent and breaking stories. However, with little training, it can be used by anyone who wants to find answers to some basic facts about the spreading of rumors online.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:qzuIxkxWBNsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "What edited retweets reveal about online political discourse",
            "Publication year": 2011,
            "Publication url": "https://www.aaai.org/ocs/index.php/WS/AAAIW11/paper/viewPaper/3980",
            "Abstract": "How widespread is the phenomenon of commenting or editing a tweet in the practice of retweeting by members of political communities in Twitter? What is the nature of comments (agree/disagree), or of edits (change audience, change meaning, curate content). Being able to answer these questions will provide knowledge that will help answering other questions such as: what are the topics, events, people that attract more discussion (in forms of commenting) or controversy (agree/disagree)? Who are the users who engage in the processing of curating content by inserting hashtags or adding links? Which political community shows more enthusiasm for an issue and how broad is the base of engaged users? How can detection of agreement/disagreement in conversations inform sentiment analysis-the technique used to make predictions (who will win an election) or support insightful analytics (which policy issue resonates more with constituents). We argue that is necessary to go beyond the much-adopted aggregate text analysis of the volume of tweets, in order to discover and understand phenomena at the level of single tweets. This becomes important in the light of the increase in the number of human-mimicking bots in Twitter. Genuine interaction and engagement can be better measured by analyzing tweets that display signs of human intervention. Editing the text of an original tweet before it is retweeted, could reveal mindful user engagement with the content, and therefore, would allow us to perform sampling among real human users. This paper presents work in progress that deals with the challenges of discovering retweets that contain …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The rise and the fall of a citizen reporter",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2464464.2464520",
            "Abstract": "Recently, there has been some research interest in the development of online communities sharing news and information curated by\" citizen reporters\". Using\" Big Data\" techniques researchers try to discover influence groups and some of the major events in the lives of such communities. However, the big picture may sometimes miss important stories that are essential to the development and evolution of online communities. In particular, how does one identify and verify events when the important actors are operating anonymously and without sufficient news coverage due to safety concerns, as in drug war-torn Mexico? In this paper we present some techniques that allow us to make sense of the data collected, identify important dates of significant events in them, and direct our limited resources to discover hidden stories that, in our case, affect the lives and safety of prominent citizen reporters. In particular, we …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:xyvS_IvSCKsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Informationssysteme für „Wicked Problems “: Forschung an der Schnittstelle von Social Media und Collective Intelligence",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=11399381518118987351&hl=en&oi=scholarr",
            "Abstract": "The objective of this commentary is to propose fruitful research directions built upon the reciprocal interplay of social media and collective intelligence. We focus on „wicked problems “–a class of problems that Introne et al.(Künstl. Intell. 27: 45–52, 2013) call „problems for which no single computational formulation of the problem is sufficient, for which different stakeholders do not even agree on what the problem really is, and for which there are no right or wrong answers, only answers that are better or worse from different points of view “. We argue that information systems research in particular can aid in designing appropriate systems due to benefits derived from the combined perspectives of both social media and collective intelligence. We document the relevance and timeliness of social media and collective intelligence for business and information systems engineering, pinpoint needed functionality of information systems for wicked problems, describe related research challenges, highlight prospective suitable methods to tackle those challenges, and review examples of initial results.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:IT5EXw6i2GUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Web Spam, Social Propaganda and the Evolution of Search Engine Rankings",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12436-5_13",
            "Abstract": "Search Engines have greatly influenced the way we experience the web. Since the early days of the web, users have been relying on them to get informed and make decisions. When the web was relatively small, web directories were built and maintained using human experts to screen and categorize pages according to their characteristics. By the mid 1990’s, however, it was apparent that the human expert model of categorizing web pages does not scale. The first search engines appeared and they have been evolving ever since, taking over the role that web directories used to play.But what need makes a search engine evolve? Beyond the financial objectives, there is a need for quality in search results. Search engines know that the quality of their ranking will determine how successful they are. Search results, however, are not simply based on well-designed scientific principles, but they are …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Sponsored search for political campaigning during the 2008 us elections",
            "Publication year": 2009,
            "Publication url": "http://cs.wellesley.edu/~pmetaxas/IRA-SIGIR09-final.pdf",
            "Abstract": "We have collected a set of 1131 textual ads that appeared in the Google Search results when searching for a candidate name running in the 2008 US Congressional elections. We have categorized the advertisers in four different categories: commercial, partisan, non-affiliated, and media. By analyzing the content of the collected ads, we discovered that the majority of them (63%) are commercial ads that have no political message, while the partisan group contributed only 14% of the ads. Furthermore, only 21 out of 124 monitored candidates were actively participating in sponsored search, by providing their own political message. We describe the different ways in which the advertisements were used and several problems that damage the quality of sponsored search, providing some suggestions to avoid such issues in the future.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The co-retweeted network and its applications for measuring the perceived political polarization",
            "Publication year": 2014,
            "Publication url": "https://repository.wellesley.edu/object/ir152",
            "Abstract": "This paper introduces a novel network, the co-retweeted network, that is constructed as the undirected weighted graph that connects highly visible accounts who have been retweeted by members of the audience during some real-time event. Like bibliographics co-citation used to indicate that two papers treat a related subject matter, co-retweeting is used to indicate that two accounts present similar opinions in an online discussion. Thus, the co-retweeted network can be seen as a form of consulting the opinion of the crowd that is following the discussion about the similarity (or difference) of positions expressed by the highly visible accounts. When applied on political conversations related to some event, the co-retweeted network enables the measurement of the polarity of political orientation of major players (including news organizations) based on the views of the audience. It can also measure the degree of polarization of the event itself.—Keywords: Social Media Analytics, Social Networks, Twitter, Big Data, Social and Legal Issues, Human Computation—Citation: Samantha Finn, Eni Mustafaraj and Panagiotis T. Metaxas (2014).\" The Co-Retweeted Network and its Applications for Measuring the Perceived Political Polarization,\" International Conference on Web Information Systems and Technologies (WEBIST 2014) 10.5220",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:GfAJFcoWUJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interview with Bernado A. Huberman on Social Media and Collective Intelligence",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s13218-012-0229-9",
            "Abstract": "Dr. Bernardo Huberman (Ph. D. UPenn in Physics) is a Senior HP Fellow and Director of the Social Computing Lab at Hewlett-Packard Laboratories. Dr. Huberman’s research contributions are along a great variety of disciplines, from Physics to Computer Science. Focusing on the dynamics of the Web’s growth and use, he helped uncover the nature of electronic markets, as well as the design of novel mechanisms for enhancing privacy and trust in e-commerce and negotiations. Currently, his work centers on social computing and the design of novel mechanisms for discovering and aggregating information in distributed systems. He holds a number of patents on self-repairing parallel computers, a parallel motion detector, distributed controls for smart matter, market mechanisms for electronic auctions of services and data and fast community detection algorithms. He is a Fellow of several scientific societies, including …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:TGkaJS32XoUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Assessing Instructional Technology",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35502-3_16",
            "Abstract": "In a relatively short time, educational technology has become a basic component of instructional life at almost every college or university around the world. Its effects on teaching and learning, however, have not yet been assessed satisfactorily. Throughout the 1998–1999 academic year, the Wellesley Technology Assessment Committee (or WTAC) researched the instructional use of technology at Wellesley College. The committee’s work told us that we wanted to know more, and to know differently, about how technology was affecting the nature of teaching and learning in our classrooms. We wanted to examine what was happening in human domains affected by the machine: inside human minds engaged in teaching and learning; in human social interaction; and in disciplinary knowledge, wherever and however such knowledge might be encoded. This paper details Phase I of a multi-year project. We …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:mB3voiENLucC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Medicinal properties of Mediterranean plants against glucose and lipid disorders",
            "Publication year": 2016,
            "Publication url": "https://www.plantsjournal.com/archives/2016/vol4issue3/PartB/4-2-25.pdf",
            "Abstract": "There are several components isolated from plants grown in Mediterranean environment exhibiting significant beneficial properties against a variety of disorders related to lipid or glucose metabolism. In this context, plant species (eg Salvia officinalis, Rosmarinus officinalis, Lavandula stoechas, Melissa officinalis, Mentha piperita, Thymus vulgaris, Origanum majorana, Sideritis raeseri, Ocimum basilicum, Pistacia lentiscus, Crocus sativus, Daucus carota) may act against lipid or carbohydrate metabolic disorders through their antioxidant, anti-inflammatory or other properties, or due to the beneficial actions of their compounds. New horizons are very promising, since these plant species have been used both in Traditional Medicine and in current clinical practice.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:_8F20clBW_QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "\"Of course it's true; I saw it on the Internet!\" critical thinking in the Internet era",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/769800.769804",
            "Abstract": "Students use the Net as a primary source of information, usually with little or no regard as to the accuracy of that information.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "ACM"
        },
        {
            "Title": "Why is the shape of the Web a Bowtie?",
            "Publication year": 2012,
            "Publication url": "https://repository.wellesley.edu/object/ir126",
            "Abstract": "The first time in Graph Theory a graph was characterized as\" Bowtie\" was in the seminal paper by Broder et. al. Though no textbook had ever mentioned this type of graph before, no less an important network than the Web Graph itself is supposed to resemble this shape. In two large collections of crawled Web pages and in numerous smaller collections, researchers discovered Bowties and Bowtie-looking graphs by studying millions of web pages. But why do collections of Web pages resemble a Bowtie? The short answer is\" because, given the way the Web is created, that's the only shape it could have\". This paper shows why this is the case and presents an algorithm and software to visualize Bowtie graphs.—Citation: Metaxas, Panagiotis.\" Why Is the Shape of the Web a Bowtie?\" World Wide Web (WWW) Conference, WebScience Track, Lyon, France, April 2012.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:RMgMIBzvq-4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Limits of electoral predictions using twitter",
            "Publication year": 2011,
            "Publication url": "https://www.aaai.org/ocs/index.php/ICWSM/ICWSM11/paper/viewPaper/2862",
            "Abstract": "Using social media for political discourse is becoming common practice, especially around election time. One interesting aspect of this trend is the possibility of pulsing the public’s opinion about the elections, and that has attracted the interest of many researchers and the press. Allegedly, predicting electoral outcomes from social media data can be feasible and even simple. Positive results have been reported, but without an analysis on what principle enables them. Our work puts to test the purported predictive power of socialmedia metrics against the 2010 US congressional elections. Here, we applied techniques that had reportedly led to positive election predictions in the past, on the Twitter data collected from the 2010 US congressional elections. Unfortunately, we find no correlation between the analysis results and the electoral outcomes, contradicting previous reports. Observing that 80 years of polling research would support our findings, we argue that one should not be accepting predictions about events using social media data as a black box. Instead, scholarly research should be accompanied by a model explaining the predictive power of social media, when there is one.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:YvgfBAebZEkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The fake news spreading plague: was it preventable?",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3091478.3091523",
            "Abstract": "In 2010, a paper entitled\" From Obscurity to Prominence in Minutes: Political Speech and Real-time search\" won the Best Paper Prize of the WebSci'10 conference. Among its findings were the discovery and documentation of what was labeled a\" Twitter bomb\", an organized effort to spread misinformation about the democratic candidate Martha Coakley through anonymous Twitter accounts. In this paper, after summarizing the details of that event, we outline the recipe of how social networks are used to spread misinformation. One of the most important steps in such a recipe is the\" infiltration\" of a community of users who are already engaged in conversations about a topic, to use them as organic spreaders of misinformation in their extended subnetworks. Then, we take this misinformation spreading recipe and indicate how it was successfully used to spread fake news during the 2016 US Presidential Election. The …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:Ow2R9nchCv8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "How to create a smart mob: Understanding a social network capital",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.177.4836&rep=rep1&type=pdf",
            "Abstract": "This paper explores the creation of smart mobs and their ability to gain knowledge, social capital, and expand individual authority through participation. The evolution of smart mobs through computer-mediated communications has extended and expanded the traditional realm of individual influence and authority. In the decade since Rheingold identified smart mobs, this type of behavior has continued to grow and expand, influencing social, political and economic domains. But what makes or breaks a smart mob? Researchers in the last decade have tried unsuccessfully to identify their key components. This paper offers a “recipe” for creating smart mobs, by discovering the must-have characteristics that are necessary for their success: Desire for Communication; Affordable Communication Devices; Opportunities for Instantaneous Communication; Shared Goal; and Small Time Frame. In conclusion we propose that the future of effective smart mobs can be based on a template that has been successfully implemented since 2008, and that as individuals gain authority through the vehicle of smart mobs, governments will have to re-define their role in response to the collective action facilitated by smart mobs.",
            "Abstract entirety": 1,
            "Author pub id": "7tc03WEAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The power of prediction with social media",
            "Publication year": 2013,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/IntR-06-2013-0115/full/html",
            "Abstract": " – Social media provide an impressive amount of data about users and their interactions, thereby offering computer and social scientists, economists, and statisticians – among others – new opportunities for research. Arguably, one of the most interesting lines of work is that of predicting future events and developments from social media data. However, current work is fragmented and lacks of widely accepted evaluation approaches. Moreover, since the first techniques emerged rather recently, little is known about their overall potential, limitations and general applicability to different domains. Therefore, better understanding the predictive power and limitations of social media is of utmost importance.  – Different types of forecasting models and their adaptation to the special circumstances of social media are analyzed and the most …",
            "Abstract entirety": 0,
            "Author pub id": "7tc03WEAAAAJ:hTqO-V9ugBQC",
            "Publisher": "Emerald Group Publishing Limited"
        }
    ]
}]